[{"title":"Linen from India?","post":"I did some research and found nothing about linen in ancient Índia. The Saint Thomas Christians in South Índia began with the Jewish-Christians called “Nasranis”. Today the world’s youngest cardinal Mar Isaac Cleemis Thottunkal belongs to this community, divided into Catholic (Syro-Malabar,Syro-Malankara and Latin rites),  Mar Thoma, Jacobite, Assyrian, Syrian Orthodox, and Church of South India Churches.\n\n","date":"October 14, 2015 at 10:23 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212484","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"Dear friends,\nthere are a lot of unsolved problems…\nHere a vague example:\n“Was the Manopplello’s Veil a byssal veil\n(composed by weaved threads of silkmarine byssus)\ncoming from Mediterranean Sea or not?”\nSo…\nWhere is the right way that we have to follow\nabout the other more important problems?\nIn my opinion linen … coming from Syria, from India\nor from Egypt (this last seems to be less credible)\ncannot change the main problem:\nthe exact individuation about an useful solution\nfor the great old problems:\n“What is the right action that we have to do in\norder to demonstrate the true epoch?”\n“How to find the exact BIF (Body Image Formation) pathway?”\n“Which is the best Lab?”\nWhat is the best mental behavior?\nA sort of ecstatic waiting time?\nHave you a new vision?\n—- —\nOften can be difficult to exchange some simple messages, communicating in a fast manner.\nFor example:\nYesterday I wrote a private message about\nthe (minor) problem of “ATR-FTIR calibrations and\nprevious Fanti’s measurements” (because I had\nsome doubt regarding the exactness of this\n“ATR-FTIR Shroud dating system”…).\nToday (until now) I have not yet received an\nuseful answer (perhaps I had my e-mail box full of\nmessages [!] and then it was impossible to receive new posts…\nThis can be an example of simple solution about a question!).\n— — —\nHere another question.\nI think it’s possible to compile a protocol to\ncharacterize mechanical properties of linen fibrils\nby means of microindentation using an Atomic\nForce Microscope (AFM) and other\nnon-destructive ways (…for example:\nan “AFM three-point bending test”, etc. …).\nWhat is your opinion?\n— —  —\nHere what I can say returning on the main\nargument of this “Linen from India?”:\nIf “the authors suggested that the DNA evidence\nlinked to people from India hints that the shroud\nmay have been weaved there…”\nthen we have to deepen this new problem\nusing genetic tools also on Oviedo’s Cloth linen\nand then comparing the results obtained…\n— —\nRegards,\nPiero\n\n","date":"October 14, 2015 at 10:50 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212488","author":"piero","site":"shroudstory"},{"title":"Linen from India?","post":"Piero\nDNA studies were being conducted, supposedly linking the Nasranis, first-century Jewish Christians, who arrived in Índia probably after Saint Thomas, to the Essenes. They are fully Christian but maintain some Jewish customs, and are mixed with people from other Christian communities in India because Christianity is string in the state of Kerala.\n\n","date":"October 14, 2015 at 1:38 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212493","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"I love speculative history, especially the part where it has absolutely nothing to back it up….\n\n","date":"October 14, 2015 at 2:13 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212495","author":"Nabber","site":"shroudstory"},{"title":"Linen from India?","post":"I do not see how the detailed history of early Christianity in India might relate to the possible origins of the Shroud cloth in India, except only to indicate that there was communication and transport between India and the Middle East, and consequently trade.  This is already well-known through the alternative route of the Silk Road, but the article referring to a sea route is certainly an interesting speculation.  \nI’ve occasionally mentioned on this site previously, that it was not necessary for the cloth to have originated in the Middle East, but in view of the active trade routes and the presence of far-flung Roman garrisons throughout the empire, that the cloth might well have come from anywhere between ancient Gaul and Afghanistan or even China.  In the 4th century BC Alexander had ventured as far east as the Indus Valley. \nThe knowledge of Linen is very ancient and was widely known throughout most of the ancient civilisations, dating back to at least the 5th millenium.  An interesting brief article on the history and other aspects of linen by Janis M James can be found at:\nhttp://timeless-creations.ca/Linen.pdf . \nSample extracts:\n“Domestication of fiber flax to say nothing of seed flax occurred in India and China before that of cotton – more than 5,000 years ago. Some scholars believe that flax originally came from western Persia and spread over to other countries regarded to be the regions of early flax cultivation – India, China and Central Asia and westwards and southwestwards, primarily, to Babylon and Egypt. ” … … \n” … … In the regions of early flax cultivation in Central Asia (Afghanistan, mountainous areas\nof Bukhara, and Turkmenistan) flax cultivation has remained primitive until the turn of the 20th century. /   Flax has been known in Russia since 2000 B.C. Ancient manuscripts of the 9th-10th century B.C. contain evidence of linen made by Slavs. … … ” \nJames also has an interesting picture of some modern linens, but they are based on some ancient patterns which are quite intricate.  \nIf it were possible to find some DNA traces in the fibres of the Shroud cloth, then we might speculate on whether it would be possible to identify the likely or feasible origins of the flax.\n\n","date":"October 14, 2015 at 2:15 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212496","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Linen from India?","post":"Why in 325AD (about 300 years after death of Jesus) dominant Christians in Rome ignored or forget to imnclude mission of St Thomas in India?\nAs Daveb said there was communication and transport between India and the Middle East, and consequently trade. Not only with India, middle East also had trade with Sri Lanka (Ceylon) as well.\n\n","date":"October 14, 2015 at 3:45 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212498","author":"Sampath Fernando","site":"shroudstory"},{"title":"Linen from India?","post":"Hey Sampath – Forgot to include India in what? The Indian Christians were long since under Persian bishops, and the Pope had a lot more problems close to home to worry about, like how to avoid becoming lion-chow.\n\n","date":"October 14, 2015 at 4:26 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212500","author":"Jim Giordano","site":"shroudstory"},{"title":"Linen from India?","post":"Sorry in New Testament.\n\n","date":"October 14, 2015 at 4:59 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212507","author":"Sampath Fernando","site":"shroudstory"},{"title":"Linen from India?","post":"Does anyone know how much of the material found at Masada has been identified as of non-Israeli/Palestinian origin?\n\n","date":"October 14, 2015 at 4:20 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212499","author":"Hugh Farey","site":"shroudstory"},{"title":"Linen from India?","post":"It is clear that the material found in Masada is not similar to the Shroud linen.\n\n","date":"October 14, 2015 at 4:37 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212504","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"That’s not the point I was wondering about. I was wondering what the evidence was of any foreign textile being used in Judea at the time. It is easy to say what might have been, but it is more convincing if we could say that it was common, or even occasional, rather than the Shroud being the sole example. If so it be.\n\n","date":"October 14, 2015 at 5:24 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212512","author":"Hugh Farey","site":"shroudstory"},{"title":"Linen from India?","post":"I think Shamir Orit’s paper, presented at the Bari congress should help.\n\n","date":"October 14, 2015 at 5:31 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212515","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"Sampath, you are wrong. The “dominant Christians” in Rome were getting used to life out of the catacombs, they did not know anything about Thomas and India.\nWhile writing as a professional journalist with expertise in history and religion, including ancient India, I had occasion to delve into rare photographs and documents, the result being an article that was published in a leading daily and preserved in a university library for reference.\nI have more, concrete, information and will work on this when I have time as I will soon be in radio silence for some days – working on another project.\n\n","date":"October 14, 2015 at 4:28 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212501","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"Hi Louis – What about your views regarding compilation of New Testament? If they have come out from catacombs then how did they selects 29 books out of many. Why they discard so many?\n\n","date":"October 14, 2015 at 4:43 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212505","author":"Sampath Fernando","site":"shroudstory"},{"title":"Linen from India?","post":"Because, if you read them, you will clearly realize that those unselected (apocrypha) are inferior and secondary to those selected into NT canon.\nAs to India, and generally countries east of the Roman Empire (with possible exceptions of Georgia and Armenia), the Greek-Roman world knew actually very little about them. It was largely a fantasy-land. Almost the whole historiographic tradition of the West comes from Greek & Latin sources (and a liitle syriac, georgian and armenian). There are virtually no Persian historiography extant. And as to India, with a couple excpetions, there are no written history books (in Herodotus or Livy style) from there up to about 1200 AD (the muslim expansion), when an in Europe, an ordinary knight like Robert de Clari could write his own chronicle of the 4th Crusade. Simply, there were no (or very little) historiographic tradition outside Greek-Roman world (and China far to the east).\n\n","date":"October 14, 2015 at 5:17 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212511","author":"O.K.","site":"shroudstory"},{"title":"Linen from India?","post":"You may be correct OK but St. Thomas must have sent some sort to progress to Jerusalem (to James). So today we can’t read any of those historical documents from early church. Most probably those documents must have got destroyed in 70AD.\n\n","date":"October 14, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212514","author":"Sampath Fernando","site":"shroudstory"},{"title":"Linen from India?","post":"Sampath:\nhttp://www.nasrani.net/2008/09/20/letter-of-st-thomas-the-apostle-to-edessa-from-india/\nother than the link on the New Testament, posted below.\n\n","date":"October 14, 2015 at 5:38 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212516","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"Sampath,\nThat was decided at the Council of Nicaea, presided by the emperor Constantine, in the year 325. I don’t know what he was doing there, since he was not even baptised then.There were about a thousand bishops there, from different regions in the Near East and so on. They were worried about fringe groups like the gnostics.\nI generally don’t like to stray from the topic, so let us concentrate on the “Nasranis” to see how they got to India — via Iraq and Syria. There is a synagogue-style church in Kerala.\n\n","date":"October 14, 2015 at 5:11 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212508","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"Sampath, regarding the New Testament and the 29 books you asked about, you will find the complete picture here, provided by one of the twentieth century’s greatest bibical scholars:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\n\n","date":"October 14, 2015 at 5:17 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212510","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"I don’t see that very much of the above discussion has anything to do with the posted article at all, the possibility of an Indian provenance for the Shroud cloth; not the early Church in India, lions eating Christians in Rome, nor the compiling of the New Testament and its associated apocrypha.  \nHugh Farey alone has raised a relevant issue, the question of whether imported cloths were present at Masada.  When a year or two ago, I raised the issue of Diana Fulbright’s paper on the complex weaves evident at the Akeldama site, which included some at Masada, Charles Freeman jumped down my throat asserting that the majority of these were imported and few were in linen.  In fact, Fulbright’s paper gives citations indicating that some of the cloths were indeed imported.  Frankly, given the trade known to have occurred along the Silk Road, together with far-flung Roman garrisons, Jospeh’s original shroud cloth might have come from just about anywhere within the Old World, including Asia and the Russias.  Direct contact was unnecessary, as the trade caravans commonly occurred in relay sections, a bit like changing horses in mid-journey (or I suppose camels).   The presence of imported cloths from faraway places in the ME of the first century cannot be a contentious issue.\n\n","date":"October 14, 2015 at 6:13 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212519","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Linen from India?","post":"Unfortunately this blog continues allows amateurs to provoke professionals in the field and people responding to queries addressed to other bloggers, which is bad manners.\nThere are people who think that there was just one “route”, the main route through which everything was chanelled! My paper will be ready the soonest possible.\n\n","date":"October 14, 2015 at 6:51 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212520","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"The same frequently complains when the thread goes off-topic.  I knew when I mentioned it, that the usual pompous response was predictable.\n\n","date":"October 14, 2015 at 7:06 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212522","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Linen from India?","post":"Dan, have you read the above provocation? Didn’t I tell you warn you that the man doesn’t learn from mistakes? There is something seriously wrong here. Could you please check into it?\n\n","date":"October 14, 2015 at 7:25 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212524","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"Louis, Daveb was right to point out that the topic post is about the linen on the Shroud possibly being of Indian origin. This has nothing to do with the spread of Christianity to India et al. How was that provocative of him to simply mention it?\nAnd if the professionals here cannot easily dismiss the ravings of upstart amateurs, then perhaps they are not as professional as they believe.\nTo be honest, I’ve noticed your tendency to swerve the post topics toward your favourite domain of religious/Biblical history and musings on modern monotheistic culture. Interesting they may be, but they do tend to sidetrack the main discussion – as this thread demonstrates.\nBy the way, there is no such thing as an amateur thinker. Even an amateur can ask a wise question. I sincerely look forward to your upcoming article(s).\n\n","date":"October 15, 2015 at 8:42 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212557","author":"David Goulet","site":"shroudstory"},{"title":"Linen from India?","post":"David, did you read my comments addressed to Sampath above? I guess you didn’t. It refers to something that was published and says that the next article will go further. It was necessary to say something about the Nasranis, Jewish-Christians, who probably followed the apostle Thomas to Índia.  If you are smart, you will understand.\nReligious/biblical history is not my “favourite domain”, it is my área of expertise, having published dozens of articles on the topic. What ravings of an upstart amateur was not dismissed? If you had read the blog carefully if you notice that quite recently my comments were rehashed and used by the man you defend and passed off as his own. He also has the tendency to read comments I havê posted to then base himself on these.\nThe man you defend hás also been picking on me ever since\nI began posting on this blog. My bet is that he will continue to do só – and he will get what he deserves.\nI will shortly be in radio silence because of another project, which perhaps you will be able to read when ready.\n\n","date":"October 15, 2015 at 1:52 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212579","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"On behalf of all the amateurs whose professionalism is often denigrated by ‘professionals’, may I be so bold as to enquire how professional Louis actually is? An handful of self-published essays, book reviews and interviews are all I can find on the internet, and of those, only the ones advertised at length in his comments on this blog have been read more than a few dozen times. Entering “Louis C. de Figueiredo” on Google seems at first to produce about 880 results, but clicking on the last page of this we find that there are in fact only 25, none of which tell us more than we have read here.\nI wouldn’t have raised the issue, except that placing oneself on a professional pedestal (“writing as a professional journalist with expertise in history and religion”) in order to give oneself authority, especially if that position is used to denigrate the opinions of others not so elevated, cannot but invite some curiosity from the denigrated.\n\n","date":"October 15, 2015 at 6:00 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212546","author":"Hugh Farey","site":"shroudstory"},{"title":"Linen from India?","post":"I think Hugh is not the right person to preach ethics on this blog since he hás never been bothered with the fact that many prominent Shroud scholars and scientists have, till some time ago, been the target of character assassinaton. On the contrary, he continued to exchange comments with them, encouraging them in the process.\nTo give just one example, he knows that an Oxford scholar, who we needed here, was forced to leave the blog in disgust as a result of the comments of the person who he defends, who hás also been targeting me endlessly, wanting to play the role of prima donna.\nFurther, he takes it for granted that what is online is the only material I havê published. He does not know that it is not even 5% of what I havê published.\nFurther, he is now a self-appointed judge,talking “on behalf of the amateurs”. As a journalist, I receive information, also going beyond the realm of Shroud studies, which I cannot reveal. It is a question of ethics, which does not seem to be part of Hugh’its baggage. Not long ago he revealed the contents of an e-mail message he received from Archbishop Marcel Sanchez Sorondo, Chancellor of the Pontifical Academy of Sciences, which was not all necessary and should not havê been done for obvious reasons. It is the stuff of people who indulge in vatileaks.\nMy advice to Hugh is to go beyond theatre and try and publish at least one paper in a scientific journal. He must remember that there are people who want him dismissed as editor of the BSTS newsletter.\nIt is always better to think before leaping.\n\n","date":"October 15, 2015 at 6:51 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212549","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"Yes, I know there’s lots of things wrong with me, Louis, but I was asking about you. I don’t wish to denigrate you, and nor do I take for granted that most of your publications are not available via the internet. I don’t even know who you mean by “an Oxford scholar”. I’m afraid I recognise people by their names, not the places where they work. Nor am I judging you, on behalf of amateurs or anybody else. I’m merely wondering the basis upon which you, often, assume an authority over us amateurs simply by virtue of being a ‘professional.’\nAnd now I know. Thank you. You’re a professional journalist. I should be delighted to submit a paper to which ever journal you’re a journalist for, if you feel able to reveal it.\n\n","date":"October 15, 2015 at 9:21 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212561","author":"Hugh Farey","site":"shroudstory"},{"title":"Linen from India?","post":"Hugh, I am used to English subtlety and sarcasm and do not like it. You must havê noticed thatI speak my mind. I also havê noticed that you sometimes post comments as though it is a source of entertainment. Haven’t you read Ian Wilson, who preceded you as editor of the BSTS newsletter? That no-nonsense style is what I like.\nI will not repeat over and over again what and where I havê published. All I will say now is that some articles published in leading dailies are preserved for reference in an university library and the library of a very important institution. Due to the nature of some of the topics I wrote on privacy is a necessity and I am not obliged to reveal everything people might like to know. I hope you will understand and there will be no need to mince words.\nAs for the highly qualified Oxford scholar, he was driven out of the blog by the man you defend. He left in and disgust and made it clear that he did not want his name mentioned on this blog. I understand his feelings and respect them.\nYou should look for a journal in England yourself if you want to published something.\n\n","date":"October 15, 2015 at 3:10 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212587","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"“I will not repeat over and over again what and where I have published.” Yes you will. You will direct our attention towards your interviews with Giulio Fanti and Paolo di Lazzaro, and your paper on Jung, again and again, as you have so many times before. What you will not do is explain how your professional expertise gives you more authority to speak on anything than Daveb, Sampath, myself or anybody else who comments on this blog.\nAnd who is this “man I defend”? I defend nobody. I defend ideas, not people, regardless of their source, if they seem to me reasonable inquiries into the Shroud of Turin. \nAs for “He must remember that there are people who want him dismissed as editor of the BSTS newsletter,” I dare say you are correct. My email address is openly available, and my editorship transparent to the world with every update of shroud.com. If anybody wants me dismissed they are very welcome to let me know, but nobody has yet, even though the vast majority of the BSTS are authenticists, and know very well that I am not. Why do you think that is? I hope is it because they trust me to present all aspects of research into the Shroud impartially, and to treat everybody generously and respectfully, as I think the founder of my religion would approve.\nForgive me if I do not have a lot of time for all your secrecy and innuendo. If it was really important you wouldn’t go on, and on, and on, about it. You would keep it secret, and not try to impress us with “a very important institution” and “a highly qualified Oxford scholar” and “privacy is a necessity” and all that cloak and dagger stuff.\nI say forgive me because for all I know, you may indeed have all this secret professionalism you claim. It’s just that I take as I find, not as I am told. \nAnyway, I think these three posts have said what I feel needed to be said, so I’ll stop now.\n\n","date":"October 15, 2015 at 5:29 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212599","author":"Hugh Farey","site":"shroudstory"},{"title":"Linen from India?","post":"Please respect people in your comments, Hugh. Who appointed you as judge on this blog, now cunningly using the tactic of pitting one commenter against another? You may fool others but you don’t fool me. None of the other commenters you mentioned have worked professionally in the fields in which I write. Do you get that?\nI think you have not been dismissed as editor of the BSTS newsletter because nobody wants the job. Might I say that you do not even have sound judgement? You demonstrated that by making public the contents of the message you received from Archbishop Marcelo Sánchez Sorondo, Chancellor of the Pontifical Academy of Sciences, indulging in “Vatileaks”. So much for one who calls himself a “core Catholic”. Are you sure you have read the relevant Shroud literature? Have you read what transpired in 1988 that made Cardinal Anastasio Ballestrero regret his approach? \nPlease behave yourself and stop using terms like “secrecy and innuendo”, remembering that it was you put your nose into a discussion that had nothing to do with you. Do you really understand English or do you speak some Welsh dialect? There is no “cloak and dagger” stuff, which is part of your seemingly paranoid mentality. Please read my previous comments carefully and remember that what is posted on a blog are public statements. If you want to create problems for me because of the nature of some of the things I have to write, putting me in a dangerous situation, I will create problems for you with the police authorities in England with the help of investigative journalists. Is that clear? \nYou have a lot of thinking to do.\n\n","date":"October 15, 2015 at 6:27 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212604","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"Dan I think it’s time to step in here and redact the threats being made by Louis. Unacceptable.\n\n","date":"October 15, 2015 at 7:07 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212608","author":"David Goulet","site":"shroudstory"},{"title":"Linen from India?","post":"David, please mind your own business. Have you read the entire thread? Who started the ugly discussion? I will not swallow any insults, insinuations, comments putting me in a dangerous situation.\nDan is the moderator and he allowed the discussion to flow freely. I asked him to intervene, but he didn’t do so. Then Hugh got into the discussion and made things worse.\n\n","date":"October 15, 2015 at 7:19 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212609","author":"Louis","site":"shroudstory"},{"title":"Linen from India?","post":"… And … if the Shroud had been a gift of the Magi?\nIf we wanted to remain consistent to the narrative\nof the Gospels then this idea does not seem to be likely.\nAnyway … now I want to make clear that with a\ndifference about the origin of weaving (for example:\nin Israel and in India!) for Sudarium of Oviedo and\nShroud, this “possible fact” does not mean anything in\nterms of possible authenticity … These stories seem\nto be only interesting subtle differences and\nand they are not significant about the “two main Misteries”:\ntrue age (= Which epoch?) and Image Formation Process\n(…then, unless there are other pieces to complete\nthe puzzle, we can say nothing [= “Where\nof one cannot speak, thereof one must be silent”.\nOr: “What we cannot speak about we must pass over\nin silence”.= Wittgenstein]!).\nI see that now (unfortunately …) the discussion\ntends a bit to degenerate (and, by the way,\nno one wanted to listen to my feeble warning\nabout the ATR-FTIR measurements …\n[and perhaps that problem too it is getting old\nand with a white beard …]). \nUntil now we have not yet seen the birth of a\npowerful “Society for the Suppression of the\nRelics Trade and/or Manipulation” that can\nbe able to investigate in an useful manner on ancient relics…\nThere are a lot of John the Baptist’s relics\n(a possible “useful source of DNA”…).\nIn any case “…Dr Kazan’s expertise is archæological,\nand specifically he knows a lot about reliquary\ntypes and designs, especially in the Byzantine world…”\nLink:\nhttps://tenthmedieval.wordpress.com/tag/biblical-archaeology/\n…But falsification can also be:\nmanipulating research materials,\nequipment, or processes …\n— — —\nIn Italy there is an interesting new book written by\nEnrico Bucci with some useful lines of reasoning.\nTitle: “Cattivi scienziati” (= “bad scientists”)…\nYesterday I have read the recension written\nby F. Vaccarino (a prof. of Math – Turin Polytechnic).\nTitle of the article: “Anche in laboratorio\nsi bara, ma i nostri anticorpi funzionano.\nParla Enrico Bucci, il ricercatore che svela le frodi scientifiche.”\nHere a rough translation (warning for: “bara” = In this case it’s\nnot “a coffin” [and, instead, https://translate.google.com/#\ntranslated in a bad manner that word…], but a verbal\nexpression meaning “faking”):\n“Even in the laboratory you can fake,\nbut our antibodies work.\nTalk Enrico Bucci, the researcher who\nreveals the scientific fraud”… !\nThere are plagiarisms and manipulations …\nand also ways to get around the controls.\nIn short, a phenomenon that now affects\neven the world of research (which is exposed\nto the pressures of global competition =\n“publish or perish”, etc. As we have already\nhad some “reading occasion” on this blog…).\n\n","date":"October 15, 2015 at 11:14 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212568","author":"piero","site":"shroudstory"},{"title":"Linen from India?","post":"We are leaning from each other. So I respect everyone.\nPiero – And … if the Shroud had been a gift of the Magi?\nFrom where did they come to Bethlehem?\nHow did Magi came to see Jesus. Did they walk? Did they come by Camels? or Did they come by some sort of Horse cart?\nNo one knows definite answers to those question. Same way no one know how that linen cloth came to Jeruselem. Joseph of Arimathea must have paid paid a lot of money to buy that linen cloth. It must be very special one for him. He may have already bought that thing for his burial as he already had a newly constructed tomb. So he may have used that linen cloth to cover the body of Jesus as a respect.\nFor me there is no doubt that the linen cloth came from Idia as confirm by DNA. \nAnother thought is that when they covered the body of Jesus that linen cloth may very wet due to heavy rain at that time. So another possiblity that they did not washed the body of Jesus but they wrapped the body of Jesus using a very wet linen cloth.\n\n","date":"October 15, 2015 at 9:16 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212622","author":"Sampath Fernando","site":"shroudstory"},{"title":"Linen from India?","post":"I think people here take themselves far too seriously! We are talking about a piece of cloth!\nwho cares if it isn’t authentic? Or vice versa? If you cling to the Shroud for your faith then your faith is not very deep.\n\n","date":"October 16, 2015 at 1:08 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212633","author":"Thomas","site":"shroudstory"},{"title":"Linen from India?","post":"I’ve been thinking about retiring from blogging sometime next year. Now I’m giving serious thought to doing so earlier.  Of course I’d shut down commenting even as I leave the blog up for posterity. We’ll see.\n\n","date":"October 16, 2015 at 7:02 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212649","author":"Dan","site":"shroudstory"},{"title":"Linen from India?","post":"Dan,\ndo not leave, do not abandon us!\nThere may still be many surprises\nin the field of studies about the Holy Shroud …\n— — —\nB.T.W.:\nDan,\nHave you tried to hear what\nMarco Leona (the director of scientific research\nof Metropolitan Museum of Art, in New York) can\nsay to us about the interesting SERS controls?\n\n","date":"October 18, 2015 at 8:27 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212889","author":"piero","site":"shroudstory"},{"title":"Linen from India?","post":"That would be a great loss to the Shroud world, Dan. Regardless of all problematic issues with commenters (what was to be expected regarding such extremely controversial matter as the Shroud), you created a great platform, where interested people, no matter their background, nationality, age and education, can exchange their views, knowledge and opinions on the Shroud, interact with each other, and even participate. This is extremely boosting for new views, new insights, deepening knowledge, introducing new ideas, making the research on the Shroud carry on.\nThis blog really has potential to be the leading place for the scientific developments on the Shroud -no matter personal quarrels that happen from time to time. Without it, we all would be limited to a bunch of books, articles, and about quarterly update on Barrie’s site. Instead of pursuing new views, we would all be fossilized to a few old ideas we read in the old publications on the Shroud.\nAnd perhaps a few people without new insights would prefer that…\nI do not.\n\n","date":"October 16, 2015 at 11:20 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212668","author":"O.K.","site":"shroudstory"},{"title":"Linen from India?","post":"Well said, OK. Very well said.\n\n","date":"October 16, 2015 at 11:45 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212670","author":"David Goulet","site":"shroudstory"},{"title":"Linen from India?","post":"Dan please continue your blog. I learnt everything about the Shroud of Turin from this site.\n\n","date":"October 18, 2015 at 3:45 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212925","author":"Sampath Fernando","site":"shroudstory"},{"title":"Linen from India?","post":"Interesting.  I have always heard cloths like the Shroud are made in Syria today the same way they were made 2000 years ago.\n\n","date":"October 16, 2015 at 8:56 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","id":"comment-212732","author":"Dcn Andy","site":"shroudstory"}]
