[{"title":"Update Again on the Gospel of Jesus’ Wife","post":"I can in no way thing of any reason why Jesus would have a desire to marry.  Why would God marry ?  It makes no sense.\n\n","date":"February 22, 2015 at 6:18 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191547","author":"Emmett McMahon","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Thanks for posting this, Dan.\nWe must remember that the Creed says, “true God and true man”, with reference to the two natures. As a man Jesus would eat when he was hungry, drink when he wanted to do so (much more than John the Baptizer), sleep when he was tired, and so forth. He could thus marry.\nThe Mary Magdalene issue came under the limelight with the so-called Jesus family tomb, proposing that all the “family” members were buried in Talpiot. However, this book and documentary are agenda- driven. They were also meant to try to demonstrate that as a rabbi Jesus would have to marry.\nThe problem is that Jesus was not a rabbi in the conventional sense, he could only have been a rabbi in the broad sense. He assumed more than one role in his earthly ministry. Why should he have to be married? Jeremiah was single. Was John the Baptizer married? Did he pitch a tent to live with a wife in the wilderness?\nThe tomb topic caused such a sensation that the Princeton conference was held in Jerusalem. It was then that I asked Father Joseph A. Fitzmyer, SJ, Emeritus Professor of Biblical Studies at Catholic University of America, Washington DC, if he would attend. He told me that he wouldn’t although he had been invited, in fact he was coming close to retirement then.\nEarlier, Father Fitzmyer had been invited to examine the Aramaic inscription on the “James ossuary” on display in Toronto. The ossuary had been the topic of a book by Hershel Shanks and Ben Witherington III, an interesting work,with some unjustified conclusions. He also reviewed the book on the “Jesus family tomb”. His points of view, as one of world’s top biblical scholars — who translated ancient Aramaic, Hebrew, Syriac, Greek and Latin texts into English — were of paramount importance.\nThe truth about what can be learned about Mary Magdalene ( Father Fitzmyer’s interpretation of ancient Greek texts and review of a book that appeared after the Princeton conference) can be found in the following:\nhttps://www.academia.edu/7556467/Jesus_was_not_buried_in_Talpiot_-_Parts_I_and_II\nand:\nhttps://www.academia.edu/7556467/Jesus_was_not_buried_in_Talpiot_-_Parts_I_and_II\nKaren King has been pushing her agenda-driven hypotheses a bit too far. One has to be careful with papyrii that come from “anonymous figures” (see the post above) as well as with unprovenanced artefacts relating to biblical archaeology that appear once in a while in Israel.\n\n","date":"February 22, 2015 at 10:12 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191558","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Part III can be found here:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\n\n","date":"February 22, 2015 at 10:17 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191560","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"The Coptic fragment forgery was quite cleverly done.  The papyrus C14 dating was I think about 4th century, and the ink analysis suggested it was of ancient provenance.  Karen King is reported as having a feminist agenda, and so was a natural prime target for the deceit, and it seemed to have her fooled.  \nDespite all the agenda-driven conservative protests that no way could it be true, I was prepared to maintain an open mind on the issue until stronger proof came to light.  There was no doubt in my mind that Jesus was never married.  The silence in the gospels concerning a wife, was I considered sufficient evidence.  However many early Christian or quasi-Christian communities expected an early date for the parousia and refrained from marriage with the natural consequence that they eventually vanished.  It occurred to me, as I think it did to King, that if authentic the fragment might have been an attempt in such a community to justify marriage, and that it is all that it could mean, certainly not that Jesus himself was married.  \nHowever, one purpose of an open mind is to be able to close it when sufficient evidence comes to light.  The paper reported by CNN does that, and it seems to have been quite a clever piece of detective work.  The fragment includes text from a known forgery, an alleged Gospel of John in a rare Coptic dialect, which died out in the 6th century, but that particular papyrus was dated to the 9th century.  \nThe anonymous provenance of the fragment, and the lack of companion fragments, certainly made it suspect.  However there now seems little doubt that it was indeed a forgery.  I see no connection with the Talpiot case.  It is merely a case of forgers exploiting a lucrative market for seemingly ancient scriptural fragments, particularly if they can create a topical sensation.\n\n","date":"February 22, 2015 at 2:42 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191580","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Hi David\nIt seems that you were sort of forced to change your mind! See your comments on shroudstory, 2014:\nApril 10, 2014 at 7:54 pm\nReply\n“Suspicion concerning Karen King’s agenda is no proof of forgery, nor is lack of provenance.”\nI insisted, right from the beginning, that Karen King’s agenda, and her insistence, was the key to the apparent forgery. Provenance is extremely important in biblical archaeology and a lot of dirty business goes on. It was thus gratifying to hear Professor Stigler, at the University of Chicago, saying exactly what I was thinking when it came to Talpiot (See Part III above).\n“*I see no connection with the Talpiot case”\nOf course there is a connection, it is the hidden agenda industry. That is why I wrote above:\n“Karen King has been pushing her agenda-driven hypotheses a bit too far. One has to be careful with papyrii that come from “anonymous figures” (see the post above) as well as with unprovenanced artefacts relating to biblical archaeology that appear once in a while in Israel.”\nThe “James ossuary” is one such artefact. In this case, too, I wrote a piece pointing out why the second part of the inscription was written by a different hand. It went online three months before the IAA officially dismissed the claim that it had held the remains of James the Just.\nRemember, there is something called intuition…… Coupled with some insight, it can give good results.\n\n","date":"February 22, 2015 at 3:10 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191582","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Louis, I stand by what I said earlier, and also what I’ve said now.  Tuition is good and can lead to fruitful speculation for further investigation, but until it’s tested it’s still not proof.  That has now been done.\n\n","date":"February 22, 2015 at 4:49 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191588","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Typo: Intuition …\n\n","date":"February 22, 2015 at 4:50 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191589","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"David, you were defending Karen King while I was challenging the forgery she was promoting right from the beginning. Sorry, you must admit defeat.\n\n","date":"February 22, 2015 at 5:07 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191590","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Admit defeat. What is this…high school? Discerning the truth is not a game of wins and losses. This ‘winner/loser’ attitude from academia is why confirmation bias is the great threat it is on these blogs. Knowing the truth is reward enough.\n\n","date":"February 22, 2015 at 9:29 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191606","author":"David Goulet","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Thank you David G, my sentiments too.  Karen King has her own perspectives honestly held. but she seemed to be approaching the object put to her in as professional a manner as she was able, within those perspectives.  And that’s all there was to defend.  Others had their opinion, but they were just as agenda-driven as any other.  Anyone can be a target for gulling.  Truth eventually won out;  It might just as easily have fallen the other way.\n\n","date":"February 23, 2015 at 4:34 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191624","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"David Goulet\nIt seems that you sometimes post comments as pastime, picking on people with nasty comments that can be provocative.\nLet me ask you the following:\n1) Have you read all the posts Dan posted on this topic?\n2) Have you read the articles on Talpiot?\n3) Have you read the exchanges?\n4) Are you a journalist writing on the topic of biblical archaeology, with published articles and interviews with top biblical scholars in prestigious dailies?\n5) Have you reviewed any books on the topic?   \nPlease refrain from hitting below the belly and stick to your field, which is computer technology.\n\n","date":"February 23, 2015 at 8:39 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191639","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"I’m just a person who tires of the one-upmanship that oft clogs this blog. I’m an expert of nothing (least of all computer technology) – relevant to the Shroud – but as this is a public blog that matters not. I’ve been following this blog for a few years now, reading all the posts and debates. And if my comments are that nasty or provocative I’m sure Dan will rap my knuckles. But perhaps I singled you out unfairly, for that I apologize.\n\n","date":"February 23, 2015 at 9:40 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191645","author":"David Goulet","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Sorry, from the exchanges above it is clear that defending Karen King right from the beginning was a waste of time.\n\n","date":"February 23, 2015 at 8:51 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191640","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"The Jesus’ wife is the Church.\n\n","date":"February 23, 2015 at 9:33 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191643","author":"Fabrício","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"That is the way Rome has always interpreted it, also referring to the institution as the mystical body. In this context, it dismissed the papyrus as fake, which is what I said right from the beginning.\n\n","date":"February 23, 2015 at 10:01 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191647","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"That’s alright, David, although you do not seem to have read the exchanges. It is not a question of one-manship. The debate is serious, if someone has towed the wrong line — evident in the exchanges right from the beginning — and reached a dead end it should be admitted.\n\n","date":"February 23, 2015 at 10:09 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191648","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Yes, I agree we must admit when we are wrong (certainly not an easy thing to do). But if we all (me included) can keep the discussions cordial and with less bluster (I’m not speaking specifically of you Louis) this makes it much easier to concede a point. It takes great humility to concede those points, as evidenced by Charles dogged defense of what is not a promising theory. The longer we hold to ‘defeated’ points the longer the distraction from gaining ground on the truth. The ideal climate for discussion is one that is open and charitable — even as it is focused on evidence. As a Christian I believe that Jesus won’t judge us on how ardently we stood for the Shroud, but how well we stood for each other during our mutual exploration of its mystery.\nEnough sermons from me. Let’s carry on with the meaty discussions.\n\n","date":"February 23, 2015 at 10:35 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191650","author":"David Goulet","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"OK, David. I could have been contested directly, not with comments dropping hints indirectly. Dan posted the piece of news after my suggestion. This a field in which I have been involved for a good number of years, also receiving books from publishers wanting to get either a “green” or a “red” signal for translation from me, having “Expert” written under my name by the editors of top dailies where my articles or interviews were published and so forth. It is a serious, professional engagement.\nThis experience was not acquired by reading encyclopaedias or books in libraries, it came when talking to world-renowned Biblical scholars and epigraphers, discussing authors and books with editors and directors of publishing houses, book reviews, articles.\nBy the way, now that you mention Jesus, I first believe in him, try my best to follow his teachings, and, I am not looking at the Shroud as a prop for belief in his Resurrection.\n\n","date":"February 23, 2015 at 11:20 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191656","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"I concede (agree), on all points. :)\n\n","date":"February 23, 2015 at 11:24 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191658","author":"David Goulet","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Thanks, David. Sorry, I thought your expertise was in the field of computers.\n\n","date":"February 23, 2015 at 12:11 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191661","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"L: ” Dan posted the piece of news after my suggestion.” \nSee Dan’s posting “The Latest News on the Gospel of Jesus’ Wife” of May 7, 2014, at:\nhttps://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/  \nI noted Louis had provided a recent comment there dated Feb 21, 2015, 4:56 pm referring to the CNN article.  I read the article authored by Baden (Yale) & Moss (Notre Dame), was impressed by it, and provided my response to Louis there on Feb 22, 2015 at 5:07 am.  The fact that we had both seen fit to comment on the article, may have influenced the decision for the present posting.    \nI note that first comment above by Emmett is timed at Feb 22, 2015, 6:18 am.\n\n","date":"February 23, 2015 at 2:38 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191667","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"D “… may have influenced the decision for the present posting”.\nDan is the right person to answer that.\n\n","date":"February 23, 2015 at 2:43 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191668","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"This was disproven centuries ago.  Why is this news?\n\n","date":"February 23, 2015 at 10:23 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191704","author":"Andy","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Andy:  I don’t think anyone in the debate, has ever argued that Jesus was ever married, including as it happens Karen King.  I have wearied myself repeatedly offering plausible explanations for such fragments suggesting he was, and am not going to repeat them again.  However a few of us prefer to have something more substantial to make critical decisions for rejection or acceptance of purported fragments, than mere agenda-driven religious extremists of whatever side, or for that matter even the gossip from a reputable journo’s OB network, no matter how sincerely such views might be held.  The Baden & Moss paper has now emerged, provides a good professionally arrived judgement, and is sufficient to corroborate the fact of fraudulence.  That is quite large step from merely having an uninformed opinion about the matter.\n\n","date":"February 24, 2015 at 6:16 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191721","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"The suggestion of posting this bit of news was sent by me to Dan, as he acknowledged above. Of course, there was an axe to grind: as one who has been writing and advising professionally in this field for many years as also rejecting the papyrus as a fraud right from the beginning — particularly on this blog —  it would be appropriate to post an update, given the previous posts.\nThere have been requests all along these years to give talks about the birth of Christianity and its significance today, but these have had to be turned down. People are advised about the best books to read, the authors on whom one can rely. Above all, they are also told what to dismiss without paying any attention — the papyrus in question among them.\n\n","date":"February 24, 2015 at 5:46 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191748","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"More rubbish on the Internet, coming from an amateur:\nhttp://www.salon.com/2015/02/27/9_things_you_think_you_know_about_jesus_that_are_probably_wrong_partner/\nThe Turin Shroud is mentioned and there is reference to Thomas Jefferson as a sort of biblical scholar (!).\nComments of 22 Feb. above had already addressed some of the points.\n\n","date":"February 27, 2015 at 8:33 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-191958","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"Great news:\nhttp://news.yahoo.com/origins-gospel-jesuss-wife-begin-emerge-115640514.html\nI, at least, always insisted right from the beginning that it was a fake.\n\n","date":"August 26, 2015 at 11:15 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-209025","author":"Louis","site":"shroudstory"},{"title":"Update Again on the Gospel of Jesus’ Wife","post":"I continue to stand by my position. There are just too many questions that remain unanswered to be in favour of authenticity and the big problem is the agenda behind the sensationalism — as usual.\n\n","date":"October 7, 2015 at 7:47 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","id":"comment-211963","author":"Louis","site":"shroudstory"}]
