[{"id":"comment-2466","author":"vincenzo_giovanni_ruello","post":"The picture is funny no its not me firstly if you want me to stay and asnwer questions be nice and civil to me or I’ll leave. I have explained on the clip which is now spreading around the net like a virus about the ripped toes how I develope the images. The secret is filming between angles of light and then overlapping the results which incredibly reveal the most brilliant images ever seen. I want to go to a pshyisist to learn exactly why it works. The discovery was made in 2009 while I was experimenting on my music clips I then used it on the Mary Zeitoun Egypt apparition photo have you seen that one look at the baby Jesus with the labels He came from that ghostly white image. The system works and I expected may I call you my peers and friends to ask questions. If I can gain some trust and respect I will tell you all exactly how to do it because since revealing the severed toes I feel sad and a bit depressed and dont feel like developing the entire Shroud body.","date":"2011-02-15","mins":"7:28 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2505","author":"vincenzo_giovanni_ruello","post":"Dan this is my last message to you. You have treated me with disrespect and judging me before the jury is out and placing the picture of the priest that fellow next to me ridiculing me. How can any respected Shroud researcher scientist argue with my xray images of the 2 large toes side by side proving there is no crossover. Lastly why on God’s earth would I reveal my pioneering filming techniques to you or anyone to reproduce my findings and takel my hard work and credit. All true scientists protect their findings until respected scientists start seeing the truth. At this stage I will wait patiently for the Vatican officials or until I find someone I can work with. You know what I take extreme joy in Dan the xray images of the 2 large toenails side by side especially the clearly defined square left foot nail. But as you would say Dan its just video noise. Over and out.","date":"2011-02-17","mins":"9:41 pm","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2468","author":"vincenzo_giovanni_ruello","post":"Wait a minute you say that you cannot see anything on the eyes well thats is incredible as there is something I revealed on the eyes and the feet you cant see anything there either. Even the Shroud negative blown up with no processing reveals images to the eyes that people see as toes. How can I now take you seriously when you see nothing at all its a total waste of time then, you see nothing so why tell you anything maybe we both need glasses.","date":"2011-02-15","mins":"9:09 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2699","author":"vincenzo_giovanni_ruello","post":"Inner West Courier story published 1st March 2011, Sydney Australia 1.2 million readers a week, half page of the decoding of the Shroud by Vincenzo Ruello.","date":"2011-03-18","mins":"7:49 pm","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2492","author":"vincenzo_giovanni_ruello","post":"Hello Dan I have contacted the Catholic Church and will be only dealing from this moment on with the Vatican, their scientists and public relations media. Thankyou for your time and goodbye and Godbless you and your colleagues. Sincerely Vince.","date":"2011-02-17","mins":"2:23 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2504","author":"vincenzo_giovanni_ruello","post":"Clip posted xray imagery. The scientists who carried out 2 and 3d imagery tests were wrong. They made the biggest mistake of assumption when they noticed toe tips to the right of the right foot, then they assumed that the left foot must be crossing over the right foot and blaming mysterious unrecorded encrypted data. My close xray filming system has provan them wrong because you can now see 2 large toenails side by side. Forgive my arrow labels not clear but the large toenail on the left is of the right foot and the square clearly defined toenail next to it is from the left foot which is laying side by side to the right foot. There is no cross over, The Shroud is true and perfect in revealing all encrypted data if you have the means to see it..","date":"2011-02-17","mins":"8:24 pm","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2471","author":"vincenzo_giovanni_ruello","post":"Sorry I removed your post some words bothered me I am also a musician and very touchy with probably more feelings to hurt than most people. Thankyou for giving me your name. My next step is yes to find a scientist pysicist I believe to look at my work and then I will write or pay him to write the paper but you are not a scientist. Anyway I also have some issues about processing the entire body do you think its right to reveal in total photographic form a person who has died horrifically? I just concentrated on the feet and eyes. We may be in touch thankyou for your time if you do know any credited pyscists let me know. Sincerely Vince PS If I have made any mistakes in my findings and a qualified psycists shows me I will admit it but pictures Dan speak a thousand words..","date":"2011-02-15","mins":"10:20 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"},{"id":"comment-2469","author":"vincenzo_giovanni_ruello","post":"Secondly please asmswer this are you Barrie Swortz from Shroud.com if not what is your name and who are you associated with what qualified direct scientific colleagues do you know. Thanks Vinny.","date":"2011-02-15","mins":"9:17 am","url":"https://shroudstory.com/2011/02/14/using-the-shroud-of-turin-as-a-rorschach-ink-blot/","cat":"art","title":"Using the Shroud of Turin as a Rorschach Ink Blot"}]
