[{"id":"comment-34210","author":"vincenzo_giovanni_ruello","post":"Thankyou Max. Stay tuned here as a clip called The Eyes Of God is about to be downloaded where I have isolated the human face from the lion face.","date":"2013-05-21","mins":"10:03 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34125","author":"vincenzo_giovanni_ruello","post":"Angular filming magnification is a simple process which we can begin to understand by this clip showing the front of the Shroud filmed live being tilted back from the lcd screen then before your eyes turning into a positive The technique converts negative film to positive and positive to negative when seen by the camera eye lense and even a human eye. In AFM yes there is a distortion rate of about 10% in length and width of created image but there is no visual noise. It is not correct to say I am overlaying images upon each other. The truth is when an image is processed revealing the positive aspects it is photographed or filmed. The second stage uses this image again tilted to an optimum degree to avoid length width distortion and filmed revealing more of the positive nature. A complete processing is difficult in one stage as AFM only works on sections at a time hence 2 4 separate processings. The illumination of the screen is what reveals the hidden elements and 3 D hidden characteristics. The process has also been used for many years in astronomical photography, I recently learnt this where they photograph stars and distant bodies from separate angles and compile them to create the image so my filming technique has a foundation. I am the first to use this technique in the second face and all of my Shroud research and for this reason I have found misunderstanding and hostility. The face of the lion cannot be denied nor the alive face of Christ from the back.","date":"2013-05-20","mins":"10:59 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34213","author":"vincenzo_giovanni_ruello","post":"I have downloaded a new clip having separated the face from the lion head face http://gloria.tv/?media447402 Dr Dan I think you will appreciate the music.","date":"2013-05-21","mins":"10:37 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34452","author":"vincenzo_giovanni_ruello","post":"What is interesting Max is that some see these images and others dont. I use to think that an eye was an eye but now see that our brain waves and thought are hardwired to our optics..","date":"2013-05-23","mins":"9:13 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34313","author":"vincenzo_giovanni_ruello","post":"I need to tread carefully ,I mean we need to. These initial results show something strange and maybe positive. If these images are tricks of light they have done a good job in communicating to my mind what I see. Can it be a coincidence that images of a lion head or maybe a leopard is seen. Am still working on the photographs slowly gaining more clarity. My goal is to be able to decipher the back as clear as the front face. This is more difficult as it now appears we may be dealing with 2 holographic images. Am attempting to separate the images with more clarity.","date":"2013-05-22","mins":"8:05 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34323","author":"vincenzo_giovanni_ruello","post":"Spectographic 3 D filming has confirmed the lion face.","date":"2013-05-22","mins":"10:18 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34326","author":"vincenzo_giovanni_ruello","post":"You may have a point about John in Revelations mentioning images of a lion leopard and human face with what was the 4th an Eagle. If John had the Shroud till it passed on to someoneelse having it opened up hanging with sunlight hitting it at an angle it may have revealed some of these images.","date":"2013-05-22","mins":"10:36 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34156","author":"vincenzo_giovanni_ruello","post":"This is a different angle live processing of the lion face. The image was revealed after 2 angles processed from the black and white negative photographed by Fanti. Third stage Angular Filming shows another lion face. Appollogies for using Sally Cooper as this was an annonomous name I was using to avoid hostilities towards myself. I will from now on use my real name in all communications here and elsewhere http://gloria.tv/?media444844.","date":"2013-05-20","mins":"10:16 pm","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34550","author":"vincenzo_giovanni_ruello","post":"Why am I the only person who has done an in depth analysis of the second face. I am sure a VP8 3 D analyser will prove me correct. Why has the front f the Shroud been analysed every inch using every piece of filming technology on the planet and the second face hasnt. I have used angular filming and spectography, I will be vindicated. I want Barry Schwortz , Fanti or any qualified photographic scientist or expert to analyse the second face and then the truth will emerge, I have revealed truth but it is at this stage only my word. When an in depth analysis is made and the images released to the public as I have done all will be much clearer. You say there is no conspiracy Dr Dan not about my work but there is a conspiracy,against the second face,tell me why it has not been analysed,all we have since 2002 other than myself is one positive photograph and one heavily banded black and white negative by Fanti. Place it under a VP8 3 D analyser.","date":"2013-05-23","mins":"9:51 pm","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34603","author":"vincenzo_giovanni_ruello","post":"A silk veil has been placed across the screen to diffuse excess light and glare. Please Dr Dan place this clip up.","date":"2013-05-24","mins":"8:05 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34874","author":"vincenzo_giovanni_ruello","post":"Hello Dr Dan just want to say thankyou for showing your viewers some of my work. I ask you if you could please place this last clip up. It heralds the end of my work on all the Holy cloths thankyou Dr Dan.","date":"2013-05-26","mins":"9:32 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34989","author":"vincenzo_giovanni_ruello","post":"The number that appears to be a 12 C at bottom may not be a 12 but a word when turned 360 degrees may commence with SI.","date":"2013-05-26","mins":"10:25 pm","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34163","author":"vincenzo_giovanni_ruello","post":"Chris B I have attempted to isolate the face and added more images http://gloria.tv/?media447240.","date":"2013-05-21","mins":"2:01 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"},{"id":"comment-34181","author":"vincenzo_giovanni_ruello","post":"This is using 35mm film Samsung SLR camera close ups http://gloria.tv/?media447275.","date":"2013-05-21","mins":"5:04 am","url":"https://shroudstory.com/2013/05/20/the-worldwide-conspiracy-to-ignore-vincenzo-giovanni-ruello/","cat":"other_blogs","title":"The Worldwide Conspiracy to Ignore Vincenzo Giovanni Ruello"}]
