[{"id":"comment-184855","author":"david_o","post":"Aljones 909 wrote: “Benford is a total kook…..” I had the privilege of meeting Sue Benford and getting to know her a bit. It angers me that there are those out there who would use such a disrespectful term (total kook) to describe one with whom they might disagree. Whatever you may think of her Shroud related work, she WAS NOT a “total kook”. Joe Marino (her husband), is too much of a gentleman to tell you what he might feel regarding such a disparaging description and characterization of his wife. Sue, who was a lady cannot, because she is not here to defend herself. Therefore I will. You owe the man an apology!.","date":"2015-01-20","mins":"10:08 am","url":"https://shroudstory.com/2015/01/19/jeffrey-skurka-on-buffalo-catholic-radio-station/","cat":"news_&_views","title":"Jeffrey Skurka on Buffalo Catholic Radio Station"},{"id":"comment-184852","author":"david_o","post":"What a wonderful historic picture! Unless some of the onlookers are plain clothes cops (which I doubt), there appears to be virtually no security visible. Today, the Shroud is encased in bullet proof glass and is guarded around the clock 365 days of the year. How times have changed. Though it’s not readily discernible because it is covered, does anyone know if the Shroud is being transported in its silver, bejeweled reliquary in this picture? It appears to have similar dimensions (i.e. Rectangular)..","date":"2015-01-20","mins":"9:44 am","url":"https://shroudstory.com/2015/01/20/picture-tweet-of-the-day/","cat":"news_&_views","title":"Picture Tweet of the Day"},{"id":"comment-142591","author":"david_o","post":"“So far, some elements seem to be clear: the scientific results have let say with certainty that the image was produced through a natural process that involved the body of a human being.” The imaged was produced through a natural process with CERTAINTY? I beg to differ. I don’t think so..","date":"2014-08-06","mins":"9:20 am","url":"https://shroudstory.com/2014/08/06/scientific-conference-on-the-shroud-of-turin/","cat":"news_&_views","title":"Scientific Conference on the Shroud of Turin"},{"id":"comment-174333","author":"david_o","post":"Barrie…….As usual, we in the Shroud crowd owe you a debt of gratitude for all the time you put in managing shroud.com, as well as the enormous contributions you continually make in the world of sindonology. A Personal Report on the 2014 St. Louis Conference being just one of them. Thanks!.","date":"2014-12-02","mins":"3:04 pm","url":"https://shroudstory.com/2014/12/02/the-neutron-conference/","cat":"news_&_views","title":"The Neutron Conference"}]
