[{"id":"comment-192925","author":"david_o","post":"Well said Leon re: Mr. Nickell’s tired argument(s). The problem is….what he knows is falsehood….perpetuated time and time again because of intellectual dishonesty! Seekers of truth need to continue moving ahead of disproven ‘naysayers’ whose tired old arguments do little (nothing) to further Shroud study and research..","date":"2015-03-09","mins":"10:29 am","url":"https://shroudstory.com/2015/03/09/crocumentaries/","cat":"article","title":"Crocumentaries"},{"id":"comment-94533","author":"david_o","post":"O.K. You take great leaps in your comments. Using words like “denounce, worthless, and condemned indiscriminately” to describe S.T.U.R.P. Views of other researchers (Max Frei) amount to nothing more than emotional hooey. I know of a Jewish man who has investigated the Shroud. His name is Barrie Schwortz and he has as much authority to speak on the Shroud as anyone in the world. You may disagree with him or other members of S.T.U.R.P. However, to proclaim your disgust with arrogant attitudes of former members is worthless diatribe. Keep your comments civil and respectful…and don’t ascribe your views to reflect those with whom you may disagree..","date":"2014-03-29","mins":"9:53 am","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-193210","author":"david_o","post":"“…..and she brought forth her FIRSTBORN son. And she wrapped Him in swaddling cloths and laid Him in a manger because there was no room for them at the inn.” (Luke 2:7) When interpreting Scripture, if the plain text makes common sense, seek no other sense. The CATHOLIC Bible declares that Jesus was Mary’s FIRSTBORN child. At the cross, she was not entrusted to another sibling because they were not there with Him in His agony. John and Mary were. Therefore Jesus committed them to each other. Both of whom were like minded in their love and devotion to Him..","date":"2015-03-12","mins":"10:03 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-192193","author":"david_o","post":"The most glaringly, inaccurate treatment of known Shroud wounds was the explanation(?) for the shoulder abrasions due to the carrying of the cross. Steering completely AWAY from what the Shroud shows us, we are taken on a visual journey of Jesus carrying the complete cross which, by their own admission, would have weighed 300lbs. It would have been impossible to carry. Especially someone as brutalized as the Man in this cloth. We KNOW the Shroud depicts the shoulder wounds to have been made by the patibulum (cross beam). This would have been tied upon the Man using ropes. More surprising was when they contradicted this obvious (intentional?) error, by then inexplicably soliciting John Jackson’s obviously correct interpretation for the shoulder wounds. How could this blatant Shroud falsehood have been included in the final cut for Finding Jesus? During those scenes of Him carrying His cross on the Via Dolorosa, I almost expected to see Veronica coming out from among the crowd to wipe the face of Jesus. Sincere, legitimate, objective efforts must used when giving the public Shroud information. Every attempt should be made to ensure that misrepresentation (willful?) of what is already known to be fact is eliminated. The mistreatment of the shoulder wounds was glaring!.","date":"2015-03-02","mins":"10:57 am","url":"https://shroudstory.com/2015/03/01/open-discussion-about-episode-one-examining-the-shroud-of-turin/","cat":"television","title":"Open Discussion About Finding Jesus, Episode One: Examining the Shroud of Turin"},{"id":"comment-174641","author":"david_o","post":"Russ…….I agree with Mike M. Thanks for all your effort, time and money in making the St. Louis Shroud Conference available online!.","date":"2014-12-04","mins":"1:25 pm","url":"https://shroudstory.com/2014/12/03/revised-st-louis-conference-videos/","cat":"other_sites","title":"Revised St. Louis Conference Videos"}]
