[{"id":"comment-21698","author":"gabriel","post":"Daveb is right when he mentions the confidence interval issue for the Pearson correlation coefficient. Due to the great correlation between pixel values in adjacent pixels throughout the Shroud, the degrees of freedom must decrease dramatically for r and most probably, an overall value of 0.4 is nothing but an artifact not truly different from 0 at let`s say a 95% confidence level. Again, no original image whatsoever is provided for independent confirmation..","date":"2013-01-07","mins":"5:17 am","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"},{"id":"comment-21671","author":"gabriel","post":"The first thing I will say is that I do not know whether coins or flowers are present on the Shroud. No solid evidence has been provided yet and in this sense, the burden of proof relies on those claimining that those images are present. In this blog, I have often mentioned that the I think I see game is not scientific since, so far, authors and have never released the original images they have used for independent confirmation and verification of their methodology and results. This is no science and currently there is no ground to support the idea of images of any kind. However, I completely disagree with Dan when he says that this paper provides the scientific explanations, lucidity and focus I could not achieve (to explain paraedolia effects in previous posts) The authors, just like in any ”I think I see” paper do not provide free access to the images they have used. The software they use (Paint Shop Pro X4) is a medium level software and not appropiate for a thorough identification of any tentative letter, coins or flowers. In my view, a very little scientific part of this paper, is comparing Marion’s results using software filters and contrast enhancement when he used a completely different, much more powerful and accepted technique (PCA, just like in the most interesting paper by Morgan of last July) as a way to combine and extract the meaningful information from different wavelengths (red, green, blue, IR) and sources. A scientifically honest approach to reject Marion’s work would require the use of the same technique (PCA, and not a much more simple one) and see then if the ENEA letters appear. Everything should be done with freely available material for open scrutinization and reproducibility. Sorry to say but, despite the claims, I see no science here. However, the poorest part of it, is the focus on human perception when state of the art techniques, allows moving to objective probabilities of appearance, something that the authors seem to ignore. Nevertheless, my Bravo! goes to the public relations department of ENEA for reselling again another paper, in this case presented at Frascati Conference 2010, and as usual, in Christmas or Eastern..","date":"2013-01-06","mins":"4:31 pm","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"},{"id":"comment-21774","author":"gabriel","post":"The Pearson r works well in the fields Daveb has mentioned but since the works by Willmot its shortcomes and limitations for many other applications are well known. In any case, a plain value of r does not mean anything at all if it is not given along with its confidance boundaries. Coming to the paper, I think that most probably r, would not pass the test of being different from 0 due to the dramatic decrease in the degrees of freedom. However, the first thing author should do is a thorough review of the scientific literature and see which are the standard indicators used to compare images (certainly not r). This goes to the authors claiming that there is a second face and also to the authors of the current paper. If everything is going to be scientific, all the claims in one sense or another, should be done according to widely accepted methodologies and indicators. A further concern is the format used for the images after scanning. JPEG, PNG and many other (typical if Paint Shop has also be used for scanning) should not be used because they distort the pixel values. I hope the authors in their new revised version can address all these points, including the use of PCA if they want to refute Marion’s results..","date":"2013-01-09","mins":"8:49 am","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"}]
