[{"id":"comment-9792","author":"gabriel","post":"Honestly, I think that this kind of things do not contribute to provide a serious scientific image of the Shroud. It will only help fuel the controversy once again near Eastern on the media and not where a truly scientific discussion should be. This are the kind of things that will make the Shroud stay on the same shelf as UFO and yetis. Forever?. Unfortunately, this seems to be the fate of the S Hroud studies. I don`t know if Fanti after all someone from the academia is actively cooperating with this new episode but it all is truly sad. W Hy is it that those who claim most that more science on the S Hroud is needed are the first ones to jump to the media, where obviosuly science facts cannot be discussed seriously?.","date":"2012-03-30","mins":"10:33 am","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins"},{"id":"comment-33265","author":"gabriel","post":"I think that the C14 test was carried out properly but now in 2013 we know that radiocarbon dating is just not appropiate for an object like the Shroud. That is all. I can live with that. I have commented extensively here about this but by now the scientific literature has already provided solid evidences in this line. Additionally, perhaps the threads from the sample included some medieval reweaving. I am more interested in the point raised by Thibault in comment #6. How was it or under whose pressure happened that what it was initially intended as a comprehensive analysis of the Shroud came down to a single test.(C14)?.","date":"2013-05-08","mins":"4:22 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-18680","author":"gabriel","post":"Louis : Father Werner Bulst told German TV that there was a “plot”, and I had first hand confirmation about what he was referring to. So it will be important to see what fresh information Franco Faia brings. Louis, it would be great if you could share in this blog that info on the plot you mention.","date":"2012-10-31","mins":"1:43 pm","url":"https://shroudstory.com/2012/10/30/another-article-on-francesca-saracinos-la-notte-della-sindone-documentary/","cat":"carbon_14_dating","title":"Another Article on Francesca Saracino’s “La notte della Sindone” Documentary"},{"id":"comment-18694","author":"gabriel","post":"OK, Louis. Thanks.","date":"2012-11-01","mins":"5:25 am","url":"https://shroudstory.com/2012/10/30/another-article-on-francesca-saracinos-la-notte-della-sindone-documentary/","cat":"carbon_14_dating","title":"Another Article on Francesca Saracino’s “La notte della Sindone” Documentary"},{"id":"comment-19064","author":"gabriel","post":"Collin’s attitude seems to be a constant in Shroud “studies”. He doesn’t he provide a comprehensive way for free and open scrutinization of his own results but at the same time, suggests new tests with material to be released by others (in this case the Catholic Church). Sad to say, but this is a constant with anyone owing any physical evidence: HR image, fibers, whatever…..We have also recently learned that the raw figures of the C14 tests have been released to the authors of a documentary. Will they release those figures for open and free discussion? Surely not. Perhaps at some moments, they were too naive BUT being a Catholic myself, I fully support (even more, I am proud of) the Church’s current position at this point of not contributing to add confussion, discussions on media and improve the professional careers of Shroud stars selling the same over and over throughout the years..","date":"2012-11-15","mins":"7:06 am","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"},{"id":"comment-11324","author":"gabriel","post":"And still, after 24 years, a recombination of separatedly analized subsamples yields a trend. In this trial of the C14, the recent detection of this spatial trend stands as an unexpected last minute wittness pointing out that after all, the analyses were carried out correctly. Perhaps, on an medieval reweaving but regarding the C14 test itself, correctly. Even if we go to the conspiration theory, this can help identify where to look for the secret scheme. Certainly, not at the laboratories..","date":"2012-05-13","mins":"12:00 pm","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia"},{"id":"comment-7312","author":"gabriel","post":"Here we have a very clear example for the reasons why all the C14 issue remains controversial, after 24 years. Dawkins mentions the fire of 1532 as a possible explanation but who knows?…..The true point is that we only have a few vague ideas on how a C14 test will work with ancient linens, touched by millions of persons throughout history, kept in varying conditions of humidity and temperature for centuries and partially burnt 480 years ago. The point is that the Shroud whatever it is is a unique piece of linen and using off the shelf tests like C14 when we don`t have a background knowledge of what we can expect or how interpretate results, may be highly misleading. One of the areas on the Shroud about which research has progressed most and currently, we have a more solid and conclusive knowledge, is all the forensic/blood aspects. In my opinion, on the contrary of C14 tests on ancient linens, in general, we know virtually everything about dead human corpses and human blood behaviour. Since the researchers had this previous knowledge, the specific tests carried out on the Shroud on these areas, could easily be put into context, correctly understood and represent eda major step forward in research. This previous and commonly accepted knowledge is the main difference with the C14 test and allowed much more easily than in other areas of research, an almost general consensus on the forensic aspects of the Shroud. For this reason, regardless the fact that most probably the test was carried out on a non representative sample, a new C14 test might not help at all because we don`t know enough on how to put new results in the context on an ancient linen which has gone through such a very particular chain of events. Perhaps, if enough had been known, even the C14 would have been ruled out from the beginning. The same risk may happen if readily available, breaking edge technologies are blindly applied in the frame of a new set of tests. Again, without a contextual knowledge of these tests when applied to similar cloths, new dissapointing figures may emerge from a computer while a new cycle of discussions starts again for the next years..","date":"2012-01-21","mins":"8:37 pm","url":"https://shroudstory.com/2012/01/21/dissent-of-the-day-with-a-bit-of-a-response/","cat":"carbon_14_dating","title":"Dissent of the day with a bit of a response"},{"id":"comment-13044","author":"gabriel","post":"The point of datation and C14 is something that from time to time comes up in this blog. It is really important because finding an accurate alternative to the c14 test would mean an important step forward. In this line, I have recently come across a peer reviewed paper (1) by one of the STURP members which to my surprise, has been widely ignored and even in shroud.com is only tangentially commented. It mentions that the ratios of deuterium/hidrogen and two isotopes of of oxigen can contribute to determine the geographical origin of any linen. In combination with the more recent results obtained (2) with trace elements I think it truly represents a scientifically solid and promising path. This would incorporate to the datation strategy followed so far, the geographical view of determination of linen origin. (1) De Niro, MJ, Sternberg, L.D., Marino, B.D., Druzik, JR. Relation between D/H ratios and O18/O16 ratios in cellulose from linen and maize. Implication fro paleoclimatology and for sindonology. Geochimica et Cosmochimica acta, vol. 52 pp. 2189 2186.1988. (2) Takako Inoue, Kengo Ishihara and Kyoden Yasumoto.International Journal of Clothing Science and Technology Vol. 22 No. 2/3, 2010 pp. 174 186.","date":"2012-06-26","mins":"5:16 am","url":"https://shroudstory.com/2012/06/25/fudged-c14-numbers-capitoline-she-wolf-the-shroud-of-turin-of-the-classics-set/","cat":"carbon_14_dating","title":"Fudged C14 Numbers: Capitoline She Wolf the ‘Shroud of Turin’ of the Classics Set?"},{"id":"comment-4499","author":"gabriel","post":"If these are the kind of inspiring possibilities, creative corollaries and statements incorporated into the discussions that are going on inside a self called “Shroud Science Group”, what can be expected elsewhere? How can anyone give any credit to future “scientific” results originated in this “Shroud Science Group”? Do this people know which are the elementary rules if you want to work as a scientist? How was it that we have arrived to this point? And still,can anybody be surprised that the Church has decided not to release any new material? Can you imagine what kind of possibilities and corollaries would they be discussing and firmly defending if new material is put into their hands? I’d rather not imagine…...","date":"2011-10-31","mins":"5:08 pm","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","title":"Giulio Fanti on the Carbon Dating of Certain Relics"},{"id":"comment-28502","author":"gabriel","post":"Once I read it, I will give my opinion. In the meanwhile, today’s VATICAN INSIDER includes very interesting article by Gian Maria Zaccone Scientific director of the Museum of the Holy Shroud of Turin, Vice director of the International Center of Sindonology of Turin and member of the Archdiocese of Turin’s Diocesan Commission for the Shroud Also, a new App is announced based on long expected high definition images on the Shroud. Http://vaticaninsider.lastampa.it/en/.","date":"2013-03-27","mins":"1:24 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-11711","author":"gabriel","post":"A very recent paper (*) in a peer reviewed journal regarding the datation of the first artwork and flutes made by modern humans discuss, the C14 method used so far in this field. Authors state that “Unfortunately, it is now apparent that the radiocarbon record, constructed over the last 60 years, is significantly flawed and inadequate for rigorously testing these models. This is due to the combined effects of incomplete removal of contamination and the difficulties encountered when dating samples very close to the measurement limit (Higham, 2011). This was either not recognised, or not adequately addressed, at the time of dating. In addition, many of the determinations available for the Middle to Upper Palaeolithic are often only useful in the broadest chronological sense because of measurement imprecision.” There are also some good news: ) “The development of more refined methodological approaches has had a significant effect in improving accuracy. The application of ultrafiltration for dating bone, and AB Ox SC methods for dating charcoal have shown for some sites, even those recently dated, that a large proportion of dates may be aberrant” An article worth reading in the context of the Shroud and C14 issue. (*) Τesting models for the beginnings of the Aurignacian and the advent of figurative art and music: The radiocarbon chronology of Geißenklösterle by Thomas Highama, , , Laura Basellb, Roger Jacobic, d, 1, Rachel Wooda, e, Christopher Bronk Ramseya, Nicholas J. Conardf, g. Journal of Human E Voution. May 2012..","date":"2012-05-30","mins":"5:30 am","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","title":"New Dawkins Challenge Video"},{"id":"comment-11904","author":"gabriel","post":"A very interesting research has just been made public in Nature http://www.nature.com/news/. In it authors have been able to detect the impact of a huge amount of cosmic radiation of unknown origin that impacted on the Earth in year 776 of CE. We have in the Shroud community researchers that state that radiation coming from the body of Jesus at the moment of the resurrection altered the proportion of C14 in the cloth. As a result, a C14 test would always yield a much later datation than what it really is. But, what if the radiation came from a natural source in the VIII century, thus modifying the proportion of C14? In the last issue of Nature there is also a very interesting article on how new datation techniques based on rare earths can overcome the shortcomes and limitations of the C14 test. I have commented this before here, but I think these new techniques do represent a reasonable alternative to the C14 test..","date":"2012-06-04","mins":"1:55 pm","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","title":"New Dawkins Challenge Video"},{"id":"comment-10943","author":"gabriel","post":"If the radiocarbon datation is to be invalidated it is because the tests were carried out (as Rogers/Yannick suggest) on a medieval reweaving. But not because we detect a trend. My point is that this trend could be present in both cases (reweaving and original cloth) and would not contribute the least to distinguish between them. Jos, I think that there is please read again my previous comment a significative difference between having a trend and not having anything but a chaotic distribution. But I agree with you when you say that the conclusion is that the 1988 C14 test was measuring two combined effects:age and something else. I tend to think that this x factor could be explained by a higher contamination of samples in peripherical areas, but it could be any other. And we come to my point why C14 test is not appliable here. In 1988 it was not known, but now we know that in cases like the Shroud there is always a x factor interfering datation! It is precisely the presence of a trend that indicates that there is a discernible x effect! This x factor or any others are also likely to appear if new C14 tests are carried out. The C14 is a technique of the 80’s and cannot overcome this limitation, regardless fully representative samples are taken. To be honest, I would like to stress the idea that another implication of the presence of a trend obtained from a combination of results independently obtained at different laboratories is that these labs did a good job. Otherwise a random combination of poorly analyzed samples would have never given the result of a trend 24 years later and most probably detect the existance of a x factor. I know a lot of people will disagree with me but I think in the light of this paper there are grounds to support my previous statement. It is also fair to recognize it after so much criticism. In my opinion, these are the major reasons why the Church which always gets very qualified scientific advice will never carry out new C14 tests (not conspiration theories). I think we will see new tests in the future ( very distant future I am afraid) but not based on an obsolete technique like C14..","date":"2012-04-29","mins":"4:19 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-10948","author":"gabriel","post":"Jos, I agree 100% with this comment. I would add that the weak swivel of the C14 datation process is at the sample selection stage, not at the analysis stage. If significant errors had been made, the peer review process of a journal like Nature would have detected them. 24 years later an independent confirmation of this unexpectedly arises with this trend..","date":"2012-04-29","mins":"8:53 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-10927","author":"gabriel","post":"I completely disagree with Dan when he says in his post that ”This just adds to the mountain of information that completely invalidates 1988 carbon dating of the shroud” This journal belongs to the JCR is peer reviewed, has an impact factor of 1.851 and is in position 19 out of 97 in the field of COMPUTER SCIENCE, THEORY & METHODS. To me at least, it means that the methodology followed support the conclusion that there is a spatial trend in the Shroud. The only apportion of this paper is that there is a spatial trend in the C14 proportion as we move from the border to the central part of the Shroud. However, the maximum and minimum C14 counts across the 12 subsamples still support the idea of a medieval artifact. The lack of homegeneity in the samples moves between C14 counts associated to medieval datation boundaries. If there is a trend, it only indicates a different behaviour in different areas, which may well be associated to a more intensive handling and thus contamination in peripheric areas of the linen. Or perhaps to any other effect but please note, that if the sample belonged to a medieval reweaving, as so often has been stated, the trend still seems to be there. For this reason, I think that the detection of a trend does not invalidate anything: it could be explained in the case of being a sample belonging to the original linen and also in the case of a medieval reweaving. The kind of lack of homogeneity that the presence of a trend indicates is not a chaotic one. It represents a smooth and ordered change in C14 counts with distance thus indicating that most probably a physical effect (I pointed out one but it can be any other) is behind this trend. We cannot forget that the boundaries still are associated to a medieval datation. If the lack of homegeneity among the 12 subsamples were really chaotic with datations moving let’s say between 3000 BC and 1600 CE and randomly distributed among the subsamples, this would represent a solid argument against coming with an average datation (medieval or not). As a conclusion, in my opinion, the results presented in this paper do not contribute the least to invalidate the 1988 carbon dating. Furthermore, a trend and not a chaotic distribution sort of indicate a rigourous and systematic methodology applied by the different laboratories whose results when combined, are solid enough as to conform a discernible trend. Please, remember that this statement also applies if a medieval reweaving (a very reasonable option in the light of widely published results) had been tested. I don`t agree either with Charles Freeman and Daveb when they sort of say that a new C14 test is needed. This is also a common place in many comments here. I have in many occasions written comments about this issue ,so I will summarize my point by saying that in 1988 it was thought that the C14 test was appliable to virtually everything. Now there is more than enough evidence to state that this test cannot be used with the Shoud and new datation strategies should move towards other techniques..","date":"2012-04-28","mins":"7:00 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-10947","author":"gabriel","post":"Daveb, I am afraid I misunderstood your point regarding the C14. Sorry for that. I would be great if you could share with us your opinion on this paper. Regarding why I think C14 is not appropiate/obsolete and which new techniques may be promising ,I have extensively written in this blog my points of view so I would not like to repeat myself. Basically, my position is based in the following scientific literature C14 (1) H.E. Gove, S.J. Mattingly, A.R. David, L.A. Garza Valdes. A problematic source of organic contamination of linen.Nuclear Instruments and Methods in Physics Research B 123 (1997) 504 507 New approaches based on trace elements (2)Takako Inoue, Kengo Ishihara and Kyoden Yasumoto.International Journal of Clothing Science and Technology Vol. 22 No. 2/3, 2010 pp. 174 186.”Comparative analysis of hand properties and compositions of trace elements in linen fabrics produced in different regions” in: International Journal of Clothing Science and Technology, Vol. 22 No. 2/3, 2010 (3) Emily R. Schenk and Jose R. Almirall. Elemental analysis of cotton by laser induced breakdown spectroscopy. May 2010 / Vol. 49, No. 13 / APPLIED OPTICS.","date":"2012-04-29","mins":"8:45 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-13916","author":"gabriel","post":"Dan, I agree with you only partially. While the two first points of this document, truly look prophetic with what we know in 2012, the recent publication of the detection of a trend, clearly confirms independently and 24 years later that the labs did really implement correctly the C14 test. The question right now is whether this technique is appropiate to date the Shroud. In my view, there is solid evidence that it is not..","date":"2012-07-17","mins":"9:05 am","url":"https://shroudstory.com/2012/07/17/paper-chase-sturps-fascinating-1988-draft-protocol-for-future-examinations-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Paper Chase:  STURP’s Fascinating 1988 \"Draft Protocol for Future Examinations of the Shroud of Turin\""},{"id":"comment-11143","author":"gabriel","post":"Daveb, this point is really fascinating and in my opinion, deserves further scientific research. Last December I wrote on this blog: ********************** In Israel, on the average, about every 100 years, there is an important earthquake http://www e.openu.ac.il/geninfor/openletter/ol18/pages4 10.pdf and in Matthew 27:51 we can read “And behold, the veil of the temple was torn in two from top to bottom; and the earth shook and the rocks were split” Several very serious scientific papers (*) indicate that strong magnetic, electric fields and corona discharge effects do take place in the frame of earthquakes. The local geomagnetic field seems to play an important role. If we have a look at the geomagnetic field near Jerusalem (http://models.geomag.us/wdmam.html, either the pdf or the KMZ file for visualization in Google Earth can be downloaded) we can see that in a very small distance the polarity changes abruptly from high positive to negative anomalies. The conclusion could be that in the frame of an earthquake, with a natural strong local geomagnetic field, the corona discharge could be responsible for the formation of the image, BUT the source of that energy would not be supernatural, but a perfectly natural mechanism. ******************************** I don’t know what the image formation mechanism is nobody does 100% for sure but these are the kind of preliminary works (like other ways of determining the origin and datation of the Shroud beyond C14) that in my opinion deserve further research (*) Giovanni P. Gregori. Geoelectromagnetism and geodynamics: ‘Corona discharge ’ from volcanic and geothermal areas. Physics of the Earth and Planetary Interiors. Volume 77, Issues 1 2, April 1993, Pages 39 63 Electromagnetic Field Anomaly Associated with the 1998 Seismic Swarm in Central Japan. Y. Fujinawa, K. Takahashi, T. Matsumoto, H. Iitaka, S. Yamane, T. Nakayama, T. Sawada and H. Sakai. Physics and. Chemistry of the. Earth ( Vol. 25. No. 3, pp. 247 253, 2000) France St Laurent , John S. Derr , Friedemann T. Freund. Earthquake lights and the stress activation of positive hole charge carriers in rocks.Physics and Chemistry of the Earth 31 (2006) 305–312 K. Tennakone .Stable spherically symmetric static charge separated configurations in the atmosphere: Implications on ball lightning and earthquake lights. Journal of Electrostatics 69 (2011) 638 640.","date":"2012-05-05","mins":"4:01 am","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11144","author":"gabriel","post":"Daveb, this point is really fascinating and in my opinion, deserves further scientific research. Last December I wrote in this blog: ********************** In Israel, on the average, about every 100 years, there is an important earthquake http://www e.openu.ac.il/geninfor/openletter/ol18/pages4 10.pdf and in Matthew 27:51 we can read “And behold, the veil of the temple was torn in two from top to bottom; and the earth shook and the rocks were split” Several very serious scientific papers (*) indicate that strong magnetic, electric fields and corona discharge effects do take place in the frame of earthquakes. The local geomagnetic field seems to play an important role. If we have a look at the geomagnetic field near Jerusalem (http://models.geomag.us/wdmam.html, either the pdf or the KMZ file for visualization in Google Earth can be downloaded) we can see that in a very small distance the polarity changes abruptly from high positive to negative anomalies. The conclusion could be that in the frame of an earthquake, with a natural strong local geomagnetic field, the corona discharge could be responsible for the formation of the image, BUT the source of that energy would not be supernatural, but a perfectly natural mechanism. ******************************** I don’t know what the image formation mechanism is nobody does 100% for sure but these are the kind of preliminary works (like other ways of determining the origin and datation of the Shroud beyond C14) that in my opinion deserve further research (*) Giovanni P. Gregori. Geoelectromagnetism and geodynamics: ‘Corona discharge ’ from volcanic and geothermal areas. Physics of the Earth and Planetary Interiors. Volume 77, Issues 1 2, April 1993, Pages 39 63 Electromagnetic Field Anomaly Associated with the 1998 Seismic Swarm in Central Japan. Y. Fujinawa, K. Takahashi, T. Matsumoto, H. Iitaka, S. Yamane, T. Nakayama, T. Sawada and H. Sakai. Physics and. Chemistry of the. Earth ( Vol. 25. No. 3, pp. 247 253, 2000) France St Laurent , John S. Derr , Friedemann T. Freund. Earthquake lights and the stress activation of positive hole charge carriers in rocks.Physics and Chemistry of the Earth 31 (2006) 305–312 K. Tennakone .Stable spherically symmetric static charge separated configurations in the atmosphere: Implications on ball lightning and earthquake lights. Journal of Electrostatics 69 (2011) 638 640.","date":"2012-05-05","mins":"5:27 am","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-14266","author":"gabriel","post":"Jabba, regarding the trace element issue, a recent paper (1) has shown that using a set of 11 trace elements (Al, Ti, Ni, As, Rb, Y, Mo, Ag, Cd, Ba, and La) it is possible to identify the region of the world a linen comes from. The authors have achieved to distinguish linens from Poland, Italy and Japan using those 11 trace elements. I think it would really be helpful to carry out the same analysis on the Shroud and clearly establish whether its linen comes from the Middle East (one point for authenticity) or from let’s say France. A second recent paper (in this case with cotton(2)) shows that particular combinations of trace elements can allow a correct identification of the state (in USA) the cotton comes from in 81% of the cases. In this case, the authors obtain “results of very clear and distinct clusters with no overlap”. I think that this sounds promising. Finally, there is a third paper written in 1988 (3). Though one of the coauthors was a STURP member, to the best of my knowledge this paper has largely gone unnoticed. They suggest that the use of 18 O/16 O ratios of cellulose and the D/H ratios of cellulose nitrate allows the separation of most linen samples from Europe from those originating in the Middle East when D. The authors say that it may be possible to use the isotope ratios of cellulose prepared from the Shroud of Turin to resolve the controversy concerning its geographic origin. I think that these papers show a promising path and in my view, the C14 path –recurrent requests for new tests should definitively be left behind. (1)Takako Inoue, Kengo Ishihara and Kyoden Yasumoto.International Journal of Clothing Science and Technology Vol. 22 No. 2/3, 2010 pp. 174 186 (2) Emily R. Schenk and Jose R. Almirall. Elemental analysis of cotton by laser induced breakdown spectroscopy. May 2010 / Vol. 49, No. 13 / APPLIED OPTICS (3) De Niro M.J., Stenberg, L.D.,Marino,B.D.;Druzik J.R. Relation between D/H ratios and18 O/16 O ratios in cellulose from linen and maize. Implications for paleoclimatology and sindonology Geochimica et Cosmochimia Acta, 52, 2189 2196,.1988.","date":"2012-07-27","mins":"2:22 pm","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","title":"Savage Treatment in Randi Land"},{"id":"comment-33387","author":"gabriel","post":"The previous comments by Colin, Hugh and Daveb on the trend reflect how unconfortable people with different views on the authenticity (as I think, Colin, Hugh and Daveb represent) feel about the trend. However, the point is that we have a peer reviewed paper published in a JCR journal with a good ranking at the same level of the works published by Rogers, Adler etc. As any other work it can be a matter of discussion (of course), but after such a paper, the subject cannot be dealt with by just using some general comments to rule the trend subject out, as we have read here. At this point, casting doubt on the presence of the trend, means opening a very in detail discussion on the statistical aspects that have made the authors of the paper reach their conclussion (and also convince reviewers that they are not wrong). I am ready to accept possible shortcomings or flaws in this work by Marco Riani et al. But only after an in depth discussion of the major aspects we can read in the paper. Otherwise, if I have to compare impressions or general feelings against a peer reviewed paper that I have thoroughly read and seems to me correct, my choice is clear..","date":"2013-05-10","mins":"2:35 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-33403","author":"gabriel","post":"Colin, honestly, I think that addressing your difficulties on this paper as a combination of first impressions on the abstract and personal attacks on the authors is not a scientific approach..","date":"2013-05-10","mins":"8:56 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-24174","author":"gabriel","post":"1. Another paper that clearly indicates that C14 is not an appropiate technique to date an object like the shroud. I dont want to repeat myself on this blog but a lot of papers point in the same direction. In my view, the evidence against c14 being appliable to the Shroud is simply overwhelming. My question is, what happened in the 80’s so that is was established that c14 was beyond any doubt the only way to know the truth? Why other suggestions made by STURP members like Druzik published in peer reviewd journals have largely been ignored or unnoticed? And how is it that this bias still persists and new c14 tests are requested once and again? 2. If the facts described in this paper are really acting on the Shroud they must have left distinctive tracks on the image. Much in the line of the works by Marion and Morgan, a Principal Component analysis on the image could allow the detection of the mechanisms described by Pam Moon. That work would really be interesting..","date":"2013-02-13","mins":"5:31 pm","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong"},{"id":"comment-33388","author":"gabriel","post":"The relevance of the trend is that the C14 test preprocessing of samples was unable to remove the effect that it represents (most probably biocontamination) thus revealing that radiocarbon testing is just not appropiate.","date":"2013-05-10","mins":"2:47 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-33321","author":"gabriel","post":"Regarding the C14 test, in this blog we customarily read comments reflecting in the best case, opinions about the lack of true professional and competent behaviour on the side of the three labs. In other cases, they are openly accused of conscient manipulation and falsification of the whole process. I certainly do not share this view and most particularly since last year when two independent research works(1) and (2) have identified (or better said confirmed previous guesses) through different and independent ways the presence of a slope in the sample. If in an UV F photograph, which was taken by Vernon D. Miller of the Brooks Institute of Photography in Santa Clara, California in 1978, a trend can be detected and then, 34 years later combining data provided by the labs a similar trend is also detected, for me it is quite clear that the labs beyond perhaps some minor mistakes did a good job. I would love to hear an alternative explanation of how can it be explained that two different techniques (PCA+statistical techniques, C14 counting) applied to two different research items (image , cloth sample) with a lapse of 34 years, detect the same (a trend). The conclusion is that whatever the driving mechanism behind the slope is ( I would say it is simply different degrees of organic contamination due to different intensity of manipulation along the centuries), the point is that the sample cleaning and preparation process was not effective and in spite of it, the trend was still there when the labs started to count C14 atoms It is exactly the same type of objections against C14 test that the scientific literature along these years has been showing: the process of sample cleaning and organic contamination removal is virtually impossible with some objects (like the Shroud). Even more in 1988. The few comments I have read on the trend, tend to interpretate it as an additional argument against the professionality of the laboratories and as another sign of the big mess the whole radiocarbon test was. Dan asks: Will we ever know what really happened?. Let’s start by analyzing all the facts available. That includes the trend. However, in my view, this issue has been largely ignored so far. A plausible explanation is needed on the presence of this trend. I have given mine but I am open to further discussion, different perspectives and even accepting more solid explanations on this subject. Closing our eyes to the fact will not help the least if we want to understand: i) the role that the C14 test played in 1988 ii) its appropiateness for future dating of the Shroud. (1)Digital image processing techniques demonstrating the anomalous nature of the radiocarbon dating sample area of the Shroud of Turin. Morgan. 2012.http://www.academicjournals.org/SRE (2)Regression analysis with partially labelled regressors: carbon dating of the Shroud of Turin Marco Riani · Anthony C. Atkinson · Giulio Fanti ·Fabio Crosilla.","date":"2013-05-09","mins":"8:43 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-6636","author":"gabriel","post":"By the end of these Christmas, it is evident that the whole thing of ENEA research has completely got out of any control. As Ron has sometimes mentioned, we can expect something similar for Easter with this or a new theory on the Shroud. Congratulations to the public relations department of ENEA for this very succesful promotional campaign! But I think is about time to stop selling the same experiments since 2008. After reading in this blog the post of Dec 29, my only concern right now is how will this and forthcoming campaigns affect what seems to be a positive position of the Church to carry out new tests on the Shroud..","date":"2012-01-07","mins":"9:31 am","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-33330","author":"gabriel","post":"Colin, if you have a look at the full paper (published in a peer reviewed journal belonging to the JCR) you will see that the results are statistically robust and not based on “just 3 values” as you mention. Marco Riani · Anthony C. Atkinson · Giulio Fanti ·Fabio Crosilla.Regression analysis with partially labelled regressors: carbon dating of the Shroud of Turin. Sta. Comput. DOI: 10.10007/s11222 012 9329 5 2012..","date":"2013-05-09","mins":"9:47 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-6655","author":"gabriel","post":"Yannick, your perspective sounds very reasonable..","date":"2012-01-07","mins":"8:26 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-15533","author":"gabriel","post":"I have got a question for Ron: How do you understand that 25 years later, if there have been bad protocols or even substitution of the samples, after reassembling data from all the subsamples a statistically robust trend emerges? For me the only explanation is that originally it was there and even in the recent paper by Morgan in the Fanti journal, it can be clearly distinguished. Perhaps, as Rpgers pointed out, it was a medieval reweaving or simply the C14 method this is my favourite explanation is not appliable for centuries old linens but, in my view, after recombining data from subsamples analyzed separatedly if a trend emerges, this is a very serious fact which speaks in favor of the labs. The trend indicates the presence of an unknown effect on the linen, that 26 years after is again detected only because each lab did a good job. For me is much more difficult to explain that someone substituted the samples with other subsamples but originally aligned around a trend!.","date":"2012-08-28","mins":"2:08 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15508","author":"gabriel","post":"Or just because it is nonsense?. Sadly, too often in the field of the Shroud we see too many conspirations. This web page seems to me full with theories that from time to time arise. Substitution of the samples, NATURE ignoring the peer review stage for the paper about the C14 test for non scientific reasons…….It is simply too much! I don’t want to repeat myself in this blog but the recent peer reviewed paper and published in aserious JCR journal regarding the presence of a trend once and for all rules out these hypothesis and reprsents an unexpected confirmation so many years after the test, that the laboratories did a good job. Regarding the point of Nature, it can only be accepted by someone who just doesn’t know how things work in scientific journals. This page was removed by someone with common sense. That’s all, folks! No conspirations..","date":"2012-08-27","mins":"3:28 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15544","author":"gabriel","post":"Ron : By the way, ASK YOURSELF; who was responsible for the “Trend” conclusions and testing announced recently?. Ron, I am afraid I don`t uderstand what you mean, could you be more explicit? Perhaps I am wrong but I think that those results have been obtained with previously published and freely available data, so that are reproducible as the peer review jpurnal indicates…….","date":"2012-08-28","mins":"2:29 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15683","author":"gabriel","post":"Ron, Angel: I have read some of the documents you mention and, I admit it, some points are far from being clear. So I think I understand, at least partially, your point of view. Now, please I would like to ask you for an effort on your side and try to give an explanation for the trend. In the recent paper by Morgan (in Fanti’s journal) the UV images clearly indicate that there is a trend in the colour of the sample area. This trend has also, in an independent way, been recently detected in a peer review journal by statistical means after recombining data from the three laboratories that did the C14 datation. All the data used for the statistical analysis is freely available and widely published since long time ago. How on earth, after independently recombining data from the three subsamples is it possible that the trend emerges as seen in the UV images taken before the C14 test? The only explanation that I see is that the three labs did a good job after all, but truly, I am open to alternative explanations and a honest discussion form different points of view..","date":"2012-09-01","mins":"8:05 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-15555","author":"gabriel","post":"Ok, Ron, Thanks..","date":"2012-08-29","mins":"6:20 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","title":"Was this page removed because it was just too political?"},{"id":"comment-6552","author":"gabriel","post":"BYE BYE C14 Since I started following this blog, I have noticed that one of the major concerns of researchers is the C14 radiocarbon dating. This post and also the post of Jan 1 by Russ Breault are good examples. The underlying idea is that if a new C14 test is carried out on the original linen, the results would confirm that it is authentic. However, I see a big paradox here, since the validity of the C14 method itself when applied to ancient cloths, has been scientifically challenged –not only but yes to a great extent by the Shroud researchers community since 1988. And I think they have succeded in that. Therefore, in 2012 it can be stated that the method is not reliable for ancient linens, regardless the sample is correctly chosen or not and also regardless the statistical technique used. It is due to these intrinsic shortcomes and limitations of the C14 method –mainly the fact that the effect from a bioplastic organic coating cannot be removed from cloths(1) that new methodologies have to be explored. It may well happen (and I personally would bet yes!!) that in a new C14 test this time with the correct sample the results indicate something similar to the tests of for example, the Sudarium of Oviedo (7th century) and the results would not be conclusive once again. Radiocarbon dating belongs to the 80’s and currently very powerful techniques are available which could help. Why not leave behind once and for all the C14 method and concentrate on what state of –the art technologies can offer in 2012 and forthcoming years? In this sense, I would like to mention the laser induced breakdown spectroscopy (LIBS). With this almost non destructive technique applied to cloths it is possible to identify the trace elements present (2) on cotton or linen that can make it possible to scientifically connect the cloth with a certain area (3) of the world (for example Palestine). It would also make it possible to build a definitive connection (or completely rule it out) between the Shroud and the Sudarium of Oviedo. The best of all, it needs such a small sample that it is considered as nearly non destructive and the material captured in the sticky tapes would be enough. (1) H.E. Gove, S.J. Mattingly, A.R. David, L.A. Garza Valdes. A problematic source of organic contamination of linen.Nuclear Instruments and Methods in Physics Research B 123 (1997) 504 507 (2) Emily R. Schenk and Jose R. Almirall. Elemental analysis of cotton by laser induced breakdown spectroscopy. Applied Optics, Vol. 49, Issue 13, pp. C153 C160 (2010) (3) Takako Inoue, Kengo Ishihara and Kyoden Yasumoto.International Journal of Clothing Science and Technology Vol. 22 No. 2/3, 2010 pp. 174 186.","date":"2012-01-04","mins":"6:32 pm","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","title":"What did Christopher Ramsey Know"}]
