[{"id":"comment-211334","author":"gabriel","post":"Marion wrote in a peer reviewd journal a paper in which standard, widely used, and easily reproducible methods were employed to detect the presence of letters and symbols. I have never seen anyone challenging his methodology and all the huge criticism he received was based on impressions or prejudices. In other words, nobody has been able to specify what he did wrong that makes his results impossible. I must insist that all he describes in his paper is reproducible and is standard methodology in image processing. Now we have someone else that has built a 3 D image but has not published a paper and submit his work to the evaluation of peer experts. A lot of criticism again in places like this. But…..both works one of them published in a peer reviewed journal deserve the same degree of criticism? Does this tell us anything about how the scientific challenge that the Shroud represents is being addressed?.","date":"2015-09-27","mins":"7:52 am","url":"https://shroudstory.com/2015/09/27/more-3d-discussion/","cat":"3d","title":"More 3D Discussion"},{"id":"comment-23224","author":"gabriel","post":"If it is more appropiate to consider it as a height map, has it ever been analyzed throroughly fr om this perspective? I mean, for example the analysis of the variogram could shed light on many aspects..","date":"2013-02-02","mins":"7:09 am","url":"https://shroudstory.com/2013/02/02/teaser-of-the-day-3-why-many-state-that-the-shroud-is-a-3d-image/","cat":"teaser_of_the_day","title":"Teaser of the Day (#3): Why many state that the Shroud is a 3D image"},{"id":"comment-23273","author":"gabriel","post":"I have just downloaded the original full paper by Jackson and Jumper of 1984 from my institution’s library. To my surprise, the widely extended idea that there is a correlation between cloth body distance and image intensity is based on a very reduced sample: 13 measurement points only! The authors recognize this and state that 1700 points should be needed to clearly establish a mathematical model describing the exact nature of the relationship between distance and intensity of the image. While the fact that the image shows 3 D properties clearly indicates that some kind of relationship exists and intensity attenuation of the image takes place (no doubt at this point), the exact nature of this relationship may represent an important step forward because some mechanisms (energetic fields, radiation, diffusion, laminar flow) and their change with distance, exhibit very particular mathematical profiles. Really surprising that after so many years to the best of my knowledge no complementary research has been done in this line!.","date":"2013-02-02","mins":"8:51 pm","url":"https://shroudstory.com/2013/02/02/teaser-of-the-day-3-why-many-state-that-the-shroud-is-a-3d-image/","cat":"teaser_of_the_day","title":"Teaser of the Day (#3): Why many state that the Shroud is a 3D image"},{"id":"comment-211651","author":"gabriel","post":"It is not only a matter of having 3d info encoded. Although at first sightbno significant difference can be detected, if there is a linear relationship between intensity and distance, this would be completely different from having either a quadratic or exponential relationship. However, due to the small distances, below 4 cm, all the 3d encoding patterns would yield similar images and significant correlation coefficients. Most 3d images are based on a linear relationship between intensity and distance. If the relationship in the Shroud were different, lets say exponential, this would very clearly indicate the nature of the mechanism involved.The exponential relationship between distance and intensity is only possible with one type of formation mechanism.","date":"2015-10-02","mins":"5:21 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-211665","author":"gabriel","post":"Ok, I just wanted to highlight the idea that if it can be properly and undoubtedly determined the nature of that relationship, the type of mechanism that originated the image can be clearly established..","date":"2015-10-02","mins":"3:11 pm","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-16224","author":"gabriel","post":"Well, Daveb, you have touched a crucial question. If we assume a tightly wrapped linen around a body even Yannick agrees with this chemistry, even Maillard reaction, becomes more complicated because Maillard reaction yields water as a subproduct that inhibits further development of the reaction itself. That would not happen with a more open configuration of the linen around the body, since water could evaporate in a dry environment. For other chemical reactions, a chemical model should be basically be anaerobic..","date":"2012-09-13","mins":"8:43 am","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","title":"A different approach to what some see as problems with the image on the Shroud of Turin"},{"id":"comment-16242","author":"gabriel","post":"Ok, Yannick, I think I misunderstood your point. Sorry for that. Any explanation on the process from being tightly wrapped (bloodstains transfer) to loosely falling on the body (image formation)?.","date":"2012-09-13","mins":"5:35 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","title":"A different approach to what some see as problems with the image on the Shroud of Turin"},{"id":"comment-16233","author":"gabriel","post":"Anoxie; Ok with your comment. I just wanted to point out that for the same initial water production rate, having a tightly wrapped configuration for the linen where water is more likely to accumulate or a gently falling sheet evaporation rates higher makes a difference. Do you know or anybody else knows if Rogers ever addresed this issue?.","date":"2012-09-13","mins":"1:43 pm","url":"https://shroudstory.com/2012/09/05/a-different-approach-to-what-some-see-as-problems-with-the-image-on-the-shroud-of-turin/","cat":"news_&_views","title":"A different approach to what some see as problems with the image on the Shroud of Turin"},{"id":"comment-16941","author":"gabriel","post":"Roger Penrose, Professor of Mathematics at the University of Oxford, in his book The Emperor’s Mind suggests that mathematics, and more particularly,the two Gödel’s theorems of incompleteness may also play a role in understanding conciousness. In this view, Chemistry and Phisics would only represent the axioms that can be listed by an effective procedure..","date":"2012-09-26","mins":"8:30 am","url":"https://shroudstory.com/2012/09/26/how-can-physics-and-chemistry-account-for-consciousness/","cat":"other_blogs","title":"How can physics and chemistry account for consciousness?"},{"id":"comment-9637","author":"gabriel","post":"Everything regarding the restoration sounds horrible but to be fair I would like to hear the version of those involved in the restoration. Did they vacum the Shroud like a carpet or did they use – for example a special device according to methodologies widely accepted by the scientific community for similar cases? Where is the material extracted in the process? Is it available for independent research and testing? Honestly, I dont know the answers but the questions have to be made. At this point, as in many other aspects of the Shroud we only have too many versions and very few facts. Is it possible to contact the team which performed the restoration and hear their version and what is more important, which was the fate of the extracted material?.","date":"2012-03-25","mins":"4:05 pm","url":"https://shroudstory.com/2012/03/25/two-thousand-years-of-chemical-history-was-destroyed/","cat":"news_&_views","title":"Two thousand years of chemical history was destroyed"},{"id":"comment-22507","author":"gabriel","post":"John, sorry to disappoint you, but the aragonite issue is far from being a proven fact..","date":"2013-01-24","mins":"7:28 am","url":"https://shroudstory.com/2013/01/24/a-most-avuncular-posting/","cat":"image_theory","title":"A most avuncular posting"},{"id":"comment-22517","author":"gabriel","post":"John, we have had extensive discussions on this blog about these points. The only two original papers to the best of my knowledge with some studies on the aragonite and the Shroud are as follows: KOHLBECK J. A., NITOWSKI E. L., “New evidence may explain image on Shroud of Turin”, Biblical Archaeology Review, vol. 12, n. 4, luglio agosto 1986, pp.23 24. LEVI SETTI R.,CROW C., WANG Y. L.: Progress in high resolution scanning ion microscopy and secondary ion mass spectrometry imaging microanalysis. (PMID:3931206) ”, Scanning Electron Microscopy 2, 1985; 535 552 The only spectra available are in the BAR paper which is not a technical review and mainly deals with historical/religious issues. We only have this spectra without any peer review process nor description of which methodology has been followed. Regarding the paper by Levi Setti paper, despite many references including BAR , no spectrum is provided. These two papers are really difficult to obtain so if you give me an email I can send them to you and you can decide by yourself after reading them. If you have any other information I am not aware of, I will be glad to read it and I am ready to change my mind at this point. But in my view, with the information we have so far I think that quite the contrary that for example in the field of forensic aspects we are far from having solid evidences..","date":"2013-01-24","mins":"8:41 am","url":"https://shroudstory.com/2013/01/24/a-most-avuncular-posting/","cat":"image_theory","title":"A most avuncular posting"},{"id":"comment-22542","author":"gabriel","post":"John, I think you have missed the point. It is not a question at a personal level. I dont know them personally and I can’t say whether they are unreliable, disreputable or truthful. All I am saying is that their work basically the chart with the comparison of aragonites has not gone through the scientifc standards which include peer review. Perhaps, they may be very good scientists I don`t know but in this case, their work has not met the usual standars by which science progresses. If we want a scientific debate on the Shroud, lets start by adopting scientifc protocols and methodologies at all stages, including evaluation of results. Peer review (with all its flaws and limitations that I can admit without problem) is one of them. If you dont need them, OK, but if we were to believe all the things that someone has ever written somewhere (and BAR is “somewhere” as far as spectra are concerned) on “astonishing findings” about the Shroud ……..ufffff!!.","date":"2013-01-24","mins":"11:58 am","url":"https://shroudstory.com/2013/01/24/a-most-avuncular-posting/","cat":"image_theory","title":"A most avuncular posting"},{"id":"comment-22525","author":"gabriel","post":"John:” Setti Levis used a scanning ion microprobe with which the wavelengths emitted by the two different samples could be readily compared ” and ” What are the odds that a medieval forger would use aragonite dust on his masterpiece of fraud that just happened to match the aragonite in Jerusalem.” This is the major difficulty. His results were never published anywhere but in BAR. The methodology he used and the results he reached were never submitted to a peer reviewed journal. Levi setti has never (to the best of my knowledge) confirmed or published his chart later. They simply appeared in the BAR issue. Sorry, but this is not science. I repeat, quite the contrary that in all the forensic aspects..","date":"2013-01-24","mins":"9:44 am","url":"https://shroudstory.com/2013/01/24/a-most-avuncular-posting/","cat":"image_theory","title":"A most avuncular posting"},{"id":"comment-22532","author":"gabriel","post":"In the previous round of discussions in this blog someone mentioned that Rogers left to Barrie 8 boxes with material. Perhaps only perhaps, new tests could be conducted on this material to elucidate this issue but so far, John, the evidences so far, are too weak and it is not clear at all that aragonite has been identified only because someone produced a chart and published it (this is the key point) in a non technical and non peer reviewed journal..","date":"2013-01-24","mins":"10:14 am","url":"https://shroudstory.com/2013/01/24/a-most-avuncular-posting/","cat":"image_theory","title":"A most avuncular posting"},{"id":"comment-17009","author":"gabriel","post":"I would also add a couple of things: 1. In the experiment, the Maillar reaction cannot progress forever because due to the massive release of amines, the final image would be blurred beyond 36 hours. 2. Maillar reaction originates water but if the amount of water produced accumulates and moves beyond certain boundaries, this will inhibit any further progress of the reaction. For this reason, the arrangement of the cloth might be a critical issue because a tightly wrapped linen is far more likely to capture water and inhibit further developments of Maillar. On the contrary, a loose cloth would allow evaporation of important fractions of the water generated by Maillar and subsequent progress of the chemical reaction..","date":"2012-09-28","mins":"6:09 am","url":"https://shroudstory.com/2012/09/28/a-touch-of-miracle-plus-a-maillard-reaction/","cat":"image_theory","title":"A Touch of Miracle Plus A Maillard Reaction"},{"id":"comment-32882","author":"gabriel","post":"I may be wrong but to me, some of the paragraphs here,seem to be directly inspired by the comments we usually read in Dan’s blog and then reappear as original reflections.","date":"2013-05-04","mins":"8:19 am","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-5947","author":"gabriel","post":"I agree….again everything has got out of control but I am afraid this time it is ENEA the one moving everything. I can imagine a reason for that. Italy as well as many other European countries is cutting badgets in all areas and also research. Probably, ENEA gets a lot of many from the government and perhaps they think they can get a reasonable budget for the next year if they become popular……I hope we don´t watch on TV Dr. Di Lazzaro explaining the burst of energy (or even better… anything regarding the S Hroud).","date":"2011-12-22","mins":"1:24 pm","url":"https://shroudstory.com/2011/12/22/abc-news-only-a-short-and-intense-burst-of-vuv-directional-radiation/","cat":"image_theory","title":"ABC News: ONLY “a short and intense burst of VUV directional radiation”"},{"id":"comment-16619","author":"gabriel","post":"Dan:Rogers spoke of a complex system. He wrote, in one instance, “I do not push a ‘diffusion model.’. I didn’t know that, but I fully agree with this point and I have written in that line in this blog Barry also recently mentioned in this blog that Rogers thought that other mechanisms apart from Maillard reaction were involved. All this depicts Rogers as someone truly open minded regarding the image formation mechanism and more specifically, the role of Maillard reaction. Surprisingly enough, some of his followers as we often see in this blog tend to be far more dogmatic than himself…...","date":"2012-09-20","mins":"5:08 pm","url":"https://shroudstory.com/2012/09/20/agenda-driven-shroud-science-what-a-pity/","cat":"image_theory","title":"Agenda Driven Shroud Science?  What a pity."},{"id":"comment-16624","author":"gabriel","post":"In this never ending sequence of “challenges” , ENEA reports, amateur research initiatives, books that might destroy the foundations of Christianity, and similar things we are seeing for more than 30 years, in my view, it is the Catholic Church one of the few actors that seems to act with some common sense,and as time goes by I clearly see and support more and more Her reasons not to carry out new experiments.","date":"2012-09-20","mins":"5:51 pm","url":"https://shroudstory.com/2012/09/20/agenda-driven-shroud-science-what-a-pity/","cat":"image_theory","title":"Agenda Driven Shroud Science?  What a pity."},{"id":"comment-14369","author":"gabriel","post":"I disagree. The image shows a connection between each point of the body and the image. A random migration of molecules in the frame of a isotropic flow based on Fick’s law would have never reacted with the resolution we see. One would expect a blurred image. In my view, a laminar flow of amines with a very low Reynolds number in small confined cells could be the only option because this would mean a quasi vertical motion and could perhaps explain why each point of the body is connected to each point of the cloth and not to a probability distribution function on the cloth..","date":"2012-07-31","mins":"6:55 pm","url":"https://shroudstory.com/2012/07/30/asking-thibault-for-more-details-concerning-rogers-hypothesis/","cat":"image_theory","title":"Asking Thibault for more details concerning Rogers hypothesis"},{"id":"comment-14350","author":"gabriel","post":"The first point is very difficult to explain according to the laws of fluid mechanics and would also be in contradiction with point #3, which impliciltly involves a laminar flow of amines. The main difficulty with point #1 is that anisotropy of the flow must neccesarily be a first order effect if the mechanism is based upon vertical convection cells (again in laminar flow). The very reasonable model of vertical cells is also in contradiction with amines coming from the lungs and in the first place, following a path towards the face, hair and body and eventually adopting a vertical laminar flow regime to impact the cloth and react. It is a trajectory that according to what we know on the motion of fluids and gases is impossible. If the compounds responsible for the maillard reaction were sweat the vertical convection cell model would sound more reasonable..","date":"2012-07-31","mins":"5:07 am","url":"https://shroudstory.com/2012/07/30/asking-thibault-for-more-details-concerning-rogers-hypothesis/","cat":"image_theory","title":"Asking Thibault for more details concerning Rogers hypothesis"},{"id":"comment-20382","author":"gabriel","post":"It is comforting to hear such honest positions from someone who “ensures every scientific support…to the Papal Custodian of the Shroud”. I am sure he will provide the Church with truly scientific advice..","date":"2012-12-13","mins":"4:14 pm","url":"https://shroudstory.com/2012/12/13/barberis-fantis-conclusions-are-not-scientific/","cat":"image_theory","title":"Barberis:  Fanti’s conclusions are not scientific"},{"id":"comment-16351","author":"gabriel","post":"Typo error:Just like previous challenges, and reports we see a new (anti)Shroud star emerging. Too bad..","date":"2012-09-16","mins":"2:11 pm","url":"https://shroudstory.com/2012/09/16/better-than-david-rolfes-dawkins-challenge/","cat":"image_theory","title":"Better than David Rolfe’s Dawkins Challenge?"},{"id":"comment-16339","author":"gabriel","post":"Colin, defines himself as a scientist. Ok, then start by adopting the protocols of science and if your scorching experiments are succesful, send a paper to a peer review journal. Please, don`t try to involve a prestigious institution to do the science that you haven’t already done. Are you suggesting that this institution should instead of yourself carry out the experiments, send results to a peer review journal and eventually say “Colin was right from the beginning”? Good luck, but my friend, this is not how science works and in my view, with this letter you are trying to get the attention from the media instead of from academic journals. Just like previous challenges, and reports we see a new (anti)Shroud emerging. Too bad..","date":"2012-09-16","mins":"7:34 am","url":"https://shroudstory.com/2012/09/16/better-than-david-rolfes-dawkins-challenge/","cat":"image_theory","title":"Better than David Rolfe’s Dawkins Challenge?"},{"id":"comment-18549","author":"gabriel","post":"Furthermore, this paper in ALSO a remix of another previous paper in the same journal (Applied Optics) published in 2008 by the same authors Giuseppe Baldacchini,1 Paolo Di Lazzaro,1,* Daniele Murra,1 and Giulio Fanti2 Coloring linens with excimer lasers to simulate the body image of the Turin Shroud. APPLIED OPTICS / Vol. 47, No. 9 / 20 March 2008 For example, in APPLIED OPTICS 2008 Figures 1 and 10 are the same as Figures 2 and 12 in APPLIED OPTICS 2012. To summarize, we have at least three papers, plus the ENEA report, plus several proceedings explaining the same since at least 2008!!. Obviously the peer review system is not working in these journals. Most serious journals, nowadays use specific software and a plagiarism report is issued for each new tentative paper http://scholarone.com/media/pdf/S1i Then cfs en.pdf. Obviously these two journals are not aware of this and their reputation (APPLIED OPTICS & JIST) can be seriously damaged with such episodes.","date":"2012-10-30","mins":"2:52 am","url":"https://shroudstory.com/2012/10/29/big-deal-peer-reviewed-scientific-paper-soon-to-be-published/","cat":"image_theory","title":"Big Deal Peer-Reviewed Scientific Paper Soon to Be Published"},{"id":"comment-18515","author":"gabriel","post":"This paper in Applied Optics is a copy of the same paper the authors published in another journal in 2010 (1). I hope that the editor of Journal of Imaging Science and Technology has previously agreed with authors the use of graphics and tables in this new paper. Otherwise, authors may get into problems for violation of copyright, regardless they also authored the previous paper, Even if so, to say the least and to keep polite, the authors do not give any new relevant information and re sell the same they have done before. Truly sad. ****************************************** Here is a non exhaustive short list of the figures and tables that are the same in both papers Applied Optics 2012:Figure 10 is the same as Figure 1 in Journal of Imaging Science and Technology 2010. Applied Optics 2012:Figure 11 is the same as Figure 2 in Journal of Imaging Science and Technology 2010. Applied Optics 2012:Figure 8 is the same as Figure 6 in Journal of Imaging Science and Technology 2010. Applied Optics 2012:Figure 5 is the same as Figure 5 in Journal of Imaging Science and Technology 2010. Applied Optics 2012:Figure 9 is the same as Figure 9a in Journal of Imaging Science and Technology 2010. Applied Optics 2012:Table is basically the same as Table 1 in Journal of Imaging Science and Technology 2010. Page 25 in Applied Optics 2012 “In summary, our results demonstrate that a short and intense burst of directional VUV radiation can color a linen cloth so as to reproduce many of the peculiar characteristics of the image on the Shroud of Turin, including the hue of color, the shallow penetration depth of the color, the inhibition of fluorescence. ” Page 040302 6 Journal of Imaging Science and Technology 2010. “In summary, our results demonstrate that a short and intense burst of directional deep UV radiation can provide a linen coloration having many peculiar features of the Turin Shroud image, including hue, coloration of only the outer most fibers of the linen yarns, and lack of fluorescence. ” ***************************************************** (1) Paolo Di Lazzaro, Daniele Murra and Antonino Santoni.Deep Ultraviolet Radiation Simulates the Turin Shroud Image .Journal of Imaging Science and Technology 54(4): 040302–040302 6, 2010..","date":"2012-10-29","mins":"3:47 pm","url":"https://shroudstory.com/2012/10/29/big-deal-peer-reviewed-scientific-paper-soon-to-be-published/","cat":"image_theory","title":"Big Deal Peer-Reviewed Scientific Paper Soon to Be Published"},{"id":"comment-20195","author":"gabriel","post":"We all know that there is a scientific way to finish with the “I think I see” game. Release the original images for public and open scrutinization and apply state of the art algorithms and techniques. In all cases so far, the authors of the coins letters flowers claims prefer to keep the original images for themselves, cook them in the “I think I see” oven, usually with the aim to bring the attention of the media and not of the scientific community. Shroud studies have been trapped in this kind of non scientific bad practices for years. So sad..","date":"2012-12-11","mins":"6:02 am","url":"https://shroudstory.com/2012/12/11/coins-on-eyes-issue-again/","cat":"image_theory","title":"Coins on Eyes Issue Again"},{"id":"comment-20341","author":"gabriel","post":"Louis, very interesting comment and a quick search in Internet indicates that Ari Kindler is truly an expert in ancient coins. Do you think that, if independently contacted, Dr. Kindler would confirm this result?.","date":"2012-12-13","mins":"5:33 am","url":"https://shroudstory.com/2012/12/11/coins-on-eyes-issue-again/","cat":"image_theory","title":"Coins on Eyes Issue Again"},{"id":"comment-20407","author":"gabriel","post":"Great! I am looking forward to reading that interview. Thanks for the information..","date":"2012-12-14","mins":"1:35 am","url":"https://shroudstory.com/2012/12/11/coins-on-eyes-issue-again/","cat":"image_theory","title":"Coins on Eyes Issue Again"},{"id":"comment-20209","author":"gabriel","post":"Max, well before Duran&HAL9000 fotographs many authors have claimed that they see things on images never released..","date":"2012-12-11","mins":"10:54 am","url":"https://shroudstory.com/2012/12/11/coins-on-eyes-issue-again/","cat":"image_theory","title":"Coins on Eyes Issue Again"},{"id":"comment-15846","author":"gabriel","post":"I think there is a long way between electrostatic fields of 49 V/m and the electrostatic field needed for a corona discharge. Certainly, no corona discharge could be obtained with a such a small voltage difference. However, I think Fanti is chosing at least in this occasion the right path to proof his hypothesis. Scientific work with state of the art tools like COMSOL and presentation at a Conference……. AT this point, I say the same that with the work by Di Lazzaro et al. Let them work and let’s evaluate where they reach. Their works like that by Rogers or any other must go through criticism and scrutinization by the scientifc community. They still have a long way ahead..","date":"2012-09-04","mins":"2:12 pm","url":"https://shroudstory.com/2012/09/04/corona-discharge-for-shroud-of-turin-to-be-presented-at-comsol-europe/","cat":"image_theory","title":"Corona Discharge for Shroud of Turin to be presented at COMSOL Europe"},{"id":"comment-5942","author":"gabriel","post":"By the way, Yannick. A month ago, I suggested to you in this blog a small experiment with this same sofware and your photos of some imprints left by leaves. Did you get any interesting result? It would be nice if you could share that with us…...","date":"2011-12-22","mins":"12:12 pm","url":"https://shroudstory.com/2011/12/22/do-your-own-vp8-like-3d-images-of-the-shroud-of-turin/","cat":"image_theory","title":"Do Your Own VP8-Like 3D Images of the Shroud of Turin"},{"id":"comment-20618","author":"gabriel","post":"Dan, I think this Deja Vu dates back to some years ago. This is what I wrote last October when you first announced it ***************** This paper in Applied Optics is a copy of the same paper the authors published in another journal in 2010 (1). I hope that the editor of Journal of Imaging Science and Technology has previously agreed with authors the use of graphics and tables in this new paper. Otherwise, authors may get into problems for violation of copyright, regardless they also authored the previous paper, Even if so, to say the least and to keep polite, the authors do not give any new relevant information and re sell the same they have done before. Truly sad. ****************************************** Here is a non exhaustive short list of the figures and tables that are the same in both papers Applied Optics 2012:Figure 10 is the same as Figure 1 in Journal of Imaging Science and Technology 2010. Applied Optics 2012:Figure 11 is the same as Figure 2 in Journal of Imaging Science and Technology 2010. Applied Optics 2012:Figure 8 is the same as Figure 6 in Journal of Imaging Science and Technology 2010. Applied Optics 2012:Figure 5 is the same as Figure 5 in Journal of Imaging Science and Technology 2010. Applied Optics 2012:Figure 9 is the same as Figure 9a in Journal of Imaging Science and Technology 2010. Applied Optics 2012:Table is basically the same as Table 1 in Journal of Imaging Science and Technology 2010. Page 25 in Applied Optics 2012 “In summary, our results demonstrate that a short and intense burst of directional VUV radiation can color a linen cloth so as to reproduce many of the peculiar characteristics of the image on the Shroud of Turin, including the hue of color, the shallow penetration depth of the color, the inhibition of fluorescence. ” Page 040302 6 Journal of Imaging Science and Technology 2010. “In summary, our results demonstrate that a short and intense burst of directional deep UV radiation can provide a linen coloration having many peculiar features of the Turin Shroud image, including hue, coloration of only the outer most fibers of the linen yarns, and lack of fluorescence. ” ***************************************************** (1) Paolo Di Lazzaro, Daniele Murra and Antonino Santoni.Deep Ultraviolet Radiation Simulates the Turin Shroud Image .Journal of Imaging Science and Technology 54(4): 040302–040302 6, 2010..","date":"2012-12-18","mins":"7:18 am","url":"https://shroudstory.com/2012/12/18/enea-folks-again-dj-vu-of-last-december/","cat":"image_theory","title":"ENEA Folks Again? Déjà vu of last December?"},{"id":"comment-20184","author":"gabriel","post":"Kelly, these experiments took place five or six years ago. Since then, from time to time the authors like in the recent case of the “new” paper in Applied Optics we read several weeks ago here republish once and again the same results. But no new experiments or advances are reported..","date":"2012-12-11","mins":"3:05 am","url":"https://shroudstory.com/2012/12/10/enea-magazine-special-edition-new-paper-on-shroud-of-turin-conservation/","cat":"image_theory","title":"ENEA Magazine Special Edition: New Paper on Shroud of Turin Conservation"},{"id":"comment-20304","author":"gabriel","post":"But it’s not clear to me how a.radiation effect might be able to encode 3 D info by variations in brightness. Intensity of energy fields typically decay with distance. Depending on the energy field (for example alfa particles) intensity and as a result, also distance from the source, could be associated to the degree of colouring of the fibers and in this way, an explanation could apparently emerge. However, in my view, two major difficulties remain: 1. All the fibers are coloured with the same intensity and the 3 D effect is macroscopic due to the changing proportion of coloured fibers per unit area. 2. Some authors seem to disagree at this point and in the absence of a final evaluation, IF AND ONLY IF the image is truly anisotropic with a clear preferential vertical path, this is an important challenge, because naturally occurring energy fields tend to be isotropic..","date":"2012-12-12","mins":"3:31 pm","url":"https://shroudstory.com/2012/12/10/enea-magazine-special-edition-new-paper-on-shroud-of-turin-conservation/","cat":"image_theory","title":"ENEA Magazine Special Edition: New Paper on Shroud of Turin Conservation"},{"id":"comment-19176","author":"gabriel","post":"I mean from left to right in the image but from right to left as we see it..","date":"2012-11-18","mins":"9:42 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?"},{"id":"comment-19175","author":"gabriel","post":"My children have 3 D glasses and after borrowing the glasses from them I have had a look at the photo provided by Dan. I share the 5 difficulties by Dan but in my view, there is a very strong objection missing: what original image have they used?. Is it freely available for reproduction of results? Is its origin traceable? However, I have found a few curious things, although I don’t know to which extent are the product of image treatment or truly are present in the image and the autors have only made them more evident: 1. Carlos Otal, in the past, has commented in this blog the point that the distance between the eyes is too small for a human being. Looking at the image, now this looks more evident and I am more inclined now to admitting the explanation given by him to this fact, e.g., that the image has a preferential vertical direction and is truly anisotropic. 2. Having a look at each eye, the claim that coins are present cannot be held anymore 3. The same with the flowers around the head. 4. However, in the neck three hebrew letters seem to appear in white profile from left to right; lamed (or perhaps mem), ayin and a final tzade.","date":"2012-11-18","mins":"9:39 am","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?"},{"id":"comment-19225","author":"gabriel","post":"Max, I do not have any proof to say whether it is an artwork or a true reconstruction. In the absence of any original picture available or a comprehensive description of the whole process, I was just playing the game “I think I see”. I know he sees flowers and coins. I don’t. I know he sees hebrew letters in the neck. I see “other hebrew letters”. Perhaps, as my children say, the 3d glasses I borrowed from them “are magic”: )) and in the absence of traceable and scientifically solid methods, I also have the right to play the same game…..Humm.. At this point, I have started thinking that these glasses are really magic..","date":"2012-11-19","mins":"6:00 pm","url":"https://shroudstory.com/2012/11/18/i-certainly-have-real-reservations-about-petrus-soons-3d-work-any-comments-now/","cat":"image_theory","title":"I certainly have real reservations about Petrus Soons’ 3D work. Any comments now?"},{"id":"comment-21464","author":"gabriel","post":"Although I tend to think that Rogers hypothesis is in a good position in the ranking of plausibility, in this blog we can customarily read what in my view, are too cathegorical statements on aspects that would need further and independent confirmation. This is particularly true in the aspects being discussed in this post, that in my opinion, to be definitively established as being this way or another, would need an independent verification with state of the art methods. After reading for months on the Rogers views about the structure of the fibers, the chromophore and the impurity layer, I have the feeling that the same arguments are being repeated once and again, we are moving in circles and almost everything eventually comes down to Rogers observations. I dont have any reason to doubt about his scientific profile, but at this moment, I have the impression the discussion does not progress the least and I need other observations to make my mind up and as said before, Rogers is in a good position in the ranking, but – I know some will not like this if objectively analyzed, is far from being the final explanation..","date":"2013-01-02","mins":"7:19 am","url":"https://shroudstory.com/2013/01/01/important-aspect-of-flax-fiber-microstructure-and-rogers-ghosts/","cat":"image_theory","title":"Important aspect of flax fiber microstructure and Rogers’ “ghosts”"},{"id":"comment-21470","author":"gabriel","post":"Yes, that’s the point Louis. Someone with a scientific mind like Rogers I am sure that would also appreciate some honestly formulated debate on his own theory, much more than having “followers” replicating paragraphs of his papers..","date":"2013-01-02","mins":"9:54 am","url":"https://shroudstory.com/2013/01/01/important-aspect-of-flax-fiber-microstructure-and-rogers-ghosts/","cat":"image_theory","title":"Important aspect of flax fiber microstructure and Rogers’ “ghosts”"},{"id":"comment-16446","author":"gabriel","post":"Nowadays from a scientific point of view, this kind of complex problems with a lot of unknowns, are methodologically addressed in a completely different way. At least, some crucial unknowns, involving several disciplines are (to mention a few): 1. Rogers himself speaking about an additional mechanism, apart or in combination with the Maillard reaction (Chemistry) 2. Origin, generation rate and characterization (molecular weight, viscosity, evaporation rate, Henry’s value) of amines/sweat involved (Forensic, chemistry) 3. Motion of amines (diffusion?, transport?, laminar flow?) (Physics, engineering, fluid mechanics) 4. Environmental conditions of a 1st century tomb in Jerusalem (Humidity, temperature) and of a dead body after xx hours (Forensics, History, meteorology/paleoclimate, physics). In highly complex problems like this, with so many critical parameters involved, is virtually impossible to put up one single experiment and obtain results, because you have to opt beforehand for a particular set of conditions, something that at the current stage is far from being clear. Addressing this problem involves a multidisciplinary team and an intensive previous stage of computer simulations with state of the art multiphysics software (CAE Linux in my view the most appropiate is freeware or COMSOL or Fluent or Star CCM+ could also do) running a big number of simulations covering different possible conditions. At this point, a reduced number of possible conditions would emerge and then, it would be the moment for experiments. It could also happen that all the combinations tested based on preliminary hypothesis were ruled out these things happen everyday and in that case, everything building new hypothesis, new conditions or historical scenarios never considered before, …. should have to be re thought from the scratch, thus moving to a new cycle of computer simulations under new conditions. This means, finantial support, multidisciplinary teams and a lot of time..","date":"2012-09-18","mins":"6:15 am","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-4335","author":"gabriel","post":"In a previous post, regarding the release of HAL9000 images someone asked was what the Archidiocesis of Turin afraid of. I think the Archidicocesis and the Chuch are afraid of exactly the type of discussions we are seeing these days in this blog. A lot of discussion on 40 years old evidences, a lot of personal remarks…….They must have reached the conclusion that no matter how solid the new evidences they have are (HAL9000+material from the 2002 restoration+..¿?) it would be impossible to have a serious and cold discussion on the facts. Once you release the images, how can you prevent someone from calling up the press and claim that he is seeing something. If not accepted, someone will always put through the idea that someone has been the victim of a plot to keep him silence? If a new C14 test is carried out with positive results, the following day someone will claim that the Church has changed the original fibres since 2002 lest the whole religion system crumbles. If it is negative, again, new claims will be made regarding the selected patch or any other issue. The Church knows how media work and can foresee that they could never expect a fair and cold debate, whatever the results are. After all, the Catholic faith basements do not rely on a “true” Shroud. SO most probably, they have already analyzed by themselves the evidences they have at hand and will never repeat the error of putting forward their new evidences so that 40 years later, discussions still go on. After all, never forget that the Catholic Church “does not need” outer scientists (like a second STURP) for this or any other issue. The Church has got their own and very high level experts on virtually every field involved, who can provide her with state of the art and cutting edge methodologies and procedures to address this and any other issue. Silently and peacefully while the whirl of the STURP which started nearly 40 years ago is still turning..","date":"2011-10-25","mins":"11:30 am","url":"https://shroudstory.com/2011/10/25/more-on-max-patrick-hamon-and-the-coin-on-eye-issue/","cat":"image_theory","title":"More on Max Patrick Hamon and the Coin-on-Eye Issue"},{"id":"comment-21475","author":"gabriel","post":"Well, the reweaving theory has also been refuted in a peer reviewd journal https://journals.uair.arizona.edu/index.php/radiocarbon/article/view/3419 but at this point I think there is enough secondary evidence that points to the direction that perhaps, after all the sample was taken from a medieval reweaving ( as Rogers said). When I say secondary evidence I am thinking about the recent detection of a trend and also the UV photos we saw in the paper by Morgan as commented last July in this blog. Regarding Fanti and Di Lazzaro’s work, sorry to say I see very little work and too much public relations. They have carried out only initial or preliminary tests on their theory something like 6 7 years ago (or more) and instead of progressing and going any deeper all we see since then is selling and reselling those preliminary results once and again. I would like to see more work on their side and where that work leads them but currently they seem unable to move any forward with new experiments..","date":"2013-01-02","mins":"11:36 am","url":"https://shroudstory.com/2013/01/01/important-aspect-of-flax-fiber-microstructure-and-rogers-ghosts/","cat":"image_theory","title":"Important aspect of flax fiber microstructure and Rogers’ “ghosts”"},{"id":"comment-7701","author":"gabriel","post":"I only hope that just because sciencebod’s “scientific” claims are not rigourous at all, that doesn’t automatically make Fanti and, more specifically, his supernatural explanations emerge as more rational and serious..","date":"2012-01-30","mins":"10:48 am","url":"https://shroudstory.com/2012/01/30/more-on-sciencebod-reacts-focus-on-paper-by-fanti-et-al/","cat":"image_theory","title":"More on Sciencebod Reacts (Focus on paper by Fanti, et al)"},{"id":"comment-4308","author":"gabriel","post":"It is this kind of pseudoscientific speculations that make so much harm. One picks up the last impacting headlines from a newspaper regarding a scientific challenge like that of the neutrinos and mixes it up with……..the Shroud to write a smart and “suggesting” question. Furthermore, the questions are wrongly formulated since neutrinos do not behave as described in the questions…..This path takes us nowhere..","date":"2011-10-24","mins":"6:02 pm","url":"https://shroudstory.com/2011/10/24/more-questions-than-neutrinos-in-the-universe/","cat":"image_theory","title":"More Questions than Neutrinos in the Universe"},{"id":"comment-4309","author":"gabriel","post":"It is sad that being the Shroud one of the few “mysteries” that could actually be true, it is put at the same level as notorious fakes like UF Os, Mayan Calendar, astrology and so on..","date":"2011-10-24","mins":"6:08 pm","url":"https://shroudstory.com/2011/10/24/more-questions-than-neutrinos-in-the-universe/","cat":"image_theory","title":"More Questions than Neutrinos in the Universe"},{"id":"comment-5957","author":"gabriel","post":"The news have jumped back to Europe. Now, in Spain, it is the “italian authorities” who claim that the Shroud is “supernatural” http://www.elconfidencial.com/alma corazon vida/2011/12/21/la sabana santa es sobrenatural segun las autoridades italianas 89663/.","date":"2011-12-22","mins":"4:38 pm","url":"https://shroudstory.com/2011/12/22/now-the-enea-report-on-msnbcs-cosmic-log/","cat":"image_theory","title":"Now the ENEA Report on MSNBC’s Cosmic Log"},{"id":"comment-4434","author":"gabriel","post":"In the post “Father Filas’ “Discover Pilate’s Lepton Coin” Paper Available”, Giorgio Bracaglia kindly offered a pwd for readers of this blog, so that we could download the original material from his website. I have done so, and thanks a lot Giorgio for it. Additionally, I have carefully read the full post “An Excellent Analysis of the Coins on the Eyes Issue” by Jos Verhulst from Antwerp. In my opinion, there are two major difficulties regarding the coin issue that I guess at this stage, are nearly impossible to overcome or revert. 1.All the photographies used were taken in the analogic era. In the case of father Filas they are second generation photos. The image analyzing techniques used at that time cannot be compared with current ones and determining the degree of validity corresponding to those techniques….is just impossible. In some cases, some of these photos have jumped into the digital era after being scanned. But how? For example, most scanners provide JPG images which though not visible at first sight, originate a compression of pixel values. Only TIFF images should be used. This is only an example. How much information –if any is lost in the way? I miss a thorough research on this aspects. 2.All the claims –as mentioned by Murra and Di Lazzaro are based on a subjectivity approach of the images. It is someone who sees something that the rest sometimes can see or not. However, the existance or not of hidden images is something that can be defined in an objective way. Current machine learning algorithms like Self Organizing Maps or Random Forests combined with Monte Carlo/bootstrapping techniques could provide a mathematical approach and determine if a discernible pattern exists or we are talking about noise..","date":"2011-10-28","mins":"6:32 pm","url":"https://shroudstory.com/2011/10/28/paper-chase-sight-and-brain-and-shroud-of-turin-images/","cat":"image_theory","title":"Paper Chase: Sight and Brain and Shroud of Turin Images"},{"id":"comment-5958","author":"gabriel","post":"Here we go again: “The Shroud’s origin is supernatural” http://www.mediterraneodigital.com/sociedad y tiempo libre/14 sociedad y tiempo libre/3620 la tecnologia del siglo xxi lo confirma la sabana santa es de origen sobrenatural.html.","date":"2011-12-22","mins":"4:44 pm","url":"https://shroudstory.com/2011/12/22/now-the-enea-report-on-msnbcs-cosmic-log/","cat":"image_theory","title":"Now the ENEA Report on MSNBC’s Cosmic Log"},{"id":"comment-4435","author":"gabriel","post":"The last days, I have tried to find the existing literature about coins/letters on the Shroud. To start with, I have exclusively sought literature on peer review papers belonging to the Journal of Citation Reports (JCR). For those readers not familiar with the JCR, I will briefly say that in every field of expertise there is a group of top journals in which the members of a given scientific community publish their results. This takes place only after at least two colleagues have scrutinized that paper and if finally accepted, it can be considered that there are not sound mistakes or repetition of previous results. This means that authors are making a contribution to the advance of knolewdge in that area. Depending on the impact of the papers published on that journal, the JCR also provides a ranking. Usually, the higher the journal is in the ranking, the more strict are the conditions to get a paper published. Before someone comes with the case of Nature (#1 in the JCR) and the C14 I will say that the errors in the datation–if any must be atributted to the sample selection stage, the only stage that peers could not scrutinize and had to give for granted. Never to any of the stages. Well, the only paper I have found that meets these standards is the paper by Marion in Opt. Eng. 37(8) 2308 2313 (August 1998). A quick consultation, indicates that in the field of Optics in 1998 there were 47 journals and Optical Engineering was in position #24. This means quite a good position in the ranking and you can bet that the paper by Marion went through a strict filter and was only published because the methodology followed was at that time a standard one, widely used and accepted by the rest of the scientific community in the fields of optics and image analysis..","date":"2011-10-28","mins":"6:34 pm","url":"https://shroudstory.com/2011/10/28/paper-chase-sight-and-brain-and-shroud-of-turin-images/","cat":"image_theory","title":"Paper Chase: Sight and Brain and Shroud of Turin Images"},{"id":"comment-4437","author":"gabriel","post":"Two additional results from Marion’s paper: Against having been painted “It is an isotropic image. The Fourier transform of the image shows no preferential frequencies, proving that no preferential direction exists in the image itself. Consequently, it is difficult to imagine that this image could have been made directly by a human hand.” The letters are originated the same as the rest of the image “Although the physical nature of the letters is not known, curiously their fine structure in the photos is the same as that of the body image: the letters are also formed by the variations of the size and the intensity of the rods. This characteristic is difficult to explain, but it shows that the useful information required to decipher the inscriptions is entirely contained in the image pattern. This observation is fundamental to understanding the image processing method.”.","date":"2011-10-28","mins":"6:37 pm","url":"https://shroudstory.com/2011/10/28/paper-chase-sight-and-brain-and-shroud-of-turin-images/","cat":"image_theory","title":"Paper Chase: Sight and Brain and Shroud of Turin Images"},{"id":"comment-4436","author":"gabriel","post":"After reading this paper, I see a serious attempt to overcome the difficulty of the gap between analogic/digital material while using a mathematical tool like Principal Component Analysis (PCA). “Many photographs of the face were digitized: a reproduction on film of the Enrie photograph (I931) and several others (negatives, slides, and paper prints) made by Vernon Miller in 1978 under various lighting conditions and in different wavelength bands (red, green, blue, IR).” After digitizing, he used PCA as a way to combine and extract the meaningful information from different wavelengths and sources. The outcome is a set of inscriptions obtained in an area around the face. “Before interpreting the graphical signs that the digital processing highlights, let us note that these signs are much larger (1.5 to 3 cm) than the fibers of the cloth (about 0.7 mm wide). This size is evidence of the fact that the letters are not artefacts due to the weaving of the cloth.” As an expert, he was well aware of the things that usually happens with images “But the digitizing and processing techniques can create their own artefacts, especially aliasing effects. Precautions must be taken to minimize such effects in digitizing and processing periodic structures. Such as a cloth. Note also a subjective artefact, called the Rorschach effect, which, for instance, makes shapes appear in randomly located stains on a paper. This effect is dangerous in interpreting inscriptions.” To avoid this: “To avoid false interpretations, we used criteria for deciding whether the signs that we see can correspond to real writings: l. The signs are not isolated but they form groups. 2. Their gray values are similar. 3. They have approximatively the same size, thickness, slope, and fashion. 4. They are correct Iy aligned and periodically spaced. 5. They have a significance because they form a word or a piece of word in a known language. If these five conditions are simultaneously verified, the probability of an artefact becomes very small. “ A final check: “To eliminate this possibility completely we made a final check: if we apply the same processing to a neighboring similar region and if this operation does not cause any graphical signs to appear, we finally decide that the group of signs must correspond to writings.” We can discuss on how good is this method but I would like to stress the idea that if this procedure had not been an acceptable one (in 1998), the peers would have rejected his methodology, his results and his paper..","date":"2011-10-28","mins":"6:36 pm","url":"https://shroudstory.com/2011/10/28/paper-chase-sight-and-brain-and-shroud-of-turin-images/","cat":"image_theory","title":"Paper Chase: Sight and Brain and Shroud of Turin Images"},{"id":"comment-4470","author":"gabriel","post":"I would like to focus the discussion on available facts and not on hidden agendas. If no matter how good a scientific approach is, someone’s work is to be judged by allegedly hidden motivations and conspirations we are going nowhere. Currently, knowledge moves forward in all fields of science through research made public in JCR journals. I admit that it is not 100% perfect but is by far the best system available and the one has made possible the advance of science for mankind. The analysis of the Shroud seems to be the only scientific field to be out of this system. If we substitute this standard system by one based on intuitions or reportedly agendas, honestly, I think we will never reach any conclusion. During the last weeks, I have found out that there are a certain number of serious attempts to take the Shroud issue into the scientific discussion by commonly accepted standards with JCR papers by Rogers, Adler, Di Lazzaro, Fanti, Marion, even Damon (Nature) and others. All of them have gone through a strict reviewing process by true experts and if we wanted to move to a scientific study of the Shroud, these works just cannot be disregarded on the basis of hidden motivations of the authors.Do we know more on optics and image analysis than the reviewers of Optical Engineering? Do we know more on C14 analysis than the reviewers of Nature?If the answer is “No (or even yes), but they have a hidden agenda” we will never be able to keep up to the standards of a serious scientific and systematic approach. If we want analysis of the Shroud to be just like any other scientific field, let’s start by adopting the criteria and protocols that have made science move forward..","date":"2011-10-31","mins":"7:03 am","url":"https://shroudstory.com/2011/10/28/paper-chase-sight-and-brain-and-shroud-of-turin-images/","cat":"image_theory","title":"Paper Chase: Sight and Brain and Shroud of Turin Images"},{"id":"comment-13153","author":"gabriel","post":"Yannick, I have read them all and as in previous occasions we have exchanged some comments under that post. I do appreciate all your hard work in explaining Rogers hypothesis. My view is that Rogers theory is chemically speaking rather solid but more research is needed regarding the motion of gases/amines and how this explanation fits in the anisotropiic vertical formation of image. That is why I am so interrsted if Thibault has made a preliminary model on diffusion!.","date":"2012-06-28","mins":"3:18 pm","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13049","author":"gabriel","post":"Dan, Thibault, I think that having access to the second part of this paper regarding the laws of diffusion (in my view the strongest difficulty) would be most interesting. In fact, after the previous discussions on Dan’s previous post on gas diffusion and the band effect, addressing a comprehensive discussion on the diffusion mechanisms is a must..","date":"2012-06-26","mins":"5:59 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13769","author":"gabriel","post":"A solid model describing the motion of amines from the body towards the cloth is still missing. Particularly, the motion of those amines coming from the lungs through mouth and nose. The movement of this amines from the nose to the hair and then towards the cloth to originate a Maillard reaction while providing a high resolution seems to me hard to understand. Again, the only person who seems to have made some initial calculations on this issue is Thimabult. I would reiterate my request to him: is it possible that you share your estimations with us in this blog for a honest discussion?.","date":"2012-07-12","mins":"2:30 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13363","author":"gabriel","post":"Anoxie :So far, based on basic models (plane and radial diffusion) to study gradient concentration, I think the diffusion hypothesis is consistent with image resolution. Regarding this crucial point I would say:only perhaps The reason is that in my view, vertical anisotropy and image resolution are closely linked and diffusion is isotropic. I also see difficulties in studying and modelling the process at a molecular and not a macroscopic level. However, after thinking quite a lot about this, I must admit that if that were the correct approach, the complexity of the problem would increase exponentially and by itself, it would explain another mistery: why so far, nobody has been able to provide a comprehensive model for image formation. This is why I would like to reiterate my strong interest in the first calculations that Thibault has made to address this problem. It would be great if he could share them in this blog for open and honest discussion..","date":"2012-07-03","mins":"4:13 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13120","author":"gabriel","post":"I would also say that addressing this problem as you mention, considering the number of gaseous molecules and not at a macroscopic level thus counting flow using volume per unit time units, confines the problem to a very specific set of conditions. This implies a very very low emission rate of amines/sweat/any other reactive compound/ and if so, modelling such a flow would not be so difficult..","date":"2012-06-28","mins":"2:59 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-13119","author":"gabriel","post":"Although you only have preliminary results obtained with a software (and not a full second paper yet) it would be great if you could share them in this blog. Being Rogers theory’s major difficulty the gas diffusion\\motion, I would love to discuss any initial research on this topic..","date":"2012-06-28","mins":"2:48 am","url":"https://shroudstory.com/2012/06/26/paper-chase-thibault-heimburgers-paper-on-the-maillard-reaction-hypothesis/","cat":"image_theory","title":"Paper Chase: Thibault Heimburger’s Paper on the Maillard Reaction Hypothesis"},{"id":"comment-4908","author":"gabriel","post":"If the Maillard or a similar biochemical reaction followed by a few years of ageing is responsible for the formation of the image, hasn´t anybody tried to reproduce it? I mean, if we are talking about amines and sugars plus blood and sweet you don’t need a human body to reproduce it. It should work also almost with any dead animal…..Just get a pork or a lamb killed a couple of hours ago, sprinkle it with blood and sweat and wrap a linen around it during 36 hours at a temperature of 10 12 ºC. Then get that linen and keep it in the oven for some minutes (a standard procedure to simulate ageing) and see what happens!! It could be an interesting experiment and if carried out under a minimum level of external and independent supervision could be most interesting. This experiment is neither expensive nor needs specially sophisticated instrumentation………and could be published in a peer review journal..","date":"2011-11-20","mins":"8:27 pm","url":"https://shroudstory.com/2011/11/20/quote-for-today-on-a-maillard-reaction-as-the-basis-for-an-image-on-the-shroud-of-turin/","cat":"image_theory","title":"Quote for Today on a Maillard Reaction as the basis for an image on the Shroud of Turin"},{"id":"comment-4955","author":"gabriel","post":"You two can try to present your very “creative” theories at the next International Conference on The Shroud of Turin in Valencia (Spain), April 28 30 2012 http://www.linteum.com/.","date":"2011-11-23","mins":"5:03 pm","url":"https://shroudstory.com/2011/11/23/poor-leonardo-must-be-turning-over-in-his-grave/","cat":"image_theory","title":"Poor Leonardo must be turning over in his grave"},{"id":"comment-13892","author":"gabriel","post":"Please, please!…..in 2012 you do not need a Ph D student to simulate a diffusion process like this. Currently, you have readily available software like FLUENT or STAR CCM to simulate the motion/diffussion of the amines (perhaps not the chemistry)from a body. Everyday, similar simulations applied to heat, human sweat and blood are being carried out for medical and confort evaluation purposes..","date":"2012-07-16","mins":"6:51 am","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image"},{"id":"comment-22000","author":"gabriel","post":"Hugh, could you hang somewhere those photos?.","date":"2013-01-14","mins":"12:17 pm","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","title":"Scorched Image by the Resurrection"},{"id":"comment-202965","author":"gabriel","post":"I think that the issue of the resolution will leave unsolved forever this matter of the coins. Another different question is the findings by Marion on the inscriptions. He published his results in a highly reputated JCR journal and explained step by step in a reproducible manner how he reached his conclusions. Due to the nature of the journal I am sure that he followed a methodology widely used and accepted by the scientific community. People who are not famliar whith standard methods of image processing criticized him very hard but no one was able to challenge his scientific methodology. Recently I was surprised to watch a documentary by Mark Guscin visiting a colleague of Marion at the Paris Institute of Optics who explained more or less. Since years ago Guscin had been one of the worst critics of Marion’s work (on linguistic grounds only) now in this recent documentary it seems that he does not completely rule out the possibility..","date":"2015-06-20","mins":"3:45 pm","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"},{"id":"comment-202966","author":"gabriel","post":"Typo error:who explained more or less the same.","date":"2015-06-20","mins":"3:48 pm","url":"https://shroudstory.com/2015/06/20/resolution-of-the-shroud-image/","cat":"image_theory","title":"Resolution  of the Shroud Image"},{"id":"comment-22001","author":"gabriel","post":"I mean the photos corresponding to your observations..","date":"2013-01-14","mins":"12:18 pm","url":"https://shroudstory.com/2013/01/14/scorched-image-by-the-resurrection/","cat":"image_theory","title":"Scorched Image by the Resurrection"},{"id":"comment-11110","author":"gabriel","post":"I may be wrong but I thought that Barrie who seemengly supports this consensus also supported Roger`s hypothesis…….","date":"2012-05-04","mins":"6:57 am","url":"https://shroudstory.com/2012/05/03/so-is-ray-rogers-hypothesis-out-the-window-by-consensus/","cat":"image_theory","title":"So is Ray Rogers’ Hypothesis Out the Window by Consensus?"},{"id":"comment-7081","author":"gabriel","post":"We are talking about the interpretation of experiments carried out and made public decades ago. Those who are in charge of the Shroud now and perhaps have carried out secret tests these years think that probably it is authentic and host exhibitions and studies in cathedrals worldwide http://elcabildo.org/noticias/malaga/item/1080 exposici%C3%B3n en la catedral sobre la sabana santa.html To me this is also a very strong indicator of authenticity, because the cult and interest on most of the relics has been abandonned. Why not in this case?.","date":"2012-01-17","mins":"3:33 am","url":"https://shroudstory.com/2012/01/16/the-3d-images-on-the-shroud-of-turin-are-not-unique/","cat":"image_theory","title":"The 3D images on the Shroud of Turin are not unique"},{"id":"comment-5137","author":"gabriel","post":"I see a diffciulty hear, because all the affected fibers have exactly the same level of coloration. It only changes the proportion of coloured fibers by unit area. This works for very close areas (with more likely contact between body and linen) and also for more distant areas from the body which according to your theory, are more likely to have been originated by a gas diffusion mechanism. If it is so, how is it that two different mechanisms (contact/chemical diffusion reaction) originate in the affected fibers the same level of coloration and the only difference goes to the proportion of affected fibers by unit square?.","date":"2011-12-01","mins":"1:46 pm","url":"https://shroudstory.com/2011/11/30/the-biggest-shroud-of-turin-mystery/","cat":"image_theory","title":"The Biggest Shroud of Turin Mystery"},{"id":"comment-5124","author":"gabriel","post":"Yannick, you have something in common with Fanti. He also believes that PARTIALLY, the image was formed by contact and/or chemical reactions….. So, I conclude that if each and every aspect of the Shroud is to be explained, perhaps we have to start thinking of a certain number of formation mechanisms operating simultaneously or sequentially on the same linen..","date":"2011-12-01","mins":"3:00 am","url":"https://shroudstory.com/2011/11/30/the-biggest-shroud-of-turin-mystery/","cat":"image_theory","title":"The Biggest Shroud of Turin Mystery"},{"id":"comment-10428","author":"gabriel","post":"Although I do not support your theory about scorching I do support your request for granting free access to any available material (that includes photos and HD images) for independent research. However, I bet that nobody will release anything. Welcome to the Shroud community!!.","date":"2012-04-16","mins":"5:25 am","url":"https://shroudstory.com/2012/04/16/the-image-on-david-rolfes-website-absence-of-eyebrows/","cat":"image_theory","title":"The Image on David Rolfe’s Website:   Absence of Eyebrows?"},{"id":"comment-14879","author":"gabriel","post":"Thibault: In the first place, thank you for putting all this together in your paper. In my view, after reading it I think that further research regarding Rogers hypothesis is definitively needed. Some of the difficulties we have been discussing here can also be found in your paper, now expressed in his own words. On the one hand, Rogers proposes a mechanism for image formation based on concentration gradients of amines due to diffusion. I have some difficulties with this but I also admit, that perhaps after all it could be possible. After all when he says that Concentration gradients are also formed by depletion of reactant(s) as a result of chemical reactions. When reactants hit the cloth and react, they are not free to diffuse parallel to the cloth. They produce products only where they hit the cloth. The adjoining areas must be hit by other columns of reactants to produce a color. Remember, diffusion from a surface occurs as a front not as a growing hemispherical volume. You can have collimation normal to the emitting surface these columnns seem to me very close to a laminar flow model. However, if we admit diffusion as the major mechanism, we cannot admit that The image of the hair was probably largely a result of ammonia from the lungs as we read in page 13 and as a result, Increased concentrations result in increased reaction rates. Did you ever wonder why the hair showed so much color? (page 7). This would imply that while in the rest of the body, as amines are produced, a gradient appears and a reaction takes place, in the area of the face, amines first move from the lungs through mouth and nose and then react. That model implies a different behaviour for the area of the face (two steps: motion to the hair first followed by diffusion and subsequent reaction) and the rest of the body (only reaction due to diffusion). If that were the case, it could be expected that the trail of preferential paths of those amines throughout the face could be detected. It is understood that the mechanism for this initial motion is gravity (we have heavy amines) so apart from those paths I would also expect a gradient between the different areas of the hair, since it is widely admitted that the head was not lying horizontally. Finally, I would also say that all the time Rogers assumes a maximum period of 36 hours for his reactions and he ignores how all these chemical reactions evolved after that. However, as a whole, I would say that Rogers hypothesis is in a good position in the ranking of explanations for the image fomation mechanism. Nevertheless, further research is needed to address some difficulties..","date":"2012-08-13","mins":"6:58 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."},{"id":"comment-6455","author":"gabriel","post":"This is why I hope Dilazzaro goes ahead with his experiments. He has been able to colour the fibers using a radiation and yet without affecting them the way Rogers predicted radiation would do..","date":"2012-01-02","mins":"6:16 am","url":"https://shroudstory.com/2012/01/02/thermo-stenciling-the-shroud-of-turin/","cat":"image_theory","title":"Thermo-Stenciling the Shroud of Turin?"},{"id":"comment-14889","author":"gabriel","post":"Good point, Yannick!.","date":"2012-08-13","mins":"9:19 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."},{"id":"comment-14897","author":"gabriel","post":"Yannick, please read the first comment of this post by Thibault.","date":"2012-08-13","mins":"12:30 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."},{"id":"comment-14913","author":"gabriel","post":"Daveb, honestly I don’t know and I also have difficulties with that quote by ROGERS regarding the diffusion mechanism.","date":"2012-08-13","mins":"7:16 pm","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."},{"id":"comment-14923","author":"gabriel","post":"Daveb, that sounds reasonable.","date":"2012-08-14","mins":"6:13 am","url":"https://shroudstory.com/2012/08/12/thibault-heimburger-i-hope-now-that-nobody-will-claim-that-there-is-no-maillard-reaction-and-no-color-at-room-temperature/","cat":"image_theory","title":"Thibault Heimburger:  I hope now that nobody will claim that there is no Maillard reaction and no color at room temperature."},{"id":"comment-18061","author":"gabriel","post":"Thibault, thanks for this work. I have found it really interesting because I have learnt a lot on the Shroud at fiber level. Its comparison with the scorch clearly indicates their different origin. I would like to suggest you a further step of this work and it could be the development of a mathematical model describing the patterns present in the colouring of fibers, something that you have qualitatively already done. From figures 20 onwards it seems to me obvious the existance in the Shroud at fiber level, of a consistent pattern regarding the color, layout, grouping of fibers…that in my view, could be described mathematically with state of the art algorithms. The advantage of this is that any future claim on tentative methods that could explain the image could be evaluated on the basis of the mathematical pattern obtained when analyzed at fiber level. A quick mathematical test on similarity of fiber patterns could be the key for evaluating to which extent the new tentative method reproduces the characteristics of the Shroud. Besides, what we see in figure 20 onwards, is really interesting. The coloured fibers tend to group in clusters of coloured fibers including a certain number of them. The really interesting thing is that colourized areas tend to follow the profile of the fiber and do not jump from certain areas of a fiber to another fiber leaving uncolorized zones. Why.? Finally, Thibault you once mentioned new apportions on the heavy amines issue. Have you written anything on this?.","date":"2012-10-22","mins":"4:47 pm","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-7001","author":"gabriel","post":"Very good point by sciencebod. I have a n th generation image of the Shroud someone gave to me so its origin and quality is dubtious. However, using a software that is freely available (Image J http://rsbweb.nih.gov/ij/download.html) that has also been commented in this blog and that allows 3 D visualization, I have obtained that the flat heights (3 D information) corresponding to the burnt areas are 20 30 times higher than those corresponding to the body. Since this image is black and white, the presence of intense white areas (burnt areas) originates this big difference with human figure areas. These seems to me a plausible explanation. We have a original image with 3 D information and years/centuries later very white stains appear that in a B&W image like mine give 20 30 times higher heights (3 D) values. However, I will not go any further because the validity of my small experiment is exactly zero due to the unknown origin of my own image. For this reason, this is not but a comment based on a very dubtious image. Once again it appears the problem of not having a centralized body for research with official images (or sticky tapes or…) freely available for anyone. I must also say that the exact origin and format of the image mentioned by sciencebod is unkwnon to me. However I would like to propose an experiment that could be coordinated from this blog (if Dan accepts of course) or from somewhere else (sciencebod’s own blog). 1. Perhaps someone has a Shroud image whose origin can be tracked and wouldn`t mind to share with the readers of this blog. It should be in TIFF format because the rest of formats like JPG distort the colour levels. This image would be made available to anyone for downloading. 2. Any reader could use either Image J or another sofware to carry out their own experiments independently on this issue. A certain deadline would be given to send all the results and possible theories/explanations,. 3. The results would be made public. Whatever they are..","date":"2012-01-15","mins":"9:59 am","url":"https://shroudstory.com/2012/01/15/tough-questions-from-sciencebod/","cat":"image_theory","title":"Tough Questions from Sciencebod"},{"id":"comment-5323","author":"gabriel","post":"Yannick: have a look at theseand tell me if it is not possible to account for all the details we see in the Shroud in the frame of these celebrations. If the situation goes a little bit further and someone is killed and wrapped with linen (just to follow the gospels in every detail), the Milliard reaction you are in favour of it or any other would work in the 14th century as well as in the 1st century. This accounts for my 25% of skepticism!!.","date":"2011-12-07","mins":"6:30 pm","url":"https://shroudstory.com/2011/12/07/why-do-we-think-it-is-an-image-of-jesus-on-the-shroud-of-turin/","cat":"image_theory","title":"Why do we think it is an image of Jesus on the Shroud of Turin?"},{"id":"comment-4396","author":"gabriel","post":"I am sorry Max. We should be talking about facts. This means a scientific approach not an intutive one. Are your results reproducible or not? Where are the photos you have used? Can other scientists repeat all the process following state of the art methodologies or not? I am sorry, intuition is not a valid methodology in this issue. We should not be wasting our time discussing obvious things. By the way, criptology is a science based on mathematics and linguistics, not on intuition. Once you have let us know your methodologies, I am afraid I cannot give any credit to your current and past claims any longer. PS: Is it here where the wise king (l’Shlomo) had his wineyard (Kerem)?.","date":"2011-10-27","mins":"12:10 pm","url":"https://shroudstory.com/2011/10/27/two-archaeocryptologists-three-opinions/","cat":"image_theory","title":"Two Archaeocryptologists, Three Opinions?"},{"id":"comment-5320","author":"gabriel","post":"Yannick, here it may go an answer. Nowadays in some Catholic countries like Philippines in Easter, in the frame of the Holy Friday religious celebrations they represent the crucifixion and some volunteers are hit like was Jesus, they wear a thorn crown and they even are “crucified” with ropes. These persons suffer a lot and need weeks to recover. It certainly was brought to Philippines by the Spanish. Nowadays, similar celebrations already take place in Spain, though not reaching so far as crucifiying someone like in the Philippines. This means that in the Middle Ages similar or you can bet that even more realistic celebrations used to take place at least in Spain, and in perhaps many others places of Europe. Why not consider the possibility ( I am using my 25% of skepticism at this moment : )) that in the frame of such celebrations which in harder or softer versions are quite a lot of centuries old they reproduced the crucifixition with all the details as gathered in the gospels and truly someone was killed? Who knows why… he volunteered for his sins, or because he needed to be punished for herecsy or….It is only one step beyond what we see nowadays in Philippines. In that context, the blood stains, the thorn crown…would appear in its correct place. I mean, the hypothesis of medieval forgery is compatible with the presence of blood and the rest of details, as you mention. If we come to the point of the crucifixion as a punishment and the argument that so many details had been forgotten since Roman times, I would answer that crucifixion was occasionally used in war times in the battlefield against enemies that had been captured. For these reasons, in my opinion, addressing the issue of authenticity, later or sooner takes us to the image formation mechanism. Currently, the formation mechanism(s) are not fully understood, and therefore the Shroud cannot be replicated. After so many years, we can conclude that whatever that mechanism is, it is highly complex/sophisticated. This is also a strong argument against a medieval forgery because if with current technology we cannot do something like that, it seems even more difficult for some in the Middle Ages (this belongs to my 75% of plausibility : ))..","date":"2011-12-07","mins":"4:37 pm","url":"https://shroudstory.com/2011/12/07/why-do-we-think-it-is-an-image-of-jesus-on-the-shroud-of-turin/","cat":"image_theory","title":"Why do we think it is an image of Jesus on the Shroud of Turin?"},{"id":"comment-8073","author":"gabriel","post":"A lot of experiments (including ENEA`s) have obtained partial results reproducing only some of the aspects of the image. Several types of scorching have been one of the most widely used attempts (Garlaschelli et al.). I would like to know which the results of your experiment are at fiber level. I mean, are you able to colour one fiber and not the next, while providing at a certain distance a 3 D effect attributable ONLY to the density of affected fibers by unit area?If with your method you could obtain that, you would be making an important contribution to the identification of the mechanism involved..","date":"2012-02-08","mins":"7:37 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"},{"id":"comment-5317","author":"gabriel","post":"Coming to the question: “why should the image be of Jesus and not from anyone else” I would say that it is very good question which takes us again to the issue of the authenticity. Regarding this point, I am only convinced around 75% because many things still remain unknown. One of the major reasons for that, is the way that research has been carried out all along these years. Someone has got access to some material (fibers, HD photos or any other) but results cannot be replicated because those materials are not freely available. Also, the researchers/scientists involved tend to appear too often in the media, thus taking the analysis of the Shroud out of the scientific forums and bringing the Shroud to tall shows on TV or newspapers’ “UFO&Mystery” section (apart from a very few number of serious works). The point is that what is described in those few serious works, cannot be replicated by anyone and authors must be trusted 100%, being very difficult the exploration of alternative explanations for their findings if original material is not available for independent research. I can believe authors in about 75% for some very astonishing findings on the Shroud, but not 100% if other researchers do not independently reach the same conclusions. This is a major difference when we come to a scientific approach if compared with any other “serious” research field. However, I also have a sociological positive indicator that makes me keep the probabilities in that 75% (and not reduce them). It is the position of the Catholic Church as a religious body, NOT as a scientific one. If we have a look at how the position of the Church has evolved in the question of relics during the last 100 150 years, we can conclude that slowly but intentionally, the cult to relics has been abandonned in the vast majority of cases. 200 years ago, in almost every Catholic Church and town in the old Europe there was a relic with some magical properties and a cult was performed around this relic. Now, only in a very few cases the cult and veneration associated to a relic still endures and in the rest (thousands of cases) it has simply been abandonned. The few relics that remain are like in the case of the Shroud of Turin, those which can exhibit strong though maybe not definitive historical credits. This is only my intuition and perhaps I am wrong, but I think that if the Church still goes on with exhibitions like the one we saw last year in Turin is because, after an inner research process, they have concluded that this cloth is likely to be the burial shroud of Jesus. But this is no more than a personal opinion that helps me reach what for me is a coherent figure (75%) for the estimation of probabilities.","date":"2011-12-07","mins":"2:42 pm","url":"https://shroudstory.com/2011/12/07/why-do-we-think-it-is-an-image-of-jesus-on-the-shroud-of-turin/","cat":"image_theory","title":"Why do we think it is an image of Jesus on the Shroud of Turin?"},{"id":"comment-5325","author":"gabriel","post":"If you look at it not as the attempt of a forger but as the unwanted result of the massive celebrations in Easter during the 14th century, the probabilities are not so low……..For this reason, I say that we always come to the image formation mechanisms, since the more we move forward in this field the clearer the authenticity or not will appear.","date":"2011-12-07","mins":"6:44 pm","url":"https://shroudstory.com/2011/12/07/why-do-we-think-it-is-an-image-of-jesus-on-the-shroud-of-turin/","cat":"image_theory","title":"Why do we think it is an image of Jesus on the Shroud of Turin?"},{"id":"comment-30888","author":"gabriel","post":"Well, as I have frequently commented here, actually I think that Marion’s work was serious. To the best of my knowledge, I think he was the first one to use Principal Component Analysis to deal with the fact that most the images he worked with, were taken in the analogic era. Very clever approach since with the first PC he was able to capture the most relevant information common to the all the images he worked with, including UV. However, now a strategy aiming at elucidating whether letters are present or not, involves using this supersize image and an intensive search of patterns which I am afraid it can only be addressed properly if a supercomputer is available.","date":"2013-04-15","mins":"1:30 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-8070","author":"gabriel","post":"REGARDING THIS COMMENT Sciencebod, it would be great if you could provide a solid reference on the typical depth of medieval paintings. 200nm seems to me a very thin layer to be obtaned with a medieval brush, but if you provide serious evidence I could admit that. However let me draw your attention to two additional aspects: 1. No directionality has been detected on the image which makes impossible the conventional use of a brush. Please, in this paper (*) you will find the results among other things of a Fast Fourier Transform analysis of the image which clearly indicates the lack of a preferential directionality, as could be expected from a more or less skilful artist using a very special brush. 2. As it has been widely reported, the 3 D effect is obtained by changing the fraction of coloured fibers by unit area, and all the coloured fibers have the same (more or less) intensity. Please note, that this would imply a medieval artist capable of colouring a linen fiber by fiber. REGARDING YOUR PREVIOUS COMMENTS: I do hope that you continue writing in this blog and that your next goodbyes to this blog, like the previous ones, are not definitive : ). Also, you can believe me that it is not necessary to mention your CV because, in this blog, you are not dealing with a bunch of illiterates. Out of the level of the discussions we are having here in the last times, I understand that behind most posts and comments there is a truly scientific mind. If you are so familiar with the scientific world, you will have noticed that some of the discussions (OK, in some other cases definitively not!) compare well (types of arguments, extensive use of references, respecftul exchange of opinions, many “I don’t know, I am not sure 100%” and acceptance of limitations…)with discussions in the academia. I think that your worst mistake has been to approach this subject as you were dealing with believers in astrology, extraterrestrial minds, tarots Mayan calendars and this sort of things. Most probably a clever and rational mind like yours has in previous ocassions been able to discover the fraud in a couple of days with 2 3 easy experiments. However, this is not the case. I am not completely sure either whether it is the original burial cloth of Jesus or not, but I think that there is enough evidence to state that whatever the image formation mechanism is, it is very complex. I hope that you join the discussions and contribute to identify the weak points on what in my opinion, is a truly scientific challenge. I don`t know if the promoter intended it so from the beginning, but this blog has become a very serious forum of discussion, whose full relevance and projection we will only be able to correctly appreciate in the forthcoming years. (*) Marion, Opt. Eng. 37(8) 2308 2313 (August 1998).In the field of Optics in 1998 there were 47 journals and Optical Engineering was in position #24..","date":"2012-02-08","mins":"5:20 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"},{"id":"comment-31082","author":"gabriel","post":"Hugh, I don`t agree at all that Marion`s methodology is sketchy. A quick consultation, indicates that in the field of Optics in 1998 there were 47 journals and Optical Engineering was in position #24. This means quite a good position in the ranking and you can bet that the paper by Marion went through a strict filter and was only published because the methodology followed was at that time a standard one, widely used and accepted by the rest of the scientific community in the fields of optics and image analysis. In this paper, I see a serious attempt to overcome the difficulty of the gap between analogic/digital material while using a mathematical tool like Principal Component Analysis (PCA). “Many photographs of the face were digitized: a reproduction on film of the Enrie photograph (I931) and several others (negatives, slides, and paper prints) made by Vernon Miller in 1978 under various lighting conditions and in different wavelength bands (red, green, blue, IR).” After digitizing, he used PCA as a way to combine and extract the meaningful information from different wavelengths and sources. The outcome is a set of inscriptions obtained in an area around the face. “Before interpreting the graphical signs that the digital processing highlights, let us note that these signs are much larger (1.5 to 3 cm) than the fibers of the cloth (about 0.7 mm wide). This size is evidence of the fact that the letters are not artefacts due to the weaving of the cloth.” As an expert, he was well aware of the things that usually happens with images “But the digitizing and processing techniques can create their own artefacts, especially aliasing effects. Precautions must be taken to minimize such effects in digitizing and processing periodic structures. Such as a cloth. Note also a subjective artefact, called the Rorschach effect, which, for instance, makes shapes appear in randomly located stains on a paper. This effect is dangerous in interpreting inscriptions.” To avoid this: “To avoid false interpretations, we used criteria for deciding whether the signs that we see can correspond to real writings: l. The signs are not isolated but they form groups. 2. Their gray values are similar. 3. They have approximatively the same size, thickness, slope, and fashion. 4. They are correct Iy aligned and periodically spaced. 5. They have a significance because they form a word or a piece of word in a known language. If these five conditions are simultaneously verified, the probability of an artefact becomes very small. “ A final check: “To eliminate this possibility completely we made a final check: if we apply the same processing to a neighboring similar region and if this operation does not cause any graphical signs to appear, we finally decide that the group of signs must correspond to writings.” Two additional results from Marion’s paper: Against having been painted “It is an isotropic image. The Fourier transform of the image shows no preferential frequencies, proving that no preferential direction exists in the image itself. Consequently, it is difficult to imagine that this image could have been made directly by a human hand.” The letters are originated the same as the rest of the image “Although the physical nature of the letters is not known, curiously their fine structure in the photos is the same as that of the body image: the letters are also formed by the variations of the size and the intensity of the rods. This characteristic is difficult to explain, but it shows that the useful information required to decipher the inscriptions is entirely contained in the image pattern. This observation is fundamental to understanding the image processing method.”.","date":"2013-04-17","mins":"12:33 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30748","author":"gabriel","post":"Analyzing 72 Gigabytes is not an easy task. Most probably, a supercomputer would be needed with parallelization strategies for calculation purposes. This means, that commercial softwares would not work and specific developments in purpose oriented software would be needed. I think that few previous examples (or none at all) of a similar research are recorded so in my view, a whole research plan should be designed from the scratch. I understand that topography like info has been used to store the images so applying state of the art and already fully validated techniques are likely to yield an enormous amount of useful results, regarding image formation mechanisms, letters, coins and so on. They do not mention whether they have images only in the visible spectrum but if UV and IR images had also been taken, a very promising material would be available. Addressing such a research would definetively require a serious planning and implementation by a group of scientists and the outcomes would represent an important step forward in Shroud research. I will also say that I was not aware of the amount of gigabytes of these images and now I understand that releasing the images for free research is not an easy task and should be done in the frame of a serious research plan..","date":"2013-04-14","mins":"8:58 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-31095","author":"gabriel","post":"O.K. If we use pixels, the exact values of probabilities for a given letter can be assessed mathematically. For example, if the whole image of the Shroud is analyzed in squares of let’s say, 10 cm, depending of the resolution, we have inside a certain number of pixels. Pixel values oscilate between 0 and 255, so at a initial stage, we can increase contrast inside each square by assigning 0 value to any pixel with initial value below 255/2 and 255 to any above 255/2. Imagine that in that square of suppose 100 pixels, we have ten black pixels aligned resembling an “I”. By calculating the number of configurations in a square that 90 white pixels and ten black pixels can adopt, you can easily estimate the probability that by pure chance ten black pixel align forming the “I” that you see. The same for any other letter, symbol, coin or whatsoever and applying the same for different square sizes. The results obtained would be consistent and could be expressed in terms of probabilities. This can very easily be programmed in C++, FORTRAN or R but it would need parallelization strategies in a supercomputer if a 70 Gb image is to be used.","date":"2013-04-17","mins":"4:02 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30866","author":"gabriel","post":"In my view, trying to replicate Marion’s work, published in a serious peer review journal could be one of the first objectives in the frame of a major research plan. In the case of Filas’s coins or Dannin’ s flowers, the methodology would be the same. But as I mentioned before, currently the major limitation to start a serious study is that most probably, a supercomputer would be needed..","date":"2013-04-15","mins":"9:03 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-23676","author":"gabriel","post":"To me, this is one of the most intriguing properties of the image. If it is true, leaves little room for a diffusion mechanism associated to a chemical reaction (Maillard or other) with amines heavier than air. In this case, only the presence of a thermal gradient between body and cloth in the frame of a laminar flow with very very low Reynolds number, could be an explanation in the frame of a chemical reaction model for the image. However, beyond a general approach, even so, describing the exact mechanism for the motion and reactions of amines/sweat/vapors from the body to the impurities of the cloth seems to be a very difficult task if the image exhibits this vertical preferential direction beyond any doubt. A lot of research would be needed. In this sense, if the image is truly anisotropic, this certainly challenges the model by Rogers, not in the chemical part of it but yes in the motion of reactants and how they get in contact with each other. For this reason I think that making compatible the vertical direction of the image and a comprehensive model for motion of amines, currently represents a major challenge for the supporters of Rogers approach..","date":"2013-02-07","mins":"7:34 am","url":"https://shroudstory.com/2013/02/07/topic-of-the-day-7-vertical-mapping-of-a-human-form/","cat":"topic_for_today","title":"Topic of the Day (#7): Vertical Mapping of a Human Form"}]
