[{"id":"comment-29637","author":"gabriel","post":"Russ, I am afraid I don’ t agree with you. I think a new C14 test can be the end of any serious attempt to analyze the Shroud. It just won’t work. Someone mentioned here that he Archbishop is considering a new radiocarbon test. I hope they don’t do so, because in this last year, new evidences after many previous ones have arisen on the unappropiateness of C14, in general and more particularly in the case of the Shroud. Among the last ones, in my view, the identification of a trend with solid statistical techniques and published in a serious JCR peer reviewed journal is by far the most relevant. By the way, to be fair, coauthored by Fanti. The connection with the C14 test comes when we see the UV images of the sample area after a PCA analysis, as described in the paper by Morgan of last summer. The PC’s in a PCA usually describe a mechanism that is not detectable at first sight. If in this paper we have a look at the first PC image (UV) of the area, we can easily distinguish a gradient due to an unknown mechanism operating. This mechanism could simply be associated to the different degrees of handling, rubbing, and touching by millions of hands throughout the centuries. But the point is that this photo was taken (by Barrrie, I think) before the C14 test of 1988 and in it a gradient can be easily detected. Now, almost 30 years after the photo was taken, the same gradient is detected in the form of a trend in the C14 counts of the sample!! This implies that whatever the mechanism responsible of the gradient was (most probably some sort of biocontamination) it could not be removed from the sample, and reappeared again in the form of a trend when C14 atoms were counted. Please note, that this would be compatible with a medieval reweaving and also that in the most recent general literature on C14 we have largely commented here, the major problems in all cases are associated to similar problems: low effective methods of removing contamination of any type prior the test. I do not know if this limitation will ever be overcome, but currently it is not, so highly contaminated objects like the Shroud cannot be appropiately dated with this technique. Given this fact, I think it is time to move towards other approaches in Shroud research but always following truly scientific protocols and methodologies like peer review and traceable chain of custody..","date":"2013-04-06","mins":"9:36 am","url":"https://shroudstory.com/2013/04/05/a-committee-far-removed-from-padua/","cat":"news_&_views","title":"A Committee Far Removed from Padua"},{"id":"comment-16013","author":"gabriel","post":"To start with the discussion concepts like randomness and infinite, should be clearly defined beforehand, something than at the current point is far from being clear. The fascinating ongoing research in many fields on why certain laws like, Benford or Zipf seem to “wrap” randomness is a clear example. Why the first digits of the amounts in bank cheques used by millions of clients not previously connected must follow the Benfords law? Why banks can use this law to detect frauds? Why languages, meteorological measurements and a long list of apparently random parameters, when analyzed follow Zips law? Randomness is currently something to be far from being completely defined in all its implications to be used in the realms of philosophy..","date":"2012-09-08","mins":"8:22 am","url":"https://shroudstory.com/2012/09/08/a-curmudgeon-what-if-another-god-next-to-him-is-doing-a-different-simulation/","cat":"news_&_views","title":"A Curmudgeon: What if another God next to him is doing a different simulation?"},{"id":"comment-16024","author":"gabriel","post":"My interest with Benfords law comes from my scientific activities, but regarding the Shroud I have always thought that if pixel values of the coloured areas followed Benfords law, that would certainly have incredible implications..","date":"2012-09-08","mins":"4:46 pm","url":"https://shroudstory.com/2012/09/08/a-curmudgeon-what-if-another-god-next-to-him-is-doing-a-different-simulation/","cat":"news_&_views","title":"A Curmudgeon: What if another God next to him is doing a different simulation?"},{"id":"comment-10585","author":"gabriel","post":"Thanks a lot Ron. This is quite new to me. I have to think a little bit about it. Thanks again..","date":"2012-04-19","mins":"7:04 am","url":"https://shroudstory.com/2012/04/17/a-million-people-to-see-jesus-holy-robe/","cat":"news_&_views","title":"A million people to see Jesus’ Holy Robe"},{"id":"comment-16065","author":"gabriel","post":"Daveb: In my view, if a process follows Benford and/or Zipf’s law, this represents the signature of a phenomenon which takes place without intervining an external major vector trying to redirect that phenomenon. In the case of banks, a systematic fraud in cheques changes the statistical profile of the natural/random convergence of millions of clients with their cheques.Another example: the population in American cities follows Benford’s law but for example, if the government an external vector enforced deportations and direct a significative amount of persons to several cities, this would alter the “natural” movement of population and a departure from Benford`s law would be detected. This is more evident with Zipfs law and even some scientific peer review literature is currently available in other fields like meteorology (*) suggesting something similar. If we translate this to the Shroud we can find mathematical indicators that could be tested for compliance of Benford and/or Zipfs law. I mentioned the values of colourized pixels appropiately rescaled to freely move beyond the 0 255 boundaries , but could be other dimensions or ratios of dimensions of the Shroud. The rationale would be the same: if the Shroud has been generated by a how could I make myself understood at this point? “naturally flowing” process like for example, the one suggested by Rogers, we could expect that those mathematical indicators could follow Benfords/Zipfs law. If the process had been mainly directed by an external force, for example, scorching or painting, an important departure from Benfords law could be expected. (*) C. Primo, A. Galván, C. Sordo, J.M. Gutiérrez, 2007.Statistical linguistic characterization of variability in observed and synthetic daily precipitation series.Physica A: Statistical Mechanics and its Applications Volume 374, Issue 1, 15 January 2007, Pages 389–402.","date":"2012-09-09","mins":"3:27 pm","url":"https://shroudstory.com/2012/09/08/a-curmudgeon-what-if-another-god-next-to-him-is-doing-a-different-simulation/","cat":"news_&_views","title":"A Curmudgeon: What if another God next to him is doing a different simulation?"},{"id":"comment-10561","author":"gabriel","post":"Regarding the chalice of valencia there seems to be a consensus of art experts so as to having been manufactured 2000 years ago in a Middle East workshop. The existing chalice has an original part carved in calcedonia (a type of stone) plus additional parts widely accepted to have been added in medieval times.There is quite a lot of literature (mostly in Spanish) but perhaps you could start from http://www.catedraldevalencia.es/en/index.php where you can find some info. However, having been manufactured at the time of Jesus and in the area where he lived, does not necessarily mean that the tradition which considers this chalice to be the cup used in the last supper is 100% true. I am afraid that we will never be able to go much further. It also seems a historical fact that in medieval times, when Spain was mostly under islamic rule, this chalice was safely kept in a remote monastery in the Pyrinees called San juan de la Penia. Some experts in medieval literature also think that the geographical environments described in the first tales of the grial, for example Parsifal by Wolfram von Eschenbach, can be located in this remote monastery, surrounded by mountains. However, it is fair to say that other experts do not share this opinion, although some link between the chalice of valencia and the grial legends is more commonly accepted..","date":"2012-04-18","mins":"5:36 pm","url":"https://shroudstory.com/2012/04/17/a-million-people-to-see-jesus-holy-robe/","cat":"news_&_views","title":"A million people to see Jesus’ Holy Robe"},{"id":"comment-10519","author":"gabriel","post":"Yannick, there is another relic with strong historical credits to be authentic, or at least 2000 years old. It is the Chalice of Valencia, which according to art experts might have well been carved in Middle East 2000 years ago, although that does not necessarily mean that it is the Grial or the cup Jesus used in the Last Supper. Coming to the C14 again, the whole issue is as simple as this: it is not an appropiate technique for dating cloths like the shroud or the sudarium. We know this now but not in 1988, when C14 was believed to be an universal technique. Now we know it can only be applied in certain cases and in many others is not reliable..","date":"2012-04-18","mins":"1:36 am","url":"https://shroudstory.com/2012/04/17/a-million-people-to-see-jesus-holy-robe/","cat":"news_&_views","title":"A million people to see Jesus’ Holy Robe"},{"id":"comment-10575","author":"gabriel","post":"By the way, I have just discovered that a shroud scholar, Dan Scavone http://www.shroud.com/scavone2.htm supports the idea of a strong connection between the Shroud and the Holy Grail to the point that in his view, they could have been the same object..","date":"2012-04-19","mins":"1:50 am","url":"https://shroudstory.com/2012/04/17/a-million-people-to-see-jesus-holy-robe/","cat":"news_&_views","title":"A million people to see Jesus’ Holy Robe"},{"id":"comment-15408","author":"gabriel","post":"Dan, do you know or can anyone provide a link or an address where that incredible paper regarding “the XX male” can be obtained from? Who was in that research team? How did they get access to both cloths and obtain the samples? Is it another fake?.","date":"2012-08-23","mins":"12:16 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-6968","author":"gabriel","post":"The first JCR rank available dates back to 1997. Neither in 1997 nor in 2010 there is a journal called “The microscope Journal” so, at least in that period the journal is not in the JCR system because i)it is not published any longer ii) its quality is so poor, that is no considered into the system By the way,some recent papers published in the JOURNAL OF IMAGING SCIENCE AND TECHNOLOGY have been commented in this blog. This journal has an impact factor of 0.513 and is in position 15th out of 19 in the field of IMAGING SCIENCE & PHOTOGRAPHIC TECHNOLOGY..","date":"2012-01-14","mins":"10:08 am","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","title":"And you thought you knew all about peer reviewed journals."},{"id":"comment-17805","author":"gabriel","post":"You know, it is very curious about ley linens. In the last years my research activities also involve the intensive use of GPS and at this moment, I tend to put virtually any information on a map. I came across the paper by Scavone in the 1988 Ohio Canference titled BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400. He suggests that before coming to France, the Shroud was in Athens so I made in R a quick map connecting Jerusalem (were for sure the S Hroud once was), Athens and the final destination (Lirey). W Ith an error of about 5% the three places are aligned and the proportion of their distances follows the golden ratio. I mean you can find anything you want when you start drawing lines on a map!. If Dan agrees I can provide a figure ..","date":"2012-10-18","mins":"11:19 am","url":"https://shroudstory.com/2012/10/18/burgh-island-in-devon-key-to-world-piece-and-the-mystery-of-the-shroud/","cat":"news_&_views","title":"Burgh Island in Devon: Key to World Peace and the Mystery of the Shroud"},{"id":"comment-27229","author":"gabriel","post":"In 2007 the new owner of the Shroud, Pope Francisco I, wrote the foreword (*) of a book written in Spanish by the journalist of “Il Giornale” Andrea Tornielli. The book’ s title is “La resurreccion” and the author includes among the evidences in favor of the historicity of the Resurrection a whole chapter devoted to the Shroud of Turin. I don’t know if writing a foreword can be understood as a full endorsement of the content of the book, but being himself a chemical engineer, perhaps only himself we can expect a new phase regarding Shroud studies. (*) http://edant.clarin.com/diario/2007/04/04/deportes/m 00415.htm.","date":"2013-03-13","mins":"4:49 pm","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","title":"CNN: Enhance your conclave experience . . ."},{"id":"comment-6907","author":"gabriel","post":"I know a couple of additional Open access editors that do not appear in the list and unfortunately, among many other papers on a wide range of subjects, have also published “scientific” works on the Shroud. The only scientific literature commnly accepted in the academia (and elsewhere) corresponds to the journals belonging to the Journal of Citation Ranks (JCR) with its peer reviewed and impact factor system. I know that it is not perfect, but it is by far the best we have. To my surprise, a few months ago I discovered that there are quite a lot of papers on the Shroud published in JCR journals. These are the ones that even with a dose of skepticism, OK so far are, in principle, to be considered serious research..","date":"2012-01-13","mins":"6:54 am","url":"https://shroudstory.com/2012/01/13/and-you-thought-you-knew-all-about-peer-reviewed-journals/","cat":"news_&_views","title":"And you thought you knew all about peer reviewed journals."},{"id":"comment-27230","author":"gabriel","post":"Typo error: perhaps only perhaps we can…..","date":"2013-03-13","mins":"4:50 pm","url":"https://shroudstory.com/2013/03/13/cnn-enhance-your-conclave-experience/","cat":"off_topic","title":"CNN: Enhance your conclave experience . . ."},{"id":"comment-8201","author":"gabriel","post":"Ron, Nature is together with Science the most serious and considered scientifc journals. It is a peer reviewed journal where typically a very high percentage of tentative papers are rejected due to the difficulties raised by the referees. Therefore, I would also assume that the c14 paper also went through a such a process. You mention that the c14 Shroud paper was never ‘peer reviewed’ originally, could you extend on this a little bit, please? If we are talking about Nature not submitting a paper to peer review before publishing it only for non scientifc reasons, this would be a very serious subject for Nature. In my opinion, the c14 test was applied correctly but perhaps on the wrong sample. Futhermore, in 2011 there seems to be enough evidences gathered in the scientific literature these years that indicate that the c14 test might not be appropiate to date the Shroud. Something that perhaps in 1988 was not so clear. I have written some comments about this here so I won`t come back to this point again, but I tend to think that the C14 experiment itself was carried out following generally accepted standards. Otherwise, I think it would never have been accepted for publication in Nature..","date":"2012-02-13","mins":"3:45 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","title":"Comment of A Superfluous Man Brought to the top"},{"id":"comment-8210","author":"gabriel","post":"Today a recently published paper in a serious journal of physics (*) has been widely commented in different newspapers (**). I have downloaded the full version from my institution`s library. The point is that the authors have been able to model mathematically the profile of human hair ponytails. I have read somewhere that on the back image of the Shroud at the head level a ponytail can be devised. I inmediately have wondered if using a high resolution image a test could be carried out: does that ponytail follow the mathematical shape expected for a human ponytail? Would it be possible to obtain information on whether that ponytail was in vertical or horizontal position? (*) PRL108,078101(2012) PHYSICAL REVIEW LETTERS. Shape of a ponytail and the statistical physics of hair Fiber bundles. Raymond E. Goldstein, Patrick B. Warren, and Robin C.Ball. Department of applied mathematics and theoretical physics,University of Cambridge (**) http://www.nytimes.com/2012/02/11/science/ponytail shape is determined by complex physics.html http://www.dailymail.co.uk/sciencetech/article 2100530/Rapunzel number lets scientists predict shape ponytail–solving problem posed Leonardo da Vinci.html.","date":"2012-02-13","mins":"6:10 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","title":"Comment of A Superfluous Man Brought to the top"},{"id":"comment-26421","author":"gabriel","post":"Good point, Stephen. I agree 100%. However, I would add that Shroud studies have not always followed the standards methods and protocols true scientific research is to keep to. Mainly after the works by the STURP generation. Regarding CB’s call to the RS, it is really amazing that now he does not want the RS to demonstrate the scorch theory (like a few months ago). No, he wants to involve the RS to analyze the blood first theory which makes everything even more confusing. I sort of understand this move as an implicit admitance of the difficulties he has found with the scorch theory. This seems as he wanted someone else to take over his work, disappear from the scene, start blogging on the origin of the “euskaldunak” and let someone else (RS) take the dialectic blows of his poor scorch theory. Good luck again Colin..","date":"2013-03-04","mins":"2:31 pm","url":"https://shroudstory.com/2013/03/04/defining-pseudoscience-it-takes-a-rocket-surgeon/","cat":"news_&_views","title":"Defining Pseudoscience:  It Takes a Rocket Surgeon"},{"id":"comment-12530","author":"gabriel","post":"Colinsberry :The problem with any imaging model that involves gaseous diffusion is that gas molecules behave like snooker balls. They travel in a straight line until they strike another ball, then come off at an angle, travel some more in a straight line, collide, come off at another angle. After a relatively few collisions we can safely say that the direction of movement of molecules is random, but we can safely predict they gradually get mixed up with all the other molecules, and “spread out in all directions”. It’s all very well talking about mean free path, but at atmospheric pressure the mean free path before a particular molecule strikes another one is very small, and if the molecule is a minor constituent it will tend to collide with an “air molecule”, i.e. Nitrogen, oxygen etc, rather than its own type, This is basically true unless a laminar regime with a very low Reynolds number (I would say below 10) can be established. And I also agree that it is in contradiction with the gas diffusion model as described by Rogers.","date":"2012-06-15","mins":"1:08 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12475","author":"gabriel","post":"Yannick, in the first place thanks for putting all this together. I don´t have important difficulties with the nature of the chemical reactions involved under the hypothesis by Rogers. I could say the same if vapors were also sweat or any other product of decomposition. However, in my opinion, major difficulties arise regarding the motion of gases. The hypothesis of Rogers can only be understood in the frame of a very low emission rate of gases from the body, with a density smaller than air and slowly flowing in laminar regime. That applies to the frontal image. (The back image perhaps was formed with other mechanisms involved?). According to this model, from each point of the body a strictly vertical motion of reactive gases from the body impact the cloth (impurity layer?, outermost part of the fibers?). Then a (Maillard?) chemical reaction takes place, and the surface of the cloth gets colorized. In my view, this is the only model which according to the basic laws of Fluid Mechanics clould explain the vertical correspondence between each point of the body and the image. For this reason, I find extremely interesting the recent post regarding Ray Schneider’s statement on the vertical directionality of the image. This fact could really make sense for i)the chemical part of Rogers hypothesis (or sweats/differente gases) ii) and the –in my view only possible description according to the laws of fluid mechanics. However, after reading your post, I noticed that Rogers also had a model for the motion of gases, that in some aspects I am afraid cannot fit in what we know about fluids. 1.“Gaseous reactive amines can be lost by diffusion through the porous cloth, reducing concentrations and reaction rates inside the cloth. However, it has long been recognized that the images of the hair, moustache and beard are anomalous. The density of the image is greatest in those areas. That can easily be explained by the inhibition of vapor diffusion through a porous mat of hair. Ammonia is first evolved from the lungs. Therefore, its concentration would have been highest in the vicinity of the nose and mouth, and its diffusion would have been retarded by the moustache and beard. By the time heavy decomposition amines appear, the body will have cooled. The surface area of cloth is large and higher molecular weight decomposition amines absorb strongly. All of these phenomena would cause a RAPID REDUCTION IN AMINES CONCENTRIATION AWAY FROM THE CONTACT POINTS AND THE NOSE MOUTH AREA.” Rogers is thinking of a diffusion mechanism inside the cloth or through a porous mat of hair or from the lungs into the moustache and beard. This is in conflict with a laminar flow from the body and impacting and reacting on the cloth. The result of a difussion would be a blurred image and a clear point by point vertical correspondence between body and cloth could not be expected. 2.“Most of the very volatile ammonia diffuses out through the nose and mouth soon after death. This fact may explain the darker image color between the nose and the mouth AND THE PENETRATION OF IMAGE COLOR IN THE VICINITY OF THE HAIR.” (Note : Here, Rogers made reference to a possible image of the hair visible on the back side of the cloth). At this point, I think that Rogers is proposing a horizontal motion of volatile ammonia (with lower molecular weight than air) towards the hair. Being lighter than sourrounding air a vertical (and not horizontal) motion should be expected. 3.“The lower density of the hair makes it UNLIKELY that large amounts of either HEAT OR RADIATION WOULD HAVE BEEN PRODUCED IN THE HAIR. This suggests that vapor diffusion was involved in image formation, because any fibrous mat, INCLUDING HAIR, reduces the rate of diffusion of gases. Fiber mats are used for insulation, because they reduce gas diffusion and heat transfer by convection.” (Note : This is a very strong argument from Rogers against any kind of hypothesis involving a burst of energy during the resurrection of Christ. For Rogers, because of it’s very different structure versus a human body, the high quality of the image of the hair would be IMPOSSIBLE to explain if they would have been caused by some kind of heat or radiation. And remember folks that it’s an authentic expert in radiation who said that !). The same that above 4.“When a heavier than air foreign gas is diffusing into air in a fibrous mat, the concentration of the gas WILL INCREASE IN THE HAIR. More gas will diffuse through the pores of the cloth in the area of the hair. Such a mechanism would explain why the hair is clearly visible in the image and why it is visible on the back of the cloth. The observation of image color at the location of the hair on the back side of the cloth, strongly suggest that a gas heavier than air was involved in image formation.” (Note : This last observation has not been confirmed yet. There is probably something on the back side of the cloth corresponding to the hair on the front side, but the exact nature of this image still wait to be confirmed. Rogers mentioned this possible image of the hair on the back side of the cloth on the base of a testimony from monsignor Giuseppe Ghiberti that was taken from the report of the 2002 restoration, where he mentioned that the only part of the image that his visible on the back surface of the cloth is the hair (ref. : Rogers book). Fanti and Maggiolo have confirmed this claim in a 2004 paper (along with the image of the moustache and beard and maybe also the hands), but this work has been criticize by many researchers and this question is still left open (especially for the exact nature of those images). Anyway, Rogers estimated that if those images are really there (and at first sight, it seem so, especially for the images of the hair, the beard and the moustache), his personal hypothesis involving a gaseous diffusion through the cloth would be the most likely way to explain them and that’s why he talk about a possible image of the hair on the back side of the cloth). Again, a diffusion mechanism would yield a blurred image. 5.“The early appearance and rapid diffusion of low molecular weight ammonia from the nose and mouth might help explain the greater amount of image color between the nose and mouth, in the beard, AND INTO THE NEIRBY HAIR. It will also diffuse through the cloth more quickly and reach the back side of the cloth in greater concentration. Ammonia will diffuse about 20 cm through air while cadaverine is diffusing only 6 cm.” Again, the problem of horizontal motion towards the hair and diffusion/blurred image. In my view, all this represents important limitations which perhaps further research may contribute to solve..","date":"2012-06-14","mins":"2:29 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12580","author":"gabriel","post":"Anoxie, very good questions: 1st. Only if the gases emitted from the body were lighter than air AND flowing in a very low laminar regime. 2nd. Only partially 3rd. I think nobody has got a reasonable answer to that. In my view, the major difficulty or if you want to put it like that, the part in Rogers theory that needs further intensive research and reformulation is not in the chemistry of the process but in the very specific conditions that would be needed regarding the motion of gases between body and cloth and as Anoxie points out why a thread reacts chemically and the next one doesn,t..","date":"2012-06-16","mins":"4:46 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12617","author":"gabriel","post":"Yannick, I answered “partially” because there seems to be a certain consensus that in the back image a contact mechanism played a partial role. This doesn’t seem the case for the frontal image. However, despite the difficulties I see at this moment, honestly, I admit that you might be right because, I don’t have a direct access either to the Shroud (as Rogers had) or to any other material…. My intention with my comments was only to raise some difficulties I see from my own expertise……but I find myself unable to reach a comprehensive model for the Shroud. In this sense I am open to any explanation and currently, in the ranking of theories, Rogers’ is in a rather good position..","date":"2012-06-16","mins":"7:44 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12599","author":"gabriel","post":"1st question: I don`t know 2nd question. Definitively yes..","date":"2012-06-16","mins":"9:34 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-12516","author":"gabriel","post":"Yannick Clément : I’m sure Gabriel will agree with me about that !!! ; ) Certainly I do, Yannick. If something seems clear to me is exactly that: more serious research is needed in many fields including alternative datation techniques (I have already put forward my ideas on this blog about this and I also have some new ones) and Rogers hypothesis. However, after carefully reading your posts I still serious difficulties regarding the motion of emitted gases. Fortunately, computational techniques are now widely available and the simulation of a great number of varying conditions of amonia types, their emission rates, temperature, humidity is possible without physically reproducing a 1st century tomb in Israel with a crucified corpse inside. They may not be perfect but a computational simulation using some CFD codes like Fluent or STAR CCM woud certainly made it possible the evaluation of the major aspecst regarding Rogers theory. Is there not a SSG ready to do some science on the Shroud? Here they have an interesting chellenge…..: ).","date":"2012-06-15","mins":"9:43 am","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-32707","author":"gabriel","post":"Other relics like the Valencia Chalice exhibit solid historical credentials that allow tracking back its origin to some moment around 1st Century, somewhere in Middle East. Regarding the S Hroud, it will be almost impossible to reach any further than this, because just like in the case of the Chalice, it will be impossible to prove beyond any doubt that it was Jesus burial cloth. However, just ilke in the case of the Chalice, if it were proven that it comes from the Middle East and belongs to the first Century, it is highly reasonable to think that it once wrapped the body of Jesus. As far as this point, the comparisons between the Chalice and the Shroud are obvious and belong to the field of History. However, in the case of the S Hroud we have an additional issue, that may explain why it is much better known that the Chalice: its possible link to the Resurrection, either through a natural chemical process (Maillard reaction or other) taking place hours before this unique Event or as Fanti, Jackson and others claim, due to the Event itself. Regarding new experiments, in my view, the Church will only allow them after preliminary analysis carried out privately. I think that they will never repeat the mistake of blindly losing control of the whole process like in the C14 test. Http://en.wikipedia.org/wiki/Holy Chalice.","date":"2013-05-03","mins":"4:37 am","url":"https://shroudstory.com/2013/05/02/good-question-what-would-proving-shroud-do/","cat":"news_&_views","title":"Good Question: What would ‘proving’ Shroud do?"},{"id":"comment-7491","author":"gabriel","post":"Max, a wise king wouldn`t like to know what “Jamon” means in Spanish…….","date":"2012-01-24","mins":"6:08 pm","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"},{"id":"comment-13740","author":"gabriel","post":"After all it may not be the bosson of Higgs yet…http://www.technologyreview.com/view/428428/higgs boson may be an imposter say particle/?ref=rss.","date":"2012-07-11","mins":"12:08 pm","url":"https://shroudstory.com/2012/07/07/higgs-boson-and-religion-and-science/","cat":"off_topic","title":"Higgs Boson and Religion and Science"},{"id":"comment-15052","author":"gabriel","post":"I have already commented on this, but applying state of the art algorithms from the field of machine learning to high resolution images, could quite easily help assess at a given confidence level, if those coins, flowers, letters and so on are really present or not. At this moment, the paper by Marion widely dismissed in this blog is the only one that has gone through peer review, positively evaluated and eventually published in a JCR journal..","date":"2012-08-16","mins":"6:58 am","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-201146","author":"gabriel","post":"Dan, thanks for keeping this blog going..","date":"2015-06-05","mins":"1:52 pm","url":"https://shroudstory.com/2015/06/05/housekeeping-how-to-participate/","cat":"news_&_views","title":"Housekeeping:  How to Participate"},{"id":"comment-15115","author":"gabriel","post":"I would like to show what in my view would be the steps of a mathematical algorithm to detect letters, coins, or flowers in an objective way and assess confidence levels to the results. This could be easily be written in C++ or R and could represent a step forward in addressing the “I think I see” issue. 1. In the first place, using Image J import a high resolution image of the Shroud, of course with a traceable origin. 2. Save it as black and white and as text. Doing that you turn your image into a matrix, being its values the intensity of the image’s pixels ranging from 0 (black) to 255 (white). Any value in between is some kind of grey. 3. Open a for/do type loop and sweep in that matrix rectangles of varying size. 4. For each rectangle, identify a reference background color (value between 0 and 255). This could be done as an average or median of the rectangle of using wider meaningful areas on the Shroud. 5. In each reactangle, using a classical if then , convert values below the reference of point 4 into 0 and values above into 255. This will increase contrast. 6. Each rectangle will look like a chess table, with black and white small squares, corresponding to the pixels in that rectangle. 7. In paralell, a database should have been created with letters and numbers and coins, flowers etc…depicted for each rectangle size as a combination of black and white squares (This could take some time) 8. Each rectangle and number of black and white squares will be compared to this database using for example, Self Organizing Maps, random forests or cluster analysis. 9. If a positive match is found, it will be compared with the possibility of finding it by pure chance. Let’s put an example: imagine we are at this current step of the major loops analyzing a 3 pixels x 2 pixels rectangle and we have 2 black squares and 4 white, after the conversion of point 5. If a L needs 4 white pixels to be there and we have found a positive match, the probability the white pixels have arranged by chance as a L is 1/(6x5x4x3). Of course, this only represents an initial approach and many points could be improved. This would take some hours or perhaps days of CPU but any result that might emerge would have associated an objective probability..","date":"2012-08-17","mins":"9:51 am","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-15126","author":"gabriel","post":"Sorry, typo error: “arranged by chance as a L is 1/(6+5+4)=1/15″.","date":"2012-08-17","mins":"12:27 pm","url":"https://shroudstory.com/2012/08/16/i-think-i-see-another-different-nail-on-the-shroud-of-turin/","cat":"news_&_views","title":"I think I see another, different nail on the Shroud of Turin"},{"id":"comment-9555","author":"gabriel","post":"Very interesting connection, Yannick. If aragonite is present the conclusion on the absence of washing is a very clever one. But, I repeat my question: how solid scientifically speaking is the claim that i) aragonite is present ii)) aragonite composition is the same as that existing in Jerusalem Any help would be appreciated.","date":"2012-03-23","mins":"7:44 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","title":"Is it Reasonable to Believe in the Resurrection?"},{"id":"comment-9565","author":"gabriel","post":"Thanks Daveb. I agree corroboration is needed because Kohlbeck and Levi setti references in the original papers seem to be mainly descriptive and not the result of a systematic approach to this issue..","date":"2012-03-24","mins":"4:22 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","title":"Is it Reasonable to Believe in the Resurrection?"},{"id":"comment-9572","author":"gabriel","post":"I have been working on this issue a little bit more. Of the two journals mentioned in the post ( Scanning Electron Microscopy and Biblical Archaeology Review) (BAR) the paper published in BAR cannot be expected to go into technical matters on the aragonite due to its orientation. Ok so far. But regarding the other one published in Scanning Electron Microscopy. A quick consultation indicates that this journal does not belong to the JCR peer reviewed system (neither does BAR) and does not have an impact factor, so its conclusions, to say the least, cannot be taken as conclusive and therefore, I would say that the claims on the aragonite and limestone are far from being scientifcally supported..","date":"2012-03-24","mins":"7:36 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","title":"Is it Reasonable to Believe in the Resurrection?"},{"id":"comment-9568","author":"gabriel","post":"Thanks Daveb, as a matter of fact I began with those posts and the 2 papers you mention, but my concern goes a little bit further. As I mentioned, those two papers seem to be descriptive so a few questions arise: Where are those aragonite samples in 2012? Is there a traceable custody from the shroud to wherever they are now? Are those samples freely available for independent testing with state of the art technologies? I mean, in the absence of solid literature – like in the case of blood for example answering those questions is crucial if the aragonite connection with Jerusalem is to be accepted as a scientific fact..","date":"2012-03-24","mins":"6:36 am","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","title":"Is it Reasonable to Believe in the Resurrection?"},{"id":"comment-9550","author":"gabriel","post":"Yannick, I agree with you. Coming to the part of evidences, also recently pointed out by Daveb, is the point of the presence of aragonite in the Shroud, that seems to be the same as in Jerusalem. This would be a very strong positive evidence………if independently confirmed by different researches. To my surprise, there seems to be very little scientific work published in peer reviewed journals on this critical issue and yet, if confirmed, it would represent a major evidence that would take the discussion on the scorch to a 1st century Jerusalem. Can anyone expand on the scientific work on this issue?.","date":"2012-03-23","mins":"4:26 pm","url":"https://shroudstory.com/2012/03/23/is-it-reasonable-to-believe-in-the-resurrection/","cat":"science","title":"Is it Reasonable to Believe in the Resurrection?"},{"id":"comment-27310","author":"gabriel","post":"The jesuits have been represented, perhaps more than any other identifiable Catholic group in Shroud studies combining in all cases, both a scientific and theological approach. Fathers Filas, Jorge Loring and Carreira have addressed this subject and as I mentioned in a previous comment, even the Pope Francis has at least, tangentially shown some interest and prefaced a book which includes a chapter on the Shroud. Some of these fathers can exhibit solid scientific credentials. There is no way to know whether these persons have acted individually and converged by pure chance in this field or it all, reflects a genuine interest by the Order of the Jesuits as such on this relic. If this is the case and knowing how Jesuits are, in my view, it would not be strange that we could see moves on this subject in the next months..","date":"2013-03-14","mins":"3:42 pm","url":"https://shroudstory.com/2013/03/14/is-pope-francis-a-chemist/","cat":"news_&_views","title":"Is Pope Francis a Chemist?"},{"id":"comment-19296","author":"gabriel","post":"Does anybody know if the Third Encounter of the two linens in Jerusalem that Barry mentions in his update , now delayed to next February is open to anyone? I have googled it but it seems to be quite a private meeting…..","date":"2012-11-21","mins":"9:06 am","url":"https://shroudstory.com/2012/11/21/last-update-this-year-to-shroud-com/","cat":"news_&_views","title":"Last update this year to shroud.com"},{"id":"comment-4369","author":"gabriel","post":"Unfortunately, most of the followers of this blog has never had the opportunity to analyze the Shroud. I would add that most of us have never had the opportunity to analyze the photographs this discussion is based upon (1931 Enrie’s Shroud face photographs, but also on 2002 Durante’s and a recent HD Still), simply because they are not available so easily. Perhaps, if someone could provide the readers of this blog with that whole set of photographs, we could make an opinion by ourselves…..Otherwise, the whole discussion is based upon the results of the analysis of photographs carried out by Max, Barry and the erst. For me at least, I come to a point where I do not know who to give credit, because I am bound to believe someone’s results based on the credibility of that person instead of an impartial and open analysis of the photographs….Umm! I bet we will never see those photographs..","date":"2011-10-26","mins":"2:07 pm","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster"},{"id":"comment-21934","author":"gabriel","post":"“The future of science is the Shroud of Turin”. John, honestly, aren’t you going too far?.","date":"2013-01-12","mins":"11:19 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part"},{"id":"comment-8089","author":"gabriel","post":"If you support the idea of scorch in contact with a heated 3 D object, I understand that you have already ruled out your previous difficulty regarding the different sizes of the front and back images..","date":"2012-02-09","mins":"9:16 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","title":"More on don’t confuse him with facts, his mind is made up"},{"id":"comment-23967","author":"gabriel","post":"The owner of the Shroud is to resign next Feb 28..","date":"2013-02-11","mins":"7:36 am","url":"https://shroudstory.com/2013/02/11/might-jesus-give-us-the-shroud-of-turin-as-evidence/","cat":"news_&_views","title":"Might Jesus give us the Shroud of Turin as evidence?"},{"id":"comment-4377","author":"gabriel","post":"Thanks a lot. I hace already requested a password and when I get one I will have a look at that paper. Thanks again.","date":"2011-10-26","mins":"6:33 pm","url":"https://shroudstory.com/2011/10/26/likely-error-in-hamons-frascati-acheiropoietos-workshop-poster/","cat":"news_&_views","title":"Likely Error in Hamon’s Frascati Acheiropoietos Workshop Poster"},{"id":"comment-3933","author":"gabriel","post":"Just a comment from Spain.The sudarium is exposed three times along the year: On Eastern Friday, Sept 14th and Sept 21st. Anyone in the area of Oviedo will have the chance to see the Sudarium of Oviedo in the Cathedral next Wednesday 21 after mass at 12h and 18:30h..","date":"2011-09-18","mins":"8:11 am","url":"https://shroudstory.com/2011/09/18/more-still-on-the-dirt-on-the-shroud-of-turin/","cat":"news_&_views","title":"More Still on the Dirt on the Shroud of Turin"},{"id":"comment-204076","author":"gabriel","post":"The starting point of Tipler’s theory is the Big Bang as a beginning and the Big Crunch. Since he wrote his book the perspectives that scientists are exploring have substantially changed. For example, 15 years ago or even 10years ago, nobody would be interesting in studying anything that may have happened before the Big Bang because not only space and matter but also time began with the Big Bang. However, now we have leading scientists like Penrose exploring what he thinks are gravitational waves originated before the Big Bang. When we come to the fate of the universe, more than 73% of matter is dark matter……that nobody knows what it is. However it is considered to be crucial to elucidate whether the universe will expand forever or the gravitational forces will bring it to a Big Crunch. Coming to the multiverse theory….it is a theory with no evidence so far. It is used as an explanation for the fact that the exact values of six cosmological constants and not any others are responsible for the universe as it is, and for the laws that have made possible after an evolution process, life and conciousness. The multiverse theory is used to explain that if you throw your dices an infinite number of times, you will find by pure chance the only universe ours in which these six cosmological constants adopt the exact values that make consciousness possible. The rest of “results” with your dice configure an infinite number of empty universes that is, a multiverse with “wrong” values associated with those six cosmological constants. But, I would like to stress the idea that there is not a single physical evidence on this theory so far. Gibbs bosson and the many particles yet to be discovered in the future in CERN also pose a strong challenge to Typlers theories, since the final structure of matter is far from being understood. To summarize, Typler just made a nice story with the ingredients he had at hand, but most of them are currently under discussion. In sharp contrast with this, we have the case of saint Agustin who in the fifth century was able to write in his book Confessions that when God created the world He also created time. He was able to reach this conclussion just by reading the book of Genesis. Now, 15 centuries later scientists also agree that time began with the Big Bang, regardless this event has taken place by chance or is a positive act of creation by God. Little people know that the joke Stephen Hawkins often makes in his conferences.","date":"2015-06-29","mins":"4:44 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-8096","author":"gabriel","post":"Interesting…but in my opinion, once you admit that the effect of wrapping a bas relief with a linen is that you “can add or subtract to length and width dimensions, depending on whether all contours are followed” this might well apply to a dead body.","date":"2012-02-09","mins":"11:02 am","url":"https://shroudstory.com/2012/02/09/more-on-dont-confuse-him-with-facts-his-mind-is-made-up/","cat":"news_&_views","title":"More on don’t confuse him with facts, his mind is made up"},{"id":"comment-204080","author":"gabriel","post":"SORRY I WILL FOLLOW HERE; Stephen Hawkins (an agnostic himself) makes the same joke at many of his conferences:”what was God doing before creating the world? Perhaps he was thinking on how to punish those of us that wonder about these things:” Everybody laughs without knowing that St Agustin made exactly the same joke 15 centuries ago and wrote it in his “Confessions”. 15 centuries from now in the future nobody will do anything similar with Typlers jokes…..","date":"2015-06-29","mins":"5:08 pm","url":"https://shroudstory.com/2015/06/29/off-topic-warning-about-the-eucharist-and-then-some/","cat":"off_topic","title":"Off Topic Warning:  About the Eucharist and Then Some"},{"id":"comment-23988","author":"gabriel","post":"Most probably, they have already done so..","date":"2013-02-11","mins":"1:30 pm","url":"https://shroudstory.com/2013/02/11/pope-benedict-xvi-to-resign-february-28/","cat":"news_&_views","title":"Pope Benedict XVI to Resign February 28"},{"id":"comment-9874","author":"gabriel","post":"Yannick, very interesting this info about how they scanned the whole cloth at a microscopic level. Also your conclusion regarding the Mandylion. For me at least, this is news. Are these images the same as the so often quoted in this blog high resolution HAL 9000 images? From this and other details It seems to me that after all, the restoration was not so “catastrophic” as some claim…….","date":"2012-04-02","mins":"3:20 pm","url":"https://shroudstory.com/2012/04/01/palm-sunday/","cat":"news_&_views","title":"Palm Sunday"},{"id":"comment-17256","author":"gabriel","post":"Last Sept 21, as usual the Oviedo Sudarium was exhibited once again. I attended the mass in which it was shown and at the Cathedral’s shop I bought the proceedings of the Second Intenational Conference on the Oviedo Sudarium of 2007 (in Spanish). I have the feeling that while most of the reseach on the Shroud has been carried out in English, research on the Oviedo Sudarium has been in Spanish. In my view, this has been a major problem to connect and put in common all the amazing coincidences taht exist and also, the research lines followed. For example, while reading the proceedings I have known that Ray Rogers analyzed and prepared a report for the Oviedo Ecclesiastic authorities on the Oviedo Sudarium. He sent it one month before passing way, after receiving some sample from Oviedo. The point is that the content of his research is not related to chemistry but to another research line: the impact of natural radiation on the degradadtion of linen fibers!! (above mentioned proceedings, paper by Cesar Barta, pp 147 onwards) Out of the comparison of the fibers from the Sudarium with fibers from the Shroud and additional ancient cloths, he concludes that there is a high probability that both cloths (Sudarium and Shroud) may share the same geographical origin and also be of the same age. Perhaps the involvement of Rogers in the analysis of the Sudarium is widely known but for me at least, this is news and I would appreciate any indication of where this report by Rogers could be found..","date":"2012-10-06","mins":"7:57 am","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","title":"Relic authenticates Shroud of Turin?"},{"id":"comment-212272","author":"gabriel","post":"A new example on how Shroud research moves in circles. FFT is a standard technique used in image processing. It was used by Marion many years ago and it is even included in Image J a sofware everyone here seems to use proficiently………….The post by Dan seeems to suggest that this technique can be helpful in the future. In a few weeks times the circle will move ahead and some will express their skepticism on any result (such as Marion’s) about letters or symbols obtained from computer techniques, including for example FFT..","date":"2015-10-11","mins":"4:12 am","url":"https://shroudstory.com/2015/10/11/removing-weave-pattern-from-images-of-the-shroud-of-turin/","cat":"other_sites","title":"Removing Weave Pattern from Images of the Shroud of Turin"},{"id":"comment-17270","author":"gabriel","post":"Andy, thanks for the link. I guess that the report he sent to Oviedo was a development of the paper you mention, because the contents are similar. However, the final report included additional cloths but, surprisingly enough, this report seems to have been lost in Oviedo. To me, however, the most important think is the way he opens to analyze the role of natural radiation on linens. Could we find the signature of heavy radiation events through history? http://phys.org/news/2012 06 tree japanese scientists 8th century mystery.html If so, it would be helpful for datation and many other thinks too.Thanks again..","date":"2012-10-06","mins":"12:46 pm","url":"https://shroudstory.com/2012/10/06/relic-authenticates-shroud-of-turin/","cat":"news_&_views","title":"Relic authenticates Shroud of Turin?"},{"id":"comment-6086","author":"gabriel","post":"After so many years, it is clear that whatever the image formation mechanism is, it is very complex and not easily reproducible. In this sense, from a scientific point of view, it is doubtlessly a major challenge. I think this cannot be denied. Additionally, it is highly controversial due to to all its implications. Addressing such an explosive combination (true scientific challenge+Controversial) is a very, very difficult matter. In this sense, I find strong similarities with a recent subject: climate change. Perhaps, we could learn a few lessons from it. Only after a centralized body like United Nations thru IPCC started a systematic scientific approach providing free access to all available data and making its way only thru peer reviewed journals, a clear and solid picture has appeared on the fact that Mankind is affecting climate and Earth is getting warmer. In this process, all agenda driven researches have been put in their place. Of course, they still have some small influence but their arguments are not scientific (now they have moved to conspiration theories) and the true solid fact cannot be denied any longer. I am afraid that in the case of the Shroud, we are still in the 80’s of climate research history when anyone could start a research and reach a conclusion by himself with his own piece of evidence. At that time, a great deal of researchers were also “climate stars” on the media just like current “Shroud stars” and used to attend talk shows on TV too often, while writing few JCR papers. Unless in the Shroud issue a similar step towards a centralized&coordinated research and open proof custody system is not given, researchers will attend TV shows and feed newspapers with more and more incredible headlines. At that time, acting like that was also helpful to raise some funds to go on with that particular piece of research. Just like with the Shroud nowadays. I think we have already had enough of that. This way is the best to keep the research on the Shroud in an endless “murkier than ever” status. That said, in the absence of such a system, I hope that Dr. Di L Azzaro could get forward with his research and address the challenges he has got ahead like trying to reproduce the 3 D effect with his laser. Merry Christmas to all from Spain..","date":"2011-12-24","mins":"9:05 am","url":"https://shroudstory.com/2011/12/24/second-update-to-msnbcs-cosmic-log-posting-on-the-shroud-of-turin/","cat":"news_&_views","title":"Second Update to MSNBC’s Cosmic Log Posting on the Shroud of Turin"},{"id":"comment-23481","author":"gabriel","post":"In the Proceedings of The National Academy of Sciences a new paper has just been published where once again, previously established dating using C14, have proven to be wrong, thus indicating that radiocarbon dating techniques in the 80’s were far from being accurate. Http://m.pnas.org/content/early/2013/01/29/1207656110.","date":"2013-02-05","mins":"3:56 am","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","title":"Teaser of the Day (#4): Body image in noncontact zones?"},{"id":"comment-21917","author":"gabriel","post":"Too many paragraphs to reach an obvious, years old and well established conclusion: we dont know yet how the image was formed. Far from his initial posts when he was completely sure that the image was a scorch. Welcome!.","date":"2013-01-12","mins":"6:56 am","url":"https://shroudstory.com/2013/01/12/stop-taking-cudgels-to-each-other/","cat":"news_&_views","title":"Stop taking cudgels to each other?"},{"id":"comment-23489","author":"gabriel","post":"I basically agree with Mario’s review and again, at the risk of repeating myself, it would be great if original material used by Fanti could be granted free access for independent confirmation. However, after watching the video enbedded in the recent post “Video: National Geographic–Ancient X Files–Holy Shroud” a major question arises at this point. In this video we can see Fanti’s lab and an experiment of corona discharge taking place. I mean, it is well known that he supports the idea of corona discharge as the mechanism for image formation. However, IF corona discharge is involved, the laws of electricity, indicate that we would not see a double superficiality with the layers in between remaining untouched. On the contrary, a gradient would be expected with the linen surface closer to the higher electricity potential pole having a higher degree of coloration, the inner layers being also coloured, and finally the last layer exhibiting this tiny imprint known as “double superficiality”. In the absence of any degree of coloration in the inner layers of the Shroud, it is impossible to explain the formation mechanism as originated by a corona discharge breaking the continuity of electric charges flowing through and crossing the Shroud. I mean, double superficiality and corona discharge are mutually not compatible..","date":"2013-02-05","mins":"6:40 am","url":"https://shroudstory.com/2013/02/05/teaser-of-the-day-5-double-superficiality-expialidocious/","cat":"teaser_of_the_day","title":"Teaser of the Day (#5):  Double Superficiality Expialidocious"},{"id":"comment-4992","author":"gabriel","post":"If those images are not the HAL 9000 images, they really have a very high resolution…What seems to me fascinating of their work (in a peer reviewed, JCR journal) is that all the affected fibers have the same degree of colouring and it is only the proportion of coloured fibers by unit area that provides a 3 D effect to the naked eye. Furthermore, inside each unit area the distribution of colured fibers is random. Any image formation theory must also explain why a fiber is coloured and its neighbour is not..","date":"2011-11-24","mins":"4:28 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","title":"The Belt of Mary"},{"id":"comment-4997","author":"gabriel","post":"Honestly, I don’t know what to think……I don’t know so much chemistry as to decide by myself if such a mechanism can colour one fibre but not the next one……It is such a small case (micrometers)…… The authors also seem to be in favour of a biochemical mechanism and their results represent an important difficulty for the energy field/radiation hypothesis since all the affecetd fibers have the same degree of colouring and does not vary with distance…….I have to think it all over.","date":"2011-11-24","mins":"5:25 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","title":"The Belt of Mary"},{"id":"comment-5008","author":"gabriel","post":"If we come to statistics, there is another point. The only record in history of a milliard or similar chemical reaction on a linen, takes place precisely short before the only resurrection in History and still would NOT be connected.Two unique records in History take place at the same place and in almost the same time frame. One of them (image formation) is natural, has never taken place again and is not reproducible. The other one (resurrection) is not natural, has never taken place again and is not reproducible. If you break the time and space connection between both, it seems statistically more feasible. I mean, this would be an argument in favour of a medieval forgery somewhere in Europe, because two unique events in History would be more separated…….","date":"2011-11-25","mins":"12:34 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","title":"The Belt of Mary"},{"id":"comment-4978","author":"gabriel","post":"Well, in fact the Church has got her own rythms…….and ways. Recently, a comment was posted mentioning the following paper on the Shroud G. Fazio & G. Mandaglio. Stochastic distribution of the fibrils that yielded the Shroud of Turin body image. Radiation Effects and Defects in Solids 2011; 166 (7) :476 479.As I mentioned in a previous comment I have decided to focus on this kind of literature. Since this journal is peer reviewed and belongs to the JCR, last week, I ordered a copy. Before any discussion on its content, I was surprised that in “Acknowledgements” (pp.5) the authors “ wish to thank the “Arcidiocesi di Torino”, who has furnished the photographs of the Shroud of Turin taken after the 2002 restoration.”.","date":"2011-11-24","mins":"3:09 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","title":"The Belt of Mary"},{"id":"comment-5010","author":"gabriel","post":"My previous comment is based on the “black swan” theory. Http://en.wikipedia.org/wiki/Black swan theory. I think it can be applied to this case. Which are the probabilities for 2 unique events (black swans=image formation (natural but not reproducible)+resurrection(not natural)) of taking place at the same location (a jewish tomb) and time(more or less 9 April 30 CE) in world History? These probabllities must be very close to 0. If we either i)connect the two events and we only have one black swan (the image is a byproduct of resurrection) or ii)separate both events (the image is medieval forgery) in both cases, the probabilities must be higher.","date":"2011-11-25","mins":"1:49 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","title":"The Belt of Mary"},{"id":"comment-5019","author":"gabriel","post":"Yannick, I need some time to think about it all…..However, although I understand you don’t support it, I see this theory is rather near to a supernatural byproduct explanation not in the classical approach by Fanti et al, but in the sense that a supernatural Will should have acted at a very accurate moment to stop a natural process (the chemical reactions) that were taking place. I stil see two black swans (God’s double Will stopping reactions and resurrecting His Son) simultaneously operating in the early morning of April 9th…..However, I am truly confused because the whole set of evidences seem impossible to be organized in a rational way. Being rather newby at this issue of the Shroud I feel I am walking more and more into a very slippery area…….","date":"2011-11-25","mins":"5:25 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","title":"The Belt of Mary"},{"id":"comment-4986","author":"gabriel","post":"Fazio and Mandanglio seem to support a natural biochemical mechanism for the formation of the image. However, the stochastic nature of the fibers affected by coloration poses a major additional challenge for any Shroud formation theory..","date":"2011-11-24","mins":"3:17 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","title":"The Belt of Mary"},{"id":"comment-4984","author":"gabriel","post":"By the way, the belt of Mary is not owned by the Vatican. It is kept in the Greek Orthodox monastery of Vatopediu in Mount A Thos http://www.youtube.com/watch?v=v NE7 Af Sc V3 E.","date":"2011-11-24","mins":"3:13 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","title":"The Belt of Mary"},{"id":"comment-4981","author":"gabriel","post":"The content of this paper is based on a very close up analysis of the fibers which leads the authors to the conclusion that colouring pattern distribution on affected fibers is stochastic (random). To reach such a conclusion, the analysis can only be carried out with very high resolution images which can provide details at the fiber scale..","date":"2011-11-24","mins":"3:11 pm","url":"https://shroudstory.com/2011/11/24/the-belt-of-mary/","cat":"news_&_views","title":"The Belt of Mary"},{"id":"comment-27428","author":"gabriel","post":"A quick search in the historical records of the Argentinian newspaper “La Nacion” (in Spanish), pushes back the first mentions of the new Pope’s chemical profile to 1997. In the following links, of 1997 (1), 1998 (2) and 1999 (3), at that time his CV gathered the following : (1) se diplomó de químico industrial (2) se graduó de técnico químico (3) se graduó de técnico químico I am not familiar with the University system in Argentina at that time, but I would say, that taken into account that he obtained his degree with 21 years and that he might have started his studies with 18 years, he holds a degree in Chemistry but at an intermediate level. In most countries a full degree in Chemistry tipically takes something like 5 years, but in many cases you get a degree at an intermediate level if you stop half way and pass a set of subjects corresponding to let’s say the first three years. Most probably, this is the case although out of his official biography, it seems quite clear that after this period, he has not had any further contact with Chemistry. Links (1) http://www.lanacion.com.ar/70205 bergoglio sera el sucesor de quarracino (2) http://www.lanacion.com.ar/89230 su sucesor con diferencias de estilo (3) http://www.lanacion.com.ar/148959 un arzobispo antimediatico.","date":"2013-03-16","mins":"7:08 am","url":"https://shroudstory.com/2013/03/16/the-making-of-a-meme-pope-francis-scientist-not-or/","cat":"news_&_views","title":"The Making of a Meme:  Pope Francis, Scientist. Not! Or . . ."},{"id":"comment-202531","author":"gabriel","post":"Daveb, please remember that the Catholic Church is not a scientific institution but a religious one. For this reason, her objectives are not to build scientific evidences for the relics she owns, but to use them to spread her spiritual teachings. That is exactly what we are seeing in Turin, although it is quite clear that the Church believes the Shroud is authentic. Otherwise , we would not have an exhibition like the one we are seeing in Turin. A final thought about your comment is that if the Church devoted half the resources invested in this asteroid to do state of the art research on the Shroud, taking into account the huge poverty all over the world, she would be criticized for that..","date":"2015-06-17","mins":"1:41 pm","url":"https://shroudstory.com/2015/06/17/the-masters-of-comedy-in-piedmont/","cat":"news_&_views","title":"The Masters of Comedy in Piedmont"},{"id":"comment-7655","author":"gabriel","post":"Sciencebod, you have very active friends in Spain. They are putting under very heavy fire the next International Conference on the Shroud in Valencia. Here is one example but there are more in Spanish journals http://www.elmundo.es/blogs/elmundo/desde el mas alla/2012/01/29/pseudociencia universitaria.html One of their statements is that one of the speakers (Ian Wilson) has for a long time, falsely claimed that he was a professor at Oxford University and since this conference is going to be held at the faculty of medicine and as everybody knows, the Shroud is a forger, it all is a shame for the university and the advance of science. Furthermore, since students are granted a couple of credits for attending the conference, they claim that it is even worse..","date":"2012-01-29","mins":"6:57 am","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\""},{"id":"comment-28574","author":"gabriel","post":"In my previous comment about Zaccone’s article I already mentioned the release of this app and for me the question is: Is this an expected way chosen by the Archidiocese of Turin of making public the high resolution images they took 5 years ago?.","date":"2013-03-28","mins":"5:13 am","url":"https://shroudstory.com/2013/03/28/the-official-shroud-of-turin-app-for-ipad-and-iphone-2-0/","cat":"news_&_views","title":"The Official Shroud of Turin App for iPad and iPhone 2.0"},{"id":"comment-28582","author":"gabriel","post":"So do I, Dan: ). Happy Easter to all.","date":"2013-03-28","mins":"6:06 am","url":"https://shroudstory.com/2013/03/28/the-official-shroud-of-turin-app-for-ipad-and-iphone-2-0/","cat":"news_&_views","title":"The Official Shroud of Turin App for iPad and iPhone 2.0"},{"id":"comment-13508","author":"gabriel","post":"Now that they have finally found the bosson of Higgs someone will rapidly develop a new theory for the Shroud.","date":"2012-07-05","mins":"1:45 pm","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","title":"Vatican Insider: Another Big Bang"},{"id":"comment-10856","author":"gabriel","post":"One of the most remote and ancient monasteries in Spain is Santo Toribio de Liebana. The monks custody what according to tradition is the biggest piece of the Lignum Crucis (cross). Its vertical stick is 69 cm high and the horizontal one measures 39 cms. In 1958 the Spanish Highest Council of Scientific Research (CSIC), the most important research body in Spain at that time (and probably now) analyzed this relic. They concluded that the wood was cypress being its botanic name “sempervivens L”, a very common species in Palestine. Their analysis I don`t exactly know which ones concluded that the relic might well be 2000 years old. However, nobody can go any further and claim that Jesus was nailed on that cross. Most the info is in Spanish but this is a good website to start with http://es.catholic.net/turismoreligioso/801/2760/articulo.php?id=8822.","date":"2012-04-26","mins":"7:29 am","url":"https://shroudstory.com/2012/04/26/voice-of-russia-relics-of-the-true-cross-and-more/","cat":"news_&_views","title":"Voice of Russia: Relics of the True Cross and More"},{"id":"comment-13561","author":"gabriel","post":"Yannick, in this new forthcoming paper, do you intend to address the issue of the directionality in image formation?.","date":"2012-07-07","mins":"4:41 am","url":"https://shroudstory.com/2012/07/05/vatican-insider-another-big-bang/","cat":"uncategorized","title":"Vatican Insider: Another Big Bang"},{"id":"comment-10871","author":"gabriel","post":"Daveb, the tradition says that this cross was, as you mention, discovered by Helena. More precisely, three crosses were discovered and to identify the true one, Macarius the bishop of Jerusalem at that time put them on the body of a recently deceased man. In contact with the authentic cross that man came back to live. Please note that this is tradition and legends. Not history..","date":"2012-04-26","mins":"5:20 pm","url":"https://shroudstory.com/2012/04/26/voice-of-russia-relics-of-the-true-cross-and-more/","cat":"news_&_views","title":"Voice of Russia: Relics of the True Cross and More"},{"id":"comment-205014","author":"gabriel","post":"Dilazzaro is someone who has published in peer reviewed journals belonging to the JCR more than 100 papers on laser research, out of which only a few have anything to do with the Shroud. I think this is important because he came to the Shroud world after already being a laser expert. Little by little he has been fine tuning his experiments with linens and finally has identified the very narrow laser operation conditions that lead to obtaining very similar coloration as we see in the Shroud. He has published his works in peer reviewed journals, just like Marion with his image processing and the letters he found. Although both Dlazzaro and Marion have decided to publish their results according to the standard scientific procedures in JCR journals, it is to me difficult to understand how little credibility is given to their work in shroud circles..","date":"2015-07-09","mins":"3:48 pm","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","title":"Who Proposed Ultraviolet?"},{"id":"comment-205044","author":"gabriel","post":"The point I want to make is that advances obtained and made public by scientific standards accepted in any other field of science, are widely rejected by the shroud community usually not on scientific grounds how can we ever expect to reach one day solid conclusions on its origin and nature?If it is not through standard procedures valid for any other scientific area, how then?.","date":"2015-07-10","mins":"12:55 am","url":"https://shroudstory.com/2015/07/09/who-proposed-ultraviolet/","cat":"news_&_views","title":"Who Proposed Ultraviolet?"}]
