[{"id":"comment-206693","author":"gabriel","post":"John Klotz is mixing in his post (at least) the following: 1. The plain laws of probability 2. Benfords law, by the way one of the most challenging mathematical laws in nature (together with zipfs law) 3. Godel’s theorem of incompletitudness, which is the basis of the studies by Roger Penrose on conciousness..","date":"2015-07-27","mins":"2:54 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-7775","author":"gabriel","post":"Coming again to the C14 issue, in the literature gathered by Dan in this post, there are two different groups of reasons that converge in the same idea that the validity of the test is questionable. One, is the possibility that the sample is not representative of the whole Shroud and the other one and to me much more interesting is the lack of homogeneity among subsamples according to some statistical tests. In one of these papers (Riani et al., 2010) the authors even identify a trend from the outer to the inner part of the Shroud. The reason why to me is much more interesting this second group of statistical reasons is that even if original linen were sampled, it could also be expected a lack of homogeneity and also, most probably, due to the lack of conclusive results a new cycle of useless discussions could start. This is because nobody exactly knows what the impact of the very specific chain of historical events the Shroud has gone through (millions of people rubbing it for centuries, fires, humidity changes…..) could have on the C14 test. For this reason, even in the case that the Shroud were authentic, I would not be too confident that a new test, although correctly carried out by standards valid for other type of samples, would yield a 1st century datation. I guess that a new C14 test would not be helpful at all because all these papers sort of indicate what we can expect..","date":"2012-01-31","mins":"2:15 pm","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"id":"comment-7829","author":"gabriel","post":"Sciencebod, regarding your comment #2 I would like to suggest you read this paper (*). I think Dan should have added it to his list in this post. In this work, important errors on datation of ancient Egypt linens using C14 are described. In all cases, the protocols were followed but datations yielded notorious errors. Something similar might well have happened with the Shroud and the 1988 C14 test. (*)H.E. Gove a, S.J. Mattingly b, A.R. David ‘, L.A. Garza Valdes.A problematic source of organic contamination of linen.Nuclear Instruments and Methods in Physics Research B 123 (1997) 504 507 This journal belongs to the JCR, has got an impact factor of 1.042 ans is ranked in position 31st out of 61 in the field of INSTRUMENTS &INSTRUMENTATIONS.","date":"2012-02-01","mins":"4:54 am","url":"https://shroudstory.com/2012/01/31/badder-still-bad-archaeology-at-bad-archaeology/","cat":"other_blogs","title":"Badder Still: Bad Archaeology at Bad Archaeology"},{"id":"comment-21286","author":"gabriel","post":"Hugh, EL Mundo’s electronic edition is not freely available and the link provided, takes you to the website (ORBYT) that tells you how you can pay for being granted access to this interview..","date":"2012-12-28","mins":"7:07 pm","url":"https://shroudstory.com/2012/12/28/peter-higgs-criticizes-richard-dawkins/","cat":"news_&_views","title":"Peter Higgs Criticizes Richard Dawkins"},{"id":"comment-11303","author":"gabriel","post":"This is a fascinating discussion.Thanks Yannick and the rest for putting all this together. If I understand well, whether it is originated at the impurities layer or at the outermost fibers the image is basically the result of natural chemical reaction. If so, why according to Ray Schneider in a recent post here and perhaps many others too the image formation mechanism is NOT ISOTROPIC, as expected from a natural process and at the same time, the image itself shows no preferent directionality and in this sense is ISOTROPIC (one argument largely used among others to rule out.the hypothesis of being a painting)? Perhaps, I am missing something, I don`t know…..","date":"2012-05-12","mins":"6:19 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-11331","author":"gabriel","post":"Yannick, your very exhaustive reflections are most interesting! I see a difficulty with the impurities layer and it is the 3 D effect. In this blog we have largely commented that the 3 D effect of the image is obtained because the number of coloured fibers per unit area is different. The observed varying intensity of the coloured areas is due to the different fractions of coloured fibers affected and not to the different intensity in each fiber. In this sense, a fiber may be coloured and its neighbour not. This is the explanation so far of the 3 D effect. Now, if you locate the colourizing effect not in the fibers but on an impurity layer above the whole cloth, it is much more difficult to individualize the colourizing effect and describe it as a proportion of affected fibers since in my opinion, the impurities layer must have a continuity covering more than one single fiber and one would expect a more continuous pattern in the colour. I don`t know if Rogers ever addressed this issue…. Regarding, the isotropy issue, I have been thinking about it,….. And yes, you might have a point….because the laws of fluid mechanics theoretically at least, could allow a vertical flow of gases from the body in a very slow laminar regime so that in a quiet and confined atmosphere, like the one between the shroud and a body there is a chance for that type of flow. This could be easily simulated with any CFD code (Fluent, Star CCM+…..).","date":"2012-05-13","mins":"6:59 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-11335","author":"gabriel","post":"Yannick, honestly I don`t know but if I have to hypothesize, I would expect the impurities layer to have originated at the linen preparation stage, and in this sense to have approximarely the same density all over the cloth. If bleaching and dying is the origin of this impurity layer, to me it seems very difficult that changes of its density at a fiber level, as needed to explain the 3 D EFFECT, may possibly occur. However, whatever the good solution is, I think that the impurities layer or the fiber theory should provide an explanation for the 3 D effect and both facts are connected..","date":"2012-05-14","mins":"2:48 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-11336","author":"gabriel","post":"Here there is an example of what further research on the shroud might be. Simulating this with a CFD code is in 2012 straightforward..","date":"2012-05-14","mins":"2:51 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-11342","author":"gabriel","post":"Ok.","date":"2012-05-14","mins":"8:52 am","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-11316","author":"gabriel","post":"Thanks a lot for your extensive and rigourous answer, Yannick. However, the issue of the isotropy if true could give important clues regarding the image formation mechanism. I mean, Ray Schneider not only states that the image formation process was not isotropic, but he thinks it is proven that a clear vertical directionality was involved. I don’t know the degree of credibility that this point of directionality may hold, but IF TRUE we have to very cautious here it can more easily be explained in the frame of an energy field or even an ancient photograph system, than in the frame of a chemical reaction, regardless the imprint was formed on the impurity layer or on the outermost part of the fibres..","date":"2012-05-12","mins":"8:24 pm","url":"https://shroudstory.com/2012/05/12/comment-of-the-week-by-thibault-heimburger/","cat":"challenge","title":"Comment of the Week by Thibault Heimburger"},{"id":"comment-4415","author":"gabriel","post":"Dan, in the first place thank you very much for your hard work keeping this blog going. After all, it is your inspiring posts that spark the debate and attract some many different people. As Yannick suggests, perhaps the best thing to do is ignore some of these comments. That’s all..","date":"2011-10-27","mins":"4:55 pm","url":"https://shroudstory.com/2011/10/26/destroying-the-magic-of-the-shroud-of-turin/","cat":"other_blogs","title":"Destroying the Magic of the Shroud of Turin"},{"id":"comment-19604","author":"gabriel","post":"I have had a look at David’s blog and to say the least, I haven’t found very scientific opinions on evolution and the second law of thermodynamics. I don’t know his scientific credentials to support such “creative” approaches to for example, the second law, but I bet that he also denies that a climate change is going on at this moment. It usually goes in the same pack….In my view, if he denies the authenticity of the Shroud, in view of the rest of things he supports, paradoxically, his denial truly becomes a strong argument in favour of the authenticity..","date":"2012-11-28","mins":"2:30 pm","url":"https://shroudstory.com/2012/11/28/david-roemer-will-maybe-present-the-shroud-of-turin-at-the-princeton-club-in-new-york/","cat":"other_blogs","title":"David Roemer will maybe present the Shroud of Turin at the Princeton Club in New York"},{"id":"comment-4397","author":"gabriel","post":"I agree with Yannick point by point. The rest of comments mixing neutrinos, the supernatural, the Shroud, the Bible and the resurrection (^2) in my opininon make some much harm……………..It is, very very sad.","date":"2011-10-27","mins":"12:42 pm","url":"https://shroudstory.com/2011/10/26/destroying-the-magic-of-the-shroud-of-turin/","cat":"other_blogs","title":"Destroying the Magic of the Shroud of Turin"},{"id":"comment-4408","author":"gabriel","post":"The percentage of certain type of messages like this by ‘saddened’ in this blog is exponentially increasing in this blog during the last days. It is getting worse and worse all the time. No science. Only intuitions. So sad. Perhaps, for me, time to leave and let all the space for them..","date":"2011-10-27","mins":"3:48 pm","url":"https://shroudstory.com/2011/10/26/destroying-the-magic-of-the-shroud-of-turin/","cat":"other_blogs","title":"Destroying the Magic of the Shroud of Turin"},{"id":"comment-7526","author":"gabriel","post":"I must admit that this is completely news for me but, Yannick, after your recent posts on the work by Pierre Barbet, the implications of not detecting on the blood stains a process of unwrapping the cloth from a body, are obvious and go very far. I have got a few questions: Has his conclusions been confirmed by someone else? Was Barbet granted direct access to the Shroud? Why his work is not so widely known ?.","date":"2012-01-25","mins":"2:38 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-7533","author":"gabriel","post":"Yannick: Thanks for your quick and very complete answer..","date":"2012-01-25","mins":"5:09 pm","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-12031","author":"gabriel","post":"I am afraid that in this case (once again) everything is far from being acceptable. The authors claim that after numerical treatment of the image, they have reached the conclusion, as Yannick says in his writing, that the layer of coloration possess the “additive” nature that allow the numeric treatment. If so, in the first place and if we are talking about a solid and scientific fact, they should send their findings to a peer rewieved journal so that other scientists can check whether their techniques and conclusions are acceptable in the current state of the art. Equally, they should let the image they have used freely available for independent validation by any other expert. At the present stage, using these results (not independently validated!!) to go one step forward and thus support Roger`s hypothesis, I am sorry to say, it is just not acceptable..","date":"2012-06-07","mins":"6:51 am","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12061","author":"gabriel","post":"By the way, in the same blog there is a quote to the work by Marion on hidden letters found after image processing. Marion’s work is to the best of my knowledge the only paper published in a high level peer reviewed journal regarding flowers, letters or coins in the Shroud. I have always found surprising that in spite of this fact, his work has been largely dismissed by the Shroud community…..","date":"2012-06-07","mins":"1:29 pm","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12058","author":"gabriel","post":"Peer review system and freely granted access to any material for independent confirmation are two major points of the scientifc method that with its shortcomes and limitations have made move forward all the fields of knowledge. If we want a solid and valid approach to what currently truly represents a scientifc challenge (the Shroud), let`s start by systematically adopting the same methodology that has made possible progress in the rest of scientific areas. I really think that the good amount of scientific peer reviewed written by Adler, Pellicori, Rogers and others (e.g. The very recent paper on the presence of a trend, with in my opinion very important implications) can and should be used to establish the solid facts know so far. HOWEVER putting this kind of literature at the same level of plausability as other, even for the pure purpose of “especulation” or “opening our minds to new paths” moves the Shroud well away from the main stream of science. For example, you can bet that in the scientific climate community nobody would even think of discussing creative analysis of data (ilke the creative analysis of images of the Shroud we see from time to time) if those data are not freely available to anyone and are open to in depth scrutinization. For these reasons Dan, I have to disagree with you: in my view this is not relevant at all to the Dawkins Challenge. He is a scientist and will only hold a discussion with scientists. I would also ilke to add that Roger’s theory is a solid theory (although not a fact yet). Its good position in the ranking of plausability is due exactly to the fact that Rogres approach has gone through the peer review system and he even shared his own material for independent research. In this sense, the current contribution on image treatment at this stage, does not represent the slightest confirmation to Rogers theory until it goes through the same system that has put Rogers theory where it is..","date":"2012-06-07","mins":"1:16 pm","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-12097","author":"gabriel","post":"We have to remember that, for Rogers, the hair could have trapped a lot of the gas coming out of the nose and mouth, leaving much less gas on the sides of the face to react with the impurities at the surface of the cloth. And in this particular case, since there are lighter bands on each side of the face, it’s very probable that there were not many impurities present in these areas in order to produce a coloration anyway. So, in these particular areas, it is possible that there was not much gas present and not many impurities (and maybe a good distance between the corpse and the cloth). Please note Yannick that if gas coming from the nose and mouth was trapped by the hair, that is, it is not emitted completely vertically, this is in contradiction with the vertical isotropy model defended among others by Ray Schneider in a recent post here. Honestly, I don’t know if the vertical isotropy aspect is a true fact of the image, but I just want to point out that if it were so, is in contradiction with an horizontal gas diffusion model from the nouse and mouth to the hair. In my opinion, the model by Rogers with a body emitting amines that react with a layer of impurities of the cloth, makes more sense if we think of a vertical flow of gas moving in a laminar regime. In fact, in my view, it is the only option. A horizontal motion of the gas from the nouse to to the hair would be very hard to explain according to the laws of fluid mechanics..","date":"2012-06-08","mins":"2:11 pm","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-10809","author":"gabriel","post":"Of course, everyone is free to express himself but, honestly, I think that there are not scientific grounds to support all the logical sequence mentioned here. Call it speculations and possibilities about quantum level physics conciousness, NDE and the Shroud. But please, don´t call it science when at the current stage of currently admitted science, there are no grounds to support such a connection. Unfortunately, every now and then, someone tries to build unexisting links between the 2nd principle of thermodynamic, modern physics…………..and the Shroud. In my view, this only helps to keep serious analysis and researchers belonging to science mainstream, far from the Shroud. Please, ask yourselves the following question: are you contributing to convince Shroud owners to do open and independent research, attract high level scientists and so move forward in current knowledege?.","date":"2012-04-24","mins":"8:03 am","url":"https://shroudstory.com/2012/04/23/shroud-of-turin-relationship-to-nde-and-obe/","cat":"other_blogs","title":"Shroud of Turin Relationship to NDE and OBE?"},{"id":"comment-6379","author":"gabriel","post":"Hummm, after reading so many theories, I think I am going to put forward a theory by myself also. To be succesful it must involve Templars, middle age sects and unknown mysteries…….I will use some of Scavone’s, Ian Wilson’s theories and….. Google Earth. You can connect Lirey in France (where the Shroud once was) , Athens (when Scavone says it also once was) and Jerusalem (where for sure it was once) with a straight line of 3200 km with an error of approximately 60 km (5%) on both sides of the line to effectively touch Lirey, Athens and Jerusalem. Furthermore, the distance betwen Lirey and A Thens (1975 km) follows the aurean proportion since 3200/1975=1.62. Just the same proportion than the ratio (Lirey Athens)/ (Athens Jerusalem distance)=1.62. Everybody can check it by himself on Google Earth!. No lie. It cannot be by chance!. The golden number, the Shroud and if I incorporate the templars……….it could make a good best seller for next Easter! : )).","date":"2011-12-31","mins":"3:32 pm","url":"https://shroudstory.com/2011/12/31/more-on-political-pistachio-some-scientists-claim-shroud-of-turin-is-authentic/","cat":"other_blogs","title":"More on Political Pistachio: Some Scientists Claim Shroud of Turin is Authentic"},{"id":"comment-12070","author":"gabriel","post":"Ok.","date":"2012-06-07","mins":"4:00 pm","url":"https://shroudstory.com/2012/06/07/marcel-alonso-on-rogers-impurity-layer/","cat":"challenge","title":"Marcel Alonso on Rogers’ Impurity Layer"},{"id":"comment-29103","author":"gabriel","post":"Nine good questions…..but the sixth one is wrong..","date":"2013-04-02","mins":"5:51 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-7191","author":"gabriel","post":"Meanwhile, after Turin 2010, the Church keeps on hosting, organizing and promoting very high level exhibitions of the Shroud http://www.diocesismalaga.es/index.php?mod=content&secc=view&id=2012011706 Why not with other relics? Is it only propaganda? Or are they basically convinced it is authentic? After all, they have had plenty of time since the C14 test to carry out their own experiments privately…...","date":"2012-01-19","mins":"4:09 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"},{"id":"comment-7192","author":"gabriel","post":"Typo error. It should read “very high level exhibitions about the Shroud”.","date":"2012-01-19","mins":"4:10 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"},{"id":"comment-7195","author":"gabriel","post":"Yannick, I agree but only partially because if it only was that the image helps Christians evocate and meditate on the Passion that would also work with the thousands of other relics or even with the many copies of the Shroud. However, it seems as though in this case, they were saying something like: “ok, we admit it..in the past we have in many occasions promoted the devotion of false relics in the past, but believe us….. This time it is the good one!”. Something that has also to be taken into account, as some comments regarding a previous skeptic post pointed out, is the very close connection of the Catholic Churh with science and in general, the Academia (scientists, Universities…).","date":"2012-01-19","mins":"4:59 pm","url":"https://shroudstory.com/2012/01/19/the-state-of-skepticism-ridicules-works-right/","cat":"other_blogs","title":"The State of Skepticism: Ridicule works. Right?"}]
