[{"id":"comment-152218","author":"gabriel","post":"Well,she was asked many questions after her presentation. Among them, some about the possibility of having been manufactured in a neighbour country like Egypt, Syria or even India. Again, she ruled out that possibility because the characteristics of textiles from those countries did not fit in at all with those of the Shroud. Furthermore, she was asked whether new future findings could change things. She answered that in her view, this was highly unlikely because her institution has conducted in the last years intensive specific field campaings in caves and candidate locations throughout Israel, and new findings in this field of textiles are highly unlikely..","date":"2014-09-18","mins":"9:20 am","url":"https://shroudstory.com/2014/09/12/surprising-paper-out-of-bari-plant-dna-studies-on-the-shroud-of-turin/","cat":"article","title":"Surprising Paper out of Bari: Plant DNA Studies on the Shroud of Turin"},{"id":"comment-152223","author":"gabriel","post":"I would add that Orit’s paper along with Fanti’s first analysis of HUMAN DNA from the Shroud are apportions that may open new research lines in the future.","date":"2014-09-18","mins":"9:40 am","url":"https://shroudstory.com/2014/09/12/surprising-paper-out-of-bari-plant-dna-studies-on-the-shroud-of-turin/","cat":"article","title":"Surprising Paper out of Bari: Plant DNA Studies on the Shroud of Turin"},{"id":"comment-152013","author":"gabriel","post":"The most relevant part of Fanti’s presentation was not the presence of plant DNA. He has also identified DNA corresponding to a variety of animals, including an extinct type of bird not present in current day catalogues. However, the most interesting part of his presentation was when he showed the results associated to human DNA. He has identified DNA to human linages from all over the world, although the most abundant is DNA corresponding to prevalent populations from the Arabic peninsula (semitic) and both sides of the Mediterranean. In the slide he showed, these three major human linages converged in the area of Egypt~Israel~Jordan~Syria. Seemingly, he has used DNA from the sticky tapes. Another interesting presentation was the one given by Orit Shamir, from the Israel Department of Antiquities. She is an expert in ancient textiles of the Middle East and clearly ruled out the possibility that the Shroud could have been manufactured in Israel during Roman times. She gave many solid reasons to support that conclusion, all of them based on her expertise on ancient textiles, thus posing a new challenge to those defending its authenticity. Regarding the HAL9000 high resolution images, the group of Turin thinks that since they have been taken in a non continuous way, that is, each photograph only covers a part of the Shroud, the light conditions change and putting together all the partial images would not be realistic. This seems to be one of the reasons not to release these high resolution images. Their current challenge is to do some sort of continuous scanning of the Shroud that would enable a whole homogeneous analysis of the pixels. Paolo di Lazzaro goes on with his research on lasers. A quick look in Science Direct indicates that he is author of more than 100 papers on lasers in peer reviewed indexed JCR journals. Surprisingly enough, most of them are not related to shroud studies whatsoever. In the last years, by fine tunning the operational conditions of lasers impacting on linens, he has been able to reproduce an increasing number of aspects observable on the Shroud. Whatever, this may mean it is worthwhile to follow his research. The Spanish members of the CES prsented the chemical analysis of the dust they have extracted from the sudarium of Oviedo. The results are truly interesting. Marzia Boi has reanalyzed the photographs of pollens corresponding to the STURP period and has clearly identified some major errors on the type of plant they belong to. Finally, Jose Luis Rodriguez gave a most interesting presentation on the analysis frame needed for a comprehensive study of the Shroud. He is an independent senior consultant in aviation and has imported some breaking edge methodology used in his field of expertise (the concept of system) to study the Shroud..","date":"2014-09-17","mins":"4:32 pm","url":"https://shroudstory.com/2014/09/12/surprising-paper-out-of-bari-plant-dna-studies-on-the-shroud-of-turin/","cat":"article","title":"Surprising Paper out of Bari: Plant DNA Studies on the Shroud of Turin"},{"id":"comment-158436","author":"gabriel","post":"Recently, archeologists have unearthed in Spain one of the oldest representations of Christ dating back to the IV century. In this image Christ has curled hair and lacks any beard on his face. You can have a look at this curious image here http://www.elmundo.es/ciencia/2014/10/01/542c3883268e3edd6c8b457e.html?a=5c95e3251744c118775e58fc3a814f4d&t=1412199903.","date":"2014-10-01","mins":"5:52 pm","url":"https://shroudstory.com/2014/10/01/the-rings-of-saturn/","cat":"press_coverage","title":"The Rings of Saturn"},{"id":"comment-29344","author":"gabriel","post":"I think that Fanti as anyone else deserves a fair evaluation of his work. I will hold my opinion until I read the book or better, until his breaking edge methods are positively evaluated in a peer review journal..","date":"2013-04-04","mins":"1:26 pm","url":"https://shroudstory.com/2013/04/04/a-critical-review-of-giulio-fantis-new-book-unreliable-results-because-of-inadequacy-of-methods/","cat":"books","title":"A Critical Review of Giulio Fanti’s New Book:   Unreliable Results Because of Inadequacy of Methods"},{"id":"comment-6492","author":"gabriel","post":"As Danin himself recognizes, his findings remain controversial. It is the same as with the rest of images (coins or letters) and evidences. Someone in this case Danin has access to the Shroud and honestly, to the best of his knowledge no doubt on this he thinks has found something. The discussion goes on and on for years and focuses on his credibility instead of the evidences themselves. Just like Rogers vs Mc Crone, because the scientific community does not have free access to the original material of the discussion..","date":"2012-01-03","mins":"7:25 am","url":"https://shroudstory.com/2012/01/03/boing-boing-interview-with-avinoam-danin/","cat":"books","title":"Boing Boing Interview with Avinoam Danin"},{"id":"comment-6493","author":"gabriel","post":"However, in the case of images (coins, letters, flowers) easy mathematical tests base on Montecarlo bootstrap techniques could be carried out on the pixels affected by the “image” and obtain an estimation of the probability of having been generated randomly vs the hypothesis of having a true “image” there..","date":"2012-01-03","mins":"7:32 am","url":"https://shroudstory.com/2012/01/03/boing-boing-interview-with-avinoam-danin/","cat":"books","title":"Boing Boing Interview with Avinoam Danin"},{"id":"comment-28568","author":"gabriel","post":"Unfortunately, this way of acting is the norm and not the exception in Shroud studies and one of the main reasons why the major stream of science is not interested in it. If every time new scientific discoveries are made they are not presented where they should ( peer review journals) and instead, a best seller is written and published around Eastern or Christmas, this definitively sounds suspicious. Most probably, in the forthcoming months, Fanti will attend a big number of Tv shows where he will be interviewed regarding the findings shown in this book and not those published in serious, peer review journals. So sad. Regarding his new findings, I will wait until I read his book or his work is published in a serious journal..","date":"2013-03-28","mins":"4:32 am","url":"https://shroudstory.com/2013/03/28/email-of-the-day-doing-things-backwards/","cat":"books","title":"Email of the Day: Doing Things Backwards"},{"id":"comment-28577","author":"gabriel","post":"Stephen, I usually act as a reviewer of journals belonging to the JCR in my field of expertise and to the best of knowledge, papers are commented or mentioned in the popular press ONLY AFTER being properly peer reviewed although perhaps after being accepted they are still in press. Science daily and similar usually provide the links to the full papers at the journal website, although still in press. That said, if this is the case of Fanti’s work, I have no objections just because he is Fanti and I would love to read if available, the corresponding science daily summary. I would have some, if he had chosen to write a popular book first, before receiving the OK from the reviewers of a JCR journal. If i am misunderstanding the situation, my apologies to Fanti..","date":"2013-03-28","mins":"5:25 am","url":"https://shroudstory.com/2013/03/28/email-of-the-day-doing-things-backwards/","cat":"books","title":"Email of the Day: Doing Things Backwards"},{"id":"comment-5506","author":"gabriel","post":"In this controversy, it can be clearly seen the reason why the issue of the Shroud still remains doubtful for the scientific community. In any other scientific field, it would be unbelievable that these results (true blood vs painting)depend on who we believe (Mc Crone vs Rogers) instead of the proofs themselves, which should be straightaway available to any scientist in the frame of a transparent system for evidence custody and management. If we want a true scientific research (and not a permanent “murkier than ever” status) , the current “scientific” approach to the Shroud must be rebuilt from the scratch and the whole set of protocols commonly accepted for any scientific field, should be adopted once and for all..","date":"2011-12-14","mins":"12:01 pm","url":"https://shroudstory.com/2011/12/14/forensic-chemistry-handbook-an-embarrassingly-unscientific-chapter/","cat":"books","title":"Forensic Chemistry Handbook: An Embarrassingly Unscientific Chapter"},{"id":"comment-8867","author":"gabriel","post":"A more serious quoting of Jesus has been recently discovered by the Spanish theologian Dr. Chapa. In a 2nd century papyrus kept by the University of Oxford but never analyzed before he has found very interesting information about Jesus and what Christians believed at that time. Sorry, only in Spanish. Http://www.larazon.es/noticia/8246 un espanol descubre un fragmento de un texto del ano 200 que habla sobre jesus.","date":"2012-03-01","mins":"3:45 pm","url":"https://shroudstory.com/2012/03/01/fasten-your-seatbelt-more-archeology-from-tabor-and-jacobovic/","cat":"books","title":"Fasten your seatbelt: More Archeology from Tabor and Jacobovic"},{"id":"comment-30976","author":"gabriel","post":"Fanti seems to have forgotten about his challenge to the Pontificia Academy. We’ll have to wait for his paper in that serious journal…...","date":"2013-04-16","mins":"1:31 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-20584","author":"gabriel","post":"Just to be accurate, Father Carreira’s work has been largely misunderstood because his thought have been expressed mainly in Spanish and I often find like in the case of Yannick that his quotes are not properly understood. In a recent Tv debate in Spain he mentioned in the line of Daveb that the resurrected body was composed of atoms (literally) but these atoms hold properties such that the spirit is the one acting on matter, just the other way round as in current life. I myself do not have a final opinion on this but for the sake of accuracy I just wanted to make clear his views on this issue..","date":"2012-12-17","mins":"4:07 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-20850","author":"gabriel","post":"Yannick, the other day you attributed the undisturbed aspect of the bloodstains to the remoisturing effect originated by the vapors emanating from the body. You mentioned that for an intial phase only, but in my view, the same explanation should be also valid after 40 hours, because the release rate of vapors (H20, ammonia, whatever…) responsible in your opinion for the remoisturing of bloodstains would increase with time. I disagree with you at this point, because I can’t think of a physical/chemical mechanism responsible for remoisturing bloodstains, neither at the initial hours nor at the end. This also leads me to disagree with you regarding the possible change in the configuration of the shroud around the body (in your scheme, initially tightly wrapped and after remoisturing and removing the cloth, gently falling on the body)..","date":"2012-12-20","mins":"5:18 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-24285","author":"gabriel","post":"Dave, regarding this point, in the book Eastwards to Tartaria, Robert Kaplan points out that Nazaret was only five km from Nazareth southwards. Seforis was completely destroyed in year 4 BC by Varo, the Roman legate. More or less, the same year Jesus was born. In the following years Seforis was rebuilt. Probably, a tekton in the area had the opportunity to work in the reconstruction of Seforis. The point is that Seforis became one of the few places where tolerance between jews and pagans bloomed and the city authorities decided not to join the revolts of years 66 70 or the later one of Bar khova. Robert Kaplan mentions that to which extent the atmosphere of tolerance that a young tekton might have found while working in Seforis, could have had an impact in Jesus’s teachings of love is still a matter of discussion among scholars. Unfortunately, I have never found any work on Jesus early days from this angle, beyond this quote by Kaplan..","date":"2013-02-14","mins":"5:16 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-20591","author":"gabriel","post":"I have found the link above in which Father Carreira expresses his points of view when he says that the resurrected body is composed of atoms. Yannick, I hope you know enough Spanish as to follow his words.","date":"2012-12-17","mins":"4:51 pm","url":"https://shroudstory.com/2012/12/17/is-it-absurd-to-think-that-the-shroud-can-show-a-physical-trace-of-the-resurrection/","cat":"books","title":"Is it absurd to think that the Shroud can show a physical trace of the Resurrection?"},{"id":"comment-24286","author":"gabriel","post":"Typo error:Seforis was only 5 km from Nazareth southwards.","date":"2013-02-14","mins":"5:18 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-5138","author":"gabriel","post":"I agree completely. I would add that most probably in the St Pauls letters there were already gnostic groups that posed a major challenge to the belief in an incarnation/death/resurrection of God. However, there was nothing like a gnostic church. It was more like a big number of gnostic groups which not always agreed among them (see Nag Hammadi gospels). So attributing the S Hroud to “Gnostics” gives the impression that there was an organized movement with commons rules and rites that held a gnostic view.It is curious that every year before Christmas and/or Easter new “highly challenging theories that could make the basement of Christian faith collapse” are presented in the form of books, TV shows…After all, Jesus after 2000 years still raises interest.","date":"2011-12-01","mins":"2:00 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","title":"Was the Shroud of Turin created by Gnostics?"},{"id":"comment-11260","author":"gabriel","post":"If you do that search in a scientific searcher like Scopus you can surprisingly still find recent peer reviewed literature regarding the Shroud (apart from the recent paper regarding the trend) In this paper (1), the author, an expert in criptology, analyses the alleged hidden messages found in the pyramids, bible codes, koran codes and……………the Shroud of Turin In this other recent paper(2) the authors describe C14 tests “like those used for the Shroud of Turin” carried out by the USAD. Seemingly in the USA only a few labs do C14 tests nowadays (1) Schmeh, K. The Pathology of Cryptology A Current Survey. Cryptologia. 2012. 36 (1) p 14 45 (2) Marc S. Reisch Volume 90 Issue 7 | February 13, 2012 | pp. 24 25 Verifying Biobased Materials Chemical & Engineering News ISSN 0009 2347.","date":"2012-05-10","mins":"8:58 am","url":"https://shroudstory.com/2012/05/09/a-search-for-shroud-of-turin-on-google-returns-2650-videos/","cat":"video","title":"A Search for Shroud of Turin on YouTube Returns 2,650 Videos"},{"id":"comment-5482","author":"gabriel","post":"Nevertheless, there could be a natural explanation for the source of that energy. In Israel, on the average, about every 100 years, there is an important earthquake http://www e.openu.ac.il/geninfor/openletter/ol18/pages4 10.pdf and in Matthew 27:51 we can read “And behold, the veil of the temple was torn in two from top to bottom; and the earth shook and the rocks were split” Several very serious scientific papers (*) indicate that strong magnetic, electric fields and corona discharge effects do take place in the frame of earthquakes. The local geomagnetic field seems to play an important role. If we have a look at the geomagnetic field near Jerusalem (http://models.geomag.us/wdmam.html, either the pdf or the KMZ file for visualization in Google Earth can be downloaded) we can see that in a very small distance the polarity changes abruptly from high positive to negative anomalies. (By the way, it seems curious that ancient Holy places like Jerusalem, Rome, Gizah exhibit strong positive or negative values of their geomagnetic field)..","date":"2011-12-13","mins":"11:38 am","url":"https://shroudstory.com/2011/12/13/the-real-face-of-jesus-to-re-air-on-history-channel/","cat":"video","title":"The Real Face of Jesus to re-air on History Channel"},{"id":"comment-5479","author":"gabriel","post":"I have watched the video and noticed that some of the experts support the idea of a burst of energy. They follow the line of the discussions on the Shroud in which those supporting the energy/radiation field theory, tend to attribute the source of that energy to a supernatural effect (Fanti) or a byproduct of the resurrection (Jackson, Russ Breault). Another theory supports the authenticity of the Shroud also, but the image formation mechanism is attributed to a natural chemical reaction (Millard or other). It could be said that the supporters of radiation/energy hypothesis tend to think that the source of that energy is not “natural”(roughly speaking) However, an energy based mechanism could better account for the 3 D effect, since in general, intensity values of radiation/energy fields tend to be lower the higher the distance to the source is..","date":"2011-12-13","mins":"10:01 am","url":"https://shroudstory.com/2011/12/13/the-real-face-of-jesus-to-re-air-on-history-channel/","cat":"video","title":"The Real Face of Jesus to re-air on History Channel"},{"id":"comment-5480","author":"gabriel","post":"Nevertheless, there could be a natural explanation for the source of that energy. In Israel, on the average, about every 100 years, there is an important earthquake http://www e.openu.ac.il/geninfor/openletter/ol18/pages4 10.pdf and in Matthew 27:51 we can read “And behold, the veil of the temple was torn in two from top to bottom; and the earth shook and the rocks were split” Several very serious scientific papers (*) indicate that strong magnetic, electric fields and corona discharge effects do take place in the frame of earthquakes. The local geomagnetic field seems to play an important role. If we have a look at the geomagnetic field near Jerusalem (http://models.geomag.us/wdmam.html, either the pdf or the KMZ file for visualization in Google Earth can be downloaded) we can see that in a very small distance the polarity changes abruptly from high positive to negative anomalies. (By the way, it seems curious that ancient Holy places like Jerusalem, Rome, Gizah exhibit strong positive or negative values of their geomagnetic field). ***************************** (*) Papers Giovanni P. Gregori. Geoelectromagnetism and geodynamics: ‘Corona discharge ’ from volcanic and geothermal areas. Physics of the Earth and Planetary Interiors. Volume 77, Issues 1 2, April 1993, Pages 39 63 Electromagnetic Field Anomaly Associated with the 1998 Seismic Swarm in Central Japan. Y. Fujinawa, K. Takahashi, T. Matsumoto, H. Iitaka, S. Yamane, T. Nakayama, T. Sawada and H. Sakai. Physics and. Chemistry of the. Earth ( Vol. 25. No. 3, pp. 247 253, 2000) France St Laurent , John S. Derr , Friedemann T. Freund. Earthquake lights and the stress activation of positive hole charge carriers in rocks.Physics and Chemistry of the Earth 31 (2006) 305–312 K. Tennakone .Stable spherically symmetric static charge separated configurations in the atmosphere: Implications on ball lightning and earthquake lights. Journal of Electrostatics 69 (2011) 638 640.","date":"2011-12-13","mins":"10:03 am","url":"https://shroudstory.com/2011/12/13/the-real-face-of-jesus-to-re-air-on-history-channel/","cat":"video","title":"The Real Face of Jesus to re-air on History Channel"},{"id":"comment-5481","author":"gabriel","post":"The conclusion could be that in the frame of an earthquake, with a natural strong local geomagnetic field, the corona discharge could be responsible for the formation of the image, BUT the source of that energy would not be supernatural, but a perfectly natural mechanism..","date":"2011-12-13","mins":"10:04 am","url":"https://shroudstory.com/2011/12/13/the-real-face-of-jesus-to-re-air-on-history-channel/","cat":"video","title":"The Real Face of Jesus to re-air on History Channel"},{"id":"comment-5488","author":"gabriel","post":"Yannick, please have a look at the set of experiments carried out by Giovanna de Liso with images obtained in earthquakes and presented at the 2010 Conference hosted at ENEA http://www.acheiropoietos.info/proceedings/De Liso Web.pdf.","date":"2011-12-13","mins":"3:40 pm","url":"https://shroudstory.com/2011/12/13/the-real-face-of-jesus-to-re-air-on-history-channel/","cat":"video","title":"The Real Face of Jesus to re-air on History Channel"},{"id":"comment-17515","author":"gabriel","post":"The original idea conveyed by Proff. Conti in the Italian version I am afraid is not correctly captured in the English translation we see in the post. In fact, Prof. Conti is AGAINST the idea of the Shroud being medieval. A quick search indicates that Pier Luigi Conti has got eight papers in JCR journals which at least, speaks in favour of his scientific profile. However, it would be great if those original raw figures from Tucson laboratory never made public before, could now be freely granted to anyone to corroborate his conclusions after an open discussion. I am afraid that as many other things in this world of the Shroud (photos, samples…) this will never happen…. At this point, I would have a question for the authors: In a recent peer reviewed paper (1) the authors show that Arizona data belonged to different subsamples. Have the mathematicians consulted for this documentary taken this into account? Nevertheless, the most interesting thing is that again, someone independently states that when you consider the entire Shroud – four yards of linen – “we could have a ripple hundreds or even several thousand years”. That is, after the paper by Morgan where he analyzed the UV image of the test area, and after this recent peer reviewed paper (1) once again we have a trend. Fascinating. (1) Marco Riani, Anthony C. Atkinson, Giulio Fanti,Fabio Crosilla , 2012. Regression analysis with partially labelled regressors: carbon dating of the Shroud of Turin. Stat. Comput. DOI 10.1007/s11222 012 9329 5.","date":"2012-10-11","mins":"2:59 pm","url":"https://shroudstory.com/2012/10/11/two-articles-on-the-francesa-saracino-documentary/","cat":"news_&_views","title":"Two Articles on the Francesa Saracino Documentary"}]
