[{"title":"It’s clever, some might say pretty, but is it science?","post":"This comment has just appeared on Dan Porter’s shroudofturin site. I shall address only key points right now, since I’m busy on other aspects:\nJune 22, 2012 at 5:25 am | #22\nReply | Quote\nTo «anoxie»\nIf you have any doubts on scientific questions concerning bloodstains my advice is not to ask Dr. Colinsberry because he’ll always provide misleading answers with the aim of discredit the Shroud.\nYou had better read previous excellent post on this blog concerning Shroud bloodstains by medical immunologist Dr. Kelly Kearse.\nMy husband is a medical doctor and he read all Drs. John Heller and Alan Adler’s papers on blood issue in their book «The Orphaned Manuscript».\nThis book contains several papers by these investigators most of them published in «peer reviewed» scientific journals and the conclusion is crystal clear, Shroud red stains are not red ochre and vermillion in a collagen tempera, actually they are blood.\nInasmuch, Professor Adler and Dr. John Heller did nor perform just the Hydrazine test that Dr Collinberry described in a very confusing way.\nThey actually tested not one but several samples from red stains and also studied red stains from human blood on fabrics as controls.\nThe finding of hemoglobin characteristic spectra, other spectrometry data, detection of blood proteins, bilirrubin and other blood components enables them to conclude that there is indeed blood on the Shroud.\nItalian forensic investigator Professor Baima Bollone obtained similar results working with material collected from other locations on the Shroud.\nBLOOD ON THE SHROUD IS NOT A GUESS IT IS A SCIENTIFIC FACT.\nkindest regards\nMaria da Glória\nCentro Português de Sindonologia\nMy reply:  Kelly Kearse’s contribution, which I was the first to commend, was primarily about the methodology of ABO blood testing, it touched only briefly on the protocols used for the Shroud, so who is being misleading here?\nre Alan Adler’s protocols: it’s easy to be impressed by lists of the tests he did perform to confirm “real” blood, albeit degraded. But one has to be a specialist in the area of tetrapyrroles, whether cyclic, like the porphrins, or linear like the bile pigments, to know that uv.visible and fluorescence spectra alone do not provide proof positive.  For two years I was a bile pigment specialist, working on Philadelphia on the phototherapy of neonatal jaundice, and teamed up with a then major drug company (SKF) to use state-of-the-art methodology for identifying bilirubin  photo-derivatives. key among those were initial thin layer chromatography, followed by derivitization to form volatile TMS-derivatives, followed by mass-spectometry. We were not content to look just for finger-printing fragments – we regarded detection of the molecular ion as our goal.\nThat was in 1972, well before the STURP studies, but nowhere have I seen Alan Adler using such rigorous methodology to confirm that he was detecting porphyrins, as distinct form substances with porphyrin-like spectra and fluorescence. Nor have I seen any real evidence for the existence of bilirubin, apart from diazo-reactivity and fluorescence. Why no chromatography? Why no mass spec? Why inflict a quirky conjecture involving a trauma induced bilirubin and “para-hemic” methaemoglobin to explain the permanent red colour of the “blood”? That is not science – that is daydreaming and pure fantasy.\nSo sorry, Madam, I am not taking lectures from you or anyone else on scientific methodology and credentials (though I thank you for pointing out that I hold a doctorate) .As for your suggestion that I “always provide misleading answers etc”, it is your own partisan position that is shown up here, not my own, as anyone reading my EXPERIMENTAL postings over the last six months, invariably backed with ample photographic evidence  and couched in moderate language should prove beyond all reasonable doubt.\nColin Berry aka sciencebod\n","date":"June 22, 2012 at 10:02 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-305","author":"colinsberry","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"I loved the Hebrew letters blog. Do you have the right glasses to see these things, I certainly don’t but if you look long enough at the internet images I assume  the Hebrew lettering will be clear so long as one doesn’t get any blobs in the wrong places ,then all you need to do is get your Beginners Guide to Hebrew, work out a phrase, find a biblical equivalent and once again scholarship moves forward.\nYou need to go onto Robert Carsgill’s website. He has had a wonderful time outing James Tabor and his mates who have found a tomb with the earliest evidence of Christianity, The Jesus Discovery. A crude drawing of an amphora on a base was interpreted by them as a fish with the head of Jonah coming out of it. They were murky photographs and every time Carsgill challenged something of theirs, a new photo appeared with slightly different lines drawn on it. At the end, wait for it, they reinterpreted what had once been seen as a stick body of Jonah  as the Hebrew letters J O N A H. You couldn’t make it up!\n","date":"May 1, 2012 at 4:34 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-248","author":"Charles Freeman","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"P.S. It would have to be by someone passionate about the care and preservation of ancient textiles whether they are two thousand or seven hundred years old. Looking at it from such a perspective the treatment of the Shroud and material removed from it has been outrageous -EXCEPT for the procedures for the 1988 testing which seem to have been within normal scientific parameters (filmed, textiles experts, a conservationist, representatives of the testing labs all observing the process) though I leave that for you to judge.\n","date":"May 1, 2012 at 3:12 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-244","author":"Charles Freeman","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"My first acquaintance with the Shroud was back in the late 70s. It was a big feature in the Sunday Times magazine, coming close on the heels of the David Rolfe “Silent Witness” documentary, and the Mandylion connection was one of the several persuasive aspects of the article.  Thirty or more years on  I am able now to see how this myth has come about, and it has numerous compelling aspects that have contributed to its staying power. I am presently preparing a post  on that negative image that transforms into the ghostly luminous positive that I suspect has turned a lot of minds – initially my own included. \nFor now, I’d simply ask this. How could an unattractive negative image have been framed as the fabled Manydlion, and then enchanted the early Church to the extent of inspiring the iconic image of Christ, when no one had ever seen the positive image, only achieved in 1898 with silver-salt photography? What’s more, there is a logical contradiction here. We are constantly told that no medieval artist would have attempted to paint a light/dark reversed negative, which is true (few modern artists attempt it either), yet we are asked to believe that a negative image (which I believe to be a branded “scorch” off hot metal or ceramic) was “seen” through the eyes of  pre-medievals as if magically transformed into an image of a haunting soft-focus image of Christ.\nI agree with you entirely. The Wilson hypothesis may have hit the jackpot in terms of book sales through accounting for a huge 500 year (?) gap in the history, but it never made sense to this science bod in “pre-photography”/scientific terms either , and I am glad that a respected historian like yourself has established that the history is bunk too.\nPS:  My two sons both did history degrees. I like to think that some of their father’s respect for history (with respect for primary sources) rubbed off on them…\n","date":"May 1, 2012 at 2:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-242","author":"colinsberry","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"David Rolfe actually did a review of  The Sign on Amazon.co.uk. It didn’t come across clearly what his position was but I replied to it, alongside a fascinating character called Trini who has it in for me. I wonder why. There are two books still to be written on the Shroud.\n One is to suggest that it may have originated in the East, even as early as the seventh-eighth centuries, drawing on Byzantine iconography, possibly coming into Europe with the Crusaders, in the same way that many  other relics are known to have come. I suspect others have researched this but there is a mass of documentation to explore. The cloth may originally have been woven in Arab workshops even, as the Veil of St.Anne ,the mother of he Virgin at Apt in the Vauclose is known to have been ( the Arabic lettering is still on it and it was four years old rather than  1100 as it needed to be when it was brought back).\nThe second is to explore the fiascos surrounding ‘scientific’ research. If you trawl the websites it is amazing how many bits and pieces of the Shroud are flying around.\nHow did Raymond Rogers get material for his 2005 paper? He is good enough to tell us himself in his ‘peer-reviewed’ paper.\n‘On 12 December 2003, I received samples of both warp and weft threads that Prof. Luigi Gonella had taken from the radiocarbon sample before it was distributed for dating. Gonella reported that he excised the threads from the center of the radiocarbon sample.’\nNow this is fifteen years  after the radio-carbon 14 sample was taken and Gonella was present but apparently not authorised to take any sample himself, but clearly he was able to do so, or at least provide what Rogers assumed was original material. \nThen sadly Rogers died and attempts were made to get hold of his material by another STURP member.\n‘When I first received the materials from the Rogers family, I noticed that one important sample was missing, Raes #1, the apparent end-to-end spliced thread that Rogers had identified. More than a year passed before I received the contents of Ray’s computer and it was only then that I discovered that Ray had given the sample to several of his LANL colleagues for scientific analysis just two weeks before he died. Fortunately, Ray had included their names, so I immediately contacted Bob Villarreal at the lab, introduced myself and asked him about the missing sample, which of course he still had in his possession. At that point (and much relieved that I had found the sample), I asked him if he would be willing to continue the work he had begun several years earlier with Ray. He enthusiastically agreed and over the past year I made some additional samples available to him and his team. This paper presents the results of their analyses of those samples.’\nThen in an interesting interview online Shroud researcher Joseph Marino tells us that he has an actual relic from the Shroud, although he was disappointed to find that it was only from the backing cloth.\nWho is charge of distribution of fragments of the Shroud? It seems that you have to sign up as pro-Shroud before you are allowed to have any. How does anyone keep a check on what is where and whether it is being contaminated or not?  I assume that most of these come either  from the Raes sample- but how has that got into the public domain so that Rogers got hold of some?- or the 32 pieces of sellotape  taken in the frenzied five day examination of the Shroud in 1978 in a hall where fragments of pigment were apparently floating down from the ceiling frescos. The 32 pieces of  sellotape was then passed on to one Walter Mccrone and we all know how that ended. There IS a book here!\n","date":"May 1, 2012 at 2:59 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-243","author":"Charles Freeman","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"You’ve reminded me that it was your comment that alerted me to the strange, not to say questionable, provenance of That Thread from the Middle. In fact  I copied it to file, the highest accolade this science bod can pay a non-scientist (now upgraded to honorary scientist).\nThere is indeed a book that desperately needs writing, before the entire world goes mad with New Age pseudo-science. Maybe it needs dual authorship (fronted by a published historian with a no-nonsense scientist in support role). Oops, sorry, that’s the opportunist part of me getting above himself…\n.\n","date":"May 1, 2012 at 3:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-245","author":"colinsberry","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"I am more than honoured to accept the upgrade! I used to be an International Baccalaureate examiner in critical thinking skills and I had to know how scientists, worked, or attempted to work, to find the truth. Alas a tempting offer but I am very tied up with my own projects- a third edition of my Egypt, Greece and Rome and two book proposals I am working on already.Still we might have got somewhere.\n I only got into this because I was so infuriated by the nonsense that was being passed around and I suspect you are the same. The Da Vinci code world is not really my favourite habitat.\n","date":"May 1, 2012 at 3:40 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-246","author":"Charles Freeman","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"I don’t know about you, Charles, but I knew most of the answers in advance to Dan Brown’s conundrums, simply though reading for interest, and thought the entirely literary device of the granddaughter having to follow an IQ obstacle course was too ludicrous for words. My dismay at the advance of New Age Impressionabilty was confirmed on a visit to the Louvre with hordes of Da Vinci Code tourists ticking off one more stop, presumably the New Age Pyramid,  on their supposedly ‘historica’l trail of the grand-daughter and then that of the preggers post-Crucifixion Mary Magdalene who landed up in France, just in time to found the Merovingian dynasty…\n","date":"May 1, 2012 at 4:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-247","author":"colinsberry","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"Sorry it is CARGILL.\n","date":"May 1, 2012 at 4:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-249","author":"Charles Freeman","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"Colin, I have to confess I have a very wicked side to me. But once you have read about Tabor do you think it is worth our friends getting in touch with him to see if he can find them an ossuary with the Turin Shroud on it, with in Hebrew ‘This is the Turin Shroud ‘on it? Wilson would have to rush out a new edition.\n","date":"May 1, 2012 at 4:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-250","author":"Charles Freeman","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"Dear Colin, Good to find your website. I am an historian who has worked extensively on medieval relics ( Holy Bones, Holy Dust, How Relics Shaped the History of Medieval Europe, Yale, 2011- reviews on Yale’s US website). If you think the pro-Shrouders’ science is crazy, you should see their history! The attempt to find a narrative for the Shroud from 30 AD to 1350 is just hilarious.  They confuse images of the living Christ with the Turin Shroud, they end up in hopeless non-sequiturs, at one point Thomas de Wesselow, the author of a new book The Sign, who claims a PhD in art history, confuses three different images/ burial cloths, each documented separately, into one, our friend the Turin Shroud.\nI think the presumption must stand that the 1988 radio-carbon 14 dating is broadly right until someone comes up with a coherent reason for overthrowing it . Of the hundreds of relics from Christ’s life, Passion ,Crucifixion and Burial – right up to the stone that was rolled away, let alone bodies ( two of them) of Mary Magdalene and most of the clothes of the Virgin Mary, that littered medieval Europe, none have yet been found to be genuine so the Shroud would  be a real first!\nI have been doing some battles on Amazon.co.uk and Amazon.com with The Sign (you will find my review and I have commented on others), but I think I am becoming a bore on the subject and must get back to real history. So this is just to wish you well!\n","date":"May 1, 2012 at 10:13 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-239","author":"Charles Freeman","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"Thanks for calling by Charles. I’ve been an admirer of your comments on The Other Site these last two or three weeks (please don’t go, at any rate not just yet – you come as a breath of fresh air, with a welcome hint of carbolic vapour).  \nYou bring an academic rigour that is so often lacking in Shroudology – in stark contrast to the other kind of rigor, single-issue  rigor mortis so frequently on display there.  \nRe historians: there are those who, like yourself, have ideas, and then write books, and there are those who write books (for a living) and then have ideas, naming no names. \n Thank goodness for Kindle, which spares me having to part with double-digit money only to find I have bought yet another “Tale of Mystery and Imagination”.\n","date":"May 1, 2012 at 11:33 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-240","author":"colinsberry","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"Thanks, Colin. Ian Wilson’s Edessa Image theory is so way out that when I saw someone who had actually done some original research and seen through it, I felt it important to support them.  (Although I don’t know what else Yannick believes he is spot on with this one.) There is no evidence that anyone took much notice of any of the competing burial shrouds during the Middle Age, yet the Shroud community assume that if even a cloth is mentioned it must be THE SHROUD. As you say, they have got everything the wrong way round. If someone notices that the Shroud ‘s face has similar features to Byzantine iconography, then it is worth investigating whether Byzantine images were the inspiration. In the Shroud community,it is assumed that all the icon painters were copying the image on the Shroud ( but opening the eyes and putting on some clothes on it)! I doubt whether one can really turn this round. Good luck, Charles.\n","date":"May 1, 2012 at 1:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-241","author":"Charles Freeman","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"Message to MPH: enough is enough .I have consigned that last comment of yours to the WordPress trash bin. Now if you don’t mind kindly stay away from my site. Thank you.\n","date":"April 21, 2012 at 4:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-174","author":"colinsberry","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"Anyone tempted to think I make too much of Adler’s ingenuity and creativity, or over-rate the impact his ideas had on impressionable or receptive  minds, needs only to read the following, written this year by Barrie Schwortz no less:\nBy Barrie Schwortz\n©2012 STERA, Inc.\nThe Prelude\nSpeaking on the telephone with Dr. Alan Adler, STURP blood chemist, was always something of an adventure and every conversation was a truly unique experience! (Anyone who knew him can verify this). Sometime in mid-1995 I was having one of my regular telephone conversations with him, not realizing that this conversation would ultimately prove to be one of the most significant in my life.\nAt the time, I was still not completely convinced that the Shroud of Turin was authentic (and it was eighteen years after I had held it in my own hands)! Although the STURP data had clearly proved that the Shroud was not a painting or a photograph or a scorch or a rubbing, we had been unable to determine  a mechanism that could create an image with those specific chemical and physical properties. However,  based on the data we did have, I didn’t believe for a moment that the Shroud of Turin was a medieval  “hoax!” I stayed abreast of what was happening in the Shroud world, but there were still many  unanswered questions and one of the most important ones was that no one had ever properly explained,  (at least to me), why the blood stains on the Shroud were still reddish in color.\nWhen the Shroud was first put before us in 1978, Vern Miller and I stood side by side over the cloth and  we looked very closely at some of the dense red blood stains found there, and then at each other. I guess we could both see the doubt in each other’s eyes, since we were both nodding slightly to the negative.\nWe had each noticed the red color of the stains and we both believed that old blood was supposed to turn  black or brown over time (and Vern had much more forensic experience than I did). If these stains were that old, why were they still red? Truthfully, at first glance, the stains did not really look like blood. We  discussed it quietly and agreed that this observation cast some serious doubt on the validity of the stains.\nIn my case, it was the last serious piece of the puzzle that kept me from accepting the Shroud as authentic.\nNow, eighteen years later, the subject of the red blood came up during this conversation with Al and I  told him it was something of a “deal breaker” for me. As I look back on that conversation today, I am puzzled as to why I had never asked him about this before. He was the most logical person to have discussed it with as he was the top blood expert on our team and had done the chemical analysis that  proved the blood was actually blood. Yet, for some reason, it never came up until that moment. I guess the 1988 radiocarbon dating results had pushed everything else off the table.\nIt was then that Al Adler gave me the answer! He explained that extended torture, like that suffered by the man on the Shroud, causes the breakdown of the red blood cell walls and the flooding of bilirubin  (an enzyme produced in the liver) into the bloodstream. Apparently, blood of that nature will remain red forever! There it was: a simple, straightforward answer from the expert.\nI can’t remember exactly how long after that conversation I took to reflect on everything before making the decision that there was only one answer possible about the Shroud: it had to be authentic. I remembered Sir Arthur Conan Doyle’s axiom spoken through the lips of Sherlock Holmes, “If you eliminate all the possibilities, whatever remains, no matter how improbable, is most likely the truth.”  Based on that logic, there was only one answer possible. I had spent years studying the science of the  Shroud and its image. After all that time, the scientific evidence had actually convinced me the Shroud\nof Turin was authentic! It was really something of a shock.\nhttps://docs.google.com/viewer?a=v&q=cache:rxL–eXYIN0J:www.shroud.com/pdfs/history.pdf+&hl=en&gl=uk&pid=bl&srcid=ADGEESgQDszi3KmF4NqTFinZapIwZRWArV6p2gt5XAgyAfDJjW2ACuBkIvEQllH-ViXXdySJfT81xNr0nXduuuYyn_GWfsGXECYUBD_PPwafNwqYQXZc04kiSWkkMKFTyOVeO-WHEt2G&sig=AHIEtbQpfS7Ew9_byx9jLKUTN0amJr0gAQ\n","date":"April 21, 2012 at 9:39 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-171","author":"colinsberry","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"Annotated version now added to the post. Some of it is may not be crystal clear – especially the section on clotting/exudation, where I had difficulty in following the train of argument or where it was leading (I wonder if there was not a typo in the original with “bilirubin” being entered when maybe methemoglobin was intended)\n","date":"April 21, 2012 at 8:32 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-170","author":"colinsberry","site":"colinberry"},{"title":"It’s clever, some might say pretty, but is it science?","post":"Afterthought: tomorrow I might try adding a simpler version of Alan Adler’s account, one that is less intimidating to those without a specialist chemical background. I think it important that technical terminology should not be allowed to deter folk from appreciating the kind of reasoning that has been employed in that argument, so as better to decide for themselves whether it’s a scientific argument or whether it is something that, whilst showing a degree of ingenuity, is not in point of  fact scientific (at least without additional supporting data).\n","date":"April 20, 2012 at 9:55 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/20/its-clever-some-might-say-pretty-but-is-it-science/","cat":"alan_adler","id":"comment-169","author":"colinsberry","site":"colinberry"}]
