[{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"Correct me if I am wrong, but you seem to be saying “OK, it’s been touched up. So what? It could still be genuine. Prove to me that there are not the remnants of real 1st century blood under various additions, even things as mundane as medieval artists’ pigments.”\nObviously I cannot. Such an exercise would be hard enough if there were free access to unlimited TS material. Thanks to the presumption that the shroud is holy, or might be holy, or could just conceivably be holy pending conclusive evidence that it is not holy, then we are prevented from testing the a priori assumptions that prevent us from testing … if you see what I mean. Arguing with the authenticists is becoming more and more like arguing with flat-earthers. It all comes down to insistent demands to provide incontestable evidence, nay proof that it is 1st century, and even radiocarbon dating is then fair game for the “I challenge you to prove me wrong” tendency (invisible re-weaving etc). But I’m sure I don’t need to remind you that science does not work on that basis. Science prefers to focus attention on the genuine anomalies, the ones that yield fresh data and clues. There’s no scientific kudos to be had for constantly banging one’s head against a brick wall, for persevering with lines of enquiry that lead nowhere.\n","date":"July 19, 2013 at 7:41 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-2201","author":"colinsberry","site":"colinberry"},{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"So let’s suppose, hypothetically, that Joe Nickell’s and Walter McCrone’s assessment of just the blood (and not the body imprints, which I am not willing to concede) were correct.  Let’s say that red ocher and diluted vermilion were used to paint blood.  How could we know if such painting was original to each ‘wound’ site, or traced over existing blood?  Let’s say that the original intent was to exhibit this 14′ sheet as Jesus’ shroud.  The imprints of the body were already a mystery to a medieval crowd, but could be seen from a distance.  But the blood, perhaps, needed to be, at least in the artist’s mind, enhanced.  Is there a way to determine whether blood was original to each site, but that may be concealed under enhancement?  And do we know that every wound site displays equally (quantitatively as well as qualitatively) the same properties as those which are obviously ‘enhanced’ because of the brightness of the red, which should have darkened over time?  I would appreciate the best answer, but all are welcome, if there is any interest.\nSincerely,\nGary Strecker\n","date":"July 19, 2013 at 5:07 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-2199","author":"Gary Strecker","site":"colinberry"},{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"fantastic submit, very informative. I wonder why the opposite specialists of this sector\ndo not realize this. You should proceed your writing.\nI am confident, you have a great readers’ base already!\n","date":"July 2, 2013 at 10:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-2193","author":"Glass Bowls","site":"colinberry"},{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"Excellent web site you have got here.. It’s difficult to find high quality writing like yours these days. I honestly appreciate people like you! Take care!!\n","date":"June 30, 2013 at 12:06 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-2188","author":"demolition","site":"colinberry"},{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"Hello again Adrie\nYes, I see it has Google’s fingerprints all over it – or should that be tentacle imprints, despite there being no formal link-up between WordPress and Google that I am aware of. That in itself is enough to make me wary.\nI’ll keep the comments option open for as long as possible, but would not be surprised to find myself shut out of my own blog, such is the increasing extent of control-freakery where the online world is concerned. Forget about the touching concern for our security: they are all looking for connectedness and the commercial spin-off that goes with it, needless to say. They want the world to be one big social network. No thanks. I like a degree of privacy and I like to be in control of my own opt-in decisions.\nIt’s been interesting hearing from you Adrie. While we differ in our standpoints, I have been hugely impressed with your eye for detail.\n","date":"April 6, 2013 at 11:22 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-2086","author":"colinsberry","site":"colinberry"},{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"Thanks.\n","date":"April 6, 2013 at 1:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-2087","author":"Adrie","site":"colinberry"},{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"I’ve just received an email from WordPress that begins as follows:\nJust Another WordPress Weblog\n← Freshly Pressed: Friday Faves\nGreater Security with Two Step Authentication\nWe know your blog is important to you, and today we’re proud to announce Two Step Authentication: an optional new feature to help you keep your WordPress.com account secure. For those of you who use Two Step Authentication with your Google account, you’ll know how useful this feature is for keeping your account secure.\nTwo Step Authentication works like this: when you log in to your WordPress.com account, we’ll prompt you to enter a secret number. To get that secret number, you’ll need to download the Google Authenticator App on your smartphone. It generates a new number every 30 seconds, making it virtually impossible to guess. All you need to do is open the app on your phone, and type in the number it’s showing. If you don’t have a smartphone, you can instead opt to have the number SMSed to you…\n……………………………..\nAs it happens I had already semi-mothballed this site (maybe just as well).  Don’t be surprised to find the site totally mummified next time you visit, or at any rate in suspended animation, given that I have no intention, now or in the future, of combining my internet and mobile/landline existences. We bloggers have to be extra security-conscious – WordPress does not seem to appreciate that…\n","date":"April 6, 2013 at 7:34 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-2084","author":"colinsberry","site":"colinberry"},{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"Right, Colin. Again I agree. I have no intention either of combining the two, ever.\nThanks for all your input on this blog and others.  I’ve enjoyed our conversation and will probably still visit this blog, once in a while, as a great source of information and photos.\nGood luck!\n","date":"April 6, 2013 at 10:44 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-2085","author":"Adrie","site":"colinberry"},{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"Bilirubin is one of other indications that the Shroud is authentic.The Shroud is the visual gospel of the sufferings,death and resurrection of the Lord Jesus of Nazareth.It is a stumbling rock like His owner for those who hear but do not understand,and who see but do not perceive same as in the days of His sufferings.\n","date":"April 4, 2013 at 5:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-2081","author":"Souheil Bayoud","site":"colinberry"},{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"When I went to Philadelphia to work on the phototherapy of neonatal jaundice, all but one of the overhead strip lights had been removed from the lab.That’s because bilirubin is photosensitive – the very property that is exploited in phototherapy.\nI know that Alan D. Adler claimed there were “extraordinary” levels of bilirubin in Shroud bloodstains. Quite how he could have known that, given his rudimentary analytical procedures, is anyone’s guess, and why was a scientist  using a term like “extraordinary”? Scientists are supposed to be precise and quantitative.\nI remain to be convinced that there is ANY surviving bilirubin in Shroud blood, and even if there were, I defy anyone to show it can link up with oxidized haemoglobin (methaemoglobin) to form a permanently red pigment.Bilirubin prefers to keep its own company (forming internal hydrogen bonds that account for its poor solubility in most solvents, except those like DMSO etc that disrupt hydrogen bonds).\nSorry, but I deal in ‘hard’ chemistry and biochemistry. Adler had no business using STURP as a launch pad for his fanciful and far-fetched speculation. Barrie Schwortz should stop proselytizing Shroud authenticity on the back of Adler’s bilirubin hunch that was in my considered view complete NUTS.\n","date":"April 4, 2013 at 5:39 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-2082","author":"colinsberry","site":"colinberry"},{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"I suspect it takes a lot more than amputation, or even “trauma” to elevate bilirubin. It’s understandable that should happen in foot strike injury where the red cells are subject to mechanical stress and undergo haemolysis, but to read some of the Shroudie literature, most emanating from Alan D Adler – a man with a limitless imagination – one could be forgiven for thinking that any prolonged trauma induces severe jaundice. That’s news to me… What could be the mechanism?  Scourging, maybe, but if that is primarily damage to superficial blood capillaries, would not most of  the damaged red blood cells simply bleed out, rather than return to the venous circulation (how could they if the capillary vessels are damaged?)\nReturning to what you said in an earlier comment, Hugh\n“6)  I read somewhere that pink fluorescence might be due to the charring of the cloth in the absence of oxygen. I tried heating a bit of linen tightly wrapped in tinfoil, and also inserting it into a test tube with boiling water in the bottom (driving out the air). Fluorescence remains firmly greeny yellow.”\nI seem to recall a chemistry experiment in which something was heated in sand to exclude oxygen. It may have been to make charcoal, or perhaps something more exciting. Maybe that would be worth a try\nIncidentally, I suspect that some scorching from templates is effectively anaerobic – evaporation of adsorbed linen moisture and then pyrolysis generating steam etc that, having nowhere to go except through the interstices of the weave to the underside, effectively flushes out oxygen along the way. But oxygen may be needed to get certain classes of pyrolysis products or reaction pathways with more or less fluorescent products, maybe some fluorescing red, some green. Plenty there to occupy the experimentalist. The field is clear (I discovered early on in my research career that my eyes are very sensitive to uv,  of which there was a great deal in the intense light source I used for my phototherapy studies  – a high pressure mercury lamp – ostensibly for uv – from which I had removed the filter to get the visible light). Incipient retinal damage (and bad headaches) was what the optician said – so I’d advise you to take care… Maybe ordinary specs filter out most of the uv,  as they are supposed to theoretically, but they didn’t protect me…\n","date":"October 24, 2012 at 3:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-996","author":"colinsberry","site":"colinberry"},{"title":"OK, so there is bilirubin in the Shroud bloodstains (or so we are told). But how much precisely?","post":"So, if I chop one of my fingers off (suddenly, so I haven’t had time to panic or stress) and collect the blood, screaming in pain, and then chop off another (when the pain and stress has increased my bilirubin levels) and collect that…\nSorry, school laboratory science does have its limitations….\nAnd I wouldn’t know how to measure the bilirubin levels anyway!\n","date":"October 24, 2012 at 2:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/ok-so-there-is-bilirubin-in-the-shroud-bloodstains-or-so-we-are-told-but-how-much-precisely/","cat":"alan_d_adler","id":"comment-995","author":"Hugh Farey","site":"colinberry"}]
