[{"id":"comment-2276","author":"a_a_m_van_der_hoeven","post":"I claim the Turin Shroud was the unique Jewish Roman tallit of the priest and secret disciple John Mark, before he had to leave it in the hands of the temple officers in Gethsemane, it was used by these officers to cover up and beat Jesus in prison, and before Joseph of Arimathea bought it from these temple officers to use it as Jesus’ priestly burial garment and thus bury Jesus “as is the burial custom of the Jews” (John 19,40), namely in a garment. On the early morning of Easter John Mark “saw and believed” (John 20,8); he saw his tallit in the empty grave, “rolled up in one place” (John 20,7), just as a priest’s temple garment was always rolled up and put in one particular place in the temple, namely at the head of the sleeping priest, and believed that only a risen Jesus could have done this for him. He took it form the grave – Jerome says that Jesus gave it to the servant of the priest (De Viris Illustribus II) , removed the corners and its fringes, to prevent that anyone would recognize the rolled up cloth as his unique tallit, hid it and remained a priest and secret disciple, just as Jesus had commanded him – “remain until I come” (John 21,22) , and later took it to Ephesus with Mary. If you wish, read the arguments and details from Bible and Talmud and Shroud research in my free biblical article “The seam and missing corners of the Turin Shroud as characteristics of John Mark’s temple garment” on my site http://www.Jesus King.info, or else my more elaborate free article, which contains the same thesis, “John Mark – Author of the Gospel of John with Jesus’ mother”. The articles are also available and free in Dutch. I am sorry I didn’t know about Mr. John N. Lupia’s book, or about this site, until today. God bless..","date":"2011-01-24","mins":"5:14 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-3780","author":"a_a_m_van_der_hoeven","post":"Hello Bald Eagle, You might also like to read the excerpt of my above mentioned articles on John Mark’s garment and the Shroud. It’s only 7,5 pages long, and is free on http://www.jesusking.info/John%20 Mark%27s%20garment.pdf. And the Jewish Encyclopedia has an image of a tallit as long as the Shroud, with long border(s) and corner fringes, worn thrown loosely around the shoulders: http://www.jewishencyclopedia.com/img template.jsp?volume11/V11p677002.jpg&volume=volume11&imgid=1901 Enjoy the reading, Adrie.","date":"2011-09-03","mins":"8:03 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"},{"id":"comment-6286","author":"a_a_m_van_der_hoeven","post":"The fifteenth century image of a tallit as long as the Shroud with long border(s) and corner fringes, worn thrown loosely around the shoulders, has been moved to http://www.jewishencyclopedia.com/articles/14210 tallit.","date":"2011-12-30","mins":"6:22 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","title":"New Shroud of Turin book by John N. Lupia"}]
