[{"id":"comment-3610","author":"amanda","post":"So strange you mentioned that, because I too just looked at her gallery and over the years her paintings have become… something I do not like. One is entitled “The First” and she wants you to draw your own conclusions. I concluded that these were two teenagers fixing to have sex. It was a very good painting, don’t get me wrong… but after almost drooling over her Prince of Peace painting and then seeing “The First”, it just turned me off. I still want a Prince of Peace hanging in my living room, it just awes me..","date":"2011-08-14","mins":"6:23 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6163","author":"amanda","post":"Your story is quite an interesting one, and reminds me of my own experiences with one of my children, though not quite the same. Over the past several years I’ve had a spiritual war for my child that has brought me closer to the Lord and often on my knees. God has shown me much through it. I do believe, through observation, that children with some internal weaknesses, it seems, tend to be more spiritually awakened. I would like to advice you to draw very near to God through the scriptures so as to saturate the atmosphere of your home with His presence. Be careful not to allow the enemy to take advantage of your child’s unique gift. The scripture does often teach of the medians and spiritists in a negative sense. By adhering to the Word, you can discern through the experiences your child shares with you and you can also use them to draw your family nearer to the Lord Jesus. May Jesus bless you..","date":"2011-12-27","mins":"2:18 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
