[{"id":"comment-47697","author":"r_h_cahall","post":"Thank you for your reply to my recent email. You raise good, and sophisticated, points. However, I had already acknowledged that, of course, more remains to be discovered or determined. There will always be something else. That is simply the nature of this sort of inquiry. In a sense you indirectly support my basic contention because none of the questions you raise is potentially disconfirming, a striking fact in itself. If the absence of an hypothesized Hebrew word, or type of pollen, on the Shroud served to demonstrate its inauthenticity, rather than merely the fallacy of the particular (confirming) hypothesis, then what you say regarding suspension of judgment would, to that extent, hold true. But none of the issues you raise has that character. At worst, the mountain of evidence in favor of a positive judgment would have a few less stones. This is the chief thing about the Shroud. Beyond what I’ve already called a botched carbon 14 test, NOTHING disconfirms its authenticity. All the solid evidence of which I am aware is in its favor, and that evidence is so striking, and the facts so mutually supportive, I truly cannot see why you would believe the sum to be insufficient. Therefore, I respectfully reiterate my complaint, that you do seem to me to be holding the Shroud to an impossible standard. There will never be a time when you cannot point to something yet to be proven, but should such a circumstance prevent you from rendering a perfectly reasonable judgment on the basis of what is now known, given the extent and quality of the evidence? Thanks again. (Very interesting blog by the way.).","date":"2013-10-16","mins":"7:42 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-131697","author":"r_h_cahall","post":"Here we go again. The expansion of the universe is a strictly scientific question that can only be settled by indirect observation (used to be red shifts, I’m not sure what they’re doing now). You can’t stand outside the universe and watch it grow. The authenticity of the Shroud of Turin is, finally, an historical question, to the resolution of which scientific investigation is undoubtedly quite relevant but not (absent a knock down countervailing fact, which the carbon dating proved not to be) wholly dispositive, and the Shroud can be observed directly. Of course this doesn’t mean theories cannot be proposed and revised about this or that aspect of, say, the manner of image formation. In the end, however, you have a lot more going on here than science or scientific speculation, and methods of “proof” (read: “authentication”) that are actually more intelligible. You are, at a certain point, entitled to plead the weight of the evidence, as well as the absence of credible counter evidence. The standards involve reasonable doubt, not hyperbolic doubt. Hyperbolic doubt is a somewhat strained philosophical method inappropriate here. It is not incumbent upon anyone to doubt, doubt, doubt until his dying breath. Given enough weight to the total evidence, historical, artifactual (archaeological), scientific, etc., it is not reasonable to do so. It may be a judgment call as to when the weight of evidence tips the scale, but we are not and should not be free to postpone it indefinitely. Legitimate questions and issues will always remain to be investigated. This is, after all, a highly complex subject. But such investigations can be done in light of a general consensus. They do not need to be prodded along by some sort of strange unending scepticism..","date":"2014-06-20","mins":"10:06 am","url":"https://shroudstory.com/2014/06/20/everyones-own-facts/","cat":"blood_studies","title":"Everyone’s Own Facts"},{"id":"comment-47813","author":"r_h_cahall","post":"Mr. Farey: Thank you for the response. It well may be that a positive judgment on the Shroud at this juncture comes down to a question of temperament and you, perhaps because of more scientific training in the relevant disciplines, are more judiciously restrained. Fair enough. The points you make are certainly worth considering. It would be precipitous of me to reject what you say outright but not, I think, to place a bit less weight on it insofar as I still find the balance of the case for authenticity convincing. My reason, at the most basic level, has to do with the confluence of what you call the circumstantial evidence. In law it is often held that a circumstantial case can be stronger than one depending on direct evidence, eyewitness testimony for instance. I think the same is true here. It is not so much one thing alone as the interlocking of many independent pieces of the puzzle, the fit of the facts as much as their individual power to convince. I said it is a matter of temperament, but perhaps a better way to put it is that the judgment boils down to one of perspective. Some of us, and as you demonstrate not without reason, focus more closely than others. Both perspectives may indeed be necessary. All I would point out is that there is a pretty massive forest here as well as separate trees..","date":"2013-10-17","mins":"5:09 pm","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-47858","author":"r_h_cahall","post":"Mr. Colinsberry: You seem to move between two ways of construing my use of the word “botched”. In the first, you defend the protocols of the labs themselves as dealing correctly with what they were given. In the second, you widen the sense to include all the protocols, or lack thereof, for selecting, gathering, and delivering the samples. The close spread of the dates does seem to indicate that the labs in question performed their respective tasks competently. My criticism was intended with respect to the broader way of regarding what transpired. I do agree that the best way to proceed is to do a re test under scrupulously sound conditions. Absent that, however, I would still maintain that the tests are, to say the least, anything but dispositive..","date":"2013-10-18","mins":"3:38 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"}]
