[{"id":"comment-52870","author":"r_h_cahall","post":"Michael Novak is a dire warning of what has happened to the Catholic Church since the horror of Vatican II. I can just hear Jesus saying to the disciples, “You know, in the dark of night I’m not so sure there is a God at all. Maybe the unbelievers are right, who knows?” Yeah that fits him like a glove. His last words from the cross were “my God my God why have you forsaken me?”, not “my God, are you there?” The “sheer modesty” that compels that crowd to listen led to the utter travesty of the Assisi prayer meeting and a photograph of an apostate “Pope” kissing a Koran. Reminds me of the phrase about being so open minded your brains fall out. It would be impossible to misconstrue the “cloud of unknowing” or the “dark night of the soul” more comprehensively. The apophaticism of Dionysius is just not quite the same as becoming the fellow traveller of atheists and sceptics..","date":"2013-11-26","mins":"8:18 pm","url":"https://shroudstory.com/2013/11/24/common-ground-between-believers-and-atheists/","cat":"uncategorized","title":"Common ground between believers and atheists"},{"id":"comment-53170","author":"r_h_cahall","post":"I suppose the comment signifies that the authenticity of the Shroud is not a matter of style, which I too believe. The same cannot be said for the Anglican/Episcopal “Church” where style sense has resulted in a substitution of the Zeitgeist for God. But then that’s what it always was, since the time of Henry. It’s basically the same “smoke of Satan” that one Pope observed had made its way into the post Vatican II Church, which he also noted seemed to be tearing itself apart. (Personally, I’d make that the Counter Reformation Church, but it comes down to the same thing.) What all the ubertrendy people wish to expunge is precisely what the Shroud itself testifies to: Jesus Christ, the same yesterday, today, and always. Or in the language of Revelation, the God who was and is and is to come..","date":"2013-11-28","mins":"10:21 am","url":"https://shroudstory.com/2013/11/28/a-quote-you-wont-want-to-use/","cat":"news_&_views","title":"A Quote You Won’t Want to Use"}]
