[{"id":"comment-52004","author":"r_h_cahall","post":"Exactly. As I have stated before on this blog, there is the forest and there are the trees. It is altogether salutary to debate individual facts until a reasonable consensus is attained. However, it is equally if not more important to stand back a bit and assess the totality of facts in context. When that is done, the authenticity of the Shroud seems, if not beyond all doubt, certainly not beyond hyperbolic doubt, beyond reasonable doubt. I am all for re testing, gathering more data, precise analysis, etc., but demands can be pushed past the bounds of sanity..","date":"2013-11-19","mins":"9:23 am","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-92311","author":"r_h_cahall","post":"There is an old joke about someone asking directions to a particular place and being told, “You can’t get there from here”. However comic such an assessment may be in terms of ordinary geography, in certain other areas it is no more than common sense. In charity, and with all due respect, Mr. Klotz is simply mistaken, and not as a matter of mere inadvertence but technically and fundamentally. While it is unexceptionable that Newton’s work did lead some people to philosophical determinism, it is no less so that Newton himself and many scientists following him were not so deceived. This is Newton writing in the General Scholium: “But there is no direct sense and there are no indirect reflected actions by which we know innermost substances… No variation in things arises from blind metaphysical necessity, which must be the same always and everywhere. All the diversity of created things, each in its own time and place, could only have arisen from the ideas and will of a necessarily existing being.” Newton was not only a man of incomparable brilliance, the greatest mathematician since Archimedes, but a great man in the sense Washington would prove himself great: someone unwilling to press an extreme advantage beyond the bounds of Reason. It is perfectly possible to acknowledge Newton’s physics and, with Newton, remain a theist with all such belief entails. It is also possible to acknowledge Heisenberg’s physics and be a complete atheist. Nor is quantum physics itself, as David Bohm held, necessarily indeterministic, and moreover it is at least infelicitous to say, with Mr. Klotz, that quantum indeterminism consists in obeying the rules of probability. (What sort of “obedience” accords with philosophic indeterminism?) To say that the notion of quantum information “would explain the ‘substance’ of humanity” is utterly misguided. It is to credit physics with a level of intelligibility it does not, and cannot, possess. You can’t get to the substance of humanity from physics. No less a quantum physicist than Richard Feynman in a lecture once admitted that he had not the slightest idea what he was talking about, only that what he was saying happened to be supremely accurate. He couldn’t say why it was so, but only that it was so. As for the appearance substance dichotomy in Aquinas, I have never heard or read of it as a “translation of concerns advanced by Plato”. Aquinas didn’t call Aristotle “the Philosopher” for nothing. I read this blog to try and keep up with scientific researches relevant to determining the authenticity of the Shroud. That is very different from trying to use the Shroud or anything else to bootstrap scientistic notions about the philosophical claims of physics. I therefore respectfully suggest that Mr. Klotz needs to reevaluate his case..","date":"2014-03-23","mins":"12:25 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","title":"John Klotz from his upcoming book"}]
