[{"id":"comment-95017","author":"r_h_cahall","post":"Mr. Klotz, If you are defining the God of Prophetic Monotheism as primordial consciousness, you are making a terrible mistake. You have defined Brahman, not Yahweh..","date":"2014-03-30","mins":"7:10 pm","url":"https://shroudstory.com/2014/03/30/john-klotz-wants-your-feedback/","cat":"books","title":"John Klotz Wants Your Feedback"},{"id":"comment-95262","author":"r_h_cahall","post":"Mr. Klotz, I have tried, respectfully, to suggest to you that there are certain quite important things you seem not to understand. For instance, the difference between an explanation and a correlation. Even more significantly, the difference between a scientific explanation and a philosophical one. I quoted Newton’s General Scholium in another thread, to point out that he himself understood very well the difference between what science can uncover and what lies forever beyond it. You do not understand that any sufficiently comprehensive philosophical position can account for any scientific finding. Consider solipsism. Very few accept it, but it is nevertheless notoriously difficult to refute. A comprehensive philosophy is in that regard a bit like comprehensive insanity. Someone who is truly insane can explain anything in terms of his prior determinations. Indeed few people, as Chesterton observed, can be as thoroughly rational as a madman. Having examined the problems for some time, I have become convinced that there are no knock down arguments to establish idealism, materialism (physicalism), or dualism. They are ground level positions adopted prior to the possibility of argument. They are, in fine, rhetorical premises, not logical conclusions. I myself happen to be a kind of dualist: I call my own version “transcendental dualism”. The operative phrase is “happen to be”. I cannot provide an argument TO it, but I can certainly argue FROM it. The best I can do with respect to the position itself is make a rhetorical, or plausibility, argument. That is for the unexceptionable reason that any argument whatsoever must be grounded in what is accepted without question, without itself being a conclusion. It is in other words grounded in faith. Science simply does not operate at that level. Science is no doubt important in all sorts of ways, and can be brought into properly philosophical arguments in support of contentions grounded beforehand in a properly philosophical manner. It cannot, really CANNOT, be the foundation of a truly philosophical position. Science is bounded, as Newton well knew, by the limitations of its own nature. It cannot overstep itself, however fervently some may wish it. You really are basing your work on fundamental mistakes, category errors, that will vitiate the entire project. Of course, that’s your business, but I thought I’d at least point it out. Even more insidiously, you are constructing a “God” out of various scientific findings that has nothing to do with the God of Jesus Christ and is profoundly irrelevant to any theological considerations of the Shroud. With all due respect, your position is a real mess philosophically, theologically, and even scientifically. It cannot move any relevant discussion forward in a meaningful way. Finally, I don’t give a tinker’s dam what anyone’s IQ is. I have met enough high IQ idiots to convince me that whatever is being measured in that way, it isn’t real intelligence..","date":"2014-03-31","mins":"3:08 pm","url":"https://shroudstory.com/2014/03/30/john-klotz-wants-your-feedback/","cat":"books","title":"John Klotz Wants Your Feedback"}]
