[{"id":"comment-3559","author":"kyle_hill","post":"It’s interesting how you say that no one talks about God more than atheists, yet God is your only argument, and God is your only reason. Making an argument that’s supposed to be convincing about God that has to first presuppose his existence is circular reasoning, and I am not impressed. I provided an adequate reason for why science uses the criteria that is does, and it certainly keeps and open mind (as I stated). It even tests the supernatural, such as the effects of ESP, the efficacy of prayer, and the implications of out of body experiences. The reason that you never hear about these studies is because their outcomes are never positive. As far as we know, there is no evidence that points to the supernatural. It is not that science is “close minded”, it is that there is no good reason to believe that the world works in a supernatural way. Your Christian/Religious bias is quite clear in your response, and I feel that you are letting that bias cloud your reasoning, claiming that science is being suppressive only until it actually finds something. If science did find something that was indeed supernatural, I don’t think that you would be accusing it of close mindedness (and this discovery would be through the normal criteria that we have in place now). Not only did you dodge every single one of my arguments, you also are arguing on a basis that requires you to know God’s intentions, which is something that I think is a no no for Christians. Who are you to say that “God doesn’t want a lot of rebels”? Do you know what God wants? That’s a pretty huge leap to make for a mere mortal. And are you kidding me with being offended that atheists are being evangelical? Try to ride 10 minutes in a car without seeing a church, or a religious billboard, or crucifix somewhere. Try to find a country where the Church hasn’t sent someone to go door to door or village to village in order to save souls. This is the definition of evangelical. But of course it’s only OK if it’s for religion right? Is everyone supposed to be OK with that, or is it only OK if you are a believer? What about the road signs that tell me that I am going to forever burn in hell for my non belief? Does it suddenly become OK if its always been like that, or if there are more believers than atheists? You are arguing from a very privileged position, remember that, and remember that everyone has a right to express themselves, even if you don’t agree with what they say..","date":"2011-08-10","mins":"12:10 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3546","author":"kyle_hill","post":"Well I think that that was a grand characterization. Fundamentalism has absolutely nothing to do with scientific skepticism. It is in fact in opposition to fundamentalism. I think that it is funny that you have pigeon holed me as a fundamentalist; science and skepticism is so clearly feared when it comes into conflict with cherished ideas and stories that it must be just a “new atheist” dogma. But of course this is not the case at all. The person that I have been arguing with (if you have read the discussion) has no concept of argument, evidence, or science (and I think that Dan will support me on this point). The methods and evidence that I “demand” are simply the things that anyone would demand in order to establish some fact of reality. If we were having an argument about what the best type of coffee is, no one would care about my “demands”. But when I ask for the same standard for stories of floods and anecdotal angels, suddenly I have become a fundamentalist or a “bully”. How convenient it must be for people of faith to play this card. If science helps religion, great, if it contradicts it, just ignore the findings, and faith is good enough for us. Religion can speak to the virtues of faith all they want, but if there was actually one iota of scientific evidence for a religious claim, I am absolutely certain that they would jump all over it. Would “non overlapping magisteria” be an issue if we found DNA evidence for Jesus, for example? A reason why religion is wary of science is that it offers nothing to proselytize about. Science in fact contradicts much of the fundamentalism that you have accused me of. But why do I demand such evidence? Why do Annie Cee : athiests demand proof of what is supernatural on their own terms? Maybe, if they’re really interested in knowing what’s behind the countless stories of supernatural experiences, they need to create a different set of criteria than what they use for exploring the Natural world. Atheism doesn’t even have “terms”; don’t confuse science and atheism, they are not identical and do not imply each other. But I demand such evidence because “countless stories” are just that, stories. There is no truly documented case of a supernatural experience that does not have some more plausible, physical explanation. We do not need to “create a different set of criteria” because the criteria that we have works. Science and its method is the most successful set of criteria that humans have ever created to understand their surroundings. Even now I am writing this response only because this criteria has allowed us to understand everything from electromagnetism to quantum mechanics, and without such criteria, we would still be where we are when we are still steeped in ignorance, only with “stories”. Do not let your hope for the supernatural cloud your judgment or motivate your reasoning. Where people see ghosts, science sees a concatenation of psychology, physiology, neurology, physics, and biology. As Carl Sagan said, we are no longer live in a “demon haunted world”. Furthermore, Annie Cee, ask yourself, would a bunch of stories about a bridge being safe sufficiently convince you that you could drive over it? Or would you like some proof, some calculation, some evidence? The “bully” that I’m sure you are perceiving here, is asking no more of you than you would with anything besides religion. Is this exclusion warranted simply because you were born into a faith filled household, or because one ancient book says so? I do not think so. But then again, requiring such evidence that I am asking for, the same kind that you would ask for with any other subject, is surely fundamentalism. It must be so terrible for atheists to come out and have meetings and parades and demonstrations. How offensive that is. Why can’t they just celebrate Christmas with the rest of us? Religious people never subject non believers to persecution or ridicule, what bullies those new atheists are. I suppose the truth always hurts someone..","date":"2011-08-09","mins":"10:33 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3572","author":"kyle_hill","post":"You again made my point exactly. I rest my case..","date":"2011-08-11","mins":"10:02 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3564","author":"kyle_hill","post":"Saying that I ask you many questions and therefore I am engaging in circular reasoning is both logically false and intellectually lazy. I would have preferred an answer to at least one argument. It’s interesting how you also view doubt as such a bad thing. I do not think that questioning has become something to look down upon. Indeed, I have quite the opposite view of your own “religion”, a radical adherence to blind faith. With doubt at least you can learn something, blind faith is an unmovable tome of superstition. The scientific worldview is one consisting mainly of focused doubt, and it has proved pretty useful. I’m not sure why you believe so vehemently (use of all caps) that you do not have any evidence for. I don’t think that you cannot come up with any reason for this belief without presupposing that he exists. This is the definition of circular reasoning, not asking a lot of questions, as you so incorrectly put forward. I’m also glad that you served me up the old argument: “you can’t prove that he doesn’t exist”. The popular response goes something like this: I can’t prove that God does not exist, but neither can I prove that a teapot currently orbiting Mars does not exist. Does this justify my blind belief in the teapot as well? Both the evidence for God and the evidence for the teapot orbiting Mars are equally baseless. You can’t prove that something does not exist, as there may always be some variable or some data to hide from, but that does not logically imply that you should then believe wholeheartedly in it. More perplexing to me is that you think that an inability for me to disprove the existence of a deity means that a white bearded father figure who reads your thoughts lives in the sky. How does this follow? Because one book told you so, and this is not adequate in my view. You can’t disprove the existence of Zeus. That means that he exists in your logical framework. This surely doesn’t make sense to both of us. I am happy that your faith makes you feel good and privileged. I honestly am, I don’t mean any personal attacks or malcontent, I just completely disagree with how you think the universe works. But, I did not mean “privileged” in this way. What I meant by you arguing from a privileged position is that you are very used to acknowledging a Christian majority in this country. Therefore it is easy for you to get all huffy and puffy about “evangelical” atheists. My point was that your view may be different if you were in the minority, in this case, non believers. Put yourself in my shoes, or a Muslim or Hindu’s shoes. If you can do this, I think that suddenly many of your own expressions of religion may be offensive to others, and I think you should remember that. You say that atheists never come to conclusions, and ask a lot of questions (again why is that bad?). But atheism is actually built on one fundamental conclusion: there is no reason to suppose that God exists..","date":"2011-08-10","mins":"10:32 pm","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3566","author":"kyle_hill","post":"I am quite an honest atheist, but it would be hard for me to employ my atheist “tactics” for your comebacks because you have had none. I see not one thing about the world that requires us to suppose a god exists. We have natural reasons for the diversity of life, the origin of the universe, human morality, sightings of angels, hearing voices in your head, feeling a “sense presence”, etc. All of this points to the fact that no ancient god of Middle Eastern tribesmen needs to be inserted to explain the universe. And this is all backed up by evidence, honestly. I think the reason that you are feeling bogged down with questions is because you have provided me with absolutely zero answers. “Changing the subject”, as you call it, seems to be something very different from what I was doing. I present you with a question or argument, you respond, I respond to that response, etc. That is how a discussion works. Getting bogged down is a function of me making arguments that you refuse to address, not me switching the subject. The reason that I present you with my “philosophies” is because I want to hear your answer. I am willing to hear any cogent argument or rebuttal, and will certainly not dismiss it out of hand just because it is religious in connotation (as you seem to think that I will do). You also seem to think that I know little about Christianity. I was born in a Christian household, went to Catholic school for 8 years, attended a private Catholic college, and took extra curricular classes on theology in general and Christianity specifically. I know all about the apologetics and C.S. Lewis, and I am familiar with all the arguments that they present. However, I have found none of them to be satisfactory, as the only arguments that are thought to “prove” God’s existence are philosophical, contradictory, and unfounded in nature. Again, instead of saying for what reason you believe, you are simply taking it for granted, and making arguments that would only make sense to a religious person. The reason I should be a Christian believer is because God wants me to? Do you see how that establishes exactly nothing? But I can see from our previous back and forth that you are not going to answer any of my arguments, and play the “you have to have faith” defense, so if you need me, we can continue this over at Science Based Life (click my name underneath the icon). I will leave you with a quote: “When you understand why you dismiss all other possible gods (Zeus, Thor, Shiva, Vishnu, etc.), you will understand why I dismiss yours.”.","date":"2011-08-11","mins":"12:24 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"},{"id":"comment-3569","author":"kyle_hill","post":"So after all my pleading I get another vacuous response? You sound like a nice woman, but you argue like a little child. But if that’s how Jesus wants you to approach him, I guess it makes sense. The story of your father’s friend is interesting, albeit completely unconvincing. So you know a man who didn’t believe in Christianity and now he does. So what? I knew a man who wanted to become a vegetarian but struggled with the decision, because he found it really, really hard to understand why meat processing works the way it does. He doesn’t have any problems with it now though. He’s convinced, he got his proof. Did that convince you to become a vegetarian? I’m also not sure that you have the slightest clue what the word “proof” means. Surely you don’t mean a mathematical proof, and you consistently refuse to offer any scientific proof, so I guess you are the “proof” that Christians like yourself (but not you Dan, you seem much more intellectually present) are the “I will not answer, here’s some stuff from the Bible instead” type. I find it completely insulting that you consider me in an mental cage just because I do not agree with your blind faith. What I have realized, “trapped in my brain”, is that I am only 22 years old and probably already know more about the way the universe works than you will care to discover in your entire life, with the only reasoning being that you have committed yourself with such radical adherence to a set of doctrines that tell you what to think and what not to doubt. Perhaps you should read some more of Dan’s material. He is a very intelligent and rational Christian, and although we don’t agree on everything, we agree on the basic structure of argument and why evidence matters. This agreement has seemed to have escaped you, so please, if we are to continue this discussion, don’t just hit me with more stuff you have been reciting since Sunday school..","date":"2011-08-11","mins":"2:18 am","url":"https://shroudstory.com/2011/08/08/the-evangelical-new-atheist-movement/","cat":"news_&_views","title":"The Evangelical New Atheist Movement"}]
