[{"id":"comment-40654","author":"david_roemer","post":"The historical Jesus was a Jewish prophet who was crucified by Roman soldiers sometime between 30 and 33 AD. In all probability, Jesus was buried in an identifiable tomb, rather than in a common grave for criminals. This detail is historically significant because of an historical event, the Resurrection, and an artifact, the Shroud of Turin. The Resurrection occurred within a few years of the crucifixion, and can’t be explained in terms of any other historical event because the followers of Jesus founded the Catholic Church. The Catholic Church rose to political power in the 4th century, and produced Western Civilization. When the Catholic Church lost its influence in the 18th century, the wars and genocide of the 19th and 20th centuries followed. The Shroud of Turin is a long piece of linen with a mysterious image of Jesus showing the blood marks from the crucifixion nails, whipping, crown of thorns, and stabbing, as reported in the gospels A heretical Christian sect probably created the image in the 1st or 2nd century with methods that have been lost to history. The faith response to the historical Jesus is to believe that Jesus is alive in a new life with God and that if you follow Jesus the same good thing can happen to you. The historical Jesus includes an accounting of those who believe in Jesus, those who don’t, and those who think believing in life after death is irrational. One of the reasons I believe in Jesus is that those who think faith is irrational tend to be ignorant of the cosmological argument for God’s existence, unintelligent about the mind body problem, and irrational about the meaning of life..","date":"2013-08-07","mins":"11:53 am","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40690","author":"david_roemer","post":"To Yannick, Gnostics venerated Jesus as a wise philosopher, and could very well want something to venerate. I think you are confusing faith with reason. In reason, we know something is true because we can see the truth of it. In faith, we know something is true because God is telling us. Faith is both a decision and a gift from God. We believe exactly what God wants us to believe. It is irrational to criticize someone who says, “God hasn’t given me the gift of faith.” Such a person is admitting that God exists, that they don’t have a meaningful life, and that the reasons to believe are persuasive. When you say the Drews’s theory is “ludicrous,” you are in effect saying people who don’t believe in Jesus have bad judgment. How do you know you are not the one with bad judgment?.","date":"2013-08-07","mins":"4:02 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40752","author":"david_roemer","post":"To Yannick, The idea that you are explaining anything by believing that Jesus is alive in a new life with God is a mistake. It is an act of faith. It is both a decision and a gift from God. You have listed all of the reasons there are to believe. The use of the word “explain” implies that people who don’t believe have bad judgment. As I have said, most people who don’t believe fail at the level of intelligence, not the level of reflective judgment. If people who did not believe discussed religion intelligently, rationally, and honestly, it would be an obstacle to faith..","date":"2013-08-08","mins":"12:27 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40783","author":"david_roemer","post":"Yannick Clément : Additional comment: I don’t demand that people believe in Jesus Christ but if a non believer in Jesus wants to talk seriously and honestly about the story of the Resurrection of Christ, he MUST find a rational explanation for sudden disappearance of the corpse You are demanding that everyone believe Jesus is alive because you are threatening to call them irrational if they don’t. The best theory of the Holy Shroud is that it was created by Gnostics in the 1st or 2nd century. This is the theory with the most evidence. It shows bad judgment to think the Shroud is authentic. However, it does not show bad judgment to not believe Jesus is alive. It just shows that the non believer does not have the gift of faith. There are many reasons to believe in Jesus. One of them is the mysteriousness of the Shroud. Insisting that the Shroud is authentic not a good way of preaching the gospel to people who don’t believe. All you are doing is persuading yourself and other believers..","date":"2013-08-08","mins":"10:09 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40817","author":"david_roemer","post":"Asking someone to give a “rational reason” for their lack of faith is the same as calling someone irrational. I don’t do this. I give people my reasons for believing and summon, not demand, them to believe. I have no criticism of the judgment of people who say, “God hasn’t given me the gift of faith.”.","date":"2013-08-09","mins":"8:44 am","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40827","author":"david_roemer","post":"Yannick Clément : I think that it’s normal to ask someone who don’t believe in the Resurrection to explain us why he don’t believe it and how can he explain the historical event of the empty tomb (and the empty shroud). It is perfectly reasonable to ask someone why they don’t believe in Jesus. They may give a bad reason and you can correct them. They may say God doesn’t exist and you can explain why God does exist. It is not reasonable to ask someone to explain the historical Jesus. It shows a lack of understanding of the word “explain.” Humans ask questions and intelligent humans invent answers to these questions. Humans then marshal evidence and decide whether an answer is true or just probable. This requires being rational. An explanation is an answer to a question that is supported by the evidence. That Jesus is alive in a new life with God does not explain the historical Jesus. It is a faith response to the all of the reasons for believing in Jesus. The historical Jesus is just one of the reasons. Another reason is that people who don’t believe tend to give bad reasons. Faith is a gift from God. We can’t see the truth of the proposition that Jesus is alive. We know it is true because God is telling us..","date":"2013-08-09","mins":"11:17 am","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40682","author":"david_roemer","post":"Whenever you see an image, it was created by a human being. There is no evidence that God created the image on the Shroud. It was Gnostics that may have made the Shroud. (In Search of the Shroud of Turin: New Light on Its History and Origins by Robert Drews).","date":"2013-08-07","mins":"3:21 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40717","author":"david_roemer","post":"To Albert Bodt: The Resurrection is both an historical event and an object of faith. As an event, it refers to the fact that the followers of Jesus swore up and down that he appeared to them. This is sometimes referred to as the Easter experience. Marcus Borg and John Dominic Crossans, who believe life ends in the grave, traced the Resurrection to within a few years of his crucifixion. The connection between the so called Enlightenment and the horrors of the 19th and 20th century is that when people lose their faith in God, they become prone to irrational beliefs: nationalism, eugenics, anti semitism, racism, imperialism, socialism, communism, Nazism. Atheists don’t even understand the theory that humans are embodied spirits. All they understand in materialism and dualism. They have a blindspot about the mind body problem. Atheists also don’t know or understand that humans are finite beings and God is an infinite being. Atheists are irrational about the meaning of life, with the exception of Jean Paul Sartre. Sartre said the “man is a useless passion.”.","date":"2013-08-07","mins":"9:28 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-55635","author":"david_roemer","post":"According to the New American Bible, Revised Edition, 2011: “When you come, bring the cloak I left with Carpus in Troas, the papyrus rolls, and especially the parchments.” This strikes me as being a disrespectful way of referring to the Holy Shroud. I’m working on a review of a book, written by an atheist, which argues that the Holy Shroud is authentic (Thomas de Wesselow, The Sign: The Shroud of Turin and the Birth of Christianity) in order to prove that life ends in the grave. The author was dissatisfied with the theories that explained the rise of the Catholic Church, and got a bright idea. His thesis is that 1st century people were more driven by anthropomorphism and animism than they are today. When they saw the Holy Shroud, they assumed that Jesus was alive. This explains 1) the renewed fellowship of Jesus’ disciples after the crucifixion, 2) Paul’s conversion, 3) why Jesus came to be called the Messiah/Christ , 4) Sunday became a day of worship, and 5) the emphasis on the Jewish belief in the resurrection of the dead..","date":"2013-12-03","mins":"8:38 am","url":"https://shroudstory.com/2013/12/03/translation-when-you-come-bring-the-shroud-of-turin/","cat":"history","title":"Translation: When you come, bring the Shroud of Turin"},{"id":"comment-21019","author":"david_roemer","post":"I question Dave of New Zealand’s implication that progressives in the modernist controversy in the Catholic church were promoting “reductionist liberalism.” The primary doctrine of Christianity is that Jesus is alive in a new life with God and if you follow Jesus the same good thing can happen to you. The doctrines about the incarnation, trinity, virgin birth, and papal infallibility are secondary matters. I think the disagreements between progressive and conservatives was over tertiary matters. Liberal Christians do not believe in life after death. They think that life ends in the grave, and we are better off knowing this so we can concentrate on achieving self realization and serving our fellow human beings. The resurrection of Jesus is an historical event that can’t be explained in terms of any other historical event. The best explanation for the Shroud of Turin, in my opinion, is that it was generated by Gnostics in the 1st or 2nd century using a crucified victim and methods that have been lost to history. The Holy Shroud and the Resurrection are two separate reasons to believe in Jesus. Chevalier and Thurston may not have understood the miraculous nature of the Holy Shroud and were ignoring that fact that it is a reason to believe in Jesus. Advocates of the authenticity of the Shroud are confusing the resurrection of Jesus as an historical event and the resurrection of Jesus as an object of faith..","date":"2012-12-23","mins":"11:48 am","url":"https://shroudstory.com/2012/12/23/paper-chase-the-conspiracy-against-the-shroud/","cat":"history","title":"Paper Chase:  The Conspiracy Against the Shroud"},{"id":"comment-24112","author":"david_roemer","post":"On November 19, 2012, I sent a registered letter to Archbishop Salvatore Fisichella of the Pontifical Council for Promoting New Evangelization criticizing the Catholic Church in the U. S. For suppressing my slideshow/lecture about the Holy Shroud because I don’t promote the theory that the Holy Shroud is authentic. I have not yet gotten a response. It looks like I’ll have to complain to the new pope..","date":"2013-02-13","mins":"1:08 am","url":"https://shroudstory.com/2013/02/12/what-we-want-to-see-from-the-new-pope-regarding-the-shroud-of-turin/","cat":"history","title":"What we want to see from the new pope regarding the Shroud of Turin"},{"id":"comment-40764","author":"david_roemer","post":"Yannick Clément : Quote from David’s comment: “The use of the word “explain” implies that people who don’t believe have bad judgment.” That’s not what I meant. I was simply meaning that because the empty tomb and the empty burial cloths are a true historical event, those who don’t believe the claim of Jesus’ disciples must rationally explain this sudden disappearance of the corpse from inside the Shroud and from inside the tomb in the light of what we know about the rapid expansion of Christianism throughout the Roman empire during the first century A.D. This is what we disagree about. I think I understand what you are saying. No one has to explain the Easter experience. All anyone has to say is that God has not given me the gift of faith. You are demanding that people believe in Jesus. I am summoning people to believe by telling them my reasons for believing. You believe in miracles, and I believe in signs. I don’t care whether the tomb was empty or the Holy Shroud is authentic. All that is relevant is that there is no explanation for the image on the Shroud. It is a sign whether or not it actually touched Jesus..","date":"2013-08-08","mins":"3:31 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."}]
