[{"id":"comment-23340","author":"david_roemer","post":"Daveb: I don’t think Stephen Hawking said such a thing. There is a quote from him about the Big Bang on my video “The Truth About Evolution and Religion” (http://www.youtube.com/watch?v=q Ka F8v X6 HXQ).","date":"2013-02-03","mins":"5:15 pm","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-23324","author":"david_roemer","post":"It is explicit in John: “In the beginning was the word, and the word was with God…” The word was the concept of the universe in God’s mind..","date":"2013-02-03","mins":"2:42 pm","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-23350","author":"david_roemer","post":"The theory of the big bang was proven in the 1960s with the discovery of the radiation emitted when hydrogen atoms were formed. This happened 500,000 years after the big bang..","date":"2013-02-03","mins":"7:06 pm","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-23307","author":"david_roemer","post":"I have invented an intelligence test for religion: What are four solutions to the mind body problem and four answers to the question of what caused the universe to begin 13 billion years ago? I give myself an IQ of 100. I give myself 20 points for understanding the mind body problem and 10 points each for the eight answers. The four solutions to the mind body problem are the following: 1) Cartesian dualism, 2) materialism, 3) idealism, and 4) it is a mystery. Number 4 means that humans are embodied spirits and is the solution with the most evidence. There is more evidence for idealism than for dualism and materialism because we can’t imagine that we don’t exist. But we can imagine that our bodies are illusions. The four answers to what caused the big bang are 1) God did it. 2) An angel did it. 3) The universe is not intelligible. 4) The scientific method will eventually give us an answer. There is no evidence for # 1, but more for # 2 since an angel would have a motive for doing such a thing. The answer judged to be true by rational people is # 4..","date":"2013-02-03","mins":"8:47 am","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-23300","author":"david_roemer","post":"Intelligence is usually a measure of how fast or slow it takes someone to grasp a theory or insight. In the case of religion, however, there is so much anxiety that people are inhibited from thinking intelligently. They have blinds spots. Saying that someone you disagree with is stupid is not abusive or ad hominem because it may be true..","date":"2013-02-03","mins":"7:47 am","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-23317","author":"david_roemer","post":"We know God exists because we have free will and because the universe is intelligible. The evidence that the universe is intelligible is the success of science. The Big Bang is evidence that God does not exist because it is something coming into existence without a cause. Atheists are irrational about the meaning of life, ignorant of the cosmological argument for God’s existence, and unintelligent about the mind body problem..","date":"2013-02-03","mins":"1:13 pm","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-23314","author":"david_roemer","post":"Metaphysics leads logically to the existence of an infinite being, called God in Western religions, which created the universe of finite beings. What motivated God to create finite beings was self love. God loves Himself as giving. But God could just as easily love H Imself without giving. Hence, the existence of finite beings is a mystery. In other words, the existence of an infinite being doesn’t even explain the existence of finite beings, let alone the phenomena of the Big Bang. The Big Bang, however, is evidence that God inspired the human authors of the Bible because the Bible says God created the universe from nothing. Atheism is a neurotic response to religion. There is no such thing as a rational atheist. This is evidence that there is life after death..","date":"2013-02-03","mins":"11:27 am","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-51437","author":"david_roemer","post":"This is the roll the Holy Shroud plays in my belief that our purpose in life is to serve God in this world to be with Him in the next: 1) Jewish Prophet Jesus was a Jewish prophet who had a band of intimate followers. After being crucified, his followers disbanded in fear and disappointment. Soon after, they renewed their fellowship and began to preach that Jesus is alive in a new life with God. His followers swore up and down that Jesus appeared to them after he died. His followers went on to found the Catholic Church, which gave us Western civilization. When the Church lost its influence in the 18th century, the horrors of the 19th and 20th century followed. 2) Proof of God’s Existence Jewish people are unique because the Hebrew Bible was the first book of narrative history. Also, they gave God the name “Yahweh,” which can be translated “I am who am.” This name was explained in the 13th century by Thomas Aquinas and is consistent with the cosmological argument for God’s existence. Most non believers don’t understand the cosmological argument. They think, for example, that human beings are collections of molecules, rather than embodied spirits. They disingenuously ask, “Who made God”? 3) Shroud of Turin According to the gospels, Jesus was buried in a separate tomb with a linen burial cloth. Also, the Resurrection occurred three days after the crucifixion and produced an empty tomb. The gospels also say that Jesus was beaten, made to wear a “crown of thorns,” and stabbed in the side while on the cross. The Shroud of Turin, which is currently owned by the Catholic Church, tells the same story with a mysterious life size image of a crucifixion victim on the 14 foot long piece of cloth. Many non believers admit that a crucified victim was used to create the image, but there is no explanation of how the image was created. 4) The Big Bang There are many other relevant historical facts. For example, in the 1960s it was determined that the universe began to exist 13.7 billion years ago. This is another sign that the Bible was inspired by God because the Bible says God created the universe from nothing..","date":"2013-11-15","mins":"9:17 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-42402","author":"david_roemer","post":"My understanding is that there are two kinds of knowledge: faith and reason. In reason, we know something is true because we can see the truth of it (e.g., the sine of 22 degrees is what math books say it is). In faith, we know something is true because God is telling us (e.g. Jesus is alive in a new life with God). The Resurrection is both an historical event and an object of faith. Faith is both a decision and a gift from God. It is wrong to criticize the judgment of people who do not believe in Jesus or life after death. We can summon people to believe, but we should not demand it. We should accept the response: I can’t see the truth of it. Another good response is: God has not given me the gift of faith. I believe in Jesus for a large number of reasons. It is the entire story that is persuasive. The Resurrection is one bit of data. The Holy Shroud is another. When I give my reasons it is accompanied by a summons to believe, not a demand. To say that Jesus being alive “explains” the Resurrection and Holy Shroud implies that people who don’t believe have bad judgment..","date":"2013-08-30","mins":"9:52 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-5178","author":"david_roemer","post":"God is a supernatural being because God exists and is above nature. God also created the universe of finite beings. He inspired the human authors of the Bible to tell us about life after death. The Bible, especially the beginning of John, says that God created the universe from nothing. The discovery that the universe began to exist 14 billion years ago is a reason to believe in the Bible. The discovery that the universe began 14 billion years ago raises another question: What caused this to happen? There are four possible answers: 1) God did it. 2) An evil angel did it. (This is the belief of Gnostics.) 3) The universe is not intelligible. 4) Science will discover why with further applications of the scientific method. If the universe is not intelligible, then we can’t be sure God exists. No. 1 and No. 2 is equivalent to saying there are mysteries in science. The central mystery that atheists cannot grasp is: What is a human being? You don’t help atheists to understand this by bringing up mysteries in science. Atheists don’t see the difference between the questions: What caused the Big Bang? and What is a human being? To atheists, these are both mysteries that will be solved by the scientific method. The important thing is to grasp the difference between the two types of question..","date":"2011-12-02","mins":"8:15 pm","url":"https://shroudstory.com/2011/12/02/was-the-shroud-of-turin-created-by-gnostics-continued/","cat":"image_theory","title":"Was the Shroud of Turin created by Gnostics? (Continued)"},{"id":"comment-5175","author":"david_roemer","post":"The question is what theory is most probable, not which one is compelling. The Shroud is unlikely to be the burial cloth of Jesus because 1) The blood marks are not smeared. 2) The image is highly detailed, as with a photograph or a painting. 3) The cloth is narrow and long and could serve no other purpose than to create a double image. 4) It assumes that the discovery of the empty tomb of Jesus is an historical event. The empty tomb story is just one tradition in the Gospels. There are other sources of the historical fact that the followers of Jesus swore up and down that He appeared to them after He died..","date":"2011-12-02","mins":"5:03 pm","url":"https://shroudstory.com/2011/12/02/was-the-shroud-of-turin-created-by-gnostics-continued/","cat":"image_theory","title":"Was the Shroud of Turin created by Gnostics? (Continued)"},{"id":"comment-5305","author":"david_roemer","post":"The question you are characterizing as important is not important. The Holy Shroud is a relic and should be honored. But it is not the cloth itself that is being venerated but, like all relics, the man the relic represents. To raise questions about the authenticity of the Holy Shroud is like asking how many angels can dance on the head of a pin. It is a good question, but it should not be discussed in front of people who don’t think angels exists. “Give not that which is holy to dogs; neither cast ye your pearls before swine….” (Mathew 7:6).","date":"2011-12-07","mins":"10:04 am","url":"https://shroudstory.com/2011/12/07/why-do-we-think-it-is-an-image-of-jesus-on-the-shroud-of-turin/","cat":"image_theory","title":"Why do we think it is an image of Jesus on the Shroud of Turin?"}]
