[{"id":"comment-78398","author":"david_roemer","post":"The Shroud is a reason to believe in Jesus because there is no scientific explanation of how the image was created. The Resurrection of Jesus is a reason to believe because there is no historical explanation for it..","date":"2014-02-11","mins":"4:36 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78304","author":"david_roemer","post":"The following quote from Karen Horney sheds light on why people can be unintelligent, irrational, and dishonest about religion: “Let us consider for example, a person listening to a paper and having critical thoughts about it. A minor inhibition would consist in a timidity about expressing the criticism; a strong inhibition would prevent him from organizing his thoughts, with the result that they would occur to him only after the discussion was over, or the next morning. But the inhibition may go so far as not to permit the critical thoughts to come up at all, and in this case, assuming that he really feels critical, he will be inclined to accept blindly what has been said or even to admire it; and he will be quite unaware of having any inhibitions. In other words, if an inhibition goes so far as to check wished or impulses there can be no awareness of its existence.” (The Neurotic Personality of Our Time, Karen Horney, M.D., New York: Norton, 1937, p. 55 ).","date":"2014-02-11","mins":"9:08 am","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78413","author":"david_roemer","post":"Faith is both a decision and a gift from God. If we figure out how the Gnostics created the Holy Shroud, that will be one less reason to believe in life after death. An important reason for believing is that those who don’t believe give bad reasons for not believing..","date":"2014-02-11","mins":"5:14 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78521","author":"david_roemer","post":"“Casting you pearls before swine” means being judicious in the presentation of your beliefs. If you think the Shroud is authentic you should keep it to yourself. Any rational person examining the image will conclude is it was created by an artist or craftsman. Believing the Shroud is authentic is some kind of faith response to the Resurrection..","date":"2014-02-11","mins":"11:17 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78445","author":"david_roemer","post":"Dear Kelly, That is exactly what I am saying. If we can figure out how the Shroud was made it will become nothing more than an inspirational statue. The point is that we can’t figure out how it was made. It is for the time being a sign, or a reason to believe in life after death. People who advocate the authenticity of the Shroud destroy this sign by linking it with another sign: the Resurrection of Jesus. To Shroudies there is one miracle: The Resurrection. To me there are two miracles: The Resurrection and the Shroud..","date":"2014-02-11","mins":"7:32 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78534","author":"david_roemer","post":"The atheists (Locken and de Wesselow) were attempting to give an historical explanation for the Resurrection of Jesus. Their desire to persuade people not to believe in God clouded their judgment. They stated that there was a natural explanation for the image. There is no historical explanation for the Resurrection. However, there is a scientific explanation for the Shroud: it was created by artisans or artists. You should not say the Shroud is authentic because it means you think the image was formed supernaturally..","date":"2014-02-12","mins":"12:06 am","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78553","author":"david_roemer","post":"1) The Shroud is holy because it is an official relic. The Catholic Church grants indulgences to people who pray before the Shroud. 2) It is a reason to believe in Jesus because there is no explanation for how the image was created. 3) The Shroud may be a fake because it was created by Gnostics, and Gnostics may have told people it was the burial shroud of Jesus. 4) It is a work of art because the blood stains are not smeared and because the image is so detailed. Which statement don’t you understand?.","date":"2014-02-12","mins":"1:42 am","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78342","author":"david_roemer","post":"Relics are sacramentals and help you avoid sin by giving you grace if you venerate them. The Holy Shroud is an official relic of the Catholic Church and you get indulgences by praying before it. What bolsters faith are signs or reasons to believe in revelation..","date":"2014-02-11","mins":"12:51 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78750","author":"david_roemer","post":"The reason to believe in Jesus is that there is no explanation of how the Gnostics created the image. What difference does it make whether the image was created miraculously in the tomb or miraculously by Gnostics? You destroy the apologetic value of the artifact by linking it to the Resurrection. You have only one miracle to tell about, but I have two..","date":"2014-02-12","mins":"2:46 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-78658","author":"david_roemer","post":"To Mike and Paulette: 1) Perhaps the Gnostics created the Shroud to tell the story of Jesus’ passion, and told people it was a fabrication. In this case it would be both holy and not a fake. 2) I am giving my reasons for believing in Jesus. I am summoning you to believe, but am not demanding it. I am not arguing that Jesus is alive. The difference between arguing and summoning is the difference between faith and reason. It is a matter of reason that God exists. It is a matter of faith that He has communicated Himself to us. 3) Who else but a Gnostic would crucify someone to get a relic? 4) We see the image and ask, “How was it created?” We invent the theory, “It was done by an artist.” We marshal the evidence: 1) All known images are created by humans. 2) The blood stains are not smeared. The Resurrection of Jesus is an historical event. It does not have any “by product.” The historical event was the renewed fellowship of His disciples after He was crucified, the belief that He was the Messiah, the emphasis on the Jewish belief in life after death, the beginning of worship on Sunday, the appearances of Jesus to Paul and others..","date":"2014-02-12","mins":"9:27 am","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-146824","author":"david_roemer","post":"You just send a registered letter to the pope and cite the Cannon Law that is being violated. An example is here: http://www.fatima.org/apostolate/complaint.asp. The law I mentioned to Cardinal Dolan was Canon 279 §3: “acquire knowledge of other sciences, especially of those which are connected with the sacred sciences….” We don’t know what reasons the IEEE gave the Italy Section for withdrawing its sponsorship..","date":"2014-08-28","mins":"1:06 pm","url":"https://shroudstory.com/2014/08/28/breaking-news-on-the-bari-conference/","cat":"news_&_views","title":"Breaking News on the Bari Conference"},{"id":"comment-146805","author":"david_roemer","post":"A few days ago, I sent a letter to Cardinal Dolan saying that if the conflict between us about the authenticity of the Holy Shroud is not resolved, I would file a canonical complaint against him with the Holy Father. Only a pope can take action against a cardinal..","date":"2014-08-28","mins":"11:03 am","url":"https://shroudstory.com/2014/08/28/breaking-news-on-the-bari-conference/","cat":"news_&_views","title":"Breaking News on the Bari Conference"},{"id":"comment-78747","author":"david_roemer","post":"There is nothing confusing or contradictory about the following two statements: 1) The Resurrection is an historical event with no historical explanation. 2) The Resurrection is the renewed fellowship of Jesus’ followers. Proposition #2 is not an explanation, it just states what the historical event was..","date":"2014-02-12","mins":"2:38 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-52707","author":"david_roemer","post":"There are two kinds of knowledge: faith and reason. With reason, we know something is true because we can see the truth of it. With faith, we know something is true because God is telling us. The existence of God is a matter of reason, not faith. That there is life after death is a matter of faith. My reasons for making an act of faith are: 1) That Jesus was a Jewish prophet. 2) The Resurrection of Jesus. 3) The passion of Jesus as told by the synoptic gospels and the Holy Shroud..","date":"2013-11-24","mins":"4:57 pm","url":"https://shroudstory.com/2013/11/24/common-ground-between-believers-and-atheists/","cat":"uncategorized","title":"Common ground between believers and atheists"},{"id":"comment-138736","author":"david_roemer","post":"“The fact that the TS has been conserved up to now could either imply that it is a fake that goes far back in time or it is the true linen in which the corpse of Jesus Christ was wrapped. Provided the second hypothesis, corroborated up to now by stockpiled evidence, is assumed, then the resurrection of Jesus Christ could tacitly be understood, because if it didn’t the TS would have been destroyed in the brief course of the corpse corruption.” My paper says that the TS is a fake because that explains how the image got there. The reviewer is saying there is a “stockpile” of evidence for authenticity. This is pseudoscience because there is no evidence for authenticity. The reviewer then goes on to assume that the TS is authentic and indicates that this is evidence for the “resurrection of Jesus” because the TS was not destroyed. It is obvious to me that the reviewer is practicing pseudoscience to promote belief in life after death. This is the same thing that advocates of intelligent design (ID) do. I did not check, but I will bet that there are no papers in the IEEE Xplore Digital Library about ID. “Roughly but bluntly speaking again, what caused the Big Bang, as well as taking a philosophical hike on derived issues, is not concern of this forum unless the investigation is, hypothetically speaking, so revised as to resolutely point, here and now, toward substantial, mature, convincing arguments focused on tentatively proving whether the TS is a fake or not. Since this is not realistically happening with reference to the paper under examination, then it is to be rejected without a second thought.” My paper fits into one of the “aspects” listed in the request for papers: image formation, image processing, dating, textile’s manufacturing, physicochemical aspects, forensic medicine, archaeology, history, philosophy, iconography..","date":"2014-07-16","mins":"11:48 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-146835","author":"david_roemer","post":"This is the list of the topics on the conference invitation for papers: image formation image processing dating textile’s manufacturing physicochemical aspects forensic medicine archaeology history philosophy iconography.","date":"2014-08-28","mins":"1:53 pm","url":"https://shroudstory.com/2014/08/28/breaking-news-on-the-bari-conference/","cat":"news_&_views","title":"Breaking News on the Bari Conference"},{"id":"comment-138765","author":"david_roemer","post":"The conflict between me and Hugh Farey is the same conflict that arises between advocates of the theory of intelligent design and mainstream biologists. One side says there is evidence for ID, and the other side says there is not. I am on the side of mainstream biologist. There is no evidence for ID, and ID advocates are being irrational. ID advocates are also failing at the level of intelligence. What ID advocates consider to be evidence is actually evidence that the universe is not intelligible. Religion causes so much anxiety that people are inhibited from thinking intelligently and rationally. All the evidence people think supports the authenticity of the Shroud, just supports the fact that it was created in the 1st century. There is no evidence for authenticity because detailed images, not outlines, always are created by humans. The atheists I named say the Shroud is authentic to explain away the Resurrection of Jesus, and Christians say the Shroud is authentic because they are weak in fundamental theology..","date":"2014-07-16","mins":"3:39 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-138785","author":"david_roemer","post":"You prove a proposition is true when you advance so much evidence that you can say honestly someone who disagrees has bad judgment. This is the evidence that the Shroud is a fake: All detailed images that exist were created by humans. If you don’t change your mind and agree with me, I will tell the IEEE that you have poor judgment and should not be reviewing any papers about the Shroud..","date":"2014-07-16","mins":"5:20 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-138788","author":"david_roemer","post":"The blind spot that atheists have is that they don’t understand the mind body problem. There are four solutions to the mind body problem: dualism, materialism, idealism, and it is a mystery. . . . [Balance of comment deleted. It is simply an unrelated litany of insults.].","date":"2014-07-16","mins":"5:34 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-138668","author":"david_roemer","post":"This is the review. If Dario Petrie doesn’t repudiate it, it will make the Italy Section of the IEEE look like idiots: Let’s bring to the heart of the problem regarding the quality of the submitted paper: all aspects of the TS invariably calls into question the person of Jesus Christ. The fact that the TS has been conserved up to now could either imply that it is a fake that goes far back in time or it is the true linen in which the corpse of Jesus Christ was wrapped. Provided the second hypothesis, corroborated up to now by stockpiled evidence, is assumed, then the resurrection of Jesus Christ could tacitly be understood, because if it didn’t the TS would have been destroyed in the brief course of the corpse corruption. Of course, this is only an example of reasoning. Note that even the scientific thinking advances, as the case may be, involving educated guesses, with all due respect to those which turn off immediately with apodictic – paradoxically non scientific – pose when the above mentioned guesses apply, say, to the Shroud. What exactly regards Jesus Christ as Son of God, namely His identification with the risen Lord, invariably needs to be referred to His incarnation. This applies to any investigation, irrespective of whether the investigator is a worshipper or not. Contrary to a stagnant gnosis, there is a general consensus on regarding incarnation even from some attainable, practical aspects. This is the case when attention is paid to the available attestations of personally or collectively tangible, palpable, detectable, intelligible experiences, as well as purely terrestrial events and circumstances. As a consequence, any sagacious investigator that deals with this sensitive topic prefers not to get the still unresolved, vague – to the point of boredom! , misleading problem, say, of the Big Bang in place! The resurrection and what revolves around this crucial event – this is the case for the Turin Shroud – has nothing to do, let’s say with different words, with the “Chief World Systems” and cannot give someone room to slightest hints, sterile and pointless appraisals, as well as pseudo philosophical lucubration to any large extent. What is conclusively demanded is that the author might be prone to appropriately propose any starting conjecture, at will, before working out a self consistent view of the matter; if not, the approach runs the risk to be a waste of time. Unfortunately, this is the case for the paper at hand. Roughly but bluntly speaking again, what caused the Big Bang, as well as taking a philosophical hike on derived issues, is not concern of this forum unless the investigation is, hypothetically speaking, so revised as to resolutely point, here and now, toward substantial, mature, convincing arguments focused on tentatively proving whether the TS is a fake or not. Since this is not realistically happening with reference to the paper under examination, then it is to be rejected without a second thought. Supportive of the above detrimental judgement are the following specific details: – there is a broad and valuable consensus in supporting the existence of God exactly through the Big Bang theory! This should have been adequately considered in the submitted paper, whatever the author’s persuasion; – the author seems to get theology and religions history mixed up..","date":"2014-07-16","mins":"5:29 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-138792","author":"david_roemer","post":"This is news to me. “Detailed” means there is shading. There are images of fish that are not just outlines of their bones?.","date":"2014-07-16","mins":"5:48 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-139062","author":"david_roemer","post":"When animals have nothing to do they go to sleep. Only humans ask questions, and just because they ask questions doesn’t mean there is an answer. The Big Bang is evidence that the universe is not intelligible, as I said in my paper and proved with a calculation..","date":"2014-07-18","mins":"12:12 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-78485","author":"david_roemer","post":"Kelly: There is no B side. If there was any hope of explaining scientifically the image the two atheists who wrote books arguing that the Shroud was authentic would have said so. They completely ignored the question of how the image was created..","date":"2014-02-11","mins":"9:35 pm","url":"https://shroudstory.com/2014/02/11/are-we-being-honest-with-ourselves/","cat":"news_&_views","title":"Are We  Being Honest With Ourselves?"},{"id":"comment-139021","author":"david_roemer","post":"@Hugh My 2014 ATSI paper and slideshow explain why the Shroud is not authentic and why God did not cause the Big Bang. I can’t think of any way to make it clearer. If Cardinal Dolan had accepted my invitation to present my analysis to an educated group of Catholics, the give and take of a discussion might have helped me and/or those people who say the Shroud is authentic and God caused the Big Bang..","date":"2014-07-17","mins":"7:40 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-139173","author":"david_roemer","post":"The Big Bang makes intelligible the expanding universe. However, it is evidence that the universe is not intelligible. How can we possible understand how a singularity produced 100 billion galaxies? The Big Bang is evidence that God does not exist. We know God exists because we hope or assume the universe is intelligible..","date":"2014-07-18","mins":"2:33 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-138577","author":"david_roemer","post":"Just to keep the record straight, the reviewer rejected my paper because it said the Shroud is not authentic. I’v told Dario Petrie that I would not pursue my complaint against the conference with the IEEE if the reviewer’s comments were repudiated by the conference organizers. If you read my paper between the lines, you will see that I indirectly referred to the Resurrection of Jesus by discussing the exorcisms of Jesus. They are both historical events and it makes no sense to ask if Jesus really cured people or if Jesus really rose from the dead. It is, of course, reasonable to ask whether or not Jesus is alive in a new life with God. I believe He is alive for five reasons: 1) The cosmological argument for God’s existence. 2) The Resurrection of Jesus. 3) The Shroud of Turin. 4) Jesus saved mankind for meaning. 5) people who think life ends in the grave with one exception I know of (Jean Paul Sartre) don’t discuss the matter rationally, intelligently, and knowledgeably..","date":"2014-07-15","mins":"7:17 pm","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-138694","author":"david_roemer","post":"You have my permission to publish the pdf file a gave you titled ATSI 2014.pdf..","date":"2014-07-16","mins":"7:19 am","url":"https://shroudstory.com/2014/07/15/david-roemers-rejected-paper/","cat":"news_&_views","title":"David Roemer’s Rejected Paper"},{"id":"comment-28041","author":"david_roemer","post":"Religion causes conflict between people, conflict causes anxiety, and inhibition is a defense mechanism against anxiety. People are inhibited from thinking rationally and have blind spots about religious matters. An example of a blind spot is the two solutions offered for the following thought experiment due to John Leslie. Suppose a man is shot at by a firing squad consisting of many good shooters each firing many rounds and the victim is not hit by a single bullet. According to many ordinarily intelligent people, there are two theories that explain this: chance and design. This is a fallacy because there is another theory: The bullets disappeared into thin air, or the universe is not intelligible..","date":"2013-03-22","mins":"7:56 am","url":"https://shroudstory.com/2013/03/22/of-hunches-and-intuition-neuroscience-and-the-shroud-of-turin/","cat":"news_&_views","title":"Of Hunches and Intuition:  Neuroscience and the Shroud of Turin"},{"id":"comment-80972","author":"david_roemer","post":"Talking about science and religion, Jerry Coyne, a fanatical atheist, has a picture of the Holy Shroud on his blog today with comments about the earthquake theory. The proof that Jerry is a nut job is that he quoted my short treatise on biological evolution in full and ridiculed it. I can lawfully teach biology in New York State if no biology teacher is available, so I speak with more authority about evolution than Jerry Coyne who is only a professor of biology at Chicago U. This is the blog: http://whyevolutionistrue.wordpress.com/2013/11/20/nc state student admits that his antievolution diatribe was a satire but a real creationist appears/.","date":"2014-02-20","mins":"5:08 pm","url":"https://shroudstory.com/2014/02/20/mixing-believers-scientists-and-many-who-are-both/","cat":"science_and_religion","title":"Mixing Believers, Scientists and Many Who Are Both."},{"id":"comment-19734","author":"david_roemer","post":"I submitted the following comment to Huff about this article: An example of how physicists are biased and irrational about thermodynamics is the view of most physicists, published in many peer reviewed articles and scholarly works, that biological evolution does not violate the second law of thermodynamics. The second law of thermodynamics states that a gas will fill up the entire container it is in. This is a matter of common sense, more than a law of physics. However, this law does not apply to the evolution of stars because the law only applies to non interacting particles. For the same reason, it does not apply to evolution because a living organism is not a collection of non interacting particles. So, it is just as incorrect to say that evolution violates the second law as to say it does not. But there is a connection between evolution and statistical mechanics. Physicists calculate the number of ways there are to arrange N different objects: N times N 1 time N 2 times N 3 etc. Etc. Evolutionary biologists calculate the number of ways of creating a 600 amino acid protein using the 20 amino acids: 20 to the 600th power. This is the source of the misinformation that evolution violates the second law of thermodynamics. The American Journal of Physics published an article titled “Entropy and evolution” (Vol. 76, No. 11, Nov. 2008) with an absurd equation proving that evolution does not violate the second law because of the sun. The idea is that the second law only applies to isolated systems and evolution did not occur in an isolated system. This is absurd because the sun heats things up and causes disorder not order. The equation is absurd because it uses the Boltzmann constant to calculate the entropy of the biosphere..","date":"2012-12-02","mins":"11:24 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-19788","author":"david_roemer","post":"I broke down my explanation of why the American Journal of Physics article is absurd into eight steps: 1) Natural selection explains why giraffes have long necks, but not how bacteria evolved into giraffes in only 3.5 billion years. Evolutionary biologists always speak of adaptive evolution. The old model for evolution was a tornado hitting a junkyard and producing a Boeing 747 in flight. The new model is a computer generating a Shakespearean sonnet by the random selection of letters. 2) Thermodynamics and statistical mechanics are connected branches of physics. The key variable in thermodynamics is temperature, which is the sensation of hot and cold. It is measured with a thermometer in units called degrees. The second law of thermodynamics states that a gas will fill up the entire container it is in. The second law does not apply to the evolution of stars or biological evolution. 3) Statistical mechanics is related to thermodynamics. For example, the average kinetic energy of a gas molecule is directly proportional to the temperature of the gas. The constant of proportionality is the Boltzmann constant and is a decimal with 23 zeros. 4) There is a very loose connection between evolutionary biology and statistical mechanics. In statistical mechanics, physicists calculate the number of ways of arranging N objects: N X (N 1) X (N 2)…. Biologists calculate the number of proteins that can be formed with N amino acids: 20 to the Nth power. 5) Because of #4, some non physicists mistakenly say that evolution violates the second law of thermodynamics. 6) Many scholarly works erroneously try to refute # 5 by giving an expanded explanation of the second law. They incorrectly describe the second law as stating that nature goes from order to disorder, thus supporting the idea the evolution violates the second law. But they point out that this principle only applies to closed systems. Since the biosphere was bathed in sunlight, the biosphere is not a closed system. 7) The idea that evolution does not violate the second law because of the sun is absurd because the photons from the sun tend to cause disorder not order. 8) The AJP article is even more absurd than this. It writes down a fake equation connecting the statistical concept of the “thermodynamic probability” of the biosphere with the thermodynamic concept of entropy using the Boltzmann constant. It thus produces an equation showing that evolution does not violate the second law of thermodynamics..","date":"2012-12-04","mins":"12:00 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-19821","author":"david_roemer","post":"Dan: Granville Stewart’s paper (“A second look at the second law”) was accepted for publication by Applied Mathematics Letters, but was ultimately rejected. Prof. Stewart tells the story at http://www.evolutionnews.org/2011/10/more philosophical than scient052441.html I can email you this article if you tell me how. Another article by Andy Mc Intosh was published in the International Journal of Design & Nature Ecodynamics. The title is “Information and entropy top down or bottom up.” I can also send you two article published in Physics Today titled, “Thermodynamics of Evolution.” The title implies that Stewart and Mc Intosh are wrong, however, the fourth paragraph of the article shows that there is no disagreement between the Physics Today articles and Stewart and Mc Intosh. As I have said, 1) The idea that evolution violates the second law of thermodynamics is wrong. 2) The idea that evolution does not violate the second law because of the sun is stupid. 3) The idea that there is an equation that proves the second law does not violate the second law is ignorant and irrational. That a peer reviewed journal could publish such an article is perhaps understandable, given how # 2 is thought by many to be good physics. That the AJP does not retract the article boggles the mind..","date":"2012-12-04","mins":"10:59 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-19810","author":"david_roemer","post":"Hugh: The AJP article should be retracted because it is flat out absurd. You are quite right to assume that there are no such errors in a peer reviewed article about physics especially since I, and others, have been explaining why the article should be retracted. It is like the Holocaust. No one was ever forced to kill anyone in Germany, but there were severe penalties for telling about the atrocities. Collaboration took the form of silence. Physicists are being silent about the embarrassing error in the article. My #1 states that natural selection explains only adaptation, not common descent. The only theory that explains common descent is intelligent design (ID), but there is no evidence for intelligent design. ID is irrational and is motivated by anxiety about religion, just like the theory that the Holy Shroud is authentic. People who think the Holy Shroud is authentic usually believe in ID. I’m surprised that someone on this site is taking the atheistic position on evolution. Atheists don’t like to admit ID is a better theory in some sense than natural selection because they are more interested in promoting atheism than in understanding science..","date":"2012-12-04","mins":"9:22 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-19752","author":"david_roemer","post":"Daveb: The law of increasing entropy does not apply to the evolution of stars. The gravitational attraction between the hydrogen atoms causes the entropy of this isolated system to decrease. It also does not apply to evolution because a living organism is not a system of non interacting particles..","date":"2012-12-02","mins":"8:45 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-19834","author":"david_roemer","post":"I agree. The first step to believing in Jesus is realizing that we don’t know what a human being is. We can comprehend what a human is because we know everything we do and everything that happens to us. But, we can’t define or explicate what a human being is other than to say humans are embodied spirits..","date":"2012-12-04","mins":"4:36 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-19812","author":"david_roemer","post":"Hugh: The equation for temperature and KE energy is KE = (3/2)k T. K is the Boltzmann constant and is quite small. It only applies to molecules. Suppose you have a box of ping pong balls bouncing around in a box. The kinetic energy of a ball will be around 1 joule. This does not mean the temperature of the ping pong balls is a gazillion degrees. This is how irrational the AJP article is..","date":"2012-12-04","mins":"9:31 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-19832","author":"david_roemer","post":"Hugh: “Natural selection” is short hand for “natural selection acting upon innovations.” According to James Shapiro, a mainstream biologist from the U. Of Chicago, the old paradigm for innovations was random mutations and the new paradigm is genetic engineering. In any case, no evolutionary biologist thinks natural selection acting upon random mutations or genetic engineering explains the complexity of mammals. Natural selection only explains why species adapt to the environment. The primary structure of a protein (there are four structures in a protein) does not even begin to describe the complexity of a mammal. There is the molecular machinery consisting of dozens of proteins. There is also the dynamic complexity of the ability of cells to detect their environment and produce new proteins to handle the changes in the environment (genetic engineering). There is also the process of cell differentiation which enables a single fertilized egg to become many different cells. There is also the instinctual behavior of animals and the ability of small children to speak with grammatical precision. Children are born with the ability to know when to use “me” and when to use “I.”.","date":"2012-12-04","mins":"4:32 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-19822","author":"david_roemer","post":"Dan: This is the atheistic position on evolution: Advocate of ID: ID is a better theory for evolution than natural selection. Atheist: No it isn’t. ID is not science because it is not testable. Atheists don’t understand what science is. Atheists don’t realize that science is something humans do, but animals do not do. When animals have nothing to do, they go to sleep. Humans ask questions, some of which are scientific questions. Atheists don’t grasp the difference beween these two questions: Scientific question: Why is the sky blue? Non scientific question: What is knowing the sky is blue?.","date":"2012-12-04","mins":"11:05 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-19838","author":"david_roemer","post":"Hugh: These are the quotes I am basing my statements on. You will never find a quote from a biology textbook or scholarly work that states natural selection acting upon innovations explains the complexity of life. I repeat: natural selection only explains adaptation. Facilitated variation is not like orthogenesis, a theory championed by the eccentric American paleontologist Henry Osborn (1857–1935), which imbues the organism with an internal preset course of evolution, a program of variations unfolding over time. Natural selection remains a major part of the explanation of how organisms have evolved characters so well adapted to the environment. (Marc Kirschner and John Gerhart, The Plausibility of Life: Resolving Darwin’s Dilemma, page 247) By the time Darwin came to publish On the Origin of Species in 1859, he had amassed enough evidence to propel evolution itself, though still not natural selection, a long way towards the status of fact. Indeed, it was this elevation from hypothesis towards fact that occupied Darwin for most of his great book. The elevation has continued until, today, there is no longer any doubt in any serious mind, and scientists speak, at least informally, of the fact of evolution. All reputable biologists go on to agree that natural selection is one of its most important driving forces, although —as some biologists insist more than others—not the only one. Even if it is not the only one, I have yet to meet a serious biologist who can point to an alternative to natural selection as a driving force of adaptive evolution—evolution towards positive improvement. (Richard Dawkins, The Greatest Show on Earth: The Evidence for Evolution, p. 18).","date":"2012-12-04","mins":"7:33 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-19766","author":"david_roemer","post":"Daveb: I think the burden of proof is on you. In the evolution of stars, entropy decreases as the hydrogen molecules move closer together. This is not a violation of the second law of thermodynamics. The second law only applies to non interacting particles, though chemical reactions can be included in thermodynamic analysis..","date":"2012-12-03","mins":"9:25 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-142597","author":"david_roemer","post":"I think you are confusing faith with reason. “Certainty” has to do with reason, not faith. Also, your reference to “natural process” makes no sense to me. All processes are natural. There is no such thing as a “supernatural process.” If you think the Shroud is authentic, you should keep it to yourself. Saying the Shroud is authentic is like saying God caused the Big Bang. There is no evidence God caused the Big Bang..","date":"2014-08-06","mins":"10:27 am","url":"https://shroudstory.com/2014/08/06/scientific-conference-on-the-shroud-of-turin/","cat":"news_&_views","title":"Scientific Conference on the Shroud of Turin"},{"id":"comment-19869","author":"david_roemer","post":"Hugh: As I said, “natural selection” is short hand for “natural selection acting upon innovations.” Before “innovations” meant “random mutations.” Now, biologists have more knowledge about innovations: gene transfer, gene duplication, facilitated variation and so on. James Shapiro is saying that self engineering is another source of innovations. I have also said I do not believe in ID or creationism. There is no evidence for these theories. The two quotes I gave proves that no bioligist thinks natural selection (acting upon innovations) explains how life evolved from bacteria to mammals in only 3.5 billion years. The first quote says, “evolved characters so WELL ADAPTED TO THE ENVIRONMENT.” The quote from Richard Dawkins, a professional biologist and atheist, says “ADAPTIVE EVOLUTION.” You can’t supply any quotes from biologists saying that natural selection acting upon innovations explains the complexity of life because there are none. You have been duped by atheists and advocates of intelligent design. Advocates of ID compare ID with natural selection to make ID look better. Atheists go along with the scam because they don’t want to admit ID is a better theory than natural selection in some sense..","date":"2012-12-05","mins":"9:28 am","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-142583","author":"david_roemer","post":"I’m doing my best to get the IEEE to withdraw its support for this conference. I filed an ethics complaint against Bruno Barberis and others with the Ethics and Members Conduct Committee of the IEEE. This complaint is basically the same as the complaint I filed against Cardinal Dolan for suppressing my slideshow/lecture with the Congregation for the Doctrine of the Faith. If the IEEE sanctions Barberis, it will in effect be criticizing the Catholic Church for promoting the authenticity of the Holy Shroud..","date":"2014-08-06","mins":"7:58 am","url":"https://shroudstory.com/2014/08/06/scientific-conference-on-the-shroud-of-turin/","cat":"news_&_views","title":"Scientific Conference on the Shroud of Turin"},{"id":"comment-19698","author":"david_roemer","post":"With revelation we believe exactly what God wants us to believe. People believe in Jesus because God has given them the gift of faith. Faith is both a decision and a gift from God. One of the reasons I believe in Jesus is the inexplicability of the blood marks and body images on the 1st or 2nd century piece of linen with dimensions that suit perfectly the goal of creating the front and back images but don’t serve any other purposes, so far as I know. Thus, my faith comes from God and the Holy Shroud comes from God. There is very little evidence that God gave us the Holy Shroud without the help of human craftsmen and a piece of linen that never touched Jesus..","date":"2012-12-01","mins":"12:03 am","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","title":"Strong ignorance is not strong evidence"},{"id":"comment-19880","author":"david_roemer","post":"Hugh: Intelligent design is a bright idea. But there is no evidence for it. ID is an attempt to explain common descent, but rational people judge it to be false. The quotes you gave from Dawkins do not say natural selection explains how mammals evolved from bacteria in only 3.5 billion years. Natural selection only explains adaptation. Science has not yet solved the question of what caused the Big Bang, the origin of life, or evolution. This is a reason to believe in the Bible because the Bible says God created the universe from nothing..","date":"2012-12-05","mins":"3:52 pm","url":"https://shroudstory.com/2012/12/02/rupert-sheldrake-on-science-and-religion/","cat":"news_&_views","title":"Rupert Sheldrake on Science and Religion"},{"id":"comment-30603","author":"david_roemer","post":"My guess is that Fanti is making the same mistake as Tristan Casablanca about the Resurrection of Jesus. It is both an historical event and an object of faith. The followers of Jesus swore up and down that He appeared to them after he died. They went on to found the Catholic Church, which gave us Western civilization. Atheists Marcos Borg and John Dominic Crossan trace the tradition of the Easter experience to within a few years of the crucifixion, but they don’t believe Jesus is alive in a new life with God. One of the reasons I do believe is that the likes of Borg and Crossan don’t understand the cosmological argument for God’s existence. They fail in this area on the level of intelligence, not reflective judgment. Instead of giving them the gift of faith, God gave them a situational neurosis..","date":"2013-04-13","mins":"9:46 am","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","title":"Yeah, right!"},{"id":"comment-142654","author":"david_roemer","post":"There is no evidence God caused the Big Bang. Saying God did it confuses atheists. Atheists don’t understand the difference between metaphysical questions and scientific questions..","date":"2014-08-06","mins":"5:38 pm","url":"https://shroudstory.com/2014/08/06/scientific-conference-on-the-shroud-of-turin/","cat":"news_&_views","title":"Scientific Conference on the Shroud of Turin"},{"id":"comment-29745","author":"david_roemer","post":"I have personal experience with the peer review process. At the suggestion of the editor, I submitted a manuscript (ID No. 25055) on February 24, 2012, explaining why an article titled “Entropy and evolution” (Am. J. Phys., Vol. 76, No. 11, November 2008) was absurd. An anonymous reviewer said I was wrong. In this way, the editor justified not retracting the article. I re wrote my submission and posted it here: http://creationwiki.org/Pseudoscience in the American Journal of Physics..","date":"2013-04-07","mins":"8:39 am","url":"https://shroudstory.com/2013/04/07/when-it-comes-to-the-shroud-of-turin-has-peer-review-lost-its-luster/","cat":"news_&_views","title":"When it Comes to the Shroud of Turin, Has Peer Review Lost its Luster?"},{"id":"comment-19689","author":"david_roemer","post":"I see an analogy between the Big Bang and the Holy Shroud. The Big Bang is a sign that God inspired the human authors of the Bible because the Bible says God created the universe from nothing. The Holy Shroud is a sign because the Catholic Church venerates the relic and teaches that there is life after death. Saying the Shroud is authentic is like saying God caused the Big Bang. There is no evidence God caused the Big Bang. Saying so just confuses atheists and causes them to think that believing in God is irrational..","date":"2012-11-30","mins":"4:04 pm","url":"https://shroudstory.com/2012/11/30/strong-ignorance-is-not-strong-evidence/","cat":"news_&_views","title":"Strong ignorance is not strong evidence"},{"id":"comment-29817","author":"david_roemer","post":"Dear Frank Ly, Not quite. Stephen Barr and Randy Isaac are two Christian physicists who write about evolution. Barr told me angrily that I was wrong and harming the Catholic Church. I accused him of not reading my explanation and demanded an apology. He never explained why I was wrong. Isaac offered to “walk me through” the matter on the open forum of the American Scientific Affiliation, but his comments were inane. For example: David: A Boeing 747 does not have a temperature. Randy: Yes it does. I asked the president of the ASA to assign a moderator, but he declined to do it. Why don’t you read my Creationwiki. Org article and tell me what part you don’t understand? You don’t need even a high school course in physics to see how absurd the AJP article is, believe it or not..","date":"2013-04-07","mins":"9:28 pm","url":"https://shroudstory.com/2013/04/07/when-it-comes-to-the-shroud-of-turin-has-peer-review-lost-its-luster/","cat":"news_&_views","title":"When it Comes to the Shroud of Turin, Has Peer Review Lost its Luster?"},{"id":"comment-30822","author":"david_roemer","post":"Dear Yannick, I’m glad to see you believe in life after death. Your previous post spoke only of “love and peace.” I have no criticisms of other religions and even people who don’t believe. My criticism is directed against those who think belief in life after death is irrational. They tend to be unintelligent about the mind body problem, ignorant of the proof of God’s existence, and irrational about the meaning of life..","date":"2013-04-14","mins":"9:22 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","title":"Yeah, right!"},{"id":"comment-30869","author":"david_roemer","post":"We are not guaranteed salvation when we die. It is something to hope for with “fear and trembling.” We have to reckon with the possibility that someone can totally reject God..","date":"2013-04-15","mins":"9:56 am","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","title":"Yeah, right!"},{"id":"comment-30862","author":"david_roemer","post":"In the Catholic faith, to be saved you have to believe AND profess your faith. Believing is not enough..","date":"2013-04-15","mins":"8:40 am","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","title":"Yeah, right!"},{"id":"comment-30697","author":"david_roemer","post":"Borg and Marcus co authored a book about Christmas saying that there is no life after death. Liberal Christians that they are, all they care about is the “good of humanity,” not getting into Heaven. There is no difference between them and Richard Dawkins. This quote summarizes the point of their book: “It is not accurate to distinguish the imperial kingdom of Rome from the eschatological kingdom of God by claiming one is earthly the other heavenly, one is evil the other holy, or one is demonic the other sublime. That is simply name calling. Both come to us with divine credentials for the good of humanity. They are two alternative transcendental visions. Empire promises peace through violent force. Eschaton promises peace through nonviolent justice.…That clash of visionary programs for our earth is the context and matrix for those Christmas stories, and they proclaim God’s peace through justice over against Rome’s peace through victory.” (The Frist Christmas: What the Gospels Really Teach About Jesus’s Birth, p.75).","date":"2013-04-13","mins":"10:35 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","title":"Yeah, right!"},{"id":"comment-30876","author":"david_roemer","post":"The only thing we need to know about Hell is that it is possible to totally reject God. The rejection of God by non believers in this world is not a total rejection. If everyone is guaranteed to get to Heaven, why bother to be good and kind?.","date":"2013-04-15","mins":"11:55 am","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","title":"Yeah, right!"},{"id":"comment-30818","author":"david_roemer","post":"If you don’t believe in life after death, you should keep it to yourself. People who think life ends in the grave are prone to believe in irrational things (socialism, racism, imperialism, eugenics) and to behave immorally. The idea that you can substitute believing in “peace on Earth and goodwill towards men” for fear of God is nonsense..","date":"2013-04-14","mins":"8:33 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","title":"Yeah, right!"},{"id":"comment-142605","author":"david_roemer","post":"Do you consider an artist painting a picture a “natural process”?.","date":"2014-08-06","mins":"11:13 am","url":"https://shroudstory.com/2014/08/06/scientific-conference-on-the-shroud-of-turin/","cat":"news_&_views","title":"Scientific Conference on the Shroud of Turin"},{"id":"comment-30692","author":"david_roemer","post":"Borg and Crossan think that believing in life after death is irrational, which is my definition of an atheist. They are liberal Christians who feel that saying God doesn’t exist is too negative and does not express their compassion for their fellow human beings. The following quote is from Borg: “I was experiencing a collision between the modern worldview and my childhood beliefs. The modern worldview, with its image of what is real as the world of matter and energy and its vision of the universe as a closed system of cause and effect, made belief in God—a nonmaterial reality—increasingly problematic. I had entered the stage of critical thinking, and there was no way back.” (Borg, Marcus J., Meeting Jesus Again for the First Time: The Historical Jesus & the Heart of Contemporary Faith, 1994, p. 7).","date":"2013-04-13","mins":"9:50 pm","url":"https://shroudstory.com/2013/04/13/yeah-right/","cat":"news_&_views","title":"Yeah, right!"}]
