[{"id":"comment-97741","author":"david_roemer","post":"The evidence is 1) There were a lot of Gnostics in Edessa; 2) Gnostics said that Pilate painted a picture of Jesus; 3) a tomb in Rome contains a Shroud like painting probably owned by Gnostics; 4) Gnostics were morally capable of crucifying someone to get an image..","date":"2014-04-08","mins":"9:46 pm","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-97718","author":"david_roemer","post":"The defense attorney is this hypothetical scenario failed to mention the possibility Gnostics created the Holy Shroud in the 1st or 2nd century using methods that have been lost to history. There is more evidence for this than there is for authenticity because it gives a partial explanation of how the image was created. However, what is really wrongheaded about article is that there is no need to decide whether or not the Shroud is authentic. Since there is no need to decide, you can’t accuse someone of having bad judgment for not deciding the Shroud is authentic. The only decision that has to be made is whether or not to believe Jesus is alive in a new life with God or will be at the end of time. In this decision, you can’t criticize the judgment of people who don’t believe because you can’t see the truth of it. We believe in life after death because God is telling us. Faith is both a decision and a gift from God..","date":"2014-04-08","mins":"7:01 pm","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-97852","author":"david_roemer","post":"Just to keep the record straight, there is a fifth bit of evidence that I already mentioned: 5) there is a detailed image and images are always created by humans. This means there is more evidence against authenticity than for authenticity. However, I am not making the judgment that the Shroud was done by Gnostics. I am not saying your judgment is poor. I am saying you should keep your ideas about authenticity to yourself. I see no need to decide whether or not the Shroud is authentic..","date":"2014-04-09","mins":"7:26 am","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-97902","author":"david_roemer","post":"Drivel is what you get from atheists. My guess is that you think atheists just have poor judgment. You wouldn’t dare say to Richard Dawkins to his face that his books are drivel..","date":"2014-04-09","mins":"11:52 am","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-97996","author":"david_roemer","post":"Are you aware of the fact that two books were written by atheists using the authenticity of the Holy Shroud to explain the Resurrection of Jesus historically? Bardaisan was simply venerating the Holy Shroud, as I do. Venerating the Shroud is not evidence that the Shroud is authentic. The Shroud is a sign. It is a reason to believe in Jesus, and is part of our salvation history. Saying the Shroud is authentic is misrepresenting our salvation history..","date":"2014-04-09","mins":"11:06 pm","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-98079","author":"david_roemer","post":"What is “proof of the resurrection”? The Resurrection is both an historical event and an object of faith. There are two kinds of knowledge: faith and reason. In reason, we know something is true because we can see the truth of it. In faith, we know something is true because God is telling us. That Jesus is alive in a new life with God is a matter of faith. I am giving you my reasons for believing in Jesus and am summoning you to believe. I am not going to criticize your judgment if you decide not to believe. However, I am demanding that you agree Jesus rose from the dead. It is an historical fact that everyone accepts. If you don’t admit it you have bad judgment or are ignorant. I have two reasons to believe: 1) the Resurrection and 2) the Holy Shroud. You have only one reason 1) the Resurrection. Like Cardinal Dolan, you are giving arguments against faith even as you profess your faith..","date":"2014-04-10","mins":"7:59 am","url":"https://shroudstory.com/2014/04/08/lawrence-e-schauf-for-the-prosecution-the-trial-of-the-shroud/","cat":"article","title":"Lawrence E. Schauf for the Prosecution: The Trial of the Shroud"},{"id":"comment-62236","author":"david_roemer","post":"More talk about the Holy Shroud is good if the talk is intelligent and rational. I just read and reviewed on Amazon.com two books written by atheists which assume that the Shroud is authentic. They do this to argue that Jesus did not rise from the dead. The books are The Shroud was the Resurrection: The Body Theft, the Shroud in the Tomb, and the Image that Inspired a Myth and The Sign: The Shroud of Turin and the Birth of Christianity..","date":"2013-12-19","mins":"7:13 am","url":"https://shroudstory.com/2013/12/19/how-the-shroud-becomes-part-of-the-conversation/","cat":"books","title":"How the Shroud Becomes Part of the Conversation"},{"id":"comment-94998","author":"david_roemer","post":"Intelligence is usually a measure of how fast or how slow it takes you to grasp a theory. In the case of religion, there is so much conflict and anxiety that people are inhibited from thinking intelligently. They have blind spots. I invented an intelligence test for religion: What are four solutions to the mind body problem and four answers to the question of what caused the Big Bang? I give 10 points for each of the eight answers and a 20 point bonus for understanding the mind body problem. I have an IQ of 100 because I went to a Catholic college. In my metaphysics course, both questions and answers were explained to me and I was intelligent enough to understand the answers. Richard Dawkins has an IQ of 20 and I estimate John Klotz’s IQ to be between 50 or 60. If anyone is interested in taking the test, I’ll be glad to tell you your IQ..","date":"2014-03-30","mins":"6:03 pm","url":"https://shroudstory.com/2014/03/30/john-klotz-wants-your-feedback/","cat":"books","title":"John Klotz Wants Your Feedback"},{"id":"comment-95272","author":"david_roemer","post":"Your theory of the mind (“transcendental dualism”) sounds like saying the human mind is a mystery. There is so much evidence for this that it is judged to be true by rational people. There is no evidence for dualism (spiritual substances exist). There is more evidence for materialism because indeed material substances do exist. There is even more evidence for idealism (the material world is an illusion.) There is no evidence we will ever understand what the human mind is. When animals have nothing to do they go to sleep. Only humans ask questions, and just because we ask a question does not mean there is an answer..","date":"2014-03-31","mins":"4:07 pm","url":"https://shroudstory.com/2014/03/30/john-klotz-wants-your-feedback/","cat":"books","title":"John Klotz Wants Your Feedback"},{"id":"comment-95247","author":"david_roemer","post":"Panpsychism is the theory that the “soul or mind is a universal feature of all things.” According to the metaphysics of Thomas Aquinas, the human soul is spiritual. The soul is the principle that makes humans members of the class of beings called humans, and the body is the principle that makes humans different from one another. The human soul is spiritual because we can’t define or explicate the functions of the human mind: paying attention, asking questions and inventing answers, deciding whether a theory is true or just probable, and deciding what to do with our bodies. Another way of expressing this is to say that humans are embodied spirits or spirited bodies. Alternatively, one can say humans are indefinabilities that become conscious of their own existence. The only theories of the mind you seem to understand are dualism, materialism, and panpsychism..","date":"2014-03-31","mins":"1:28 pm","url":"https://shroudstory.com/2014/03/30/john-klotz-wants-your-feedback/","cat":"books","title":"John Klotz Wants Your Feedback"},{"id":"comment-95167","author":"david_roemer","post":"The mind body problem is this: What is the relationship between myself and my body? The four answers are 1) dualism, 2) materialism, 3) idealism, and 4) It is a mystery. The four answers to the question of what caused the Big Bang are 1) God did it, 2) an angel did it, 3) the universe is not intelligible, and 4) science will eventually discover the cause of the Big Bang at some point in the future. Walker mentions Thomas Nagel, whose IQ I estimated at 50 in a review of his book “Mind and the Cosmos” on Amazon.com. So, I’m giving him the same score. Like Nagel, Alexander Walker shows no understanding of # 4 for the mind body problem. He knows some other theories about the human mind, but I don’t give extra credit. Walker does not even grasp the theory that human beings are embodied spirits or indefinabilities that become conscious of their own existence. He also does not realize that this is the theory with the most evidence and the one judged to be true by rational people..","date":"2014-03-31","mins":"7:28 am","url":"https://shroudstory.com/2014/03/30/john-klotz-wants-your-feedback/","cat":"books","title":"John Klotz Wants Your Feedback"},{"id":"comment-58970","author":"david_roemer","post":"This book is not available on Amazon.com, and I’m sure it is no more intelligent than the following quote from a famous atheist from his book “Mind and Cosmos: Why the Materialist Neo Darwinian Conception of Nature Is Almost Certainly False” (location 69 of 1831): “Among the traditional candidates for comprehensive understanding of the relation of mind to the physical world, I believe the weight of evidence favors some from of neutral monism over the traditional alternatives of materialism, idealism, and dualism.” The “traditional” theories include the theory that the human mind is a mystery and humans are embodied spirits. Alternatively, one can say that the human soul is spiritual. Thomas Nagel does not fail at the level of reflective judgment, he fails at the level of intelligence. Usually intelligence has to do with how fast or slow it takes someone to grasp a concept. Nagel doesn’t even grasp the theory of the human mind judged to be true by Catholic philosophers..","date":"2013-12-13","mins":"3:16 pm","url":"https://shroudstory.com/2013/12/13/please-only-discuss-michael-judes-book-and-claims-here/","cat":"books","title":"Please Only Discuss Michael Jude’s Book and Claims Here"},{"id":"comment-5384","author":"david_roemer","post":"Merriam Webster lets people suggest new words to include in the dictionary. I just submitted the word “sindonolgy.” My reference was Dictionary.com which defines it as the scientific study of the Shroud of Turin. Merriam Webster is the standard reference for writers and copy editors in the U.S..","date":"2011-12-09","mins":"4:37 pm","url":"https://shroudstory.com/2011/08/24/new-book-saints-preserved-an-encyclopedia-of-relics-including-the-shroud-of-turin/","cat":"books","title":"New Book: Saints Preserved: An Encyclopedia of Relics including the Shroud of Turin"},{"id":"comment-39186","author":"david_roemer","post":"On Nov. 19, 2012, I filed a complaint against Cardinal Dolan for suppressing my slideshow/lecture about the Holy Shroud on the grounds that I was not promoting its authenticity. I sent it to the President of the Pontifical Council for Promoting New Evangelization, Archbishop Salvatore Fisichella by registered mail. I haven’t gotten a response from either Cardinal Dolan or the council. The Italian post office was unable to tell me what happened to the letter..","date":"2013-07-18","mins":"6:44 am","url":"https://shroudstory.com/2013/07/18/timothy-cardinal-dolan-se-non-e-vero-e-ben-trovato/","cat":"books","title":"Timothy Cardinal Dolan: Se non e vero e ben trovato"},{"id":"comment-24696","author":"david_roemer","post":"I don’t agree that the origin of life, the Big Bang, and evolution is evidence of God’s existence. Rather, it is evidence that God does not exist because it is evidence that the universe is not intelligible. The evidence that the universe is intelligible is the success of the scientific method and the fact that things don’t pop into or out of existence without a reason. This evidence is contradicted by the Big Bang, etc. The evidence for God’s existence is that we have free will. Free will means we possess a center of action that makes us unified with respect to ourselves and different from other beings. Hence, we are finite beings. An infinite being exists because a finite being needs a cause. If all beings in the universe needed a cause, the universe would not be intelligible. In the West, we call the infinite being God. This raises the question of what motivated God to create finite beings. The only thing that could motivate God to do anything is self love. Finite beings exist because God loved Himself as giving. But God could just as well love Himself without giving. Why God created finite beings is a mystery. God’s existence raises the question of whether or not God has communicated Himself to mankind. That is another matter..","date":"2013-02-18","mins":"11:48 am","url":"https://shroudstory.com/2013/02/18/stepping-out-beyond-science/","cat":"books","title":"Stepping Out Beyond Science?"},{"id":"comment-95219","author":"david_roemer","post":"@Hugh Farley Are you saying you don’t understand the theory that humans are embodied spirits? If this is so, you have a blind spot, like Alexander and most atheists. You and many atheists are very fast to understand things that don’t touch on religion. But with the mind body problem, you can’t understand it, no matter how much time you have..","date":"2014-03-31","mins":"11:25 am","url":"https://shroudstory.com/2014/03/30/john-klotz-wants-your-feedback/","cat":"books","title":"John Klotz Wants Your Feedback"},{"id":"comment-5152","author":"david_roemer","post":"We know God exists because we have free will. Free will makes us unified with respect to ourselves and different from other human being. In other words, humans are finite beings. From the success of science we know that the universe is intelligible. Everything has a reason and an explanation. A finite being needs a cause. If every being in the universe needed a cause the universe would not be intelligible. Hence, there must exist an infinite being. The infinite being is called God in the Western religions. I believe in life after death for a large number of reasons, one of which is the mysteriousness of the Shroud of Turin. Another reason is that the followers of Jesus swore up and down that He appeared to them after He died. Another reason is that He saved mankind for meaning. He taught us that our purpose in life is to serve God in this world to be with him in the next..","date":"2011-12-02","mins":"1:12 am","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","title":"Was the Shroud of Turin created by Gnostics?"},{"id":"comment-5142","author":"david_roemer","post":"I suggest that you all consider who you are having the conversation about the authenticity of the Holy Shroud with. You are not having it with me because I am not willing to consider the idea that the image was created without the help of two humans at least: the crucifixion victim and the craftsman who created the image. You should know also that you are not having that conversation with an atheist or Christians who don’t believe in life after death. As I tried to explain in the last slide, atheists fail at the level of intelligence, not reflective judgment. They don’t understand that humans are embodied spirits because they can’t grasp the difference between these two types of questions: 1) What is the relationship between myself and my body? 2) What is the relationship between the earth and the sun? The first question is a mystery: Just because a human asks a question doesn’t mean there is an answer. The second question, like all scientific questions, will be answered at some point in the future with further observations, hypothesis, and controlled experiments. It is because of the success of science that we know an infinite being exists. Knowing this, we can see in the mysteriousness of the Shroud a reason to believe the infinite being communicated Himself to mankind..","date":"2011-12-01","mins":"3:26 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","title":"Was the Shroud of Turin created by Gnostics?"},{"id":"comment-5167","author":"david_roemer","post":"The human mind is structured like the scientific method. At the bottom is observing, which requires paying attention. At the level of intelligence, humans try to understand why things happen and the relationship between things. Extremely intelligent people invent new insights and theories. At the level of reflective judgment, humans marshal the evidence and decide whether a theory or insight is true. Reflective judgment requires being rational. The highest level is deciding what to do with our bodies. This requires being responsible. Deciding whether or not to believe in life after death is a matter of reflective judgment. However, there are two kinds of knowledge: faith and reason. In reason, you know something is true because you can see the truth of it. In faith, you know something is true because God is telling you. Faith is both a rational judgment and a gift from God. Suppose someone says, “God hasn’t given me the gift of faith.” That person is admitting God exists, is acknowledging the large amount of evidence showing there is life after death, and is admitting they don’t have a meaningful life. You can’t say such a person has bad judgment. So for this reason, you can’t say that you can prove there is life after death. What we should do is give our reasons for believing accompanied with a summons, not a demand, to believe..","date":"2011-12-02","mins":"12:39 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","title":"Was the Shroud of Turin created by Gnostics?"},{"id":"comment-69922","author":"david_roemer","post":"There are two books by atheists (The Sign: The Shroud of Turin and the Birth of Christianity and The Shroud Was the Resurrection: The Body Theft, the Shroud in the Tomb, and the Image that Inspired a Myth) that say the Holy Shroud is authentic in order to explain the historical events or event called the Resurrection of Jesus. The idea is that putrefaction did not destroy the naturally created image because Roman and/or Jewish officials stole the corpse. Donald Nohs, in this video, uses the authenticity of the Holy Shroud to argue that the corpse did not putrefy at all because of the Resurrection. Both analyses failed to mention the theory of Robert Drews that Gnostics in the 1st or 2nd century created the image on the Shroud with methods that have been lost to history. Both atheistic historians and Christian historians make the mistake of asking: What caused the Resurrection of Jesus? This is not an intelligent historical question because there is no answer to the question. An intelligent question is to ask whether or not Jesus is alive in a new life with God..","date":"2013-12-29","mins":"10:16 pm","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-70073","author":"david_roemer","post":"Matthew was written 40 or 50 years after the Resurrection and indeed is part of the Resurrection. I was grateful for de Wesselow’s book (The Shroud of Turin and the Birth of Christianity) for giving an expanded definition of the Resurrection: 1) The renewed fellowship of His disciples after the crucifixion. 2) Calling Jesus the Messiah even though he was dead. 3) Worshipping on Sunday. 4) Emphasis on the Jewish belief in life after death. 5) The growth of the church. The idea is that when the disciples saw the mysterious image, they interpreted it as meaning Jesus was alive. They argue that Paul went to Damascus to destroy the Holy Shroud, and when he saw the image he joined the Church..","date":"2013-12-30","mins":"7:42 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-69967","author":"david_roemer","post":"The atheistic authors had arguments to explain the motivation of the Jewish and Roman authorities for stealing the body. It had to do with preventing the burial place of Jesus from being honored. My point is that advocates of the authenticity of the Shroud are misrepresenting our salvation history. The motivation for this is to promote belief in Jesus. Atheists are using the authenticity of the Shroud to promote atheism. I don’t think it is an historical fact that Jesus predicted the Resurrection. Even if it was, why would the Romans know about this prediction?.","date":"2013-12-30","mins":"12:50 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-5170","author":"david_roemer","post":"Atheists and liberal Christians fail at the level of intelligence, not the level of reflective judgment. Ordinarily, intelligence is a measure of how long it takes someone to grasp an insight and the ability to invent new theories. But in the case of God, there is so much anxiety, bias, and inhibition that many people can’t even grasp the concept. Atheists have a blind spot about the mind body problem. The only solutions they can grasp are materialism (the mind is an illusion), dualism (there are spiritual substances), and idealism (the brain is an illusion.) Atheists will put on their thinking caps when they are planning a bank robbery, but not when it comes to understanding why God exists..","date":"2011-12-02","mins":"1:42 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","title":"Was the Shroud of Turin created by Gnostics?"},{"id":"comment-70139","author":"david_roemer","post":"The Resurrection is an historical event that can’t be explained. The faith response to the Resurrection is that Jesus is alive in a new life with God and if you follow Jesus the same good thing can happen to you. One of the reasons I believe is that atheists and agnostics don’t understand or don’t know, or pretend they don’t understand or know the cosmological argument for God’s existence. Anyone calling himself an atheist or an agnostic doesn’t know what they are talking about. For proof of this read about the cosmological argument for God’s existence in Wikipedia or the Stanford Encyclopedia for Philosophy. Both sources don’t know what they are talking about..","date":"2013-12-30","mins":"11:00 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-77482","author":"david_roemer","post":"I agree that the Holy Shroud is a reason to believe in Jesus. However, the authenticity of the Shroud is not. Two books have been recently written by atheists using the authenticity of the Shroud to explain the Resurrection. The best explanation is that the Holy Shroud was created by Gnostics in the 1st or 2nd century using a crucified victim and methods that have been lost to history. There were also two scientific mistakes. 1) The body image does not appear only on one side of the cloth. Computer enhancement reveals a faint image on the other side. 2) There are two theories of what caused the discoloration of the fibrils. One is that the cellulose was oxidized, and the other is that the discoloration is caused by sugar and starch on the outer surface of the cloth..","date":"2014-02-08","mins":"10:09 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77778","author":"david_roemer","post":"What difference does it make whether the image was produced by natural means in the tomb, supernatural means in the tomb, or by a Gnostic craftsman using methods that have been lost to history. I agree that if someone could figure out how the Gnostic did it, it would be one less reason to believe in Jesus..","date":"2014-02-09","mins":"11:46 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77598","author":"david_roemer","post":"The evidence that the Shroud was created by Gnostics is that the blood marks are not smeared and the body image is a true detailed image, like a charcoal painting. Also, there is evidence that a lot of Gnostics lived in Edessa..","date":"2014-02-08","mins":"8:35 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77656","author":"david_roemer","post":"No. The methods used by the Gnostics have been lost to history. There is no other explanation for the Shroud. For the Resurrection of Jesus there is no explanation at all. The faith response to the Resurrection of Jesus is to believe that Jesus is alive in a new life with God. One of the reasons to believe Jesus is alive is the Shroud. It is a sign, or a reason to believe..","date":"2014-02-09","mins":"1:50 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77774","author":"david_roemer","post":"According to Wikipedia, some Gnostics believed Jesus was sent by the true God. Others thought he was a “false messiah.” The Gnostics who were against Jesus certainly did not go to the trouble of crucifying someone and using the body somehow to create the image. There are two kinds of knowledge: faith and reason. In reasons we know something is true because we can see the truth of it. In faith, we know something is true because God is telling us. It is both a decision and a gift from God. When you argue that the Shroud is authentic, you are confusing faith with reason..","date":"2014-02-09","mins":"11:35 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77798","author":"david_roemer","post":"A “speculation” is a theory without evidence. A “fact” is a theory with a lot of evidence. It is a fact that the Shroud was created by Christians in the 1st or 2nd century. It is speculation to say, as the atheist Thomas de Wesselow says, the Shroud was the burial cloth of Jesus..","date":"2014-02-09","mins":"1:04 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77560","author":"david_roemer","post":"What I would love to do is give my presentation of the Shroud of Turin (http://www.holyshroud.info) with you present to defend your ideas about the Holy Shroud and the way you present the relic. I just has a conversation with the chief of staff of the Vicar General of the New York Diocese. I mentioned your name and suggested that you be invited to any presentation that I give..","date":"2014-02-08","mins":"5:43 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77771","author":"david_roemer","post":"In my mind, the theory of Robert Drews (Gnostics did it) is the only explanation supported by evidence. There is no evidence it was produced in the middle ages by an unknown artist. The theory that it was in contact with Jesus conflicts with the evidence that it is a work of human ingenuity..","date":"2014-02-09","mins":"11:24 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77856","author":"david_roemer","post":"The entry on the Shroud of Turin on the old Catholic Encylopedia was written by Thurston Davies who promoted the Pierre D’arcis memorandum hoax. This is the latest entry: “In short, while many unanswered questions still remain, not least that of how the images came to appear on the cloth in the first place, it is most unlikely that this object is the authentic burial shroud of Jesus.” (Shroud of Turin in the New Catholic Encyclopedia, Vol. 13, pp. 95–97, 2nd ed. Detroit: Gale, 2003.).","date":"2014-02-09","mins":"4:45 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77817","author":"david_roemer","post":"The evidence is that the blood marks were not smeared and the image is a true image with shades of yellow, not an outline. Saying the Shroud is authentic is like saying the 3 D images of Presidents on Mount Rushmore was made by wind erosion..","date":"2014-02-09","mins":"2:15 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-78032","author":"david_roemer","post":"What follows is a quote from the 2nd century that connects the Holy Shroud with Gnostics. When atheists (not anti Christian fanatics like de Wesselow and Locken) look at the body image and the un smeared blood marks they assume that the image was created by some craftsman. If you say it came from a burst of radiation when Jesus rose from the dead, they will think you are irrational and unintelligent. We have a duty to preach the gospel, not prevent people from believing. Against The Heresies, St. Irenaeus, 180 AD They call themselves Gnostics and possess images, some of which are paintings, some made of other materials. They said Christ’s image was copied by Pilate at the time that Jesus lived among men. On these images the put a crown and exhibit them along with the images of the philosophers of the world, namely, with the image of Pythagoras, Plato, Aristotle, and the rest. Toward these [images] they observe other rites that are just like those of the pagans..","date":"2014-02-10","mins":"8:28 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77566","author":"david_roemer","post":"The Gnostics were Christians. They believed that Jesus was sent by the true God in the disguise of a human to fool the Demiurge and archons that created and ruled Earth. While on Earth, Jesus gave humans knowledge that would enable them to avoid reincarnation and be re united to the true God. The theory that Gnostics created the Shroud must be taken seriously because there is no other explanation for it. There is no need to come up with an explanation for the Resurrection because it is an historical event. But reason demands coming up with an explanation for an artifact..","date":"2014-02-08","mins":"5:56 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-78039","author":"david_roemer","post":"Another sign, like the Shroud, was the 1960s discovery of the background microwave radiation produced when the universe began to exist 14 billion years ago. This proved that the theory of the Big Bang was true. It is a reason to believe in Jesus because Jesus was a Jewish prophet, and the Bible says God created the universe from nothing. The Big Bang is not evidence that God exists. It is rather evidence that God does not exist because it is evidence that the universe is not intelligible. According to science, the hundreds of billions of galaxies each with hundreds of billions of stars was the size of a grain of salt 14 billion years ago. My guess is that people who think the Shroud is authentic think that the Big Bang is evidence of God’s existence..","date":"2014-02-10","mins":"9:13 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-78045","author":"david_roemer","post":"Not explicit? (In the beginning, God created Heaven and Earth; In the beginning was the Word). In any case, the creation myths of all other religions involved pre existing materials. This is one reason Jewish people are unique. The others are that they knew the right name for God (Yahweh, “I am who am”), their tribes always had prophets, not just priests and chiefs, and they wrote the first narrative histories. I don’t put Gould above Pinker and Dawkins. In the following quote he refers to “private beliefs about souls.” What he is saying in a dishonest way is that the human soul is not spiritual. He is smarter than Pinker et al because those clowns think the human soul is spiritual by definition. “Catholics could believe whatever science determined about the evolution of the human body, so long as they accepted that, at some time of his choosing, God had infused the soul into such a creature. I also knew that I had no problem with this statement, for whatever my private beliefs about souls, science cannot touch such a subject and therefore cannot be threatened by any theological position on such a legitimately and intrinsically religious issue.” (Natural History, March 1997, 13th paragraph).","date":"2014-02-10","mins":"9:56 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-78064","author":"david_roemer","post":"In my opinion, the word “Word” in John’s prologue refers to the concept of the universe in God’s mind. Pinker, Gould, and Dawkins have blind spots about the mind body problem. They don’t even grasp the theory that humans are embodied spirits. The only theories they grasp are dualism and materialism. Their atheism is equally stupid. Gould does more harm than Dawkins and Pinker because he does not overtly attack religion. He is like a liberal Christian. Gould gives the impression that he is an intelligent person who has considered religious belief and in his judgment it is not true..","date":"2014-02-10","mins":"11:26 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-78073","author":"david_roemer","post":"The first step in resolving the mind body problem is to grasp all of the possible theories of the mind. The next step is to marshal the evidence and decide which theory is true or just probable. These are the four theories with my comments about the evidence: 1) dualism (no evidence at all) 2) materialism ( more evidence than for dualism because material substances exists) 3) idealism (more evidence than for materialism and dualism) 4) It is a mystery. This is the theory with the most evidence, and is judged to be true by rational people..","date":"2014-02-10","mins":"12:14 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-78079","author":"david_roemer","post":"You can end the mystery by admitting it is a mystery. If you don’t, you might wind up howling..","date":"2014-02-10","mins":"12:37 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-78105","author":"david_roemer","post":"I have not been denied by Church authorities. The Pontifical Council for the New Evangelization suggested that I file my complaint against Cardinal Dolan with the Congregation for the Doctrine of Faith..","date":"2014-02-10","mins":"3:18 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-78340","author":"david_roemer","post":"I have not given the slideshow/lecture to anyone despite sending out hundreds of notices to churches and colleges. Fr. Daniel Gatti, the Alumni pastor of Fordham, where I graduated from, suggested that it would be good for adult education classes. In any case, it is on the internet at http://www.holyshroud.info..","date":"2014-02-11","mins":"12:45 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-78178","author":"david_roemer","post":"Cardinal Dolan is suppressing my slideshow/lecture about the Shroud on the grounds that I am “debunking” the Holy Shroud. It shows a lack of understanding of fundamental theology, and a lack of interest in our salvation history..","date":"2014-02-10","mins":"8:44 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-78302","author":"david_roemer","post":"Thank you for that connection between Gnostics and the Shroud. In addition to the quote in # 47, Robert Drews sites J. B. Segal’s quotation from a tomb stone in Edessa to show there were plenty of Gnostics in Edessa. Whoever despises the expectations of [his] last [days] And mourns [his] first [days]— He shall have a goodly latter end. “The sentiment, that only the man who scorns long life and repents of his youthful errors may deem himself worthy of life after death, is expressed skillfully.” (J. B. Segal, Edessa: The Blessed City, p. 34).","date":"2014-02-11","mins":"9:02 am","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77595","author":"david_roemer","post":"The Holy Shroud is an official relic, and making misleading historical and scientific statements about it is dishonoring the relic. For example, not mentioning that the blood marks are not smeared and hence a work of an artist is misleading..","date":"2014-02-08","mins":"8:30 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77582","author":"david_roemer","post":"I explain in #6 what I’ll be telling New Yorker’s if I am invited to give a presentation. I have a letter from Cardinal Dolan saying that I was “debunking” the Holy Shroud. I think the archdiocese has a duty to listen to my explanation of the science, theology, and history of the Shroud..","date":"2014-02-08","mins":"7:06 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77906","author":"david_roemer","post":"Gnostics venerated Jesus, and produced the Shroud for the same reason the gospel writers wrote about the Passion of Jesus..","date":"2014-02-09","mins":"8:38 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"},{"id":"comment-77852","author":"david_roemer","post":"No one knows how this was done. That is why the Holy Shroud is a reason to believe in Jesus. It is a sign..","date":"2014-02-09","mins":"4:34 pm","url":"https://shroudstory.com/2014/02/08/russ-breault-and-pastor-caspar-mccloud-discuss-the-shroud/","cat":"video","title":"Russ Breault and Pastor Caspar McCloud Discuss the Shroud"}]
