[{"id":"comment-3252","author":"chris","post":"Because the end is near.","date":"2011-06-20","mins":"11:19 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7855","author":"chris","post":"I also see a lot of claims for things like flowers and writing that I personally don’t see when I look at the shroud or it’s photographic negative. I do see a lot of the details that some people point out, for example, teeth in the mouth. However, I am not quite sure if those teeth are actually teeth that are partially revealed in some way through what I perceive to be closed lips or just noise from the shroud itself. I have a hunch they’re noise but am open minded. I also do clearly see the hand bones but I am not sure why – did Jesus have very little body fat and his bones shown through his hands like I’ve seen with some older folks? That seems plausible to a degree even without knowing the probable mechanism of image creation. The abnormally long fingers on the right hand seems to be a distortion caused be the tenting effect of the left leg being raised. But as for flowers, words and secret symbols I am of the mind that if they are not as plain, visible and discernable as the image of the man himself they are probably just noise..","date":"2012-02-02","mins":"9:38 am","url":"https://shroudstory.com/2012/02/02/luciano-buso-whats-the-point-of-denying-my-theory/","cat":"art","title":"Luciano Buso: What’s the point of denying my theory"},{"id":"comment-11894","author":"chris","post":"Are there other scenes of a naked Christ in medieval art? These all seem to show what’s on the shroud, it’s all the same burial scene. It could be that the shroud was the inspiration for all these. To show that there was no taboo against showing a naked Christ I would think you’d have to see diverse and multiple depictions of it. If this is it I don’t think anyone should doubt there was a taboo..","date":"2012-06-04","mins":"11:42 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11899","author":"chris","post":"Carlos, that would seem significant. I think it should be further studied to see how significant. I would think you’d need a lot of art historians etc to contribute and it would time quite a bit of time to come to a conclusion..","date":"2012-06-04","mins":"12:13 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-8331","author":"chris","post":"Colin, the reference is something Peter used to highlight the abject terror that was in the hearts of Jesus’ followers, nothing more. When they all fled the guards happened to grab this man’s cloak and tore it off him as he ran. He was so scared of getting caught up in Jesus’ arrest he didn’t care about losing his clothes. Remember Peter is reading from Matthew here and he omits the portion about the scriptures because his audience is a group of Romans and the reference would be lost on them so he mentions a small detail that highlights the fear instead. His audience could definitely relate to the fear that a group of guards would instill. You will catch Peter doing this here and there in Mark’s accounting because he is remembering details or filling in details as he preaches to the Romans while reading from Matthew and Luke..","date":"2012-02-15","mins":"7:17 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8334","author":"chris","post":"Dave, I am very familiar with Markan Priority Theory. It’s a dying theory as it does not agree with the historical record, tradition, nor it’s own literary analysis. It is riddled with inconsistencies and flaws which cannot be easily explained and rely on itself for explanation. Scholars are starting to discard it and return the the Clementine tradition which predates the Jerome Tradition. The conclusion is that Matthew wrote first almost immediately after the Resurrection followed by Luke. Peter probably had both scrolls in front of him as he preached in Rome and Mark transcribed Peter’s words verbatim (as the historical record indicates) thus explaining the poor Greek of Mark (Peter does not speak Greek very well since it is not his first language). So Mark is third as the historical evidence alludes. Q doesn’t exist as it’s understood and is probably actually just Matthew in Aramaic. John wrote last to combat heresy. A lot of scholars don’t accept this yet but the numbers who do are growing because suffice it to say that the overwhelming bulk of the evidence comes down in favor of the Clementine Tradition and the Church Fathers..","date":"2012-02-15","mins":"9:18 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8355","author":"chris","post":"Dave, thanks for the reply, I appreciate it. It’s a fascinating subject indeed. We’ll just agree to disagree. As for Colin’s analysis, I think either way he’s making a mountain out of a mole hill. It’s just a detail that Peter remembers about someone running away. Peter spoke poor Greek and grasped at the word needed to describe the clothing, nothing more. Mark also was a Semitic and also spoke poor Greek so he just copied it down when Peter said it. The Gospels are chock full of miracles because these guys wanted you to believe Jesus was the real deal. If there was any hidden meaning via a foreshadowing of the supernatural behind the guy who ran away I think Peter would have said more. He inserts this detail memory and then goes back to reading Matthew’s account. Besides Jesus Himself does plenty of foreshadowing of His own death and Resurrection no need for a cryptic detail like a man dressed in a burial shroud to convey some hidden meaning. Being dressed in a burial shroud doesn’t make sense, even in this context. His audience is foreign to him but he picks a universally understood emotion, especially in the ancient world – abject fear, to convey the context of the situation. The other thing it highlights is that if they were so terrified then but are boldly preaching now there must be some real truth to what these guys are saying about the Risen Lord walking out of the tomb if they’re not afraid of the prospect of death by execution to tell folks about this story. On the whole of Peter’s account he is showing that from fear to no fear the story they are preaching is real..","date":"2012-02-16","mins":"11:12 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8405","author":"chris","post":"Easy Dave, there’s enough room for Matthew and Luke Priority theory. There’s a boatload written about the subject as there is about Markan Priority. There’s good and there’s bad regarding both theories, one has to distinguish between them. We’re not going to change anyone’s mind here about that but it is refreshing to see folks like yourself here who are well read and using that knowledge to help our understanding of the shroud in history. For that I am grateful..","date":"2012-02-17","mins":"11:11 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8451","author":"chris","post":"Dave, thanks for this. There is a website by a guy by the name of Dennis Barton that neatly sums up a different point of view. This is not the appropriate forum to discuss it here but it makes for good reading. Hope you enjoy and thanks again..","date":"2012-02-19","mins":"12:59 am","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"},{"id":"comment-8594","author":"chris","post":"Found Dennis’ site. It’s high level but presents the main arguments. Hope you enjoy. Http://www.churchinhistory.org/pages/booklets/authors gospels 1.htm.","date":"2012-02-21","mins":"3:40 pm","url":"https://shroudstory.com/2012/02/15/the-shroud-of-turin-a-pale-shadow-of-its-former-glory/","cat":"art","title":"The Shroud of Turin: a pale shadow of its former glory?"}]
