[{"id":"comment-12786","author":"chris","post":"Dear Heavens, he does reach, doesn’t he?.","date":"2012-06-20","mins":"11:01 am","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-14449","author":"chris","post":"I think this constitutes hysteria, not science. A simple call for another test to either corroborate Adler et al’s findings or challenge them based on whatever valid reasoning would suffice and be honorable. But given the hysterical behavior on display it can be a foreseen that no conclusion that points to authenticity will be accepted and all such observations for authenticity are the product of a conspiracy at worst or like minded blindness at best. There can be no conclusion contrary to the opinion of the hysteric..","date":"2012-08-03","mins":"12:49 pm","url":"https://shroudstory.com/2012/08/03/did-the-bloodstains-really-precede-image-formation-on-the-shroud-of-turin/","cat":"blood_studies","title":"Did the bloodstains really precede image formation on the Shroud of Turin?"},{"id":"comment-39023","author":"chris","post":"Agree with Dave B. The real testament to the truth of the Resurrection lies in the fact that these Apostles spread out over the known world at the time and fearlessly faced martyrdom without even the slightest inclination to recant what they had saw. It doesn’t make sense to me that anyone who is knowingly spreading a lie about Eternal Life (professing to have witnessed a miraculous physical Resurrection as proof of that truth) as offered by Jesus would willingly suffer martyrdom. In fact, if Jesus did not rise from the dead they would have had no impetus to do anything. To them He would have been just another well meaning guy who got executed by the jealous powers at that time. No proof, really, that anything He said about Eternal Life was true. Why bother to leave everything to spread the Word? Missionary work was an unbelievably harsh life let alone life threatening when a hostile audience was encountered. There was no self enrichment incentive it was just brutal work. People who supposedly have had their Faith requirement disburdened from them just don’t do that sort of thing..","date":"2013-07-15","mins":"11:15 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-38906","author":"chris","post":"I was waiting for this. This is excellent information. However, I’d love to see a peer reviewed graphically illustrated paper showing the effects of removing a shroud at different phases of decay. How valid would it be may depend on the state of the cadavers used so this may be an impediment. But still if it could be done in an ethical and relevant way I’d like to see it..","date":"2013-07-11","mins":"7:39 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-39986","author":"chris","post":"I am not sure. Yannick, Hugh, Ron et al make many good points. I’ve always thought that the body was unwashed because the most obvious blood flows are still present (down the arms). The Gospels mention Jesus was redressed after the scourging and crowning. I assumed that the garments he was redressed in became covered in this blood and clots. When He was stripped again at the crucifixion wouldn’t everything be dry? If so how would crucifixion open these wounds?.","date":"2013-07-28","mins":"8:40 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-9913","author":"chris","post":"Getting back to the original theme of Dan’s post I agree that the evidence of the Passion left upon the shroud is something worth meditating on for all Christians. It not only reflects the accuracy of the Gospels’ accounts but it also reflects the sinfulness that caused Christ’s suffering. Most importantly, it shows the length Jesus went to in His suffering to show us how much He loves us. Looking at the wounds inflicted upon Him I imagine what it must have felt like, the excruciating pain and humiliation. It is truly humbling to know that He who made the Heavens and the Earth was willing to go through this just to show us how much He loves us. It is also very disheartening to reflect on the cruelty and hate humanity is capable of when it refuses to embrace the uncomfortable truth. This is the meaning of Original Sin. Another thing I like to reflect on is that our current state of knowledge tells us that the universe is not infinite (John Klotz may agree with this point), it will most definitely end at some point and everything we know and see will cease to exist. Therefore, even if man should unlock the biological secret to perpetual life without aging no one will live forever, they will merely put off the day of reckoning. Our position is truly temporal in this realm. Jesus rescues us from that with the demonstration of Eternal Life through the Resurrection but He gets us there by also demonstrating that our death is also temporal. The shroud is the document of His death, it’s current emptiness begets the Hope of His Resurrection and with it our own invitation to Eternal Life..","date":"2012-04-03","mins":"10:43 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9928","author":"chris","post":"It’s mine, Dave, but feel free to repeat it far and wide. The more of us who get the message the better off humanity is to greater glory of His Name..","date":"2012-04-03","mins":"6:55 pm","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-8418","author":"chris","post":"Ron, I read that and it was impressive but I am not sure what to think in the end. Part of me says Jesus would have a LOT of blood on him after the scourging and crucifixion but there doesn’t seem to be a corresponding amount of blood on the shroud as I would theorize there would be. In this sense I can agree with Zugibe but I am not a forensic expert in this regard and therefore don’t really know. But then there seems to be some blood left over from the crucifixion like the blood on the face, head and the arms. Part of me wonders if there was a quick wash with a wet cloth over most of the body along with a hasty wrapping in the shroud with the intent to finish the job on Sunday. The Gospels are not clear about when the spices were to be applied despite Max’s assertions. I tend to think what generally happened was Jesus had a hasty burial that was to be completed after the Sabbath on Sunday. I also wonder if that strip down the side of the shroud was used like John Jackson supposes which is to say it tied up the whole body or if in the case of a hasty burial where the ritual spices were to be used later it was used just to tie the arms in place to hold them down. It could then be easily untied and the burial ritual could be continued and completed fairly easy. One thing I’m coming away from this discussion is that it’s definitely real blood on the shroud regardless of the color of it. It’s really just a matter of determining what mechanisms make for the color. Truthfully, I was never really swayed about the bright red color objection from skeptics because anecdotally I’ve had plenty of bandaids come off my own body and the blood has remained bright red even after days. Don’t know how valid that is but it struck me as more probable that the blood in the shroud is authentic even with the color of the blood being so bright..","date":"2012-02-17","mins":"10:18 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8440","author":"chris","post":"Good observations! Yeah, I’m starting to think we’re closer to the truth than not. One thing I thought was a really interesting detail that Jackson pointed out in his video was the bloodstain off the right elbow and how it corresponded with the shroud being tucked under the arm during wrapping. Not a detail that speaks to forgery is it? But it certainly is indicative that the shroud was wrapped in some way instead of just loosely laid over the body. Also, there not being any traces of spices seems to negate Max’s assumptions though I respect that it was probably the intended burial ritual. I don’t think they had time to execute it and it seems very involved. I would also think that there would be more capillary evidence on the shroud with the blood spanning out had it been soaked. The blood on the hair doesn’t really bother me as I think Jackson is right when he supposes that it was not really on the hair but on the sides of the face and the cloth came away before the image was made. If the strip was used only to tie the arms to keep them from spanning out during rigor mortis then someone may have smoothed the shroud over the head and it eventually moved away or collapsed due to not being tensioned or tied. Pure conjecture on my part, but it crossed my mind..","date":"2012-02-18","mins":"1:45 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8495","author":"chris","post":"The last time that was famously used it didn’t work out too well for the person who quoted it..","date":"2012-02-19","mins":"11:18 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8534","author":"chris","post":"And who is speaking here? The pot or the kettle?.","date":"2012-02-20","mins":"11:01 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8546","author":"chris","post":"Then let her speak for herself..","date":"2012-02-20","mins":"2:09 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8233","author":"chris","post":"Fascinating discussion. I would like to see if there’s anything that discusses what methods were used on the acnient blood in both cases to avoid getting false postives for different blood types. If all the known precautions were taken it would seem that any conclusions made would be strong. However, there doesn’t seem to be anything along that lines published for laymen, yet..","date":"2012-02-14","mins":"11:13 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-38732","author":"chris","post":"Wouldn’t the possibility of blood being added on later be precluded by the fact that it’s not whole blood but blood from exudated blood clots? And also wouldn’t the speculation that the blood probably came before the image (since there is no observed image under the blood stains) also preclude this?.","date":"2013-07-08","mins":"11:29 am","url":"https://shroudstory.com/2013/07/06/reader-has-jackson-come-to-realize-this/","cat":"blood_studies","title":"Reader: Has Jackson come to realize this?"},{"id":"comment-25835","author":"chris","post":"If it is observed accurately that the bloodstains in the hair are actually aligned with the sides of the face or the temples of the shroud Man and not with the hair does that suggest that the blood transfer mechanism happened at a different time than the image forming mechanism? Before perhaps? I say this because the cloth had to be touching for the blood transfer on the head to have happened – how long might that take in a humid sepulcher? It would seem to follow that the image formation process had to kick in after the cloth came away from the head perhaps as the bindings came loose? Does it seem possible that they acted simultaneously? If they did wouldn’t the image on the face be more distorted and far less focused because the cloth would necessarily need to be against the sides of the head for a lot of the image forming time? The cloth would also have to be in motion, even if ever so slowly, to allow the blood stains to come away from the head and register in the hair image. I would think that would produce major distortion and lack of focus. Complete speculation of course. If they could not have happened at the same time I wonder how long each process took. And what kind of clue would this be in the image formation process?.","date":"2013-02-27","mins":"2:44 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-13885","author":"chris","post":"Ron : Now Colin is an expert in blood…unbelievable! Question is why Dan keeps rehashing this Sciencebod. R Ron, what I find interesting in Colin’s approach to many of these matters is his stance that many of the scientists were working out of their specialization (heretical is the term I think was mentioned) but he has no problem approaching matters out of his own specialization. Personally, I find nothing wrong with most scientists working out of their specialization so long as they’re wide open to have others scrutinize their work (especially scientists who are specialized in the field of study). This is how we all learn. It’s not a entirely valid argument in itself to criticize someone outside of a specialization unless one can conclusively show that such ignorance on it’s face is the cause of faulty findings. The work on the shroud is no different than work in other areas, you will have good hypotheses and bad hypotheses. It is up to the participants and the audience to sort them out together. It is clear to me that the shroud keeps Colin up at night, as I have stated before. I also think it also drives him to espouse some of his more biased arguments. In general though it is good for even folks from his point of view to look at and opine on these matters as it gives a different perspective which may be very valuable. It’s just that, as with all perspectives and approaches, the audience has to separate the faith and pure speculation from fact..","date":"2012-07-15","mins":"7:51 pm","url":"https://shroudstory.com/2012/07/15/why-not-carbon-date-the-blood-on-the-shroud-of-turin/","cat":"blood_studies","title":"Why not carbon date the blood on the Shroud of Turin?"},{"id":"comment-13898","author":"chris","post":"Yannick, I think it bothers a whole lot of folks that is might be real. This life is temporary in all cases. I think a lot of folks want this life to be the only one though because they love it and that is at direct odds with Jesus’ instruction: “He who loves his life will lose it. He who hates his life in this world will keep it to eternal life.” It’s all the trouble of letting go. The best we can do is to pray that they allow His Grace in to do it’s job and impart the Peace that the world cannot give..","date":"2012-07-16","mins":"12:00 pm","url":"https://shroudstory.com/2012/07/15/why-not-carbon-date-the-blood-on-the-shroud-of-turin/","cat":"blood_studies","title":"Why not carbon date the blood on the Shroud of Turin?"},{"id":"comment-14383","author":"chris","post":"Bravo, Yannick! Another excellent article..","date":"2012-08-01","mins":"10:19 am","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"}]
