[{"id":"comment-11035","author":"chris","post":"I think it might be good for scientists to review Rogers’ method of dating using the lignin method. It might be good to know if there are any circumstances that could skew that result. We already know Rogers came up with a date far older than the carbon dating, it would be good to see other’s corroborate this work in this area..","date":"2012-05-01","mins":"10:58 am","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-37484","author":"chris","post":"He’s as bad as the Kennedy conspiracy theorists. Red Herrings abound. In the end they are merely bolstering their faith. Christianity doesn’t need the shroud, it’s a “nice to have”. Even if the shroud is authentic it doesn’t prove anything other than that Jesus was crucified in the manner the Gospels indicate. I can see for some people it could be an alarming thing to even have to acknowledge the existence of Jesus because it then starts to lead down a road they are not comfortable traveling so we have the fevered attack on the shroud. Even acknowledging Jesus as a real person (though ample historical evidence abounds) is tough for some of these folks – it’s a hard stop at reality. If the shroud can be discredited then it puts off the day they will have to confront any implications it’s reality and authenticity presents..","date":"2013-06-20","mins":"2:20 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-34122","author":"chris","post":"There are many that come to the shroud to confirm their faith – Colin is among them..","date":"2013-05-20","mins":"10:33 am","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","title":"Dog in this fight or pony in this race?"},{"id":"comment-174484","author":"chris","post":"There’s a white spot where the supposed loin cloth was??? Where?.","date":"2014-12-03","mins":"12:38 pm","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"},{"id":"comment-174652","author":"chris","post":"I have come to the conclusion that the claim is pure gaslighting..","date":"2014-12-04","mins":"3:24 pm","url":"https://shroudstory.com/2014/12/03/jerry-coyne-pope-francis-endorses-the-fake-shroud-of-turin/","cat":"carbon_14_dating","title":"Jerry Coyne:  Pope Francis endorses the fake Shroud of Turin"},{"id":"comment-10931","author":"chris","post":"I believe Ray Rogers said that any further C14 dating of the shroud would be impossible because of the preservative that is now used to keep insects from damaging it. It is an organic insecticide, I think, and cannot be removed during any cleaning process so it will always be a contaminant and will always skew the C14 results. If that is true you can forget any future testing of the main cloth. I think he said the only thing left to test is the charred bits removed during the restoration as they were removed before the new chemical preservative was used..","date":"2012-04-28","mins":"9:56 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-11034","author":"chris","post":"This is picking a debate with a dead man. It’s a little hard to swallow too especially since Rogers’ observations have been corroborated to some degree..","date":"2012-05-01","mins":"10:44 am","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-8838","author":"chris","post":"Colin, it’s only 200 nm thick, c’mon let’s get with the program. If gold leaf can be achieved at this thickness this should be no problem for a retired science bod with a heck of a lot more education and resources at his disposal than a medieval artist..","date":"2012-02-29","mins":"8:43 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","title":"Paper Chase: To know a veil by Philip Ball"},{"id":"comment-8808","author":"chris","post":"Colinsberry : This “contamination” defence is now standard in our courts of law, and it relies on the truism that “one cannot prove a negative”, placing the burden of proof on the litigant. Anyone deploying so shoddy and disreputable a defence argument – on websites as well as courts of law – without strong evidence to back it up can be certain of earning at least one individual’s undying contempt, not that anyone will notice… Yeah, kind of like a person claiming the image on the shroud is a scorch without any proof and even in the face of evidence to the contrary. Then the same person charging others to prove it’s not a scorch in order to refute him..","date":"2012-02-28","mins":"6:49 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","title":"Paper Chase: To know a veil by Philip Ball"},{"id":"comment-32800","author":"chris","post":"Now this is a fascinating discussion. Hope we get more of this..","date":"2013-05-03","mins":"8:00 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"id":"comment-8980","author":"chris","post":"Colinsberry :. . . And I might feel more inclined to talk to you, rather than at you… Colin, this is what you have done from day 1 here – talk at people. It’s plain to see you’re not interested in actual scientific exchange otherwise you would have accepted to join the other scientists in their association when offered. You won’t go there and debate them, you’d rather stay here and beat laymen over the head with your knowledge of science. Make you feel good? Why don’t you pick on someone you’re own size, huh? You don’t because you probably know you’ll get run out of town on a rail and therefore won’t dare tread amongst minds as keen as you fancy you’re own. Nice of you to pick on dead men as well, so honorable. One needn’t be as knowledgeable as the person who’s conning him in order to realize he’s being conned. The fact that you constantly talk with forked tongue about how easy it would be for a forger to have made the shroud and how all it’s observed characteristics are nothing to be in awe of but yet you refuse to undertake the effort to reproduce it speaks volumes about what you’re real intentions are here. It’s all so easy, just a bunch arts and crafts until you’re asked to get in the arena and reproduce it. The thought of actually having to turn something out which will then come under the withering scrutiny of other scientists probably gives you hives. You’d rather burn a few trinkets into a cloth, blithely declare it’s a fair demonstration and call it a day. Then comes the endless leaving, but not leaving and the carping about having to deal with us. But you can’t stay away. I think you love it and not for good reasons. And when all this bad behavior is pointed out to you, you cry “Ad hom, ad hom! No fair!” What are folks to make of you when you act this way? What kind of respect is anyone supposed to give a grown man, who is retired no less, who only likes debating his inferiors in matters of his discipline? You’re indignation at our responses is laughable. I don’t know what you expect to achieve at this point but in my opinion it’s moot. Good day to you..","date":"2012-03-05","mins":"8:58 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-8952","author":"chris","post":"I think the labs must have been employing the “Suck it and see it” method in order to debunk the Mickey Mouse science on the Euro Disney Shroud. Makes sense..","date":"2012-03-05","mins":"10:49 am","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"},{"id":"comment-8967","author":"chris","post":"Ron, he knows he can’t reproduce it. He’s an intelligent man and deep down inside he knows how long the odds are that he’s right. Something in the way he goes on tells me it may be that he needs the shroud to be fake far more than we want it to be real..","date":"2012-03-05","mins":"5:01 pm","url":"https://shroudstory.com/2012/03/05/you-must-be-kidding-colin-berry/","cat":"carbon_14_dating","title":"You must be kidding, Colin Berry"}]
