[{"id":"comment-8435","author":"chris","post":"In theory there is no difference between theory and reality. In reality there is..","date":"2012-02-18","mins":"12:20 pm","url":"https://shroudstory.com/2012/02/18/a-new-hypothesis-leapfrogging-luigi-garlaschelli/","cat":"image_theory","title":"A New Hypothesis: Leapfrogging Luigi Garlaschelli"},{"id":"comment-7866","author":"chris","post":"Colin’s sandbag theory seems like “Belling of the Cat”..","date":"2012-02-02","mins":"2:10 pm","url":"https://shroudstory.com/2012/02/01/a-new-theory-for-how-the-turin-shroud-was-faked/","cat":"image_theory","title":"A new “theory” for how the Turin Shroud was faked"},{"id":"comment-7876","author":"chris","post":"Tut, tut, Colin! You’re supposed to be “not responding” for a week! Back to the lab with you!.","date":"2012-02-02","mins":"3:20 pm","url":"https://shroudstory.com/2012/02/01/a-new-theory-for-how-the-turin-shroud-was-faked/","cat":"image_theory","title":"A new “theory” for how the Turin Shroud was faked"},{"id":"comment-8729","author":"chris","post":"Dan, you have to admit Colin has been very entertaining. And the old boy did try something though he came short of actually stepping in the arena. And even though all his experiments were invalid and he proved nothing he did put on a good show..","date":"2012-02-25","mins":"5:11 pm","url":"https://shroudstory.com/2012/02/25/bertrand-russell-comes-to-mind/","cat":"image_theory","title":"Bertrand Russell comes to mind"},{"id":"comment-8813","author":"chris","post":"Colinsberry : Only the dyed in the wool (thread?) denialista of the Shroudie world swallow the tale about invisible reweaving, spliced threads, alizarin dyed new threads etc… Oh, how grand, we’re starting to see true colors. Colin, tut, tut! Such ad hom from someone who so vigorously protests such arguments. Seems like there’s more evidence for the patch theory than the scorch theory..","date":"2012-02-28","mins":"9:37 pm","url":"https://shroudstory.com/2012/02/25/bertrand-russell-comes-to-mind/","cat":"image_theory","title":"Bertrand Russell comes to mind"},{"id":"comment-8798","author":"chris","post":"Ron, he’s just upset because he wasn’t able to prove anything and I think he notices that people are starting to get the notion that they ought not to take him seriously. Notice he keeps prattling on and on about it being a scorch without actually demonstrating that it is. It’s a shell game and he likes the attention..","date":"2012-02-28","mins":"11:00 am","url":"https://shroudstory.com/2012/02/25/bertrand-russell-comes-to-mind/","cat":"image_theory","title":"Bertrand Russell comes to mind"},{"id":"comment-16403","author":"chris","post":"I think he might be in a war with his heart..","date":"2012-09-17","mins":"1:07 pm","url":"https://shroudstory.com/2012/09/16/better-than-david-rolfes-dawkins-challenge/","cat":"image_theory","title":"Better than David Rolfe’s Dawkins Challenge?"},{"id":"comment-21793","author":"chris","post":"Nit picking is his only avenue since he cannot reproduce the cloth..","date":"2013-01-09","mins":"1:48 pm","url":"https://shroudstory.com/2013/01/08/colin-berry-takes-on-banding-and-more/","cat":"image_theory","title":"Colin Berry Takes On Banding and More"},{"id":"comment-11580","author":"chris","post":"Every time I read Yannick’s long posts it confirms a lot of what I have read and have speculated in my private mind – not all of it, but much of it. I also get the sensation that we all should be handed a diploma..","date":"2012-05-24","mins":"7:34 pm","url":"https://shroudstory.com/2012/05/21/creative-comment-of-the-day-by-colin-berry/","cat":"image_theory","title":"Creative Comment of the Day by Colin Berry"},{"id":"comment-8493","author":"chris","post":"Let Colin go on. I have a suspicion that through the absurdity of his arguments he may wind up showing the Resurrection was more probable..","date":"2012-02-19","mins":"10:58 pm","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-8533","author":"chris","post":"And here we have the crucial admission that it can’t be done. Sorry folks there’s nothing to see here and you won’t be seeing any arts and crafts to demonstrate these castles in the sky. He’s too intimidated to actually get in the arena. It’s up to everyone else to prove his negatives..","date":"2012-02-20","mins":"10:58 am","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-8542","author":"chris","post":"Colinsberry :Shame. Just when I was starting to warm (again) to this site. Time methinks to take another break (during which Dan will maybe see fit to lift the pre moderation on my comments too). Well, what do you expect? You have all these great ideas but not the will to demonstrate them? You are full of hubris yet very shy when you’re own words are trained back upon you to show the fly in your ointment. You want love and respect, show a little. I’m all for rigorous debate on the scientific merits but gosh, at some point you gotta show something beyond mere words..","date":"2012-02-20","mins":"1:20 pm","url":"https://shroudstory.com/2012/02/19/i-dont-get-it-writes-a-reader-about-colin-berrys-hypothesis/","cat":"image_theory","title":"I don’t get it, writes a reader about Colin Berry’s Hypothesis"},{"id":"comment-9250","author":"chris","post":"Less dictating and talking at people and more independent review of your claims, please..","date":"2012-03-12","mins":"9:55 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","title":"Irene Corgiat’s Shroud of Turin Image"},{"id":"comment-8927","author":"chris","post":"Dr. Jackson, Thanks so much for your note. Great reading and very informative. To Colin’s experiments is it possible the medieval forger used a giant onion when making his forgery? Think of all the excellent French onion soup he could have made with the leftover parts! ; ).","date":"2012-03-04","mins":"3:24 pm","url":"https://shroudstory.com/2012/03/04/john-jackson-on-colin-berrys-highly-misleading-comments/","cat":"image_theory","title":"John Jackson on Colin Berry’s “highly misleading” comments"},{"id":"comment-16512","author":"chris","post":"I read somewhere that there is a body image on a burial tunic. I can’t put my finger on it right now but perhaps more study of that image might yield some clues? I wish I could recall it now..","date":"2012-09-19","mins":"1:00 pm","url":"https://shroudstory.com/2012/09/18/latest-on-david-rolfes-site-on-maillard-reaction/","cat":"image_theory","title":"Latest on David Rolfe’s Site on Maillard Reaction"},{"id":"comment-20146","author":"chris","post":"He is chasing rainbows. One day he shall rest..","date":"2012-12-10","mins":"1:10 pm","url":"https://shroudstory.com/2012/12/05/monsieur-the-scorch/","cat":"image_theory","title":"Monsieur the Scorch"},{"id":"comment-138945","author":"chris","post":"Was it finger lickin’ good? (couldn’t resist).","date":"2014-07-17","mins":"1:15 pm","url":"https://shroudstory.com/2014/07/17/nutellagraph-did-sturp-check-for-nutella-and-butter-knife-strokes/","cat":"image_theory","title":"Nutellagraph? Did STURP Check for Nutella and Butter Knife Strokes?"},{"id":"comment-13796","author":"chris","post":"Shroudenigma : Nothing I say should suggests anything but the deepest respect for Ray Rogers. Neither does it follow that my criticism of the Maillard hypotheses indicates favoring any other particular image formation theory. The fact is that nowhere in history or indeed today can anyone point to any kind of image produced by a Maillard reaction. If its supporters deem it possible to create a 14ft evenly graduated image of both sides of a corpse then they should be able to show, say, a 6 inch version of anything. Until they can, I suggest that time spent theorizing and eulogizing would be better spent making one. This is reasonable and I think Rogers would agree. In short we need more experimentation with this hypothesis. I think Rogers hypothesis of a Maillard reaction is the most plausible but we need scientists to actually pursue it to see where it leads..","date":"2012-07-12","mins":"7:43 pm","url":"https://shroudstory.com/2012/07/11/rejecting-all-the-energetic-hypothesis-for-the-shroud-of-turin-image/","cat":"image_theory","title":"Rejecting all the “energetic” hypothesis for the Shroud of Turin image"},{"id":"comment-7640","author":"chris","post":"Ron, I’m beginning to think all he wants to do is talk and drive traffic to his own site by biting off Dan’s more popular blog. It’s a known technique for those managing less popular topics on their own site to drive traffic their way (this is rampant in political blogs). For all his claimed credentials he keeps missing minor details (like scorches fluoresce) when he makes his assertions. You would think that someone of his claimed caliber would pick up on the details before he makes his claims instead he says he has, ah, what did he call them?, “senior moments”. I can understand those but they seem too convenient in this context. Last week it was a cadaver that made the shroud, this week it’s bas relief with scorches, next week – who knows? One things seems near certain about his assumptions – it cannot be what it simply purports to be – an actual burial cloth that may have an image on it from a natural phenomenon, hence the swags. He’s grasping at straws. And when constructive criticism is leveled his response is more or less that someone else is blind, not him. It’s a pattern. It reveals, I think, something more about him than anything about the shroud. He can claim anything he wants with regard to his experiments as it is the internet but until he puts forth something that can be put in the hands of others and his work can be reviewed by peers the rubber has not met the road so to speak. Until then he might as well be the wind howling. I wish him peace and good will in his life..","date":"2012-01-28","mins":"2:29 pm","url":"https://shroudstory.com/2012/01/26/sciencebod-reacts/","cat":"image_theory","title":"Sciencebod reacts"},{"id":"comment-7609","author":"chris","post":"Well, looks like you’ve definitely convinced yourself, Colin. The only thing left to do is create a Euro Disney Shroud with all the gee whiz features from your arts and crafts skills and submit it for analysis. Should be easy now that you’ve got it all figured out. And now that you’re retired you should have plenty of time to get it right and put everyone in their place. Good luck..","date":"2012-01-27","mins":"6:22 pm","url":"https://shroudstory.com/2012/01/26/sciencebod-reacts/","cat":"image_theory","title":"Sciencebod reacts"},{"id":"comment-7714","author":"chris","post":"It may be appropriate to say that the effect of the process which created the image is 3 D encoding even though we do not know the exact mechanism of image formation. Does anyone know if tests were ever done with cadavers (morbid, I know) wrapped in shrouds (made like Ray Rogers had made)? I can’t find anything with regards to that. I don’t know how feasible such experiments would be but I’d be curious to see if by replicating the conditions of the burial with several specimens and examining the shrouds at different time intervals if anything might be learned..","date":"2012-01-30","mins":"2:00 pm","url":"https://shroudstory.com/2012/01/30/sciencebods-3d-problem/","cat":"image_theory","title":"Sciencebod’s 3D Problem"},{"id":"comment-10454","author":"chris","post":"Personally, I’m not so sure there AREN’T any eyebrows as I see faintly what I would consider could be taken as eyebrows..","date":"2012-04-16","mins":"1:29 pm","url":"https://shroudstory.com/2012/04/16/the-image-on-david-rolfes-website-absence-of-eyebrows/","cat":"image_theory","title":"The Image on David Rolfe’s Website:   Absence of Eyebrows?"},{"id":"comment-48252","author":"chris","post":"Meh, I’d be happy if someone well versed in ancient blood characteristics weighed in..","date":"2013-10-21","mins":"11:07 am","url":"https://shroudstory.com/2013/10/21/todays-how-do-we-know-the-image-is-not-painted/","cat":"image_theory","title":"Today’s How do we know? The image is not painted"},{"id":"comment-90086","author":"chris","post":"Forgive me if, as a layman, this sounds naive but if the image were a scorch then the image and the known scorches on the cloth of the same faintness should have the same characteristics, right? Given that the premise is that the cloth is of medieval origin then all the scorches, including the proposed image scorch, would be the same age. It should be a simple comparison that might lay the question to rest immediately if they are not comparable. And hasn’t this been done with Barry’s photography? All the known scorches fluoresce, correct? Yet the image does not, correct? If the image were a scorch of the same age and suffered the same effects of time, handling, etc then it should fluoresce like the others which are of the same intensity, right? If it doesn’t fluoresce then it’s not a scorch like the others. It’s tough to explain away the difference in characteristics. If the image were a scorch I’m thinking you would at least see some fluorescing, even intermittently, somewhere in that image..","date":"2014-03-17","mins":"12:59 pm","url":"https://shroudstory.com/2014/03/14/two-comments-promoted-colin-berry-has-cracked-the-shroud-enigma/","cat":"image_theory","title":"Two Comments Promoted:  Colin Berry Has Cracked the Shroud Enigma?"},{"id":"comment-8061","author":"chris","post":"After reading much on this after Helmut’s urging it became abundantly clear to me that the mattress image was most likely a contact image made by blood highly influenced by the cocktail of chemicals administered to the patient. For lack of a better phrase it seems to be a fused stain. This was evident to me by the fact that in image area scrapings blood constituents were detected on the fibers while non image area scrapings did not show any blood constituents on the fibers. The mattress image in my understanding is not comparable to the shroud image because it does not have the same physical and chemical properties. What is also implied by what I read about the mattress image was that the person need not have been alive when the image on the mattress was formed. I found that interesting because Helmut does believe that a live body is what was needed to make the shroud image. I find the unsmeared state of blood stains on the shroud to be evidence against this as I believe Helmut held forth that Jesus’ crucifixion survival would have been uncovered rather quickly while preparing Him for burial. And at that point Jesus would have been secreted away for recovery. I would think that the shroud would look highly smeared would that have been the case and in that case that Jesus survived in the tomb for any length of time the shroud would have been soaked with far more blood than we see. Either way, the mattress image is irrelevant..","date":"2012-02-08","mins":"2:53 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"},{"id":"comment-8055","author":"chris","post":"I do not know what caused the image on the shroud but I know it shows the Passion of Christ. I am inclined to suspect that the image was a product of a natural phenomenon as yet not understood (also, didn’t Rogers rule out a scorch?). I am inclined to believe that the shroud does not show the Resurrection but I am in awe of the fact that we have an artifact from the most famous execution in all Man’s history documenting it. The fact that you have such tangible evidence from this historical event should make anyone pause to reflect what the probabilities are that we would have such an object from such a time. Is there a message that comes with such an improbable object even if it was formed naturally? One thing is clear, the cloth once wrapped a Body and that Body is now no longer wrapped in it. His followers testify that He walked out of the tomb under His own power and ascended to heaven before their very eyes. They were not afraid of death to spread that information. They had more than the gift of Faith, they knew what awaited them after this life..","date":"2012-02-08","mins":"12:47 pm","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"},{"id":"comment-23087","author":"chris","post":"Indeed, I think that for it’s time the shroud is overkill if it’s a forgery. As Yannick has pointed out the blood evidence alone would suggest authenticity as it is nearly inconceiveable that any medieval forger would have any incentive or knowledge to go to such lengths to create such an artifact. Given this the probability that this was created as a forgery in such detail – by accident – is extremely low..","date":"2013-01-31","mins":"11:45 am","url":"https://shroudstory.com/2013/01/31/how-could-a-medieval-mind-create-an-image-such-as-the-one-on-the-shroud/","cat":"uncategorized","title":"How could a medieval mind create an image such as the one on the shroud?"},{"id":"comment-34472","author":"chris","post":"I very much agree with this. The “why” will never be answered by science..","date":"2013-05-23","mins":"11:20 am","url":"https://shroudstory.com/2013/05/23/resurrection-what-happens-with-quantum-entanglement/","cat":"science","title":"Resurrection:  What happens with quantum entanglement?"}]
