[{"id":"comment-15076","author":"chris","post":"Just doing a google search on the matter I believe the XX claim comes from Frank Tipler a physicist. Supposedly the blood DNA on the shroud was analyzed with the results published in an “obscure Italian journal”. The results were a photocopy of the output of the analysis with no accompanying interpretation. Mr. Tipler claims to have been able to instantly interpret the data and the story it tells is that the DNA on the shroud came from an XX male which is completely consistent with a Virgin Birth. Fascinating to ponder but I wouldn’t put any stock in at all right now because in everything I’ve read I never saw a link or even a name reference to the Italian magazine it was supposedly published in. I did, however, see plenty of links to Mr. Tipler’s book (Physics of Christianity) where this is claimed. Perhaps he’s more forthcoming in his book, but I haven’t read it so I don’t know. I couldn’t find anything on Barry’s site except a reference in the British Society for the Shroud of Turin’s newsletter. That doesn’t mean that there’s not something more there just that I couldn’t find anything in the short search I did. If anything this is a far fetched claim that will need further study before it can even be considered. For what it’s worth overall this was a decent presentation but I think the presenter does get a few minor points wrong..","date":"2012-08-16","mins":"1:45 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-15097","author":"chris","post":"So apparently it is a exceedingly rare but a natural thing for a woman to pass on an XX genetic code with the Y gene imbedded in one of the X’s. From the very little I’ve read on this today it’s not a reach for this to happen. There’s something that’s called an “SRY” gene (I think) that gets turned on inside one of the X genes and it acts as the Y chromosome and at the same time the X gene it’s implanted in is “turned off”. This makes the person with this disposition a full male. I gather the gist of it is that he got that way by a round about approach. What’s being alleged is that this has been confirmed with the blood evidence on the shroud. I find it very hard to accept though because there is almost nothing to back up the claim. That and the fact that other scientists have claimed that the DNA on the shroud is too old and to fragmented to yield anything of worth make me very skeptical that any such information can be gleaned from the biological evidence left on the shroud. If it can be published, interpreted and reviewed in an acceptable scientific manner then it might be something worth looking at but otherwise I don’t see any merit to the claim. And I don’t think it wise that this lady should have included this claim in her presentation because it just cuts her credibility away to nothing. It does more harm than good to her cause of educating folks on the Shroud. Just my 2 cents..","date":"2012-08-16","mins":"8:08 pm","url":"https://shroudstory.com/2012/08/16/a-winning-shroud-of-turin-expository-speech/","cat":"news_&_views","title":"A Winning Shroud of Turin Expository Speech"},{"id":"comment-25165","author":"chris","post":"Pray his heart is opened..","date":"2013-02-21","mins":"11:54 am","url":"https://shroudstory.com/2013/02/21/atchity-isnt-exactly-a-fan-of-benedict-xvi-or-the-shroud-of-turin/","cat":"news_&_views","title":"Atchity isn’t exactly a fan of Benedict XVI or the Shroud of Turin"},{"id":"comment-19076","author":"chris","post":"Well, I pray as Christ did that we as one and not let politics intervene in our relationships with one another. That said, Rome will never accept female priests or bishops. Such ordinations (and there are those on the Catholic side as well who have attempted female ordination) are completely invalid and therefore they cannot effect any sacrament in Rome’s eyes. This will be a major stumbling block to any reunification. Hopefully there can be a solution that’s acceptable to both sides one day..","date":"2012-11-15","mins":"1:54 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19209","author":"chris","post":"I would just like to point out one thing with regards to Yannick’s assertion that Jesus would have been stoned to death. I think it might be a slight oversight on his part. I mean this will all due respect but it is an obvious mistake. The assertion that Jesus would have been stoned to death is patently absurd because it was the Risen Jesus that ordained the Apostles. He had already suffered death and was resurrected at that point. There was absolutely no chance that he would have been stoned. Remember He remained for quite a while among them after His Resurrection. He had absolutely no fear of any repercussion at this point and if He instructed His Apostles to ordain women as well as men I think they would have done it. After all none of them feared preaching the Gospel, which is Truth, even under fear of being murdered. And all of them were murdered, save one, in the course of preaching the Truth as the Risen Lord instructed them..","date":"2012-11-19","mins":"2:31 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19238","author":"chris","post":"Yannick Clément : Chris, you get me completely wrong, the so called “ordination” I referred to was when he choose his 12 disciples ! And don’t you forget that the Resurrected Jesus appeared to some women well before he appeared to the 12 apostles ! Don’t you think there is a sign there ? And don’t forget that it was as much impossible to Jesus to “ordained” some women after his Resurrection as it was before he died because the time was still no good at all for this kind of drastic change that would never have been accepted by the Jewish people of that era ! And I still wait for someone to challenge my main argument : IT IS A FACT THAT SOME WOMEN HAVE RECEIVED A CALL FOR PRIESTHOOD JUST LIKE MEN !!! Don’t you think this is another great sign of the Holy Spirit ? If God really wanted to keep women out of priesthood, don’t you think it would be logical to expect that no women would get a call from him ??? But that’s NOT the reality. The truth is the opposite. There really are some Catholic women who are called for priesthood ! And I don’t see one good reason to reject their call… Yannick, Yes, I understand all that but my point is that the argument that He feared stoning is exceedingly weak. The same Jesus that was bold enough to tell the priests of the time that whores will enter the Kingdom of Heaven before them, tell them that they are a brood of vipers, smash their monopoly in the Temple market place by physically over turning the tables and avoid, at Will, their attempts to arrest Him before the appointed time is not likely to be suddenly timid on the subject of ordaining women. Also, Jesus didn’t hesitate to raise the status of women to that of men when he told the priests and men of the time that they could no longer divorce women at will like a piece of mere chattel. I am not arguing either way only pointing out that the arguments being employed are untenable. Better arguments must be pursued. I find it also rather contradictory the attitude that it is ambiguous that Jesus actually ordained anyone versus the conviction that female ordination is absolutely what Jesus would desire. Again not arguing either way it’s just untenable to hold both views at the same time. Of course, if one held the view that no one is “ordained” only “called to serve” and that there is nothing conferred with Holy Orders/ordination it might be more consistent in some ways but it also begs the question of why should anyone care about ordination at all? Why even bother to expend any effort on this issue at all? Folks can just go and do what they feel is in their hearts (and many have) and ignore the hierarchy of the Church. My suggestion is that a strong legitimizing argument is only going to be found in the Traditions of the Communities in the early Church. More research may need to be done in order to establish this. Everything else is speculation and projection and more importantly will not win converts. More importantly, this attitude amongst some Christians, with regards to this issue, of ‘I am right, you are wrong’, ‘it’s my way or the highway’, ‘you’re not evolved’ etc etc etc is not productive in fostering relationships among us. No one is willing to entertain “what if my point of view is actually wrong on this issue?” That’s a problem for both sides. Is it not more important that we, above all, love one another even in the faults we see in one another? Yes, to me, it’s more important to learn to love like Him because it is in learning to love like that in this life, which is incredibly short in the vastness of eternity, which connects us to the Divine Love of the Risen Christ which in turn rescues us from our temporal condition. Beating each other up over political issues like this cannot get us closer to that and therefore cannot get us closer to Him..","date":"2012-11-19","mins":"11:45 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19100","author":"chris","post":"Dave, you are illustrating the very thing I am pointing out in my post: both sides are very passionate about this issue and seemingly it is a huge political stumbling block to healing relationships among Christians of all stripes. Each side believes the other is just going to have to back down. That’s not a solution. I don’t purport to have one but I think whatever solution comes about will have to begin with humility on all sides. It all begins with praying “not my will but Thine be done”..","date":"2012-11-16","mins":"1:08 am","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-19207","author":"chris","post":"So Dave, do you not have Faith that God will prevail? If any man is convinced of his position then pray God makes it so if it is His Will and leave it in His Hands. That’s what we are called to do, that is humility. It may not happen in our life times but if it is His Will it will surely happen..","date":"2012-11-19","mins":"12:45 pm","url":"https://shroudstory.com/2012/11/14/bishop-justin-welby-chosen-to-lead-anglican-communion/","cat":"off_topic","title":"Bishop Justin Welby Chosen to Lead Anglican Communion"},{"id":"comment-8215","author":"chris","post":"I think to Ron’s point: what was published in Nature and what actually happened may be two different things in a lot of respects. Had the review process had all the facts in hand it may have gone another way..","date":"2012-02-13","mins":"9:52 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","title":"Comment of A Superfluous Man Brought to the top"},{"id":"comment-8216","author":"chris","post":"Gabriel, I don’t think an analysis of a pony tail would yield any meaningful results. The hair on the back image is fainter than the body image on the same side and it’s very  undefined. So I don’t think a definitive outline could be ascertained. As an aside, this characteristic of the hair on the reverse image is something that proponents of forgery are going to have a hard time grappling with and explaining..","date":"2012-02-13","mins":"9:59 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","title":"Comment of A Superfluous Man Brought to the top"},{"id":"comment-8217","author":"chris","post":"Mr Superfluous, I like the St. Thomas More picture. I think that’s by Holbein? He is one of my heroes and someone who’s courage I hope to imitate. There have been a few times in my life when I’ve had to depart from others in their path for moral reasons. There have been a least a couple of occasions where I was confronted and asked why I could not go along with others in their behavior when they didn’t see anything wrong with it. My response has always been to paraphrase More: “If you should die and go to Heaven for following your conscience and I should die and go to Hell for nor following mine, will you join me for fellowship’s sake?” The response is always the same as More received: silence. It’s good to know some things are eternal..","date":"2012-02-13","mins":"10:07 pm","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","title":"Comment of A Superfluous Man Brought to the top"},{"id":"comment-8300","author":"chris","post":"Should be interesting to see if the Wizard of Bod participates. I don’t think his goal is friendly debate though so I don’t expect much..","date":"2012-02-15","mins":"12:28 pm","url":"https://shroudstory.com/2012/02/15/friendly-patient-on-line-written-debate-about-the-shroud-of-turin/","cat":"news_&_views","title":"Friendly, patient, on-line, written debate about the Shroud of Turin?"},{"id":"comment-12574","author":"chris","post":"This is like reading War & Peace. . ..","date":"2012-06-15","mins":"10:40 pm","url":"https://shroudstory.com/2012/06/14/gas-diffusion-and-the-banding-effect/","cat":"news_&_views","title":"Gas Diffusion and the Banding Effect"},{"id":"comment-7425","author":"chris","post":"John, some people’s faith lead them to believe that Leonardo was the only person who could work miracles. ; ).","date":"2012-01-23","mins":"1:46 pm","url":"https://shroudstory.com/2012/01/23/has-playful-leonardo-left-us-a-clue-in-the-salvator-mundi/","cat":"news_&_views","title":"Has Playful Leonardo Left Us a Clue in the Salvator Mundi?"},{"id":"comment-13794","author":"chris","post":"Yep. “IT” wasn’t actually found. Years may pass before we know exactly what was found. At the same time it might be relatively quickly that we can rule out Higgy Baby yet still have a bosson on our hands. “Old Spice means quality said the Captain to the Bosson!” Gabriel : After all it may not be the bosson of Higgs yet…http://www.technologyreview.com/view/428428/higgs boson may be an imposter say particle/?ref=rss.","date":"2012-07-12","mins":"7:35 pm","url":"https://shroudstory.com/2012/07/07/higgs-boson-and-religion-and-science/","cat":"off_topic","title":"Higgs Boson and Religion and Science"},{"id":"comment-13795","author":"chris","post":"Chris : Yep. “IT” wasn’t actually found. Years may pass before we know exactly what was found. At the same time it might be relatively quickly that we can rule out Higgy Baby yet still have a bosson on our hands. “Old Spice means quality said the Captain to the Bosson!” Gabriel : After all it may not be the bosson of Higgs yet…http://www.technologyreview.com/view/428428/higgs boson may be an imposter say particle/?ref=rss Oh, forgot to say none of it, no matter what the outcome, has anything to do with Religion or Theology..","date":"2012-07-12","mins":"7:37 pm","url":"https://shroudstory.com/2012/07/07/higgs-boson-and-religion-and-science/","cat":"off_topic","title":"Higgs Boson and Religion and Science"},{"id":"comment-7094","author":"chris","post":"Sciencebod brings up an interesting point: I have read in many publications about there supposedly being many shrouds in history. Have any of them survived, I wonder? If so what do they look like? Or is it just conjectured that there were many shrouds due to the “relic industry” of the middle ages? If another shroud exists it would be good to have for comparison even if it was a blatantly bad attempt at relic forgery. It might give folks a sense of how bad or how good such efforts turned out in such times..","date":"2012-01-17","mins":"11:40 am","url":"https://shroudstory.com/2012/01/16/it-is-enough-to-make-you-want-to-become-a-skeptic/","cat":"news_&_views","title":"It is enough to make you want to become a skeptic."},{"id":"comment-7100","author":"chris","post":"Dan, these are fascinating. Thanks so much for answering my question. These really help to put a perspective on the Turin shroud..","date":"2012-01-17","mins":"1:37 pm","url":"https://shroudstory.com/2012/01/16/it-is-enough-to-make-you-want-to-become-a-skeptic/","cat":"news_&_views","title":"It is enough to make you want to become a skeptic."},{"id":"comment-21787","author":"chris","post":"Andy and Russ are spot on. I read a great phrase one time which I think was on Barry’s site which I’ll paraphrase: ‘Science by press release’, which is to say, meritless hype created for sake of doubt. The same thing applies here in my mind: this is research by press release with the sole purpose of creating doubt via hysteria. The devil has many tricks up his sleeve to extract his pain on man but he shall never prevail..","date":"2013-01-09","mins":"1:08 pm","url":"https://shroudstory.com/2013/01/09/jesus-wife-papyrus-update/","cat":"news_&_views","title":"Jesus’ Wife Papyrus Update"},{"id":"comment-38477","author":"chris","post":"Yeah, Rich, you should just hang out here we got beer and cocktails. :).","date":"2013-07-01","mins":"1:29 pm","url":"https://shroudstory.com/2013/07/01/jref-catholics-answers-and-the-like/","cat":"news_&_views","title":"JREF, Catholics Answers and the like"},{"id":"comment-21929","author":"chris","post":"John, my advice is not to publish this. From a layman’s perspective it just looks loony and quite frankly smacks of hysteria and extreme narcissism IMHO. It sounds like something Colin would write..","date":"2013-01-12","mins":"8:15 am","url":"https://shroudstory.com/2013/01/11/living-free-the-thomas-aquinas-and-pierre-teilhard-de-chardin-part/","cat":"uncategorized","title":"Living Free: The Thomas Aquinas and Pierre Teilhard de Chardin Part"},{"id":"comment-4134","author":"chris","post":"I am not a supporter of the multiverse theory. It is kind of pseudoscience that cannot be observed but yet theoretical physicists need something to do to keep sane I guess. In terms of the multiverse and Christianity, I always thought CS Lewis touched upon it in his Chronicles of Narnia. Aslan pretty much said that in our universe he goes by a different name, which means he is probably another incarnation of Christ. Also multiverse theories are aimed to destroy the fine tuned universe theory..","date":"2011-10-06","mins":"4:24 pm","url":"https://shroudstory.com/2011/10/06/more-on-this-will-hurt-your-brain/","cat":"news_&_views","title":"More on This Will Hurt Your Brain"},{"id":"comment-30517","author":"chris","post":"Chris : How do you know all this? I am not sure any of this can be gleaned looking at an HR image from the internet. To assert it with only the aid of a digital image makes one look a bit ’round the bend as they say. For clarification, this is directed at Hugh..","date":"2013-04-12","mins":"3:43 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-30526","author":"chris","post":"Hugh Farey : It is quite an easy job to superimpose the front and back images, and to switch back and forth using an opacity toggle. I arbitrarily decided to match the bloodstains of the back of the head to the line of the eyebrows. The image of the deltoids roughly matches the image of the pectorals, and the blood trickle across the back is level with the elbows on the front. The big bloodstain (on the instep?) at the end of the ventral legs then appears more or less in the middle of the big footprint at the end of the dorsal legs. If we make a fold in the dorsal image, then either the ‘back of head’ bloodstains end up match up with the moustache, or the ‘instep’ stain now ends up matching the ‘toes’ end of the ‘footprint.’ Lesser distortion but at both ends simultaneously is also possible. If the man on the shroud had bent legs, then, of course, the front image (the cloth following his contours) should end up significantly longer than the dorsal image (the cloth being flat), but in that case it is difficult to explain how the back of his calves could have left a mark. Sorry, Chris, I was dragging in various comments from earlier postings for my comment about Dan’s i Pad photo. (a) comes from the Gilberts’ spectroscopy paper which has a diagram of the reflectance spectrum of exactly this bloodstain. (b) comes from Miller and Pellicori’s UV paper which has a photograph of this bloodstain under UV light with no fluorescent serum rim. (c) and (d) are apparent just by looking at Dan’s posting. I dare say I often appear a bit round the bend anyway, but my observations are nearly always based on reports of primary observations. As such, any niggling anomalies really do have to be explained before any indisputable conclusions can be arrived at. Hugh, OK, I can accept that. It looked like you were drawing conclusions based on Dan’s posted photo. I think you can appreciate how that looks. And about that photo I ordered my oldest to hand over her Ipod so I could run this experiment. I got the app and enlarged the face as much as possible and emailed the image to myself. It was not as large nor anywhere near as high a definition of even the shroudscope. I wonder if I’m not doing something wrong or perhaps the latest generation Ipod isn’t good enough? Anyway, I suspect your observations are probably easily addressed although I admit I am not versed in the science to do it. But then again they actually be very hard to address, I don’t know. My suspicion is just that though. It comes from that fact that I fall into the same category as Dan – the shroud is probably the real deal..","date":"2013-04-12","mins":"4:53 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-30532","author":"chris","post":"Hugh, true and either way time will tell. On another note, disregard my comment about the Ipod image. Once I got some bourbon in me and played with it some more I realized I didn’t *buy* the higher res images – which is strange with a *free* app. What also helped was that the message I got while enlarging the pictures (again) changed from something about permissions to something about you need to pony up some cash for this free stuff. A pox on them! I don’t mind giving my fellow man his due but tell my up front the cost of the transaction! Don’t lie to me and tell me it’s free..","date":"2013-04-12","mins":"5:30 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-30516","author":"chris","post":"How do you know all this? I am not sure any of this can be gleaned looking at an HR image from the internet. To assert it with only the aid of a digital image makes one look a bit ’round the bend as they say..","date":"2013-04-12","mins":"3:38 pm","url":"https://shroudstory.com/2013/04/11/neat-trick-with-the-shroud-2-0-app/","cat":"news_&_views","title":"Neat Trick with the Shroud 2.0 App"},{"id":"comment-11724","author":"chris","post":"I agree with a lot of what Yannick expresses here. In the end the actual date isn’t all that relevant. What the writers were trying to convey – mainly that they saw a man who proclaims to be “The Way, The Truth and The Life” suffer death and then rise from the dead. Jesus is the real deal, not some charlatan looking to get a following. Their primary purpose was to write down what was being passed on via oral tradition in the first few years after the resurrection and ascension. They needed to combat inaccuracies and set the record straight in their growing community. I will depart with Yannick and others here though: Matthew the apostle almost assuredly wrote his own gospel and he is an eye witness to the events. Mark copies Matthew and Luke not the other way around. And John wrote his gospel many years after the events so some details are probably not accurate with regards to peripheral facts but his recounting of Jesus’s words are probably very accurate given his age at the time of his following of Jesus. All the gospels were written before the revolt. It looks like the majority of you would probably disagree with this interpretation and I respect that but this is the perspective that I come from though..","date":"2012-05-30","mins":"1:39 pm","url":"https://shroudstory.com/2012/05/26/quake-reveals-day-of-jesus-crucifixion-or-something-like-that/","cat":"news_&_views","title":"Quake Reveals Day of Jesus’ Crucifixion (or something like that)"},{"id":"comment-36637","author":"chris","post":"The hands fascinate me as well, especially that right hand with the elongated fingers. That index finger is very intriguing and I have often wondered what it is that we are seeing. Was Christ’s fingers dislocated from perhaps someone pulling on them to get his arms spread more easily? That right hand is also under what I assume to be a draping effect from the raised left knee. Does this cause some sort of distortion? All the fingers of the right hand look as if they are sort of sweeping. I also wonder if there is a double exposure effect from the shroud loosening as Max asserts. Whatever it is I see it as evidence that is stronger for the argument of authenticity than for forgery. I don’t think it likely that a forger would get everything else with regards to the pathology of crucifixion and then completely get the right hand wrong. As for bones, I am fairly certain I see bones in the palm of the hand. This is the back of the left hand. Of course, Christ just may have been very skinny (which looks to be consistent with the rest of the body to my eye as I don’t see any indication of fat let alone excess fat). I have seen the hand bones of folks who are just as skinny so I don’t think it unusual that I should see bones on the back of the palm. Also, for where the nail wound comes out of the back of the palm – when I use the shroudscope tool to analyze the length from where I think the fingers meet the hand (this is the space between the middle finger and the ring finger – the point at which they meet) to where I think the nail hole is I get a different measurement depending on which image I look at. The negative image seems to yield a smaller measurement while the normal photograph yields a measurement more consistent with the back of my own thumb (meaning it’s entirely consistent with driving the nail straight through the hand at the base of the thumb). The left hand looks entirely normal to me otherwise..","date":"2013-06-10","mins":"1:46 pm","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","title":"R.I.P. Ben Wiech"},{"id":"comment-7889","author":"chris","post":"My own personal view is that online polls are completely invalid and any attempt to extract meaning from them is an exercise in frustration. Polls done by reputable firms have a hard time getting it right and they take great pains to do that over and above what online polls do. At best online polls reflect only who decided to respond to them out of the particular audience that visited at the time they were posted. Blogs etc draw types of people and that alone can skew the results because certain types may be far from representative of the target audience. If the author wants an opinion poll from a certain audience he would do best to commission such a poll from a reputable firm..","date":"2012-02-03","mins":"11:17 am","url":"https://shroudstory.com/2012/02/03/revisiting-the-cosmic-log-poll-one-more-time/","cat":"news_&_views","title":"Revisiting the Cosmic Log Poll One More Time"},{"id":"comment-7427","author":"chris","post":"I agree, Ron. If this author thinks that the shroud would lead folks away from Jesus he’s been sucker punched be the devil himself. It’s a classic judo movement of the evil one to use one’s own sin of pride to hide the truth before one’s lying eyes..","date":"2012-01-23","mins":"1:54 pm","url":"https://shroudstory.com/2012/01/23/satan-and-his-clever-shroud-of-turin-trickery/","cat":"news_&_views","title":"Satan and his clever Shroud of Turin trickery"},{"id":"comment-8419","author":"chris","post":"Ron, good point. Also, not believing in a physical resurrection does not square with the Apostles actions from there on out. They were zealous in carrying out Christ’s command to make believers of all men. What’s more telling is they did not fear death at all. What takes men from the abject terror they had after Jesus’ arrest and death and makes them unflinching of persecution and death to spread His story? If they had not seen the Risen Lord they would not have done what they did. It simply doesn’t make sense otherwise. I mean these guys suffered horrible tortures but remained unwavering. It’s one thing to die for something you have Faith in it’s quite another to die for something you have seen with your own eyes. That’s what sets Christianity apart from pretty much every other religion. It’s based on eye witness testimony..","date":"2012-02-17","mins":"10:27 pm","url":"https://shroudstory.com/2012/02/17/so-swings-and-roundabouts-darn-dawkins-didnt-ask-about-the-shroud/","cat":"news_&_views","title":"So, swings and roundabouts: Darn, Dawkins didn’t ask about the shroud."},{"id":"comment-8436","author":"chris","post":"Great comment, John! I love hearing about these kinds of things.Thanks for sharing..","date":"2012-02-18","mins":"12:47 pm","url":"https://shroudstory.com/2012/02/17/so-swings-and-roundabouts-darn-dawkins-didnt-ask-about-the-shroud/","cat":"news_&_views","title":"So, swings and roundabouts: Darn, Dawkins didn’t ask about the shroud."},{"id":"comment-7133","author":"chris","post":"Wow, looks like there’s updates there nearly every day. I am highly distrustful of Wikipedia since it’s so prone to manipulation but it does at least provide a primer on a subject..","date":"2012-01-18","mins":"10:05 am","url":"https://shroudstory.com/2012/01/18/so-you-need-to-access-wikipedias-shroud-of-turin-page-today/","cat":"news_&_views","title":"So you need to access Wikipedia’s Shroud of Turin page today"},{"id":"comment-21921","author":"chris","post":"Good point Gabriel! I thought the same thing. It takes some folks longer than others depending on the “non thinking” prejudices one holds, ahem! The thought of an old quote I’ve seen also came to my mind when I read this: the Titanic was built by experts while the ark was built by an amateur..","date":"2013-01-12","mins":"7:25 am","url":"https://shroudstory.com/2013/01/12/stop-taking-cudgels-to-each-other/","cat":"news_&_views","title":"Stop taking cudgels to each other?"},{"id":"comment-9074","author":"chris","post":"Not having watched the video the narrative reminds me of some of the ridiculous claims made by some a few decades back about the Ark of the Covenant was actually a primitive radio for talking to God. I also find it interesting that the Holy Ghost would not answer questions of who is where in the afterlife. Apparently Mary hasn’t been given the message as the children at Fatima reported that she answered their question regarding a local girl who had died recently. When they asked Mary if the girl went to Heaven Mary’s reply was that the girl had gone to Purgatory and would be there until the end of the world. Couple that with the vision of Hell Mary showed them and it’s hard to believe that the information would be classified for anyone communicating with a supernatural being. I get the feeling somebody’s got a ham radio or something and is having fun at others people’s expense..","date":"2012-03-08","mins":"10:23 am","url":"https://shroudstory.com/2012/03/08/the-holy-ghost-communications-channel-and-the-shroud-of-turin/","cat":"tinfoil_hats","title":"The Holy Ghost Communications Channel and the Shroud of Turin"},{"id":"comment-7641","author":"chris","post":"Excellent post, Dan. I like Buck’s last line about not knowing and admitting it. It’s OK to not know and to be curious and even to wonder. I think one day we will reach the end of what can be known about the shroud scientifically and beyond that each person, for themselves, has to assign meaning to it..","date":"2012-01-28","mins":"2:54 pm","url":"https://shroudstory.com/2012/01/28/the-most-intelligent-thing-anyone-can-say-with-regards-to-the-shroud-is-i-dont-know/","cat":"news_&_views","title":"The most intelligent thing anyone can say with regards to the shroud is, \"I don’t know.\""},{"id":"comment-9929","author":"chris","post":"Do you think these people make “Pope on a rope” soap? ;).","date":"2012-04-03","mins":"8:21 pm","url":"https://shroudstory.com/2012/04/02/the-soap-making-nuns-and-the-shroud-of-turin/","cat":"news_&_views","title":"The Soap-making Nuns and the Shroud of Turin"},{"id":"comment-16904","author":"chris","post":"Andy makes and excellent point and Mundabor’s point is well taken. The whole hoopla surrounding this papyrus fragment is just like when someone claims to create a replica of the shroud and it’s touted in the press before it’s even been fully vetted by someone else. It’s science by press release and it’s only point is to foster a negative attitude towards Christianity, the Church and it’s Sacred Traditions. Like in cases where someone has supposedly created a Shroud replica and you rarely see anything like the attention given to the announcement of it lavished on the follow up conclusion that, no, it’s really not like the shroud at all. All the audience remembers is that someone created a shroud replica and therefore the shroud is probably a fake. And really that’s the point of science by press release. It’s gets us all talking and arguing about nothing of any substance before we even know its not substantive. It’s an exercise in whipping up hysteria and casting aspersions. Had Ms. King done all the academic leg work ahead of time to evaluate the value and authenticity of this piece and then presented it to the press with proper context, i.e. It’s a fragment of Gnostic writings with no real bearing on Christian traditions because this was addressed back in the third and fourth centuries but it’s nice as a piece of history about the Gnostics, I would have had respect for her. But instead we get science by press release with no context and the complete conjecture that it has any bearing whatsoever on the Christ story and therefore the role of women in the Church. As Andy has alluded to, I think correctly, there is an agenda we should be aware of and that’s really the point of this, not science..","date":"2012-09-25","mins":"3:49 pm","url":"https://shroudstory.com/2012/09/24/when-asses-flew/","cat":"news_&_views","title":"When Asses Flew"}]
