[{"id":"comment-7371","author":"chris","post":"It may be that they arrived at the answer they had striven for..","date":"2012-01-22","mins":"2:43 pm","url":"https://shroudstory.com/2012/01/22/correcting-an-article-about-the-shroud-of-turin/","cat":"news_&_views","title":"Correcting an article about the Shroud of Turin"},{"id":"comment-9532","author":"chris","post":"Ron, point taken as it’s universally abused. I was referring to it’s roots in Nazism as articulated by it’s propaganda minister..","date":"2012-03-22","mins":"10:28 pm","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"},{"id":"comment-9511","author":"chris","post":"Beware of the old leftist propaganda tactic of repeating a lie until it becomes the truth in order to achieve a political goal(s)..","date":"2012-03-22","mins":"10:38 am","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"},{"id":"comment-9516","author":"chris","post":"Yannick I laugh heartily when I read this propaganda for it truly is propaganda. They are grasping at straws and preying on the more ignorant. I am also keenly aware that those who put it forth have a definite agenda. At this point in History Faith is needed tremendously..","date":"2012-03-22","mins":"1:52 pm","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"},{"id":"comment-9533","author":"chris","post":"Yannick, I agree entirely! I have had this very same reflection many times over the years and in many conversations with friends. If we didn’t have free will, we would all be robots. The fact that He doesn’t control us shows how much He loves us as he has made us in His image – with a free will. All of Christianity is based on free will and no one person who calls themselves a Christian can compel another person to practice Christianity’s tenets. Always remember the Great Commission where Christ instructs His Apostles to walk away from those who reject the Gospel. He will not force Himself on us. We, as Christians now must imitate our Savior and give everyone we meet the same respect – freedom and liberty to run their own lives even within the Christian Community because we are all individuals. So very unique among all other religions..","date":"2012-03-22","mins":"10:38 pm","url":"https://shroudstory.com/2012/03/21/bart-ehrmans-new-book-did-jesus-exist/","cat":"books","title":"Bart Ehrman’s new book: ‘Did Jesus Exist?"},{"id":"comment-7858","author":"chris","post":"Annie, excellent observations. I’ve come to see the bible as a collection of testaments or testimonials from people and/or their chroniclers of how they had direct interaction with the living God. I come to regard those testimonials as highly reflective of each person’s expectations of God and what He represents to them at that time. Even though these testimonials are inspired by the Holy Ghost they are not dictated by Him. He will not abrogate our free will and that includes our core expressiveness. The Old Testament came from a time of survival and nation forging. Imagine the chaos of those times and all the abhorrent behavior that was rampant throughout human living conditions. Obedience in such times seems more valuable to a lawgiver than understanding and so the perspective of those who wrote many of books of the Old Testament was of a God who required obedience. They expected Him to impose order through obedience. And Faith undergirds obedience, like from the womb a child has Faith in it’s parents to take care of it. Where understanding is not possible, Faith bridges the gap. It seems to me God works within the human condition, knowing us better than we know ourselves. God would probably have not gotten anyone to follow His Will had he not worked within the human expectation that a society must be made obedient first before it can be made to understand the basis of that obedience (simply because man is ignorant of his own nature). The New Testament represents the next and eternal phase – understanding. We have Christ’s positive affirmation of the law and Heaven. He encourages us to understand the law through his explanations of it, He gives us it’s meaning. Now step back a moment and look at the overarching narrative of the Old and New Testaments. They are indelible marks on history and enormously unforgettable events. God works, I think, in broad undeniable strokes and recurrent themes. What’s the best way to get your message across not only now but through all history? Make a broad undeniable movement within history; it’s got to be big enough that people will remember it for all time. Think of the indelible mark the Exodus has left on the Israelites. Think of the indelible mark that Jesus’ Resurrection made on all human history. The Resurrection itself is extremely extraordinary and represents the ultimate mark of His benevolence and message. It’s pretty darn hard to ignore someone who gets up out of His own tomb under His own power. Nothing less than this will make men turn their attention away from themselves and provide a basis for conversion throughout human history. What is also unique about the whole narrative is that Christ doesn’t conquer or vanquish those who put Him to death, on the contrary He saves them from death itself. He demonstrates through His Resurrection what He meant when He said God is a God of the living not the dead. Anyone that has the power to raise His own body after death certainly has the power to raise anyone from the dead..","date":"2012-02-02","mins":"11:48 am","url":"https://shroudstory.com/2012/02/01/burden-of-proof-on-the-shroud-of-turin/","cat":"books","title":"Burden of Proof on the Shroud of Turin"},{"id":"comment-8860","author":"chris","post":"Yeah, I saw this the other day. Did you notice the critics who finally had a chance to unload on this ostensibly saying it’s a fantasy? They have no clue what they’re looking at yet the conjectures fly. The fact that they are willing to conjecture at this stage coupled with the nature of the conjectures themselves say a lot more about the motives of the individuals engaging in this than the artifacts themselves..","date":"2012-03-01","mins":"11:40 am","url":"https://shroudstory.com/2012/03/01/fasten-your-seatbelt-more-archeology-from-tabor-and-jacobovic/","cat":"books","title":"Fasten your seatbelt: More Archeology from Tabor and Jacobovic"},{"id":"comment-11033","author":"chris","post":"Bravo, you recognized his bait and switch! Turns out that in that theory what passes for “nothing” has properties. And where did those properties come from? How were those properties defined? How many other universes have we detected? Yep, thought so. I really wouldn’t pay any mind to any of this right now as it is quite obvious they only have an agenda. Besides some of what I’ve read recently may wind up overturning some of what we think we know..","date":"2012-05-01","mins":"10:41 am","url":"https://shroudstory.com/2012/04/30/krauss-i-dont-really-give-a-damn-what-nothing-means-to-philosophers-i-care-about-the-nothing-of-reality/","cat":"books","title":"Krauss:  I don’t really give a damn what \"nothing\" means to philosophers; I care about the \"nothing\" of reality.\""},{"id":"comment-7132","author":"chris","post":"I feel the love..","date":"2012-01-18","mins":"9:44 am","url":"https://shroudstory.com/2012/01/18/new-book-christ-to-coke/","cat":"books","title":"New Book: Christ to Coke"},{"id":"comment-6883","author":"chris","post":"Helmut, thank you for the detailed reply, I very much appreciate you taking the time to do it. It is a fascinating possibility to explore and I shall give it some thought. I understand the point about the Apostles thinking that they saw a genuine resurrection should Jesus have survived in the tomb. I just can’t get around the Ascension part though. Somewhere massive lies needed to have been propagated and 11 men would rather be murdered than admit to a lie? I just don’t see it. I see no profit for anyone who testified to Christ’s actions to preach and be martyred for a fraud. But it is an interesting theory. Thanks again..","date":"2012-01-12","mins":"8:29 pm","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-6822","author":"chris","post":"I have a few questions. My intention is not to be offensive but clarify a few things that pop into my head whenever I see this argument about Jesus surviving the crucifixion (moderator please delete this if you feel it’s too strong or offensive, thanks in advance): If Jesus survived the crucifixion wouldn’t the shroud be literally soaked with blood (especially in the back image area) as opposed to just stained with blood in places (assuming it’s His)? If a living body made the image where’s the example of a remake? Can anyone point to a shroud image with the same properties made with a living body? Why are all these other folks who are trying to show how the shroud was faked not even seeming to explore the option to create a fake with a living body? It would seem far easier to pursue that path than taking great pains to paint linens, wash them, heat them etc etc, right? Why not just create the live human version? Or would it require the nearly impossible hurdle of actually beating the living daylights out of someone, crucifying them and lancing them or do bodies make these kinds of images by some other means? If you have to put someone through that suffering to test the result (or multiple individuals to be repeatable) I’m guessing you’re not going to get too many volunteers therefore it’s not really all that testable. Where does one get the (implied) notion that the Vatican has kept a conspiracy alive for 2000 years? – that they knew that Jesus was alive and therefore would have been depicted as such on the shroud when it came time to carbon date the shroud. What’s the point of even contemplating carbon dating the shroud if you already know that it probably disproves resurrection and you want to cover up that fact because it ruins your whole business model? Was anyone even contemplating that the shroud showed a live man at the time? If so, was that viewpoint so prevalent that the church believed it too and felt the overriding need to publicly discredit the shroud in an elaborate plan? Why bother? If someone was aware of a conspiracy all these years wouldn’t it have made sense to accidentally let the shroud burn up in the 1532 fire or subsequently get the idea that, hey here’s a good way to get rid of the evidence maybe we need to have another accidental fire? Do you think that the Vatican didn’t have a conspiracy and only came to realize in the 20th century that the man on the shroud was supposedly alive? If that’s the case: as a Pope or a Bishop how do you make such a sure determination that he was alive in the face of all the differing opinions regarding the living status of the man on the shroud and then take the path of covering it up? Was someone just covering all their bases? Why bother with testing the shroud in any kind of way at all if you’ve realized this before the tests were conducted? It’s not like they have to let it be tested, it’s the private property of the church and they can do whatever they want with it. Wouldn’t the church be taking an awfully big risk, once deciding to carbon date the shroud even after determining that Jesus is depicted as alive in the image, of offering a contaminated sample that supposedly includes an invisible reweave from another century as well as original shroud material? Wouldn’t they run the risk of someone eventually discovering this? Wouldn’t it be a gamble as to what century would be returned by the carbon dating? Or was it only important that a non first century date be returned? What do you think they might have said if a 17th or 18th century date was returned?.","date":"2012-01-11","mins":"4:00 pm","url":"https://shroudstory.com/2012/01/09/new-kindles-from-helmut-felzmann/","cat":"books","title":"New Kindles from Helmut Felzmann"},{"id":"comment-20145","author":"chris","post":"I think this is just being used as vehicle to express veiled hate..","date":"2012-12-10","mins":"1:07 pm","url":"https://shroudstory.com/2012/12/05/so-we-are-fruitcakes-just-in-time-for-christmas/","cat":"books","title":"So we are fruitcakes, just in time for Christmas"},{"id":"comment-6878","author":"chris","post":"I think the concept is very interesting, I also think it may be irrelevant. A God that requires an Act of Faith for Salvation will not leave you any purchase on proof in this world which is not His Kingdom. Quantum mechanics will not show you anything of meaning and they will not show you the fingerprints of the Almighty. As an Act of Faith I accept that I will never have proof unless Christ reveals himself to me in an extraordinary form. One thing that remains a very open question is whether we can know the cause of our existence through science. At present many minds don’t think that may be possible. I am open but not hopeful that the question will ever be settled in my lifetime. Whatever caused the Universe, or our state of being is not necessarily subject to it’s constraints. Time itself, from a quantum point of view probably did not exist prior to this Universe coming into being. It is an intrinsic characteristic to this Universe and therefore may not have existed at all prior to it. From that we can surmise that the cause of the Universe’s coming into being need not necessarily be constrained by Time. . . Or any other characteristic of this state of being. How does one measure or come to know and understand something that is not necessarily subject to anything we can possibly learn from this state of being? We may never be able to know scientifically anything outside our own Universe if that’s the case. It may all end up in the realm of philosophical conjecture. Regarding the Shroud I don’t think it shows any evidence of Resurrection. I am a firm believer that God doesn’t break the laws of nature, the laws of nature obey Him. I am faithful that one day one or more viable hypotheses will be developed which will show how, through natural events, the image on the Shroud was created. The only thing we can surmise is that something interrupted the Shroud’s interaction with a dead body. It may be the Resurrection, it may be someone stole the body or some other unforeseen explanation. For me, Faith gives me the answer, the Shroud only poses the question..","date":"2012-01-12","mins":"5:55 pm","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","title":"The Coming of the Quantum Christ"},{"id":"comment-21792","author":"chris","post":"There will be no end to these such fantasies so long as there are those who are dependent upon them. Most people, though, will see them for what they are..","date":"2013-01-09","mins":"1:39 pm","url":"https://shroudstory.com/2013/01/04/the-shroud-was-the-resurrection/","cat":"books","title":"The Shroud was the Resurrection?"},{"id":"comment-130005","author":"chris","post":"I am partial to the naturalistic process theory. I think any naturalistic theory has to explain why there is no side image though. I’m not sure any of them do now..","date":"2014-06-16","mins":"12:16 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","title":"Clarification of the Stochastic Process Paper"},{"id":"comment-130280","author":"chris","post":"Hugh and Dave, thanks. Interesting theories and definitely stuff worth pondering. One of the things I wonder about though is how can we determine tight wrap versus a loose draping. Some of the blood stains suggest a tight wrap (or even a close wrap) without anything else in there – take that elbow bloodstain for instance. I recall reading something recently from another post where that blood stain maps to the man’s elbow if the shroud was wrapped around him. One would have to assume that there would not be anything else in there. The other thing is the bloodstains in the hair. Seemingly they map to the sides of the face? It would suggest, if that were true, that the shroud had to be wrapped tight at some point but then loosened and draped loosely for the image formation process. One possibility is that Joseph had helpers and they were the ones who had to physically take the body into the tomb and lay it in the shroud. Maybe they were doing this while Joseph was getting other burial supplies to put in the tomb in anticipation of a later, fuller burial. Perhaps they weren’t all that familiar with what Joseph had in mind given the time constraints and so while waiting for him to arrive wrapped the body rather closely thinking they were helping and that Joseph would just carry in the burial stuff and lay it next to the body (on the floor or something) instead of placing it around the body. Joseph then comes in with the stuff and wants to give Jesus a modicum of respect with regards to burial ritual but doesn’t have time to do anything other than just lay the stuff closely against the sides of his body and drape the shroud over everything. After all he’ll be back after the Sabbath to finish the job. And having those spices there might help with the inevitable stench from the decaying corpse. I can’t imagine that would take all that long and it might be long enough to allow the blood transfer to happen and then the image formation could happen over the period of the next 48 or so hours. Pure speculation on my part but in any scenario I think for a naturalistic process theory to work you’ve got to have both a tight wrapping and a loose draping if those facial and elbow bloodstain mappings are correct..","date":"2014-06-17","mins":"1:05 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","title":"Clarification of the Stochastic Process Paper"},{"id":"comment-130316","author":"chris","post":"Hugh, yeah, it’s tough to explain. It may be even simpler than we’ve imagined. Thinking about it some more it may just be that the body was wrapped tightly in the shroud right off the cross, then transported in some fashion to the tomb where it was unwrapped, spices laid aside it and the top draped over to await the final burial..","date":"2014-06-17","mins":"2:52 pm","url":"https://shroudstory.com/2014/06/16/clarification-of-the-stochastic-process-paper/","cat":"paper_chase","title":"Clarification of the Stochastic Process Paper"},{"id":"comment-6825","author":"chris","post":"Notice there’s no instructions on tuning in to the future. Ain’t that always the case? I’m trying to tune the blasted thing in to show me next week’s Powerball numbers and I just can’t get it to work!.","date":"2012-01-11","mins":"6:00 pm","url":"https://shroudstory.com/2012/01/11/you-couldnt-make-this-up-no-you-couldnt-no-really-you-could-not/","cat":"video","title":"You couldn’t make this up. No you couldn’t. No. Really. You could not."}]
