[{"id":"comment-194001","author":"david_mo","post":"The most authorised comment on the relations between first century textiles in Palestine and the Shroud is: Orit Shamir: “A burial textile from the first century CE in Jerusalem compared to roman textiles in the land of Israel and the Turin Shroud”, 2014 Workshop on Advances in the Turin Shroud Investigation, SHS Web of Conferences , Volume 15, 2015.http://www.shs conferences.org/articles/shsconf/abs/2015/02/shsconf atsi2014 00010/shsconf at Fulbrigth’s article (Fulbright, Diana (2010): “Akeldama Repudiation of Turin Shroud omits evidence from Judean Desert”. ENEA, Frascati, http://www.acheiropoietos.info/proceedings/Fulbright Akeldama Web.pdf) compares the fabric of the Shroud with other fabrics of some different countries and epochs and this is irrelevant. Shamir speaks about the determinate place and time. PS: Ah, by the bye, anybody can tell me in what university Diana Fulbright was teacher? I need the datum for my blog. Thank you..","date":"2015-03-22","mins":"2:48 am","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-194009","author":"david_mo","post":"Thank you, Hugh..","date":"2015-03-22","mins":"6:14 am","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-194113","author":"david_mo","post":"You are wrong in some points, Daveb. There is not a “mixture” of wool and linen threads in the Akeldama Shroud and the mixture was not forbidden in the Jewish law. Cf. Orit Shamir (2007) and (2015). The textiles of the shroud are separate layers (not “mixture”). In 2007: 78 they are described as layers of linen and wool. In 2015:3 only wool. I don’t know the reasons of this change. You said: “The mixture of wool and linen is curious, and would seem to breach Judaic laws mixing the two”. But: “Wearing garments of mixed wool and linen – which is called in the Hebrew sources sha’atnez – is forbidden by the Jewish law but it can be used to make shrouds for the deceased (Shamir 2015: 4). Also: “All the linen textiles from the Land of Israel until the medieval period are S spun, plain weave tabby”. (2015: 7).","date":"2015-03-23","mins":"4:06 am","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-194114","author":"david_mo","post":"Shamir O. 2007. “Textiles from the 1st Century CE in Jerusalem – a Preliminary Report”. In Ancient textiles : production, craft and society : Proceedings of the First International Conference on Ancient Textiles, held at Lund, Sweden, and Copenhagen, Denmark, on March 19 23, 2003 / edited by Carole Gillis and Marie Louise B. Nosch.Oxford: Oxbows Books Shamir, Orit: “A burial textile from the first century CE in Jerusalem compared to roman textiles in the land of Israel and the Turin Shroud”, SHS Web of Conferences 15, 00010 (2015)..","date":"2015-03-23","mins":"4:20 am","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"}]
