[{"id":"comment-12127","author":"david_mo","post":"Colinsberry : PS: Yup, quite a few tombs and tomb lids there, David, to say nothing of discarded burial shrouds. There is a problem, however, with your links to the enluminures site – you seem to have copied the site rather than the image location… Yes. I had problems to link the concret pictures. So, I linked the search page. Just write “Saintes Femmes au Tombeau” in the box “SUJET” and you’ll get the list. Clearly, in the Codex Pray the angel sits on on the grave and not on the shroud, as acknowledged by Mr. Jones. But this is even more absurd. The artist puts the alleged marks of the shroud on something other than the shroud (the grave) to point the shorud. Corrections to overcome the difficulties makes the sindonist assumption increasingly absurd..","date":"2012-06-10","mins":"1:25 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12105","author":"david_mo","post":"Colin: Only from wishful thinking someone might claim that what is represented in the codex Pray is the shroud and not the sarcophagus and its lid. I made a small study on thirty images depicting the scene of the Holy Women. 25 of them represents the angel sitting on the coffin or tombstone. 12 of them represents the shroud. In 8 cases the iconic representation is the same as the Codex Pray: The angel sat on the grave with the lid open. The angel shows the tomb and the napkin crumpled to the Holy Women. Some significant examples: Psalter d’Ingeburge, Musée Condé, Chantilly, S. XII (1195 circa). Http://imageshack.us/photo/my images/856/ingeburgchantilly.jpg/ Chasse de Saint Viance, siglo XIII http://www.culture.gouv.fr/emolimo/viance2.htm Reims – BM – ms. 0234 Saintes Femmes au tombeau 13e s. (fin) http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Pontifical à l’usage de Chartres, Orléans – BM – ms. 0144, Saintes Femmes au tombeau13e s. (début) http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Aix en Provence – BM – ms. 0015, Psautier à l’usage d’Arras13e s. (deuxième quart), http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Jaume Ferrer Bassa 1346, santas mujeres http://commons.wikimedia.org/wiki/File:3women.jpg Orcagna, Andrea 1370 1371, santas mujeres http://commons.wikimedia.org/wiki/File:Andrea %28 Nachfolge%29 Orcagna 001.jpg Gospel Lectionary portion of the Bamberg Apocalypse http://commons.wikimedia.org/wiki/File:Bamberg Apocalypse09 Three Marys At Tomb.JPG The Women at the Tomb, German, Hildesheim, about 1170s, The J. Paul Getty Museum, http://www.getty.edu/art/gettyguide/art Object Details?artobj=112612&handle=li Sacramentaire De Limoges, 1100. La Résurrection. Les Saintes Femmes Au Tombeau http://www.priceminister.com/image?action=slideshow&imagestype=PRODUCT&prdimageid=854762105&productid=87830196 Avignon – BM – ms. 0190 f. 119 Saintes Femmes au tombeau 13e s. (fin) ; 14e s. (fin) http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, (Write “Saintes Femmes au Tombeau” in box “SUJET”). Besançon – BM – ms. 0054 f. 019v, Saintes Femmes au tombeau ,sautier cistercien Datation vers 1260, http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Cambrai – BM – ms. 0038 f. 119 Saintes Femmes au tombeau, Antiphonaire à l’usage de Cambrai,entre 1235 et 1245, http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Cambrai – BM – ms. 0528 f. 004v Sujet Saintes Femmes au tombeau, méliaire Datation 12e s. (première moitié), http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Dijon – BM – ms. 0113 f. 165 Sujet Saintes Femmes au tombeau, Breviaire à l’usage de l’abbaye Saint Bénigne de Dijon Datation 14e s. (troisième quart), http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Orléans – BM – ms. 0144 f. 090 Sujet Saintes Femmes au tombeau, Pontifical à l’usage de Chartres Datation 13e s. (début) ; http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Rouen – BM – ms. 0221 f. 095 Sujet Saintes Femmes au tombeau , Diurnal à l’usage des dominicaines de Poissy Datation 13e 14e s. Http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Rouen – BM – ms. 0233 f. 067 Sujet Saintes Femmes au tombeau, Oraisons et capitules à l’usage de l’abbaye Saint Ouen de Rouen Datation vers 1090, http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Tours – BM – ms. 0149 f. 300v Sujet Saintes Femmes au tombeau, Bréviaire à l’usage de Saint Martin de Tours Datation peu après 1323 ? http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Tours – BM – ms. 0193 (f. 001 142) f. 048v Sujet Saintes Femmes au tombeau, Graduel à l’usage de Saint Martin de Tours Datation 13e s. (deuxième quart ou milieu ?). Http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Verdun – BM – ms. 0107 f. 089v Sujet Saintes Femmes au tombeau, Bréviaire à l’usage de Verdun Datation vers 1302 1305? http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm, Etc., etc. PS: I am interested to know when Stephen Jones acknowledges that we are talking about the tomb “lid” and not with the direct representation of a shroud. It would be a significant setback..","date":"2012-06-09","mins":"2:04 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12168","author":"david_mo","post":"Max: I do not know the word “cryptosimbolism” applied to the Middle Ages. I know the words symbol, icon, sign, signal, etc.. I have read some books on medieval art and semiotic and never found neither the name nor the concept. What is your reference source? Do you intend to say “esoteric symbol”? I think you confused concepts: In semiotics applied to art a symbol is an object representing an abstract idea. The empty coffin symbolizes immortality. You say that the circles and broken lines in the codex Pray are signs of another object: the shroud. Well, they are signals, but not symbols. Any sign or symbol is understood within a cultural framework. In the twentieth century Western culture a raised fist means “I am a communist.” In the culture of the Sumerians a raised fist meant nothing. In the world of twentieth century sindonism circles with broken lines represent the Shroud of Turin. Among sindonists the fabric weft and the “poker holes” are frequently discussed. So they can interpret the image. In the medieval cultural context, four holes and broken lines meant nothing. Because nobody in the Middle Ages identified the poker holes or the weave of the Shroud of Turin. No witness referred to them until the twentieth century. These details were not significant. And this applies to the Shroud of Turin and other cloths that represent the image of Jesus in a miraculous way. A Hungarian miniaturist who had access to this information is highly unlikely. An artist who painted these things to represent the linen of Turin would be a lunatic. Nobody would have understood him. Max, his theory about the Pray codex is just absurd. It is absurd from the point of view of semiotics, history of art and mere rationality..","date":"2012-06-11","mins":"1:02 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11834","author":"david_mo","post":"Lübeck, Schleswig Holstein, Dom, altar, 13th Century. You’re welcome..","date":"2012-06-03","mins":"3:33 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12169","author":"david_mo","post":"Ly Fe : Final point. Can we please know who put forward the idea that the Turin Shroud can be seen on the Codex? Where is it argued? The idea must have come from somewhere because it is not at all obvious. Did they mistake the tomb for the Shroud? Did they really believe that the tomb lid showed weaving and why did they think the weaving was more important than the image? Very good questions..","date":"2012-06-11","mins":"1:08 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11835","author":"david_mo","post":"Sorry. 14th Century. I was counting the century in the Italian way..","date":"2012-06-03","mins":"3:39 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12200","author":"david_mo","post":"Max: I think is your speech what is “cryptic”. You don’t answer to the objections and you ignore the questions. You call “cryptosymbolic” anything you wish to see in the image. It is impossible to follow a reasonable dialogue with you. I agree with Colin’s last comment..","date":"2012-06-11","mins":"7:07 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12240","author":"david_mo","post":"Max Patrick Hamon : I never said “that the circles and broken lines in the codex Pray are signs of another object: the shroud”. Can you read me? This is not another object this is the shroud lying flat on the displaced/raised up sarcophagus lid. I very much doubt about your abilty to properly read signs, signals, symbols, cryptic and esoteric symbols and the like when you just cannot properly read simple prose! Max: Do not make assumptions about what I understand or not understand, please. I understand your “esoteric” chatter very well. I also understand very well that you make up “esoteric” symbols arbitrarily. I understand very well that you defend the absurd theory that the coffin lid is the shroud and the more absurd theory of “cryptic” symbols in the Codex Pray. I was trying to explain you some basic terminology of iconology: difference between symbol and “signal” or “index”. I see you have a problem with what “represent something” means. But don’t trust that I will continue to clarify concepts. Your esotericism not interests me at all. Sorry..","date":"2012-06-12","mins":"2:42 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11829","author":"david_mo","post":"Carlos: To establish that a work of art is a copy of other work two criteria must be followed. First, you must establish a list of similarities and differences. Not enough with the similarities. Second, you must consider if similar features could not be produced by other circumstances which do not involve copying. For the Codex Pray: The “sindonists” do not consider the important differences between the codex and the image of the Turin cloth. Only similarities. Bad method. Then, the “sindonists” not consider that the characteristics they define as unique can be found easily in medieval art. The artist painted codex Pray according to usual conventions of his time. He could take the position of the arms, the absence of thumbs, etc., from other paintings of the time. Even the nude. The assumption that only did it from the Shroud of Turin is unnecessary and unlikely. You can group arbitrarily a number of features of a work of art that does not exist in another and pretend it is unique. In the same way you can arbitrarily group two sets of characteristics of two works of art and say that they alone possess them. Especially if your knowledge of medieval art is not very deep. This can be done even with to works of different periods. It is an arbitrary procedure that proves nothing. Bad method. Obvious errors in the methodology explain why hardly any medieval art expert supports the thesis of “sindonists” on identifying Pray Codex and the Shroud of Turin images. And found on this flawed methodology the cancellation of a prestigious test as the carbon 14 is a mistake. The “sindonists” must find other evidence against the 1988 dating if they want to gain some credibility..","date":"2012-06-03","mins":"2:05 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11831","author":"david_mo","post":"Yannick: Why epitaphioi and nothing else? In the frescoes and the “eluminures” of the Middle Ages are the same characteristics. They were everywhere. I can’t “see that [circles of CP] are identical to the L shaped burn.” If you want to see an “L” on the Shroud of Turin you must arbitrarily choose only the larger holes. But then they are no explication for the five circles in the form of “P” seen below in CP. If you choose to take into account the small circles, then there will be neither an “L” nor a “P” with five holes. All these figures are arbitrary. Not “identic” to anything. (For the picture Cf: Shroud Scope: http://www.sindonology.org/shroud Scope/shroud Scope.shtml ). Well, you can imagine the most unlikely circumstances for the image of CP. But the method in art history is another. When there is a simpler explanation of an image the assumptions that involve complex chains of events that do not have any proof should be abandoned. And there is no evidence of a direct or indirect contact between the author of the CP and the Shroud of Turin (whether human or divine)..","date":"2012-06-03","mins":"2:40 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11815","author":"david_mo","post":"I do not know what you mean with “typical”. But there are many works of medieval art with those characteristics. Codex Pray among them. I’m just a fan of medieval art. I’ve traveled through Europe following the path of Romanesque and Gothic (the Rinascimento, also) and I like to see websites on medieval illuminations and painting. So I can give you a few examples, if desired. Do you know an expert who denies it? Because it would be an expert on something else, not in medieval art..","date":"2012-06-02","mins":"3:54 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11832","author":"david_mo","post":"And why no blood? All witnesses who described the Shroud of Turin emphasized the marks of blood. How the CP author does not paint them? And the angel walking on the shroud? Simply impossible. In my previous comment I contributed seven major differences that exclude the copy. And I could have contributed more..","date":"2012-06-03","mins":"3:06 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11828","author":"david_mo","post":"Ron: The argument from authority is secondary when you can argue about the evidence and reason independently. Moreover, the argument of authority can not rely on a controversial author..","date":"2012-06-03","mins":"1:20 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11845","author":"david_mo","post":"Carlos, please. You started by saying that there wasn’t a single case of Christ naked on the mediaeval iconography. Just as Mr. Jones had said. I gave you one. Now you ask for another. Well, I give you another example and I hope we finish the game this time. “Book of Hours Southern Netherlands” (Brabant?), C. 1375 1400: The entombment of Christ: http://www.biblical art.com/artwork.asp?id artwork=20015&showmode=Full I don’t understand what you mean by “consistency”. The only consistency we are talking about is similarity. And I said before the “similarities” that are not real or are not significant. The codex Pray is not only “consistent” with the Shroud of Turin in some aspect. It is also “consistent” with other images. And in some respects “inconsistent” with the shroud. Yes, the artist had painted a body image if he wanted to represent a body image. An angel if he wanted represent an angel. And a woman if he wanted to represent a woman. No holes, crosses and broken lines for represent Christ image. I don’t know why the presence of some small loops (not identical in both images either in number or in the form) that you can associate only subjectively with Shroud of Turin is “decisive”. This makes no sense. Please don’t make me put here sarcophagi so “loaded” as the CP. Enter that site: http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm. Write “Saintes Femmes au tombeau” at box “TITRE ENLUMINURE/SUJET” and you will find a few pictures with sarcophagi “suggestive” and “loaded”. That also does not seem even a sarcophagus! And if you also want to see a sarcophagus like zigzag patterned CP I can provide: Saint Jacques des Guérets, 12th century. I can’t argue with you (or anyone) about feelings experienced before an image of Christ or whatever else. Your “suggestions” are a personal matter. I don’t know what you mean by “cutting” and keep off the shroud. If the angel stepped on the shroud (set his foot on it) this would be a blasphemy in the iconographic and religious context of the time. Step on something or someone was a symbol of triumph over that thing. Blanrue isn’t an important personality in the area of the Shroud of Turin. (¿”Skeptic” means not in favor of authenticity?). Long ago he wrote a book and maintained a blog that closed years ago. The hypothesis that the small loops of the sarcophagus are ornaments (not necessarily diamonds) is plausible. They are similar to others that the painter place on the dresses of the characters. And these are obviously ornaments..","date":"2012-06-03","mins":"12:20 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11870","author":"david_mo","post":"Carlos: You literally wrote: “ni antecedentes ni consecuentes”. I gave you an example you asked: the difference between the second half of the fourteenth century and the first of the fifteenth centuriy in the medieval art is not relevant to discuss if there were naked images of Christ at this time. That is our topic today. Now you change the conditions that you had put forward for not having to admit your mistake. So this is no way to argue. If I give you a new example dated around the thirteenth and fourteenth century you put new conditions. And so on till infinite. In connection with your new “challenge” I had already responded in comment # 18. I have nothing new to add..","date":"2012-06-04","mins":"2:22 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11816","author":"david_mo","post":"“Especially when medieval art historians agree wholeheartedly, that that is exactly what it depicts!!” Really? How many medieval art historians? Do you know the names? At least some leading experts you mentioned..","date":"2012-06-02","mins":"3:56 pm","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11871","author":"david_mo","post":"Ron : The painting you linked us to above, how rediculous. That was painted 200 years after the pray codex, in a different religious enviroment. R How religious differences affect on the issue we discussed? What differences are you talking about?.","date":"2012-06-04","mins":"2:30 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11873","author":"david_mo","post":"Yannick Clément : (…) they were no such depiction of a naked Christ at that time in all the Christian world !!! Thanks !!! Third example I put in this forum: The Cloisters, 13th century, http://www.flickr.com/photos/elissacorsini/2163082112/in/set 72157601070709853/ Can you stop saying there aren’t images of naked Christ at this time? I get bored having to correct you again and again. Thank you..","date":"2012-06-04","mins":"2:55 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11926","author":"david_mo","post":"Yes. See my comment June 3, 2012 at 2:05 am | #18, please. If you want establish that a work of art influences another you have to give evidence, not mere conjecture. You can not ruin a test such as carbon 14 with conjectures only. In addition to the reasons given in my previous comment I add that I find very unlikely the influence of Shroud of Turin on paintings and enluminures spread across Europe, from Spain to Hungary or Scandinavia. (See this, please: Hamra Church in Gotland,14th 15th century?; http://commons.wikimedia.org/wiki/File:Gotland Hamra kyrka 08.jpg ). For this had happened, the Shroud of Turin should have been publicly known in Europe. That is not so. We know a few private exhibitions and also a few private references (almost only lawsuits) till the sixteenth century. No sign of the Shroud of Turin in meditatio mortis , briefs, sermons and prayers for the death of Christ. That an image as unknown in the literature cause a strong impact on the iconography of the time is not understandable. It’s very unlikely..","date":"2012-06-05","mins":"1:38 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11885","author":"david_mo","post":"Carlos: You lapses again in the mistakes that I have reported in my previous comment June 3, 2012 at 2:05 am., and in Jones on the Hungarian Pray Manuscript Codex as discussed in Wikipedia, June 2, 2012 at 3:45 am. That is, you arbitrarily group features that interest you and forget another you’re not interested. My commentary June 2, 2012 at 3:45 am pointed several differences that exclude the codex Pray and the Shroud of Turin identity. You apply the same procedure to pretend that the Pray codex is unique. I beg you to read my objections on this point and try to answer it (what you call “reinforce” is simply repeat the same over and over again). By the same procedure you conclude that if you have selected arbitrarily some features of the codex Pray that are repeated on the altar of Hamburg is because the last is “clearly inspired” in the first. I’m sorry, you have not proved anything. You simply have used a fallacious method: the arbitrary similarities method. And now, you arbitrarily decide what means “consequent”. No, consequent in that case is any picture in the late Middle Ages context. Namely, the three centuries period in which the theme of Christ in the tomb raises and develops to its peak. From de last years of 12th to 15th centuries. As the anointing, the burial, pianti or vir dolorum. This is a period of a coherent subject in art history, not one that you arbitrarily decide..","date":"2012-06-04","mins":"6:46 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-11888","author":"david_mo","post":"David Mo : By the same procedure you conclude that if you have selected arbitrarily some features of the codex Pray that are repeated on the altar of Hamburg is because the last is “clearly inspired” in the first. “In the Shroud of Turin”, must say, not “in the first”. Sorry.","date":"2012-06-04","mins":"7:59 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12029","author":"david_mo","post":"Matt : There are in fact 2 streaks of blood beneath the angel’s feet. And the face of jesus sits behind Mary’s right arm, rising up from the shroud, connecting to it through the alpha letter. The 4 holes are definitely the poker holes of the shroud, the L shaped alignment is assymetrical – if the circles were meant to be decorative then they would have been arranged symmetrically Matt: symmetric effects in the CP motifs end on the sarcophagus. Watch as the zigzag marks are broken arbitrarily with crosses, that also are inscribed on the crumpled napkin. You can not interpret the lack of symmetry as you do. It.","date":"2012-06-07","mins":"4:01 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12044","author":"david_mo","post":"Carlos : Y como apunta Mate, un EXPERTO AUTÉNTICO como Thomas de Wesselow acepta el carácter excepcional del Codex Pray y su relación con la Sábana Santa. Tengo criterio propio porque conozco bien el arte medieval, y comprenderá que de MÁS VALOR a la opinión de Wesselow que a la opinión suya o a la de colinsberry. I wonder if you know the work of Wesselow or is a matter of faith. Because another authentics experts aren’t so confident as you are. But maybe Wesselow provides some new arguments about the Codex Pray that we have not discussed yet. It would be interesting to know..","date":"2012-06-07","mins":"10:17 am","url":"https://shroudstory.com/2012/06/02/a-masterly-demolition-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Masterly Demolition of the Hungarian Pray Manuscript?"},{"id":"comment-12689","author":"david_mo","post":"Carlos : David, su comentario es una generalización que no tiene ninguna relación con mi comentario. Yo hablo de la Sábana de Turín ( la conocemos bien) y su muy probable relación con la Sábana de Constantinopla ( conocemos documentalmente que se mostraba a los fieles para que vieran la IMAGEN de Cristo). Generalizations??? What do you think I was talking about? Sex of angels? I made a very concrete statement about his way of thinking and an alternative hypothesis to yours based on seven specific claims. I made two very specific questions. If you do not know how to answer is your problem. No my “generalizations”..","date":"2012-06-19","mins":"1:23 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12672","author":"david_mo","post":"Carlos : Cuando se trata de establecer la posibilidad de una relación entre la Sábana de Constantinopla y la Sábana de Turín, AMBAS CON IMAGEN, es una FALACIA permanente de los escépticos ( siempre la utilizan) el hacer referencia a los 40 sudarios (?) existentes en la Edad Media, sin que puedan DOCUMENTAR mínimamente ninguno de esos INEXISTENTES sudarios ( CARENTES DE IMAGEN). Carlos / Corneliotel (?): Your reasoning does not include a fallacy. It includes at least two. You pass from “I do not know” to “nobody knows”. And from “nobody knows” to “there is not”. Logically inconsistent. How do you base your assertion that nobody knows painted shrouds in the Middle Ages? I believe that such a claim could only make it emphatically by an expert in medieval art and plenty substantiate on the material studied. In this forum no one has mentioned an expert of such characteristics. Furthemore, I do not claim neither existed or nor painted shrouds. My reasoning is much easier to understand. 1. There were at least 40 shrouds of Christ in the Middle Ages. 2. One of those shrouds at least was known and had a full body image. De Clari mentioned it. 3. About 1350’ there was in Europe an intense and lucrative trade of relics. 4. About 1350’ there were several canvases with the image of Christ “not made by human hands.” For example, the Veil of Veronica had been a resounding success in Rome. 5. There were pictures (frescoes and manuscripts) representing Christ in the tomb in the same position of the Shroud of Turin. 6. There were pictures of Jesus naked. Many of them represent baptism. 6a. I have put here a 12th century image representing the embalming with naked Christ.. 7. It is possible that a forger or forgers group decided to make a relic with those characteristics that represent the true shroud of Christ mixing all these precedents (common models of its time). 8. This relic could be the Shroud of Turin. Can you say which of these statements is false or contradictory? Can you say why you don’t accept my hypothesis?.","date":"2012-06-18","mins":"9:42 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12692","author":"david_mo","post":"“…your way of thinking”, sorry..","date":"2012-06-19","mins":"2:06 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12690","author":"david_mo","post":"Yannick Clément : < For me, the study done by Vignon and somewhat confirmed by Whanger, concerning the high level of concordance between the image of the face on the Shroud and the image of Christ’s face on the copies of the Mandylion, gave results that are good enough to state that there really is a true link between the 2 objects, even if the Mandylion is not the Shroud, just like the Pantocrator is not the Shroud… This link proves that the Shroud is much older than the C14 result of 1988 and can be dated to at least the end of the 6th century, if it’s not before… For me these similarities do not prove anything. Vignon and Whanger are not experts in Byzantine art. They accumulate a number of similarities between a few Byzantine images and the Shroud of Turin. But no method at all. They forget the fundamental characteristics of Byzantine Christs that do not appear on the shroud of Turin. See Erwin Panofsky, Meaning in the Visual Arts: the symbolic circles in the head. But althoug there was similarities between the shroud of Turin and the Byzantine Pantocrator, this would not mean anything. Would have to show which of the two influences the other. And remember that Byzantine art existed long before the Shroud of Turin was known..","date":"2012-06-19","mins":"1:45 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12739","author":"david_mo","post":"Yannick: It would be preferable further clarify references. We understand better from the start. Although you would intend to refer to Christ in the monastery of Saint Catherine, that does not give more strength to your argument. I do not know much of Byzantine art, but I know some things. It is not true that the image of Christ of Saint Catherine is the first in which he appears with a beard, the book in one hand and extending the other. Despite what is stated, the bearded Christ is a representation existed since the early Christian centuries (For example: Christ between alpha and omega in catacomb of Comodilla). He symbolized the Divine Wisdom and some relate it to the Arian controversy. In the basilica of Santa Pudenziana in Rome is an image of Christ in Majesty, bearded with a book in hand and the other extended. Although the mosaic was restored Christ’s image is of the 5th century. Perhaps the claim that the icon of St. Catherine is the first Pantocrator refers to the first Christ’s image to which that meaning is attributed. However, the concept of Pantocrator is 4th century. But I insist that the argument that certain similarities between Byzantine icons and the Shroud of Turin can be explained by stating that Byzantine art stems from the Shroud makes no sense. It works rather in contrary direction..","date":"2012-06-20","mins":"1:29 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12700","author":"david_mo","post":"Yannick Clément : Remember that the Pantocrator and the Mandylion were copied on numerous occasion and these copies are pretty much the same. If I would present you 10 copies of the Pantocrator and 10 copies of the Mandylion and tell you that there originals are in that group, I think you would have a hard time finding the authentic artworks. It’s not the same at all for the Shroud and the copies that were made from it. This little example is enough to understand that the probability that the Shroud was at the origin of these icons is highly probable. Your argument begins with an error and an unverifiable assumption. The error is that what we call “Pantocrator” is not a concrete image that was located anywhere. It is an iconographic category designating all the images that represent God in his power, or God Almighty. We need not suppose that there was a first christian pantocrator that was copied from others. The image was evolving from that of Zeus Pantocrator up to a canonical form. Speaking of copies “of the Pantocrator” is meaningless. It’s like talking about copies of “The Madonna” or copies of “The Holy Women.” The second assumption is unverifiable. There were copies of the Mandylion, but we do not know how the original or copies were. What we know are recreations made from imaginary descriptions. So we can have no certainty about the original copy relations in the case of the face of Edessa. So, your argument loses all sense. PS: We detect easily the shroud copies because they are no good copies. But sometimes the copist is better artist than the original. Then the task becomes more complicated. Unless we have additional data. That is not the case under discussion..","date":"2012-06-19","mins":"9:07 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12741","author":"david_mo","post":"Please Yannick, you mistake legends for facts. I copy of a web page: “According to a legend that hasn’t been confirmed, Jacques Pantaléon of Troyes, the former archdeacon of Laon Cathedral and the future Pope Urban IV, sent the icon of the Holy Face to the convent of Montreuil les Dames in 1249. But dependable sources—notably a text from 1467, which mentions the worship of the image—only attest to the presence of the icon in Montreuil from the fifteenth century.” To my knowledge there is no certainty that any of the alleged copies of the Mandylion is a real copy and not a false copy or recreation. Not knowing the original is difficult to know which is closer. You can’t base any argument on these vagueness..","date":"2012-06-20","mins":"1:42 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12702","author":"david_mo","post":"Carlos : … Hacer una reliquia FALSA no precisa de ANTECEDENTES. (…) FALSIFICAR UNA RELIQUIA precisa de la existencia de un ORIGINAL (auténtico o falso), que es lo que se falsifica. ¿Admitiría usted que sus “falsificadores” pretendieron FALSIFICAR la Sábana de Constantinopla desaparecida hacia el año1200? I find some contradiction in the first two phases, but good. Making a false relic suppposes no “original” really existing. Just imagination and people credulity. No one with common sense would think that wiping the sweat from the face the eyes can be printed. However, many images circulated with the face and eyes of Christ imprinted on cloths in the Middle Ages. Alleged printed at Gethsemane and on the way up to Calvary. The first to invent this kind of relics was not based on any original. As was not based on any original archangel feather who invented relic of Archangel Michael’s feather, which apparently there are several copies. Therefore, no. We can’t know whether a potential forger tried to copy the shroud that de Clari mention or put your imagination in motion from dispersed materials without an unic reference. It seems more likely the second assumption. Because de Clari says the shroud disappear after the city sacking and from 1204 to 1350 is a long time without news of the Shroud of Constantinople..","date":"2012-06-19","mins":"9:35 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12743","author":"david_mo","post":"Carlos : David, sus “seven specific claims” son generalizaciones, con excepción de la 2 ( existencia de la Sábana de Constantinopla con la IMAGEN de Cristo), porque no son precisas ni son necesarias para HACER UNA RELIQUIA FALSA o para FALSIFICAR UNA RELIQUIA. I do not understand your reasoning. My seven claims were precise and true. I have put here documentation confirming each. Some truths are so glaring that would be impossible to deny them (traffic of relics in the Middle Ages, for example). Some of them have been admitted to this forum by yourself. Now you say they are not “precise” (?). You have a very particular way of deriving their claims as agreed or not their beliefs. Certainly they are not “necessary” to explain a forgery of a relic. They are “sufficient”. Do you understand the difference? Well, don’t attribute the claim that they are necessary to me, because it is not what I’m saying..","date":"2012-06-20","mins":"2:02 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12744","author":"david_mo","post":"“…You have a very particular way of deriving their claims as agreed or not their beliefs. ” Must say “…your claims as agreed or not to your beliefs.” Sorry..","date":"2012-06-20","mins":"2:06 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12835","author":"david_mo","post":"You make a mistake. See better the picture here: http://www.unito.it/unito WAR/Show Binary/FS Repo/X033/Allegati/sacre impronte.pdf. The Mandylion is not the pink cloth. It is clearly differentiated by color. The Mandylion is white and cloth pink. This pink cloth is the cloack of the character who present the Mandylion to the emperor. It has the same color and appearance than the other capes. As the Mandylion was a sacred image the man can not touch it directly. So he holds it with his cloak. There is no description of the Mandylion as an image of a full length body. This is acknowledged even by M. Poulle..","date":"2012-06-21","mins":"3:41 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12834","author":"david_mo","post":"Good morning, Art Science: I do not agree with Mr. Jones and you. I think there is another possibility. The painter of the Codex Pray is using an iconographic framework. He intend to paint some thing as the Ingeeburg Psalter (Musée Condé, Chantilly, 1195 circa). (http://imageshack.us/photo/my images/856/ingeburgchantilly.jpg/). Or this one: http://www.photo.rmn.fr/cf/htm/C Search Z.aspx?o=&Total=34&FP=63233701&E=2 K1 KTSGGDDHHR&SID=2 K1 KTSGGDDHHR&New=T&Pic=25&Sub E=2 C6 NU0 TPSXFQ. (Allemagne, Berlin, Skulpturensammlung und Museum für Byzantinische, 14th Century). But I prefer this one: http://www.europeana.eu/portal/record/03918/8 F93197282 B8 D6 BAE3866 E1013 EEED4534653 F36.htmll , (Heures. Vie de sainte Marguerite , mise au tombeau , 1300). You can see how the idea of linen which continues on the back or the hands of the characters is a commonplace at the time. But not everyone has the same idea of continuity. I prefer the comparison with the Book of Hours. Life of Saint Margheritte because it coincides perfectly with the folds under the head and feets that represent the end of linen at this point. The same that Mr. Jones marks with green. And you can see that the concept of the wrapping sheet is different to the shroud of Turin. It is a lateral wrapping. In any case, I would not draw hasty conclusions from a glance on the picture. You have to know a lot of medieval art. And do not think that the Codex Pray artist paints directly what your eyes see or your imagination dictates him. In the Middle Ages there were iconographic models. And the artists use those models. Not realistic representation of reality..","date":"2012-06-21","mins":"3:25 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12861","author":"david_mo","post":"Thank you, Art Science. My opinion is stated above: comment of June 21, 2012 at 3:25 am. I see the last link do not works well. Please, try with: Mise au tombeau. Heures ; Vie de sainte Marguerite. Http://www.culture.gouv.fr/public/mistral/enlumine fr?ACTION=CHERCHER&FIELD 98=SUJET&VALUE 98=%27 Mise%20au%20tombeau%27&DOM=All. It is the last picture of the list..","date":"2012-06-21","mins":"9:26 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12875","author":"david_mo","post":"Art Science : I think that my original point that the shroud depicted in the PM is actually very long, is still valid whether the artist is trying to do something like the Ingeeburg Psalter or attempting a depiction of the shroud. Though whether the top and bottom images on the PM are both actually the shroud seems debatable. Some nice puzzles to think over. BTW Do you know what is being depicted but the long extended cross extending from the bottom image to the top image? There almost seems to be a detached hand holding the cross. If there are the same opportunities of truth for hypothesis A and hypothesis B, we say we do not know if either A or B. That is, we do not know if the painter of the codex had seen the shroud of Turin. That is what some sindonists are trying to prove. But I think one of the two hypotheses is extraordinary. It is extraordinary that a monk from a Hungary monastery had information about the type of weave of a cloth exposed to the crowd in Constantinople. And remarkably, the monk had chosen represent this instead the image. I do not know similar cases in medieval art. And extraordinary events require extraordinary evidence. No such evidence exists; so we can say that it is very unlikely that the Pray codex represents an image of the Shroud of Turin. Moreover there are strong indications or evidence that the image of the codex Pray is not inspired by the Shroud of Turin. For example: The sindonists emphasize the anomalous position of the marks of blood on the hands. They think it is a specific feature of the Shroud of Turin that is not found elsewhere. But the hand marks in the codex Pray are in the palms, as in almost all works of art. Therefore we can say for sure hat the Codex Pray artist had no information about the Shroud of Turin. For the first reason I would be skeptical about the Pray Codex is inspired by the Shroud of Turin. For the next two I can say that I am sure that this is not true. PS: Ingeburg (or Ingeborg) in English, not “Ingeeburg”. Sorry for my error. She was a Danish princess who was married to Philip II Augustus of France. It seems with not much enthusiasm on their part..","date":"2012-06-22","mins":"2:25 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12940","author":"david_mo","post":"Art Science: There is not throughout the Middle Ages an image painting a subject in terms of the weave of a fabric or material. That would be extraordinary. There is no possibility of perceiving the weave of a fabric if not taken into hands and look at this detail. Impossible for an obscure Hungarian monk had had this opportunity. That would be extraordinary twice. No one representation of the Shroud of Turin till the modern times portrays him as “faint.” (Fibula, della Rovere, Clovio, etc.) The Shroud of Turin did not look as today at least till the sixteenth century. At that time a witness describes it as “done today.” If the resemblance of the image is so vague that it can be attributed to poor memory of the painter, it can also be attributed to the painter never saw the shroud of Turin. The theory that the Pray codex is a copy of the Shroud of Turin is kept only if you can establish clear similarities that only can be explained as copies. If it doesn’t matter the wounds are or are not in the palms then the resemblance is unverifiable. The logic conclusion is skepticism. Sindonists derive from the assertion of the theory of strong resemblance to one of the likeness weak when they are in trouble. That’s cheating, bluntly speaking..","date":"2012-06-23","mins":"1:50 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12876","author":"david_mo","post":"Menedemus: Ferdinand de Mély (Le Saint Suaire de Turin est il authentique? Paris,1902, p. 21) briefly cites forty sindones. It should be borne in mind that the concept need more precission. It include complete shrouds with or without image and wraps. Gaetano Ciccone quotes 16 full shrouds: “1 – Sindone di Torino 2 – La Santa Sindone di Aquisgrana 3 – Il Santo Sudario di Arles 4 – Il Santo Sudario di Besançon 5 – Il Santo Sudario di Cadouin 6 – il Santo Sudario di Cahors (Sainte Coiffe) 7 – Il Santo Sudario di Carcassonne (Saint Cabouin) 8 – Il Santo Sudario di Compiègne (Saint Seigne) 9 – Il Lino di Cristo di Iohanavank in Armenia 10 Il Santo Sudario di Lisbona 11 Il Santo Sudario di Magonza 12 Il Sudario del Senor di Oviedo 13 La Sindone di Parigi 14 Il Santo Sudario di San Giovanni in Laterano in Roma (da non confondere con l’immagine acheropita del Laterano che è un dipinto su tavola). 15 Il Sudarium Christi di Andechs in Baviera (che sarebbe una metà) 16 La Sindone Mondissima di Limoges.” (Gaetano Ciccone: La Sindone svelata e i quaranta sudario Editrice Donnino, 2006) The same author quotes 100 fragments of Christ’s shroud. According Ciccone most shrouds had not image. But he says also that from many others we have not even description or an incomplete description only. This is the situation of the relics of the Shroud in the Middle Ages. I ought this information to an e mail from Antonio Lombatti, June 13, 2012..","date":"2012-06-22","mins":"2:49 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12627","author":"david_mo","post":"Ron : I have my own assumptions aswell; such as what we see is the Shroud (outter) side with the herringbone weave, 4 poker holes and wavy blood streaks depicting what can be seen on the outter side of the Shroud. The Red cosses and some red ‘x’s with the 5 poker holes depicts the inner side of the Shroud (the image side), R 1. You can’t refute a scientific test with assumptions. If you want to refute scientific evidence you must provide scientific evidence, not speculation. Speculation about the Codex Pray do not override the carbon14 test. 2. Speculation about the holes are not subjective, it is non consistent because need to combine different criteria for the four holes in “L” form and the five as “P”. Please, go to Latendresse page http://people.bridgewater.edu/~rschneid/Focus Projects/Shroud/Shroud Measure/enrie Img.html and say us the coordenates of the four and five holes that you see in the shroud. Then, go to the Shroud Scope ( http://www.sindonology.org/shroud Scope/shroud Scope.shtml ) click on “Poker Holes” box and explain us how is possible than you see a group of five holes and M. Latendresse only groups of three or four..","date":"2012-06-17","mins":"1:40 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12637","author":"david_mo","post":"Mario Latendresse : On the Shroud Scope I have drawn overlaying bounding boxes for the so called poker holes on the Shroud, but, sorry, they are not indicative of the way these holes could have formed neither how many holes exist near these bounding boxes. Clearly there is a pattern of more than four holes at one location on the Shroud. That one location has a similar pattern as the one on the Pray Codex miniature. See (…) The Pray Codex cannot be understood without referring to the diplomatic context of Hungary vs Constantinople. Hello, Mr. Latendresse. Congratulations for your wonderful pages Shroudscope and Length Measurements…. Both are very useful. Now, some questions: 1. If you don’t see poker holes in “L” forms why do you highlight it with these forms? 2. Can you say the coordenates of the poker holes in “L” and “P” forms? 3.You suppose Bela III had to see the shroud of Turin in Byzantium. Is there a document in this regard? Or is it just a guess? 4. To assume that Bela III saw the shroud in Byzantium we must first assume that the shroud was in Byzantium. Are not too many assumptions? Do you have any more than assumptions? 5. Do you know any medieval description of any medieval cloth with Christ (Mandylion, shroud, Veronica, etc.) figures describing the weft of the tissue? It would surprise me greatly. Thank you..","date":"2012-06-17","mins":"1:03 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12636","author":"david_mo","post":"Ron : … come on Colin, you along with Mo and curly see a few old paintings with a ‘Lid’, (and let me stress again here that only a few of the dozens upon dozens of burial paintings show a lid at all.) R Does this statement is based on a personal study? How many dozens of coffins have you counted? I did a small survey that is somewhere in these forums. Almost a third of the coffins at the scene of the Holy Women were represented with its cover beside it. Although no more than a quarter would be sufficient to conclude that this type of representation was common in medieval paintings. Here a massive representation of sarcophagus with its lids. Several lids are rectangles placed diagonally. As in the Codex Pray. Http://imageshack.us/photo/my images/820/ataudes.jpg/ Toledo, San Román church, 13th century..","date":"2012-06-17","mins":"12:36 pm","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12655","author":"david_mo","post":"I respect your opinion, Mr. Latendresse’s opinion and any other opinion. But your answer evade my question. In european football we say “throw balls out”. It is a way of stop the game when things go wrong..","date":"2012-06-18","mins":"1:49 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12653","author":"david_mo","post":"Thank you. My answers: 1.Yes, I agree. By “simplifficación” I understand that to highlight the structure of the holes can be said that there are five in the shape of “P” or 15 shaped “O” or rectangle. That is, identify holes and is arbitrary. If we adopt a model we see “L” and “P” and if we adopt another will see rectangles or “O”. 2.No. The concrete description of the coordenates shows that you can only see “L” and “P” if you use different norms. That is, big holes only for the “L”, big and small holes for the “P”. And you forget the holes disturbing your interpretation. Conclusion: The similarity between the Codex Pray rings and poker holes in the shroud is arbitrary. 3 4: I agree: there was a shroud with image in Constantinople. But not “reported by various written documents”. Only crusader de Clari mentions it in 1204 (a few later the death of Bela III). 5. No. I did not ask you for representations of the shroud, but for descriptions. We know very little medieval descriptions or representations of the shroud of Turin. We know a little more for the Mandylion and the Veronica Holy Face. No reference to the weft of the fabric is done till modern times. No reference of the poker holes. Medieval descriptions talk about the placement of the hands, the face of Jesus, his expression and wounds. The weft of the fabric or the holes (if there were) was irrelevant information. Is highly unlikely that Bela III says this to painter and this one paints just this to report the presence of the shroud of Turin in the tomb. This explanation has no base. It is just absurd. Conclusion: There is not evidence of any relationship between the shroud in Constantinople around 1200 and the Pray codex. Only baseless assumptions..","date":"2012-06-18","mins":"1:38 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12654","author":"david_mo","post":"“Thank you, Mr. Latendresse”. Sorry..","date":"2012-06-18","mins":"1:40 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12660","author":"david_mo","post":"Mario Latendresse : As for the level of coincidences of the Pray Codex miniature details and the Shroud, it is important to take into account the entire context and details at the same time. So far, in the discussion that has been going on this post, none ever refer to the essential fact that Bela III, king of Hungary when the Pray Codex was produced, had been at the Constantinople court for a decade a few decades prior to 1293 1295 and was almost at the level of Byzantine emperor while over there. He surely must have seen the shroud that was in Constantinople. Given the fact that the shroud of Constantinople is the most likely place where the Shroud of Turin was, this fact cannot be put aside. To all readers, where do you think this thread comes from? It is assumed that Pray Codex proves the existence of shroud of Turin before 1350. You can not start assuming what the argument is to prove: the “likely” existence of the Turin Shroud in Constantinople prior to 1350. This is a logical fallacy. True, the context is important, but only if we can link the context to events. Moreover, there is another important context for understanding the presence of a shroud in Constantinople in 1204 and the shroud of Lirey in 1350: the frenzy market of relics broke out in Europe at that time. A lot of relics manufactured in the Middle East was spread out by the courts of Europe at great prices. Even small religious centers participated in it. Thus it arose forty shrouds, several holy face, boxes of nails of Calvary, forests of the Holy Cross, feathers of archangels, liters of Jesus’ blood and other nonsense. Do it have to do with the mysterious appearance of a fabulous relic in a modest collegiate church of France in the midst of the Hundred Years War? Very likely. You see, the context is multidirectional..","date":"2012-06-18","mins":"2:29 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-12661","author":"david_mo","post":"Ron : David Mo :I respect your opinion, Mr. Latendresse’s opinion and any other opinion. But your answer evade my question. In european football we say “throw balls out”. It is a way of stop the game when things go wrong. Did you ask me a question? I didn’t see one. If you meant a return as to how I see 5 holes, I said look for yourself! If you don’t see that one of the poker hole patterns is made up of 5 distinctive if not more holes, you along with Colin need an eye examination. R Well, say in what coordenates you see the 5 holes. It is easy. The discussion will end immediately. Otherwise we only have free charges on lack of sight. Is it a matter of ophthalmology?.","date":"2012-06-18","mins":"2:36 am","url":"https://shroudstory.com/2012/06/13/a-pointless-discussion-of-the-hungarian-pray-manuscript/","cat":"art","title":"A Pointless Discussion of the Hungarian Pray Manuscript?"},{"id":"comment-11794","author":"david_mo","post":"Mr. Stephen Jones has write in his blog, The Shroud of Turin (Sunday, May 27, 2012), a comment that includes usual topics on the subject of the Codex Pray with some personal contributions. I find these statements are meaningless and I explain why: “These are the main features shared in common between the Shroud and the PM. But a more complete list includes at least twelve (12) unique features shared between the PM and the Shroud: “1.Jesus is naked (uniquely in the medieval era);” False. “2.His hands are crossed over His pelvis;” Irrelevant. It is a normal position in the entombment representation. In the case of Christ or others. “3.Jesus’ right hand is over His left;” Irrelevant for the same reason. “4.there is a nail bloodstain in His right wrist (Plate IV);” Subjective. I don’t see it at all. “5.no thumbs are visible;” Irrelevant. It is a normal position in the medieval imagery when the hands are crossing. “6.Jesus’ fingers are very long;” Irrelevant. It is a normal representation of the hands at iconography of the time. “7.there is a mark above Jesus’ right eye corresponding to the reversed `3′ bloodstain on the Shroud of Turin;” Subjective. I don’t see it. “8.the Shroud is more than double the body’s length;” And…? “9.the Shroud has a herringbone weave pattern;” Irrelevant. There is not any representation of herringbone weave in the Pray picture. There is gravestone ornaments. You can find similar ornaments on others gravestone medieval representations. “10.the Shroud has an L shaped pattern of four `poker holes’; 11.and another pattern of five `poker holes’;” Subjective. There are groups of five or eight holes and you can bring them together as you like. Never in form of “P”, as in the codex Pray. “12.the end of the PM’s shroud below Jesus’ feet (upper scene) has a ragged edge which corresponds with (i.e. Does not perfectly match) the Shroud of Turin’s, with the latter’s missing corner not yet removed.” Subjetive. I don’t see it. And it is absurd, because you can find millions pictures of cloth pieces as the Shroud of Turin before being cut. In short: all the alleged identity between the image of Turin and the Codex Pray are false, absurd, irrelevant or subjective. I can show examples of all the statements I have made, but I think they are unnecessary because any amateur of medieval art known them. But I shall do it if you wish. But it is easy to find some important differences. These differences show us that the author of the Codex Pray illustrations had not in mind the linen of Turin when drawing. 1.There is no direct representation of the shroud with the imprint of Christ, as one would expect in a medieval illustration that would represent it. The idea that the artist’s left esoteric “marks” for “connaiseurs” interpretation is contrary to the canons of medieval painting. 2.There are no marks of blood in the codex illustrations (CPI). (Only one exception: small marks in the hands without blood yarns). In the Shroud of Turin are abundant. 3.In the CPI the shroud ends at shoulders. It can’t wrap the head. 4.In another image of the CP hand injuries are on the palm, not near the wrist as in the Shroud of Turin. 5.In the CPI Jesus has a small beard. 6.The structure and form of the CPI are typical of the iconography of the Holy Women at the Tomb. The angel is sitting on the grave and he shows them the shroud (the creased cloth). 7.It is unthinkable that a Christian artist of the Middle Ages paints the angel stepping on the Christ Shroud. What is under the foot of the angel is the tombstone, not the shroud. Therefore, it is clear that the representation of the Codex Pray has nothing to do with the image of the Shroud of Turin. (I apologize for my English. It is not my usual language, obviously. I hope it’s intelligible at least and you don’t spend long time decrypt it, as Mr. Jones uselessly spends with the Codex Pray)..","date":"2012-06-02","mins":"3:45 am","url":"https://shroudstory.com/2012/05/27/jones-on-the-hungarian-pray-manuscript-codex-as-discussed-in-wikipedia/","cat":"art","title":"Jones on the Hungarian Pray Manuscript Codex as discussed in Wikipedia"},{"id":"comment-11929","author":"david_mo","post":"Yannick: The codex Pray date is 1192 5. No great difference with the 13th century. I don’t know if it is unique in some sense. I am not expert in medieval art, are you? And if so, what would that prove? Some paint will be the first, right? The identification of the Shroud of Turin and the canvas Robert de Clari mentioned in Constantinople is, again, pure speculation. As for the holes in an “L” (?) shape I’m tired to repeat everything I said. I think in this forum only reads what I write Dan Porter. Thank you, Dan..","date":"2012-06-05","mins":"2:35 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11935","author":"david_mo","post":"Carlos: An artist inspired by other artists’ works does not need to be limited to imitate one and only one of them. He can take elements of such different works and composing his own work. An fourteenth century artist had available images of Jesus in the tomb with his arms crossed and images of Jesus naked in the tomb, pictures of Jesus almost naked in the tomb with his arms crossed, images of Jesus completely naked in baptism, and so on. He could draw on some or all of them to compose their own image. This is how artistic inspiration works. It does not seem so difficult to understand. And the same way for Codex Pray. If the artist had to imitate an earlier image this picture would not exist. : Lamentation of the Virgin, The Rohan Master,1435, http://en.wikipedia.org/wiki/File:Lamentation of the Virgin Rohan.jpg. This one is really unique!.","date":"2012-06-05","mins":"5:03 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11941","author":"david_mo","post":"Carlos : Yo le entiendo perfectamente, ahora usted debe intentar entenderme a mí. Advertirá que es completamente FALSO que la postura de los brazos cruzados sobre el pubis ocultando los genitales en la imagen de la Sábana de Turín se deba a convencionalismos medievales .¿ Lo entenderán los ESCÉPTICOS? Pues no. No lo entiendo ni creo que Ud. Me entienda a mí. Porque hace afirmaciones rotundas que no puede demostrar. Como la anterior. Y se pone a discutir sobre los pulgares del Maestro de Rohan. Una cuestión que no tiene nada que ver con lo que yo argumentaba. Yo digo A y Ud. Me responde que no B. Etc., etc. Me deja perplejo. ¿Tiene problemas con mi inglés? Translation: Well, no. I don’t understand you and I believe you don’t understand me. Because you make strong claims that you can’t prove. As above. And you get to discuss the thumbs of Master Rohan’s painting. One issue that has nothing to do with what I argued. I say A and you reply me that not B. Etc., etc.. I am puzzled. Have you problems with my English?.","date":"2012-06-05","mins":"9:31 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11949","author":"david_mo","post":"And this is not a naked Christ? Previous or after the codex Pray?: http://diglib.library.vanderbilt.edu/diglib viewimage.pl?SID=20120605340667724&code=&RC=47779&Row=&code=act&return=act Is it likely that a similar picture could inspire the author of the codex Pray the idea of painting a naked Jesus while being embalmed? But in the baptism the water almost hide the Christ’s sex. How could he do the same at the scene of embalming? Perhaps inspired by this image? “It is futile to do with more things that which can be done with fewer” (William of Ockham)..","date":"2012-06-05","mins":"12:12 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11975","author":"david_mo","post":"Carlos : Colinsberry, creo que usted de arte medieval NO ENTIENDE NADA. I think no one at this forum is a real expert in medieval art. Neither you nor I are. But you make a few basic errors that are detected immediately. (Also Yannick, and others). 1. You make basic mistakes, like when you say that there was no convention of painting the dead (not the Christ only) with arms crossed over his abdomen. You want examples? 2. You talk about identity when speaking of similarity. 3. You look only at the similarities and forget differences. Striking differences especially. 4. Your theory of the medieval artist who leaves clues “encrypted” is illusory. I have never seen or read anything similar. Medieval artists represented its subject directly or resorted to conventional symbols of his time. Perhaps the Codex Pray is “unique” at this issue also 5. You talk about a process of transmission of iconographic motifs that is not real. The art forms do not arise by diffusion of a single work all imitate, even in cases of very famous works in his time. 6. You seem to believe that the thing you know matches what exists. In the Middle Ages there was a wealth of manuscripts and paintings now disappeared. Only a few thousands of the hundreds of thousands of manuscripts and paintings survives. These thousands are but the tip of the iceberg. To say that the Codex Pray was the first naked representing Christ in the tomb is naive. In all likelihood is just the tip of the iceberg. Finally: I exposed a plausible method of work for the codex Pray artist that does not involve direct imitation of any painting allegedly existing in Constantinople or anywhere. I have not heard responding to my proposal. Unless the answer is to repeat once more that the codex Pray is the only one that was identical to the Shroud of Turin. As Colin and I have amply demonstrated, neither is true. It is neither unique nor identical..","date":"2012-06-06","mins":"2:00 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11976","author":"david_mo","post":"Yannick Clément : Find me the correct datation of this baptism scene and we will talk. But anyway, you have to understand that the nudity of Christ in the artwork you show me is relative because the artist has found a way to cover the genitals. Of course, you’ll tell me that it is also the same thing for the Pray Codex, but there’s a major difference : the scene depicted in the Pray Codex correspond exactly with the image on the Shroud. The baptism scene you show me has nothing to do with the Shroud or the Passion of Christ. Palatine Chapel, Palermo. 12th Century. We talk? Yes, the passion is not baptism. I know. The Pray artist also knew. But he had the same problem as the Palatine Chapel artist: how to paint a naked Christ without showing your sex? The Palatine artist found the solution in water waves. The Pray Codex artist used a conventional resort in the painting of 12th, also common in real burials: hands folded on his abdomen. (See Charles Freeman: The Shroud of Turin and the Image of Edessa: A Misguided Journey On burial practices). Other artists solved the problem differently. They place people in front of the body of Christ. Or putting a cloth napkin. Perhaps the solution of the Pray codex artist was original, but not so original because he used iconographic resources of his time. It is not necessary to resort to a hypothetical visit to Constantinople or a hypothetical vision of a hypothetical shroud of Christ, and so. Too many assumptions. Remember Ockham’s Razor..","date":"2012-06-06","mins":"2:27 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-12024","author":"david_mo","post":"Christ Baptism Images. Before 1200. Some examples. Neonian Baptistry, Ravena, end 5th century. Http://en.wikipedia.org/wiki/Baptistry of Neon Arian Baptistry, Ravena, 6th Century , http://en.wikipedia.org/wiki/Arian Baptistry Cappadocia. Göreme, ‘Karanlik Kilise’. Fresco (early 12th century) http://www.superstock.com/stock photos images/1788 2583 St. Martin Church, Zillis, Swiss, 12th Century. Http://www.zillis st martin.ch/hauptseite.htm (Click “Bilderdecke”) Manuscript, Clermont Ferrand – BM – ms. 0001, 12th Century, http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm (Write “BAPTEME DU CHRIST” in the box “TITRE ENLUMINURE/SUJET” + Click “RECHERCHER”) Manuscript Autun – BM – ms. 0019 bis, 9th Century. Http://www.enluminures.culture.fr/documentation/enlumine/fr/rechexperte 00.htm (Write “BAPTEME DU CHRIST” in the box “TITRE ENLUMINURE/SUJET”) Baptême de Jésus , Hortus deliciarum, 12th. Baptême de Jésus , Evangéliaire d’Echternach, Nuremberg, 11th. Baptême de Jésus, Psautier, Melk, 12th Baptême de Jésus, Monastère d’Erevan, Ethiopie, 11th I hope it’s enough for you..","date":"2012-06-07","mins":"1:24 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11984","author":"david_mo","post":"Carlos: The Codex Pray image doesn’t have the hands just above the pubis, but in an unspecified area of the abdomen. And the right hand is not placed on the left hand, as in the shroud of Turin, but both hands are crossed at the wrists level. Thus, the Pray codex does not meet the conditions you require. It can’t be “inspired” by the Shroud. One thing is the symbol and other the signal. You confuse the signal (index or trace) with the complex relationship that exists between the symbol and the symbolized. Medieval artists used coded symbols to refer to the sacred. No signals..","date":"2012-06-06","mins":"6:27 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11995","author":"david_mo","post":"Carlos: We are talking about the Codex Pray. We are discussing whether the Codex Pray can be explained as an imitation of the Shroud of Turin. Therefore, I was referring to the Codex Pray hands, not the Shroud of Turin. I think you confused In conclusion I link to an image that inspires the codex Pray. Not that one copy to the other, but form and matter are the same. They are very similar because they use a common model.I invite you to observe carefully and compare where the angel sits. Yes a sarcophagus! http://imageshack.us/f/856/ingeburgchantilly.jpg/ Ingeburg Psalter, c. 1200; Musée Conté, Chantilly. (Picture from Arte/Rama, vol. IV, “Del periodo carolingio al gótico”. B. Aires, Ed. Codex, 1961, p. 133.) People say a picture is worth a thousand words. Sometimes it is true..","date":"2012-06-06","mins":"9:50 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-12040","author":"david_mo","post":"Mr. Moose and others: When I spoke of models I was not refering to a particular object, but a mind image, an iconic model, as is seen in various objects, images of manuscripts, frescoes, etc. It is transmitted through various works, much of them disappeared long ago. Remember that we are only seeing the remains of missing material. I explain the similarities (!) of the codex with the Shroud of Turin based on previous examples from the time of the codex Pray. And by rthe same way I can explain why it is the first image similar (!) that we know. Basing it on a composition of elements from preexisting models. For their explanation the sindonists need to forget the differences and add the assumption of the existence of the Shroud of Turin. That is: forget relevant facts and make aditional suppositions. That’s why my explanation is better than the sindonists explanation. And none of them has disputed me its validity. The case is closed for me. At least for now. PS: I don’t interpret by the same way as you the cloths you see on Joseph’s shoulder and into the hands of John. The sheet on Jesus lies just ends under his shoulders and feets. Neither the fifteen holes about appearing in the shroud of Turin are equivalent to eight or nine in the codex Pray. But these items seem already discussed and makes no sense discuss them again..","date":"2012-06-07","mins":"10:00 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-11997","author":"david_mo","post":"Carlos : Pero muchas copias de la Sábana Santa realizadas a TAMAÑO NATURAL confunden la posición de las manos cruzando los brazos por encima de las muñecas o por las muñecas, e incluso algunas confunden los brazos y es el brazo izquierdo el que está debajo del brazo derecho ,etc, etc, etc Incluso la copia atribuida a Albrecth Dürer comete ese tipo de error. Http://www.redentoristas.org/sabanasanta/archivoscomoseformo/pictor.jpg ¿Estarán esas copias NO inspiradas en la Sábana santa? No, Carlos, no: We say that these copies you linked resemble the Shroud of Turin for other reasons. Not by the hands. If those other reasons were not convincing we should say that they aren’t copies of the Shroud of Turin. This is what happens with the codex Pray. PS: No offense Dürer, please..","date":"2012-06-06","mins":"10:12 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-12492","author":"david_mo","post":"No. I don’t think so. Maybe you are right and the Codex Pray artist knew the model iconographic that represent a larger shroud on Joseph of Arimathea’s shoulders. But he reinterprets the model in his own way. He paints clearly the end of the sheet under the shoulders and foots of the corpse. It is clearly seen in the bottom angle of the cloth that would be impossible if continued. The realism of the Pray codex painter is quite poor, but here it is very clear. If there is an angle, there is the end of the cloth. If the thing on the shoulders of Joseph and John’s hands were the same sheet the painter should paint both in the same way. This is not the case..","date":"2012-06-15","mins":"1:42 am","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-12900","author":"david_mo","post":"Nothing new. Credo quia absurdum est..","date":"2012-06-22","mins":"9:37 am","url":"https://shroudstory.com/2012/06/22/pray-manuscript-thank-you-colin-and-david-mo/","cat":"art","title":"Pray Manuscript: Thank you Colin and David Mo"},{"id":"comment-132888","author":"david_mo","post":"I am traveling and I will be synthetic. O.K.’s proposal has several basic mistakes: 1. Errors of knowledge of the medieval art. The percentages assigned to some characteristics are erroneous (very low). Croissed hands, thumbs, etc. See here: https://picasaweb.google.com/112820198650228388541/Lienzo prolong# 2. Ambiguity in the concepts. “Similar to” is not mathematically useful. Croissed hands are not a hand over the other. Etc. 3. Confusion between different objects. The shroud of Turin is not a representation of Jesus in the tomb. I will be more explicit Saturday morning..","date":"2014-06-26","mins":"3:56 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-132956","author":"david_mo","post":"“–the Jesus is naked, with His hands crossed above pelvis (similar on the Shroud) –let’s assume that such portrayal occurs in 1/100 instances.” “Crossed hands do not interest me here at all.” You were interested to crossed hands and you assigned a probability to this feature. If you change your opinion it will be correct to say it..","date":"2014-06-26","mins":"1:46 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133133","author":"david_mo","post":"Thomas: “I don’t know” is not compelling… but it is a usual scientific answer. O.K. There is a big difference between the shroud of Turin and the other representations of the shroud. The other pictures are representations of the Holly Shroud in diverse contexts (entombment, lamentationes etc.); the shroud of Turin IS (really or supposedly) the shroud. If we have to compare two pictures, we should compare homogeneous pictures. This is a problem because we know scarcely anything about other shrouds. We compare in fact a shroud with some pictures with a different iconic concept. We are comparing the mark or impression of the Jesus’ body in a shroud with an entombment scene. This implies an important difference when we analyzed the idea and representation of naked Christ in the tomb and also poses a theological and pictorial problem to a painter who wants to paint the image of the body on a shroud of Christ. The Gospels say that Jesus body was wrapped in a clean shroud (Mathew, 27, 59). There are a lot of medieval representations of Christ in the entombment or the resurrection (most common), where the nudity is veiled by a shroud. Obviously, this solution to the problem was not possible with the Shroud. We don’t know what the solution of this problem in other shrouds was, because only a shroud (true or false) has come to us. We can not compare in any way. We only can compare the codex Pray illustration with others with the same motif and to check out that the codex Pray is not the unique case in which the artist has dared to paint Jesus naked. See my gallery. The codex Pray is odd but not exceptional. This is all we can conclude on this issue..","date":"2014-06-27","mins":"1:38 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133140","author":"david_mo","post":"Last but not least. An illustrator who is intending to copy some important image doesn’t choose marginal details, because he prevents the correct identification of the subject by doing that. This is a universal rule of History of Art. There is an absolutely definitive feature that identifies the Shroud of Turin over all the others. The painter can paint some things that don’t exist in the Shroud. See the cloth on the pelvis in the paintings of Clovio o Della Rovere; or the absence of details in the fibula found in the Seine river ( http://sombraenelsudario.files.wordpress.com/2012/07/suairemedaille.jpg?w=450&h=362 ). There is one feature that mainly identifies the image as a copy of the shroud of Turin in spite of all these “infidelities” to the original image: the shape of shroud; the fact that it is folded over the head. There are some images of naked Christ, there are many representations of crossed hands without thumbs, there are pictures of Christ with big moustaches and with many blood. But there is not a single shroud with the shape of the shroud of Turin. Neither the codex Pray. Draw your own conclusions..","date":"2014-06-27","mins":"2:10 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133224","author":"david_mo","post":"Of course some reliques of non painted shrouds exist. But we are speaking about an image on the srhoud..","date":"2014-06-28","mins":"1:40 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133232","author":"david_mo","post":"“Empty words. Everything has been mentioned long ago, and does not undermine my reasoning in any way.” O.K.: This is not an answer. This is an escape! The evident conclusion is: If the shape of the shroud of Turin is its most distinctive feature, and no artist has ever represented it till the fourteenth Century (fibula) or sixteenth Century (Clovio and Della Rovere), we must conclude that the shroud of Turin was not known till the fourteenth Century. This is elementary logic. For example: See this picture: https://www.flickr.com/photos/ana sudani/460090622/in/photostream/. It is a panel of the altar of the cathedral of Lübeck of the beginning of the Fifteenth Century. There are more coincidences with the shroud of Turin here than in the codex Pray: the beard is divided in two, we can see the wounds of the Passion and the legs are bended. With your logic of more similarities, more copy, we ought to conclude that the artist was copying the shroud of Turin. But it is impossible because the artist has painted an absolutely different shroud both in shape and consistency and it is impossible that any image could have been impressed on this shroud. The similarities with the shroud of Turin are a coincidence or a consequence of the stylistic rules. This refutes your argument..","date":"2014-06-28","mins":"2:34 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-133319","author":"david_mo","post":"You have put a good epitaph for the codex Pray, Hugh. I agree with almost all. But I don’t consider an sceptical myself on this issue. I find no reason to match the codex Pray to the shroud of Turin. This is not scepticism..","date":"2014-06-28","mins":"10:32 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134266","author":"david_mo","post":"O.K. Fault of logic? We are sure that a number of copies of the shroud of Turin are genuine. All them without exceptionpresent the characteristic shape of the Turin Shroud. Ergo this is a relevant and distinctive feature. We have also an alleged influence of the Turin Shroud on a number of images of Christ. But you intend to base this influence on some features common to medieval art. You have no reason to suppose that the altar of Lübeck is “likely” influenced by the shroud of Turin. Not a single one. Prove it! It is you that affirm (inconsequently) that the features that matched the altar and the Shroud were common in medieval art. This claim is mine also. So you need a characteristic feature that identifies the copy of the Shroud. I have found a very reliable one: the shape of the shroud of Turin. You can not deny that this shape is characteristic of the Shroud. But you propose another: the L shape of the supposed holes. But this one is very ambiguous because… – There is not a L shape in the “holes” of the codex Pray. There are a L form and a P form. You can not find this combination in the Shroud. – It is not evident that the small circles are holes. The same form is used in the codex Pray to the ornaments of the dresses. The alleged shroud in the codex Pray is not a shroud; it is the sepulchre. There are several reasons that show this. So you prefer an inconsistent argument instead of a solid one. This is your logic..","date":"2014-06-29","mins":"3:31 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134267","author":"david_mo","post":"By the way, a “large frequency of congruences in a population indicates a model” is false if you are thinking in an individual model. A large frequency of congruences in History of Art indicates a style or an iconographic rule. If you want to establish an influence from an artist to other you ought to establish a characteristic feature and a chronology. It is at this hurdle that you fall..","date":"2014-06-29","mins":"3:50 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134407","author":"david_mo","post":"Daveb of wellington nz The drawings of the Pray Codex are a style of their own, almost in a cartoon style, simple ink drawings with only two uniform primary colours. In no sense are they in the same category as their contemporary high European art, with all their concomitant artistic styles, and reliance on precedents. The quality or technical skill of an artist is irrelevant to the membership in an artistic style. I don’t know a “Hungarian Gothic style” and the concept of “Prayan” style is inconceivable. The Pray drawings occur in their context of the very first attempt at producing a written text in the Hungarian language. It may be regarded as a form of primal Hungarian art. This is a common mistake among sindonists. The Pray Codex is an ensemble of texts. Only the Funeral Prayer is written in Hungarian and can be dated in 1192 95, according to E. Poulle. Other parts of the codex include a list of Hungarian kings (till 1210) and a collection of liturgical songs in Latin. The illustrations are inserted in the latter part and can be dated about the beginning of the thirteen Century (1216 as likely ante quem. All these texts and illustrations were influenced by the French and the Italian style. That is to say, they belong to the Gothic style. Casual inspection of the oblique rectangle in the drawing will show that it has a length to width ratio of very close to 4:1, the same proportions as the Shroud cloth, the very same object that has a zigzag pattern on it, as has the Shroud, and the very same object that has an ‘L’ arrangement of holes. A further characteristic of the Shroud is that it is of fabric, so it need not be represented as having straight sides, but can be curved, without these being symmetrical. A straight edge placed against this rectangle will show the edges are indeed curved, and without the curves being symmetrical about the centre line. The proportions of the lid aren’t 4:1 (I think you don’t measure the part under the angel that is blurred); the zigzag lines are only vaguely similar to a herringbone; and the holes of the Turin Shroud aren’t in P and L shape as in the Pray Codex. The surface where the small circles are painted is rigid and differs completely with the representation of cloths and fabrics in the Pray Codex. The angel is seating over it, as is usual in the representations of the scene of the Holy Women. This is the lid of a sepulchre not a sheet. However, all the great men have spoken and have expressed their skepticism all to their own satisfaction no doubt. I for one consider that they have all simultaneously come to an incorrect conclusion. So much for the value of consensus debate! Every factual sentence is subject to possible rectification. But we have to consider it is true while we have no reason to abandon it. I don’t see any reason to abandon my claim that the Pray Codex doesn’t include any reference to the Shroud of Turin. I don’t see what kind of consensus you required here that implies I ought to say the contrary that I really think. I don’t know what great men you are thinking. I am not a great man, of course..","date":"2014-06-30","mins":"1:51 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134410","author":"david_mo","post":"O.K. But the HPM is not a copy of the Shroud and its image but simply a psalter with several references to the Shroud! That’s the main difference you seem not to understand. “References” is a euphemism you use to speak of imitated or copied features. The same for “congruences”. What are these if they are not imitated/copied features? I’m not mixing “different problems” I have disentangled verbal games you make. Of course, I can find. But those P holes on the bottom red crossed rectangle do not interest me at the moment. Just L holes. Bravo! When reality discredits me, the reality doesn’t interest me. It is enough to me that they mayrepresent holes on the Shroud. The Reign of the maybe is infinite, but we are searching for the truth not the imagination. I suppose. And the truth is based on better or lesser evidences, not on vague possibilities. There is clearly visible a bench on which angel is sitting. Thus the rectangle cannot be a tomb lid. Why not? The angel seated on the lid or on the sepulchre by pointing the finger to the folded shroud is a usual representation of the Holy Women scene. I don’t know any image where the angel is seated on the shroud. It would be blasphemy..","date":"2014-06-30","mins":"2:03 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134616","author":"david_mo","post":"O.K. Why not? Because there is a bench, as I have shown! But like other sceptics you have disregarded this inconvenient (for you) fact! Why haven’t you adress that? Because there is no other answer? You maintain the lid, even when proven wrong. That’s just desperate cry: “I must be right, I must be right. This must be lid, must be lid! Every similarities with the Shroud must be wrong! All sindonists are stupid!” “Proven wrong”? “Shown”? Do you see three lines (?) and you think that it is proved that there is a bench? Really? You don’t see a bench. You see some lines and you arbitrarily interpret that these lines are a bench. Are there also benches in these pictures? http://www.culture.gouv.fr/Wave/savimage/enlumine/irht8/IRHT 117499 p.jpg http://www.culture.gouv.fr/Wave/savimage/enlumine/irht8/IRHT 117025 p.jpg http://www.culture.gouv.fr/Wave/savimage/enlumine/irht6/IRHT 094014 p.jpg http://www.culture.gouv.fr/Wave/savimage/enlumine/irht4/IRHT 073106 p.jpg http://www.culture.gouv.fr/Wave/savimage/enlumine/irht11/IRHT 161367 p.jpg http://www.culture.gouv.fr/Wave/savimage/enlumine/irht5/IRHT 083246 p.jpg http://www.culture.gouv.fr/Wave/savimage/enlumine/irht2/IRHT 055921 p.jpg http://www.culture.gouv.fr/Wave/savimage/enlumine/irht3/IRHT 060804 p.jpg http://www.culture.gouv.fr/emolimo/imaz/vianc2d4.jpg http://www.culture.gouv.fr/Wave/savimage/enlumine/irht9/IRHT 150398 p.jpg http://www.culture.gouv.fr/Wave/savimage/enlumine/irht7/IRHT 109659 p.jpg http://www.culture.gouv.fr/Wave/savimage/enlumine/irht5/IRHT 086567 p.jpg http://upload.wikimedia.org/wikipedia/commons/e/ee/Andrea %28 Nachfolge%29 Orcagna 001.jpg http://www.getty.edu/art/gettyguide/art Object Details?artobj=112612&handle=li http://www.getty.edu/art/gettyguide/art Object Details?artobj=112612&handle=li http://www.getty.edu/art/gettyguide/art Object Details?artobj=3409&handle=li http://www.getty.edu/art/gettyguide/art Object Details?artobj=3409&handle=li http://www.cgfaonlineartmuseum.com/duccio/duccio4.jpg http://art roman.net/asnieres/asnieres2.htm http://www.bl.uk/catalogues/illuminatedmanuscripts/ILLUMIN Big.ASP?size=big&Ill ID=7120 http://www.bl.uk/catalogues/illuminatedmanuscripts/ILLUMIN Big.ASP?size=big&Ill ID=7120 Etc., etc. No. Benches are in your imagination. NOTA BENE: I have never done any disqualification of your intelligence, neither of the sindonists in general. I don’t know why you think so. I don’t like this way of debating..","date":"2014-07-01","mins":"2:30 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134623","author":"david_mo","post":"I apologize. At the end is repeated three pictures because I was a little sick of copy and paste..","date":"2014-07-01","mins":"2:41 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134627","author":"david_mo","post":"If you want more. Http://www.bl.uk/catalogues/illuminatedmanuscripts/ILLUMIN Big.ASP?size=big&Ill ID=11283 http://www.bl.uk/catalogues/illuminatedmanuscripts/ILLUMIN Big.ASP?size=big&Ill ID=11283 http://www.bl.uk/catalogues/illuminatedmanuscripts/ILLUMIN Big.ASP?size=big&Ill ID=19953 http://www.bl.uk/catalogues/illuminatedmanuscripts/ILLUMIN Big.ASP?size=big&Ill ID=19953 http://www.bl.uk/catalogues/illuminatedmanuscripts/ILLUMIN Big.ASP?size=big&Ill ID=27151 http://www.bl.uk/catalogues/illuminatedmanuscripts/ILLUMIN Big.ASP?size=big&Ill ID=27151 http://www.bl.uk/catalogues/illuminatedmanuscripts/ILLUMIN Big.ASP?size=big&Ill ID=39575 http://www.bl.uk/catalogues/illuminatedmanuscripts/ILLUMIN Big.ASP?size=big&Ill ID=39575 http://molcat1.bl.uk/Ill Images/Kslides/big/K058/K058710.jpg http://molcat1.bl.uk/Ill Images/Kslides/big/K021/K021567.jpg http://molcat1.bl.uk/Ill Images/NOF/big/011 LAN000000383 U00013000.jpg http://molcat1.bl.uk/Ill Images/NOF/big/011 ROY000001 D10 U00007000a.jpg http://molcat1.bl.uk/Ill Images/Ekta/big/E092/E092829a.jpg http://molcat1.bl.uk/Ill Images/Kslides/big/K038/K038609.jpg http://molcat1.bl.uk/Ill Images/BL Studio/big/YT2/021v.jpg http://imageviewer.kb.nl/Imaging Service/imaging Service?id=BYVANCKB%3 Amimi 76f5%3 A022v min a1&zoom=1 http://imageviewer.kb.nl/Imaging Service/imaging Service?id=BYVANCKB%3 Amimi 76f13%3 A023r min&zoom=1 http://imageviewer.kb.nl/Imaging Service/imaging Service?id=BYVANCKB%3 Amimi 135e19%3 A101r init&zoom=1 http://imageviewer.kb.nl/Imaging Service/imaging Service?id=BYVANCKB%3 Amimi mmw 10b21%3 A150r min&zoom=1 http://imageviewer.kb.nl/Imaging Service/imaging Service?id=BYVANCKB%3 Amimi mmw 10b23%3 A524r min&zoom=1 http://www.photo.rmn.fr/Corex Doc/RMN/Media/TR1/WLYQ6 N/12 522173.jpg http://www.photo.rmn.fr/Corex Doc/RMN/Media/TR1/SX9 JPD/10 522123.jpg http://www.photo.rmn.fr/Corex Doc/RMN/Media/TR1/4 K56 UR/06 504090.jpg http://www.photo.rmn.fr/Corex Doc/RMN/Media/TR1/DK3 I0 G/07 533778.jpg http://www.photo.rmn.fr/Corex Doc/RMN/Media/TR1/K3 MOSV/12 571505.jpg http://www.photo.rmn.fr/Corex Doc/RMN/Media/TR1/HY8 VWB/65 003164.jpg Virtually in all the representations of the Holy Women scene the angel is sitting on the grave or on the lid. You have to give more stronger reasons to show that the Pray Codex this doesn’t happen..","date":"2014-07-01","mins":"3:14 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134685","author":"david_mo","post":"You’re welcome, Hugh..","date":"2014-07-01","mins":"9:38 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134820","author":"david_mo","post":"O.K. Two lines left from the angel, one vertical, slightly tilted to the left, one horizontal, slightly upwards, joining angel’s dress. There is a Spanish joke about Jaimito, his father and the teacher. The teacher was worried about Jaimito because the child saw “things” (non sancta things) in the simple lines sketched by the teacher, and called to Jaimito’s father. But when the father saw the lines (remember that they are only lines)… Well, I cannot translate adequately the joke to English and it is not very suitable for this blog. Let it stay. That’s clealry a bench, what else could it be! Naturlich! Two lines = a bench. Every intelligent man sees this! But the no intelligent men see anything; for example, perhaps it is the left angle of the edge of the sepulchre. I think the artist of the Pray Codex was not very skilful. He is probably trying to copy or remember another illustration but paints badly some things. See the sceptre with the cross. Nothing appears to hold it, and there is something as four fingers in an impossible place. Or see the ornament of crosses under the so called shroud. (By the way, the shroud of Turin has not any cross similar to these that are on this alleged shroud of the Pray Codex. It is not a shroud, of course). But this story of the bench that not seems a bench at all intrigues me. How appeared it here? Is the angel who brought it from the heaven? Perhaps he was afraid of having to wait for the Holy Women for too long (the women, you know). Don’t worry if I don’t take too seriously your famous bench. The non intelligent people don’t be able to understand the theories of intelligent ones. That’s why, all the painters of the Middle Ages non intelligent, of course , put the angel naturally seated on the sepulchre or on the lid, exactly in the same position of the angel of the Pray Codex. No one has the very intelligent idea to paint a heavenly bench. This is another extraordinary exploit of the Pray Codex… or of your intelligent interpretation of it. In any event, let me abandon you at this point. You’ll be tired to discuss with non intelligent people as me, and you become the more and more interested to introducing some issues which I have not interest in discussing with you; as the level of intelligence, for example. I let you rest and be calm..","date":"2014-07-02","mins":"2:48 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134823","author":"david_mo","post":"Thomas: Surely you can agree there IS some discontinuity…I’ve seen no evidence of non decorative and discrete red streaks, isolated / discrete circles in L shaped patters, floating greek letters, and floating heads…but if you can show me then like always I can reconsider, being one not fixated on dogmatic and inflexible perspectives. The artist of the Pray Codex is particularly anarchic in adorning the sepulchre: two kinds of crosses, pyramidal forms, circles and red zigzags. I don’t think we ought to find a sense to this hotchpotch. In regard of the other features noted by you, we can search for randomly different features in other paintings and we will found also “astonishing coincidences”. Sure. I have noted above the altar of Lübeck, for example, with more consistent features. If we use vague similarities the task is easier. And I remember you that there is not any L shape in the Pray Codex. There is a pair of L+P. It is a significant difference. I insist the unique feature clearly shared without any ambiguity by the Shroud and the Pray Codex is the nudity. Very poor evidence to counter the evident dissimilarities between them..","date":"2014-07-02","mins":"3:10 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135028","author":"david_mo","post":"Hugh Farey: “I think it most unlikely that an artist believing that the image of Christ was left behind in the tomb after the resurrection, would not include it in any depiction of it.” Here is the clue of a big contradiction in those who defend both the hidden signs of the Shroud in some representations of the Christ’s Passion and the wide influence of it in the medieval art. If the medieval artists had known the shroud of Turin at least some of them would have represented it unambiguously. If the medieval artists didn’t know the shroud of Turin the coincidences between it and their work are mere coincidences or something worse. Other famous relics of the Passion were represented in art in a lot of occasions, Why not the Shroud? On this basis, the coincidences between medieval Art and the Shroud, if existing, point in a contrary direction to the sindonism..","date":"2014-07-03","mins":"2:20 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-134884","author":"david_mo","post":"All right: “And I remind you that there is not any L shape in the Pray Codex. There is a pair of L+P. It is a significant difference.” Now you get it or not yet?.","date":"2014-07-02","mins":"10:30 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135117","author":"david_mo","post":"Daveb: ”Hugh Farey’s assertion, picked up by David Mo reveals a fallacious assumption: “I think it most unlikely that an artist believing that the image of Christ was left behind in the tomb after the resurrection, would not include it in any depiction of it.” The fallacious assumption is that the image was visible soon after the resurrection. (…) There is a considerable weight of documentary evidence that the burial cloths were present in Constantinople. (…) From what we know of Byzantine liturgies, much of it is not for the public gaze. (…) (…) But the epitaphioi continued to appear, imprinted on the Byzantine collective memory.” Your argument has nothing to do with what we say Charles Freeman, Hugh and myself: 1. It is irrelevant if the image was produced immediately after the resurrection or two centuries later, miraculously or made by a forger. If the shroud was known at the time you like, we should have a description or an image of it. This is the point I share with Hugh and Charles. 2. Neither of the examples you cite (Constantine VIII, Clari and these other mysterious not specified by you), provide us with a description of the shrouds mentioned that can be compared with the Shroud of Turin. There is no description. There is no way to know if they were painted or not or. In the case that there were some image, we cannot know if these images were similar to the Shroud of Turin or were different. You can not make any comparison of something familiar with something that is not known. The mention of the word “shroud” can not solve the problem. 3. The epitaphioi are liturgical fabrics with representations of the dead Jesus. None of these paints or embroideries shows an identifiable image of the shroud of Turin. 4. At the end of your comment you conclude with an insubstantial reason that I find it goes against their claims. The Mandylion was also rarely exhibited and yet we have enough descriptions and pictures of their appearance. The same should be valid to the Shroud. The lack of descriptions or depictions of the Shroud of Turin until the sixteenth century implies that it was not known or did not exist. In neither case could have been a reference to the formation of Byzantine art and Gothic. The question is simple: Do you know any accurate description corresponding to the shroud of Turin? Previous to the fourteenth century, of course..","date":"2014-07-03","mins":"12:19 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135252","author":"david_mo","post":"O.K.: No, David Mo we do not have enough descriptions and pictures of the Mandylion to be 100 % certain how it looked like. Aside the problem of its similarities and supposed identity with the Shroud. I’m not speaking about any 100%. Only relevant features in descriptions and images. The image of a barbed face with crossed halo on a rectangular clothing. A living face, of course. No. We don’t have any direct representation of the whole Shroud before 14th century. But that not necessarily means that the Shroud didn’t exist, or was not known to the small and priviliged group of people. It seems that the Shroud, and particularly its image, was a byzantine state secret (just like greek fire and silk production), revealed only to the most notable guests. I don’t know any document that speaks about the exhibition of the Shroud (the named Shroud of Turin, of course) in Byzantium. I don’t know any document speaking about a state secret. I would like you quote these important documents. I would like to know how you are able to identify the Shroud in these documents if there is not a description of it..","date":"2014-07-04","mins":"2:18 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135255","author":"david_mo","post":"Chesterbello: I think that the description by Robert De Clari is clearly a description of the Shroud as we know it. De Clari: “…where was kept the sydoine (sic) in which Our Lord had been wrapped, which stood up straight every Friday so that the features of Our Lord could be plainly seen there.” It is impossible to know what kind of image Clari is speaking about. For example, is Clari speaking about an image painted or impressed? Naked or dressed? In what position? etc., etc. Don’t say us that you recognise the Shroud..","date":"2014-07-04","mins":"2:42 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135261","author":"david_mo","post":"Daveb: I disagree with Hugh on some relevant issues but this one is better explained by him than me. I think you miss the thrust of my argument. There are various reasons why the Shroud was not mentioned in the Gospels, which could have been for reasons of uncleanliness, secrecy, or, indeed, because there was no image on it then. However, after the Shroud was known to have an image on it, that’s when I think it unlikely not to have been depicted as such. I think it unlikely that an artist would have assumed that the image was not contemporaneous with the resurrection (how could he have known?), and do not agree that the Byzantines were shy to depict their relics – the Mandylion was widely illustrated. I only add: image or not image an artist that had know the shroud of Turin would have painted the form of the sheet at least. For the reasons I have given here I don’t see any epitaphios showing any knowledge about the shroud of Turin. I have read Scavone and I am not convinced by him at all. Perhaps you are able to change my mind..","date":"2014-07-04","mins":"3:16 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135449","author":"david_mo","post":"Carlos: No estamos discutiendo cómo eran las tumbas judías del siglo I, sino cómo se representaba la tumba de Jesús en el arte medieval tardío. Hugh Farey lo ha explicado con su habitual claridad. Pero lo que me extraña es que incluso en los ejemplos que pones el ángel está sentado sobre la tapa del sarcófago o sobre el mismo sarcófago. We are not discussing how the Jewish tombs actually were in the First Century but how was represented the Jesus’ tomb in the last medieval art. Hugh Farey has explained this with his usual clarity. But I am surprised because in the examples you put here the angel is seated on the lid or on the sarcophagus..","date":"2014-07-05","mins":"3:35 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135450","author":"david_mo","post":"Corrijo: “…el ángel está frecuentemente sentado…” I correct: “… the antes is frequently seated…”.","date":"2014-07-05","mins":"3:40 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135451","author":"david_mo","post":"“… the angel is rfequently seated…” (Damn hurry!).","date":"2014-07-05","mins":"3:42 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135582","author":"david_mo","post":"Carlos: First of all: I wrote: “on the lid or on the sarcophagus”. “Lid” in English means “tapa”. Please, read more attentively my words and you will not blunder again. Hugh suggests that the rectangle may be the door of the sepulchre. Maybe. I consider more probable the rectangle represented the lid as in almost all the representations in West Medieval Art. So I see the angel is seated or stepping on a rectangle in the examples from St. Gall and the Cloisters. In the example from the Victoria and Albert Museum, the Angel is seated on a sarcophagus. I interpret this form this way on the basis of the figures of sleeping warriors that is an iconographic issue of many representations in the Medieval Western Art. But your interpretation is mainly flawed because you put here some examples of art from different time and styles we are discussing. We are speaking about the Pray Codex and its illustrations it is to say Thirteenth Century , and the shroud of Turin (1350 circa as unquestionable date). All my examples (if I remember well) came from the Twelfth to the Fifteenth Centuries. It is to say, a plausible time of impact of both objects in a coherent geographical space and a peculiar style: the Gothic. They are coherent with our subject of discussion. Yours aren’t. However, it matters little that we interpret the rectangle as the lid of a sarcophagus, as in the Western Art, or a door of the Holy Sepulchre, as in the Byzantine tradition (Russian icons included). It matters little if we see the angel sitting or stepping on the rectangle. Therefore, the rectangle ever will be a door or a lid, never a cloth. In both cases the sindonist interpretation of the rectangle in the Pray Codex is inconsistent. Daveb: In the Western Art the rectangle is the lid of the coffin or sarcophagus. We can understand this not by a mere game of appearances, but by the iconographic comparison of this element in a lot of representations. The rectangle takes up the place beside the coffin/sarcophagus as the other unequivocal lids. It is rigid as a lid. It is a lid. In the Eastern Art the thing is ambiguous. See above.(The flying carpet seems to me a joke, is it not? We are not in the 1001 nights)..","date":"2014-07-06","mins":"3:02 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135585","author":"david_mo","post":"Daveb: In the HPM, 12th century (1192 95) the angel is not sitting on the rectangle but seems to be sitting on a type of rock shelf, again not necessarily the rolled away entrance stone, and the skewed rectangle seems more part of the foreground. Two specific questions: Why do you think that two lines represent a “rock shelf”? What have the lines to seem a rock and a shelf? What do you mean by “foreground”? The lid can not be the “foreground” of the sarcophagus? Thank you..","date":"2014-07-06","mins":"3:22 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135838","author":"david_mo","post":"Daveb: (…) I would have assumed that the artists portraying the scene of the women’s visit, would have done their homework and ought to have known that the angel was found sitting on the rock. But they show him as sitting or standing on this rectangular object. The gospel records that the tomb was sealed by a rock and there is no mention of a door. Why should the angel be sitting on the door of the tomb, the door is not in the gospel and it’s not scriptural!(…) But I don’t know that we can be so certain. The images on the TS have sometimes been used to explain the appearance of the angel(s) and I think it’s possible that the ideas may be connected. Now on the HPM, note the position of the angel’s foot. It indicates he is seated (the foot is placed well in front of him), and three lines are sketched at the extreme left of the picture, which suggest to me the bench or shelf on which he is sitting. Furthermore, the oblique rectangle is set in front of the angel and in front of the women, and appears to be resting on the slab underneath, and it is placed in the bottom one third of the lower picture. That is why I say it is in the foreground. You may call the underlying slab a sarcophagus; I say that it is not obvious as such. Your interpretation begins badly. There are three lines in the back of the angel, but the lower one is the edge of the lid/shroud. Then we have only two lines. And you have not answered my question. You repeat that these lines are a rock shelf (before was a bench) but you don’t explain how two simple lines can be interpreted as a rock shelf instead of a bench or an extension of the coffin (this is more according to the West Art tradition), or another else. Where can you see this rock shelf represented by two lines? How? The angel’s feet are before the lid/shroud. The angel’s position (one leg bent and the other more extended) implies the classical angel seated on the lid or the sarcophagus, resting one foot on the lid. The other examples I put here indicate that the feet (at least one of them) are over the lid/shroud. This one is supported by the empty coffin/sarcophagus, as in the rest of representations at this time. All this obviously discards the “shroud” interpretation. I am ready to accept a correction of the most obvious interpretation but not without good reasons to do it. The ancient illustrators of the Bible rarely were experts on the subject they were painting. They simply copied other images and sometimes added some personal incongruities. Some contradictory, or non biblical, features were repeated and sometimes magnified. For example: the Pray Codex includes two incompatible biblical traditions in the same drawing. In the first, Nicodemus and Joseph of Arimathea are anointing Jesus’ body. This is John 19: 39. In the second, the Holy Women carry still more substances for anointing. This is Mark 16:1 or Luke 24:1. This is an unlikely double anointing that the illustrator of de Pray Codex put together without any objection..","date":"2014-07-07","mins":"1:45 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135840","author":"david_mo","post":"Hugh Farey; (…)In many more he is sitting on a more substantial block, which I think indicates the Stone of Unction which sits outside the sepulchre even today. The later “sarcophagus type” Three Marys scenes clearly show the angel slab as the lid of the sarcophagus. In intermediate types the angel slab is not so clearly a lid (the Pray manuscript being one such), but it is skewed, which I have interpreted either as the lid or the door of the tomb being “rolled away,” but could represent the Stone of Unction being thrown over by an earthquake, as daveb suggests. On the place where the angel’s is seated: If we have a most common image (the lid or the sarcophagus) we mustn’t abandon it without some relevant reason (the Rock of Anointing). I don’t see any. On the rectangular object under de angel’s feet: Idem and idem plus: if this rectangular object is the same as the some early and Byzantine images of the Rock of Anointing, this says nothing in support of the sindonist thesis. It continues to be a rock, and not a cloth. On the margin: The Anointing Rock was only placed in the Jerusalem Sepulchre after the Crusader’s conquest (1100 p.q.). I seem to remember that some images of the angel on a block are from before that date. Is there any contradiction? Or this is not the Anointing Rock? Or this “substantial” block is not the Rock of the Anointing (note that it actually has not an adequate form to anointing any body)?.","date":"2014-07-07","mins":"1:51 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135944","author":"david_mo","post":"O.K.: Do you remember that? “Large frequency of congruences in a population indicates a model”. This is correct. See the examples: Iglesia de San Juan de Arroyo de la Encomienda. Castilla. Mediados del siglo XII. Museo del Duomo de Modena. Metopa. Secolo XII. Sant Pere de Galligants, Girona. Segona meitat del segle XII. St. Genis les Fonts. Rosselló. Segle XII Église de Dienne. Auvergne. 1020 http://lafeuilleamta.fr/2011/02/04/note sur un chapiteau roman unique en france dans l%E2%80%99eglise de dienne/# There is a classic pattern of the icon of the mermaid (symbol of lubricity). But what is the original model? We can not say it. We have to suppose that someone was the first to represent the mermaid, but it is impossible to know where and who. The Pray Codex representation of the Holy Women at the tomb present a “large frequency of congruences” with almost all the images of the same scene at this time and place: the angel is placed in front of the women; the angel is seated; his arse is placed in contact with the sarcophagus (eventually lid); he points to the empty sarcophagus; on the sarcophagus there is a wrinkled cloth (the sudarium or the shroud); a rectangle is placed in diagonal and means the lid. There is almost always the same pattern of structural features with some minor variations. Unlike the random and vague features that sindonist point, these others are structural. Imply a formal and semantic structure. According to you, they imply a model. This model is the iconographic issue of the Holy Women at sepulchre. The Codex Pray fits perfectly with this model as the Romanesque capitals I quoted fit with the model “lustful mermaid”. In both cases we can not know who the first artist that used this model was. But the model is clear. That you refuse to accept the same principle you have defended before is the last straw. Paraphrasing Groucho Marx: “Those are my principles, and if I don’t like them… well, I have others.” Secondly: the inaccuracy of the lines is not a sufficient reason to discard the sepulchre in the back of the angel. The Codex Pray illuminations are plenty of these inaccuracies. The angle of the lines is approximately at the same level that the right part of the sepulchre and this hints to mean that the angel is seated on it. And you continue without give us a single reason of your interpretation of these lines as a bench. What features of a bench you see? Can you see any form of legs or seat? I think you are a victim of Jaimito’s syndrome..","date":"2014-07-07","mins":"10:06 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135845","author":"david_mo","post":"Daveb: Several galleries of Three Mary depictions have been shown. Those that are of interest for purposes of the argument must predate 1195. Maybe there were 40 or so, but I haven’t bothered to count them. Q1: How many showed four holes arranged in an ‘L’ shape on the rectangular object? A1: None. Q2: How many showed a zigzag pattern on the rectangle? A2: None. Q3: How many showed red coloured randomly placed streaks on the rectangle that might be interpreted as representing blood stains? A3: None. Q4: How many include a naked prostrate Christ with crossed wrists across the groin? A4: None. Objection – This relates to a Lamentation or Threnos scene not a Three Marys scene; You need to refer to pre 1195 Threnos scenes. But there are very few such Threnos scenes predating 1195. Are you trying to begin the discussion again? These points have been largely discussed yet! See Charles Freeman, June 21, 2014 at 6:22 am, Hugh Farey, June 26, 2014 at 5:25 pm, my comment at June 27, 2014 at 2:10 pm. And a long et caetera..","date":"2014-07-07","mins":"2:13 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-135945","author":"david_mo","post":"O.K.: Do you remember that? “Large frequency of congruences in a population indicates a model”. This is correct. See the examples: Iglesia de San Juan de Arroyo de la Encomienda. Castilla. Mediados del siglo XII. Museo del Duomo de Modena. Metopa. Secolo XII. Sant Pere de Galligants, Girona. Segona meitat del segle XII. St. Genis les Fonts. Rosselló. Segle XII Église de Dienne. Auvergne. 1020 http://lafeuilleamta.fr/2011/02/04/note sur un chapiteau roman unique en france dans l%E2%80%99eglise de dienne/# There is a classic pattern of the icon of the mermaid (symbol of lubricity). But what is the original model? We can not say it. We have to suppose that someone was the first to represent the mermaid, but it is impossible to know where and who. The Pray Codex representation of the Holy Women at the tomb present a “large frequency of congruences” with almost all the images of the same scene at this time and place: the angel is placed in front of the women; the angel is seated; his buttocks are placed in contact with the sarcophagus (eventually lid); he points to the empty sarcophagus; on the sarcophagus there is a wrinkled cloth (the sudarium or the shroud); a rectangle is placed in diagonal and means the lid. There is almost always the same pattern of structural features with some minor variations. Unlike the random and vague features that sindonist point, these others are structural. Imply a formal and semantic structure. According to you, they imply a model. This model is the iconographic issue of the Holy Women at sepulchre. The Codex Pray fits perfectly with this model as the Romanesque capitals I quoted fit with the model “lustful mermaid”. In both cases we can not know who the first artist that used this model was. But the model is clear. That you refuse to accept the same principle you have defended before is the last straw. Paraphrasing Groucho Marx: “Those are my principles, and if I don’t like them… well, I have others.” Secondly: the inaccuracy of the lines is not a sufficient reason to discard the sepulchre in the back of the angel. The Codex Pray illuminations are plenty of these inaccuracies. The angle of the lines is approximately at the same level that the right part of the sepulchre and this hints to mean that the angel is seated on it. And you continue without give us a single reason of your interpretation of these lines as a bench. What features of a bench you see? Can you see any form of legs or seat? I think you are a victim of Jaimito’s syndrome..","date":"2014-07-07","mins":"10:12 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-136007","author":"david_mo","post":"““Large frequency of congruences in a population indicates a model” in a population, David Mo. It does not apply to the one particular example (especially such specific like the HPM)”. In the sense I am speaking of a model it implies a structural relation between some organized features. Not an isolated feature. In this sense, when an individual shares the same structural features with a “population” he shares a common pattern. This is evident in the mermaid case and in the Holy Women case also. What do you understand by “model”, “frequency of congruences” and “population”? It begins to be a mystery. Perhaps you can explain it better. I asked you: “… And you continue without give us a single reason of your interpretation of these lines as a bench. What features of a bench you see? Can you see any form of legs or seat? ” I’m waiting for an answer. (Dan, can you erase the duplicate comment? It has happened by a contingence of my PC. Thank you)..","date":"2014-07-07","mins":"3:17 pm","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-136148","author":"david_mo","post":"O.K. A model a certain object, material, described or imaginary, or a certain style, with characteristic features, which are mimicked in objects derived from it (eg. The Shroud as a model and iconography of Christ) Congruence a feature that on the model that is mimicked on the object derived from the model (eg. Vignon marks, L shaped circles) Population a set of all objects dervived from the model (eg. Byzantine icons of Christ, burial and empty tomb scenes) Frequency of congruences a fraction of all objects within a population sharing a particular congruence (or set of congruences). I hope definitions are clear now. No. This concept of model doesn’t work in History of Art. The artist never goes to the canvas or the stone with his mind in blank. Specially in the Ancient Art, the artist has passed by a learning process, he has seen other representations of his subject and carries in his mind a model as an iconic structure. This model is dominant even when he is trying to copy an object. (For the concept of iconic structure see my previous comment). This model is easily detectable (not always easily) when comparing a relevant set of works of art. (“congruences in a population”) The individual model (an object) can exist, but it is weighed up by the iconic rules of the structure. In the medieval Art the individual model (another painting, a man) are almost ever undetectable. A few portraits exist as exception. In general, and this is valid even for a genius as Giotto, the structure is predominant. The genius works into the framework of the structure. (See here: http://www.berkshirefinearts.com/uploaded Images/articles/485 Padova Padua: Giotto512051.jpg ) This is why the aspiration to deduce imitative effects only on the basis of isolated features is doomed to failure. Because an individual feature can be similar to other only by coincidence, especially when it is defined vaguely and one rejects the contradictory elements of his interpretation as you and other sindonists do. Paraphrasing you: the angel is seated; his buttocks is placed in contact with this thing consisting of those two lines as those two lines seem to serve no other function. You paraphrase, proclaim or affirm but never explain anything. If you pretend identify some object X it is necessary to identify the definitory features of this object, what identifies it as an X, not claim some vagueness as “seem to serve no other function”. See this: What “function serve” the lines in the back of the angel? Are they similar to the Pray Codex? And it is all clear, especially when compared with corresponding description in Mark’s Gospel (16:5, NIV): As they entered the tomb (inside the tomb), they saw a young man dressed in a white robe sitting (on what?) on the right side. New mistake. Some of us have explained here that the medieval artist does not guide himself by the Bible lecture but by the artistic conventions of his time and the iconic narrative..","date":"2014-07-08","mins":"3:44 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-136151","author":"david_mo","post":"“…passed through a learning process…” (I hate the phrasal verbs)..","date":"2014-07-08","mins":"3:53 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-136470","author":"david_mo","post":"O.K.: First, I would call “a model” in your understanding simply a style, but anyway. With the word “model” I don’t mean only a style. Iconic structures are models.And so is the Shroud an exception, which exist, as you admitted. It would be absurd to deny that the shroud of Turin exists, but I have not admitted that the Shroud is a portrait. Foremost, this is not our subject here. The Pray Codex is not a portrait either. If you want show that the Shroud is the individual model of the Pray Codex you ought to present serious evidence of it. For the moment you have not do so. Me: This is why the aspiration to deduce imitative effects only on the basis of isolated features is doomed to failure.Because an individual feature can be similar to other only by coincidence, You: But this is the main point, that you still don’t understand! The chances for coincidence of so many so rare features, are simply negligible! And this is what you don’t understand: that the coincidences between the Shroud and the Pray Codex that you note are neither “rare” nor definite. And the differences are so blunt that no individual relation can be established between the two objects. At this point you can go to the first comment of this entry and repeat all one by one. If you find anything new to say I be glad to discuss it with you..","date":"2014-07-09","mins":"2:45 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-192761","author":"david_mo","post":"When a medieval painter wants to paint a cloth, he paints a cloth according the iconic conventions of his epoch. When a medieval painter wants to paint a lid, he paints a lid according the iconic conventions of his epoch. The medieval conventions imply that the lid of the Three Marys scene was often represented as a rectangle and the angel seated on it. This is just what you can see at the Pray codex. A medieval painter doesn’t paint trails of blood as broken lines (there were other conventional signs for blood) and I don’t know why he would paint a herringbone (bone of fish) as pyramids and a holes series in form of P in order to imitate some holes that had not any form of P. This sounds amazing. (And I leave aside the many differences between the Shroud and the picture of the Codex Pray in more relevant aspects). There are two possible accounts of this: the painter of the Codex Pray was absolutely crazy or the Codex Pray bears no relation to the Shroud. I prefer the latter, obviously. You can see a lot of images of the Three Marys and the burial of Christ in my blog. If you find some similar things to the “representations” of the Shroud in the Pray Codex you could say me, please. Here: https://sombraenelsudario.wordpress.com/2014/08/10/las santas mujeres en la tumba vacia imagenes/ , https://sombraenelsudario.wordpress.com/2014/10/01/cristo en la tumba imagenes/ , https://sombraenelsudario.wordpress.com/2014/11/09/iconografia sobre las santas mujeres en la tumba vacia ii/. Spanish is not needed to see some pictures..","date":"2015-03-08","mins":"3:17 am","url":"https://shroudstory.com/2014/06/21/discussion-about-the-pray-codex-and-its-relation-to-the-shroud-is-over/","cat":"guest_posting","title":"Discussion about the Pray Codex and its relation to the Shroud is over?"},{"id":"comment-16135","author":"david_mo","post":"Yannick, you wrote: “Denying it would prove to be unfair and dishonest.” I don’t know if you are “unfair and dishonest”. I know your arguments (some) are wrong and illogical. (Give arguments, no disqualifications, please. Ce n’est pas très élégant comme argument, mon vieux). Example 1: I have supplied medieval examples of a naked Christ in the entombment. You are wrong at this point. I have supplied medieval examples of a naked Christ under the Shroud. You are wrong at this point. Example 2: People buried their dead dressed in the Middle Ages, but painted the Christ naked under the shroud. Shroud of Turin, also. Don’t confuse conventional sacred iconography with reality. You are wrong and illogical doing so. Yes, you can consider a lot of things “possible”. But there are degrees of possibility. See point 3.2. In my last comment, for example. Your supposition is very unlikely. Ergo, illogical. You haven’t any reason to match the three representations of Christ: Clari, Pray, Turin. I have done the analysis of Pray Turin point by point and conclude with the image as a whole. (We don’t know nothing about the de Clari picture was Christ naked?, for example). There is not another way to do it. You can’t explain anything without analyzing his parts first. The composition resolution method, you know. Please, say one feature, only one, that matches de Clari shroud with the Turin shroud (nudity, blood, hands position…). If there is no one, how can you make a comparison?.","date":"2012-09-11","mins":"6:56 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16145","author":"david_mo","post":"Thank you for your little English lesson, Art Science. My terrible English needs it. But I think if someone is confusing degrees of possibility his fault is logical. In the sense we can speak about “logic of scientific investigation” or “logic of grammar”. It is not an empiric fault, but a logical one..","date":"2012-09-11","mins":"10:06 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16160","author":"david_mo","post":"Before 1204? Why? De Clari speaks about a naked Christ? I can show you examples of Christ naked under the shroud, of course. What for? Will it be enough to convince you that the naked Christ idea was common at the time? Or will you start with new conditions?.","date":"2012-09-12","mins":"2:28 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-15968","author":"david_mo","post":"Yannick Clément : If this Shroud was really the Shroud of Turin (as I think it was)… Why? We only know a confuse testimony (de Clari) about a Shroud in Constantinople at the beginning of the 13th century. Not even a description. Only a vague reference about an object that appears and disappears suddenly. No more references. How this vaporous Shroud can influence all the cultural world of the 13th and before? Books of Hours and manuscript lamentations also? How can you distinguish if the Shroud de Clari said he had seen is the cause or the effect of cultural attraction about the Christ’s death?.","date":"2012-09-07","mins":"2:03 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16175","author":"david_mo","post":"Carlos Otal : David Mo: “I can show you examples of Christ naked under the shroud, of course. What for? Will it be enough to convince you that the naked Christ idea was common at the time?” ¿Común en aquel tiempo?. Usted, David, NO HA PODIDO MOSTRAR ninguna imagen de Cristo desnudo sobre la Sábana en todo el siglo XII, con la excepción del Códex Pray. Carlos Otal Carlos: I didn’t said “over” the shroud. I wrote “under” because we are now discussing about the idea that Jesus was wrapped naked. You have got the wrong discussion. Perhaps you have some problem with English. I translate: No dije “sobre” el sudario. Escribí “bajo” el sudario porque estamos discutiendo ahora sobre la idea de que Jesús fue envuelto en él desnudo. Se equivocó de discusión..","date":"2012-09-12","mins":"8:52 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16216","author":"david_mo","post":"Art Science : (…) David Hockney describes it as “Secret Knowledge”, a secret passed on from studio to studio. And even in the cases where this knowledge isnt known, the new style of painting still becomes pervasive (see the followers of Carravaggio who tried to emulate the style without knowing the secret). So I think Yannick idea that a small showing of a naked Christ on a shroud could have a large ripple effect and without its cause been widely known, is entirely possible as an explanation of how come naked Christs come into vogue. (…) Caravaggio was a celebrity in his time. His work was abundant, well known and praised. He has a school and a lot of imitators. He has nothing to do with de Clari’s shroud..","date":"2012-09-13","mins":"1:53 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16218","author":"david_mo","post":"Yannick Clément : That speak very loud to me because that show how odd the image on the Shroud is for the era that goes before the sack of Constantinople and even long after that. Jacques Bara in France did a cool research and never found a naked Christ in a depiction related to his Passion, death or burial before the 15th century in Toscani !!! So, even after the Shroud of Turin was put in public display in France, artists were not willing to depict Christ naked in scenes related to his Passion and death ! (…) Meditate about that my friend ! I meditate, Yannick, and you must meditate also. And these are the results of my meditationis: Meditatio Prima: You are wrong again. Why do you not read my preceding comments when I send you to them? I have shown some examples of naked Christ in a date long before to15th century in this forum. For example: Entombment. The Cloisters. 13th Century. Http://www.flickr.com/photos/elissacorsini/2163082112/in/set 72157601070709853/, I don’t know this Jacques Bara, but I think he was not very inspired if he said that. Or he was so an expert as you and I are. Meditatio Secunda: We are simple amateur (more or less) and our knowledge of the history of Art is very limited. (I have read three books on Byzantine Art. And you? Be honest, please). How many entombment or anointing paintings of the 12th Century do you know? Then, why do you ask to me? The lamentatio theme becomes widespread in the 14th and 15th Centuries. It’s the same with vir dolorum, entombments and other subjects around the Christ dead. But there were some examples before. To make generalizations on the basis of a few examples is very hazardous. Even if the Pray Codex was the first example of the naked Christ in the anointing theme known by experts in art, this mean nothing for the Turin Shroud authenticity case. Meditatio Tertia: How many documents do you know about the Christ dead in Byzantine 12th –epitaphioi came after? How many of these spoke about the Christ’s clothes in the tomb? You use an illogical argument: if the Byzantines buried their dead dressed, then they imagined the dead Christ dressed. Illogical. They didn’t bury their dead with a transparent veil, but painted the Christ dead with a transparent veil. Yes, Mesarites could have in mind paintings as this one: http://imageshack.us/photo/my images/856/ingeburgchantilly.jpg/ ( Ingeburg psalter, 1190 circa), when he was speaking about naked Christ under the Shroud. Meditatio Quarta: What are we discussing? I thought we were discussing about de Clari’s shroud and Carlos comes with a new problem, i.e. The Pray Codex. I prefer to finish with a subject before entering in another..","date":"2012-09-13","mins":"3:20 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16255","author":"david_mo","post":"And to close the case (for me at last): Yannick speaks about the possibility (he writes the word “possibility” once each two lines and “if” with capital letters). The possibility of an event is a very vague concept (it is physically possible that there are “lunatics” in the Moon and it is metaphysically possible First Motor existence), but he thinks the possibility Mesarites is talking about the Shroud of Turin (under de Clari’s shroud identity), is reinforced by the odd reference to a naked Christ. I don’t think so. This probability is strongly reduced by two facts: 1. The image of a naked Christ under the Shroud was not odd at this time. If it was pictured in the Queen Ingeborg psalter (and others) we can think it was a well known concept at his time. 2. When Mesarites speaks about an icon he mentions it directly. He made an accurate description of the Mandylion. But if he was in front to the “odd” and very important image of Turin Shroud or similar (and Yannick claims both odd and very impacting) it is incomprehensible he stopped talking about. The most impacting relic of the century and he only made a subtle and vague reference to Our Lord’s nudity! Absolutely unthinkable. Yes, it is possible Mesarites saw the Turin Shroud. It is metaphysically and physically possible. But it is historically very unlikely. And remember we are speaking about de Clari’s shroud because it is used as an argument against the radiocarbon dating. And you can’t opposite vague possibility to a well accepted dating method. Suppositions don’t cancel proofs. The sindonists must search out another way..","date":"2012-09-14","mins":"2:20 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16311","author":"david_mo","post":"Carlos, you wrote: “Jesús DESNUDO y MUERTO, bajo sábana, sobre sábana … …. O en el camino de la sepultura, es una idea EXTRAÑA (ignoro la razón) a la iconografía de TODAS LAS ÉPOCAS, aún con muy ESCASAS pero notables excepciones, lo que da MÁS VALOR , cuando se muestra desnudo y muerto en la Edad Media, a su posible relación con el CONOCIMIENTO de la existencia de una Sábana con la imagen de Jesús desnudo. En el siglo XIII el “Cloisters” es una excepción, como lo es en el siglo XIV la “mise au tumbeau” de la Iglesia de Onnens o la de la Iglesia de Landes.” You are wrong again. It is not true that the representation of a naked Christ on the shroud or under was an exception. Not only in the Middle Ages, but in the Renaissance and in Baroque period from Mantegna to Rubens the Crhist was naked or covered only by the shroud. He is depicted so by Michelangelo, Boticelli, etc. I have done a little survey in the French Ministère de Culture page for medieval manuscripts. I have looked for Christ in the Tomb enluminures in the 13th to 15th period. Approximately 30% were nude or with a transparent veil that concealed nothing.. So the concept of a naked Christ was a minority, neither “strange” nor “odd”, and it is explain naturally the Mesarites’ reference. My argument is not speculative. I summarize it: Part I. 1. When somebody sees an important event and wishes communicate it he mentions it directly. It is “strange” or “odd” to use vague allusions or double meanings when you can say the things directly. 2. The Christ’s image on a Shroud would be very important for Mesarites. 3. Mesarites doesn’t speak about an image of Christ on the shroud. (By contrast with the Mandylion). 4. Mesarites didn’t see any Christ’s image on the shroud. Part II. 1. The naked Christ (yes, into, under or over the Shroud) was a normal iconic concept at this time both in prayers or manuscripts specially in rich books of aristocracy or convents. 2. Mesarites uses a normal iconic concept of his time. CONCLUSION: There is nothing “strange” in the Mesarites’ mention to a naked Christ. We don’t need to look for double meanings or pathological/theological inhibitions. There is no “más valor” (whatever this is meant for you) in speculative relations with occult and mysterious references. This is speculative. Not my argument. PS: The idea of naked Christ in the baptism is derived from the idea of St. Paul that Chist is a new Adam and the symbolic significance of Holy Baptism. The refusal of a naked Christ is a logical consequence of the sexual repulsion in the official Christianity. You’re welcome..","date":"2012-09-15","mins":"2:06 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16114","author":"david_mo","post":"1. Mesarites speaks directly about an image of Christ when he is speaking on Mandylion. He says nothing about an image on the sudarium. He says only the sudarium wrapped the Christ’s body and he was naked. This is a frequent idea and icon at this time, i.e. The shroud wrapping naked Christ. There is no reason to suppose he had seen something paint in the sudarium, but he only repeated this ordinary idea. Scavone fantasizes when he matches two sentences: Jesus rises from the tomb in the Resurrection morning (Mesarites) and the cloth is raised (de Clari). They are obviously different subjects: Christ and the cloth. 2. Codex Pray is not a proof of the existence of the Turin shroud. I argued about two or three months ago. (https://shroudstory.com/2012/05/27/jones on the hungarian pray manuscript codex as discussed in wikipedia/ June 2, 2012, 3:45 and after). We can repeat the debate if you wish. Summary: to match two different icons you must find any feature clearly common and specific to both. There is not this common feature in Codex Pray and Turin shroud. Only a confuse one (“poker holes”) and several not specific others. And there are substantial differences between Pray and Shroud. 3. You wrote: “If the Shroud of de Clari was the same as the Shroud of Turin, I think it’s truly probable that this public showing of this Shroud (maybe the first ever) was one of the cause of this important artistic change concerning the depictions of Jesus related to his Passion, death and burial. Don’t you think it would be logical?” I think this argument is not logic at all. 3.1. The “artistic change concerning depictions of Jesus” doesn’t need a supposed identity de Clari/Shroud of Turin. It was prefigured and followed by other paintings and writings (legends, prayers, etc.) well known. You make a superfluous hypothesis. 3.2. The FACT is they are unknown artifacts in the cultural world at the time. It is incompatible with the impact you suppose. We have abundant testimonies about Christ Chalkites, Camouliana, Mandylion, Veronica’s Veil… We have abundant testimonies about Vera Crux, Thorn Crown, Holy Spear, etc. All these were well known and impacting artifacts. But you hypothesize about a practically unknown object with great cultural impact. This is an oxymoron. 3.3. I can establish a causal relation between two events or objects if, and only if, I can establish factual relations between them. This is not the case with de Clari and Shroud. Only imaginary relations can be established. Imaginary relations aren’t proof of anything. You haven’t answered my questions: “How this vaporous Shroud can influence all the cultural world of the 13th and before? How can you distinguish if the Shroud de Clari said he had seen is the cause or the effect of cultural attraction about the Christ’s death?”.","date":"2012-09-10","mins":"3:37 pm","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16329","author":"david_mo","post":"Carlos Otal : David Mo: 1. En la iconografía, Jesús desnudo NO ES Jesús con perizonium, por muy transparente que éste sea. 2. En la iconografía Jesús desnudo ( sin perizonium o similar) y muerto ( bajo, sobre….etc, etc) es extraño, raro, singular o poco frecuente, como quiera denominarlo, en el siglo 13, 14, 15, 16, 17, 18, 19, 20 y lo que llevamos del 21…. 3. Lo que es CONGRUENTE con la existencia de escasas pero notables excepciones que SI lo muestran desnudo (sin perizonium o similar). 4. Esta escasez iconográfica es MÁS notable con anterioridad a 1355. 5. Su propuesta “Mesarites uses a normal iconic concept of his time”, es una especulación no fundamentada y muy probablemente FALSA. Carlos Otal It is useless for you and me to discuss how we consider an almost inexistent and very transparent veil. I don’t recommend to you walk in the street with this “dress”. I think the police has not the same concept of nude than you. I accept your last definition of the problem we are discussing. The naked Christ is not very frequent. I have find 5 pictures of the naked Christ (under, over), 5 with transparent veil and 9 with perizonium in the Enluminures web (1100 1500). Seven more were not clear. You can call it how you wish. I say that the iconic concept of the Naked Christ was not very frequent but normally seen in books of prayer and sermons. The hermeneutics’ Golden Rule is: you don’t need to interpret a text if it is neither absurd nor incoherent. The Mesarites’ reference to a naked Christ under the shroud it is neither absurd nor incoherent. Ergo you don’t need any interpretation. The supposition of a double meaning or veiled allussion in the Mesarites’ words is superfluous..","date":"2012-09-16","mins":"2:38 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-16373","author":"david_mo","post":"Yannick Clément : “Many so called shroud researchers had no specific expertise in ancient textiles…’ I already expressed my opinion about these kinds of critics that we often see versus Shroud science and I think that a good and honest scientist who can get some proper informations from good documentary sources and clever advices from real ancient textile experts can do a very good job of research concerning the textile aspect of the Shroud. Ray Rogers is the most known example of that. Yannick: To be an expert in some scientific branch it is not “to make a study”, “to devote many hours” or “to speak with clever expert”. Expert scientists have academic studies, years of experience, an important bibliography and are well recognized by their peers (they work together, are present in academic meetings, conferences, etc.). You can be an expert without some of this features, but not without all of them. Rogers is the perfect case of non textile expert. He made two “extraordinary findings”. Red color of the blood in the Shroud is due to saponaria. The samples for radiocarbon dating were taken of an invisible mending. He never demonstrates his first hypothesis (never published nothing about). And Mechthild Flury Lemberg refuted his theory of invisible mending. Rogers was not an expert and made the typical inexpert mistakes. In STURP there was not an expert textile. They didn’t make any specific previous textile study on the Shroud. And Freeman puts a good example: this is unthinkable for a study of Mona Lisa or similar. No museum director will allow this. This is another example of inexpert ones doing work reserved to expert ones. They made big efforts to concluding nothing worthy. I don’t say this. They are Harry Gove’s words..","date":"2012-09-17","mins":"2:36 am","url":"https://shroudstory.com/2012/09/05/stephen-jones-latest-in-his-never-ending-critique-of-charles-freeman/","cat":"art","title":"Stephen Jones’ Latest in his never-ending critique of Charles Freeman"},{"id":"comment-190663","author":"david_mo","post":"I support Dan and Thibault’s suggestion of restricting the number of comments per day. The flow of mini comments of Max makes very difficult to look for the answer to an prior comment done by others. I don’t know whether this is a tactic or an effect of Max’s mental labyrinth, but it is very disturbing to the normal debate in this forum. Max: I think it would be easy to write less and longer comments and everybody would be grateful to you..","date":"2015-02-11","mins":"3:04 am","url":"https://shroudstory.com/2015/02/04/tweeted-picture-of-the-day-black-madonna-and-the-shroud/","cat":"art","title":"Tweeted Picture of the Day:  Black Madonna and the Shroud"},{"id":"comment-186839","author":"david_mo","post":"In favour of Charles’s hypothesis about a late degradation of the Shroud image: The altar boys of the church of Noalejo used to play with the shroud, by disguising themselves as ghosts. This is not a good way to conserve paintings in cloths, I suppose. A degradation process similar to the Shroud is plausible..","date":"2015-01-28","mins":"3:11 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185082","author":"david_mo","post":"I would be grateful if you can specify from where have you got the name of the artist (or copyist) and the date of the illuminations of the Pray codex. Thank you..","date":"2015-01-21","mins":"7:21 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185299","author":"david_mo","post":"“Now young Prince Bela and his court stayed in Constantinople from 1163 to 1173 CE. Here 1163 CE is the teminus ad quo i.e. The lower limit of dating, as of the earliest plausible date at which the pen & ink bifolium illustrations could have been drawn”. Excuse me, Max, but this is a simple speculation. You must get any indication to connect the Prince’s visit to Constantinople to the Pray codex. I am asking you for specific evidences (History) not imaginative speculations (novels). Do you have any evidence? (I await for this continuation)..","date":"2015-01-22","mins":"2:56 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185623","author":"david_mo","post":"Henrik: “In 1527” is not present anywhere on the Noalejo’s shroud. It is a free translation of the text. This is not serious from the point of view of the epigraphy. In fact any serious investigation has not been made about this artefact. Neither an article published in a specialized review. We are only able to follow the trail of it till the beginning of the twentieth century. Therefore, before to draw any conclusion some expert enquiries have to be undertaken. In particular the dating of the cloth and paint, textile and epigraphic studies, and others. Without that, we can only speculate. For example, we cannot exclude that the cloth don’t be a free copy of a copy of a copy made in more recent date than 1527. If these enquiries confirm the date that figure on the cloth, Charles should reconsider some points of this article. The colour of the Noalejo’s image is not so faint like the Turin Shroud, but much more than the copies that Charles has used as reference. Any degradation process would be previous to 1527..","date":"2015-01-23","mins":"3:17 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185303","author":"david_mo","post":"Excuse me. I cannot see “in 1527” neither in the picture nor in the transcription: “Sindonis imaginem sacri Chambariaci saccelli cernere hic potest recta dimensione per Gir. Actum”. The reasons of the dating would be others..","date":"2015-01-22","mins":"3:05 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185906","author":"david_mo","post":"Carlos: This article fails to satisfy the basic requirements that I demanded. The magazine is not a reliable scientific review. (This subject was discussed in Dan’s blog not long ago). The authors are not specialists in Archaeometry, textile History, Epigraphy, etc. Therefore they have not made any of the studies I mentioned. They only made a comparative study of the superficial features of the Noalejo shrouds. The same thing can be stated for The Noalejo Shroud copies by César Barta, José M. Orenga and Daniel Duque if not worse. (https://www.shroud.com/pdfs/n69part2.pdf)..","date":"2015-01-24","mins":"3:29 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185907","author":"david_mo","post":"Por cierto, que yo sepa “Gir” no es un nombre español..","date":"2015-01-24","mins":"3:33 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185908","author":"david_mo","post":"Translation: By the way, “Gir” is not a Spanish name, as far as I know..","date":"2015-01-24","mins":"3:36 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185914","author":"david_mo","post":"Thibaut: My sole point was that in Epigraphy (yes, the science of study of inscriptions and texts) you ought to transcribe literally the text and then interpret it. This is a formal lack of the studies by the CES and others that points to other general failures that I named. Fakers and copyists get used to puting false dates to cheat or dignify their copies. This is a very common fact. You have to remove this possibility before to draw any conclusion from the Noalejo shroud. And this is a work for Archaeometry and History. You cannot dating an artefact on the sole basis of a date put on by nobody knows who. This is an indication, but not a definitive one. Last, but not least, the colour of the Noalejo shrouds is more intense than the Shroud of Turin. You can draw any conclusion of this?.","date":"2015-01-24","mins":"4:08 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-185916","author":"david_mo","post":"By the way, “Alloy” is “Alcoy”. You’re wellcome..","date":"2015-01-24","mins":"4:16 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"},{"id":"comment-186110","author":"david_mo","post":"Don’t manipulate my sentence, please. “If these enquiries confirm the date that figure on the cloth, Charles should reconsider some points of this article”. (I will have to register my copyrigh)t..","date":"2015-01-25","mins":"4:19 am","url":"https://shroudstory.com/2015/01/18/you-cannot-fold-and-unfold-a-painting-and-more/","cat":"art","title":"You cannot fold and unfold a painting (and more)"}]
