[{"id":"comment-36339","author":"david_mo","post":"Yes, it is a great discovery. But… 1. Ötzi corpse was preserved in exceptional conditions in ice. 2. What is red is not the complete blood, but cells. 3 The “red” of Ötzi’s cells isn’t the red of Turin Shroud. You can see here: http://io9.com/5907418/scientists recover the worlds oldest human blood cells from tzi the iceman. It is a dark red brown, not a bright one. I don’t know if the new method is really accurate. If so it opens a way to resolve the question about blood or pigments in the Shroud of Turin. May be we ought to wait and see..","date":"2013-06-07","mins":"2:07 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36340","author":"david_mo","post":"Link to the original article here (Marek Janko, Robert W. Stark and Albert Zink. “Preservation of 5300 year old red blood cells in the Iceman”. Journal of the Royal Society Interface): http://www.mac.cat/Seus/Barcelona/Exposicions/Exposicions anteriors/Oe TZI. La momia del gel/Darreres novetats cientifiques sobre Oetzi. I’m sorry, the page is in Català. I hope you will find the link easily..","date":"2013-06-07","mins":"2:29 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-200650","author":"david_mo","post":"I am interested in the Baima’s theories but I will not buy one of his books. I have other priorities. Baima’s books are not in the librairies of my university (neither in the Theological faculty). Is there any way to consult one of them at least?.","date":"2015-05-31","mins":"4:57 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200729","author":"david_mo","post":"Bom dia, Louis, I have asked other thing and I am not Portuguese. Thank you anyway..","date":"2015-06-01","mins":"1:29 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-18261","author":"david_mo","post":"“Rather”, “suggestion”, “semi quantitative”… All this seems a little vague. Why Mr. Adler had not made a more quantitative (i.e., scientific) study. Something similar to this: http://www.ijpbs.com/data/APRIL JUNE%202011/74 81.pdf. Did he publish his work?.","date":"2012-10-25","mins":"3:01 am","url":"https://shroudstory.com/2012/10/24/how-much-bilirubin/","cat":"blood_studies","title":"How much bilirubin?"},{"id":"comment-196487","author":"david_mo","post":"O.K: Your arrows and lines on the pictures are fanciful. You retouch the pictures as you want. Thibault, your pictures are insufficient. We cannot see the whole process and the body position in a sequence. Garlaschelli experiment is not so impressive. It proofs what is of common sense. At least two evident things. Barber’s theory about the Christ doing continuous flexions of the arms to survive is a crazy fancy. In regards to the direction of the trails of blood they would run in diverse directions. Zugibe’s theory of the post washing marks. In a lying corpse the trails of blood would run in a very different direction. See the side wound, for example. It’s better than nothing..","date":"2015-04-16","mins":"2:43 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-18321","author":"david_mo","post":"Thank you Kelly. I wasn’t asking about articles in general, but about the concret item of bilirrubin..","date":"2012-10-26","mins":"2:49 am","url":"https://shroudstory.com/2012/10/24/how-much-bilirubin/","cat":"blood_studies","title":"How much bilirubin?"},{"id":"comment-187371","author":"david_mo","post":"I am still waiting to see as a wound in a scalp produces these “gracious rivulets” as in the Shroud.It would be easy to reproduce in a video (you know, photoshop does miracles). I’m still waiting to see how some “gracious rivulets” are produced when a cloth is pressed against a wounded scalp as in the Shroud. Quotes from “prestigious” forensic or not forensic specialist opinions are not impressive… when they come from devout believers. Remember that some prestigious forensic specialists say they are not possible. I am asking for facts. The hypothesis of a retouch is ad hoc. It is trying to avoid the evidence against a natural transfer of blood from the body to a cloth. But the homogeneity of all the blood stains in the shroud refutes it. Making two identical stains that remain identical in the lapse of centuries is impossible. Either the blood and the image of the body are from the first century or they are from the fourteenth century. Another alternative is not possible..","date":"2015-01-30","mins":"3:31 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187686","author":"david_mo","post":"A colleague in this forum has intended to silence the/my critical opinions with an argument of authority based on the opinions of some “prestigious” physicians. Arguments of authority are usually weak and are very weak when referred to fervent supporters of a particular belief. There are a lot of cases of biased fervent opinions even stated by “prestigious” personalities. When the opinions of “prestigious” fervent believers are stated I ever ask for reasons or facts. This doesn’t mean any kind of disdain to anybody but an elementary preventive measure. And I am absolutely sure that the believers would do the same in front of opinions of “prestigious” passionate sceptics. I have two additional reasons to ask for evidence and not opinions, if this is needed. The opinion of these “prestigious” physicians about blood stains is counteracted by the opinions of other “prestigious” physicians, either independent or not. The opinion or these “prestigious” physicians is refuted by personal experience of wounds and the pictures of blood trickles (two of them resented in this forum). Therefore I ask for evidence and suggest an easy experiment that could persuade me. I’m sorry if I don’t do it, Daveb. I am very busy with other works and the burden of proof is not mine..","date":"2015-01-31","mins":"4:24 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187994","author":"david_mo","post":"Thomas: Do you know any study of the blood of the shroud that speaks of heterogeneous results? I don’t know. In addition, different materials age in different ways. A retouch after centuries with the same appearance than the original is almost impossible..","date":"2015-02-01","mins":"2:55 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187998","author":"david_mo","post":"O.K. Your reply has nothing to do with our problem and my request. This is to say: Blood never runs by forming “gracious rivulets” on the hair (neither, by no menas, when transferred by pressing on a cloth). If you think this is possible, show it, please..","date":"2015-02-01","mins":"3:04 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"}]
