[{"id":"comment-181579","author":"david_mo","post":"About bloodstains on the hair: The most relevant marks are those on the nape because they cannot be moved out of the hair. I think some experiences and enquiries are not difficult. 1. Simulate a transfer with some kind of liquid similar to blood. It is easy to put the liquid on the scalp and let repose the head on a cloth of linen. I bet my neck that the result is not remotely similar to the Shroud. 2. An enquiry with forensic independent experts. Dr. Baden said that these marks of blood were impossible. Perhaps other experts can show some examples a contrario sensu, where the blood runs on the hair and is transferred to the cloth in a similar way to the Shroud. I am surprised that these simple things had never been done in a century of modern sindonism..","date":"2015-01-06","mins":"3:54 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181781","author":"david_mo","post":"This is a paradigmatic example of collective blindness. Carlos doesn’t see any blood on the nape (“Nuca”, Carlos. O “parte occipital del cráneo”, si lo prefieres)”. And OK presents here a big area soaked. The blood trickles of the picture run straight down only when they reach the skin without hair. And not one takes the form of spiral going from right to left. All these big differences independently that we are not seeing the marks on a cloth. Brilliant!… farce. = Così è (se vi pare)..","date":"2015-01-07","mins":"4:27 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181892","author":"david_mo","post":"Tranqui, Carlos. Take it easy, Carlos. I don’t invent anything. Dr. Baden said that blood rivulets on the hair never run as those of the Shroud. Hair is hair in the front and the back of the head. What is impossible in the front is also impossible in the back. (Do you need the Spanish translation?). I have made stand out the forms of the wounds to emphasize the difference in the forms. Everybody can see that the top of the real wound is expanded in a big stain and binds together little soaked locks of hair. And then, the trickles run on the skin in a straight direction blending each other. By no means can you match the actual injury with the curly forms of the rivulets in the shroud.If you go on to say that they are the same thing, I have nothing to add. Così è (se vi pare). (And this is so with independence that yet we have not transferred the blood to a cloth!)..","date":"2015-01-07","mins":"3:08 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-182008","author":"david_mo","post":"Ma solidarité avec les familles des assassinés et le peuple français. Parce que les terroristes n’ont pas seulment tué des gens, mais attaqué un des fondements de la démocratie, la liberté de presse, qui appartient à tous. J’ai lu ‘Charlie Hebdo’ des que j’etais trés jeune (Wolinski ètait une référence à l’époque) et je suis bouleversé aussi. La haine de ces gens est impuissante mais elle fait du mal. Il faut ne pas se taire jamais..","date":"2015-01-08","mins":"4:01 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-181893","author":"david_mo","post":"Of course. We can enumerate many other circumstances: rain, temperature, wind, form of the tomb, structure of the bones… But no one of them has anything to do with our problem. I don’t understand what influence could have the anointing, sweat, dirty, etc., on the creation of this mark: I remember you that this is the alleged trace of a wounded head resting on a cloth, that puts pressure on it. Dr. Baden said that that is impossible. I don’t need seven years of study of medicine to absolutely agree with him. I have two children and I have seen and healed some wounds along my life. In any way, my objections would be overcome if someone can put here a similar case to the Shroud with similar traces..","date":"2015-01-07","mins":"3:10 pm","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-182000","author":"david_mo","post":"Effectively. Other pathologists and sindonists have dealt with the subject. I know the work of Fanti and Lavoie. But they only speak of the frontal face. And they implicitly accept the point of Dr. Baden (blood don’t run on the hair by forming perfect rivulets) since they hypothesize about the formation of the image just to separate the blood trickles of the hair..","date":"2015-01-08","mins":"3:39 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-182325","author":"david_mo","post":"Carlos: Carlos: You are trying to be so subtle with words that you get yourself involved in the mess. (Te haces un lio). Dr. Baden said the trails of blood never run (factual impossibility) on the hair as perfect “rivulets”, as in the Shroud. This is what matters for our debate. Don’t intend to convert him in a doubtful person, because he was clear and conclusive on this “Porque son muchos los factores que inciden en el comportamiento que va a tener la sangre”. Empty sentence. “Las manchas de la nuca no merecen ese nombre.” Why? And so on. Words don’t mean what you have decreed they mean..","date":"2015-01-10","mins":"4:35 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-182504","author":"david_mo","post":"OK: Neither the arrows you made point to the darker parts of the blood nor there is a single trickle with a spiral form neither on the hair nor out to it. Who knows what is going on your mind..","date":"2015-01-11","mins":"3:05 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-182753","author":"david_mo","post":"Where are you seeing a trickle as this one on the hair of injured man? Where are the marks of the blood soaked locks of hair that cover all the surface of the high part of the head near de wound in the Shroud? Why you can see the trickles of blood (? ) and not the marks of the locks? Have you any rational explanation for this (not vague statements, please)? Yes. I have a problem. I am discussing with people that “see things”. Spanish translation: ¿Dónde ves un reguero de sangre en el cabello del hombre herido como éste? (Aquí la imagen) ¿Dónde están en el sudario las marcas de los mechones empapados en sangre que cubren toda la parte alta de la cabeza junto a la herida? ¿Por qué puedes ver regueros de sangre (?) y no las marcas de los mechones? ¿Tienes una explicación racional para esto (no vaguedades, por favor)? Sí, tengo un problema. Que estoy hablando con gente que “ve cosas”..","date":"2015-01-12","mins":"3:34 am","url":"https://shroudstory.com/2015/01/04/unique-blood-marks-explained/","cat":"uncategorized","title":"Unique Blood Marks Explained?"},{"id":"comment-121902","author":"david_mo","post":"I repeat here my question. May 20, 2014 at 3:18 am Reply You had written in other thread: “Most of the ancient Byzantine representation of Christ are showing great similarity with the face on the Shroud”. [Implied: some features of the Byzantine art were copied from the Shroud]. Here my question: “The face on the Shroud is showing a great similarity with most of the ancient Byzantine representations of Christ”. [Implied: some features of the Shroud were copied from the Byzantine art]. Why not?.","date":"2014-05-20","mins":"6:02 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","title":"The Vignon Markings Issue:  A Promoted Comment"},{"id":"comment-122038","author":"david_mo","post":"You seem forget the countless absurd relics that were going round in the Middle Age..","date":"2014-05-20","mins":"10:52 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","title":"The Vignon Markings Issue:  A Promoted Comment"},{"id":"comment-122444","author":"david_mo","post":"Russ Breault Most alleged relics were small pieces of bone, hair, clothing, etc. Nothing on the order of the Shroud. And most alleged relics were associated with various saints. What matters the size? A lot of evident artefacts have been considered authentic relics in the past. The Shroud of Besançon was considered as the actual Shroud of Christ. It was a big cloth and evidently painted. Credulity of man has not boundaries..","date":"2014-05-21","mins":"2:32 am","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","title":"The Vignon Markings Issue:  A Promoted Comment"},{"id":"comment-119033","author":"david_mo","post":"Sr.(sic) Ann writes: (…)If we want to preserve the concept of identifying facial portraits of Jesus derived from the Holy Shroud we need to revise Vignon’s pioneering work. (…) It would be wonderful if an interim report could be prepared in time for the St. Louis Conference. The message being, “Vignon was wrong but we’ll carry on.” I’m sorry Ann, but it will be a waste of time. First of all, an inquiry as you propose would have to be carried on by a competent team of Art historians. I’m not an expert on medieval Art at all, but I know that some essential features of Byzantine Art have been ignored by Vignon and other zealous amateur inquirers (1) and the mistakes due both to the inexperience as the lack of method can invalidate their efforts. Internet aids, but is not the answer. But last but not least, if this imaginary team will arrive to conclude that there will be some relevant similarities between the Byzantine Art and the Shroud, we have not resolved our problem because we have no reason to think that the Shroud influenced the Byzantine Arte and not conversely. Even if we can demonstrate similarity between the Byzantine Art and the Shroud this is not the basis for any argument in favour or counter authenticity, because the Byzantine influence in European Art arrives till the fall of Constantinople (1453). Sindonism and scepticism will be compatible with it. Hence, I think the relations of the Shroud with Art is an interesting and curious issue, but not relevant to the authenticity case. Footnote (1): I’m thinking in Erwin Panofsky: Meaning in the Visual Arts as a striking instanceof this oversight..","date":"2014-05-14","mins":"3:31 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-119709","author":"david_mo","post":"Dont be childish. Your tantrums won’t silence me. I will continue giving my opinions, wrong or not, and if they bother you I suggest you do not read them. You’re welcome..","date":"2014-05-15","mins":"2:01 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-119099","author":"david_mo","post":"O.K. That’s not true. There are several marks on the latter (http://www.arteguias.com/imagenes/cristoluzpinturas.jpg ), for example 1, perhaps 2 or 3, 12, 15, maybe more. Are you blinded or simply lying? You are right about the 15 and less or more the 12. But I would appreciate if you remove your accusation of lying. I have the habit to not discuss with someone who gets overexcited and aggressive. I have not insulted you and I hope you will follow the same rule and we can continue our debate calmly. I think you see some things that there are not and you are falling in a delusive perception. But I do not think you are lying. If this is not clear for you it will be better to leave it..","date":"2014-05-14","mins":"5:38 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-119279","author":"david_mo","post":"The game is over. I stopped looking for fight when I was at school. I am adult now..","date":"2014-05-14","mins":"11:50 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-119744","author":"david_mo","post":"Daveb of wellington nz May 14, 2014 at 6:21 pm This “watcher on the hill side” does not believe that Vignon was wrong at all. I consider that O.K. Makes a valid point that many of the Christ icons do show Vignon markings, and when they occur, they are consistently more frequent than such markings on non Christ portraits. It would not be uncommon for artists to imitate such features as Vignon markings in portraits of their other subjects. Who can enter the mind of an artist? Icons of Christ do show Vignon Marks? This is a confusing expression. Some icons of Christ show some combination of Vignon’s marks and other icons of Crhist show different combinations. Some Vignon’s marks are clearly visible (for example 15) and other are subjective. Some marks are visible only in some phtographies with some specific contrast. Etc. I have done my personal inquiry about Vignon’s marks on 44 instances of Christ’s images from Sixth Century to Fourteenth Century. This is a very imperfect study (as Wilson, and others) because I can not keep in mind thousand of manuscripts, woods, icons, frescoes, etc. I have focused my study on some instances of Byzantine images or influenced by Byzantine Art, i Including those usually quoted by sindonists. Only marks 1, 10, 11, 12 and 15 are regularly present in these images and can see clearly. The marks 5, 6 7 or 8 are practically inexistent, the same as the combination 2, 3 and 4. The mark 13 has two different ways of representation. In the same form as in the Shroud, i.e. Has a soft curve (http://www.mlahanas.de/Greeks/Arts/Painting/Fajum44.jpg) , is scarcely represented in the examples I have consulted. It is more frequent as an angular form (http://www.mlahanas.de/Greeks/Arts/Painting/Fajum2.jpg). First problem: Marks 1, 10, 11 and 13 in both forms are common marks to a lot of portraits of these times and even before. Then, we have only two marks that can be considered identifying of Christ: 12 (divided beard) and 15 (lock of hair). But in some portraits of John the Baptist (for example) we can see the same lock of hair. Evidently here it doesn’t represent any blood stain, but only a lock of hair. Why do you think that the same lock of hair represents a blood stain in the Byzantine representation of Christ? Have you any reason to think so? Surely not. I haven’t heard any explanation of this arbitrary interpretation. So, even in the supposition that the 15 Vignon’s marks were present in the Shroud (and I don’t see more of six or seven), there is not any “extraordinary coincidence” between these marks and the Byzantine iconography of Christ when we examine better the facts..","date":"2014-05-15","mins":"3:33 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-119752","author":"david_mo","post":"(…) I would agree that we now need to move beyond Vignon. Clearly the basic idea was to identify those characteristics that were often repeated in the icons, particularly those that had some claim to be representations of the mandylion. But it should not be surprising if such characteristics may sometimes be repeated in other sacred non Christ portraits, as imitating artistic style. Why? Le tus suppose that a commission of experts (experts, I agree!) can establish some evident connexion (nor subjective, nor imprecise) between the Shroud and the standard Byzantine representation of the Mandylion. How do you can establish if is the Shroud the origin of this standard representation of the Mandylion or the standard representation of the Mandylion the origin of the representation of Christ in the Shroud? None of these possibilities can be established by only an analysis of artistic forms. This is my first and main point..","date":"2014-05-15","mins":"3:56 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-119925","author":"david_mo","post":"DM: Why do you think that the same lock of hair represents a blood stain in the Byzantine representation of Christ? Have you any reason to think so? OK: One should remember that John the Baptist was born just a half year before his cousin Christ, so he is often portayed in the fashion similar to the latter. So in some occasions, he “inherited” the lock from Jesus. And that’s nothing unimaginable. This is not any reason. This is an ad hoc supposition. You and I can “imagine” a lot of things. But they are mere speculation before we be able to provide a proof of them. Meanwhile a lock of hair is a lock of hair and two locks of hair are two locks of hair. The mark 13 can be represented in various ways, but the most important point is that it is represented. Absolutely incorrect. You can not match two portraits because they represent two eyes, a brow, a mouth or some wrinkles in the neck. If it were so, we will match any portrait to another. You can match two portraits if the features are represented in the same form. And the form of the wrinkle in the neck of the Shroud (that actually is not) is very different of the wrinkle of the neck of the most part of Christ’s images we are analyzing. But these latter are very similar to many roman portraits. I think you will be able to extract the adequate inference. And why forger should copy all those tiny features from Byzantine icons into the Shroud? The sole feature common to the Shroud and the standard representation of Christ in the medieval art that might be clearly observable is the divided beard. All the other are based either on subjective vision or ad hoc inferences. Or they are not distinctive of Christ, but present in many other portraits. Without entering in some evident differences between the Shroud and the standard representation of Christ. There is no much to speculate about forgers. Advice: When you present a series of examples of Art pictures is technically advisable to identify them. You speak of a table in your presentation but I don’t see any one..","date":"2014-05-15","mins":"9:24 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-120309","author":"david_mo","post":"O.K. May 15, 2014 at 9:58 am Sorry, this was a link to the old version. Here is updated:https://shroudofturin.files.wordpress.com/2014/04/pantocratorsmarks. Thank you. There is not strange that you find a massive range of ‘occurences’ of Vignon/Wilson’s marks because you handle incomprehensible norms of comparison. Some examples: – The Holy Faces of Genoa (XVIII and XIX) and Vatican have a beard divided (????). – The Christ of the Shroud has rings under de eyes. (???) And leptons. – You do a ‘liberal’ intrpretation of mark 14 (rings under the eyes). But then, almost all the roman portraits of adult men, specially philosophers and emperors, have the same mark. It is not a characteristic feature of portrait of Christ! Nobody needed to copy nothing, but follow a pictorical convention thoroughly established. – You believe that two or three hairs sometimes almost invisible (VIII) are “similar” and “inspired” by a strong spiral form of blood(Shroud). (???) In Spain we say that this analogy “está traída por los pelos” ( is farfetched; literally: ‘brought by the hair’). Never better said. Have you any reason to suppose the first artist’s intention that converted the blood to hair or it is a mere supposition? Etc., etc. You should not be blamed by have claimed these nonsense. Vingnon’s theory is based on remote analogies and statements of intentions without any verifiable support..","date":"2014-05-16","mins":"2:21 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-120389","author":"david_mo","post":"Sorry, but in History of Art Vignon was so amateur as I am or worse (I have Internet and I have read some books). If am not in a mistake Vignon and his theory had no influence on studies of Byzantine Art. Perhaps, Wesselow?It wouldn’t be a big succes..","date":"2014-05-16","mins":"7:15 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-120395","author":"david_mo","post":"I have searched in the pages of Académie des Sciences de France and the Académie de Paris and I have not found any reference to M. Vignon. Can you be more precise about that reward won by M. Vignon? Thank you..","date":"2014-05-16","mins":"7:43 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-120396","author":"david_mo","post":"I have find this: http://blog dominique.autie.intexte.net/blogs/index.php/2006/04/16/yves delage paul vignon maurice vernes e No reference to any price and rather a gloomy biography of M. Vignon..","date":"2014-05-16","mins":"7:50 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-120447","author":"david_mo","post":"Dear O.K, are you sure what are you speaking of? Copernican Revolution?? You need much more than a Historian if you will speak of a Copernican Revolution. But the Copernican Revolution you claim becomes a ridiculous thing if the sole historian you quote is against the method of Vignon with at least a similar argument as I have done here. See “THE SHROUD OF TURIN AND THE FACE OF CHRIST IN PALEOCHRISTIAN, BYZANTINE AND WESTERN MEDIEVAL ART”: “Vignon was a scholar of the natural sciences, of chemistry and biology. His iconographic arguments in regard to the Shroud therefore lack a bit of exact methodology. He was not sufficiently acquainted with the very vast range of the diverse images of Christ nor the variety of details they show”. (p. 12) Your Copernican Revolution goes in a very bad path. Nevertheless, thank you for the articles of the Father Preiffer. Though they are not published in an independent review I read them with pleasure. If one will read only peer reviewed articles on this issue, one would not have any work..","date":"2014-05-16","mins":"11:05 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-120453","author":"david_mo","post":"BACK TO BASICS and reminder for David Mo : “It is always a VALID (my upper cases) sentence, that all that appears in a more natural or casual way in relation to similar elements in art objects has to be first and considered as the model for the same or similar detail in a work of art”. A beautiful sentence. But to apply it we need to be sure that the first is the first, that there are not other possible influences and that we are not in front of an artistic innovation. In the case of Byzantine art and a mysterious image without clear origins as the Shroud the work is not easy and we risk falling in oversimplifications. Nevertheless, I will wait to read the Pfeiffer’s articles before to engage in a discussion about them..","date":"2014-05-16","mins":"11:18 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-120702","author":"david_mo","post":"Louis May 16, 2014 at 11:26 am Father Heinrich Pfeiffer holds an important post in the Vatican’s cultural heritage department and it is a pity that the book he co authored with Father Werner Bulst has not been translated into English. Here is an interview with him: http://holyshroudguild.org/uploads/2/7/1/7/2717873/an interview with profess I haven’t found too much about Father Pfeiffer. Only Wikipedia in German and this: https://portal.dnb.de/opac.htm?method=simple Search&query=133660036 I’m considering dedicate an entry in my blog to him and I would like to know a bit more about his bibliography and curriculum, because the list above seems to me too short..","date":"2014-05-17","mins":"4:15 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-120718","author":"david_mo","post":"O.K. I had wroten: “ [he] is against the method of Vignon with at least a similar argument as I have done” Pfeiffer wrote: he did not realize its limitations. Therefore, even though we owe so much to Vignon, we will take a different path.” “At least” I agree with the emphasized words. It is that what I had said. But what is “sound” in the Vignon’s method is not explained here and I disagree on this. If he means that “these same disfiguring marks seen on the Shroud face are indeed found on images of Christ” I don’t know what “images of Christ” he is refering. If he has in mind the Pantocrator and other icons we had considered here, I absolutely disagree. I don’t know if this point will be explained later in the Pfeiffer’s writings you gently provide us. I’m at work..","date":"2014-05-17","mins":"5:58 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-121043","author":"david_mo","post":"Muy amable. Yes, I can read Spanish. Even I speak Spanish since I was 2 years old. I have more difficulties with German. Let us see if Google aids me..","date":"2014-05-18","mins":"4:22 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-121840","author":"david_mo","post":"“Most of the ancient Byzantine representation of Christ are showing great similarity with the face on the Shroud”. [Implied: some features of the Byzantine art were copied from the Shroud]. “The face on the Shroud is showing a great similarity with most of the ancient Byzantine representations of Christ”. [Implied: some features of the Shroud were copied the Byzantine art]. Why not?.","date":"2014-05-20","mins":"3:18 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"}]
