[{"id":"comment-166816","author":"david_mo","post":"Daveb: “On the other hand we have ancient documents that report that the image was perceived as “not made by human hands”.” Are you confusing the Mandylion with the Shroud? This is an old mistake. “ Byzantine epitaphioi, notably the Stavronitska, some dating from the early 12th century, would seem to be persuasively derived from the Shroud image, and the Shroud therefore can hardly be 14th century”. I don’t know the “Stavronitska” epitaphios. If you are speaking of the epitaphios of Stavronikita monastery in Mount Athos I don’t see “it seems to be persuasively derived from the Shroud”. I see a lot of differences between them. But this one is dated in the 14th 15th centuries. Http://www.elpenor.org/athos/en/e218ck20.asp Perhaps we are speaking about different things..","date":"2014-10-30","mins":"3:44 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-12986","author":"david_mo","post":"Davor: Very good articles. Nicolotti and you are in the same way. He analyzes other documents (more extensive comment about “tetradyplon” or Scilite codex, for example) but he arrives to similar conclusions as you. I am not interested in the psychological explanation of sindonists. I am interested in their logical mistakes and the relationship between logical errors and militant sindonism as 21st century myth. That is, a myth using reason as ancilla of faith. And when we talk of reason in the 21st century we speak of science. I am very interested in your reasons to believe that the Shroud of Turin is authentic. I think the opposite. (See my comments in this forum. Post Quote for Today. Lombatti’s Shot Down from the Ivory Tower. June 14 at 1:34 pm, June 15 at 9:44 am, June 19 at 1:59 am). I think here it is not the place for an extensive commentary, but if you write something about in your blog, I will read it carefully. A truly rational sindonist is a rara avis. (PS: I use the word “sindonist” for someone in favor of the authenticity of the shroud. No pejorative nuance)..","date":"2012-06-24","mins":"2:54 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-12991","author":"david_mo","post":"David Mo : Davor: I am very interested in your reasons to believe that the Shroud of Turin is authentic. I think the opposite. (See my comments in this forum. Post Quote for Today. Lombatti’s Shot Down from the Ivory Tower. June 14 at 1:34 pm, June 15 at 9:44 am, June 19 at 1:59 am). I think here it is not the place for an extensive commentary, but if you write something about in your blog, I will read it carefully. A truly rational sindonist is a rara avis. Please, forget this paragraph. I misinterpreted you..","date":"2012-06-24","mins":"10:11 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-13013","author":"david_mo","post":"Domenico : and what is Freeman’s interpretation or explanation of ‘tetradiplon’? “FORME E VICENDE DEL MANDILIO DI EDESSA SECONDO ALCUNE MODERNE INTERPRETAZIONI” Andrea Nicolotti, Università di Torino Atti del Convegno Internazionale – Torino, 18 20 maggio 2010, a cura di Adele Monaci Castagno. Pp. 289 91 E facile da trovare on line, caro Domenico. E lei sa leggere l’italiano, penso io. In English (Charles Freeman: “The Shroud of Turin and the Image of Edessa: A Misguided Journey”, The Skeptical Shroud of Turin Website, on line: http://freeinquiry.com/skeptic/shroud/articles/freeman shroud edessa misguided journey/ Prego..","date":"2012-06-25","mins":"11:18 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-13016","author":"david_mo","post":"Domenico: And if you’re interested in the opinion of the distinguished sindonist Emmanuel Poulle, you could read “Les sources de l’histoire du Linceul Turin. Revue critique”, Revue d’histoire ecclesiastique, 2009, Vol 104, No. 3 4, p. 770. This is an article abundantly cited by sindonists without reading it. It is illustrative. It tells us that the idea that the clergy in charge of the shroud and envoys of the emperor had not seen the painting displayed suppose “a lack of curiosity taht is hard to believe.” I agree..","date":"2012-06-25","mins":"11:32 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-13164","author":"david_mo","post":"Yannick Clément : I really think he should read my open letter about the evidence of the bloodstains : https://shroudofturin.wordpress.com/2012/04/21/please dont forget the evidence of the bloodstains/)… Sorry Yannick: There is no evidence of blood in the Shroud. There is a controversial subject. Frache and Mc Crone used conventional tests for blood. The result was negative. Adler and Heller invented a personal test. They found traces of blood. Baima Bollone identifies the blood type, but Raymond Rogers denies this possibility. And so on. No scientific archaeological lab has been in charge of the subject. They are who have something to say, and not experts in anything else. The detection of ancient blood is a very complex problem. Not for “amateurs”. And Frache, Mc Crone, Adler and Heller were “amateurs” sensu strictu. (I do not think it’s useful to talk about what some doctors think they see or not see in the evanescent image of the shroud. That’s wishful thinking). The bloodstains provide simpler evidence. No profound reflections or hyper scientific hypothesis are needed. «Blood never oozes in nice neat rivulets, it gets clotted in the hair. The anatomic accuracy is more what Michelangelo would have done in a painting than what actually happens to a body».” (Michael Baden, deputy chief medical examiner of New York for Suffolk County quoted by Marvin M. Mueller, reply to William Meacham “The Authentication of the Turin Shroud: An Issue in Archaeological Epistemology”, http://www.shroud.com/meacham2.htm ). The “blood” is painted. Whatever it is, is painted. That is all..","date":"2012-06-29","mins":"1:55 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-66357","author":"david_mo","post":"It is highly unlikely that the apostles or any other saved the shroud. In Jewish tradition the corpse was unclean and everyone who touched it had to undergo a stringent purification. The early Christians, for their part, were very critical of the sacred images. I know any image of Christ as a person until the third or fourth century. Even the cross became the symbolic staurogramm. The interest of the early Christians by the relics was zero. They had a highly spiritualized sense of their faith and needed any material proof. And I point to anyone. “Blessed are those who have not seen and yet have believed”, you know. We have to wait to fourth century when Saint Helen became relics fashionable. It seems unthinkable that if the apostles or any other Christian who had access to the tomb had kept the cloth with a miraculous image or without it, he had not made it public and the great event would not have been collected in the Gospels as another miracle..","date":"2013-12-24","mins":"4:40 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-67214","author":"david_mo","post":"John Klotz : Dave, There comes a time when all good (and bad) scientists and philosophers seemed compelled to cite Okkam’s (Occam’s) razor: The simplest solution is probably the correct one. I have a radical application to the mystery of the image that is in keeping with all the evidence except pseudo skeptics dominated by a world view that excludes my simplest explanation will probably start chewing the rug: My solution depends on a mysterious processes. No, not the Resurrection, but quantum mechanics. The simplest solution is the Resurrection. I’m afraid you have misunderstood Ockham’s razor. You can also say it another way: ” Entia multiplicanda non sunt sine necessitate ”. This means that given two explanations you must choose which requires fewer assumptions. In the case of the Shroud of Turin two explanations are possible: a) Result of a miracle b ) Result of a decomposition of the original image or similar. From an empiricist or scientific point of view that was the Ockham’s perspective , the alternative b ) is the simplest , because a) oblige us to introduce a lot of assumptions unproven (and not demonstrable ) concerning unknown energies , bodies that dematerialize and the like. The b ) simply admit a very simple thing: we do not know exactly how it was done. And this is something very common in science. This mistake is widespread. You seem to be unaware that Ockham formulated his principle to rid science of metaphysical principles and allow free passage to faith. It’s an interesting point of view. It is certainly more consistent than those that mix science and faith in the same jam..","date":"2013-12-25","mins":"4:32 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-67238","author":"david_mo","post":"Hugh Farey : I have a mouthful of rug already… delicious! “Have a mouthful of rug”? Sorry, but this is expression is not in my dictionary. May I know what means? Thank you..","date":"2013-12-25","mins":"5:18 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-67244","author":"david_mo","post":"“T David Mo : Hugh Farey : I have a mouthful of rug already… delicious! (…) but this is expression is not in my dictionary.(…) …this expression is not… Sorry..","date":"2013-12-25","mins":"5:24 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-167843","author":"david_mo","post":"Pilate’s executioners were artists! They managed to make more than one hundred marks of the almost the same size and hardlyever intersected. Furthermore, without a single tear of the skin. With a flagrum! I insist: what a great artists they were..","date":"2014-11-02","mins":"3:34 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-68095","author":"david_mo","post":"Daveb: Thank you for your philosophical lesson. Ockham’s razor is a useful indicator only when the evidence (or lack of) of two alternative hypotheses is comparable. Generally it is used to work on more elegant assumptions and simplifying too baroque hypothesis including no tested suppositions. But if we come to it you have to face the consequences, which in that case are not those proposed by John Klotz. Hugh Farey: Thank you also for your English lesson. But Ockham’s razor is different of the coherence criterion. Regarding the principle of coherence/consistency, quantum physics doesn’t invalidate it. This is an inaccurate and too repeated inference. Quantum physics only invalidates a particular translation of the CP to facts. I.e. The classic physics translation of CP to subatomic particles. CP maintains all his classical validity in the phenomenal world. Here a radiation cannot be a camel. And a shroud is not a handkerchief. This is what is important to make clear here. Because if someone decides not to follow the principle of consistency in their statements I go elsewhere. Have I congratulated you on your new position at the head of the BSTS Newsletter? If not, good luck and much success!.","date":"2013-12-26","mins":"4:23 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-168131","author":"david_mo","post":"When an argument is put is a nonsense to invoke supportive literature by confessional adepts. Barbet, Zugibe, Fanti et al. Are not experts in history of medicine and their main sources are the gospels. I had worked in a Human Rights NGO for fifteen years. I had to see some photographs of victims of the punishment flagellation and not one had the least similarity of the scourge marks of the Shroud. They were much more destructive although I never saw more of twenty or thirty marks together. The flagrum as described by contemporary testimonies was an awful weapon. Its blows tore the skin and the flesh till reaching the bones. Furthermore, the image of an executioner carefully selecting his blows in order to do a regular design is simply ridiculous..","date":"2014-11-03","mins":"3:55 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-78261","author":"david_mo","post":"If you look at the picture I provided above you clearly see some trickles of blood in a very similar way to the front one. They are spiral shaped and apparently run horizontally. If you don’t want to see them I can not force you to do so. They are trickles and not shapeless stains as we can expect with normal blood stains in a normal hair. Given the position in the back of the neck, no shift in the cloth can explain them. The hypothesis of Dr. Lavoie is a cloth that rests on the body first and then become more flat. First the blood and then the image were printed. So the actual position of the blood stains has to be moved one or two cm. The trickles actually run on the face and not on the hair. This is impossible to apply to the back of the neck, where there is only the hair surface where the trickles can emerge and run. I regret not having time now to devote to the problem of the absence of crushing surfaces in contact with the slab. In my opinion this totally excludes the hypothesis of a lying body and creates compatibility problems with other parts of the image, the theory of Dr. Zugibe and others. If I find a moment I shall go back on the subject..","date":"2014-02-11","mins":"4:42 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78396","author":"david_mo","post":"John Klotz : This thread has gotten quite long and maybe this has been covered before, but it seems to me that David Mo and perhaps others are not factoring in one obvious fact, and I do mean fact whatever your theory of image creation: The blood stains and the image were created at different times. First came the blood stains and then as much as 48 hours latter, likely no more than, 40 hours, the image came into existence by a yet unknown process. Trying to create a unified picture of blood and the image can only go so far. Yes there are blood stains in positions consistent with the image. That doesn’t mean they were created simultaneously.. If the image was created an instant when the body and the Shroud “parted company” then it is clear the blood stains were, to borrow a phrase from our fundamentalist brothers and sisters, “Left behind.” Because of writing I have been dealing with multispectral digital imaging (MSDI) for a couple of weeks. Of weeks. I think it may very well be that with MSDI we can strip away layers of accretions from the Shroud and get a definitive picture of the Shroud even before there were any markings on it.; the markings at the time Christ was first wrapped in the Shroud and the markings when the image was created. OMG All theories I know assume that there is a match between the blood stains and specific body parts that would be their origin. The discussion is particularly sensitive in the case of the exact position of the marks in the hand. There may be variations about two cm (Lavoie), but no more. I do not understand why the streaks of blood on the neck must obey a different law. I do not understand what part of the human body could they proceed without causing significant distortions of the fabric. (The neck is more than ten cm from the other parts of the body and the cloth of the shroud is a continuum that shows no important deformation). I think the only reason to suppose that the trails of blood in the back of the neck may have another origin is that the evidence a contrario sensu becomes too uncomfortable for your convictions. Sorry for the frankness..","date":"2014-02-11","mins":"4:29 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78409","author":"david_mo","post":"It must say: “The back of the neck”. Sorry..","date":"2014-02-11","mins":"5:08 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78407","author":"david_mo","post":"Mario Latendresse : Consider a corpse in rigor mortis which the back feet and back upper torso first touches the ground. In that case, most of the weight of the corpse is not on the buttocks, neither the calves, and therefore they do not appear flattened. The crucifixion would likely generate such a posture. My English must have deteriorated sharply in the last few hours, because I do not understand the answer or it does not have basis. If the body laid on her back, some circular or elliptical crushed shapes would be visible. And they are not. This applies to the back upper torso or any point of the body resting on a slab, with or without rigor mortis. The only difference would be that the flattening areas would be greater if there was not rigor mortis..","date":"2014-02-11","mins":"5:03 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79975","author":"david_mo","post":"Louis: You can see about archaeology, crucifixion and Yehohanan : Vassilios Tzaferis : “Crucifixion. The Archaeological Evidence”, BAR 11:01, Jan/Feb 1985, http://members.bib arch.org/publication.asp?Pub ID=BSBA&Volume=11&Issue=1&Article ID=6, : Zias, Joe : “Crucifixion in Antiquity. The Evidence” : http://www.mercaba.org/FICHAS/upsa/crucifixion.htm.","date":"2014-02-17","mins":"4:17 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79982","author":"david_mo","post":"It is also useful: David W. Chapman: Ancient Jewish and Christian Perceptions of Crucifixion , Baker Publishing Group, 2010. You can consult p. 88ss about “The Crucified Man from Giv’at ha Mivtar” in Google Books..","date":"2014-02-17","mins":"4:52 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78018","author":"david_mo","post":"Michael Baden, deputy chief medical examiner of New York for Suffolk County) only said : «Blood never oozes in nice neat rivulets, it gets clotted in the hair. The anatomic accuracy is more what Michelangelo would have done in a painting than what actually happens to a body».” (Cfr: Marvin M. Mueller, reply to William Meacham “The Authentication of the Turin Shroud: An Issue in Archaeological Epistemology”, http://www.shroud.com/meacham2.htm ). This is a very simple proof that the image is not a copy or imprint of a corpse on a sheet. You sindonists dislike to be reminded this. I cannot blame you. It is impossible to make a comprehensive autopsy on a more or less vague image. One of the signers of the works cited above did it once with a photograph in a court. He did a big mistake. Finally: the supposed rigor mortis is irrelevant. It is a theory that tries to explain why there is not crushing in the parts of the body that would rest on the slab. Dr. Lavoie clearly dismissed this assumption: no rigor mortis prevents to be crushed the body parts that are resting on the slab. Because neither hair, nor fat, and nor skin are affected by rigor mortis. So the discussion of rigor mortis seems irrelevant..","date":"2014-02-10","mins":"7:17 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78059","author":"david_mo","post":"Max: We may discuss whether the Lavoie’s theory of double printing gets removed all blood trickles over the hair of facial image. But we can not discuss the same with the back of the neck. Here the trails run hopelessly over the hair. See here please: http://shroudofturinwithoutallthehype.files.wordpress.com/2012/12/frontal and dorsal blood on hair cropped.png?w=768&h=411.","date":"2014-02-10","mins":"10:56 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-115961","author":"david_mo","post":"Your answer doesn’t refer to Shroud but to the Mandylion. You match both images. This is far to be evident. Even more, there is some relevant reasons to think they are different objects. Mandylion is represented in Byzantine iconography just as a face, with open eyes and without blood stains. So, if we very very hypothetically match the Mandylon to the Shroud as icons, why let us suppose that influence was from the Shroud to the Mandylion, and not in an inverse sense?.","date":"2014-05-10","mins":"5:51 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-115901","author":"david_mo","post":"Let us suppose that Vignon’s Marks are present in the Shroud of Turin and in a relevant number of Byzantine icons. I think it is not evident, but let us suppose. There is any reason why the Shroud was an icon that influenced the Byzantine art and not conversely? Do you know that some Vignon’s Marks are present in a number of El Fayum portraits? They were also influenced by the Shroud of Turin? I find the fact that Christ, Emperors, Saints, Angels and so on were painted imitating an unknow image is more than strange..","date":"2014-05-10","mins":"3:45 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116087","author":"david_mo","post":"Clublu22014 (May 10, 2014 at 6:25 am) “Because the Shroud is not a painting… and the Mandylion if not the Shroud was a painting or woodcarving”. If you believe that there is not a possibility, even a slight possibility, that the Shroud has been the accidental or intentional outcome of a human work, we have to face out the problem in a different way. But now my question was directed to Hugh Farey for I know he admits this possibility..","date":"2014-05-10","mins":"9:57 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116105","author":"david_mo","post":"Daveb of wellington nz May 10, 2014 at 6:41 am “(…) Vignon noted some 20 features that were often repeated. The same features can be found on the Shroud. He published his findings in 1938 as: “Holy Shroud of Turin: Science, Archaeology, History, Iconography, Logic”. The French Academy relented and awarded him their Prize. Clublu22014 comment above is pertinent”. I have already said we can start from the (hypothetical) likeness between the Shroud and a set of byzantine icons on the basis of M. Vignon’s marks. It is your position, at least. But my question is: What reason you have to suppose that the influence is in the sense from the Shroud to the Byzantine icons and not in the other sense? I see no reason. My answer to Clublu is worth for you also. PS: I will like to know why the option “quote” has disappeared from the comments. A new informatic disorder, Dan? Damn you, computer!.","date":"2014-05-10","mins":"10:26 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116148","author":"david_mo","post":"O.K. May 10, 2014 at 10:54 am Reply ’ll be gentle; shut up David Mo, if you cannot deal with such a minor problem with citing someone else, and have nothing meaningful to say. ???? I’m sorry if you are a computer, but I only blamed my computer and informatics in general. I think “shut up” is an ugly expression in English. Is it not?.","date":"2014-05-10","mins":"11:39 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116648","author":"david_mo","post":"O.K. May 10, 2014 at 1:54 pm The same what I asked David Mo; find some non Christ icon, with, say, 7 Vignon marks. Then we can seriously discuss the topic. No one understands that Vignon Marks are relevant not because they cannot occur without the Shroud (they can in some occasions), but because of statistical analysis the frequency of their occurences? There is not any statistical survey about the Vignon marks. The matching is done only on a range lesser than 20 instances. This is scandalously insufficient. As Hugh says, it is not difficult to find some icons with similar features that not correspond to the Crhist image. And some icons of Christ that not matched the Vignon marks. But there is worse. The same concept of Vignon marks is erroneous. For example, some alleged marks of Vignon do not exist. Surely, M. Vignon worked with a picture of small seizure or similar. But now we can easily enlarge the picture with any image processor. In doing so, some marks disappear because they are features of the photo not of the actual image. Let us see what occurs with the marks 2 and 3. (For Vignon marks I’m using: http://img411.imageshack.us/img411/2158/24301214.jpg. And I’m working with the face of the Shroud provided by the Arcidiocesi di Torino with a common processor: Windows photo viewer). They are seen with a lot of difficulty in a desktop size, but when enlarged a few we will see immediately as the marks will disappear. We only catch approximately the marks 2 and 3 if we contrast adequately a picture of small size in negative. Of course this is a resource that was not in reach of the people of the Byzantine Empire. And this happens with almost all the alleged Vignon marks. In short, the study of Vignon marks is an absolute loss of time only suitable for mettlesome amateurs. As Vignon was. And I too, I’m afraid..","date":"2014-05-11","mins":"4:10 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-117507","author":"david_mo","post":"O.K. May 11, 2014 at 6:49 am Reply David Mo: So if we limit ourselves to the Byzantine period, it is likely that we find, say 5 % non Christ icons with multiple Vignon markings and, say 5 % Christ iconswithout them. Are you sure? Do you know any inquiry having established those percentages? And another that has established the percentage of icons of Christ with the Vignon marks? I don’t know how many Christ’s images can be between the Seventh and the Fourteenth Centuries but I suppose we are speaking of several hundred or thousand. So, 10 or 15 images over a total of several hundred or more possible icons sounds as an irrelevant amount. Specially, because sometimes you see some features and sometimes you see another. With this play you can match the Shroud with almost everything. I have no slightest problems with finding marks 2 3 on Shroud Scope Durante’s positive photographs of the face. But I am not responsible for your blindness. If you see here https://lh3.googleusercontent.com/ 16q RAO3e0y E/U2 a Eq8h K4 I/AAAAAAAAB2 Q/gr5s Om MGA98/s400/il volto.jpg a triangle, a square and a “V”, you have super view. But this is a strange evidence that only is seen by those who want see it! (Do you know the anecdote of leptons and Mickey Mouse?). You can made an easy experience: put the Shroud of Turin, the face of Mannopello and the Pantocrator of Taüll in front of some people that don’t know the issue and ask them what features are common. Let us see how many Vignon marks are seeing. (If the examples seem too hard to you, you can chose other instances of the PDF that you linked)..","date":"2014-05-12","mins":"1:48 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-117509","author":"david_mo","post":"Mike M May 11, 2014 at 7:10 am I take this as a learning experience. What is considered “honorably sufficient” in comparing to pictures and what is your reference. I’m not a teacher and I don’t intend to do lessons to anyone. I think I have answered your question in my answer to O.K. Please see it. (…)Again please educate me, what picture size did Vignon work with and what is your reference? I suppose that Vignon used a relatively small photo token by Pia (perhaps a contrasted negative) because he confuses a wrinkle with the mark 13 and doesn’t notice that the square 4 his formed by two bandings of the weave. They are two things easily perceptible with a slight magnification of the image and more resolution..","date":"2014-05-12","mins":"1:51 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-117793","author":"david_mo","post":"Hugh Farey May 12, 2014 at 5:51 am I think there’s a bit of squirming going on here. OK rejects portraits which do not have shoulder length hair as Shroud derivatives. And that’s fine. (…) I insist the problem is conceptual. We arbitrarily choose fifteen features that never go together. Six or seven how much. (Why not the ears? Because the ears are ever present in the Byzantine iconography of Christ but not in the Shroud). Some of these features are not clearly visible either in the Shroud or in the Byzantine iconography. Some people see them but other people don’t see them. We enlarge arbitrarily the rank of our survey. For example, we accept the Pantocrator of Taüll but not the Pantocrator of the Cristo de la Luz of Toledo. Why? Because we think the first accomplish (?? I doubt a lot) some Vignon Marks and the latter not a single one. How long the influence of the Shroud reached ? How? These are some important points to an historical hypothesis never specified in this case. We made some arbitrary interpretation from a blood stain to a lock of hair, but we discard some pictures when the lock of hair doesn’t correspond to any blood (St. John the Baptist). These pictures will be an evident refutation or our hypothesis. The more common features (10, 11 and 13) are present on a lot of portraits, even long before to the alleged date to expansion of the (non recorded) presence of the Shroud in the Byzantine Empire. And so on , and so on. With this non rational method we can match the Venus of Milo with the Demoiselles d’Avignon. “Squirming”? May be. I don’t know this word..","date":"2014-05-12","mins":"9:49 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-117794","author":"david_mo","post":"Mike M May 12, 2014 at 7:25 am Your answer to OK was scandalously lacking of any criteria you used to declare 20 similar features were “scandalously” insufficient for comparing two images. You are in a mistake. We aren’t speaking of 20 features..","date":"2014-05-12","mins":"9:50 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-118341","author":"david_mo","post":"Instances (examples) and features are different things. An instance is the Pantocrator of Daphne. A feature of this instance is the wrinkle in the neck..","date":"2014-05-13","mins":"1:27 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-117798","author":"david_mo","post":"O.K. May 12, 2014 at 8:19 am On the contrary, Jesus without long hair is not Jesus. That’s the most striking feature not present at overwhelming majority of Peter, Moses or John Chrysostom icons. You are in a mistake. Jesus beardless and with the short hair was an icon that persisted till the first centuries of the Middle Age. And John the Baptist was ever presented with long hair and sometimes with a curl on the front. This has no necessary relation to the Shroud nor the actual appearance of Christ but to some theological conventions. Jesus with a beard and long hair was assimilated to the philosophers and Wisdom. Jesus beardless was the symbol of the Life. Cf: Chavanne Mazel, Claudine A.: “Popular Belief and the Image of Beardless Christ”, Visual Resources, Vol 19, nº 1; 2003; p. 19 24. It is on line, I think..","date":"2014-05-12","mins":"9:55 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-118364","author":"david_mo","post":"Hugh Farey May 12, 2014 at 1:45 pm David (Goulet)! In a word, yes. There is one interesting oddity which needs to be explained, namely the wavy line across the brows and the loop downwards over the nose (Marks 1 4 in various combinations) found in later Christs and Emperors, but I don’t think this is anything to do with the Shroud. In what sense ‘oddity’? I think they are a ‘stilyzed’ sign, perhaps of concentration and power. (‘Stylization’: a natural feature modified in terms of an aesthetic style). But they scarcely ever or never appear as a vertical succesion of signs in form of V+rectangular box+V (2,3,4 marks) in the space between the eyebrows. Not in the Shroud, of course..","date":"2014-05-13","mins":"1:59 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-118365","author":"david_mo","post":"O.K. May 12, 2014 at 9:45 am Yes on the non Christ they are accidental. On the Christ they are related to the Shroud. Petitio principii. You suppose the Mandylion is the Srhoud. This is far to be demonstrated..","date":"2014-05-13","mins":"2:07 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-118371","author":"david_mo","post":"…And even less with a series of modern replications of Mandylion..","date":"2014-05-13","mins":"2:16 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-13201","author":"david_mo","post":"Mario Latendresse : All these questions can easily be answered if one consider that there were many copies … 1.The Mandylion was extended at least twice. During the siege of Edessa the metropolitan extended it in front to the people. It also was extended before transfer to Constantinople to compare two copies and make sure it was the real Mandylion. (Andrea Nicolotti: “Forme e vicende del Mandilio di Edessa secondo alcune moderne interpretazioni”, p. 280, 296). It’s hard to believe that the Mandylion custodians not extend it ever. This lack of curiosity is unbelievable. (Emmanuel Poulle: “Les sources de l’histoire du Linceul de Turin”, p. 770). 2.People describe the Mandylion are not “someone’s friends” or people passing by. They are important imperial figures and custodians of the canvas. Do not ask your friends the size of the Shroud of Turin. Ask the Custodian Cardinal or Mme. Flury Lemberg. They will tell you the actual measurements. Sure. You answer “easily”… too “easily”. With imagination is easy to find solutions for everything. Imaginary solutions. History is more complex problem..","date":"2012-06-30","mins":"3:08 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13253","author":"david_mo","post":"Mario Latendresse : The question was “Given all textual and iconographic evidences, what was the most likely location of the Shroud between 5xx 944?’”. Petitio principii! “Given all textual and iconographic evidences” there is no evidence of the existence of a shroud with the Crhist’s image neither in Constantinople, or nowhere. Until 1204 (Robert de Clari)..","date":"2012-07-01","mins":"1:37 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13352","author":"david_mo","post":"Yannick: 1. Mesarites speaks of two different objects. One is the Mandylion and the other the shroud. 2. Mesarites is not talking about a picture of a naked body. Only says that the shroud wrapped the naked body. They are two very different things. 3. You have a lot of imagination. We’ve had a nice story. But the history is not done with imagination, but with data. And you tell us some things that are not true. It is not true that the Byzantines did not show naked Christ. In the Byzantine mosaics of Italy there are naked Christs. It is true they did not like to show the corpse of Christ (nude or not). So they painted one only in 1204. Other things in your story are not true. For example, the shroud was extended several times. (Bernard Flusin: “L’image d’Édesse, Romain et Constantin” en Adele Monaci ed., Sacre impronte e oggetti “non fatti da mano d’uomo” nelle religioni; p. 268). Other: an object that remains folded for centuries left clear marks on the fabric. Etc,.etc. Once again, imagination is good for telling stories. But stories are not history..","date":"2012-07-03","mins":"1:35 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13485","author":"david_mo","post":"Yannick: A correction: When quoting Flusin I did not mean the shroud, but the Mandylion. The context explains it. If not, I say now. Eastern Byzantine art largely disappeared with the iconoclasm. Italian Byzantine art comes from the Byzantine occupation. It is as Byzantine as Eastern. Example: Ravenna. There is no aversion for Jesus naked in Ravenna. If you see all or almost all medieval representations of Christ in the tomb depict him naked under the shroud. Mesarites could have in head the same thing. He need not have seen any representation of naked Jesus in a shroud..","date":"2012-07-05","mins":"3:30 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-13629","author":"david_mo","post":"Yannick: Occam’s razor is usually interpreted as recommending accept between two hypothesis that one than uses fewer assumptions and explains the same. To identify the three images you need to make a centenary of assumptions: about how was the image of Clari, what Mesarites thought, what are the holes in the Codex Pray, why are the wounds in the palms, on what the angel is sitting, and so on. The hypothesis that there are three different images makes no assumptions and explains the same: the presence in different places and times of three different images. According to Occam’s razor, is more likely..","date":"2012-07-09","mins":"2:17 am","url":"https://shroudstory.com/2012/06/29/questions-concerning-the-mandylion-hypothesis-proposed-by-ian-wilson/","cat":"history","title":"Questions concerning the Mandylion hypothesis proposed by Ian Wilson"},{"id":"comment-14749","author":"david_mo","post":"But, dear, if you admit as an explanatory hypothesis miraculous resurrection of the divine body (fade, dematerialization and so on), all efforts explanatory are superfluous. Omnipotent God can resurrect with Maillard reactions, effects Corona, low intensity laser beams or whatever else. Or all together while none of them. Have not heard you talk about the foolishness of St. Paul? Or we play to find a scientific explanation or we become theologians. Both things at once is a jam. In this sense I am “rogersist”..","date":"2012-08-11","mins":"2:07 am","url":"https://shroudstory.com/2012/08/09/off-topic-is-consciousness-fundamental/","cat":"news_&_views","title":"Is Consciousness Fundamental? Is Resurrection Fundamental to the Shroud Image?"},{"id":"comment-13297","author":"david_mo","post":"Corneliotel: His post is a clear example of what I mean by believers with wishful thinking. 1. Tell us what you know about these doctors with “brilliant” curricula. From what I know of some of them just shines in sindonists media. 2. Tell us how many of these doctors have been able to make a direct study of the Shroud of Turin. 3. Tell us how many of these doctors have published their studies in scientific journals or have presented their papers in academic meetings. 4. Tell us where you got your list. When we will have this data we can laugh together. Meanwhile let me laugh at your list. That in a hundred years you can only draw up a list with names is very significant. Consider that list shows that the medicine supports the sindonism seems a classic case of wishful thinking. Finally, let me also smile at your accreditation. Dr. Zugibe said with a good sense that the problem with the medical studies on the Shroud of Turin is that doctors do not are forensic. Then they said nonsense. As Dr. Barbet, big believer that you quote in the list of “brilliant” doctors. To believe that because one is phonologist or pediatrician is able to do a forensic report (“at the distance”) is not wishful thinking, is holy innocence. PS: I do not see the name of Dr. Zugibe in your list. Any problem with him? He say something do you not like?.","date":"2012-07-02","mins":"1:54 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13298","author":"david_mo","post":"Davor Aslanovski : Y I don’t know about you, but I am a weak man and find such temptations very hard to resist. No. I have not this type of temptation. My temptations are different. It would be hypocritical if I said they are no better. Perhaps they are not. But I try not to get carried away by false arguments, serious inconsistencies and obvious frauds. This is what the Secret Dictionary of the Oxford University said it is common sense. 1726..","date":"2012-07-02","mins":"2:10 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13318","author":"david_mo","post":"Carlos : ¿Está clara mi propuesta? Carlos or whatever is your name: No. Your proposal is not clear. You started by saying that there were many doctors with “brilliant” curriculum who guaranteed that the image of Turin was not a work of art. Then you provide a confused list without clear references, which includes general practitioners, surgeons, surnames (???), without reference to publishing titles, editorials, etc., etc. Now you hold that any physician who sees the blurry image of the Shroud of Turin is able to distinguish a true mark of a human body because he has studied a course in forensic medicine. Apparently not: I have quoted a forensic doctor who says this is impossible. I explained why and I have got no answer. Do any of the doctors on that list you put may explain how it is possible that streams of blood run over hair? To draw up a confused list of believer doctors is easy. To draw up a confused list of doctors and to maintain they say the image is of a real human being is also easy. Let’s be serious. You do not know if that the names you mention are all doctors, you do not know what is written in titles you quote (some are badly copied, some repeated) and to attend a course of surgery do not prepare you to make an open heart surgery. Moreover, I may explain you how some of the “famous” doctors that appear in your list commit blunders for not knowing the medieval art. All thumbs hidden history, for example, is explained simply by the position of the corpses in the burial of the time and also the way to represent the hands crossed in medieval painting. They are hands of Christ, Santa Margarita or nobles of the Sforza’s court. I can put a lot of examples. No need to know comparative anatomy. We only need to know what we are talking about: history of Art. Good, you are a believer and you’re doctor (but you do not know how to write a bibliography). Bringing together these things makes some doctors think more with their desire than with their reason. It’s called “wishful thinking” and is typical of sindonist world. But their speech does not reach the academic world. He stays in their circle. And what you have demonstrated with your confused list does not lead anywhere. When you present a correct list with the conditions I asked you, we can talk..","date":"2012-07-02","mins":"11:04 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13357","author":"david_mo","post":"Info: Zugibe made several experiments to disprove Barbet. And Baima Bollone acknowledged it at least once. You can see the experiments described here: “Experimental Studies in Crucifixion” (www.crucifixion shroud.com/experimental studies in crucifix.htm). I know the miraculous explanation of how the streams of blood that appear in the hair were originated on the cheeks. It comes from Lavoie. It is an ingenious explanation. But it has some problems. The main fault is that it can explain how in the back of the neck of the image streams of blood are still running over the hair (from right to left!). (See; http://people.bridgewater.edu/~rschneid/Focus Projects/Shroud/Shroud Measure/enrie Img.html). And that excludes the miraculous corrections proposed by Lavoie. Then, it shows that the streams of blood are painted. As Dr. Baden said and no one can deny. I think you do not understand that the disappearance of the thumbs has nothing to do with the crucifixion. It is a common way to represent hands folded in the Middle Ages. Here’s an example. Bonifacio Bembo (1420 1482), Court of the Sforza family, Bergamo, (http://www.myartprints.com/a/bembo bonifacio/people of the court of th.html ). Sorry: follow all your reasoning is tired. Sometimes I think you are a joker. Baden quotes Michelangelo as an example of a painter. Nothing else. That he alone could paint rivulets as the shroud is a joke. Please..","date":"2012-07-03","mins":"2:36 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13358","author":"david_mo","post":"I can show medieval images that have the same characteristics as “discover” the gullible doctors in Turin cloth. Even some features that are not characteristic of any human body. Naturally these images do not deceive any doctor who is willing to believe that the Shroud of Turin is authentic. Because these doctors are not willing to be convinced by anything. Just like you..","date":"2012-07-03","mins":"2:37 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13361","author":"david_mo","post":"“…explain…” (Oh My God!).","date":"2012-07-03","mins":"3:58 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13359","author":"david_mo","post":"David Mo : I The main fault is that it can explain how in the back of the neck of the image streams of blood are still running over the hair (from right to left!). “…it can’t expalin…” Sorry..","date":"2012-07-03","mins":"3:06 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13369","author":"david_mo","post":"Carlos: I repeat for you in Spanish. Puedo mostrar imágenes medievales que tienen las mismas características que “descubren” los medicos crédulos en el lienzo de Turín. Incluso algunas características que no son propias de ningún cuerpo humano. Naturalmente esas imágenes no engañarían a ningún medico que esté dispuesto a creer que el sudario de Turín es auténtico. Porque estos medicos no están dispuestos a dejarse convencer por nada. Como Usted Infórmese: Zugibe hizo varios experimentos que desmienten a Barbet. Y Baima Bollone lo reconoció al menos una vez. Puede ver los experimentos descritos aquí: “Experimental Studies in Crucifixion” (www.crucifixion shroud.com/experimental studies in crucifix.htm). La explicación de cómo los regueros de sangre que aparecen en el pelo fueron originados en las mejillas la conozco. Procede de Lavoie. Es una explicación ingeniosa. Pero tiene algunos fallos. El fallo principal es que no puede explicar como en la nuca de la imagen sigue habiendo regueros de sangre que corren por el pelo (de derecha a izquierda!). (See; http://people.bridgewater.edu/~rschneid/Focus Projects/Shroud/Shroud Measure/enrie Img.html). Y ahí no valen rectificaciones milagrosas como las que propone Lavoie. Entonces, eso demuestra que los regueros de sangre son pintados. Como afirmaba el doctor Baden y nadie ha desmentido. Creo que no ha entendido que la desaparición de los pulgares no tiene nada que ver con la crucifixión. Es una manera corriente de representar las manos cruzadas en la Edad Media. Aquí tiene un ejemplo. Bonifacio Bembo (1420 1482), Corte de la familia Sforza, Bergamo, (http://www.myartprints.com/a/bembo bonifacio/people of the court of th.html ). Espero que esta vez haya entendido. Mi inglés es muy malo, pero creo que no lo bastante para hacerse ininteligible. Dan Porter parece que lo entiende. (Thank you, Dan). Pero estamos en un foro en inglés. Creo que debemos hacer un esfuerzo para escribir en ese idioma. Yo, al menos, lo intento. Así que no voy a escribir otro comentario en español. Lo siento. Translation: I hope this time you understand. My English is very bad, but I guess not enough to be unintelligible. Dan Porter seems to understand. (Thank you, Dan). But we are at a forum in English. I think we must strive to write in that language. I try it at least. So I will not write another comment in Spanish. Sorry..","date":"2012-07-03","mins":"5:26 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13394","author":"david_mo","post":"Carlos: That depends: a) If my friend is pretty gullible. B) If the image is blurred enough. C) If you con convince him that all physicians who have studied the issue say it is the body of Christ. In other conditions, probably he will not believe. As not believe that the image of the Shroud of Turin is the body of Christ. Perhaps I have friends very critical. Let’s see if I understand what you mean: A person becomes injuried at head. I apply on his wound a cloth and let him lies (horizontally, of course). Then the blood will not soak the cloth or hair in patches. It will run on hair and cloth forming net streams here and there. You really are a doctor? Because I’m not a doctor but I have seen some similar cases and I know that it is impossible what you say. I need not invoque Dr. Baden. Although he also says it is impossible and has seen many corpses. Apparently many more wounds and corpses than you. PS: Again you are misinformed. If you’ve read the book, you read it wrong. Barbet said that there is pain, but is nerve damage which causes the thumb shrink. «La contraction de ces muscles thénariens, encore vivants comme leur nerve moteur, s’expliquait facilement par excitation mécanique du nerf médian (…) Le Christ a donc dû mourir et se fixer dans la rigidité cadavérique, avec les pouces opposés dans les paumes. Et voilà pourquoi, sur le Linceul, les deux mains vues d’en arrière ne presentent que quatre doigts, pourquoi les deux pouces sont caches dans les paumes.» Pierre Barbet, La passion de N. S. Jésus Christ selon le chirurgien, Dillen, Paris 1950, [3, p.136]. Translation (aprox.) to English: “The contraction of the thenarian muscles, still alive, and their motor nerve, was easily explained by mechanical excitation of the median nerve (…) Christ had to die and rigor mortis set in, with his thumbs opposed into the palms. And that is why, on the Shroud, the views of both hands behind present only four fingers, for the two thumbs are hidden in the palms.” I can give you the digital version if you want to compare the quotes..","date":"2012-07-03","mins":"12:05 pm","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13425","author":"david_mo","post":"Carlos : La contractionde ces muscles thénariens, encore vivants comme leur nerf moteur, s’expliquait facilement, par excitation mécanique du nerf médian.” y Con respecto a la sangre, Baden no dijo que fuera imposible, sino que tenían que haber sido lavadas…. Es decir que Baden admite que hay FACTORES que pueden modificar su criterio. Usted no ha podido ver casos similares a los acontecidos en el Hombre de la Sábana «Blood never oozes in nice neat rivulets, it gets clotted in the hair.» (Dr. Baden). I do not know another opinion of Dr. Baden about washed the corpse. Do you not are thinking in Zugibe? I do not understand the conection between to wash the corpse and the bloodstains on the hair. I have seen many wounds. I have seen head wounds. I have seen to heal wounds with cloths. I have done it myself. And I know the liquid streams fall downward and not from left to right. It is the gravity force, you see. I do not need Dr. Barbet, Villalaín, “Notowski” or someone else to say me that the “rivulets” winding on the neck hair are impossible..","date":"2012-07-04","mins":"3:37 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-13281","author":"david_mo","post":"Davor: I think that raising the issue as a struggle between orthodox and heterodox is a bad approach to be discussed outside the academic world. The fact that in a hundred years the sindonists have placed only a handful of articles in scientific journals and their presence in meetings and faculties of history is virtually inexistent does not say much for their “orthodoxy”. But that will never be accepted by the sindonists. Especially those with no academic experience, who are the majority. You have clearly shown that Wilson’s arguments are inconsistent. You have shown a high level of competence. But you can not expect that people who discuss with you have the same competence. You can not even pretend that they realize that their arguments are wishful thinking. Because if it would so it would cease to be wishful thinking. We are not talking with scientists, Davor. We’re among believers..","date":"2012-07-01","mins":"11:36 am","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-39757","author":"david_mo","post":"It seems that M. Flury Lemberg is quoting Aviram J., Foester G., Netzer E. Eds. (1994), “Masada IV. Final Reports”, Jerusalem: Israel Exploration Society.. It also seems that Flury Lemberg makes some mistakes. Cf. Antonio Lombatti: “La Sindone e il giudaismo al tempo di Gesù”, Scienza e Paranormale numero 81, settembre/ottobre 2008, on line (in Italian): http://www.cicap.org/new/stampa.php?id=273770#. Lombatti claims that in Masada there aren’t any funeral cloth and least of all 3:1 herringbone linen. (“Section two (pp. 152 282; A. Sheffer and H. Granger Taylor; with V. C. Koren and O. Shamir) covers textiles, dyes, and loom weights/looms. The unusual corpus of textiles preserved in Masada’s dry climate includes fragments of both men’s and women’s tunics, mantles, and cloaks; hair nets; coverlets; linen towels; and goat hair sacks”, from the abstract of “Masada IV. Final Reports”). Diana Fulbright (Fulbright, Diana (2010): “Akeldama Repudiation of Turin Shroud omits evidence from Judean Desert”. ENEA, Frascati, http://www.acheiropoietos.info/proceedings/Fulbright Akeldama Web.pdf ), discussing about the Turin Shroud, also refers to Masada. I don’t know why..","date":"2013-07-26","mins":"3:04 am","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?"},{"id":"comment-39829","author":"david_mo","post":"Wilson’s reference to “invisible (?) seam” is too vague for ulterior conclusions. If I’m not wrong Frau Flury Lemberg has investigated anything about Masada textiles. Only a few references in her book about Turin Shroud, and haven’t always been correct. The side band in the Shroud was well known before the restoration of 2002. If I don’t remember badly it wasreported by Raes and STURP. Nobody has said it was “invisible” in any sense. The recourse to word “invisible” seems to me a verbal fetishism. Fulbright has succeeded in rebutting some claims in the popular press that asserted that such a larger cloth as the Shroud was impossible before modern times. But nothing more. And this is to use a sledgehammer to crack nuts. The examples she provide are well known by experts in Middle East history. No surprise. Some experts had said the Shroud fabric is not possible in the Palestine of the 1rst Century for different reasons. There is universal consensus between sindonists and no sindonists: to weave the herringbone of Turin Shroud a loom of four pedals is needed (Virginio Timossi, 1942 et al.). And the problem is that such a loom is known in Mediterranean area just after the 4th Century when it came from China. About this Fulbright says nothing..","date":"2013-07-27","mins":"3:08 am","url":"https://shroudstory.com/2013/07/25/what-did-wilson-andor-flury-lemberg-actually-observe-about-stitching/","cat":"history","title":"What did Wilson and/or Flury-Lemberg actually observe about stitching?"},{"id":"comment-207536","author":"david_mo","post":"I am not competent in ancient Greek to discuss the analysis of Mrs. Fulbright, although I had read two or three articles that are not in line with the meanings that she attributes to some words. But this is not my point. I want comment two pictures of her article. Figure 1: This is not the way of wrapping “according to the custom of the Jews” in Palestine at the first century. See articles by Orit Shamir: http://antiquities.academia.edu/Orit Shamir. The sheet of linen as a shroud was a custom introduced by Gamaiel II (post fall of Jerusalem). The picture is relatively similar to the Jewish shroud from this date (70 CE). Notwithstanding, some typical elements are lost in the image: the bandages used to wrap the shroud. For example, the sheet position under the back of the knees is impossible without them. But this position of the shroud is absolutely incompatible with the 3 D theory of the image and any other natural process of produce an imprint. The image would have plenty of wrinkle marks. This is not the case. I am wondering what have to do this picture with the customs of the Jews or the Shroud of Turin. Picture two: the location of this tomb is incorrect (“Givat ha Mivtar, Jerusalem”). See Zangenberg (https://openaccess.leidenuniv.nl/bitstream/handle/1887/13022/oratie%20zangenberg.pdf?sequence=1, 2007: 8) or Konstantinos D. Politis: “The Discovery and Excavation of the Khirbet Qazone Cemetery”, fig. 10.4, p. 216). The correct location is in Khirbet Qaazone in West Bank. The correct dating is second or third centuries and it is not a Jewish tomb, but a Nabatean one. I am wondering what have to do this image with the Shroud of Turin. PS: I am a little surprised also because the word “Σινδών“ appears several times without the sign of accent over the omega. ¿Masterly?.","date":"2015-08-06","mins":"2:16 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-13279","author":"david_mo","post":"Ron : On the contrary Menedemus, de Clari’s description … R Clari makes no description of the “figure” that he saw. Nothing of the hair, hand positions, nudity, the double figure, the marks of the passion, etc. Talk of a description is pure fantasy. Without a description there is no way of knowing whether what he saw looked like the Shroud of Turin. To draw conclusions to nothing is pure wishful thinking..","date":"2012-07-01","mins":"11:01 am","url":"https://shroudstory.com/2012/06/30/wilson-the-exoheretic-what-yes-exoheretic/","cat":"history","title":"Wilson the Exoheretic. What? Yes, Exoheretic."},{"id":"comment-72689","author":"david_mo","post":"Someone in this forum has said that those who deny that the legend of King Agbar is historical only show a “prejudiced” opinion. Yes, the same “prejudiced” opinion that those who claim that there are no little green Martian invading Earth. For a little bit serious and impartial historian worry by King Abgar someone would have to demonstrate or give an indication of the following: 1. King Abgar V existed. 2. There was a letter from King Abgar to Jesus. 3. Jesus answered. 4. Someone brought a picture of Jesus to the King. 5. There were Christians in Edessa before the reign of Abgar IX (200 B.C). … and so on. Of course, no one has contributed anything concrete about it. Only suppositions and “imagine that”… If historians had to deal with all the possibilities that can imagine anyone to make plausible all the legends of the world, the story would not be history, but a madhouse..","date":"2014-01-09","mins":"4:33 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72874","author":"david_mo","post":"O.K: You are a little old fashioned. The time of romantic archaeologists who dug inspired by legends is over. But even they had some factual indications together with romantic speculations. (Evans, the ruins of Crete; Schliemann, some geographical references). These indications were guidelines to elaborate some verifiable hypothesis and were applied to a concrete program of digging. These tests showed as Schliemann or Evans was absolutely wrong in their romantic speculations. Yes. They find the ruins of a town in Hisalrik and a palace in Crete. Audaces Fortuna juvat. But they are neither the Homeric Troy nor the king Minos’ palace. (A different story is told to tourists. It seems that you have swallowed it). If you wish to combine a set of relevant indications, a hypothesis about king Abgar and Jesus, elaborate a test and implement it, fine! While the sindonists merely confine them to claim the abstract probability of legendary narratives, this is not more than chatter. And chatter is not matter of History. But I am a little astonished with your subsequent references. I don’t know why you send us to Eusebius of Caesarea or the legend of Addai. Are you saying they are evidences of the correspondence between Abgar and Jesus and the subsequent miracles? Really? I don’t believe! I neither understand your reference to trolls. Have you the David the Gnome’s syndrome? Take care of yourself..","date":"2014-01-10","mins":"7:49 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72693","author":"david_mo","post":"Better: …”History would not be History…”.","date":"2014-01-09","mins":"4:47 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"}]
