[{"id":"comment-175497","author":"david_mo","post":"Mario Latendresse: “This is false, because, assuming that the color intensity correspond to a relief, we can perceive a 3 D corpse that looks like a real corpse (granted with some distortion at some places).” You are wrong because the shorud doesn’t reflect the distances to a body in function of the distance, neither if it were laying on a human body nor mysteriously flattened. Some uniformly coloured areas of contact (not points) would appear in the first case, and the distance between a plane (the sheet) and the body will not correspond to the image of Shroud, in the second case. It will be so in any system of topographic translation that you will be able to suppose. The “distortions” are big. “The subtlety of the 3 D information embedded in the facial area is beyond the capability of all known painters of the 14th century”. There is not any exceptional “subtlety” in the 3 D information. I can do a similar imageof the race in five minutes. Of course, technically worse because I am a very bad drawer. The originality lays in the conception: an imprint marks more the protruding parts of an object. But, as I say above, the solution of the Shroud is not “subtle” if you are thinking in realistic. And originality doesn’t imply “beyond the capability”..","date":"2014-12-10","mins":"3:59 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175498","author":"david_mo","post":"Typo: “of the face”, not “the race”, Sorry..","date":"2014-12-10","mins":"4:00 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175518","author":"david_mo","post":"Typo: “…the shorud doesn’t reflect the distances to a body in function of the intensity of the colour”, not “…in function of the distance”… Sorry..","date":"2014-12-10","mins":"7:08 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175658","author":"david_mo","post":"I have not read the answer to my questions. I don’t understand what you mean with “encoded 3 D information”. The eyebrows are the most coloured part of the face (with the nose and the moustache). The area surrounding the eyelids is white (not coloured). It is a circular area. Where was placed the shroud to produce a hollow of more than five cm. Between the eyebrows and this strange orbital area? (The same reflection on the calves and other parts of the body). How is possible that Jumper and Jackson were able to determinate the correlation colour distance without these “subtle” distortions and without any flat area nor a wrinkle of the cloth? See here the position of the Shroud according Jakcson and Jumper: htps://lh6.googleusercontent.com/ Qvl8 Rzw4 Cjo/UP aik FI Jz I/AAAAAAAAB Ng/Unmqf S Dmd 4/s400/jacjumperret.jpg No. The “perfect 3 D effect” is a myth sometimes surrounded of an empty terminology as “subtle”, “encoded”, etc., that means only beliefs and not facts..","date":"2014-12-11","mins":"3:11 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-175659","author":"david_mo","post":".","date":"2014-12-11","mins":"3:16 am","url":"https://shroudstory.com/2014/12/09/should-we-be-rethinking-the-vp8-and-3d-images/","cat":"3d","title":"Should we be rethinking the VP8 and 3D images?"},{"id":"comment-211881","author":"david_mo","post":"Other myth: linear regression. There is not any correlation (neither 3,7 or other) that matches with the pictures of the real simulations body coth. In any position, some portions of the cloth will be in contact with the body (both in front as in the back) that would produce regular areas of intense coloration. And the natural wrinkles produced on the cloth and, accordingly, in the image are nonexistent..","date":"2015-10-06","mins":"6:17 am","url":"https://shroudstory.com/2015/10/02/the-definitive-word-on-3d-from-ok/","cat":"3d","title":"The Definitive Word on 3D from OK?"},{"id":"comment-206722","author":"david_mo","post":"I wrote this some time ago: “The Shroud is not a “medieval artwork” in the usual sense of a portrait or a pictorial scene. The Shroud is the image of the trace of a corpse on a sheet as imagined by a medieval artist”. So you cannot ask for other medieval images that had deceived some pathologists. “I challenge Hugh to identify any single work of art, not a photograph, but whether monochrome or not, whether on linen or not, that has been successful in persuading reputable and experienced forensic pathologists, that the subject was actually a real person, alive or not, and not actually a product of a mere artist’s skill”. This is a wrong question. First of all because the usual medieval images (we are speaking of the Gothic period, are we not?) is not made to simulate the imprinting of a corpse on a sheet. This is the main purpose of the author or the Shroud and it is not the same of crucifixions, descents from the Cross and entombments of the epoch. Secondly, and derivated from the first point, there is not any believers’ group oriented to show that Mantegna’s, Martini´s or Giotto’s works are real imprints of a corpse. Obviously, they are not. And I had also written: “I be grateful if someone explains me what are the stylistic features of the Shroud that do not correspond to the Gothic style. We can say the schools of Firenze or Siena, for example. Or the Franc Flemish style, if you like”. That is to say, even with different purposes, the image of the Shroud and the pictures of the last Gothic period have some similarities. Stretched features (specially the fingers and the nose), short blonde hair, swollen belly, broad pectorals, etc., are some striking similarities and I am sure that an expert on Gothic art (Wesselow not, of course), will find some others. And I have already shown on another occasion that Gothic artists had a good anatomical knowledge similar to the image of the Shroud, if not better. NOTE: I say that not Wesselow because he makes the same mistake as usual between sindonists: he denies that the Shroud is a work of art. I agree. But this is not the question!.","date":"2015-07-28","mins":"1:58 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-206871","author":"david_mo","post":"Max, see this, please: http://www.apostoliki diakonia.gr/en main/catehism/theologia zoi/themata.asp?cat=hist&NF=1&main=texts&file=8.htm , http://www.ashgate.com/isbn/9781409420385 , Here a byzantine Pantocrator by Simone Martini: http://i4.ytimg.com/vi/dq Tf83 Eze RE/hqdefault.jpg.","date":"2015-07-29","mins":"10:36 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-206934","author":"david_mo","post":"Contradicted? Why? The links I have provided you show the influence of byzantine art on the first Renaissance. No surprise if they have many points in common. What is the problem? The illustrations of the Stuttgart Psalter are beautiful. So…?.","date":"2015-07-30","mins":"1:37 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-206858","author":"david_mo","post":"My comments don’t appear. What’s the problem?.","date":"2015-07-29","mins":"8:52 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-206867","author":"david_mo","post":"Thomas: Pisano was not the only artist with anatomical knowledge at that time. There were in Europe other painters and sculptors and their disciples. Furthermore, Garlaschelli’s experiment shows that it is not difficult to make an acceptable copy of a human body. And Garlaschelli and his team were not artists. In any case, we are discussing the unfortunate statement of I. Piczek that medieval artists weren’t able to make a correct anatomical image. This is a big mistake for an expert! And this is not the unique in Piczek’s statements. I think the claims about the perfection of the Shroud image are biased by the strong beliefs of the sindonist experts. I don’t think that a prudent pathologist would dare to present a conclusion based on a blurred picture as the Shroud in front of a court. To act in a video or a sindonist congress is another thing. Of course. Measurements on the blurred Shroud image are a subjective matter. For exemple, the distance between the two images is 18 or 12 cm. Depending authors. And Dr. Zugibe didn’t evaluate the appearance of the fingers as you do. The very long fingers (the index is as long as the middle finger!) are similar to some spiritual images of the Madonna or the saints..","date":"2015-07-29","mins":"10:32 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-206870","author":"david_mo","post":"See: Pisanello1395 1455, Madonna With a Quail. (I canno include the link. It is easey to find).","date":"2015-07-29","mins":"10:36 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-206868","author":"david_mo","post":"Perfect now!.","date":"2015-07-29","mins":"10:33 am","url":"https://shroudstory.com/2015/07/26/1999-interview-with-isabel-piczek/","cat":"image_theory","title":"1999 Interview with Isabel Piczek"},{"id":"comment-171660","author":"david_mo","post":"“Or people traveled to where the shroud was”. John: If the Shroud had been so important that some people has seen it and then copied diverse features of it, someone had represented not only the wounds of Passion but the very form of the Shroud. This is not the case. There is not a single representation of the Shroud folded in two as the Turin Shroud before 1350. And only one before the 16th Century. And remember that the form of the Shroud is perhaps the more representative feature of it. Attributing so big importance to a semi concealed object is impossible. The fame and diffusion of the Shroud begins only in the 16th..","date":"2014-11-17","mins":"2:34 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171678","author":"david_mo","post":"Don’t be confused. Lack of depictions is contradictory with wide influence. The existence is ascertained with references in texts. We have some texts with references to the Shroud, but not depictions..","date":"2014-11-17","mins":"4:41 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171669","author":"david_mo","post":"O.K: “My answer is that it was opposite way than you claim, that is the Shroud had a crucial impact on the iconographic revolution of 12th 14th century. That explains both things: 1) why there is similarity (if one may call it) between Shroud and 14th century iconography 2.) what is the origin of the 14th century representations of the crucifixion and entombment. Your opposite claim may answer 1.) but not 2.) So mine is better in that issue.” There are other explanations of the concern on deathand pain in the 14th Century. They are well founded on historical and social events that produced a change of mentality. For example: the ravaging black plague or the endemic state of war in France and other European countries. These and other dramatic events produced a reduction of one third of the population and some heretic and ascetics movements. It is the moment of the popularity of the Dances of the Death in Art, for example. Or the flagellants, that is a case in point. Furthermore, your alleged explanation is fanciful. (See my comment to John Green). A fanciful explanation is not better that ignorance. I think your problem, you sindonists, is the absolute ignorance of History. It seems that you sometimes confuse History with Game of Thrones..","date":"2014-11-17","mins":"3:23 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-171825","author":"david_mo","post":"O.K: Wise? This is not a debate for “wise men” (whatever you want to mean with this) but for experts and I’m not one and never I have pretended to be one. (I say this in the entry of my blog referred to medieval iconography of the Three Women at the tomb. Here: http://sombraenelsudario.wordpress.com/2014/08/10/las santas mujeres en la tumba vacia imagenes/ I’m sorry but your presentation about crucifixion is worse than the other that we have discussed here about Fourier transform. There are not clear conclusions, no criterion to selection, unwarranted inductions and an absolute misunderstanding of the History of Art. I cannot answer to your questions because they are incorrectly stated. For example, you asked: “ the reduction of number of nails presented in crucifixion portrayals, from 4 to 3?” The question is badly poosed because there is not a single reason for this reduction, there is not a unique process of reduction and the answer makes no sense if we don’t precise this points. There are some periods and some artists that have represented three nails and other four nails. This depends of theological conventions about what is the correct way to see the Christ and of artistic conventions also. The reasons why the normal iconography of the 10th century shows a Christ with four nails are different from the same feature in Velazquez’s Christ. (http://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Cristo crucificado.jpg/300px Cristo crucificado.jpg). In the first case the Christ is represented in is Majesty even when it was in the Cross. His hieratic attitude, that include his open arms, is the proper representation of the Power (also the power of the Emperor and his court). In the second case, Velazquez, is the result of Counter Reform. The crossed legs were considered as an indecent position, and a more static position was recommended by relevant religious authorities (Cardinal Bellarmino, for example). This implies four nails, obviously. In the middle, polemics about the number of nails were spread across Europe when the Cathar Crusade. I am not a “wise” man, but those things are common thoughts in History of Art..","date":"2014-11-18","mins":"2:52 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172011","author":"david_mo","post":"There is not “radical revolution”. The Crucifixion with trhee nails existed long before 1350. For example these pictures from the Britishh Library. One leaf from the Anglo Saxon Chronicle: the preface with West Saxon genealogy from Cerdic (494) to Alfred (899) England, S. E. (Winchester); 4th quarter of the 11th century Registrum Prioratus Ecclesiæ Christi Cantuariensis, including a Martyrology England, S. E. (Canterbury, Christ Church); 2nd half of the 13th century The artist of the Shroud continues a stylistic previous tendency that was growing before 1350. (13th century!). A small quest in the collections of the British Library, Enluminures, Joconde database, and similar shows it. I am sorry that you didn’t understand why I have spoken of Velázquez, for it is an explanation of this change of paradigm. Your English is not bad. Your ignorance about History of Art it is. Drawing conclusions about ten centuries of Art evolution with a handful of bad pictures with a random criterion is hilarious. It is worse than your kitchen science with JPG Es. The image of the Shroud is an example between others of a stylistic previous tendency in some respects, as the nails case. You have not any proof nor hint that the evolution of this tendency has been caused by the Shroud. This is wishful thinking..","date":"2014-11-19","mins":"3:47 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172177","author":"david_mo","post":"O.K.: “…the change from 4 nails to 3, and the fact that 90 % of portrayals show right foot above the left is irrelevant. This is just what the Shroud shows. And there are no other explanations for those”. 1.You cannot provide an “explanation” of all the particularities of the History. Chance or the limits of knowledge are important determinant in historical explanation. You are an ignorant in History if you don’t know this. 2.In absence of any explanation you cannot accept the first explanation that comes to your mind. Specially when we are spoken of particular in History. You are an ignorant in History if you don’t know this. 3.The priority of the right over the left. Right is the saint side of the things, left is the devilish side. (The artist of the Shroud probably didn’t think he was doing a replica by contact and changed the side of the bound and the hands. This is not his unique mistake from a naturalistic point of view. See the hair). 4. If we have a tendency toward an end (substitution of the 4 nails by 3) that begins in a point and grows toward another, you cannot say that the cause of the arrival to the end is in the half of the process. If you had done the simple quest I have suggested you would had understand that the change from 4 nails to 3 is progressive. You will find no crucifixions with three nails in the early centuries of Christianity. Scarcely one in the 11th century. Some in the 12th century. Many in the last half of the 13th century. And then there are few crucifixions with 4 nails in the 14th century. Etc. (I’m sorry for this childish explanation but I am not sure that you have understand what a progressive evolution signifies). But your intent of explanation of a particular fact by a point in the middle of a chain has an essential flaw. You cannot attribute a wide effect of change in history (of Art) to an unknown event. Some events as the exhibition of Veronica’s Veil had a big impact on the medieval imaginary, but we know a handful of depictions of this artefact that justify his popularity. Nothing of this in the Shroud’s case. The first wide depictions and representations of the Shroud were known in the 16th century. How this semi occult object could determine the History of Art is a mysterious thing. And you know that mysterious explanations need strong evidences. And you are not even the slightest hint. Nations need strong evidences. And you have not even the slightest hint..","date":"2014-11-20","mins":"3:12 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172183","author":"david_mo","post":"If you want an explanation of the change of styles from hieratic to dynamic, I suggest you a visit to the Principles of Art History of Wölfflin with particular attention to the tectonic/a tectonic opposition. The change from four to three nails is evolutionarlly explained by the same rules than explain the change of vertical horizontal compositions of the Crucifixions to the sinuous forms. That is to say, from the Romanesque art to the Gothic..","date":"2014-11-20","mins":"3:41 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172221","author":"david_mo","post":"O.K.: “As we are almost certain that the Shroud was in Constantinople at that time…” Yes. The theory of the wide influence of the Shroud over the medieval Art has the same degree of certainty than the confusion between the Mandylion (or de Clari) and the Shroud. This is to say, nil, zero, null. “And BTW, you contradicts yourself in your statements”. “By the way”, not, because the word “explanation” has a diverse sense in both cases I mentioned. 1.When a particular occurrence is a cause (or determinant condition) of another particular occurrence. This is the model of explanation in natural sciences. A determinate event a under determinate laws and circumstances determines the occurrence of b. 2.In History (of Art) a particular event is explained when it is coherent with a model or frame. In this case, other alternative were possible in the same circumstances. The model M (a style, for example) determines that a particular occurrence α is not compatible and tends to disappear. But M is compatible with a, b, or others. And so, the actual occurrence of a can be explained. All we can say in our issue is that the solution of the three nails was coherent with a change of composition typical of the pass from the Romanesque (tectonic) to the Gothic (a tectonic). The first was a solid composition based on predominance of vertical and horizontal lines, and the second with a sinuous composition. You can see in these instances from the Met.http://images.metmuseum.org/CRD Images/md/web large/DT120.jpg I have selected two images of the same technic and material, to avoid undesirable interferences. A most competent expert in History of Art than I am and another space of debate are needed to expound in detail these issues. But a best knowledge of Art and its History were needed, and you have neither the one nor the other..","date":"2014-11-20","mins":"9:19 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172224","author":"david_mo","post":"Or this http://www.photo.rmn.fr/Corex Doc/RMN/Media/TR4 MD5/c/b/0/a/01 011735.jpg …and this http://www.photo.rmn.fr/Corex Doc/RMN/Media/TR1/EA3 I0 G/10 509706.jpg …and these.…etc..","date":"2014-11-20","mins":"9:33 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172482","author":"david_mo","post":"O.K. “The only expalantion is the Shroud”. “Correlation does not imply causation.” Σὺ εἶπας Recommended Reading: http://www.princeton.edu/~achaney/tmve/wiki100k/docs/Correlation does not imply causation.html.","date":"2014-11-22","mins":"3:10 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172226","author":"david_mo","post":"By the way note that “explanation” was with quotation marks and note also the precision “not all”..","date":"2014-11-20","mins":"9:42 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172764","author":"david_mo","post":"Thomas: The works or Art of the period never or scarcely never are exact replicas of other images. They usually share a frame and occasionally are very similar to each other. But even in this case there are some differences. Originality is not forbidden into the general frame. We have not many images of Jesus’ back (two or three?), and none of them represents Jesus in the tomb. So is difficult to say what is typical and what is not. In any case, the trickles of blood in the back do not seem very realistic. The blood spills, when amassed in a point, tend to do irregular forms and not arabesques from left to right and vice versa. You can do a simple experiment: do a cut in your belly, let the blood run and put a finger in his way. You will tell me. You can do the same experience with a coloured liquid, if your love for science has its limits..","date":"2014-11-24","mins":"2:04 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172628","author":"david_mo","post":"Your questions are supported on an erroneous assumption: that the artist of the Shroud was intending to make a painting of a scene. He actually intended to represent the mark of a body on a cloth. We don’t know if he was inspiring himself in some similar works. If some similar shrouds have existed they are missing now. It is possible that his work was original or not. I cannot explain all the features of the Shroud, the same way as as a lot of particular features of many works in the History of Art. Can you explain why the artist chose to paint the trickles of blood in the nape if they are simply impossible? There is not a singular explanation for all singular features of any work of Art..","date":"2014-11-23","mins":"2:49 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172492","author":"david_mo","post":"Hugh: O.K. Is falling in a logical fallacy: “correlation proves causation, is a logical fallacy by which two events that occur together are claimed to have a cause and effect relationship. The fallacy is also known as cum hoc ergo propter hoc (Latin for “with this, therefore because of this”) and false cause.” (Princeton.edu) In Wikipedia you can find a useful abstract on this kind of fallacy: http://en.wikipedia.org/wiki/Correlation does not imply causation This fallacy is common to all the sindonists who claim to a causal relation from the Shroud to some artistic features when they observe a coincidence between both. Obviously, the Shroud is not the cause of the “dramatic” (¿?) change of the number of nails in the 14th century, that is the result of a previous evolution, as you have accurately pointed. The second fallacy is the hyperdeterminism. They don’t conceive that we have not an answer to every problem. So, if they find no answer they invent imaginative solutions. Ray Rogers informed on this fallacy. But some sindonists only read or retain what interest them..","date":"2014-11-22","mins":"5:50 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172626","author":"david_mo","post":"O.K.: Your fallacies about the number of nails (abstract): 1. There is not any “dramatic” change in the middle of the 14th Century. There is a gradual evolution between the 11th and the 15th Centuries. “Dramatic” is your invent. 2. The same causes produce the same effects. The causes of the process are the same, because the process is a regular one. 3. Non multiplicanda entia sine necessitate. If there are some causes that produce a process, you don’t need add new superfluous causes. 4. Simultaneity is not cause. The only fact we have is the concordance in time between de appearance of the Shroud at Lirey and a moment of the process of evolution from 4 to 3 nails. No auxiliary evidence can be added to this coincidence. No texts, no testimonies, no depictions, no images of the Shroud till the 16th century that justifies its popularity and impact on Art. 5. The cause must be proportional to the effect. An unknown artefact cannot be the cause of a wide effect in Art. Conclusion: It is much more likely that some features of the Shroud were the effect of an evolutionary process in the Art that the contrary. I don’t ask you to do his homework because Ii know you are not able. The game is over..","date":"2014-11-23","mins":"2:40 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-172892","author":"david_mo","post":"I think I have already answered to this. Some features of the Turin Shroud are common to the latest Gothic Art and the pre Rinascimento and are not realistic. But others are due to the non artistic function of the cloth. And others may be original. Both Charles and I are claiming for a study by specialists. I, at least, am not. I only am able to point to some similarities and differences..","date":"2014-11-25","mins":"2:40 am","url":"https://shroudstory.com/2014/11/16/a-scorch-is-a-scorch-of-course-of-course/","cat":"image_theory","title":"A scorch is a scorch, of course, of course,"},{"id":"comment-193841","author":"david_mo","post":"Personal translation: “It seems to me that, rather than talking about bad luck for the comparison between the laboratories for Turin, we should speak of good luck for the other three tissues, for the averages for each laboratory were very close to each other. A similar correlation was not the rule at the time, if you made comparisons between different laboratories for dating the same finding. The laboratories could be well pleased with the overall result. They could fear the worst”. ”. (Gian Marco Rinaldi: “La statistica della datazione della Sindone”, 2012, I.8. Personal translation). NOTE: “The worst” was differences of more than two hundred years. And about dispersion: “It can be seen that the dispersion of Turin is not the worst. Only one of the other three tissues, Nubia, has a smaller dispersion. The difference between the ends of Turin is the smallest.” (Ibid, I.11.) (http://sindone.weebly.com/uploads/1/2/2/0/1220953/nature statistica.pdf) A very conclusive article… in Italian, I am sorry..","date":"2015-03-20","mins":"3:05 am","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-193842","author":"david_mo","post":"See my last comment above, please..","date":"2015-03-20","mins":"3:08 am","url":"https://shroudstory.com/2015/03/17/a-shift-drift-in-colin-berrys-thinking/","cat":"image_theory","title":"A Shift-Drift in Colin Berry’s Thinking?"},{"id":"comment-198822","author":"david_mo","post":"Your obsessive anger against d’Arcis, Chevalier and Thurston leads you to some evident mistakes. Geoffroy II the Charny never said the Shroud was authentic, but a “representation”. Lady Marguerite was a thief, a swindler and a liar. She stole the Shroud to the collegiate of Lirey and promised to compensate the Lirey canons several times and never kept his word. She finished being excommunicate. I would not bet my last dime on what actually thought this woman. You prefer to invent a villain character to the poor d’Arcis and miss this real rascal in this story. Summary: you don’t know anything about the real feelings of d’Arcis, Geoffroy and Marguerite. You are making a kind of movie with good guys and bad guys. But the script of your film is very little historical..","date":"2015-05-11","mins":"1:59 am","url":"https://shroudstory.com/2015/05/09/colin-berry-has-it-all-figured-out-sort-of-maybe/","cat":"image_theory","title":"Colin Berry Has It All Figured Out, Sort Of, Maybe"},{"id":"comment-198900","author":"david_mo","post":"Here the facts we know. 1. D’Arcis’ memorandum contains certain statements which are consistent with other documents and some statements that do not have any confirmation. 2. It cannot be said if the unconfirmed claims whether they are false or true. We can not nor confirm nor deny them and it is absurd to discuss about them. 3. We know that at the time of the memorandum the exhibition of the shroud had been banned because we have the request of Geoffroy II and the papal bull that suspends the ban. 4. We know there were some claims that the shroud was a fake and had been painted. Because such a thing is clear from the letter from the king to his Bailly. See also Liège’s affair below. 5. We know that the pope does not considered true the shroud, since the last bull says it can not be displayed as such. 6. We do not know the private reasons of one and all. They are private. D’Arcis could act out of envy or honesty. The Pope could act out of conviction or political calculation. You don’t know anything about the personal opinion of Clement VII. You only know the personal opinions of the popes that expressed them. The public opinion is other thing. 7. Marguerite could act out of greed or because he believed he had a subjective right over the shroud. 8. But we know that Marguerite recognized that it had no right to retain the shroud because it promises to return the piece within a specified time and pay for the temporal possesion several times; 1418, 1443, 1447 and last 1458 (if I remember exactly). The latter was an attempt to lift the excommunication that hanged over her since 1457. She never paid anything nor returned the cloth, but she said to have transfered it to the House of Savoy. We have not any document of this cession. 9. We know that an episcopal commission met in Liège in 1449 because Marguerite exhibited the cloth as authentic and the bishop had doubts. 10. We know that the commission ruled that the cloth was painted. 11. We know that they could examine the papal bull. The report of the chronicler says that the papal bull stated that the cloth was not the true Shroud of Christ. This is what can be known and what we cannot state.After you can do interpretations or screenplays. The difference is that interpretations never pass the boundaries of what cannot be said with a high degree of possibility. In the screenplays the imagination is free and sometimes contrary to the facts..","date":"2015-05-12","mins":"1:50 am","url":"https://shroudstory.com/2015/05/09/colin-berry-has-it-all-figured-out-sort-of-maybe/","cat":"image_theory","title":"Colin Berry Has It All Figured Out, Sort Of, Maybe"},{"id":"comment-198990","author":"david_mo","post":"First of all: you present the facts wrong. “After the death of Geoffrey II, ownership of the Shroud rightfully passed to his daughter Margaret de Charney, not the Lirey canons. It might be thought presumptive of her husband Humbert to sign a document agreeing to return it. After his demise, she clearly asserted what she considered her rights of ownership”. Humbert de la Roche, Marguerite’s husband, represented her in 1418. What he signed was in her name and it commited her. Marguerite was directly sued by the canons of Lirey in 1443 (Dôle), 1447 (Besançon) and 1449 (Troyes). It don’t matter what were her claims but what the Court’s sentences were. She committed herself before the Courts to return the Shroud to canons of Lirey in three years and paid an economic compensation. She never kept her word. She was objectively a crook and a liar. Secondly: your interpretation is biased by your prejudices. You seem to think that all the people who affirm that the Shroud is a fake are immoral and malicious (Chevalier, Thurston, d’Arcis, etc.), and the people that think (according you) that the Shroud is authentic is well meaning and honest. “No imaginative screen play is required to interpret that intent, D’Arcis wanted it for his own cathedral! Despite the royal signature, it is quite likely the king never saw nor noticed it, but it was merely in a sheaf of routine papers for his signature.” You make a pure speculation. You don’t know if the idea to carry the shroud to Troyes was suggested by d’Arcis, the king’s counsellors or the same king. You don’t realize that the same thing can be speculated about the papal bulls in opposite direction. Maybe the king thought that carrying the false shroud to Troyes was the simplest way to avoid its exhibition. Maybe d’Arcis was honest in trying to avoid the exhibition, maybe not. These are useless speculations. Pure melodrama. “Despite all the assertions that the cloth was painted, we now know that the cloth was never painted, was never touched by any paint brush, nor ever near any artist’s palette, notwithstanding recent specious hypotheses”. “We know”? You think. I don’t know if the shroud was originally painted. I know that this was stated several times in the first years. This is not a definitive conclusion, but casts a shadow over the origins of the shroud. And the Freeman’ hypothesis could be incorrect but not “specious”. Your qualification is “specious” because unfounded and because, one time again, suggest a dishonest intention in the people that not think as you. Be careful with words, please..","date":"2015-05-13","mins":"2:48 am","url":"https://shroudstory.com/2015/05/09/colin-berry-has-it-all-figured-out-sort-of-maybe/","cat":"image_theory","title":"Colin Berry Has It All Figured Out, Sort Of, Maybe"},{"id":"comment-199406","author":"david_mo","post":"Thibault: Contemporary testimonies describe the roman flagrum as an awful weapon. Its blows tore the skin and the flesh till reaching the bones. Note that the image of the man of the shroud has more than a hundred of impacts and not a single tearing of the skin is visible. The “perfect” form of the little balls is similar to the “perfect” form of the trails of blood. Too “perfect” to be true. Furthermore, the image of an executioner carefully selecting his blows in order to do a regular design with the impacts separated from each other is not credible. There was no reason to do so. The marks are also placed in a too “perfect” distribution to be plausible. In addition, I refuse any credit to Zugibe’s theory of post washing marks. The blood of a corpse laying in an horizontal position flows in a lateral sense as the same Zugibe’s pictures show. But the marks of the man of the Shroud run from the forehead to the chin and from the wrists to the elbows. This is simply impossible in a laying corpse. This is the kind of things that go usually unnoticed to the sindonist experts. Then their theories become castles in the air. PS: “Forensic experts” perhaps, but not experts in history of Medicine. They are two different things..","date":"2015-05-18","mins":"1:34 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199927","author":"david_mo","post":"Reconstructionist Tahara Handbook for Women and Men, Adat Shalom Chevra Kadisha “If there is extensive blood flow that canot (sic) be stopped, the met is not washed. Dress it, put in the aron, and chant the concluding prayers. If the flow of blood is sligth, the wound or hole may be gently plugged with cotton or gauze. A cotton plug may be held in place with a band air or tape if absolutely necessary. Or Monsel Solution may be applied as a sealer. Avoid that particular area during physical washing (rechitsah) and tahara.” (p. 19) (NOTE: are we speaking of modern tahara?!). Carlos, can you explain the direction of the blood trails if the corpse was lying in a “horizontal position”? Your point “c”. See https://www.youtube.com/watch?t=227&v=S Nz Vc1 Mq J2s , 2:23ss and 2:34ss. Simply impossible. Spanish translation: Carlos, ¿puedes explicar la dirección de los regueros de sangre si el cadáver reposaba en “posición horizontal”? Tu punto “c”. Ver https://www.youtube.com/watch?t=227&v=S Nz Vc1 Mq J2s , 2:23ss and 2:34ss. Simplemente imposible..","date":"2015-05-23","mins":"2:21 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200025","author":"david_mo","post":"We are discussing about the inconsistency of Zugibe’s theory. Zugibe claims that the trails of blood were produced after (or during) the washing of the corpse. A vertical position is incompatible with the washing. And if you rub with ointments a trail of blood you can imagine what happens. But with myrrh or without it the things always fall downward and never upward. It is the gravity, you know..","date":"2015-05-24","mins":"1:02 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200052","author":"david_mo","post":"Maybe Joseph of Arimathea washed Jesus in a shower cabin. Etc., etc..","date":"2015-05-24","mins":"5:26 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200057","author":"david_mo","post":"Carlos, su respuesta es irrelevante desde el principio hasta el fin. Estamos discutiendo la tesis de que los regueros de sangre se produjeron durante o después del lavado (Zugibe). Es irrelevante distinguir entre “el cuerpo descansaba en posición horizontal” o “era manipulado en posición horizontal”. La clave para la dirección de la sangre, en la hipótesis de lavado, es la posición horizontal. Es irrelevante que la herida estuviera en la quinta región intercostal o en otra parte del costado. Es irrelevante que la sangre fuera obstaculizada por coágulos o no. Lo que importa es la dirección del flujo. Decir que un líquido cae hacia arriba es imposible en este planeta. Lamento que no se haya dado cuenta todavía. El trabajo de Garlaschelli y Borrini no hace más que poner en imágenes algo que ya era obvio. Yo había adelantado alguno de sus resultados en mi blog. Https://sombraenelsudario.wordpress.com/2012/12/29/sangre o pigmento ii reguerillos/#reguerillos , 29 diciembre 2012. No hacía falta ser muy inteligente (gracias por la suposición), sino evitar ofuscarse. Personal translation Carlos, your answer is irrelevant from the beginning to the end. We are discussing the thesis that the trails of blood occurred during or after washing (Zugibe). It is irrelevant to distinguish between “the body rested horizontally” or it “was manipulated horizontally”. The key for the direction of the blood, assuming washing, is the horizontal position. It is irrelevant whether the wound was in the fifth intercostal region or elsewhere in the side. It is irrelevant whether the blood was hampered by clots or not. What matters is the direction of flow. To say that a liquid falls upwards is impossible in this world at least. I regret that you have not noticed this yet. Garlaschelli and Borrini’s work merely puts in images something that was obvious. I had advanced some of their results in my blog. Https://sombraenelsudario.wordpress.com/2012/12/29/sangre o pigmento ii reguerillos/#reguerillos, December 29th, 2012. You don’t need to be very intelligent (thanks for the assumption), but to avoid getting obfuscated. PS: Carlos, si entiende bien el inglés me evitará tener que escribir dos veces. Gracias..","date":"2015-05-24","mins":"6:02 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200030","author":"david_mo","post":"I agree with this. This is what I have read on the subject. (Here, for example: https://groups.google.com/forum/#!topic/jewish funerals/d Q2 SJTI Ar A). And I remember my reserve because we are speaking or modern tahara. Then, Zugibe shows in the text I quoted a small trail of post mortem blood. It is not similar to the large trails of blood of the Shroud man. I don’t know if Zugibe is more specific in his book, but he is considerably vague on this point (and others) in the articles posted on line..","date":"2015-05-24","mins":"1:35 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-200028","author":"david_mo","post":"Daveb: “The picture of a scourged back posted by Max on May 19, 2:44 pm above, shows that it is possible for a person to survive a severe scourging. Note that this scourging shows a pattern systematically covering the entire back with very little overlap, not dissimilar to the Shroud image,and might be said to have been similarly “artistically applied”. Whatever instrument was used, it did not tear the flesh”. “Very little overlap”?? Are the scars of the man the same as the “subcutaneous” marks of the Shroud? Are we seeing the same picture? Max’s picture is a perfect example of shooting on his own feet..","date":"2015-05-24","mins":"1:17 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199490","author":"david_mo","post":"An intelligent person does not swallow everything an expert says, specially when it is contrary to what you are seeing with their own eyes or is folly. That’s typical of gullible people that confuse experts with Sibylline oracles. I tend to be respectful of experts: 1. When they are experts in in the field of their expertise. I am referring in our case to the experts in the history of medicine. 2. When there is unanimous or almost unanimous coincidence in what they say. 3. When they give understandable reasons that not contradict the obvious. 1. You quote doctors that are not really experts on our subject. They are forensic surgeons and not scholars of the history of medicine. Therefore, their claims are opinions. 2. The group of doctors that you quote is very restricted. Their reputation does not exceed the sindonist circles. (With a single exception: Zugibe quoted by Zias, but not about blood). Their experiences have not been repeated (specially Barbet) in scientific conditions. Therefore, the differences between them (cf. Hugh Farey’s commentary) have not been adequately proven. Their claims are opinions. 3. Experts sometimes made statements whose validity does not lie in the field of the technical work or particular knowledge. The blood does not fall horizontally. The truth of this statement does not depend on forensic science. The marks of the lashes are very unlike. This either. These points should be judged to the light of the reason that everyone has. And I’ve never seen the answer of your “experts” to my plain objections. Therefore, their claims are opinions. Some experts often hide their opinions under the guise of “science”. Reciting the “sura of experts” to silence criticism on the views of some questionable authority is the classic appeal of pseudoscience. Sapere audere..","date":"2015-05-19","mins":"1:21 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199493","author":"david_mo","post":"Against Zugibe: According him the trails of blood were produced when a wound is pressed. But it is unlikely that the people that were washing didn’t clean the blood produced by their own pressing. Thibault: I would like to know the Zugibe’s explanation to this. Blood doesn’t fall from the forehead to the chin or from the wrists to the elbows when the corpse is lying on his back (on this planet at least). I would like to know Zugibe’s explanation to this. Lashings: The Roman flagrum didn’t cause “subcutaneous” wounds. It was an awful instrument of torture. It broke the skin and the flesh and, as Freeman states, more than a hundred impacts would cause the death or leave the victim KO. A Roman executioner using such weapon of massive destruction to inflict a lot of gentle little impacts over all the body with all his careful attention in order to don’t cross never two of them is a children’s story. I beg your pardon!.","date":"2015-05-19","mins":"2:03 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199613","author":"david_mo","post":"That Daveb’s comment says nothing new. He continues with the story of the artist executioner. See the difference between the pictures posted by Hugh and Max. If you don’t see any difference the discussion is closed. I am not Jesus of Galilee. I cannot make the blind see..","date":"2015-05-20","mins":"1:14 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199747","author":"david_mo","post":"I have posted: “Against Zugibe: According him the trails of blood were produced when a wound is pressed. But it is unlikely that the people that were washing didn’t clean the blood produced by their own pressing. Thibault: I would like to know the Zugibe’s explanation to this“. Thibault: I would like your answer. Thank you..","date":"2015-05-21","mins":"1:15 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-199839","author":"david_mo","post":"Thibault: Dr. Zugibe observed that a corpse had bleed after the manipulation due to the autopsy and after a slight (“rinsed”) washing. (“The Man of the Shroud Was washed”, http://www.crucifixion shroud.com/Washed.htm ). One confusing point: It is not clear if the case is unique or it is a regular fact nor what kind of manipulation was needed. And why “rinsed”? Two possibilities and two objections: 1. The blood flowed during the washing. Objection: the people who was washing the corpse had cleaned it. 2. The blood flowed when the corpse was lying (“a few minutes after”). Objection: the direction of the blood trails on the shroud doesn’t correspond with a horizontal position. Has Dr. Zugive given any answer to these objections? Some clarification about the circumstances of the manipulation of the corpse?.","date":"2015-05-22","mins":"2:20 am","url":"https://shroudstory.com/2015/05/17/colin-berry-the-scourge-marks-are-frankly-not-credible/","cat":"image_theory","title":"Colin Berry:  The Scourge Marks are Frankly Not Credible"},{"id":"comment-99503","author":"david_mo","post":"« On le voidt clérement ensanglenté du trés précieux sang de Jhesus, nostre Rédempteur, comme se la chose avoit esté faicte aujourd´hui. On y voidt l´imprimure de tout son trés sainct corpz, teste, viaire, bouce, yeulx, nez, corps, mains, pieds et ses chinq playes ». (Antoine de Lalaing, Shroud Ostension by Philippe le Beau, Bourg en Bresse the April 14, 1503, Good Friday) Personal translation: “She looks clearly bloodstained with the most precious blood of Jesus, our Redeemer, AS IF THIS HAD HAPPENED TODAY. We can see printed all her divine body, head, face, mouth, eyes, nose, body, hands, feet and five wounds,” etc..","date":"2014-04-15","mins":"3:46 am","url":"https://shroudstory.com/2014/04/12/indifferent-to-gravity-jesus-hair-floomfs-out-and-falls-to-his-shoulders/","cat":"image_theory","title":"Indifferent to gravity, Jesus’ hair floomfs out and falls to his shoulders"},{"id":"comment-99504","author":"david_mo","post":"“…all HIS divine body…”. Sorry..","date":"2014-04-15","mins":"3:47 am","url":"https://shroudstory.com/2014/04/12/indifferent-to-gravity-jesus-hair-floomfs-out-and-falls-to-his-shoulders/","cat":"image_theory","title":"Indifferent to gravity, Jesus’ hair floomfs out and falls to his shoulders"},{"id":"comment-207942","author":"david_mo","post":"Dan: “Cloth to body assumption” is a dead end. There is not a position of the sheet that allows making the image according to the distance from the body. I challenge to show a consistent picture (not words) with any position..","date":"2015-08-11","mins":"2:53 am","url":"https://shroudstory.com/2015/08/10/it-is-really-really-time-to-rethink-what-we-think-about-3d/","cat":"image_theory","title":"It is really, really time to rethink what we think about 3D"},{"id":"comment-49991","author":"david_mo","post":"3 D theory is sustained on two hypotheses. 1. Radiation or vapour there was once an orthogonal (vertical) projection from body to image. 2. Different colour intensities are produced by distance between body and cloth. 5 cm is the standard distance at which the image disappears (sindonist say). “3 D information could not have been captured by some kind of radiation that is projected onto a sheet.” That’s what I think, for reasons given above. But the 3 D information could not have been caused by some kind of contact with the shroud, because large deformations would be visible. Then we have just an alternative: Or the Shroud was manufactured with a process we don’t exactly know (paint or heating or some degradation due to time) or we are in front a miracle. About miracles you can see what I think in my blog (if you read Spanish or you have a good translator on line): Here: http://sombraenelsudario.wordpress.com/2013/01/17/milagro/ , and here http://sombraenelsudario.wordpress.com/2013/09/03/que es un milagro/ and following entries. As Rogers I’m not favourable to recourse to miracles as explanations. If miracle is done everything is possible and “scientific” explanations are irrelevant. Sindonology would be irrelevant because in front to “Dieu le veult!” reason go out..","date":"2013-11-05","mins":"4:24 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49987","author":"david_mo","post":"I’m sorry but the 3 D theory is a soap bubble. You can see this without sophisticated equipment or complex mathematical calculations. 1. Let us suppose that the Shroud was supported by the body as Jumper, Jackson or Latendresse imagine. The fabric weight would make some parts, small or large, would adhere to the skin, producing zones of distance 0 and, therefore, intense coloration. In addition, the cloth should present some wrinkles well visible when it would be extended. This is so even in Latendresse’s forcibly reconstruction where the fabric is unnaturally stretched out. None of these things are visible in the image of the shroud. Or it is impossible the shorud was laying on the corpse or the 3 D theory is false. 2. Let us suppose that the Shroud was flat (an additional mysterious force is needed, but this is not the topic here). Some parts of the body would be farther than 5cm. From the fabric (calves and abdomen, for example) and would be invisible. Or the Shroud was not flat or the 3 D theory is impossible. Jumper and Jackson image here: https://lh6.googleusercontent.com/ Qvl8 Rzw4 Cjo/UP aik FI Jz I/AAAAAAAAB Ng/Unmqf S Dmd 4/s400/jacjumperret.jpg Letendresse: http://www.sindonology.org/papers/latendresse2005a.pdf , fig. 6. I’m not a « shroudie » or similar, but I advise to sindonists to abandon the three dimensional theory because it is logically untenable. It is a friendly advice..","date":"2013-11-05","mins":"3:27 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49989","author":"david_mo","post":"The 3 D reconstruction of the Shroud only proves two things: 1. The Shroud is not a photo. In photos the volume is obtained by light gradation. Photos usually are done with more than a single focus. This implies some kind of lateral shadow and chiaroscuro. The volume of the Shroud is represented by the colour intensity in terms of a closeness or distance to an imaginary plane. There are different concepts. Perhaps a good photographer could obtain a similar effect with a central focus and sieving light. Some painted images are lately done with similar results to the Shroud. Differences were due to the best or worse artistic skill of the painters. 2. Mr. Schumacher is a good scientist, I don’t doubt this. But to compare the Shroud with a Leonardo’s drawing, as I have seen he did in a documentary, is a great absurd. It is a monumental conceptual mistake. Maybe Mr. Schumacher is a good scientist, but not so good art historian..","date":"2013-11-05","mins":"3:58 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-49992","author":"david_mo","post":"I’m afraid I’m writing too fast and making a lot of spelling mistakes. I hope this may be understood and I will give a pause to myself..","date":"2013-11-05","mins":"4:28 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-50138","author":"david_mo","post":"O.K. I do not see how I could discredit the shroud or any other similar object. Neither Jehoash Tablet nor Tutankhamen mummy can be “discredited”. In any case you can discredit a theory about an object as the tablet authenticity or the mummy malediction are. I think I’ve refuted (not “discredited”) some theories about the shroud, but the shroud is for me a mysterious object worthy of study yet. The images you have put here have nothing to do with my criticism. I don’t see on them the wrinkles that are clearly visible in Latendresse’s and Jackson’s simulations. For example, the wrinkles between nose and chest in Latendresse’s photo. Neither the contact areas of the fabric that I pointed out are visible. Your diagrams are absolutely idealistic and not realistic simulations. They need ulterior explanation and correction but I suppose that the red oval is the head and the blue line is the shroud. I don’t know in what orientation. Both in the simulations of Jackson and Latendresse the head is laying on the ground. So the head and the cloth would be in full contact and a big area coloured must be appearing in the image. Obviously it doesn’t occur. Instead of stylized diagrams, the attempt should be made with a real head. So we would see clearly the deformations produced by stretching the fabric (see ulterior comment). They inevitably are produced when the fabric is not flat and then is stretched. So, just the image 1 is credible, vertical projection (i.e. Orthogonal) but with the shroud flat. But other problems will arise for this alternative that I have stated in my previous comment. If the distances required for the image was vanished are lower than 5 cm my objection is reinforced. I have read some Latendresse’s papers and I haven’t seen any explanation to my objections. I think he cannot do it. So, I think I have refuted his hypothesis..","date":"2013-11-06","mins":"3:48 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-50139","author":"david_mo","post":"About miracles: I’m humean in this: I will accept miracles only and only if an alternative explanation is more miraculous. This is not the case now. I again agree with Raymond Rogers: “We don’t know how” is not sufficient evidence for miracle claims. Only a feature of the Shroud is actually mysterious: superficiality of image. An interesting approach has been done by Luigi Garlaschelli, but he acknowledges that it is not definitive. (http://luigigarlaschelli.wix.com/luigigarlaschelli#!sindone /c1n58 ). I think that the unique way to solve this problem (if possible) is an interdisciplinary independent team working on the Shroud. Art historians, chemists, textile experts and scientific archaeologists between others must compound this team. Absolute independence for churches, sindonologists, anti sindonologists, sceptics and so on! A failure is not disposable. Finally, science cannot answer about all of everything and we don’t need claim miracles when this happens. About distortions of images: This http://www.pensar.org/images/shroudfig6.jpg or this http://sindone.weebly.com/uploads/1/2/2/0/1220953/8859260.jpg. This is what occurs when you stretched out a cloth that was wrapping a body. A bas relief is different. You can also take references on a body and reworking on the cloth with these references. This is Garlaschelli’s way. The Shroud is similar to a photo in that is a frontal view of a body. Yes. Similar three dimensional images can be done with frontal photos. You have done a good work Hugh. But I continue thinking that a professional photographer would obtain better performances with frontal light. And a good realistic painter, of course (as Andrea di Buonaiuto called “Da Firenze”, for instance). Colinsberry: My opinion about your hypothesis has little value for I’m not familiar with chemistry and physics. What you say seems to me hypothetically feasible. But… hypotheses are not evidences. Some additional historical involvements should be studied. For instance: you can obtain an image very similar to the Shroud by using opaque glasses… but it is uncertain that these big glasses could be made in the Middle Ages..","date":"2013-11-06","mins":"3:51 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-50143","author":"david_mo","post":"Here is my personal sindone. It is a memory drawing done in less than half an hour with pencil (HB) and fingers. It needs more blurring, but the paper did not allow it and drawing is too small (approx 9x6cm). With more blurring could be fine three dimensionality and superficiality. I’m not an artist. I drew comics when I was younger and I did this on my notebook in a moment of idleness , but a true artist could do wonders. Https://picasaweb.google.com/lh/photo/fg M5y Py7 S3 T Pm V89ntr S 9 M Tj NZET Ymy P Jy0liip Fm0?feat=directlink.","date":"2013-11-06","mins":"4:26 am","url":"https://shroudstory.com/2013/11/03/should-we-be-reassessing-the-vp-8-results-continues-previous-post/","cat":"image_theory","title":"Should we be reassessing the VP-8 results (Continues Previous Post)"},{"id":"comment-155649","author":"david_mo","post":"Mc Crone was wrong (or it seems to me). I think he imagined the Shroud image was painted with the faint aspect we now see. This hypothesis has some conflictive (chemical) implications that I am not qualified to discuss and seems contradictory with direct testimonies from the past. But there is an alternative hypothesis that obviates these problems. Garlaschelli has shown how some main features of the image can be explained by a degradation process of ancient pigments. See here a short report in English: https://sites.google.com/site/luigigarlaschelli/shroudreproduction. It is only a hypothesis as the same author says (time cannot be simulated in a laboratory, he said), but it is coherent and more explanatory that the direct painting hypothesis..","date":"2014-09-25","mins":"5:09 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-156458","author":"david_mo","post":"“In particular, the image is a pseudo negative, is fuzzy with half tones, resides on the topmost fibers of the cloth, has some 3 D embedded properties and does not fluoresce (…) We believe that our attempts represent – more than a reproduction – an interesting addition to the ongoing debate on the origin of this maybe not so impossible image.”. (Luigi Garlaschelli) “Translucent volumetric structural colour? Garlaschelli’s experiment only shows that an image like the Shroud of Turin can be produced by a degradation of pigments. Proofs and refutations of the painting hypothesis based on the current aspect of the image are misguided. I agree with Hugh on this point: A survey by a team of conservative textile experts (and scientific archaeologists, I add) is needed. This is a big hole in the studies on the Shroud..","date":"2014-09-26","mins":"3:04 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-156459","author":"david_mo","post":"“Conservator”, not “conservative”, of course..","date":"2014-09-26","mins":"3:08 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-156953","author":"david_mo","post":"“The initiated’ eye” is very inconstant. There is not a clear consensus on what are the main features of the Shroud. From seven to a hundred. For the most part they are very debatable. It seems as you are speaking of some of them..","date":"2014-09-26","mins":"12:13 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157694","author":"david_mo","post":"I’m sorry but I’m not a fetishist of the peer review. Furthermore, your question is out of place. The features you marked are not in other sindonists lists that don’t matched between them neither. This implies that they are debatable questions. PS: Do you think everything is published in a “peer reviewed” journal is not debatable? Really?.","date":"2014-09-29","mins":"10:55 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157469","author":"david_mo","post":"If the qualities you propose were not debatable ,they would appear in the list of 12 proposed by Manuel Carreira or the 7essential features consensuated in the Congress in Valencia. If not, it is because they are debatable even within the sindonist field itself. Others have been discussed by no sindonist authors. They are debatable..","date":"2014-09-28","mins":"10:52 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157696","author":"david_mo","post":"My last comment has to be placed here. Sorry.","date":"2014-09-29","mins":"10:57 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157892","author":"david_mo","post":"Of course, You can see an extensive bibliography (peer reviewed or not) in my blog. Click on my avatar, if you like. I recommend you the works of Italian authors: Nicolotti, Rinaldi, Lombatti and others. Unfortunately they are not always in English and you the English speaking are not very gifted for foreign languages. Joe Nickell’s “Inquest on the Shroud of Turin” is a bit old, but on many issues is indispensable. Have you read it?.","date":"2014-09-30","mins":"3:35 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157894","author":"david_mo","post":"Max Patrick: Be more carefull when quoting me, please. I haven’t said this: “So you just cannot refer me/us to any peer reviewed paper NEGATING the very reality of the TS body image/imprint relative tranlucency and straw yellow colour, the ventral & dorsal views of a full length body image/imprint and the haematic quality of the TS body & blood image/imprint.”.","date":"2014-09-30","mins":"3:44 am","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-11433","author":"david_mo","post":"A scientific consensus occurs when experts in a subject agree. There is no scientific consensus when lawyers and geologists express their opinion about genetics. In Valencia there was no scientific consensus..","date":"2012-05-19","mins":"2:09 am","url":"https://shroudstory.com/2012/05/18/the-challenge-and-then-there-were-five/","cat":"image_theory","title":"The Challenge: And then there were five"},{"id":"comment-159164","author":"david_mo","post":"It is impossible to understand how a picture has been done without an enquiry carried out by a team of specialists. A team of specialists cannot work without direct and unrestrained access to the picture. Chemists, physicists and similar are not experts in textile conservationism or scientific study of works of art, even though they had read a dozen of books about the subject. This is valid for the Gioconda, Las Meninas or the Shroud of Turin (if ever it was painted or similar)..","date":"2014-10-04","mins":"4:33 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"},{"id":"comment-159262","author":"david_mo","post":"I know your stance and I agree. I think many sindonists have an exceedingly broad insight on what an expert is. I have discussed this point in my blog in several entries..","date":"2014-10-04","mins":"12:10 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"},{"id":"comment-183982","author":"david_mo","post":"Carlos, por favor: “Clothes” no significa vendas. “Clothes”, según el diccionario de Oxford es un tejido que sirve para cubrir el cuerpo (“Items worn to cover the body”), usualmente un vestido o prenda de vestir. Charles ha usado ese término como “grave clothes”, literalmente “vestiduras funerarias”, o sea mortaja (Word Reference). En todo caso, no he encontrado ningún diccionario, y he consultado varios, que diga que “clothes” significa vendas. ¿De dónde te lo has sacado? Antes de ponerse irónico hay que saber de lo que se está hablando. Translation I beg your pardon, Carlos: “Clothes” does not mean bandages. “Clothes,” according to the Oxford Dictionary is a fabric used to cover the body (“Items worn to cover the body”), usually a dress or garment. Charles used the term as “grave clothes”, literally “funeral garments” or shroud (Word Reference). In any case, I have not found any dictionary, and I have consulted several, that says that “clothes” means bandages. Where did you get it? Google Translator? Before putting ironic you must know what is being said..","date":"2015-01-17","mins":"4:12 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-184217","author":"david_mo","post":"Carlos: It is absurd that you prefer the translation of Google Translator to the rest of English Dictionaries, including the Oxford dictionary. Everybody knows the limitations of Google Translator… except you. But you got into a discussion about what is the correct translation of ὀθόνια (othonia) in John’s gospel and this is more absurd yet. This is not the issue! Your “sarcastic” comment was started by your incorrect translation of Charles’ expression “grave clothes” to Spanish. Charles meant by that “mortaja” in Spanish (Word Referece), that is to say the cloth in form of a sheet or an altar cloth which was used in the medieval ceremonies of the Quem Queritis..","date":"2015-01-18","mins":"3:23 am","url":"https://shroudstory.com/2015/01/15/there-is-another-reason-charles-freeman-is-wrong/","cat":"image_theory","title":"There is another reason Charles Freeman is wrong"},{"id":"comment-195050","author":"david_mo","post":"Mr. Marino: “If a scientist can find no other way to form a Shroud like image other than with lasers, he may not be proving that the Shroud was made by lasers, but it could indicate that something out of the ordinary might have happened with the Shroud, something perhaps even beyond the understanding of science, possibly short term, possibly long term”. There are a lot of things in the universe that “a scientist” cannot replicate. Sometimes, it depends of the nature of things. It is easier to find an inexplicable thing in the ancient History that in modern days in Massachusetts. This depends on our knowledge of the circumstances that, obviously, are usually better of the U.S.A. Than of a medieval country. Other times the problem arises because the object is difficult to study. For example if it is a missing object, if it is located in an inaccessible emplacement or if its owner doesn’t allow a normal examination of it. These are the circumstances that surround the studies of the Turin Shroud. It is not certainly extraordinary that the object had remained inexplicable (on some features, not others) in these circumstances. When an interdisciplinary and independent team had inspected the cloth properly we could say if it is inexplicable or not. At the moment we can only say two things: the fabric is medieval and the image is not the imprint of a human body. At 99% if you want. The other 1% is for miracles..","date":"2015-04-01","mins":"3:02 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-195155","author":"david_mo","post":"Daveb: “I had not been aware that David Mo had qualifications in forensic pathology enabling him to rebut without stating his reasons…” I had not been aware that Daveb had qualifications in forensic pathology enabling him etc. I have to do some precisions: First of all, I have stated several times my reasons here, in this forum. Secondly, my reasons are not based on forensic pathology, but on a simple examination of the image. This enable me to assert that the images of the blood (in the back of the neck particularly) are not “natural”, that the hair position is not natural, etc. Thirdly: This is not the main issue of my comment. Senhor Frias de Moreira; “I’m a person with scientific background not a kind of gullible fanatic religious guy “. These are not mutually incompatible conditions, but I don’t remember I had called you neither the one nor the other. I have nothing to comment about your beliefs. But if you think you can present an evidence of a miracle (the Shroud miracle in this occasion) I’ll be glad to know how you are able to do so, because if your reasons are as feeble as Marino’s are, they do not impress me at all. NOTE: I feel very generous to give you a 1% of chance. You see, I am neither a gullible fanatic sceptic..","date":"2015-04-02","mins":"1:59 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-195156","author":"david_mo","post":"Hugh: “I believe David Mo was rather more dogmatic than I would be in declaring a 99% certainty that the Shroud is medieval”. The lack of sense of irony is perhaps the most remarkable sindonists’ flaw, and this is an irony. Here you have disappointed me, Hugh. Now seriously: I cannot quantify the certainty but I concede a very low probability to the authenticism. And it will be lower yet if we speak of miracles..","date":"2015-04-02","mins":"2:20 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-195229","author":"david_mo","post":"Louis: I really appreciated your efforts to write in Portuguese, but I am not a native to this wonderful country. Mas eu realmente amo Portugal. . I think you are confusing me with other person, because I haven’t made any “personal attack”. On the contrary, I have received some. I prefer to answer to them with an irony than become angry. It is better for my health. I don’t see how I could avoid the religion in a forum about the shroud of Jesus of Galilee. The Shroud is a religious object. Cf. Prof. Fanti or Dr, Barbet, for example. Neither I see how it is possible to avoid speaking of miracles with people which are continuously mentioning miracles or saying that the shroud is scientifically “unaccountable”. (Many important sindonists have often claimed for miracle. J. Jackson or G. Lavoie, for example). That’s why I’m afraid you are in a mistake about my very person and on what this forum is about. (This is another irony, but not an aggressive one. Rather a friendly one, you see)..","date":"2015-04-03","mins":"1:53 am","url":"https://shroudstory.com/2015/03/31/whats-to-like-over-on-colins-blog-right-now/","cat":"image_theory","title":"What’s to like over on Colin’s blog right now?"},{"id":"comment-170780","author":"david_mo","post":"All your bibliography is this paragraph from Wiki? I think I have to find another teacher..","date":"2014-11-12","mins":"5:23 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170757","author":"david_mo","post":"I don’t think the OK’s paper is speaking of directionality of the light, because this is a problem that has nothing to do with FTIR (this is what i know in study of fakes of art) or FTT (I don’t know). This is simple question of modelage, that is to say volumetric modelling. And yes, you can see some works of art of the period with frontal illumination. See some details of the chapel of Spagnoli by Andrea da Firenze; http://www.fineart china.com/upload1/file admin/images/ANDREA%20 DA%20 FIRENZE4.jpg Remember, please: The Shroud is not intended to be a portrait, but a mark..","date":"2014-11-12","mins":"3:48 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170752","author":"david_mo","post":"Your challenge is misguided. Almost all of the “sceptics” think that the Shroud is not a painting..","date":"2014-11-12","mins":"3:02 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170802","author":"david_mo","post":"My request was simple: Academic bibliography about the use of the FTT in the field of History of Art. Not about other “similar” or dissimilar luminic technics. This is not the case: http://www.lumiere technology.com/Pages/Services/services3.htm It seems you have not. But I can waiting that you find it. I’m patient..","date":"2014-11-12","mins":"6:51 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170981","author":"david_mo","post":"What a pity. The title of the chapter is too generic and I am not willing to spend 19$. If this is all the books or articles you know about the subject is as poor as the rest of your article..","date":"2014-11-13","mins":"2:19 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170985","author":"david_mo","post":"Transform (DWT) or Fourier transform infrared spectroscopy (FTIR), both used in the detection of forgeries or analysis of components in works of art. It seems not exist bibliography about the FTT applied to art or O.K ignores it. This is not the main problem with the short article of OK. The technics of analysis of image (with the Fourier Transform algorithm or others) seem useful in artistic enquiry, but they must be practised by specialist people and on correct materials. The material of FFT seems to be photographs. I suppose that Marion and Courage worked on high definition microphotographs. But comparing this kind of photographs with others extracted from a magazine is useless. O.K. Is comparing too very different kind of things and the results cannot be homogenous. A serious work would take high definition microphotographs of the different replicas of the Shroud (Garlaschelli, Broch, Pesce,Craig and Breese, etc.) and would match them with similar others from the Shroud. But this it would be a serious work and not an amateur one with photoshop. I understand even less why he analyses the common pictures of a coin scratched with a pencil. He seems to think that there is somebody who thinks that the shroud was made with pencil and a coin. Astonishing..","date":"2014-11-13","mins":"3:33 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171051","author":"david_mo","post":"None of these works speaks about FFT. Only one says hat the Fourier transform is useful for detect brush strokes ( by a student; not publshed). This is explicitely refuted in the others. Etc., etc. Your list is as useless as your work. If I have time I will put here some very interesting extracts. Are you joking?.","date":"2014-11-13","mins":"10:39 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170986","author":"david_mo","post":"Sorry. The beginning of my comment was missing: Hugh: I have been looking for some references to the FTT applied to the forgery in arts and I don’t find anything. This is a very different situation for Discrete Wavelet.","date":"2014-11-13","mins":"3:36 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171053","author":"david_mo","post":"And you?.","date":"2014-11-13","mins":"11:01 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-171163","author":"david_mo","post":"No much, but surely more than you, because you make alleged supportive references that actually are refutations of your presentation (?). For example: “The validity of this assumption depends on the kind of painting in question; paintings in the e.g. Photorealism style [16] do not have visible brushstrokes”. (p. 2) “The Fourier transform has been around for a long time and is well suited for variety of signal processing tasks, but capturing the local information of brushstrokes seems to be outside of its reach”. (p. 4) C. Robert Jacobsen: “Digital Painting Analysis” In reality the works you referred use other technics than Fourier transform, as is explained here: “In early days of image processing the Fourier transform was often used to decompose images into signals. In more recent years wavelets and transforms using wavelets have become more popular, as they can provide all the features of a Fourier transform, but also provide localised time information, as well as localised frequency information”. (p. 4?) Alexander David Brown: “Digital Analysis of Paintings”. Furthermore, all of them use more sophisticated devices than a simple scanner and photoshop, including infrared rays: “Our data set consisted of fifteen details of Goswin van der Weyden paintings, with the corresponding infrared reectograms of their underdrawings, as shown in Figures 7.1 through 7.15. The underdrawings were uncovered using infrared reectography technology.” (Josephine Wolff: “Wavelet Analysis of Paintings by Goswin van der Weyden and Paul Gauguin”). The most interesting is “The Eye of the Painter: Deciphering Art Mathematically”. This article shows the limits of the mathematical methods in identifying works of art. It says about the theme of the brush strokes and directionality specifically: “To further prove the usefulness of the wavelet technique in identifying the originality of paintings it was decided to set up a new validation experiment that would be monitored entirely,without intermediaries and without any additional technical complexities. Charlotte Caspers would make seven pairs of paintings using different canvases, brushes and even styles. In eachpair there would be one original (always a still life) and one copy, made afterwards. Both would be painted by Caspers, yet, remarkably, it took her half more time to make the copy than to make the original painting. It turned out that where Caspers used soft brushes, no positive conclusions could be drawn”. (Bold letters are mine). That is to say. Unlike your amateur job: The works that you referred used more complex methods, related to infrared rays, wavelets transform (Discrete or Complex), high resolution microphotographs, etc. Some limitations to these methods, specially in the detection of brush strokes, are detected. Brush strokes, as Charles pointed in other commentary, aren’t detectable when the paint is fluid (tempera, watercolour or diluted oil) or when a soft tool (brush, pad ink or similar) is used. This is why your “presentation”, and those you recommended, are useless for the item we are discussing. But the practice of recommending some texts that one has not read as supportive referenes is worse and it is often easily detected. Or perhaps you have read them but you have not understood their negative implications. I don’t know what problem you have, so I will refrain from more comments..","date":"2014-11-14","mins":"2:52 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-170747","author":"david_mo","post":"I’m sorry but this work is useless. A lot of relevant data are missing; it is applied on photographs of dubious quality and not on the originals and it forget that the current theories about painting in the Shroud don’t defend a traditional painting, but the rests of a painting not made with the traditional brushes (fingers, ink pads or similar). Furthermore, the bibliography is practically nil. I would like to know other studies about directionality and Fourier method (FFT) in the field of History of Art. For example: in the debate about the autenticity of “la Bella Principessa” (see here: http://www.theguardian.com/artanddesign/2011/sep/27/lost leonardo da vinci portrait# ) there was much talk about the directionality of the brush strokes but I don’t remember nothing about the FFT..","date":"2014-11-12","mins":"2:33 am","url":"https://shroudstory.com/2014/11/11/why-the-images-and-bloodstains-were-not-painted-on/","cat":"guest_posting","title":"Why the images and bloodstains were not painted on"},{"id":"comment-47980","author":"david_mo","post":"There is an alternative explanation: The artist would not make a portrait of Christ, but the imprint of a body on the canvas. The faces of Veronica circulating in the fourteenth Century were only painted portraits. Here the artist was more original. But he could not paint a real trace of a body in a cloth because the image would be distorted like this:http://sindone.weebly.com/uploads/1/2/2/0/1220953/8859260.jpg. Then he imagines invert the tones of a portrait in which the volume does not depend on the stray light, but making with darker shades the parts closest to the fabric and making clearer the farthest ones. Note that the same idea would be used in the Jumper and Jackson interpretation, obviously with another different conclusion. I have performed the same experiment taking a Renaissance portrait and it has turned this: http://imageshack.us/photo/my images/21/bonaiuti3ampliadocopia.jpg/. And Craig did this drawing directly with the same idea: https://lh4.googleusercontent.com/ o9 HJXZWP5 RQ/U Op81 Di1 Zb I/AAAAAAAAB Mo/qp Soqk F Qyg I/s407/craig%20shroud.jpg. Not bad. What is nonsense is to compare the image of the Shroud with a Baroque portrait (Rembrandt) that models the volume with stray and hard contrasted light. Or more nonsense: I’ve seen in a movie Mr. Schumacher comparing the image of the Shroud with a Leonardo’s (three quarters view!) ink drawing. These are absolutely different pictorial techniques and concepts!.","date":"2013-10-19","mins":"3:23 am","url":"https://shroudstory.com/2013/10/18/how-do-we-know-no-directionality-of-light/","cat":"uncategorized","title":"How do we know? No directionality of light."}]
