[{"id":"comment-165614","author":"david_mo","post":"Hugh: I know. To speculate is free. But I am able to do some speculations based on objective data. Data: The Pope Clement VII was relative of Geoffroi II de Charny (nephew of the second husband of Geoffroi mother’s). Speculation: Perhaps his interdiction to d’Arcis was an attempt to silence an irritating complainant which, with or without reason, was disturbing a lucrative business of a relative. Don’t forget that d’Arcis was supported by the king Charles VI. Don’t forget that the moderate last papal bull had allowed Geoffroi II de Charny continue with the lucrative ostensions of the “figure and representation” of the Shroud. I think my speculation fits better with the papal modus operandi in this period,and introduces less unverifiable and complicated hypothesis. Though is also a speculation..","date":"2014-10-26","mins":"4:57 am","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"id":"comment-165410","author":"david_mo","post":"Hugh et allia: You are making novels in Da Vinci’s Codex style. We don’t know the true motives of the main characters of the story. They could be political, theological or sincere. We only know the facts: D’Arcis: A complaint for fraud: the monks show a sheet as the true Shroud. It is a fraud. First papal bull: To avoid the fraud (the painted shroud), he imposes to the monks some conditions: to utter aloud that the Shroud is not the true Shroud but a representation, etc. Some corrections are done by Jean de Naples. He erased some expressions (specially the “painted”) but he maintains the main corpus and the structure of the writing: avoid the fraud and pronounce the warning; all this with the same words that the first redaction. The first rule of interpretation: without any evidence adverse, you ought to accept the main sense of a word or text. The main sense of fraus, fraudis is guile, fraud or deceit. So, the fraud or guile which is mentioned in D’Arcis’ memorandum and the different versions of papal bulls (all in the same terms) is to present the Shroud as the true Shroud of Our Lord. The Pope explicitly disavows this. The Liege’s episode (1449) confirms the straightforward interpretation: the inauthenticity of the Shroud was presupposed in the papal bull. This is what the commission created by the bishop concludes on the basis of a direct exam and the checking of the papal bull in power of Marguerite de Charny. Of course, this is not an evidence of the Shroud is false. But the determination of some sindonists to speculate about unfounded interpretations of the last version of papal bull, and the aggressive terms usually uttered are hints of something. The papal bull disturbs them..","date":"2014-10-25","mins":"6:22 am","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"id":"comment-40094","author":"david_mo","post":"Carlos: Professor López Amo makes the same mistake than Diane Fulbright (and similar to Mr. Tyrer also): techniques to weave wool are not techniques to weave linen. Théo Jean Flamme, former expert at the Institut de Recherche Scientifique Belge pour l’Industrie et l’Agriculture, maintains that this type of tissue of about 1000 threads per box and about 230g per m needs a loom of four pedals. Is the kind of tissue that complicates its weaving. But it is easy to him, Mistress Fulbright o Mr. Tyrer: let them show us a cloth with the same features (size, linen, 3:1, Z, etc.) of the first Century in Mediterranean Area. They have failed hitherto. I will read attentively the paper of López Amo. But it seems to me not good: just at first glance and I have seen some big mistakes (pollens and Mr. Kuznetsov, for example). PS: I’m glad you are in form. Translation without Google. Carlos: El profesor López Amo comete el mismo error que Diane Fulbright (y similar al del Sr. Tyrer, también): las técnicas para tejer lana no son las de tejer lino. Jean Théo Flamme, antiguo experto del Institut Belge de Recherche Scientifique pour l’Industrie et l’Agriculture, mantiene que este tipo de tejido de unos 1000 hilos por cuadro y de unos 230g por m. Necesita un telar de cuatro pedales. Es la clase de tejido la que complica el tejido, no su tamaño. Pero tanto López Amo, como la Sra. Fulbright o el Sr. Tyrer, tienen la demostración fácil: que nos muestren un tejido con las mismas características (tamaño, lino, 3:1, Z, etc.) del siglo I y en el área Mediterránea. Hasta ahora han fallado. Leeré atentamente el artículo de López Amo. Pero a primera vista no me parece muy bueno. He encontrado algunos errores de bulto (pólenes y Mr. Kuznetsov, por ejemplo). PS: Me alegra que sigas en forma..","date":"2013-07-30","mins":"2:21 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-39999","author":"david_mo","post":"Ron : It is more probable the Shroud was woven in Syria, but does not eliminate the possibility of it being woven in Judea by Syrian artisan’s. . R If the Shroud was made with a loom of four pedals in Middle East and Nort Africa it can’t be previous to 4th or 6th Centurie when the Silk Road was open. For Europe the date is ulterior. I think Chinese or Indian alternatives are too exotic..","date":"2013-07-29","mins":"1:15 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-40001","author":"david_mo","post":"“”Middle East OR NORTH Africa”, of course..","date":"2013-07-29","mins":"1:30 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-199284","author":"david_mo","post":"Yes, religion is in decline around the world, except a few countries (Spain is not between them, Kim). However, religion continues to be dominant in a lot of countries. That said, to believe or not to believe is not the problem to me. The problem is when believers support his religion with insults and irrationality (not to mention physical or legal aggression). I don’t know any survey that has studied the question from this outlook. Some people think that by expressing their holy anger they work or show that they are working for their cause. In some circumstances they can terrorize, but never convince their opponents. But since we are in a forum, which is a place where terrorizing is impossible, they should consider that their insults have no effect, except to disgust the sensible people. Perhaps Hugh is more sensitive to verbal aggressions in this forum because his beliefs are nearer to the aggressors than mine. Such a thing as “troll”, “delusional ranting” , etc., leaves me cold or makes me a bit of laugh. But they aid me to know when discussing with someone is useful or not. To discuss with an intolerant or an exalted one (“energumen”?) is a loss of time..","date":"2015-05-16","mins":"12:37 pm","url":"https://shroudstory.com/2015/05/16/christianity-in-sharp-decline-in-the-u-s/","cat":"news_&_views","title":"Christianity in Sharp Decline in the U.S."},{"id":"comment-192073","author":"david_mo","post":"I find this letter very hesitant and scarcely conclusive. (As the whole issue of cotton). Raes doesn’t explain here some crucial points: The reasons of his change of opinion about the presence of cotton in the sample of the main body of the Shroud. The nature of the doubtful experiment proposed by him to Vial. Furthermore, the conclusions are presented in a hesitant form: “We must therefore be very careful”, “in my opinion”, “if it should be possible in practice”… PS: Is there any way to consult Raes’ writings directly?.","date":"2015-03-01","mins":"2:59 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192107","author":"david_mo","post":"Thibault: For example: “The cotton is important. Cotton was almost unknown in Europe until about AD 1350”. (“SCIENTIFIC METHOD APPLIED TO THE SHROUD OF TURIN. A REVIEW” by Raymond N. Rogers and Anna Arnoldi, p. 13)..","date":"2015-03-01","mins":"11:45 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192074","author":"david_mo","post":"The inconclusive conclusions –you will forgive the oxymoron , about the presence of cotton are due in good part to the fact that the studies had been carried by not experts on textile and its history. Marino, Benford, Rogers, Heimburger and Villarreal are not experts on this subject. (I hope you will not take offence of it, but you will have to agree with me on this point). So, the conclusions are disparate and often contradictory. And big errors are sometimes done (Rogers, for example). “Amateurism” is one of the big problems of sindonism..","date":"2015-03-01","mins":"3:17 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192149","author":"david_mo","post":"“It was only when I decided to “dissect” meticulously the thread and to separate the fibers that I could see many cotton fibers (10 20% of the fibers). You can’t imagine how difficult it was! I spent several hours (repeat: hours !) to do that, with two ultra thin needles”. Very interesting. Did you, Rogers or Raes the same meticulous work on the other samples? Including the fibres from the main body of the Shroud, of course. How many samples were worked with your meticulous system of work?.","date":"2015-03-02","mins":"2:06 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192471","author":"david_mo","post":"Conclusions: 1.We have not any precise description of the method and the conclusions of the findings of Rogers on threads of cotton. “Easy to find”, “too little”, etc. Are not conclusive and are scarcely scientific concepts. 2.Rogers and you are in contradiction. Rogers: “Cotton fibers are easy to find”. You: nothing in a first view, only after a meticulous exam. 3.We cannot conclude anything definite, except that you found some cotton mixed with the linen in your sample in a proportion (“perhaps”) of 15%. And Rogers “too little” cotton. With different methods, “perhaps”. (This is what I called “amateurism”). PS: How do you know you were working with a sample for Raes1 and not Raes2? You wrote: “It is likely that all of them were from Piece 1 of the Raes sample”. Why “likely”? Are you not sure? Excuse me, but I am very interested in this point and I would appreciate a precise answer. PS: Who were the experts that tested your work? Were they experts in ancient textile? I have read that to differentiate ancient cotton from linen is not so easy. The appearance of the fibers can change a lot depending of age and place. You have not presented a bibliography on this subject in your works or I don’t be aware of it. I will be glad if you can orient me on this point..","date":"2015-03-05","mins":"5:32 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192597","author":"david_mo","post":"I never denied that I am an amateur. The Shroud is not my job and I am careful: I don’t write anything out of my speciality. Anyway, my “charabia” was almost a literal copy of your own words. I had done a question that you didn’t answer: How do you know you were working with a sample of Raes1 and not Raes 2? You wrote: “It is likely that all of them were from Piece 1 of the Raes sample”. Why “likely”? Are you not sure? Another point: The curriculum of Jana Jones in Egyptian textiles is long. But the precision remains not clear on a point: “Old World” is an ambiguous word both historical and geographical. It includes the Euro Asian area in the Antiquity and the Middle Ages. Did you ask her for more precision? PS: Don’t be angry, please. I had read your article some time ago but I don’t remember all I read. I remembered the expression “Old Word” but I had forgotten that it were in your article..","date":"2015-03-06","mins":"3:05 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-192687","author":"david_mo","post":"Essay? Four points in my score. Seriously, I regret your withdrawal. I was interested in your answers..","date":"2015-03-07","mins":"3:48 am","url":"https://shroudstory.com/2015/02/26/cognitive-response-to-thermochimica-acta-paper/","cat":"news_&_views","title":"Cognitive Response to Thermochimica Acta Paper"},{"id":"comment-97018","author":"david_mo","post":"Sorry Hugh. I don’t find the Garlaschelli’s presentation in the link you provide. Can you be more exact in the quote? Thank you..","date":"2014-04-06","mins":"3:20 am","url":"https://shroudstory.com/2014/04/03/more-on-the-y-crucifixion-with-pictures/","cat":"news_&_views","title":"More on the “Y” Crucifixion with Pictures"},{"id":"comment-97026","author":"david_mo","post":"Don’t worry. I found it..","date":"2014-04-06","mins":"3:58 am","url":"https://shroudstory.com/2014/04/03/more-on-the-y-crucifixion-with-pictures/","cat":"news_&_views","title":"More on the “Y” Crucifixion with Pictures"},{"id":"comment-28248","author":"david_mo","post":"“It suggests that at least some of the appeal of physicalism has nothing to do with scientific evidence but rather with a general sense of antipathy toward religion.” It suggests that Mr. Bulkeley has an antipathy toward physicalism and that he doesn’t know well what physicalism is and what criticism means. Because… One: Physicalism isn’t a scientific theory. It is a philosophical theory. (They actually are several different theories). So it can’t be based on “scientific evidence”. Intuition, coherence, praxis, probability or another else are good or bad arguments about physicalism, not “scientific evidence”. Two: Adam Zeman suspects that some sense of religion is the cause of the attacks against physicalism. He believes religion is wrong at this point, i.e., metaphysics physical relations or translations to physical concepts from mental ones. You can say that someone is wrong while you love this person. So I think Mr. Bulkeley is wrong in supposing that disagree implies some form of antipathy. I have no kind of antipathy for Mr. Bulkeley. Three: I have an intuition. I think Mr. Bulkeley is wrong because he has a strong religious feeling or similar. He erroneously believes that when someone criticizes his beliefs is attacking his person. I think a more even tempered insight would allow him a more correct assessment of the situation. The situation is Mr. Zeman thinks that religious dualism is a strong influence against philosophical physicalism. It seems to me a credible explanation. There are others to consider. It is all..","date":"2013-03-24","mins":"3:13 am","url":"https://shroudstory.com/2013/03/22/of-hunches-and-intuition-neuroscience-and-the-shroud-of-turin/","cat":"news_&_views","title":"Of Hunches and Intuition:  Neuroscience and the Shroud of Turin"},{"id":"comment-18751","author":"david_mo","post":"My solidarity. I hope everything will solved in the best way possible..","date":"2012-11-03","mins":"2:52 am","url":"https://shroudstory.com/2012/11/01/sandys-effect-on-this-blog/","cat":"off_topic","title":"Sandy’s Effect on this blog"},{"id":"comment-173046","author":"david_mo","post":"Begel is quoting André Baillet (1649 1706), Les vies des saints et l’histoire des festes de l’annee. T. IV. Paris, Louis Roulland, 1703, p. 261. Free in Google Books p. 28. « L’autre Suaire qui porte ausi une empreinte du corps de Jesus Christ est celui qu’on appelle le saint Suaire de Besançon. La peinture n’y est pas si forte ni les traits si distinguez que le Suaire de Turin. ».","date":"2014-11-26","mins":"3:30 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-173055","author":"david_mo","post":"More interesting: « L’autre Suaire qui porte aussi une empreinte du corps de Jesus Christ est celui qu’on appelle le saint Suaire de Besançon. La peinture n’y est pas si forte ni les traits si distinguez que le Suaire de Turin. C’est ce qui a fait dire à ceux qui ont donné l’histoire de l’un & de l’autre, que celui de Turin avoit servi à envelopper le corps tout ensanglanté à la descente de la croix, & que celui de Besançon avoit servi à l’ensevelir après qu’il eut été lavé & embaumé ». It was a common belief that the mark of Turin Shroud was made with blood..","date":"2014-11-26","mins":"3:48 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-173238","author":"david_mo","post":"The ambiguous position of the Church elicited the continuity of the popular cult to the Shroud. Though it was decaying till the 16th century, when the Savoy family took the matter into their hands and obtained the Ineuco Crucis..","date":"2014-11-27","mins":"2:51 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-173235","author":"david_mo","post":"Hugh: Two corrections: “It is true that my sources are 19th century.” Baillet: beginning of 18th century. “If a relic wasn’t popular (or thought likely to become popular), it didn’t receive hierarchical authority”. A lot of relics were accepted by the Church because they were owned by a powerful aristocratic family. The construction of a magnificent building to guard the relic, the insertion in a collection of prestigious relics, processions and other rituals, often determinate the Church approval and fostered the popular devotion and not in an inverse way. Very often the relic was hidden to the people into particular chapels and castels and his fame was expanded by artists or ministrels, after its proclamation..","date":"2014-11-27","mins":"2:40 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-173265","author":"david_mo","post":"Not exactly. See Nicola Pisano, for example. .http://www.shafe.co.uk/crystal/images/lshafe/Pisano Pisa Baptistery Pulpit.jpg There are many counter instances..","date":"2014-11-27","mins":"4:54 am","url":"https://shroudstory.com/2014/11/24/social-encyclopedia-ing-the-shroud-of-turin-and-channel-5/","cat":"wikipedia_content","title":"Social Encyclopedia-ing, the Shroud of Turin and Channel 5"},{"id":"comment-217149","author":"david_mo","post":"“The source Karaulashvili uses to try and show that the Image was a wooden board actually states it was a cloth”. Mark Guscin, “The Tradition of the Image of Edessa”, A thesis submitted for the degree of Doctor of Philosophy at the University of London (Royal Holloway and Bedford New College), August 2014. P. 45. Mario I advice you the reading of this text, easily available on line. It is clear that all descriptions of the Mandylion (except some latin late traditions that are not properly descriptions) are coincident in that the Mandylion was a face on a cloth..","date":"2015-12-24","mins":"6:20 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217159","author":"david_mo","post":"Also essential: Nicolotti, Andrea: Dal Mandylion di Edessa alla Sindone de Torino, Alessandria, Edizione dell’Orso, 2011.. In Italian..","date":"2015-12-24","mins":"12:55 pm","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217237","author":"david_mo","post":"“The earliest Shroud like images of Christ appear to be the St Catherine’s Pantocrator, the Homs vase image, and the gold solidus of 692, all seemingly commissioned by Justinian II”. Absolutely not. Claudine Chavanne Mazel (“Popular Belief and the Image of Beardless Christ”, Visual Resources, Vol 19, nº 1; p. 28) says he image of Christ was interchangeabily bearded or beardless from the late third century. The first was representation of wisdom and the second the eternal life. Some examples: Christ teacher fresco, Ipogeo degli Aureli, Rome, 3th century, http://www.nisandbyzantium.org.rs/doc/zbornik6/PDF VI/09%20 Tamara.pdf Santa Prudenziana, Roma, 4th century (el Cristo es antiguo; retoques en los apóstoles) Sarcophage, Christ enseignant, Musée du Louvre, Fin du I Ve siècle après J. C. Santa Constanza, Roma: Cristo entregando la ley a Moisés, mitad del siglo IV http://jeannetifft.photoshelter.com/image/I0000g0 Z4n D61y N8 Christ Between Peter and Paul, 4th century, Catacomb of Saints Marcellinus and Peter on the Via Labicana, Mural de la catacumba de Comodilla, finales del siglo IV. Http://contemporaneoshistoriadelarte3.blogspot.com.es/ I can not verify the links. I am travelling and I have not many time. The same for translations. In any case, the representation of bearded Christ existed long before the Byzantine iconography of Pantocrator and the Mandylion. Christ represented as bearded philosopher/teacher was an image borrowed from pagan iconography..","date":"2015-12-26","mins":"6:03 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-217284","author":"david_mo","post":"You can consider the similarities which you like, but Christ the Teacher (i.e. As the Louvre sarcophagus, etc.) is usually considered as a version of Pantocrator (your examples). He is a bearded man with a book, depicted often with the right hand raised. He is a symbol of wisdom and truth. He is not the image of a dead and naked man lying in the tomb. This a big difference. The iconographic sources of the Byzantine Pantocrator are very clear..","date":"2015-12-27","mins":"10:07 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216635","author":"david_mo","post":"“As you set out for Ithaka hope the voyage is a long one, full of adventure, full of discovery. Laistrygonians and Cyclops, angry Poseidon—don’t be afraid of them: you’ll never find things like that on your way as long as you keep your thoughts raised high, as long as a rare excitement stirs your spirit and your body. Laistrygonians and Cyclops, wild Poseidon—you won’t encounter them unless you bring them along inside your soul, unless your soul sets them up in front of you. Hope the voyage is a long one.” But here it will be a big hole for that we care about the shroud..","date":"2015-12-16","mins":"2:45 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-216637","author":"david_mo","post":"But here it will be a big hole for those who care about the shroud. (Oh my God! I make spelling mistakes even in my farewell!).","date":"2015-12-16","mins":"2:50 am","url":"https://shroudstory.com/2015/12/15/thank-you-everyone/","cat":"news_&_views","title":"Thank You, Everyone"},{"id":"comment-203309","author":"david_mo","post":"Correction: We will await….","date":"2015-06-23","mins":"2:26 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","title":"The Day Was Not About the Shroud"},{"id":"comment-203308","author":"david_mo","post":"We will hope other 17 years before Mr. Schwortz can be able to understand that what many sceptics think is that the Shroud was not painted as now appears. It seems a more difficult task than discovering the formation process..","date":"2015-06-23","mins":"2:24 am","url":"https://shroudstory.com/2015/06/22/the-day-was-not-about-the-shroud/","cat":"2015","title":"The Day Was Not About the Shroud"},{"id":"comment-174050","author":"david_mo","post":"You could read Nicolotti’s article about the false Ordine Costantiniano Angelico Di Santa Sofia here: http://www.giornaledistoria.net/index.php?Mestiere=557 D0301220202755772070305732771 (In Academia.edu also) Here you would find some convincing arguments against the authenticity of those documents in which you believe as the Holy Word. Then you could make some kind of rational objection instead of insults and generic lamentationi..","date":"2014-12-01","mins":"2:16 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174071","author":"david_mo","post":"About the alleged letter from Teodoro Comneno Ducas to Inocenzo III: “Si tratta di una falsificazione tarda e di basso livello sicuramente posta al centro della discussione scientifica sulla Sindone dall’entusiasmo in buona fede di qualche ecclesiastico. Il fatto che finora sia stata acriticamente citata va solo imputato alle scarse conoscenze di diplomatica (bizantina e non solo) con cui lavorano molti storici”. (Lucca Pieralli and Otto Kresten, quoted by A. Nicolotti: I Templari e la sindone, Roma, Salerno Ed., 2011, p. 111. My translation: “This is a late forgery and low level certainly at the center of the scientific discussion on the Shroud in good faith by the enthusiasm of some ecclesiastical. The fact that so far has been uncritically cited only is due to the limited knowledge of diplomatic (Byzantine and more) they work with many historians.” Lucca Pieralli is professor of Paleografia e Codicologia Greca presso la Scuola Vaticana di Paleografia, Diplomatica e Archivistica and was dishonestly quoted by Barbara Frale as a support to the authenticity of the letter. Otto Kresten is professor at the Institut für Byzantinistik und Neogräzistik,Universität Wien. More here: http://de.wikipedia.org/wiki/Otto Kresten (In German).","date":"2014-12-01","mins":"3:21 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174270","author":"david_mo","post":"“Actually it is mentioned there only in one or two sentences.” This is not true. Two paragraphs are specifically devoted to Teodoro’s 1205 letter in Nicolotti’s article. Seven reasons for inauthenticity are summarised. Nicolotti refers us to his book about the Templars. His reasons are widely explained there and some additional arguments by the two experts I mentioned above are added. This is not “one or two sentences”. Perhaps your Italian is too bad or you have not a good memory..","date":"2014-12-02","mins":"3:20 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174878","author":"david_mo","post":"Colin: this is an interesting precision. The problem with sindonist science is the vagueness and uniqueness that surround some crucial experiences and assessments. How many, where exactly and who again…? often are non answered questions. I quote myself: “Neither Frache/Modena (negative), nor Mc Crone (negative), nor Adler&Heller (positive), nor Baima Bollone (positive) were scientific archaeologists. No one of them used specific tests for ancient blood that had been warranted by scientific archaeology.” “Is there an archeological study (independent) that had used the Adler&Heller’s methods for detecting ancient blood? Answer: No. A study made by non experts and not replicated by true experts can be conclusive? Answer. No.”.","date":"2014-12-06","mins":"3:44 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175181","author":"david_mo","post":"Mon cher Thibault: This is the conventional answer from whoever have nothing to say. I think you are not qualified to give lessons about Archaeometry and dating of ancient blood..","date":"2014-12-08","mins":"2:37 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-175491","author":"david_mo","post":"Months ago Hugh Farey made a list of the insults he had got for his moderate and polite scepticism. The rage is sindonist, in this forum at least. It seems that not believing in what they believe is an insult for some sindonist and to argue against is pure rage. Vaya por Dios..","date":"2014-12-10","mins":"3:00 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173421","author":"david_mo","post":"Full text by Baillet : “ Le Suaire qui porte aussi une empreinte du corps de Jesus Christ est celui qu’on appelle le saint Suaire de Besançon. La peinture n’y est pas si forte ni les traits si distinguez que le Suaire de Turin. C’est ce qui a fait dire à ceux qui ont donné l’histoire de l’un & de l’autre, que celui de Turin avoit servi à envelopper le corps tout ensanglanté à la descente de la croix, & que celui de Besançon avoit servi à l’ensevelir après qu’il eut été lavé & embaumé. Ce qu’il y a d’incommode pour cette opinion, c’est que l’on a observé la même fixation des membres dans l’une et l’autre peinture, jusqu’à lui croiser les mains et lui couvrir les reins de la même manière”. This is my translation of Baillet’s text: “The other Shroud that also has an imprint of the body of Jesus Christ on is the one called the Shroud of Besancon. The painting is not so strong nor the features as definite as the Shroud of Turin. This is why those who made the history of the one and the other, have said that the Turin Shroud had been used to wrap the bloody body at the descent from the cross, and that of Besançon had been used to bury him after he was washed and embalmed. This opinion has an inconvenient because one can see the same fixing of the members in one and another painting, until crossing his hands and cover his kidneys in the same way”. (It can be absolutely improved. Sure!) I found interesting this paragraph because is another testimony that says that the image was clearly visible in the beginning of the 18th century. It is obvious that Baillet collects an opinion in his epoch: the Shroud was painted. And no more. Baillet has reason in that two different objects with different functions cannot support the same image. The bag theory is impossible. If you wrap a bloody corpse in a sheet or similar and then carry it for a long or a short distance a rubbing would be produced and the stains would be blurred. The net imprinting of blood as in the Shroud would be impossible. This is one of the Zugibe’s critics to Barbet and one of the bases of his theory of the post washed imprinting. If I remember correctly..","date":"2014-11-28","mins":"4:09 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-174723","author":"david_mo","post":"“ …it is not true that STURP team did not want C14 testing.” Thanks for the quotation, Andrea. It is confirmed by William Meacham: “Radiocarbon Measurement and the Age of the Turin Shroud: Possibilities and Uncertainties”, Proceedings of the Symposium “Turin Shroud – Image of Christ?”, Hong Kong, March 1986: http://www.shroud.com/meacham.htm. But it is also true that some sindonists made disproportionate exigencies when became clear that the process was turning out to not be leaded by them. Meacham himself demanded five samples from different places of the Shroud, with a total of 12 cm2 Anyone could think that the Church wouldn’t accept this unnecessary “attack” against an alleged True Shroud of Christ. (Meacham included in this paper a series of exaggerated cautions in order to have some justification to criticise a possible unfavourable outcome. These cautions were an a priori and overall invalidation of the radiocarbon method)..","date":"2014-12-05","mins":"3:05 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173311","author":"david_mo","post":"Excuse me, Dan. These are not my words, but a mixture of André Baillet (Les vies des saints et l’histoire des festes de l’annee. T. IV. Paris, Louis Roulland, 1703, p. 261) and Google Translator.It could be widely improved. Sorry, I have not time now..","date":"2014-11-27","mins":"9:54 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173562","author":"david_mo","post":"The Gospels are a very confusing and contradictory source. Only John implies that the washing and the anointing were made. (“…as the manner of the Jews is to bury”. John 19 42). The synoptic Gospels spoke on a linen cloth that was used to descend and wrapping the body and to put the body in the tomb. This sequence, without ulterior explanations, implies the linen used to wrap the body was used as a shroud (perhaps not a final one). Only Luke speaks about a linen (singular) used to wrap the body first, and some funerary clothes (in plural) that Peter found in the empty tomb, after. We can draw any conclusion from this series of incoherent descriptions. One, two clothes, bandages, one sheet and a sudarium… But in the imaginary of painters that reproduced the story of the Shroud (Della Rovere and Clovio, over all of them), the stuff was clear. Some people are wrapping the body at the foot of the cross and it is a unavoidable conclusion that this was the cloth which was used also to bury the body because it has the same and inimitable form of the Shroud. Therefore, one sheet. My previous objection was against this interpretation (“the bag”, in Collin’s words). This is the usual interpretation of the sindonists, except Zugibe and his supporters. In my opinion, Zugibe’s supporters are a minority and also are in a mistake..","date":"2014-11-29","mins":"3:47 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173555","author":"david_mo","post":"To me?.","date":"2014-11-29","mins":"2:30 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"},{"id":"comment-173743","author":"david_mo","post":"You can imagine as you like. But History is built with documents. Andrea is “still waiting for a document before 16th century saying that in Besançon there was a shroud with an image of Christ”. I too. I am very surprised to see how Russell is invoked here. I don’t know if Sir Bertrand has devoted some pages to the historical method except to say the obvious assert that the History is not predictable , but he was a defender of rationality and experimental method in sciences and Philosophy. He was a hard critic of beliefs in God, miracles and superstition. He thought also that Religion is damaging and the Humanity will be happier without it. So, the first question he would have put here is: “Have you any document about the existence of the Shroud in the first fourteen centuries?” “There is not a scientific experience with radiocarbon that dates the Shroud in the 14th century?” I think he wouldn’t be very happy with the stories of complots made by Bonnet Eymard and invisible mending made by Marino and al. I’m sorry but when a I see some people invoking here Bertrand Russell I think they ingnore that are invoking the devil in person or are provoking..","date":"2014-11-30","mins":"3:23 am","url":"https://shroudstory.com/2014/11/27/the-makeshift-body-bag-of-turin/","cat":"how_do_we_know","title":"The Makeshift Body Bag of Turin"}]
