[{"id":"comment-169490","author":"david_mo","post":"Have you read my comment November 6? I repeat: “Antoine de Lalaing, Lord of Montigny. Ostension of the Shroud for Phlippe le Beau. Bourg en Bresse, The 14th April 1503, Good Friday. C´est la rice syndont et noble Suaire acheté par Joseph d´Arimathie, long de seize à dixsept pieds, large de sept pieds ou environ, où il l´ensepvelist avec Nycodesme quand ils le eurent ostet de la croix. On le voidt clérement ensanglenté du trés précieux sang de Jhesus, nostre Rédempteur, comme se la chose avoit esté faicte aujourd´hui. On y voidt l´imprimure de tout son trés sainct corpz, teste, viaire, bouce, yeulx, nez, corps, mains, pieds et ses chinq playes: espécialement celle du costé, longue environ d´ung bon demi piedt, est fort ensanglentée; et de l´autre part, comme il estoit couvert et redoublé dudict linchoel, on voidt le vestige et figure de son dos, teste, chevelure, coronne et espaules(…) ». « On le voit »= One can see him , “Jesus our Redemptor” « all his very holy body » as “if the thing was made today”. Furthermore, the comission designated by the Bishop of Liège, also concluded that the image was painted. (1449)”.","date":"2014-11-07","mins":"3:10 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169555","author":"david_mo","post":"You have asked who had said that the image was highly coloured and I answered you. All the expressions of de Lalaing and the Liege’s comission imply that the image was more visible, it is to say, more enhanced of colour than now is. No one spoke about “mysterious nature”, “fainted” or similar, but as “made today”. I think this is what you questioned..","date":"2014-11-07","mins":"7:13 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169553","author":"david_mo","post":"I wouldn’t bet a rupee to the rationality of the relics fans … in the Middle Age..","date":"2014-11-07","mins":"7:04 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168815","author":"david_mo","post":"I’m sorry Colin, but the “exceptional 3 D response” is a sindonistic myth. (Also the “negative image”). First: because the “exceptional 3 D response” only results whenit is done by sindonists. Other not sindonists works get 3 D images of the Shroud, but not “exceptional” at all. For example, the face profile is flat and the moustache stands largely out of the nose (Perhaps the Man of the Shroud was a Nietzschean!) Second: A regular artist can obtain a similar or better 3 D effect with simple technics. I am not precisely a great draftsman but in 5’ with a pencil and a finger I have done my contribution to the sindonist theory of “exceptional 3 D” by heart. La voilà! I am sure that a true artist can modulate the image much better than I did only with a softer pencil and a blending stump. This is a question of technic and ability. If these are your reasons to reject the pictorial hypothesis they seem too weak to me..","date":"2014-11-05","mins":"4:18 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169750","author":"david_mo","post":"“On le voidt clérement ensanglenté du trés précieux sang de Jhesus” referred to Jesus, then it would not be necessary to use the phrase “de Jhesus” after “très precieux sang.” Probably you are right, Hugh. But I think we have been setting the problem out badly. Imagine you read this: In the cover of the first edition of the book a vampire is painted. A flood of bright blood is running from his sharp canines. The vampire is a handsome man. We can also see that he is dark haired, his eyes are awfully opened and he holds in his left hand a silver crucifix. Can you think that the vampire is a black man? Of course, not. I have selected the most relevant features of the portrait of the vampire. If he were black skinned I would have said this. Now, your attention, please. One of the most relevant features of the current aspect of the Shroud is its faded colour and the unnatural colour of blood. No witnesses of the early years of the Shroud mentions it. They spoke of the bright colour of the blood (as painted) and then mention some visible features of the body. So, we mustn’t demand for an explicit mention of the coloured body, but for a mention to the faded aspect of it. And we have no reference of it! The sindonist fellows of this forum are subtly inverting the proceeding with a typically incorrect sindonist way of thinking. “He said there was a dog. He didn’t say the dog wasn’t green. Then, the dog was probably green”. A fallacy. What we ought to questioning is why the early testimonies spoke about some features that now are invisible. The five wounds of the body, for example. This raises a problem and two possible answers: The witnesses don’t say what they are actually seeing but what they remember or think they are seeing… In sum, they are not reliable. – In the early times of his wandering in Europe the shroud was retouched. I think very difficult to discern which of the two answers is more plausible. Perhaps a mixture..","date":"2014-11-08","mins":"2:35 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169759","author":"david_mo","post":"Trace: Copy (a drawing, map, or design) by drawing over its lines on a superimposed piece of transparent paper. Yes,.","date":"2014-11-08","mins":"3:10 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169761","author":"david_mo","post":"Collins concise: Trace: a mark or other sign that something has been in a place; vestige, Yes..","date":"2014-11-08","mins":"3:13 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169794","author":"david_mo","post":"I don’t know what do you men with “in the context of the Shroud”, but I can imagine it. I’m sorry but the main meaning of “trace” doesn’t implies any “faint”. This is your particular invention. Or better said “the context of the Shroud” invention..","date":"2014-11-08","mins":"5:31 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169757","author":"david_mo","post":"Relatively fainted. More fainted the 1568 than the 1516 copy, but lees than now. Both with five bounds, as de Lalaing and the clarisses said. The hair falls till the shoulders (also clarisses). But the clarisses sisters said some parts of the body (nose and hands) were clearly marked. Slippery slope for sindonism..","date":"2014-11-08","mins":"3:05 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169767","author":"david_mo","post":"Typo: Clarisse sisters. “Clarisses” is catalan..","date":"2014-11-08","mins":"3:24 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169764","author":"david_mo","post":"“Totally defeat Freeman’s theory of a once prominent painted image.” What a triumphalism!.","date":"2014-11-08","mins":"3:20 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168806","author":"david_mo","post":"“Technically, conceptually, and stylistically the Shroud makes no sense as a medieval artwork.” Big mistake. The Shroud is not a “medieval artwork” in the usual sense of a portrait or a pictorial scene. The Shroud is the image of the trace of a corpse on a sheet as imagined by a medieval artist. As other medieval shrouds have been disappeared, we have not the possibility to make a comparative study. We can say it is different from other Holy Faces we know, Manoppello included, that are simple portraits. But we make a big mistake if, as Wessellow does, we compare it with the usual medieval art. PS: I be grateful if someone explains me what are the stylistic features of the Shroud that do not correspond to the Gothic style. We can say the schools of Firenze or Siena, for example. Or the Franc Flemish style, if you like. I see many coincidences. And M. Vignon et al. Found a lot with the byzantine art. What now then?.","date":"2014-11-05","mins":"3:43 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169143","author":"david_mo","post":"Gian Marco: “the result was rather good even without retouching”. I am sorry but I am more incredulous than Saint Thomas. I would like to see how much the result is “rather good”, particularly the index finger longer than annular. I don’t think those effects might be produced by deformations of the cloth because these deformations would had also produced wrinkles in the cloth. Retouching is the most simpler hypothesis. Perhaps Garlaschelli may explain us how he got this effect. I wasn’t thinking that the body has been turned around. I was imagining the resurrection scene. But your answer to the problem of the sole seems convincing. It is obviously contradictory with the resurrection framework..","date":"2014-11-06","mins":"4:12 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169170","author":"david_mo","post":"“Therefore, we completed the prints of the fingers by painting them subsequently with ochre and a small brush.” Aha. I supposed this..","date":"2014-11-06","mins":"5:23 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168869","author":"david_mo","post":"Gian Marco: Perhaps a real body was used for the image, but some deformations imply an ulterior retouch because they are not natural. For example: there are not nipples, the index finger is longer than annular finger, the legs are extended but this is incompatible with the mark of the sole, the fingers and the arms are abnormally long, etc. Some of these features are typical of the late gothic painting and Trecento as the disproportionate index finger (see the madonne and child of Duccio, Cimabue, etc. Also the byzantine tradition: http://www.fordham.edu/halsall/ikon/top bvm.gif ..","date":"2014-11-05","mins":"6:35 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-168945","author":"david_mo","post":"” For example: too long fingers – I have rebutted this myth here: https://shroudofturin.files.wordpress.com/2013/11/on the allegedly long fingers of ts man.pdf“. Masterful! I am totally… stupefied..","date":"2014-11-05","mins":"10:56 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169152","author":"david_mo","post":"Senhor de Frias Moreira. Do you think that some lines and circles arbitrarily placed on some very bad quality photographs are worthy of congratulations? Truly? I surprised to know that M. Heimburger and il dottore Fanti had answer to my objections. Can you give us a quotation, please? So far as I know, no sindonist had ever answered to this kind of objections. They are simple questions that need simple answers. It is easier to elaborate confuse and complicated theories with showy scientific devices that nobody can appropriately understand. Do you know what Richard Feynman said about simplicity in science?.","date":"2014-11-06","mins":"4:43 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169235","author":"david_mo","post":"Antoine de Lalaing, Lord of Montigny. Ostension of the Shroud for Phlippe le Beau. Bourg en Bresse, The 14th April 1503, Good Friday. C´est la rice syndont et noble Suaire acheté par Joseph d´Arimathie, long de seize à dixsept pieds, large de sept pieds ou environ, où il l´ensepvelist avec Nycodesme quand ils le eurent ostet de la croix. On le voidt clérement ensanglenté du trés précieux sang de Jhesus, nostre Rédempteur, comme se la chose avoit esté faicte aujourd´hui. On y voidt l´imprimure de tout son trés sainct corpz, teste, viaire, bouce, yeulx, nez, corps, mains, pieds et ses chinq playes: espécialement celle du costé, longue environ d´ung bon demi piedt, est fort ensanglentée; et de l´autre part, comme il estoit couvert et redoublé dudict linchoel, on voidt le vestige et figure de son dos, teste, chevelure, coronne et espaules(…) ». « On le voit »= One can see him , Jesus our Redemptor « all his very holy body » as “if the thing was made today”. Furthermore, the comission designated by the Bishop of Liège, also concluded that the image was painted. (1449).","date":"2014-11-06","mins":"9:43 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169600","author":"david_mo","post":"Max: “Le” is refered to the nearest pronoun: this is to say: l´ensepvelist avec Nycodesme quand ils le eurent ostet de la croix. Who was “enseveli” et “descendu de la Croix” The Shroud? Not at all. This is the body of Jesus which is immediately described after. The global sense of the paragraph implies an easy sight of the body with some features that we cannot see today. As we cannot see the blood as “faicte” today. The fresh blood has a different colour than the Shroud now in Turin..","date":"2014-11-07","mins":"11:07 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-169588","author":"david_mo","post":"Henrik said: ““In it was painted, in a subtle way, the double portrait of a man” Memorandom of Pierre de Arcis, 1389 The issue is not whether some thought the image was painted but rather if it always has been considered to be subtle. A recently left imprint can still be subtle.” I’m sorry Henrik, but the memorandum uses “subtili” twice. “Subtili modo depicta” and “subtili ingenio”. In both cases “subtili” is used in the sense of penetrating, acute. This is the usual translation in this case. Remember that “subtle” has also the same meaning in English: clever, ingenious..","date":"2014-11-07","mins":"10:39 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-164277","author":"david_mo","post":"And you? Have you read both the Poulle’s article and the Chevalier’s writings? I have them in my bookcase and I think Poulle’s critic is biased and fails his target. I translate here a paragraph from my blog (http://sombraenelsudario.wordpress.com/2012/07/28/la aparicion del sudario/): In 2006 the historian and archivist Emmanuel Poulle made a very harsh criticism against Ulysse Chevalier, which sometimes falls into the insult. According to him, the renowned historian and canon had wilfully misrepresented the terms of the documentation in hiding the latest papal bulls (…). Without entering into the assessment of the deletions and other issues of documentary importance, we must recognize that Poulle’s position is not entirely consistent. Indeed, the same Chevalier in its 1903 text answer to similar allegations against him and highlights that you cannot question his honesty because he included the text of Jean of Naples’ correction [definitive redaction] (“Autour des origines du suaire de Lirey”, Paris, Alphonse Picard et Fils, 1903, p. 36, doc. K, in Latin). Moreover, he insists that this final document, though softened, is still conclusive about the lack of authenticity of the linen. I have to add to this: M. Poulle surely is an honest man, but his rabid attack against M. Chevalier ignores two relevant facts. First, although the final text of the papal bull omitted the expression “painted image” and similar still maintained it was a “figure or representation” and demanded that it be said out loud when exhibited “to avoid any fraud”. And it banned the paraphernalia that usually accompanied the exhibition of the accepted relics. Secondly, M. Poulle forgot that the investigation ordered by the bishop of Liege in 1449 confirmed the existence of this papal bull and accordingly ruled that the relic was not genuine but painted. So we have to conclude that was M. Poulle who made some unfortunate omissions..","date":"2014-10-21","mins":"3:54 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-169561","author":"david_mo","post":"Senhor de Frias Moreira; Don’t lectured me, please. I have read all the articles (?) that you link here and more. The effect 3 D depends of some contingencies: a) The device and its adjustments. In this case the software or its adjusment used by O.K. Was as bad as their photographs. B) The suitability of the image. Here it enters the ability of the artist or the direction and quality of thelight if we are talking about a photogrpoh.. All the sindonists works manipulate this data pro domo sua. Those I know, at least..","date":"2014-11-07","mins":"7:29 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-164355","author":"david_mo","post":"I’m afraid your French is not very good. In the p. 779 of “Les sources de l’histoire du linceul de Turin. Revue critique”, M Poulle should recognise that Chevalier gives the last version of papal bull. He only says M. Chevalier didn’t hold accountable of the last version in the corpus of his writting “en renvoyant à l’apparat critique les additions marginales…”. This is not correct because in the p. 13 Chevalier affirms: “On aurait pu reconnaître avec quelle loyauté scrupuleuse j’ai donné les variantes de la seconde édition, qui atténuaient un peu les expressions très défavorables de la première à l’authenticité. On ne fera jamais dire à cette bulle, même amendée, que le Suaire dont il y est question fût l’original. Il y reste ces mots topiques :Figuram seu representationem non ostendunt ut verum Sudarium D. N. J. C”. After, Poulle repeats that the papal position was “neutral”.But he carefully avoids to completly quote this last version that clearly marks that the Shroud is not authentic: only quotes “figuram predictam non ostendunt ut verum sudarium, sed tanquam figuram dicti sudarii Domini” (Poulle’s version has the same sense than that of Chevalier). And not other precisions “omni fraude cessante”, etc.. You need a good deal of blindness to call this “neutral”. NOTA BENE: I can provide you with translations if you have some problem..","date":"2014-10-21","mins":"11:04 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164647","author":"david_mo","post":"You had not read the Poulle’s article I quoted (2009) as I have supposed. You only mention a precedent article of Poulle (2006) and copy some paragraphs from other article of the Revue Internationale du Linceul de Turin. I don’t know who the author is. Of course, he is not M. Poulle and it doesn’t add nothing to the points I marked above. If you have much time to lose with disgressions I have not..","date":"2014-10-22","mins":"11:28 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164539","author":"david_mo","post":"Anoxie and Max: Please, please. Does M. Chevalier collect the last version of the papal bull of Clemente VII? Yes. Cf. Poulle 2009: 779. Does M. Chevalier collect this last version in the critical apparatus (i.e. Quotations and appendices)? No. He also makes reference in the text. Cf. Chevalier 1903:13. Does the papal bull affirm the Shroud is not the true Shroud of Christ but a “representation” of it? Yes. See Poulle 2009:778 and Chevalier 1903:13 Does the papal bull oblige to pronounce aloud this point when the Shroud is exposed in order to avoid any fraud and heresy? Yes. CF. Chevalier 1903:14, 36. Do you have the Poulle’s article? or do you understand French and Latin? Sincerly, I doubt it What version of the Chevalier’s text are you reading if any?.","date":"2014-10-22","mins":"4:02 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164794","author":"david_mo","post":"Don’t deconstruct the text, please. Poulle and Chevalier agree on believing the last version of the papal bull is softened. But there is a big difference of interpretation. Poulle claims the last version is neutral. Chevalier affirms that some conditions for the ostension are defused but the main content is the same. I agree with Chevalier. The clue is some words ignored by Poulle: omni fraude cessante, i.e. To avoid any fraud. If the last bull imposes some conditions to the ostension (the Srhoud of Lirey is not shown as the authentic Shroud, no candles, etc.), it is in order to avoid any fraud. And what is the only fraud thinkable in this case? Obviously one: to show the sheet as the authentic shroud of the Christ. My conclusion: both Chevalier and Poulle have a biased point of view, but Chevalier’s conclusion is more accurate. The last version of the papal bull just is a usual exercise of euphemistic ecclesial language. Making confuse what is clear. P.S.: Can I get your academic bibliography? I am curious. Thank you..","date":"2014-10-23","mins":"3:36 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165208","author":"david_mo","post":"Hugh; I don’t know why Max almost never provide his references and he have not any article published. I don’t know and I don’t mind. This is not my problem, but it is a problem when we intend to have a productive debate. In any case, he cannot use the lexicon you provide because fraudo has the same meaning that fraus, fraudis: to cheat, beguile, defraud, etc. I can provide other Medieval Latin Dictionaries in the same sense. Furthermore, omni fraude isa noun inablative without any doubt. There is not any reason to give up a primary meaning when it is so evidently fitting. For the rest, see the comment by Nicolotti infra..","date":"2014-10-24","mins":"12:17 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-164887","author":"david_mo","post":"What a silly game; but if you like… These are the last words of the second paragraph: “R.P. Vittorio Marcozzi”. OK? I have not the original issue but a reprint in a French Review devoted to the Shroud. Fortunately it is in my P.C. The first meaning of “fraus fraudis” is fraud, cheating, etc. And this fits perfectly with the text of the papal bull because it speaks about how avoid a fraud. I’m waiting for your bibliography. I think it will be very interesting. University of Riyhad. It sounds exotic. I’m not at home, but I will continue this “exciting” game tomorrow..","date":"2014-10-23","mins":"11:06 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165210","author":"david_mo","post":"Typo: a form in ablative.","date":"2014-10-24","mins":"12:20 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165212","author":"david_mo","post":"Typo; “Provides” ad “has” This is not my hour. I go to watch TV.","date":"2014-10-24","mins":"12:28 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-198514","author":"david_mo","post":"“Not a citation, no reference from his episcopal archives, no quotation from what Bishop Henri had written, all indirect reporting. Furthermore no document has ever been found or identified written by Bishop Henri that would corroborate anything that D’Arcis claims about Henri’s investigations”. History is based on documents. And there are different kinds of documents. Some are more reliable than others and each epoch has their own levels of reliability. In the Ancient world there were not notarial records or videotapes of every relevant event. In addition, a massive amount of documents have been lost and the majority of data are known by copies of copies. With Daveb’s criteria we should to put in the wastepaper basket the letters of Saint Paul or Plato, for example. “Disciplina arcana” are magic words to justify anything. There is not a single reason why the evangelists have to conceal the existence of this marvellous legacy of their Lord, the Holly Shroud. There is not a single reason why the cloth continued to be an “arcanus” with the triumph of Christian Empire when other legends, such as Abgar’s episode, were widely widespread and a multitude of relics arose from beneath the stones. There is not a single reason why this marvellous relic was not registered in the inventory of the relics when the chapel of Lirey was consecrated. The Papal bulls of Clemente VII implied a pre existent document from Bishop d’Arcis in similar terms to the copy that Chevalier discovered. There is not any reason to doubt of the authenticity of this letter. It reflects the polemic origin of the Shroud of Lirey. Another different thing is the reliability of d’Arcis’ claims for forgery. This is a more debatable subject..","date":"2015-05-07","mins":"2:22 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198587","author":"david_mo","post":"I see that now you don’t call anymore into question the authenticity of the d’Arcis memorandum. Now you are trying to call into doubt the content. But your arguments are mostly fantastic. They are stories of “cordial” feelings and jealous hates: the basis for a good TV series but to a bad book of history. Let us come back to the facts. The facts are the statements that we can substantiate on the basis of the documents that are preserved. And you are right. We have several documents about the founding of the Lirey’s collegiate. One of them is the confirmation by the Bishop Henry de Poitiers. It is a laudatory text and, you are right, there is not any disapproval of the public ostensions of the Shroud, but… nor is there any reference to the Shroud or its exhibitions. As in the other documents. The most direct explanation for this is that the shroud wasn’t in Lirey at this time or it wasn’t considered a relic. This is also consistent with d’Arcis’ claims that the upset of Henry de Poitiers was due to the public exhibition of the Shroud as an authentic relic. And it would be unthinkable that the public exhibitions of the Shroud were known by Henry without any mention to it either laudatory or condemnatory. And this is also consistent with the lack of mention to the Shroud in the list of relics when the foundation of the chapel. “Of the paint that he claims was so cunningly applied by his unknown artist, there remains not a vestige. If Bishop Henri ever discovered the secret of the image as alleged, then he imparted it to no one, nor was it known to his successor Bishop D’Arcis, nor has anyone else since ever discovered this marvelous secret”. Perhaps there was not any “secret”. The painted cloth is the Shroud of Turin. You know, the Bishops don’t usually made handbooks of painting..","date":"2015-05-08","mins":"4:23 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-198675","author":"david_mo","post":"I don’t care about the gratuitous disqualifications that Mr. Markwardt or you dedicate to Chevalier or Thurston. Their interpretation of the d’Arcis memorandum is not the subject now. We are speaking about its authenticity and reliability. On this matter you have not say anything except that the manuscript is a copy and that no textual quotation is made. These objections are irrelevant. They only show that you (and Markwardt) ignore the basic features of the palaeography. A big amount of ancient texts are copies and they have not textual quotations, footnotes or consulted bibliography. And nobody call them “hearsay”. Not to mention the famous conspiracy. What do you know about the rol of Henri de Poitiers in the alliance policy of the family of Charny? The matrimonial policy in the Middle Ages was a very complex matter that had nothing to do with “effusive” or “cordial” feelings. Or was he satisfied with the suspension of exhibitions after his interdiction (cf. D’Arcis)? You continue with your TV series. But your characters are too anachronistic. Do you like the Sopranos? If the praised of the merits of the Lirey’s chapel by Henri de Poitier was so “effusive” (sic) why he doesn’t dedicate one single word to such great relic as the Shroud was and its multitudinous (d’Arcy dixit) exhibitions? Only two possibilities: or the Shroud was not in Lirey or it was not considered a relic and there weren’t any exhibition in 1356. The first possibility points to a forgery made by the monks of Lirey. This is consistent with the Papal bull that states that the cloth is not the real Shroud. The second possibility points to Freeman’s theory. I refrain my judgement on this point because I think we have not enough serious hints in any direction..","date":"2015-05-09","mins":"1:08 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-170299","author":"david_mo","post":"Do you know any description of the Shroud in the early years that say the image of the body is evanescent or difficult to see?.","date":"2014-11-10","mins":"2:39 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-198712","author":"david_mo","post":"On the question of the authenticity of the d’Arcis memorandum I think it is interesting the footnote 6, p. 26 of Chevalier’s Étude critique sur l’origine du saint suaire de Lirey Chambéry Turin , Paris, 1900. “This historic document, of capital importance and precious for more than one reason, deserves to be integrally read. Its authenticity is beyond doubt because I have found the minutes, once lost in the Archive of the diocese of Troyes. In order to establish the homogeneity of the copies that survive there, I have given together with the original text the strict collation of a contemporary transcription (Appendix, letter G) and I have duplicated an analysis (App. H) and two summaries (App. I and J) conserved in diverse places”. (Personal translation)..","date":"2015-05-09","mins":"9:52 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","title":"Colin Berry: Yes, it’s vitally important to match every tiny detail"},{"id":"comment-170310","author":"david_mo","post":"I can’t discuss with a deaf. “Traces” doesn’t means faint. The clarisses sisters said they were some parts of body clearly impressed. “(Le né comme la partie plus éminente du visage est bien imprimé“). The evanescent aspect is a relevant feature of the Shroud image today. It is ever mentioned when someone is describing it in the recent days. No one in the early days You can conclude yourself..","date":"2014-11-10","mins":"3:13 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170341","author":"david_mo","post":"See the dictionnary. Word Reference: “a mark, sign, or piece of evidence of the existence, influence, or action of someone, something, or some event” Collins: “a mark or other sign that something has been in a place; vestige” In French: Trésor: A. − Suite d’empreintes, de marques laissées par le passage de quelqu’un, d’un animal, d’un véhicule; chacune de ces empreintes ou de ces marques. Medieval French: – “Marque, empreinte laissée par qqn ou qqc.” Etc., etc About the copies you mentiion I have already replied in a previous comment..","date":"2014-11-10","mins":"5:43 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170296","author":"david_mo","post":"I don’t say that the rubbing on the coin produces automatically and strictly the same effect that the Shroud. I just said it produces a negative effect. Only that. If you want more precise matching with the shroud you should engage a skilful artist and to use a bigger object than a coin. You can also use more accurate tools to correct the basic image of rubbing. A pad, for example. You can also use a technic of successive fine veilings, as Leonardo sfumato and the Dutch painters of the 14th century. The result will be a very modulate patina. The “pompiers” in France were masters in that effect, although they were horrific painters. Some drawings with these technics (rubbing) are been made and they have similar properties than the Shroud. The main objection is that they were bad fixed to the cloth and would be erased with the folded. Nevertheless, Charles has shown how some painted clothes in the Middle Age were used as banners or liturgical objects without problem. This problem is overcome if we consider the possibility that the Shroud was retouched, as it seem be the case of that of Besançon..","date":"2014-11-10","mins":"2:30 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170346","author":"david_mo","post":"Colin: The clarisses were believers and not critical enquirers. How do you want they said the shroud was painted? You sometime think in medieval testimonies as current ones. You have to analyze the kind of witnesses before to deduce any conclusios..","date":"2014-11-10","mins":"5:51 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170408","author":"david_mo","post":"Archaeo psychology?? Considering the point of view of the author is the main rule for textual criticism! “The TS is an faint NEGATIVE imprint, with no solid evidence for thinking it was ever anything significantly different from what we see today.” Have you any evidence for thinking it was significantly the same what we see today? Some testimony about the fainted aspect? What about “bien imprimé”?.","date":"2014-11-10","mins":"10:24 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170554","author":"david_mo","post":"Colin: I write synthetically because I have not many time and because my English is not very good. Others in this forum have more time and/or better English. The study of the point of view of the testimony and its assessment is not a game for children. It is a common rule to the textual interpretation, History, Ethnology and other branches of the social sciences. I don’t know if you have read the complete testimony of the Clarisses but you ought to take its passionate piety into account if you want to evaluate its objectivity. The human sciences are not natural or formal sciences. This simple fact is usually neglected by those who practice natural sciences. I never would say that a text with illegible/faint letters is “well impressed/printed”. Because this expression implies “clearly visible”. If the printing house sends you a galley proof as faint as the image of the Shroud, surely you will return it and will say: “Do it again, please. This is not well printed”. Yes or not?.","date":"2014-11-11","mins":"2:36 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170351","author":"david_mo","post":"Sorry Collin: “par extension, in Medieval French: “empreinte” = Trace. Imprimeer = laisser une trace”. See “trace” above. The Clarisses are thinking in a trace of a body from their religious point of view. And no more..","date":"2014-11-10","mins":"5:58 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170353","author":"david_mo","post":"Typo: imprimer.","date":"2014-11-10","mins":"5:59 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-170117","author":"david_mo","post":"Everybody has done sometime a negative image. It suffices to rub a paper on a coin with a pencil. Furthermore, I have done a negative image with a pencil and a finger in 5 min. Where is the mistery?.","date":"2014-11-09","mins":"10:58 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-197538","author":"david_mo","post":"Hgh: Do you really believe that a team of experts in testing blood (1969) don’t were aware that their experiment failed in such a primary variable? The problem of the tests in 1969 and 1978 was other and the same. No specific test for ancient blood was made..","date":"2015-04-25","mins":"11:39 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197699","author":"david_mo","post":"I have read some articles both in Spanish and English. Some examples in English: Carney D. Matheson, Jay Hall and René Viel: “Drawing first blood from Maya ceramics at Copán,Honduras”, in Michael Haslam,Gail Robertson,Alison Crowther Smith,Sue Nugent,Luke Kirkwood eds.Archaeological Science Under a Microscope: Studies in Residue and Ancient DNA Analysis in Honour of Thomas H. Loy, ANU Press Library, 2009. JOCELYN KAISER “Blood from Stones Tests for prehistoric blood cast doubt on earlier results”, Science News, June 17, 1995 Marek Janko, Robert W. Stark and Albert Zink: “Preservation of 5300 year old red blood cells in the Iceman”, J R Soc Interface. 2012 Oct 7;9(75):2581 90 Albert T. Vish: “Blood Residue Studies Synthesis”, https://www.deldot.gov/archaeology/blue ball/pdf/piedmont/series180 app f.pdf I am not an expert in Archaeometry but I think that these studies above are some clear samples of the difficulty of testing ancient blood. In any case, all use different methods of those of Adler and Heller. I have searched for some specialized article in Archaeometry that quoted Adler and Heller and I have not found anyone. Their theory seems to be a mere speculation without sufficient experimental contrast. My conclusion (once again): let the specialists work on specialized matters. Then we will be able to judge on some aspects. Maybe. Or not. PS: I am in the habit to be honest in my statements. So I ever try to read “honestly”. And you?.","date":"2015-04-27","mins":"1:50 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197703","author":"david_mo","post":"We have three different results for the problem. Solution: a specialized team with specialized means. Independent of the parts in conflict, of course..","date":"2015-04-27","mins":"2:11 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-197702","author":"david_mo","post":"See my previous comment, please..","date":"2015-04-27","mins":"2:05 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans"},{"id":"comment-167661","author":"david_mo","post":"I imagine I have lost an important quotation. Where is said that the loros is a symbol of the Shroud?.","date":"2014-11-01","mins":"12:08 pm","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-167840","author":"david_mo","post":"Thanks, Hugh. This is a theory. That is what I have been able to find out so far. I did not find any document that says that the loros symbolized the shroud of Jesus. This is contradictory with the fact that the loros was worn by diverse dignitaries in the course of other ceremonies than Easter and in its origin was a symbol of Roman power. My particular question is if some document says the loros was the symbol of the shroud of Christ..","date":"2014-11-02","mins":"3:16 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-167880","author":"david_mo","post":"Grazie, Andrea. I have your book, but one cannot get all into his head. But the quotation from De Ceremoniis… says the loros was only used in Easter. This is contradictory with other data.See here: Michael F. Hendy;Catalogue of the Byzantine Coins in the Dumbarton Oaks Collection and in the Whittemore Collection, 4: Alexius I to Michael VIII, 1081 126, Harvard University press, 1999, pp.153ss. On line in Google Books..","date":"2014-11-02","mins":"6:50 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-165996","author":"david_mo","post":"“Maria Delfina Fustina, in Studi piemontesi, Turin 1972.” Excuse me. This is not a correct way to quote. The article title is missing, and also the page number, if possible. Thank you..","date":"2014-10-27","mins":"4:00 pm","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-166115","author":"david_mo","post":"Thank you, Hugh. I agree. Too much expensive to a collateral issue..","date":"2014-10-28","mins":"3:47 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-166204","author":"david_mo","post":"Perhaps the Shamir’s lecture in Bari can help to differenciate the fabric of the Shroud from the usual fabrics in Palestine. See Lombatti http://www.antoniolombatti.it/B/Blog01 14/Voci/2014/9/9 Orit Sharmir conferma  niente di ebraico come la Sindone!.html. What a pity that the Shamir’s lecture has not been published yet by the responsibles of the meeting! But I think the picture in Lombatti’s blog is ilustrative..","date":"2014-10-28","mins":"10:43 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-166220","author":"david_mo","post":"Max: It is difficult to disentangle all your fantasies presented as apodictic truths.This is one of the most amazing. “Remakably “He wears a zigzag/herring bone weave patterned linen cloth (…)”. Please, please. You cannot identify any zigzag form as a herringbone cloth, and less still as linen. The zig zag forms are widespread in the Gundestrup cauldron. It represents the hair of the beasts, that is not neither herringbone fabric neither linen, or course. The most plausible interpretation is that the god of the beasts wears a fur cloth. “Cernunnos presents himself as a muscular elf with dull fur clothes…” Truly, I am tired to chase your out of control imagination. I think i’ll take a leave..","date":"2014-10-28","mins":"11:24 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-166455","author":"david_mo","post":"Max: Thank you for the grammatical correction..","date":"2014-10-29","mins":"2:41 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-167114","author":"david_mo","post":"Hugh; An expert is someone that has worked on a field on years, has published some works in specialist editorials and journals preferably, has presented communications in specialist conferences and/or holds a relevant place in the academic world. An expert is recognised and quoted by his peers. An expert needn’t fulfil all these features, but someone that doesn’t fulfil any of them is not an expert certainly. However much he proclaims himself as such. In the sindonist world alleged experts are acclaimed with an amazing frivolity. Don’t fall in the same vice, please..","date":"2014-10-31","mins":"3:42 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-167256","author":"david_mo","post":"1.We are speaking about what an expert is. In fact, you don’t challenge my definition. You just said that a non expert can be more competent than an expert in some circumstances. I agree, but we ought to specify in what circumstances or “context” if you like. 2.For example: A practical problem is different from a theoretical one. You cannot match a mechanical problem with a physical or a historical problem. In the first case the expertise is highly dependent of experience. Aristotle spoke of technical and scientific issues. The terminology is ancient but the concept is still valid. But this is my first condition: a wide experience. Our problem is a historical problem and in History this wide experience is checked by years of study and production in specialist literature. In mechanics the checking is not the same, obviously. Perhaps we can speak of experience in the garage and success in the manipulation of objects. I don’t know because I am not an expert in this matter. 3.Of course, a non expert can be right in a particular issue. Exceptions are possible. We have to examine all the particular circumstances and the reasoning involved. But the non expert would claim his success not his expertise. We can say the non expert is right but not that he is an expert. If we call a non expert “expert” we are in a mistake. My point is that this is a mistake very extended in sindonism. And we have here in this forum an extreme case..","date":"2014-10-31","mins":"11:00 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-191009","author":"david_mo","post":"Thibault: You can see the answer to your questions in Orit Shamir: “Textiles from the 1st Century CE in Jerusalem – a Preliminary Report “, in Ancient textiles : production, craft and society : proceedings of the First International Conference on Ancient Textiles, held at Lund, Sweden, and Copenhagen, Denmark, on March 19 23, 2003,Oxford : Oxbow Books, 2007. (On line in Academia.edu). Raes, Vial, Testore and Flury Lemberg probabilly were not able to come to reliable conclusions about the date of the Shroud because they weren’t experts in the History of Palestinian textiles in Antiquity, as Shamir is. For some gross mistakes of Flury Lemberg on this point, see Lombatti “La Sindone e il giudaismo al tempo di Gesù”,(http://www.cicap.org/new/stampa.php?id=273770# )..","date":"2015-02-14","mins":"3:23 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191092","author":"david_mo","post":"Please, read Antonio Lombatti’s and Orit Shamir’s articles that I quoted. Shamir: Linen textile in Palestine are always twisted S spun, A few examples of wool are in Z spun. Akeldama is one of them. Textile production in Greece and Rome was Z spun. Therefore, experts think that the fragments of wool Z spun found in Palestine are imported. Orit Shamir thinks this is an “additional proof” against the authenticity of the Shroud of Turin. Lombatti shows in detail that Flury Lemberg is wrong when affirms that the fabrics in Masada are similar to the Turin Shroud. Flury Lemberg’s quotes are wrong (there are not burial cloths in Masada) or refer to inexistent texts..","date":"2015-02-15","mins":"2:53 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191096","author":"david_mo","post":"“This disproves another lie, that making a cloth 4×1 meter size was impossible in those times.” Sure. The weavers of the Turin Shroud found the time machine of H.G. Wells and went back six millenniums to bring the cloth of a warrior chief. But the cloth of the Cave of Warrior was woven in plain weave and S yarns. What a pity! (PS: Everybody knows that some big fabrics were produced in the History, before and after the Shroud.The question is if there were similar fabrics in Palestine in the First Century)..","date":"2015-02-15","mins":"3:45 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191122","author":"david_mo","post":"I was referring to this: “Ho controllato il volume per verificare quali siano queste somiglianze con la Sindone. Immaginate un po’? Nessuna. Non capisco proprio perché la Flury Lemberg abbia citato quelle pagine. La figura 111 di p. 210 riporta questa descrizione: Wool, red, balanced 2:2 broken diamond twill. Some edges seem deliberately torn. Dyed with madder. Cosa c’entra con la Sindone che è un 3:1 herringbone twill? Niente. E anche l’illustrazione 113 di pag. 211 non ha nulla a che fare con il lino. La sua descrizione è nella pagina precedente: wool, 1:1 diamond twill. E queste sarebbero le somiglianze?” (A. Lombatti: Op. Cit.). “Inexistent texts” perhaps was not an accurate expressión. Is “inexistent likeness” better? In any case their quotes were wrong..","date":"2015-02-15","mins":"11:14 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191093","author":"david_mo","post":"“It does not seem to fit the pattern of a medieval provenance”. King, Donald: “Un lino parallelo alla Sindone di Torino”. Approfondimento Sindone, year VI, 2002, (pp. 5 8). / D. King, “A parallel for the linen of the Turin Shroud”, Bulletin du CIETA 67 (1989): 25 27. Summary here: http://www.antoniolombatti.it/b/blog/3756 F9 C2 2 B97 4 DE0 A0 E3 0 F4 B650 DF3 A3.html (In Italian) “The only parallel with the Turin Shroud textile is a piece of cloth kept in the Victoria & Albert Museum, in London, and it is medieval”. A.Lombatti: “The Turin Shroud and Easter stories”, The Bible and Interpretation, April 2012, http://www.bibleinterp.com/articles/lom368013.shtml.","date":"2015-02-15","mins":"3:09 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191171","author":"david_mo","post":"In his brief report, Tyrer find a single differential feature of the fabric: the density per cm2, In other aspects, the fabric is similar to the fabric of Turin. This can not be said of “similar” tissues found in Palestine. In particular in Masada or the wool of Akeldama. Vivaldi could have written a sonata in the dodecaphonic style. Yes, it is possible. But History is not built with vague possibilities but with facts that form patterns of regularities. Linen, 3:1 herringbone and Z spun is not characteristic of Palestine fabrics. But there is a similar fabric in Victoria and Albert Museum. Full stop..","date":"2015-02-16","mins":"2:53 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191248","author":"david_mo","post":"Daveb: We are speaking about the weave techniques. If painted or not is irrelevant from our discussion. I insist: the only difference between the fabric of the Victoria&Albert museum and the Shroud is the density of the yarns. Have you any specific doubt about the dating of the former or you are only employing the tactic of suspicion? Again and again: History is not made with mere possibilities. We can know if the trade of clothes between Asia and Palestine had brought fabrics similar to the Shroud when some remains are found. We know archaeological remains of Mediterranean fabrics imported to Palestine, but nothing similar to the Shroud. These are the facts. Making novels is another thing. When a similar fabric to the Shroud will be found in Palestine we could maintain the possibility that it was from the 1rst century. Now, we ought to say that the fabric seems medieval and not Palestinian. You can say that this is not an absolute proof and you will be right. In History there are not many absolute proofs. Only proofs..","date":"2015-02-17","mins":"2:54 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-191320","author":"david_mo","post":"Hugh: “We can laugh, but OK is correct in supposing that by sticking to these precise criteria, the Shroud clearly does not exist at all! So what to do?” We can laugh, but not because that. The pattern: not textiles with the basic features of the Shroud in Palestine 1rst century. The fact: one instance of a similar fabric in the Middle Ages. Let everyone draw their conclusions. When some similar copies of the Shroud are presented the sindonists require an identical copy of the shroud, even on a microscopic level! When we ask for a fabric of the first century with similar basic features they say we are too tough. Yes, we can laugh..","date":"2015-02-18","mins":"3:00 am","url":"https://shroudstory.com/2015/02/11/shroud-the-reasons-for-the-no/","cat":"article","title":"Shroud: The Reasons for the ‘No’"},{"id":"comment-209962","author":"david_mo","post":"I beg your pardon! Your comment is pure malicious speculation. We can invalidate every work that doesn’t please us with this kind of argument. Remember that Flury Lemberg was working with a team that made a micro scanning of the shroud. Were they also biased? Is the micro scanning manipulated? Please, please. You have not any evidence (neither chemical nor physical) that absolutely invisible repairs exist. There is not bibliography, nor any instance of a patch of 1x7cm that could be invisible to microscopical examination. Even some of the experts you have presented as testimonies say that that invisible mending (French Weaving, etc.) is not absolutely invisible to the experts and microscopical examination. Now, a peer reviewed paper questions the bases to believe in chemical anomalies in the samples. (Rogers) This is the issue. Not hearsay about suspicious minds..","date":"2015-09-09","mins":"9:58 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-209967","author":"david_mo","post":"I think we ought to cease with speculations and wait for Heimburger’s reply. Unless someone be able to provide some substantial contribution..","date":"2015-09-09","mins":"10:12 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-210022","author":"david_mo","post":"“Mme Flury Lemberg’s reputation was built on her knowledge and experience of textiles, not of microscopy, nor chemistry, nor any one of the hard sciences”. Who is an expert on textile? An expert on textile restoration and textile history or an explosives expert? Or a nurse and a former monk? May be I am a very odd person but I think that the most qualified person to decide if a canvas is mended is an expert on textile restauration. This is not to say that this expert cannot be wrong in a particular case and the nurse be right, of course. But now we are speaking about qualifications, are we not? Flury Lemberg: About her expertise with microscope we know nothing. (Remember that her last conclusions were co signed with an expert in microscope of her team). We don’t know anything on what circumstances she uttered the sentence that Gove attributes to her. I have read the book of Gove and it is a gossip collection with a unique heroe: Harry E. Gove. Remember that Gove affirms that the STURP was a team of destructive zelots. Take care with the book of Gove. Please, wait and see..","date":"2015-09-10","mins":"2:08 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-210041","author":"david_mo","post":"I don’t know this interview. Can you geave the reference, please. Thank you..","date":"2015-09-10","mins":"8:47 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-210112","author":"david_mo","post":"I agree. Who is Carlos Evaristo? Is he the archivist of what place? I have not found any biography of this man. Only his controversial interview with Sister Lucy of Fatima. A soap opera, it seems. Note that we are speaking of an interview made by an unknown “archivist” with someone that says that “according some oral tradition”… Oral tradition against statements of experts? The classical confusion. Without any reliable data we are in the domain of the hearsay..","date":"2015-09-11","mins":"5:48 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-210096","author":"david_mo","post":"“…fragments from all around the outermost edges of the Burial Cloth, even as far inward as 10 centimeters and distributed these to close relatives, devotees and allies”. 10 cm!? Sincerly, I don’t think this is a reliable source. Where are the holes ? Where is a documented confirmation of such damage?.","date":"2015-09-11","mins":"1:45 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","title":"Significant Response to the Preview of the Thermochimica Acta Editorial"},{"id":"comment-199072","author":"david_mo","post":"Some recurrent topics in the sindonism that are false: 1. If a painter made the Shroud he did it with the same appearance and properties we can see it today. False: the most common alternative is that a painter made it and what we see now is the outcome of a degradation process (Nickell, Garlaschelli, Freeman…) 2. “There was no further progress with Anatomy, and Galen’s work was the only authority available until Leonardo began his own dissections in the 16th century”. False: dissections were common in the end of Middle Ages. For example, see Gui de Chauliac, Grande Chirurgie. 1363. 3. “It seems difficult to able to assert that sufficient anatomical knowledge was then available for it to be a work of human art”. Nicola Pisano, Pisa Baptistery. Pulpit, 13th century. Https://i1.wp.com/www.shafe.co.uk/crystal/images/lshafe/Pisano Pisa Baptistery Pulpit.jpg Giotto. Lamentation. Capella degli Scrovegni. 1306. No comment. 4. About the “objectivity” of the sindonist forensic surgeons let us drop the matter. They say amazing things and have sometimes a “super view” more acute than Superman that allows them to do an autopsy with a blurred image and to arrive sometimes to contradictory conclusions..","date":"2015-05-14","mins":"1:53 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-199150","author":"david_mo","post":"I’m not sure I understand, Colin. This is a Trecento painting made with some pictorial conventions. The representation of the piece of linen on Joseph’s shoulders is so conventional as his own clothes. We can not conclude anything about the real cloths of the passion from Giotto’s painting. I agree with you, the Shroud has not the form of a shroud. It is too narrow. But nor it has the useful proportions to carry a corpse. It is too narrow also for this purpose..","date":"2015-05-15","mins":"2:03 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","title":"Too Great to Be a Work of Art"},{"id":"comment-31028","author":"david_mo","post":"“In agreement with the biblical book of Exodus, the Shroud’s threads have a twist “Z” instead of the more common twisting “S” because addressed to high ranking religious person.” Can anyone explain this? Does the Exodus mention linen textures? Thank you..","date":"2013-04-17","mins":"1:39 am","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31080","author":"david_mo","post":"I know a sole reference in “Exodus” (26:1) that sounds remotely. “Make the tabernacle with ten curtains of finely twisted linen and blue…” or “Make the Tabernacle from ten curtains of finely woven linen”. Both translations are possible. Either Mr. Fanti misinterprets the word “twisted” or he has a big imagination. You need a lot of fantasy to see here a reference to “Z” and “S”..","date":"2013-04-17","mins":"12:13 pm","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31134","author":"david_mo","post":"Conclusion: “Exodus” says nothing about “Z” or “S”. Fanti’s imagination makes him see things. About Fulbright: Bad historical practice is made when you compare different objects from separate cultures and try to match them. Fulbright might demonstrate that a cloth as the Shroud is physically possible in Palestina in the 1st. Century. Maybe. But physical possibility isn’t cultural (and economic) possibility. A burial cloth from a poor prophet in Jerusalem isn’t a royal burial cloth in the Chalcolithic (6.000 years before!) or in North Europe (900 BCE). Burial cloths aren’t coats, wool isn’t linen, 2:2 isn’t 3:1, and so on. It sounds alike to the inexpert, but this way of comparison can mislead him. The true historians know this. I think Mrs. Fulbright has forgotten it. I recommend take a look at “La Sindone e il giudaismo al tempo di Gesù” by Antonio Lombatti, http://www.cicap.org/new/stampa.php?id=273770#. Very intesting. Yes, in Italian. But to know other languages is useful. You see, although my awful English is useful for me..","date":"2013-04-18","mins":"2:42 am","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-31260","author":"david_mo","post":"Daveb of wellington nz : Her several examples of cloths found in the Judean desert was an ample refutation of both these false claims. (…) A poor crucified prophet may not be up to providing a fine linen shroud for his burial, but it would be well within the means of a wealthy patron such as Joseph of Arimathaea. It was said to be a common practice of 1st century Jews to provide extravagant funerals. This practice only ceased in the 2nd century when Gamaliel II directed that he was to be buried in a simple plain weave shroud, and his example then became the norm. 1. How many linen shrouds about 4m long has found Mrs. Fulbright in Palestine into the “extravagant” tombs of rich Jews? 2. How many of these linen was woven in herringbone tread 3:1 twisted in “Z”? Yes, nothing, or almost nothing, is impossible in History. But the Shroud of Turin doesn’t match withh funeral clothes in Palestine (1st Century), and Mrs. Fulbright’s article doesn’t changes this claim. Joseph of Arimathea is a controversial character in the narrative of the Passion with contradictory features. Let us talk the first evangelist, that is to say, Mark (15:42 46): “[42] And now when the even was come, because it was the preparation, that is, the day before the sabbath, [43] Joseph of Arimathaea, an honourable counseller, which also waited for the kingdom of God, came, and went in boldly unto Pilate, and craved the body of Jesus. [44] And Pilate marvelled if he were already dead: and calling unto him the centurion, he asked him whether he had been any while dead. [45] And when he knew it of the centurion, he gave the body to Joseph. [46] And he bought fine linen, and took him down, and wrapped him in the linen, and laid him in a sepulchre which was hewn out of a rock, and rolled a stone unto the door of the sepulchre.” Normal. The “honourable counseller” has voted against Jesus in the strange Sanhedrin session, but he is a secret disciple of Jesus. So, when he knows Jesus is dead he goes to the local market and buys a royal linen cloth (very common in Palestina markets in these days) just before the Sabbath begins. All is normal… in a fairy tale. Note that I’m not denying JA could exist and that he could buy a piece of linen. I’m asserting that an improvisation of the purchase of so exceptional piece of linen is highly unlikely (i.e.: “impossible”). Shroud of Turin is supposed to be a proof of evangelical narrative, not the other way around. If we accept the Gospels as an argument for the Shroud case we don’t make History, but stories..","date":"2013-04-19","mins":"2:06 am","url":"https://shroudstory.com/2013/04/16/giulio-fanti-responds-to-gian-marco-rinaldis-book-review/","cat":"books","title":"Giulio Fanti Responds to Gian Marco Rinaldi’s Book Review"},{"id":"comment-191947","author":"david_mo","post":"Clues? What clues? I know a little the academic world. And I also know that if you have obtained some information from a precedent unpublished work or from another person it is a good practice to mention it and a bad practice to conceal the fact. These are the bases for intellectual integrity. A list of acknowledgements is usually included on the books. Do you know it?.","date":"2015-02-27","mins":"3:05 am","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-191860","author":"david_mo","post":"This is very ugly, Mario. Firstly, you have taken advantage of the work of another person without mention him. Secondly, you claim the manuscript have never been published and it is on line. The least that can be asked is a rectification and that you apologize..","date":"2015-02-26","mins":"2:55 am","url":"https://shroudstory.com/2015/02/25/new-book-by-mario-latendresse/","cat":"books","title":"New Book by Mario Latendresse"},{"id":"comment-45484","author":"david_mo","post":"Mr. Marino makes two serious charges in his comment (among others). “I think this is interesting in light of the later discovery that “anonymous businessmen” made a 1 million pound donation to Oxford for ostensibly having proven the Shroud to be a forgery”. I’ve been looking for a proof or an indication that this famous million was a reward for “having proven the Shroud to be a forgery” and I have found nothing. I have read several Mr. Marino’s pronouncements in this sense and I have not found anything similar to proof or indication. To blame someone without any proof is a very nasty thing. “And, of course, we know that the British Museum’s Dr. Michael Tite, who was billed as the independent overseer of the 1988 C 14 dating, left the museum and took the place of the late Dr. Edward (Teddy) Hall, when he resigned shortly after the dating and after the lab had received the donation.” Mr. Tite was keeper of the British Museum Research Laboratory. He was perfectly qualified to hold any academic position. His task in Radiocarbon dating of Turin Shroud was just supervision. He did not take any disposition without Holy See’s approval (Card. Ballestrero and advisors). The letter he sends to Card. Ballestrero about the true meaning of the dating (no proof or fake) is an exquisite sample of neutrality. His alleged lack of objectivity is just a presumption without any solid basis. To blame someone without any proof is a very nasty thing. Mr. Marino’s position about alleged complot in radiocarbon dating, specifically rejected by more serious sindonoligsts as Ian Wilson, Raymond Rogers or John Jackson, don’t surprise me, for I have read fom Mr. Marino some paragraphs as this one: “The age of the Shroud given by the labs was 663 +/ 25 years, which includes 666.” (“The Disciples On The Road To Turin”. Paper presented by Joseph Marino at Holy Shroud Guild Retreat/Conference–August 23 25, 1996) No comment..","date":"2013-09-26","mins":"2:39 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45584","author":"david_mo","post":"I don’t know how you are quoting me. I had not written all the paragraphs under my name. I think you must revise the entire article you wrote in 1996 because it is full of similar things to that I quoted. You don’t provide us any proof or relevant indication of any conspiracy. And you match dissimilar events. For instance: A leak of information is not a conspiracy to fake. Opinions are not evidences. Card. Ballestrero could have ridiculous suspicions about the Freemasonry’s hidden powers (we are in the 21th Century, please). But this is not a relevant indication of nothing. Fray Bonnet Eymard is the basis for Marinelli’s speculations. He is the leader of Counter Catholic Reformation, a religious political fundamentalist movement. His charges against almost all participants in the 1988 dating match his peculiar beliefs. I can have unfounded suspicions about sexual life of Pope Francesco. It would be a funny matter to cheat with friends in front a cup of wine or two. If I publish my unfounded suspicions the things are not funny at all. You the “conspirationalists” don’t realize that if you invalidate the 1988 dating because alleged (non evident) sceptical or freemasons (?) beliefs of some participants, you must invalidate all the sindonologists’ work (your own work also) because your opposite beliefs. Warning to extreme arguments because they can become double edged swords!.","date":"2013-09-27","mins":"2:42 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45774","author":"david_mo","post":"I do not understand anything. If laboratories dated a patch that mixed tissues from different periods their work was well done but on a wrong sample. So, why the hell they needed any “machiavelianism”? You are mixing theories mutually exclusive. Nobody can serve two masters at once. I recommend focusing on explaining how you can maintain a theory based on an informant (Mr. Ehrlich) that has discredited it. I mean the French Weaving that can only be done with the same base fabric in less than 1cm holes, and always in thick tissues. Try to explain these loopholes of “invisible mending” theory and forget satanic or Machiavellian interventions, please..","date":"2013-09-29","mins":"2:35 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45888","author":"david_mo","post":"Mr. Marino. Who is M. Bourcier de Carbon? We can’t discuss their points one by one. Some of these points aren’t imputable to labs, others are neither accurate nor demonstrable and others simply irrelevant or false. You can see a review of them on Rinaldi’s website: http://sindone.weebly.com/uploads/1/2/2/0/1220953/c14 unpublished data.pdf (more in Italian hiere: http://sindone.weebly.com/articoli.html ). But I repeat my point: “invisible mending” theory implies that the labs picked up a patch without realizing it wasn’t from the original fabric. This patch had a mixture of threads from the first and 16th Centuries. So, the final outcome was 14th Century. Labs published this date and I don’t see any “machiavelianism”. You may blame specially the textile experts (Testore, Vial and lastly Flury Lemberg) of astonishing incompetence and labs of arrogant contempt for their refusal to discuss with STURP. No more..","date":"2013-09-30","mins":"3:02 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45891","author":"david_mo","post":"Yes Hugh. A bit of a mess. At what points? 1. No homogeneity of methods (statistical specially) in the final report (Nature) 2. Unnecessary test. (Chi^2). 2. Lack of precision in measurements. Note sign ~ in Nature. Only Testore did informal accurate precisions. 3. Refusal to discuss. This nowadays continues: see the last controversy surrounding Jull&Free Waters’ paper. Things could be better but experts in radiocarbon dating thinks results are reliable… if nothing new is discovered. (See Ramsey, Evin, Gove, Currie and others and hypothesis of monoxides by Jackson). I think all this is not “Machiavellianism” but lack of strictness in publishing, different methodologies not well homogenized (who was the final responsible?) and too heated atmosphere..","date":"2013-09-30","mins":"3:35 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45943","author":"david_mo","post":"“The two posts above make serious unsubstantiated…”, this not refer to mine, I suppose. I don’t know why my two posts (sept. 30) are placed above H Ugh Farey’s comment (Sept. 26). Technologycal mysteries. Or black magic..","date":"2013-09-30","mins":"2:34 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-168498","author":"david_mo","post":"Faccini and Fanti are not neither forensic nor experts in History of medicine. Not even are physicians. Pierre Barbet was surgeon. He doesn’t make any reference of historical literature about flagellation. In the two texts I have consulted, at least. If you maintain that experts can be refuted by not experts in other thread of this forum, why not here? Be coherent, please..","date":"2014-11-04","mins":"4:03 am","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168821","author":"david_mo","post":"Carlos, no one is comparing the anatomy of the illuminations with the Shroud of Turin. We are just comparing the distribution of the marks. If you want to see more accurate representations of the human body (even better than the Shroud ) you have to go to the paint or sculpture of the epoch. Happy to meet you again. Translation: Carlos, nadie está comparando la anatomía de las iluminaciones con la Sábana Santa de Turín. Sólo estamos comparando la distribución de las marcas. Si quieres ver representaciones más precisas del cuerpo humano (incluso mejores que la Sábana Santa) tienes que ir a la pintura o la escultura de la época. Mucho gusto en saludarte de nuevo. Personal comment: En mi blog podrás encontrar algunas imágenes que corroboran lo que digo. Aquí, por ej.:http://sombraenelsudario.wordpress.com/2013/05/28/el argumento de la perfeccion/. Aunque ya sé que mi blog te debe parece obra del demonio. Qué le vamos a hacer..","date":"2014-11-05","mins":"4:41 am","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168514","author":"david_mo","post":"Charles: I have read your article on line and I find it is a great work. It debunks many mythes of the alleged sindonists experts in the historical field. I find some little details to criticise that I will comment if I find some time to do it. Two things: I have picked up a lot of links to entombment scenes in my blog.(http://sombraenelsudario.wordpress.com/2014/10/01/cristo en la tumba imagenes/ ). I can certify that any lashing marks before the XIV century can be found. Not even blood stains, with one or two exceptions. A request: I couldn’t get a link to the image of the Shroud in the Livre d’Heures of Marguerite de Valois. Can you give me one? Thank you..","date":"2014-11-04","mins":"4:31 am","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168569","author":"david_mo","post":"“The flagellation marks should cover the whole body to fit with Isaiah 1.6. You cannot find this before 1290 1300.” A little correction (not very significant, of course) to the general rule: Besançon – BM – ms. 0054 ; f. 013v ; Sujet : Flagellation du Christ ; Titre : Psautier cistercien ;Datation :vers 1260. Guido da Siena; Flagellation; 1270s. Http://www.wga.hu/art/g/guido/08poly.jpg.","date":"2014-11-04","mins":"7:28 am","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-157414","author":"david_mo","post":"An essential book, but the price amaze me. I bought it in its original Italian language and it is much cheaper..","date":"2014-09-28","mins":"5:14 am","url":"https://shroudstory.com/2014/09/26/the-metamorphosis-and-manipulation-of-a-legend/","cat":"books","title":"The Metamorphosis and Manipulation of a Legend?"},{"id":"comment-192352","author":"david_mo","post":"The article of Orit Shamir is very interesting. A dissident among sindonists is not very frequent in this kind of events. To know about the ulterior discussion would be more interesting yet, if such a thing took place..","date":"2015-03-04","mins":"2:49 am","url":"https://shroudstory.com/2015/03/03/nine-selected-and-revised-papers-from-the-bari-conference/","cat":"paper_chase","title":"Nine Selected and Revised Papers from the Bari Conference"},{"id":"comment-182748","author":"david_mo","post":"I think the quote of Mr.Loy is not exact. If I remember correctly, Wilson said that Loy said him in an informal talk that he had found some token of red coloured ancient blood. From what I know Loy had never publish this nor Wilson asked him for more precise data. (Why?) From what I know also Loy’s methods were accepted in the eighties, but today are considered obsolete..","date":"2015-01-12","mins":"3:06 am","url":"https://shroudstory.com/2015/01/08/an-early-morning-google-find/","cat":"video","title":"An Early Morning Google Find"},{"id":"comment-183011","author":"david_mo","post":"Sorry, Charles but this is not the Garlaschelli’s hypothesis. It seems an odd “recycling” of him. This is the resum of his position by himself: “The most likely explanation, in our opinion, is that the image, as it can be seen nowadays, is achemical etching of the cellulose of the linen fibers. This degradation can be accounted for by non neutra limpurities contained in the ochre that a mediaeval artist used to generate the image by a simple frottage technique. The original pigment came off during the many years of the Shroud’s history, leaving the well known ghostly weak image”. “How was the Shroud made?” ( Bold is mine. You can see a longer report (in Italian) here: https://sites.google.com/site/luigigarlaschelli/shroudreproduction)..","date":"2015-01-13","mins":"6:31 am","url":"https://shroudstory.com/2015/01/13/smithsonian-channel-is-it-the-greatest-prank-ever-pulled/","cat":"video","title":"Smithsonian Channel:  Is it the greatest prank ever pulled?"}]
