[{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"I fall back on John P Meier’s precept: “What can be gratuitously asserted, can be gratuitously denied!”  The absence of a wife in the gospels points strongly to the likelihood that Jesus remained celibate.  All the more likely as he seems to be a pioneer in the platonic friendships he is able to form with women, unusual for someone of his culture.  \nLikewise, Meier would have it that James is in fact at least the legal brother of Jesus.  He may have been adopted, He may have been a step-brother from an earlier marriage by Joseph, Or he may have been a true blood brother.  BUT we do not know, and can’t know now.  Because the Israeli Antiqities Authority went and cleaned his ossuary discovered at Talpiot!  Ask those two luminary archaeological “authorities” Simcha Jacobovici & Charles Pellegrino.  And they can write a more imaginative yarn than De Wesselow anyway!  All that we know of Peter from Acts is that “He went to another place!” \nAlthough the parading of the Shroud as a predicate for the core of the Christian faith is properly described as bizarre, I was reminded of a comment in one of Albert Dreisbach’s papers. He asserts (I paraphrase): \n‘St Nino of Georgia in the 4th century, maternal nephew of the Patriarch of Jerusalem, reports that the sudarium was found by Peter who took it.  Ishodad of Merv writes that whenever Peter made an ordination he arranged it on his head, apparently giving rise to a custom of bishops similarly arranging the turbans on their heads.’ [Lazarus and Jesus: Rev Albert R Dreisbach, Atlanta Shroud Conference 2005, authorities cited].\n\n","date":"August 21, 2012 at 6:46 am","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15306","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"De Wesselow arranged a nice Procustean bed in order convince himself (and other sceptics) that it was the Shroud that led to the birth of Christianity. \nAs for James the Just, the first Bishop of Jerusalem,the word “akhui” in Aramaic can mean brother, half-brother, step-brother, cousin and even partner. Even in India today there are many Hindus who refer to their first cousins as “brothers”. Why would Jesus, when nailed to the cross, and sensing that death was approaching, ask John to look after his mother if he had a brother?\n\n","date":"August 21, 2012 at 8:52 am","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15310","author":"Louis","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"I wrote a precis of Meier’s Vol 1 of “A Marginal Jew” for my own reference, and copied extracts of his chapter summaries.  (I had the book on loan)\nRe Jesus’ brothers:  Meier notes the literary trend from the lierary roughness of Mark, “telling it like it is” to the message proclamation intent evident in Matthew and Luke, to the somewhat more metaphysical intent of John.  This is evident for example in describing Jesus’ trade as a woodworker.  A similar trend is evident in describing his family relationships.  Here are my notes on his brothers:\n“Meier discusses the fourth century doctrines of Mary’s perpetual virginity, but considers that the “brothers” and “sisters” of Jesus mentioned in the gospels are in fact blood-brothers or sisters of Jesus – he refers to the typical use of the Greek word ‘adelphos’ (brother or half-brother) rather than other terms (e.g. ‘anepsios’) in common use for relationships such as cousin or step-brother – thus he rejects Jerome’s and other patristic interpretations of these relationships. ”   In view of the legal status of adoptees, I think it may be inferred that the word used for “brother” might also include these.  \nA summary extract on his virginal conception:\n“The tradition that Jesus was virginally conceived by the power of the Holy Spirit is also affirmed in both Infancy Narratives.  The truth of the claim, which was hardly verifiable even when Jesus appeared on the public stage as an adult, is a fortiori not open to verification today.  Decisions on this tradition, limited within the NT to the Infancy Narratives, will largely be made on the basis of one’s philosophical views about the miraculous and the weight one gives to later Church teaching.”\n“In any case, the precise origins of the virginal conception tradition remain obscure from a historical point of view. A counter-tradition that Jesus was illegitimate is not clearly attested until close to the 2d century AD; it is most likely a mocking, polemical reaction to the claims of the Infancy Narratives, perhaps as filtered through popular disputes.” \nExtract on his marital status:\n“In the face of all this information about members of Jesus’ family, the total silence about a wife or children is best taken as indicating that Jesus chose the highly unusual – but not unknown – path of celibacy.”  \nIn view of Meier’s rigorously conservative approach to his analysis of the material (i.e. any speculation is absolutely minimal) I feel that his analysis is probably the best we are ever likely to derive on the historical Jesus, until any new evidence might come to light,\n\n","date":"August 21, 2012 at 4:46 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15319","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"If the gospels were ever originally written in Aramaic, we have no way of knowing what the original word for ‘brother’ used in these drafts was, as we only have the Greek.  They were certainly never set down in Hindi or Sanskrit.\n\n","date":"August 21, 2012 at 4:50 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15320","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"To all those interested in this topic:\nBiblical scholar Father Joseph A. Fitzmyer, known as the “scholar’s scholar” in the US, and therefore far superior to John P. Meier in many ways, had the following to say about the Story of the Virgin Birth:\n“If Mary knew from the beginning that Jesus had no human father, why was there only such a gradual development in Christology? It is hard to explain, however, how such a tradition could have developed if it were not based on fact.”  He then expressed support for Fr. Raymond E. Brown, who had written that “the scientifically controllable biblical evidence leaves ( the question of the historicity of the virginal conception ) an unresolved problem.”\nBeing Palestinian Jews Jesus and his disciples spoke Aramaic and not Greek. The view that there was an Aramaic/Hebrew Gospel manuscript that is now lost was once defended by Fr.Jean Carmignac, known and respected by biblical scholars.\n\n","date":"August 21, 2012 at 6:45 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15327","author":"Louis","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"The Peshitta is the Aramaic bible and it includes the OT and NT. It’s popular dogma among Westerners to say it’s based on Greek manuscripts, but the Church of the East has always maintained it comes directly from the apostles in their original language, and they have been rooted in the region where the disciples were first called “Christians” and Thaddeus met King Abgar. I’m not an expert, but there are compelling arguments internal to the texts favoring Aramaic primacy (such as Hebraisms that are lost in translation), at least for the majority of the books (I don’t believe Luke originally wrote the gospel and Acts in Aramaic to Theophilus), nevermind historical. It also beautifully resolves the longstanding problem regarding Yeshua’s genealogy that plagues the Greek Matthew which has led to every kind of tortured logic to explain by apologists (it’s never good to kick off the NT canon with a glaring mistake). Search ‘Response to anti Peshitta Primacy arguments’ for details.\nThe manuscript tradition and integrity of the Peshitta is also superior to the problematic Greek families, something that is widely ignored among Western scholars or dismissed out or hand. Since the days of Jerome, there has been a strong bias to ‘Westernize’ the church in Europe, even to the point of rearranging the order of the NT canon thus obscuring it’s underlying symmetrical design reflecting the 7-branched menorah (see the late Ernest L. Martin’s (who did not argue for Aramaic primacy) ‘Restoring the Original Bible,’ Chapter 1, free to read online http://www.askelm.com/restoring/index.asp). The Church of the East however does not consider 2Peter, 2John, 3John, Jude, and Revelation canonical as they likely were not written when the Aramaic NT was first canonized — evidence of the canonization process is in the NT itself but partially concealed by the Greek translation, go figure), which also destroys the symmetry. A blindness in part on both sides it would seem, but there you have it. Paul Younan’s website Peshitta.org is a wonderful resource with interlinear translations, articles, and forums for more info.\n\n","date":"August 21, 2012 at 10:09 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15338","author":"EGM","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"Thank you for mentioning the Peshitta, which is a new topic for me.  I found the Wikipedia article an informative introduction to it.  It seems to have been a type of Syriac Vulgate finalised in the 5th century from earlier Syriac NT versions.  The claim is made that the OT was a 2nd century translation of the Septuagint, includes the deutero-canonicals, but with Sirach claiming to be translated from the Aramaic,  It is interesting that the Syriac church does not recognise the later NT works (2 Peter, Revelations, etc) as canonical. \nAlthough the claim is made that the original NT gospels for instance were translated from Aramaic originals, I think caution is required here.  The Western consensus seems to be that the evangelists wrote in Greek, with various degrees of literary competence in the koine, e.g. it is said that Mark’s Greek is a bit rough, whereas Luke’s is more literary.  Although Aramaic is likely to have been the native tongue of two of the Synoptic evangelists (Matthew and Mark), Greek was more the lingua franca throughout all of the eastern empire.  If there was a desire that these works be read in the churches, then Greek would likely be the language in which they would be set down.  John’s gospel seems to include Greek concepts, with his emphasis on the logos.  It is an interesting debate, but I feel is somewhat off-topic for a sustained discussion here.  \nI think I would have serious reservations re Ernest Martin’s work, as I suspect it is agenda driven (“Church of God”).  .\n\n","date":"August 22, 2012 at 7:52 am","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15346","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"Actually in “the Gospel of Mark” the Aramaic is Peter’s not Mark’s…\n\n","date":"August 22, 2012 at 10:38 am","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15358","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"I have serious reservations about relying on Wikipedia particularly on controversial subjects (I’ll spare you the personal confrontations with some “admins” there)! Like I indicated, there are rampant biases in this area and it’s easy to pick up on them, but if you persevere and do serious studies with an open mind you’ll find they don’t really hold water. You could liken it to how biased the mainstream media and academic “authorities” are on (mis)reporting the facts on the Shroud with appeals to popular ignorance and oceans of disinformation to wade through. This isn’t the place to address all your misgivings, that’s why I gave out Younan’s website for those who want to investigate deeper and find answers to these things.\nMartin left the Church of God several decades before his death as he grew in faith and knowledge. His research stands up on it’s own as it’s documented to the hilt vis-a-vis Western biases reflected in the theology/bible of the West. I don’t agree with Barrie Schwortz’s views regarding Christ, yet I’m able to objectively value in his research on the Shroud of Christ because it stands up on its own.\n\n","date":"August 22, 2012 at 1:07 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15380","author":"EGM","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"Louis: You are entitled to your view as to the relative merits of Fitzmeyer and Meier, but I don’t necessarily share that.  A quick search on Google brought me to a site where it seems they are of similar minds as far as the word “adelphos” goes.  But I also discovered the curious idea that the Eastern church (Greek?) had a broader understnding of the word. \nI have some recollection that Carmignac may be one of a few Frankish biblicists inclined to reject Marcan priority, apparently a curious ultra-conservative trend.  I don’t think I want to walk there. \nMeier’s credentials: John Paul Meier is a Biblical scholar and Catholic priest. He attended St. Joseph’s Seminary and College (B.A., 1964), Gregorian University [Rome] (S.T.L, 1968), and the Biblical Institute [Rome] (S.S.D., 1976).  Meier is the author of nine books and more than 60 scholarly articles. He was editor of The Catholic Biblical Quarterly and president of the Catholic Biblical Association.  Meier is Professor of New Testament in the Department of Theology at the University of Notre Dame. Before coming to Notre Dame, he was Professor at The Catholic University of America.\n\n","date":"August 21, 2012 at 11:02 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15340","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"Dave, as I wrote in the article mentioned earlier, Meier was awarded two papal gold medals when studying, first biblical studies, then theology, in Rome, however that still does not place him above Father Fitzmyer, who was on the Pontifical Biblical Commission, editor of the (Aramaic) Tobit texts of the Dead Sea Scrolls, authored more than thirty books, taught biblical studies at Oxford, Hebrew and Aramaic at Chicago, was awarded a gold medal by the British Academy, more than fifteen honoris causa, translates aramaic, hebrew, syriac, greek and latin and so on. That is why he is known as the “scholar’s scholar” in the US.\nFitzmyer writes as a biblical scholar, Meier as an “historian”, but the “Jesus of Nazareth” of Benedict XVI (a theologian) has a better explanation of the Resurrection (see the article) than Meier’s. It has already been stated that this event is “less historical” and that I find easy to accept. A good historian will not dodge the question\nIt was a good idea to bring the Peshitta in, however its NT cannot be traced before the fifth century and this is what I have pointed out to Arab priests of the Orthodox Church. Yes, tradition says that Mark wrote as Peter preached.\n\n","date":"August 22, 2012 at 11:07 am","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15366","author":"Louis","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"\nMax Patrick Hamon :Actually in “the Gospel of Mark” the Aramaic is Peter’s not Mark’s…\nI couldn’t disagree with that comment.\n\n","date":"August 22, 2012 at 4:16 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15387","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"But quite likely the Aramaic was orally transmitted, and not necessarily committed to writing.  For what it’s worth, final verses of 1 Peter (assuming it’s authorship is Peter’s) “Your sister (church?) in Babylon (i.e. Rome) … … sends you greeting, so does my son (metaphor?) Mark.  1 Pet  3:13.  (If not Peter’s authorship, at least a tradition that Mark was in Rome with Peter)\n\n","date":"August 22, 2012 at 5:02 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15388","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Another Review of Thomas de Wesselow’s “The Sign”","post":"1 Peter claims to have been set down by Silvanus (3:12).  I wonder if Silvanus and Mark collaborated in setting down Peter’s gospel account?  Are there any linguistic analyses comparing 1 Peter and Mark’s gospel?  Maybe the two forms are too disparate for such a comparison to be made:  two essentially different subjects; 16 chapters in Mark, only 3 in 1 Peter.\n\n","date":"August 22, 2012 at 5:55 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","id":"comment-15390","author":"daveb of wellington nz","site":"shroudstory"}]
