[{"title":"Quote for Today: Stephen E. Jones on Thomas de Wesselow:","post":"Steve,\nThere is no doubt your scholarship on the Shroud is deeper than mine. In terms of serious study, I may have come late to the dance. But I view this controversy has an attorney and a political and environmental activist (and former Vice Chair of the NYS New Democratic Coalition when there was an NDC). That means I sometimes find myself in coalition with individuals who have different world views than mine, sometimes very profoundly different views (i.e. really old Left). My politics come from a dissertation by a man named Matthew which is a part of the book called the New Testament.\nYet, even with people I may profoundly disagree with, I have made common cause on issues we agree on: Merit selection of judges, not invading Iraq, women’s rights, nuclear disarmament. Those are some examples. I hope I haven’t totally lost you with the list.\nTo my analysis there are two issues with the Shroud and they both are extremely important. Ultimately they are far more important for the human condition than any of the others I have worked on or written about, and possibly, you and I would have disagreement. But I am sure you agree with me on these two: The Shroud of Turin is the authentic burial cloth of Jesus Christ and that it offers some proof of his Resurrection. \nThere is another recent book touching on the Shroud by an art historian (this time an Oxonian) Martin Kemp: “From Christ to Coke.” In it Kemp recognized the power of the Christ icon and notes the strange transformation that occurred circa 300 CE when in changed from curly haired Roman or Greek to the Pantocrator. He then disses Ian Wilson’s Edessa theory and opines that the Shroud was the work of a medieval artist from Northern Italy or France.\nIt’s “balderdash,” (That’s a nice anglo-saxon insult. I also like poppycock).\nI haven’t read the book yet but pre-ordered the Kindle from Amazon which won’t be available until next week on this side of the pond. But the fact that an English academic (of sorts, listen to his credentials closely on the U-Tube) dismisses the carbon dating in a well publicized book is no small thing for us. “Politically” our task is to bring to the attention of world opinion that the carbon dating was “tommy rot.” That’s half of the task. As to the second half, the claim that the Resurrection was a mirage created by the Shroud, we can deal with that because it ranks up there  with da Vinci did it with his Leica camera obscura. :-)\nI haven’t seen the whole book, but I’ll take the half that deflates the carbon dating and say “thank you.”\n\n","date":"March 28, 2012 at 7:06 am","url":"https://shroudstory.com/2012/03/28/quote-for-today-stephen-e-jones-on-thomas-de-wesselow/","cat":"books","id":"comment-9719","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today: Stephen E. Jones on Thomas de Wesselow:","post":"Dear Dan and friends,\nIn my opinion it will be near impossible to show the historical evidence that Jesus was resurrected using the analyses of the Turin Shroud. Why ?\nWe can start from the fact that\n                                                 the Resurrection is a Mystery of Faith\nand not a simple scientific fact to show ! Are you able to reproduce a Resurrection in the Lab ?\nIn any case the claims by de Wesselow about the Origin of the Christian Faith are not completely original.\nI refer (for example) to the booklet :\n“The Shroud Was the Resurrection: The Body Theft, the Shroud in the Tomb, and the Image that Inspired a Myth” by John Loken (Paperback – April 16, 2006)\nI have read that strange book some year ago …\nAm I wrong ? How is possible to forget all the past (and present) History (and also the particular image of the Veil of Manoppello)?\n— —\nThe only interesting and reasonable thing that we can underline is the possibility for new dating attempts, with the advanced systems.\nIn this manner we have the solution for the true epoch of that ancient linen and this is an important step.\nHow is possible to reach that solution ?\nI know that there are the new 14C tests (see the work of two Italian teams from National Institute of Optics and from European Laboratory of non linear spectroscopy, Florence. They published a very interesting paper on the high-impact-factor journal “Physical Review Letters” entitled Molecular Gas Sensing Below Parts Per Trillion: Radiocarbon-Dioxide Optical Detection. = They were able to measure 14C concentrations at a 43 parts-per-quadrillion level. Wow !!!) but I don’t believe in the (useless) destructions.\n— —\nHere I cannot write a too long message, so I want to suggest two ways :\n1) the use of the SPMs (= the new advanced microscopies = AFM, CFM, SNOM, used in order to discover the cellulosic Dp value and then the probable epoch)\n2) the use of the new system by Miao and others. There is an article under the address :\nhttp://www1.cnsi.ucla.edu/news/item?item_id=2045547\n“New technique lets scientists peer within nanoparticles, see atomic structure in 3-D”.\nand\nthis is the inherent text :\n>March 21, 2012 – UCLA researchers are now able to peer deep within the world’s tiniest structures to create three-dimensional images of individual atoms and their positions. Their research, published March 22 in the journal Nature, presents a new method for directly measuring the atomic structure of nanomaterials.\n>”This is the first experiment where we can directly see local structures in three dimensions at atomic-scale resolution — that’s never been done before,” said Miao.\n— —\nWhat is your opinion ?\nIs the problem about the cellulosic Dp measurement a sort of enquiring work too difficult to perform ?\nIs it impossible to work (on ancient linen fibrils) without the destructions ?\nSo the question is the following :\nWhat is the level of destruction that we can accept for the Holy Shroud or for the Sudarium of Oviedo (or for both the cellulosic reperts) ?\n— —\nIn any case the 14C tests are more destructive … So, I want to know what are your perspectives.\n— —\nRegards,\nPiero Iacazio\n\n","date":"March 29, 2012 at 10:09 am","url":"https://shroudstory.com/2012/03/28/quote-for-today-stephen-e-jones-on-thomas-de-wesselow/","cat":"books","id":"comment-9748","author":"Piero Iacazio","site":"shroudstory"},{"title":"Quote for Today: Stephen E. Jones on Thomas de Wesselow:","post":"Is there as much controversy or in fact any over the The claim of Islam that Mohammed was taken bodily into heaven after his death/murder?\n\n","date":"April 5, 2012 at 11:02 am","url":"https://shroudstory.com/2012/03/28/quote-for-today-stephen-e-jones-on-thomas-de-wesselow/","cat":"books","id":"comment-9977","author":"Micharl Maher","site":"shroudstory"}]
