[{"title":"Russ Breault:  ‘Here is one gleaning’  from de Wesselow’s Book","post":"“Technically, conceptually and stylistically the Shroud makes no sense as a medieval work” I think that’s pretty clear cut, but I think this statement can be enhanced to add “AND ANY PRIOR PERIOD”‘\nR\n\n","date":"April 14, 2012 at 1:25 pm","url":"https://shroudstory.com/2012/04/13/russ-breault-here-is-one-gleaning-from-de-wesselows-book/","cat":"art","id":"comment-10370","author":"Ron","site":"shroudstory"},{"title":"Russ Breault:  ‘Here is one gleaning’  from de Wesselow’s Book","post":"In 2010, a frenchman named Jacques Bara present a study he did on the internet in a Shroud congress in France.  He search the web and make a close examination of more than 300 paintings done between the 13th and the 16th century and he found three major differences between the image on the Shroud almost each of these paintings.  Here it is :\n1- 99% of these paintings show the nails in the palm of the hands, while the man of the Shroud have them in the wrist area.\n2- 97% of these paintings show the crown of thorns like a headband, while the man of the Shroud have puncture wounds all over his scalp, meaning that he was wearing a helmet of thorns instead.\n3- 98% of these paintings do not show the nudity of Christ, while the man of the Shroud is completely naked. \nThose 3 major differences are well enough to show that it is highly unlikely that the Shroud could have been done by a medieval forger.  I don’t say a medieval artist because the facts concerning the blood alone are well enough to understand that this is not any kind of artwork (you can forget the scorch hypothesis folks !), but, as I said before, the door have be open (even if the opening is not large to say the least) for the possibility that the Shroud could have been made by a forger using a real crucified body.  \nBut even in this highly unlikely scenario, we really have to wonder why in the world a forger like that would have departed so much from the artistic trend of his time (whether it be in the Middle Ages or in Antiquity) ???  That just doesn’t sound logical at all.  If we use the Ockham razor principle here (I really love this logical principle !!!), the most likely answer (by far) is this :  the Shroud is really a genuine burial shroud of somebody that was beaten, scourged and crucified by the Romans just like the Gospels tell us about Jesus of Nazareth.\nI believe that this is the very best scientific answer we can make right now.\n\n","date":"April 14, 2012 at 9:02 pm","url":"https://shroudstory.com/2012/04/13/russ-breault-here-is-one-gleaning-from-de-wesselows-book/","cat":"art","id":"comment-10382","author":"Yannick Clément","site":"shroudstory"},{"title":"Russ Breault:  ‘Here is one gleaning’  from de Wesselow’s Book","post":"“1- 99% of these paintings show the nails in the palm of the hands, while the man of the Shroud have them in the wrist area.”\nI recently discussed this aspect of the Shroud with a well-informed Biblical scholar.\nThere seem to have been two main methods the Romans used for fastening the condemned to a cross; either by binding the arms to the cross-beam or else by nailing, possibly sometimes both.  However there are very few crucifixion nails available, as they were highly prized by the soldiery as some kind of curative talisman.  However there is at least one other nailed crucifixion victim known as a nail was stuck in his ankle bones.  This man had apparently been wrist-nailed.\nThe only gospel reference that informs us that Jesus was fastened by nailing is John 20:25-28, referring to doubting Thomas “Unless I see the holes that the nails made in his hands …”, there seems to be no other gospel reference to the method used  The Greek word for hands transliterates as “kefir’s” which any Gk dictionary translates as “hands”.  However, in Acts 12:8 describing Peter’s miraculous delivery from prison, the same word “kefir’s” is used (.. the chains fell from his hands …).  It is unthinkable that the chains bound only his palms, and three of the four modern translations have “the chains fell from his wrists”.  Evidently the word includes the wrist area.\nI have been unable to drop onto a Latin Vulgate version, but I rather suspect that Jerome translated kefir’s as ‘manus’ rather than ‘carpus’ (= wrist).\nConsequently generations of artists show Jesus as being nailed in the palms, an impossible means of effectively suspending the weight of the body.  Many depictions get around this “suspension of disbelief” by showing him standing comfortably on a little pedestal, which stretches artistic licence a little bit too freely. \n“2.  Crown of thorns”  I understand a now thornless relic of this is said to be in some Paris institute (chuch or museum??) It was supposed to have been in the Louis XIV collection.  Not sure whether its shape is a crown or a helmet.  Of course if it wasn’t secured in place, it might roam around his head and pierce his scalp anywhere.\n\n","date":"April 14, 2012 at 10:39 pm","url":"https://shroudstory.com/2012/04/13/russ-breault-here-is-one-gleaning-from-de-wesselows-book/","cat":"art","id":"comment-10386","author":"daveb of wellington NZ","site":"shroudstory"},{"title":"Russ Breault:  ‘Here is one gleaning’  from de Wesselow’s Book","post":"To go deeper into this topic of the artistic trend of ancient time, here’s another quote from the article of Maurus Green about the ancient history of the Shroud of Turin :\n“A point of special interest is that the nakedness of the original gave the artists pause, since they often provide a loin cloth.  I suggest that we have here important clues as to the treatment of the same Shroud when it was in Byzantine hands, due allowance being made for the more sophisticated, icon obsessed, Byzantine mentality. It is, after all, a major relic with its own in-built icon, but an icon that the Syro-Byzantine clergy could not possibly have exhibited as such during the long centuries of the Christological and Iconoclastic controversies. What success would a naked, horribly wounded, mysteriously blurred, dead Christ have enjoyed in those troubled centuries? Or later when the triumphant HolyImages were the very centre of religion? Hiat negative bleeding death mask would have been an embarrassment to orthodox and heretics alike.  The solution was to have its face copied and turned into living portraits of Christ – Mandylions, the Pantocrator or Christ the Teacher.”\nThis comment is in total agreement with the hypothesis of Paul Vignon who thought that the Mandylion was a false relic made by the Church of Edessa to fight heresies that denied the Incarnation of God and the two natures of Jesus (mainly, his humanity).  Vignon thought that since the Church wasn’t able to show the Shroud to the faithful of that time (because this kind of burial cloth would have been considered sacrilageous and scandalous), a decision was made to make a face copy of a living Christ instead (without any injury or blood stain) in order to have a perfect tool to fight those heresies and be able to “prove” those 2 important dogmas of the Church : the Incarnation and the 2 natures of Christ.\nWe have to understand that, before the 13th and 14th century, there is no example of a realistic artwork depicting the suffering Christ…  During those days (let’s say before the sacking of Constantinople in 1204), an horrible and naked image like the Shroud would have been considered completely sacrilageous and scandalous by the faithful.  We always have to remember the repulsive character that a burial shroud like could have had for the people of the ancient time (please, avoid to look at it through your modern eyes).  That’s the principal reason I don’t believe at all in the Mandylion hypothesis of Wilson.  If there was no blood or wounds in the face region of the Shroud, that could be another story, but since the face on the Shroud is a real indicator of the Passion of Christ, I truly believe (just like Green said in his article and Vignon thought) that this kind of image would have been “religiously incorrect” if the Orthodox clergy would have dare to show it to the faithful before the sack of Constantinople.  \nI know all this sound redundant in my mouth but I think I bring one more argument to defend my position against Wilson’s hypothesis, namely the artistic context of the time versus everything related to the Passion of the Christ !!!\nI leave you with a very good question :  In the context where an image of Jesus in his Passion, as it could be seen on the Mandylion (from the perspective that Wilson is right), was known to the faithful because of public expositions of the relic and his image (important note: in the case of the Mandylion, we know that there have been), how is it then that the hyper realistic character of the visible signs of the Passion on the relic (the crown of thorns, for example) had no influence and has left no trace, over the years, in the Byzantine Christian art related to the Passion of the Christ over the years, from perhaps the fifth or sixth century to the late 12th century ??? \nIn other words, if Wilson’s hypothesis was correct, why we have to wait until the 13th or the 14th century to see the art concerning the Passion of the Christ change drastically and start to show the suffering of Christ with some realism (while the Mandylion is known to have been in Edessa from maybe the 6th century until 944 and in Constantinople from that moment until 1204 at least) ???  And if Wilson’s hypothesis was correct, why the suffering Christ that would have been visible for all to see (during each public showing) would not have been reproduced in any of the many copies of the Mandylion, some of which were done while the relic was still in Constantinople (and we know from the Narratio manuscript that the relic was publicly showed once a year during those days) ???  Doesn’t make any sense at all !\nNote : this period of great change in Christian art in the 13th and 14th century correspond precisely with the first known public showing of the Shroud (not the Mandylion, the Shroud) in 1203 in Constantinople.  I think there’s a great link there !  I think that those public showing (one every friday) reported by Robert de Clari in Constantinople were the starting point of this great wind of change regarding the art related to the Passion of the Christ.  Personally, I estimate that those public showing can well be the first ever public showing of the body images that are present on the Shroud.  That’s were I stand in my reflection…  That’s the main reason why I don’t believe at all in this hypothesis of Ian Wilson.\n\n","date":"April 14, 2012 at 11:08 pm","url":"https://shroudstory.com/2012/04/13/russ-breault-here-is-one-gleaning-from-de-wesselows-book/","cat":"art","id":"comment-10387","author":"Yannick Clément","site":"shroudstory"},{"title":"Russ Breault:  ‘Here is one gleaning’  from de Wesselow’s Book","post":"I just want to summarize my reflexion about the history of Christian art and what it can tell about the hypothesis of Ian Wilson…\nIf there’s one important thing that the history of Christian art (particularly the history of Byzantine art) can tell us, it’s this :  The Image of Edessa, later known as the Holy Mandylion was most probably a cloth with an image of the living Christ, simply because it left no traces and had no impact or influence on any form of Christian art related to the Passion of the Christ (the crucifixes included).  And this is true for all the time that we’re sure this relic was known and shown publicly, i.e. from the 6th century in Edessa until the sack of Constantinople in 1204.\nIn fact, what we can learn from the history of Christian art is this :  Humanity had to wait until the 13th and the 14th century before a Christian artist decide to depict the Passion of the Christ with any sense of realism whatsoever.  At that time, we’re not even 100% sure where was the Holy Mandylion !!!  \nIf Wilson was right with his idea that the Mandylion was the Shroud of Turin folded in 8, there’s absolutely no doubt in my mind that the signs of the Passion that would have been easily visible on the cloth would have left some kind of an impact on the Christian art of the Passion of the Christ.  There’s absolutely no doubt in my mind that the drastic changes of the 13th and 14th century that we can learn from the history of art would have come much sooner if the Image of Edessa (Mandylion) really was the Shroud of Turin folded in 8.  There’s no speculation possible about the fact that the face on the Shroud is a direct and very graphic throwback at the Passion of the Christ and it just make no sense at all that an image like that would not have greatly influenced the Christian art, starting with the Byzantine art, especially all the copies of the Mandylion that were done from the time the relic reached Constantinople in 944 and was showed publicly once every year (the first sunday of the CARÊME).\nAnd, on this particular topic of the copies of the Mandylion, what we can learn from the history of Christian art is this :  Since EVERY copy of this relic show an image of the face of the living Christ on a small piece of cloth (this is an historic fact as good as any other scientific fact), we have to think that the most likely answer to explain this phenomenon is simply the fact that this is exactly how this relic looked like !!!   \nConclusion :  if we use Ockham razor, along with the precious helps of the history of Christian art (especially the history of Byzantine art), in order to analyse properly the hypothesis of Ian Wilson about the Mandylion, it is as obvious as the nose in anyone’s face that the most likely answer is this :  The Mandylion was a small cloth showing only the face of a living Christ with no signs of injuries and no traces of blood on it.  No speculation at all is needed to reach this conclusion !!!  As Maurus Green wrote in his article (I say it in my words) :  This is the most prudent conclusion we can reach for the moment and we don’t have the right to change this conclusion.  Not until new document or artwork can be found and that would bring such evidence (not speculative arguments) that it will force us to change this conclusion.  \nFinally, I would say that there’s one more aspect of the Mandylion that the history of Christian art is able to tell us.  It is the very probable influence that this relic had on Christian art related to the living face of Christ.  In my opinion, this is where we can see some historical evidence of an influence that the Mandylion had on Christian art.  No doubt that this relic was the catalyst, along with the Christ Pantocrator icon, that greatly helped to reach an uniformity (we can also say “reach a standard”) in all the depictions of Christ after the 6th century.\nTHAT’S WHERE THE INFLUENCE OF THE MANDYLION CAN BE SEEN WHEN WE STUDIED THE HISTORY OF CHRISTIAN ART WITH AN OPEN MIND AND NOT SOME BIAS MIND.  Sorry but there’s absolutely no traces of an influence that this relic had on the Christian art related to the Passion of the Christ, proving that this cloth had absolutely nothing to do with the Passion of the Christ.  As a matter of fact, history of ancient documentary sources can totally confirm this !  Effectively, there is no, I repeat, absolutely no ancient writer (whether it’s Saint John Damascus, the emperor Constantine VII or anyone else) who have include the Image of Edessa or the Holy Mandylion in their list of the relics related to the Passion of the Christ.  I repeat it again to make sure you understand this most crucial FACT (again, this is an historic fact as good as any other scientific fact) :  In all the ancient lists related to the Passion of the Christ, there’s absolutely none of them that include the Image of Edessa or the Mandylion in them, while there’s plenty that include a shroud of Christ or, sometimes, burial cloths of Christ (in plural).  \nAnd to understand that it is completely normal that those lists of relics exclude the Mandylion, all you have to do his listen the message proclaim very loud by the history of Christian art :  The Mandylion was a relic of the living Christ that had nothing to do with his Passion and death !  Direct consequence of this conclusion :  This cloth had nothing to do (at least, not directly) with the Shroud of Turin.\nThat’s it folks !  That’s where my extensive research and reflection have leaded me.  Now it’s up to you to make up your mind about the hypothesis of Wilson.  At least, you now have the other side of the historical coin that Wilson and all his disciples do not want you to know (and/or don’t even want to look at this other side of the coin themselves) !!! \nTo conclude this long summary, here’s a personal message I want to address to M. Breault and all the other fans of Wilson’s hypothesis :  If it’s true that you’re really interested by the history of Christian art, I really hope you will consider with great care, and with a very open-mind, all the facts, evidences and reflections that I give you in this comment (and in the other one I’ve written yesterday) !!!  I said it before and I’ll say it again :  On the contrary to Ian Wilson and others who have published papers and books to defend his hypothesis, I have personally absolutely nothing to gain by telling you what I consider as truth, except the pure satisfaction of maybe elevate a bit the debate and maybe “force” some open-minded people (I’m sure there are some) to reconsider what they, until now, have consider as an solid truth. \nWho knows ?  Maybe some will start to see things differently ?  Personally, I’ve reach the point where I have no other choice than to find another hypothesis that can properly and logically explain the dead silence of the ancient sources regarding a shroud of Christ that would bears the entire body images of Jesus.  It’s true, before the testimonies of Nicolas Mesarites and Robert de Clari at the beginning of the 13th century in Constantinople, there’s absolutely no ancient document that specified that there was an entire body image of Jesus on his burial shroud.\nDeep down in my mind and also in my heart, I know that Wilson’s hypothesis about the Mandylion IS NOT THE ANSWER to this great mystery (note :  this is a mystery only for us who believe the Shroud of Turin is authentic).  The bottom line is this :  I have to search elsewhere !!!  Where ?  I have some ideas right now but I’m far from reaching the point where I can claim to have found a coherent and complete hypothesis…  I have an ego but he’s not that big !!! \nYannick Clément, the truth seeker ! :-)\nP.S. :  I know very well that my point of view is somewhat of a pain in the *ss for many people around here, but sorry, I can’t keep quiet !!!  No way.  Simply because I trust my judgement about this subject.  And what I want people to realise the most is this : the Mandylion hypothesis is very far from having win the right to be considered an authentic theory accepted by most historians !!!  VERY FAR.\n\n","date":"April 15, 2012 at 5:52 pm","url":"https://shroudstory.com/2012/04/13/russ-breault-here-is-one-gleaning-from-de-wesselows-book/","cat":"art","id":"comment-10415","author":"Yannick Clément","site":"shroudstory"}]
