[{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"In my opinion, I neither accept the coin, flower (or writing) on the Shroud.  This is my personal opinion and has nothing to do with Shroud research by experts in this area since I am not an expert.  \nHis presentation in his area of expertise really adds to the body of knowledge about the Shroud.  I quite enjoyed his presentation.  \nHis inabilities in other areas & his opinion about a Maillard reaction are not relevant for Shroud studies, but offer his own personal opinions.  Everyone is entitled to hold their own thoughts on the Shroud, but areas in which one is not an expert are generally irrelevant in terms of Shroud studies unless confirmed by an expert.  \nOne example of this happening is the Benford-Marino studies which were eventually supported by experts in their respective fields.\n\n","date":"June 14, 2015 at 5:07 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202123","author":"Dcn Andy","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Some bad news for Shroudies who rely on the authenticity of the Shroud to believe in Jesus’ resurrection. Today’s best biblical scholars reject form criticism and one must remember that    Vincent Taylor remarked in 1935 that if the form critics were right the eyewitnesses to the history of Jesus must havê ascended to heaven immediately after Jesus’ resurrection.\nIn 1 Cor 15: 6 Paul mentions five hundred believers at the same time “many of whom”, he says, ” are still alive”. That was like saying, “If you don’t believe me, ask them.”\nFirst scripture, second relics.\n\n","date":"June 14, 2015 at 7:24 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202166","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"I don’t follow Louis’ thread here at all. \n“Form criticism:  a method of biblical criticism that seeks to classify units of scripture into literary patterns (such as love poems, parables, sayings, elegies, legends) and that attempts to trace each type to its period of oral transmission. The purpose is to determine the original form and the relationship of the life and thought of the period to the development of the literary tradition.”  Encyc Brit.  \n“Form criticism has become one of the most valuable tools for the reconstruction of the preliterary tradition. This discipline classifies the literary material according to the principal “forms”—such as legal, poetic, and other forms—represented in its contents, and examines these in order to discover how they were handed down and what their successive life settings were until they assumed their present shape and position. In their various ways laws, narratives, psalms, and prophecies are amenable to this approach. By this means some scholars have undertaken to recover the ipsissima verba (“very own words”) of Jesus by removing the accretions attached to them in the course of transmission. The exegetical task assumes a threefold shape as scholars work back from (1) interpretation of the present Gospels through (2) interpretation of the tradition lying behind them to (3) reconstruction of the proclamation of Jesus.”  (Etc, etc) \n“… best biblical scholars …”  In whose judgment?  Has there been no advance in biblical criticism since 1935??\n\n","date":"June 14, 2015 at 11:20 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202190","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Daveb has not understood that a distinction has to be made between oral tradition and oral history and relies on Encyclopaedia Britannica to drive a point home.\nIn the oral period, since it was in the period of living memory, the eyewitnesses have to be taken into account, something that the form critics did not do. They neglected the factor of living memory and treated the period between the events and the Gospels as a very long one.\nAs for his question, “best biblical scholars… in whose judgment”, the question has been answered on another thread and here is one link:\nhttps://www.academia.edu/12850351/Book_Review_The_Interpretation_of_Scripture_In_Defence_of_the_Historical-Critical_Method\nNow this is not to say that the historical-critical method should be used alone. It has to be used with other methods although it is the most promising one in view of what we now know about Near Eastern societies and literature.\nDaveb also makes a serious mistake In the thread “Also because of the Shroud of Turin” by claiming that Matthew wrote for the gentiles. It is the exact opposite. His gospel is the most Jewish one and he demonstrates a thorough knowledege of the Torah and Tanakh and, more, his language has even judged to be “synagogue Greek.”\n\n","date":"June 15, 2015 at 8:54 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202237","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"I believe I understand the distinction between oral tradition and oral history well enough.  It is true that I prefer well-established reputable authorities in drawing on my references rather than what might happen to be the current flavour of the month.   \nRe Matthew’s gospel:\nMatthew is the first in order of the four canonical Gospels and is often called the “ecclesiastical” Gospel, both because it was much used for selections for pericopes for the church year and because it deals to a great extent with the life and conduct of the church and its members.  \nThe Gospel grew out of a “school” led by a man with considerable knowledge of Jewish ways of teaching and interpretation. This is suggested by the many ways in which Matthew is related to Judaism. It is in some ways the most “Jewish” Gospel. Striking are 11 “formula quotations” (“This was to fulfill what was spoken by the prophet . . .”) claiming the fulfilment of Old Testament messianic prophecies. \nConcerning the Matthean Church:\nMatthew is not only an original Greek document, but its addressees are Greek-speaking Gentile Christians. By the time of the Gospel According to Matthew, there had been a relatively smooth and mild transition into a Gentile Christian milieu. The setting could be Syria, but hardly Antioch, where the Pauline mission had sharpened the theological issues far beyond what seems to be the case in Matthew. \nMatthew has no need to argue against the Law, or Torah, as divisive for the church (as had been the case earlier with Paul in Romans and Galatians, in which the Law was divisive among Gentile Christians and Jewish Christians), and, indeed, the Law is upheld in Matthew (5:17–19). For Matthew, there had already been a separation of Christianity from its Jewish matrix. When he speaks about the “scribes and the Pharisees,” he thinks of the synagogue “across the street” from the now primarily Gentile church. Christianity is presented as superior to Judaism even in regard to the Law and its ethical demands.\nThe Matthean church is conscious of its Jewish origins but also of a great difference in that it is permeated with an eschatological perspective, seeing itself not only as participating in the suffering of Christ (as in Mark) but also as functioning even in the face of persecution while patiently—but eagerly—awaiting the Parousia. \nThere is much more, but the above will suffice.  Yes, Matthew’s gospel is marvellously well-informed in its anchoring in the Torah and Tanakh, but it was written for what is essentially a gentile church!\n\n","date":"June 15, 2015 at 4:02 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202265","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"That’s funny, this is the first time I read that Matthew was written for gentiles. After years of writing on the topic and interviewing top biblical scholars I have never heard anything like this. I will not waste time over this, unwilling to takes lessons in Bible (!), which are meant for amateurs. My suggestion is that a paper should be written defending the view that Matthew was written for gentiles (!) and made available over the Internet.\n\n","date":"June 15, 2015 at 4:39 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202266","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Then you have some catching up to do.  I spent over a year around 2008 studying Matthew’s gospel chapter by chapter in a small group under the direction of a well-qualified scholarly priest, who had specialist training in Boston and elsewhere, currently seconded to teach theology at an Auckland seminary.  His approach tended to be of a more conservative bent than my own preferences.  But he drew on a variety of several different authorities and scholarly sources, giving full coverage to them all thus giving the broadest possible analysis.  I recall that this was one aspect that most of the authorities seemed unanimous.  It needs no ground-breaking paper on the Internet to make the point.  Curiously Encyclopedia Britannica comes to a similar conclusion.\n\n","date":"June 15, 2015 at 5:43 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202270","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"I catch up twenty four hours because I have to write on the topic, particularly about Jesus. I wouldn’t go by what seminary professors teach because each one pursues one line and that was in fact what worried Benedict XVI, but then there is only one Gregorian University.\nSome years ago I went for Sunday mass at the London house of a religious order and saw that there would be not one but two priests who would say the mass. They were on leave from their South American mission and on their way to Scotland and Ireland. The one who preached said some strange thing about where God could be found and invited the faithful to comment if they wished. I just kept quiet and was taken to task by the person who was accompanying me for not saying anything. I had to tell him that if I started to comment the discussion would go on till dinner time and I preferred to have coffee with the padres — including one from New Zealand — after mass since it was already winter in England and it was very cold.\nI discussed religion with the good “sanyasi” Dom Bede Griffiths and we couldn’t reach agreement. I did admire him as a truly spiritual man. On one occasion I was invited for lunch at a Jesuit seminary, preceded by benediction at which Father Jacques Dupuis presided. Thank God he did not preach!\nNow to Matthew:\nIt is almost uncontested that the evangelist is a Jewish follower of Jesus and that his churches had a Palestinian Jewish origin. He was very close to the Jewish milieu of Jesus. His gospel is directed to Jews, so much so that Jacob Neusner used it to write his own book on Jesus.\nThe gospel is said to resemble the type of sacred story Mircea Eliade called “myth”, which is constitutive for the religious orientation of a people or tribe, with the difference that this “myth” is not a story happening hundreds of years ago. It resembles the basic foundational stories of Israel in the Pentateuch. It is a traditional text in which the traditions about Jesus were transmitted without a radical rupture in the cultural and religious milieu.\nAbove all, in such a milieu, the memory that Jesus was a Jew and that he was sent to Israel —- NOT TO THE GENTILES — (Matthew 10.5-6) could be preserved.\nSo, what would Matthew be doing among the goyim, the gentiles?\n\n","date":"June 15, 2015 at 7:21 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202278","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Not that I have any expertise in this area, and have read only moderately in this area, but I thought Matthew was aimed at the Jews, rather than Gentiles\n\n","date":"June 16, 2015 at 12:22 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202306","author":"emma08","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"That’s exactly what I have been saying from the beginning.\n\n","date":"June 16, 2015 at 9:11 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202351","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"I watched the entire Thomas De Wesselow  presentation.  Excellent. I saw artwork I have never seen before and I have seen a lot of paintings of Jesus.  Anyone out there that thinks this is easy,  hire someone to video tape your one hour presentation on The Shroud and see how it comes off.   It is much harder than one would think.  You cannot fumble your lines or make mistakes.  Must be very focused. He does a very good job.  Impressive. \nThe #1 prime suspect for committing the “Image act” has always been Mr. Paint.  He has been interviewed and re interviewed by detectives over & over again through out the centuries.  Likely waiting for the phone to ring right now,  “I have meet with detectives again about this Shroud Image”  “They still think I did it’\nHe claims to be innocent,but there is always the type of person, that wants to bring him in again for questioning and force a confession out of him.   “We know you did it”\nThis video,  In a comparison analogy, (a bit exaggerated perhaps) but it is not unlike having  the prime suspect in a capital murder case  (Mr. Paint in this case) captured on a video surveillance camera in another State at the time the act/murder took place, eliminating him as being possible of committing the act.\nLine up the suspects\n1. Mr.Paint (Interviewed 1000’s of times)\n2. Mr. Imprint/Contact Image   (By genuine body or 3d or 2d material object)\n3. Mr. Ammonia  (A Gas)\n4. Mr. Light\nOne of the 4 is responsible.   Or a combo such as Mr. Light and Mr. Ammonia.\nBut, who is the mastermind behind the image act?\nShroud Image is\n1. Cunning\n2. Baffling\n3. Subtle\n4. Powerful\nWhich of the 4 suspects is the most cunning, baffling, subtle and powerful?\nMr._______     Deep down inside we all know who is responsible for the image act.\nTrust what your gut feeling/ inner voice/ is saying.    It’ obvious.\nOnly 1 of the 4 suspects meets all of the qualifications necessary to commit this “crime”\n\n","date":"June 14, 2015 at 10:31 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202185","author":"Dave Hines","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Courtauld-trained art historian Thomas de Wesselow did a good job in demonstrating why the Shroud image is not a painting. As an agnostic he was then faced with the problem in explaining the image formation and concluded that the image was interpreted as the Resurrection. That was his big mistake:\nReview_The_Sign_by_Thomas_de_Wesselowhttps://www.academia.edu/10819998/Book_\nThe empty tomb, and one should add our Shroud, if it really was the burial cloth, would be meaningless without the appearances. Paul makes that clear in 1 Cor, where he does not refer to tomb or burial cloth.\n\n","date":"June 15, 2015 at 8:08 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202234","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Dan off topic but….in your profile you say it is possible to make images that look similar to the Shroud image. Can you provide an example?  I am yet to see an image that looks similar in any meaningful way\n\n","date":"June 16, 2015 at 2:51 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202317","author":"Thomas","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Hello Thomas, God willing I will have an image on linen to similar to the Shroud within 30 days to show you.  The reason for the delay is money.   Holography equipment is expensive, but I have the money now.  Anyways, image qualities.\n1.Blood Stains 1st.\n2. Blood Stains On Pure LInen Herringbone Weave Fabric\n3. Ultra thin coating of starch fractions and pectin on fabric and over the blood stains.\n4. Holographic Image residing only in the micro thin layer of starch fractions and pectin and not exceeding primary cell wall of fabric\n5. Image not visible when lit from the back.\n6. Image not visible from certain angles, but is visible depending on the angle of light it is viewed in.\n7.A hologram on linen. \n  I believe the Image of Edessa, “the image not made by human hands” had more dramatic holographic qualities than the present day Shroud. That is why it was called  “the image not made by human hands, because no one in that time had ever seen a hologram on linen before, even in this day and age would be a odd sight,  Over the centuries the once dramatic holographic qualities Shroud have faded over time, and only a remnant of those holographic observations can be seen in this day and age.\nHere is testimony that supports what I just stated is true.  \n “ I therefore had the good fortune to see the Shroud in close up for a whole day. When this sheet was enrolled on a long table (with light coming only from one side of the room where there were windows high up),\n I realized that everything that I had learned up to that point was worth nothing: the image that I thought I knew was not that one. While photography has the advantage of fixing an image in time and of concentrating it so that whichever angle you look at it from, it will remain the same, with the Shroud that is not the case. Moving around that table (lighting under an angle from one side only!), from a certain angle I saw this image so faded as if to practically disappear, while from others it seemed as if the figure WAS ALMOST OUTSIDE THE SHEET: it was, I repeat, an incredible emotion. At that moment I knew that this image was unique”\nHe continues on with these comments…\n“The image on the Shroud appears more distinct at a distance and fades when viewed at certain angles, particularly as one comes closer to the\nShroud. The image is faint, without well-defined boundaries so the eye has no point of reference and it appears simply as variation of the background density. In addition, you’re viewing only a small portion of the entire image up close. In a way, it is out of context and it is only\n as you back away that it is seen as part of the bigger picture that gives it meaning. This is the classical explanation of this observation.\n HOWEVER, it is also a HOLOGRAPHIC OBSERVATION. If you stand in front of a large hologram, where thanks to the angle of the lighting you are\nable to see the image, and you back up or come close or go to the side for that matter, the image becomes very vague or disappears completely”\nI am posting this video I made as evidence that supports my proposition that the Image of Edessa and The Shroud of Turin are the same image.   A holographic Image.\nMy corroborating witness is a English Gematria Calculator.\nGematria /ɡəˈmeɪ.tri.ə/ is an Assyro-Babylonian system of numerology later adopted by Jews that assigns numerical value to a word or phrase in the belief that words or phrases with identical numerical values bear some relation to each other or bear some relation to the number itself\n1. 3D Hologram of Jesus =1128\n2. Behold The Image of Edessa =1128\n3. First 3D Hologram Made= 1128\n4. 3D Hologram of the King= 1128\n5. 3D Scourge Wounds= 1128\n6. Son of God Hologram= 1128\n7. Shroud of Turin = 1128  Jesus of Nazareth = 1128\nIt is only 7 minutes long, it is worth every second of your time to view it or I would not have posted it.  \nIn closing I think Thomas De Wesselow is 100% correct when he proposes that people saw the Shroud and believed Jesus was resurrected and did not actually see Jesus.  Others did see him personally.   Again a combination of both, not one or the other.  As in image formation is a combo of factors,  part contact, part non contact image.\n \nI\n\n","date":"June 18, 2015 at 6:56 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202702","author":"Dave Hines","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Agree Louis. De wesselow’s analysis of the art history is compelling but his attempt to explain the image and in particular its supposed influence on the foundation of Christianity is frankly nonsense.\nHe is a very articulate art historian. He should stick to his knitting.\n\n","date":"June 16, 2015 at 2:55 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202318","author":"Thomas","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Thomas, it is something like the Emile Zola’s approach when he went to Lourdes.\n\n","date":"June 16, 2015 at 9:13 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202352","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"“the resolution is incompatible with a mechanism involving gaseous diffusion.”\nany reference?\n\n","date":"June 16, 2015 at 9:14 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202353","author":"anoxie","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Hi\nIt is unlikely that gaseous diffusion could cause such a high resolution image. Another question that can be posed, assuming that the Shroud did wrap the dead body of Jesus, is:\nwhy should it only have happened in this case?\nSee question 11:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"June 16, 2015 at 10:26 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202359","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Question 11 i can read:\n“Professor Fanti proposed a spatial resolution of 4.9 mm, which is generally accepted by Shroud scholars.”\nBack in feburary 2013 i answered:\nhttps://shroudstory.com/2013/02/10/paper-chase-mtf-resolution-4-90-5-mm-and-all-that/\nThe Shroud has a millimetric resolution but Fanti’s method is irrelevant.\nConcerning the reachable resolution through gaseous diffusion, there is no specific explanation in your interview.\n\n","date":"June 16, 2015 at 10:47 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202362","author":"anoxie","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Reminder for anoxie: when it comes to the dorsal and ventral body images/imprints their optical resolution is  4.9-5.0 mm but when it comes to the blood decals, their optical resolution is 0.4-0.5 mm, that is about ten times higher.\n\n","date":"June 17, 2015 at 4:45 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202476","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"I did not bring up this point because J. Jackson’s explanation about image formation sounds convincing. The discussion was restricted to the Maillard reaction and in this case too the question raised above (why only Jesus?) also applies.\nR. Rogers thought about Maillard as a possible alternative, He was a good scientist, however he did make some mistakes and appears to have been guided by his worldview: anything but a supernatural explanation. See:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"June 16, 2015 at 11:28 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202364","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Sorry but resolution is a critical point. Before tackling other “mistakes” made by Rogers, maybe you could address the first one properly: resolution, otherwise it is a widespread misconception, and a rumor spread over and over in these threads and posts.\nI quote Paolo Di Lazzaro in your interview:\n” As far as I know, there is no evidence that the Maillard reaction can produce such a tiny detail.”\nCome on, the resolution is NOT CONSTANT on the shroud and the best resolution is reached on CONTACT points such as the lips/mustache.\nGaseous diffusion being the distant mechanism, it doesn’t mean there is necessarily a distance between the body and the shroud, this is the basic misunderstanding Fanti has made in his analysis of a diffusion mechanism.\n\n","date":"June 16, 2015 at 12:20 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202370","author":"anoxie","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Did you read J.Jackson’s paper? The mistakes made by R. Rogers, particularly when it comes to pollen, can be read in the interview with G. Fanti, the link to which is given above.\n\n","date":"June 16, 2015 at 12:44 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202374","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Rogers was a chemist, Fanti a physicist, i would first consider their views on Maillard reaction and gaseous diffusion, then on pollens, evolution and the meaning of life.\n\n","date":"June 16, 2015 at 12:53 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202376","author":"anoxie","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Fair enough.\nYou must have read their views about Maillard. Assuming that we are really talking about Jesus’ burial cloth, was he the only one not entitled to an air conditioned tomb?\nDo you have a proposal about gaseous diffusion?\n\n","date":"June 16, 2015 at 1:36 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202378","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"One thing our religious friend Louis seem to avoid noticing is the FACT that natural transfer mechanisms like the Volckringer pattern effect for example, is able to produced good resolution images of very tiny objects, so I think it is highly premature to discard Rogers’ hypothesis on that basis, especially when you consider another important fact: before dying, Rogers didn’t had time to fully test his hypothesis and, since that time, we still wait for someone to take over the job and test it more deeply…  Sorry for the supernatural fans out there but Rogers’ hypothesis is here to stay as a possible answer for the Shroud image until someone could test it under various environmental conditions and prove it wrong.  We’re very far from there.  It’s very hard to fully test such a complex hypothesis because we don’t know the exact conditions that were present Inside the Shroud and Inside the tomb during the time Jesus’ body stayed in the tomb.\n\n","date":"June 16, 2015 at 1:44 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202379","author":"Yannick Clément","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"“sorry for the supernatural fans out there”. So you don’t believe in the supernatural Yannick? Therefore you don’t believe in the resurrection?\nIf you believe in the resurrection then you can’t dismiss the possibility of a supernatural explanation for the Shroud.\nI for one am open to naturalistic explanations. but am also open to supernatural ones. As long as I retain faith in the resurrection of Christ, that won’t change.\n\n","date":"June 17, 2015 at 1:57 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202458","author":"emma08","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"“I did not bring up this point because J. Jackson’s explanation about image formation sounds convincing.” Is this the vanishing body explanation? It may sound convincing to you, but to me it is wholly unconvincing. Being convinced is obviously somewhat subjective…\n\n","date":"June 16, 2015 at 12:24 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202371","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Hugh: “Vanishing body explanation”. Did I refer to that? No, I didn’t. The reference was to the cloth-to-body distance and the high resolution.\nBy the way, what did you think about the “forgery” you saw in Turin?\n\n","date":"June 16, 2015 at 12:51 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202375","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"The body-to-cloth ‘distance’ image recording is a myth alike the vanishing body (Jackson’s Cloth Collapse theory cannot work because the hair, eyebrow arch, beard and moustache images on the back and front side of the linen cloth are capillar not radiative images. In other words, they are not “superficial images” but in the thickness of the linen fabric and do completely run through the material (capillary action). They are dried fluid images punctually resulting from some more significant yet partial pressure of smaller shrouds that were tightly closing the top of the long inner winding sheet. This is pretty obvious ONLY when the said areas are observed in transmtted light or from photograph taken in transmitted light (see 1988 Riggi photographs). Actually, the “double superficiality” is very limited as it only refers to part of the face and maybe hands. It would be fit in rather rather neatly not only with evaporation gradient hypothesis but also tighter wrapping-up in shrouds and some more significant cloth-to-body/body-to-cloth pressures in these most specific areas.\nMost likely, the volumetric recording of the stiff rigid bloodied body (with minor distortions) on the obverse side of the TS, results from an in-soaked inner cloth-to-body skin sticking-gradual-unsticking transfer mechanism (contact and gradual loss of contact through fumigation (and hyperthermia?) = drying and shrinking linen cloth-to body skin slight DISTANCING), the body being tightly wrapped up in shrouds and placed in extra height on two stones or piles of granulized myrrh bags, first on its left then its right side. Most likely the TS man was not laying on his back when the bloodied image of his body was recorded on his drying and shrinking alkaline water in-soaked inner burial winding sheet.\n\n","date":"June 16, 2015 at 3:03 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202386","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Sorry to misunderstand you, Louis. The ‘vanishing body’ hypothesis is Jackson’s explanation for the cloth/body distance observation.\nCan I ask for some opinion about ‘high resolution’ we keep hearing about. The resolution is not at all high. The resolution is poor. The fat that one smudge can be seen as the edge of the lower lip does not justify the complete absence of any nipples, fingernails, navel and so on, all of which would be expected from an image of any good resolution.\nThe Shroud in Turin was truly amazing, but probably not for the right reasons. From the moment one entered the reception area, some half a mile from the exposition, to the moment one was debouched back into the piazza, there was not one single indication that the Shroud had anything at all to do with any religion, let alone Christianity, let alone that it might be authentic, except for a few panels describing the lives of some saints mostly associated with Turin. The words Jesus, or Christ, any religious context at all, were scrupulously avoided. The explanatory pamphlet and the short film describing the Shroud did not mention anything at all about what we might be going to see – even the trickles of blood from the hair were described as ‘from thorns’ with no mention of a crown. The route to the Cathedral reminded me forcefully of the access corridor to Gate 43 from the Departure Lounge of Brussels airport, which I had recently visited, and so carefully were the visitors shielded from the interior of the Cathedral that it was difficult to be sure that one was actually in one unless one was very observant. The Shroud itself hung in a limbo of blue frame hovering amid deep red curtains, and the only sign of any respect were a pair of armed civilian police. The route out was equally shrouded, followed by another airport corridor, and an exit which made it quite difficult to work out which building we had actually been into. The illumination of the Shroud, which is heavily blue accented to increase image contrast, was so flat that one could not honestly say whether one was looking at a cloth, a photo of a cloth, or even a projection.\nNo, I forget, there was a brief prayer from somebody while we were in its presence, in which I caught the word Jesu, and it may be that the Italian versions of the pamphlet and film were more reverential.\nNow have a look at some of Charles’ pictures of expositions from the past. Now that’s what I call an exposition of a sacred object.\n\n","date":"June 16, 2015 at 2:45 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202384","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Hugh, I can understand what you felt in Turin. That is because, as the late Daniel Raffard de Brienne told me, the relic is not part of the Deposit of Faith. I think the relic is authentic but am open minded, my faith, at least, does not depend on relics, and as I have said more than once, if the Man of the Shroud is indeed Jesus, it will still not answer many questions relating to existence. Some of the world’s best Bible scholars have now started to move in a different direction, something they should have done decades ago. They were prompted by discoveries in science that tell us about missing links between religion and science. The direction they are taking will probably pave the way for a convincing systematic theology.\nRome and Turin should make the Shroud available for another hands-on examination. Will they do it? I don’t think so. Why? Partly because of what is going on in the midst of the Shroud crowd.\n\n","date":"June 16, 2015 at 3:35 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202387","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"It seems likely that the European Space Agency’s laboratory Rosetta with its lander Philae will have a complete analysis of comet 67P, now 308 million km from Earth, chemical analysis, physical properties, spectral signatures, details of possible precursor life-forming organic molecules, relaying the data to earth and 67P will display its sun-driven shower trail, before refreezing over as it recedes into outer space on its return journey.  All before the masters of comedy in Piedmont can draft an outline scientific programme of research for the  holy object that has been under their noses these last 500 years.  Would it make any difference if we sent the Shroud into a 308 million km orbit? \nPhilae report:\nhttp://phys.org/news/2015-06-philae-wake-up-triggers-intense.html\n\n","date":"June 17, 2015 at 2:30 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202463","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"This was on WNBC this morning\nhttp://www.today.com/video/centuries-old-debate-over-shroud-of-turin-authenticity-persists-465947203892\n\n","date":"June 17, 2015 at 8:38 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202500","author":"John Green","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Hugh wrote: “Can I ask for some opinion about ‘high resolution’ we keep hearing about. The resolution is not at all high. The resolution is poor. The fat that one smudge can be seen as the edge of the lower lip does not justify the complete absence of any nipples, fingernails, navel and so on, all of which would be expected from an image of any good resolution.”\nReminder for Hugh: when it comes to the double body image/imprint its optical resolution is 4.9-5.0 mm but when it comes to the blood image, its optical resolution is 0.4-0.5 mm, that is about ten times higher. Actually the TS bloodied image is a large high resolution image/imprint.\nBTW, Ian Dickinson in his ‘Preliminary details of the image of the umbilicus on the Shroud’ (see CIELT, Paris. no.1) said it was possible to discern the TS man’s navel imprint.  There is apparently  no fingernail imprints not only because of the presence of air-gaps and flowers around the hands but also because the latter slightly slided underneath on the image formation process. I personally can discern the image of crushed nipples.There is no penis image, just guess why.\n\n","date":"June 17, 2015 at 5:58 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202482","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Typo: see RILT n° 1, Paris.\n\n","date":"June 17, 2015 at 6:10 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202486","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"I wish I knew what people mean by a resolution of 5mm. Grab a pencil and draw the outline of the arms. How precise is it? 30mm, I reckon. The fingers and face are a bit better, but a contact image precise to an accuracy of 5mm is not good resolution, it’s poor. One of the arguments against the Shroud being some kind of bas relief rubbing is just that – its resolution is so poor. \n“I personally can discern the image of crushed nipples.” Quite possibly, and no doubt other people can guess too – but the chances of their guesses coinciding to with 5mm are very small indeed.\n\n","date":"June 17, 2015 at 6:52 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202490","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Reminder for Hugh: \nThe optical high resolution of the details of the TS body images –at least as good as 0.5 cm (see L. A. Schwalbe, R. N. Rogers, “Physics and chemistry of the Shroud of Turin, a summary of the 1978 investigation,” Analytica Chimica Acta 135, 3-49, 1982 and J. P. Jackson, E. J. Jumper, W. R. Ercoline, “Correlation of image intensity on the Turin Shroud with the 3-D structure of a human body shape,” Appl. Opt. 23, 2244-2270, 1984) or even approaching 0.1 to 0.2 cm (see V. D. Miller and S. F. Pellicori, “Ultraviolet fluorescence photography of the Shroud of Turin”, Journal of Biological Photography, 49, 71-85,1981)– suggests a contact-and-gradual-loss-of- contact mechanism of transfer to account for the integrity of blood clots of which optical high resolution of their details is as good as 0.04-0.05 cm that is ten times higher than the body image details). \nOptically speaking, what do you consider is the minimum for “high-res”?\n\n","date":"June 18, 2015 at 5:43 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202613","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Yes that’s what they all say, and perhaps I misunderstand them. Can we detect collarbones or the Shroud image? Ribs? Kneecaps? You don’t need a very high resolution to see these clearly on images of people, and the Shroud shows none of them. I don’t know how the resolution of an image of a body should be quantified, but I do know that the Shroud isn’t very very high, regardless of what Schwalbe and friends think, unless, as I say, I misunderstand what they mean by a resolution of 5mm.\n\n","date":"June 18, 2015 at 4:21 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202681","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Hugh, \nMethinks you mistake the TS (bloodied) body image deficit and poor resolution, which implies most obviously you do not have a very deep descriptive knowledge of the said (bloodied) body image. \n– Re the absence of collarbones: actually, the TS man’s face show many an image deficit implying air gaps and/or presence of screening objects (most likely here three wooden pieces sawn off the very titulus damnationis were used as an impromptu small “jaw box” creating a detached floating head high resolution imprint with no neck). The vertically panoramic image of the space under the TS man’s chin image (with beard compressed) that misleadingly looks like the latter’s neck is currently missed by most shroudie and anti-authenticists you included).\n– Re ribs:  the TS man’s pronounced convex curvature of the spine (lordosis) is recorded too along with the blood rivulets running to the two sides of the small of the back.\n– Re kneecaps: there are contusions on both knees and cuts on the left kneecap, \nHow long shallI repeat if the body imprint resolution is 4.9 to 5 mm (or even approaching 1 to 2 mm for V. D. Miller and S. F. Pellicori) that of the blood image is 0.4 to 0.5 mm. This is high resolution indeed for a large image.\n\n","date":"June 18, 2015 at 6:44 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202701","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"In other words was is really poor is your descriptive knowledge of the TS bloodied body image not its resolution of details.\n\n","date":"June 18, 2015 at 7:00 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202703","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"“How long shall repeat…” Don’t repeat at all, Max. If I don’t understand what you say, I’ll ask for clarification. If I disagree, then simply repeating it won’t change anything. In your post above you have vaguely explained why the Shroud image has such poor resolution; you have not demonstrated that it has good resolution. If it’s any help, many of the blood marks have very clear edges and can be said to have a resolution of a millimetre or so. If you and I both drew an outline of the wrist wound mark, for example, our two drawings would be unlikely to be different by more than a millimetre in any place. The same could be said of many other blood flows, but not the contusions. It could not be said of almost any feature of the image, except possible the line of the lower lip, although the X-Ray teeth adherents don’t even agree with that.\n\n","date":"June 19, 2015 at 2:01 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202741","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Imaging is still a problem, complex points are involved, and we cannot jump to hasty conclusions. See Paolo Di Lazzaro’s response to question 8 and his exchange with Barrie Schwortz. Reference 19 is a paper that was presented in Bari.\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"June 18, 2015 at 7:13 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202704","author":"Louis","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Hugh,\nLazzaro wrote “it is not easy to make a definition of the spatial resolution of a faint and faded/fuzzy image like the body image on the Shroud. However, based on the inverse Fourier transform of the negative image of the lips of the man of the Shroud (which is the smallest detail we can see), several years ago Professor Fanti proposed a spatial resolution of 4.9 mm, which is generally accepted by Shroud scholars.”\nThe true fact is the TS image in not a mere body image (optical resolution limit 4.9 to 5 mm) but a 3D encoded/volumetric bloodied body imprint (optical resolution limit 0.4 to 0.5 mm). If the limit of optical resolution definition is the capacity of an optical system to resolve point objects as separate images, when it comes to very partial and tiny Pilate coin obverse impressions (which is the smallest details I can see of the blood decals), the optical resolution limit is 0.4 to 0.5  mm. I personally measured it in 2008. Compared to Volckringer patterns, the TS body image is fuzzy most likely because of the presence of ‘opaques’ in (Judean desert and/orJerusalem limestone) dusts and the relatively short duration of the image formation process (about half an hour’s drying via fumigation and maybe hyperthermia).\nSince you claim the bloodied body image resolution is poor, I have asked you “Optically speaking, what do you definitely consider is the minimum for “high-res”?” and am still waiting for your answer\n\n","date":"June 19, 2015 at 5:01 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202764","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Correstion: Compared to Volckringer patterns, the TS body image is fuzzy most likely because of the presence of ‘opaques’ in (Judean desert and/orJerusalem limestone) dusts and the relatively short duration of the image formation process (about half an hour’s drying via fumigation and maybe hyperthermia) not to mention slight shifts and displacements.\n\n","date":"June 19, 2015 at 5:05 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202765","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"You are still explaining why the resolution is poor rather than substantiating the opinion that it is good. Prof. Fanti did indeed say that the edge of the lower lip of the image was well defined, and I agree with him. The rest of the face is less so, and the rest of the body a mere blur. optically speaking a well defined Shroud image would be one around which it would be possible for different people independently to draw outlines of various features (e.g. arms, legs, eyes, fingers) and when superimposed they should not differ by more than a millimetre or so. I said that before. That’s my answer.\n\n","date":"June 19, 2015 at 8:11 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202780","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"Still waiting for you giving telling me what do you definitely consider is the minimum for “high-res”?”. Methinks you haven’t the foggiest notion of what is optical high resolution when it comes to life like volumetric image. The BLOODIED body image has an optical resolution limit of 0.4 to 0.5 mm. Do you really think it is poor resolution? Are you kidding?\n\n","date":"June 19, 2015 at 8:32 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202788","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Stephen Jones on the Thomas De Wesselow Presentation","post":"N.B. I mean the BLOODIED body image very partial and tiny Pilate coin obverse impressions included.\n\n","date":"June 19, 2015 at 8:39 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","id":"comment-202790","author":"Max patrick Hamon","site":"shroudstory"}]
