[{"title":"Newly Published Thomas de Wesselow Video","post":"Boo, America only.\nDan – any novel ideas beyond those already stated in his book?\n\n","date":"July 10, 2014 at 4:16 am","url":"https://shroudstory.com/2014/07/10/newly-published-thomas-de-wesselow-video/","cat":"art","id":"comment-136711","author":"Thomas","site":"shroudstory"},{"title":"Newly Published Thomas de Wesselow Video","post":"Thomas, i can’t see this video either, but don’t expect anything. Beyond his claim, as a medieval art historian, that the shroud is not a work of art, all his theory about “the sign” is a waste of time.\n\n","date":"July 10, 2014 at 4:29 am","url":"https://shroudstory.com/2014/07/10/newly-published-thomas-de-wesselow-video/","cat":"art","id":"comment-136715","author":"anoxie","site":"shroudstory"},{"title":"Newly Published Thomas de Wesselow Video","post":"Thomas de Wesselow did some good work in the sense that, like Yves Delage, who was an agnostic, he spoke out in favour of the Shroud’s authenticity. At least he has shown the world that Shroudies have not wasted their time.\nHowever, since “Resurrection” is “Out” most of the time, many Christian theologians dismissing the event, or interpreting it in a way that is very different from the traditional Christian approach, others pretending that they believe in it when they don’t, he put forward what in his view was an explanation. It is being honest.\nOf course, in my view it is only the appearances of the risen Christ that provided the impetus for the budding Jesus movement, a convincing explanation for the transformation of its members, who became ready to be flogged, stoned, crucified upside down, eaten by lions and the rest.\n\n","date":"July 10, 2014 at 8:06 pm","url":"https://shroudstory.com/2014/07/10/newly-published-thomas-de-wesselow-video/","cat":"art","id":"comment-136918","author":"Louis","site":"shroudstory"},{"title":"Newly Published Thomas de Wesselow Video","post":"There is no explanation for the Resurrection of Jesus. The faith response to the Resurrection is to believe Jesus is alive in a new life with God and if you follow Jesus the same good thing can happen to you. Faith is both a decision and a gift from God. Your comments imply that you are critical of the judgment of people who do not believe in life after death. Would you criticize someone who says, “God hasn’t given me the gift of faith”?\n\n","date":"July 10, 2014 at 8:42 pm","url":"https://shroudstory.com/2014/07/10/newly-published-thomas-de-wesselow-video/","cat":"art","id":"comment-136926","author":"David Roemer","site":"shroudstory"},{"title":"Newly Published Thomas de Wesselow Video","post":"I do not equate the Resurrection with life after death of human beings. It signifies something much more deeper.\n\n","date":"July 10, 2014 at 10:39 pm","url":"https://shroudstory.com/2014/07/10/newly-published-thomas-de-wesselow-video/","cat":"art","id":"comment-136952","author":"Louis","site":"shroudstory"},{"title":"Newly Published Thomas de Wesselow Video","post":"I never heard that before!!??? What more is there to believe in other than that when we die our past is somehow gathered up and it becomes the defining moment of our lives? We can hope for salvation with fear and trembling. Salvation means some kind of perfect fulfillment based upon our experiences.\n\n","date":"July 10, 2014 at 11:58 pm","url":"https://shroudstory.com/2014/07/10/newly-published-thomas-de-wesselow-video/","cat":"art","id":"comment-136964","author":"David Roemer","site":"shroudstory"},{"title":"Newly Published Thomas de Wesselow Video","post":"Let me go a little more deeper: why do we have to think only about whether we survive death or not? What about the rest of creation?\n\n","date":"July 11, 2014 at 11:10 am","url":"https://shroudstory.com/2014/07/10/newly-published-thomas-de-wesselow-video/","cat":"art","id":"comment-137112","author":"Louis","site":"shroudstory"}]
