[{"title":"Press Center for The Sign by Thomas de Wesselow","post":"…..I’d say his press people need to get this out. From the gas that’s been put out on online blogs, I instinctively would run a mile from this book. Its not that I’m not interested – I am – but spurious soundbites and reportage put this book with a pile of other nonsensical books on this subject. The way “art historian” has been banded about in fast and loose terms witha  breath of “disbelief” suggested he was a grad student. Suddenly having read this – i’m intererested. Not sure I’ll agree but have read Kindle passage online – suddenly i’m interested. if i was de wesselow i’d tell the mighty gods of Penguin to get this out – and fast\n\n","date":"March 29, 2012 at 12:16 pm","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","id":"comment-9751","author":"Alexis Tinton","site":"shroudstory"},{"title":"Press Center for The Sign by Thomas de Wesselow","post":"Facts… mixed with rubbish and a vivid imagination.\n\n","date":"March 29, 2012 at 12:28 pm","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","id":"comment-9752","author":"john","site":"shroudstory"},{"title":"Press Center for The Sign by Thomas de Wesselow","post":"yeah – i’ll pass judgement once ive read a bit of it. I try not to pay any attention to some of the hysteric flatulence out there. The title is all wrong – the UK cover makes it look lke a Dan Brown ripoff. wierd. and wrong.\n\n","date":"March 29, 2012 at 12:33 pm","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","id":"comment-9753","author":"Alexis Tinton","site":"shroudstory"},{"title":"Press Center for The Sign by Thomas de Wesselow","post":"I’m glad to read your comments Alexis and John !  It proves that there’s some people around here that can keep their feet on the ground !  \nI’ve just look at the preview on Youtube and it’s seem evident to me that it’s another (there’s too much to count them) example of what I call “Shroud recuperation” !!!  It seem to me (to my regret) that this kind of thing is always growing and growing in intensity !  And what is even worst is that this “Shroud recuperation” is only one part of a greater spectrum of rubbish that I call “Jesus Inc.” !!!  It’s amazing to see all the money that many people are willing to do on the back of jesus !!!  Everything that touch Jesus seem ok to make a buck and the Shroud is a thing that is very popular these days among this kind of people (simply because they know it sell well) !!!  \nIt’s completely disgusting to see this (in fact, this is completely anti-Christian because it’s the complete opposite of Jesus teaching)…\n\n","date":"March 29, 2012 at 5:00 pm","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","id":"comment-9767","author":"Yannick Clément","site":"shroudstory"},{"title":"Press Center for The Sign by Thomas de Wesselow","post":"Oh, by the way, in the first line of the preview, there’s already an historical mistake !\nIt is written that, 2000 years ago, the DEATH of a man gave birth to a new religion…  WRONG !!!  It wasn’t the death of Jesus that gave birth to Christianity but is RESURRECTION !!!  I won’t spend 2 cents on this book !\n\n","date":"March 29, 2012 at 5:03 pm","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","id":"comment-9768","author":"Yannick Clément","site":"shroudstory"},{"title":"Press Center for The Sign by Thomas de Wesselow","post":"In any occurrence whether natural or supernatural there’s the phenomenon itself and there’s the interpretation of that phenomenon.  The “press release” site has about 70% of the phenomenon right and about 30% of it wrong. As for its interpretation as an object which the early church viewed “animistically” and so explains why it believed that Jesus was resurrected, this is reductionist, speculative and inadequate.\n1) It asserts a “Vatican-dictated protocol” in sampling resulted in the botch of the C14 sampling.  Wilson in his 2010 book demonstrates quite the reverse.  The Vatican’s well-qualified Professor Carlos Chagas proposed a well-researched protocol using seven labs using both the old Libby method and the new AMS method.  He was no match for Turin’s Luigi Gonella, a street-wise polytech lecturer less qualified than Chagas.  It was Gonella’s and Cardinal Ballastrero’s decision to limit the testing to the three AMS labs, all clones of each other, and the decision for the sampling swatch resulted from merely a two hour spontaneous wrangle immediately prior to the sampling.\n2)  The assertion that the image results from a Maillard type vapourgraph has yet to be proven.  Some attempts to research this have been made, but so far results have not been all that convincing, and a lot more work is required before this can be conclusively demonstrated.  It is not clear how a vapourgraph could encode 3-D information.  As the image is pixellated and confined to the crowns of the fibres, some kind of contact process seems more likely.\n3)  The press write-up seems to make little mention of some of the historical aspects which must also be considered in any work claiming to be a complete explanation. \nIt seems that Wesselow has grasped at a few key elements from the scientific studies and has then extrapolated these to come up with his own subjective and speculative interpretation, which fails to explain why the apostles and early church were prepared to die for their conviction that Christ had truly risen from the dead.\nSo if it’s ever proven that the Shroud is indeed the burial cloth of Christ, this is what the agnostics’ judgment would look like in interpreting the result.\n\n","date":"March 29, 2012 at 5:12 pm","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","id":"comment-9769","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Press Center for The Sign by Thomas de Wesselow","post":"In the ‘key points and evidence’-section it is claimed that the observation “the Pray Codex miniatures prove the cloth was in existence prior to 1192, long before the date indicated by the carbon-dating” is among the “…own findings” made by Thomas de Wesselow. Isn’t this somewhat absurd? There are a great many books where the same claim has already been made.\n\n","date":"March 30, 2012 at 2:31 am","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","id":"comment-9778","author":"Jos Verhulst","site":"shroudstory"},{"title":"Press Center for The Sign by Thomas de Wesselow","post":"With promotion blurb like that, maybe someone will do him for plagiarism or breach of copyright.  The Publicity Promotion hucksters become too focused on creating a celebrity cult, when in fact the truth is: “It’s not about me! It’s not about you! It’s about Jesus! It’s about God!”  They can’t understand the need to get their focus right.\n\n","date":"March 30, 2012 at 3:30 am","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","id":"comment-9779","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Press Center for The Sign by Thomas de Wesselow","post":"The problem I can see with books like that is the agenda that is evident and that is driven by a “not-so-catholic” ideology.  I just hate to see that but when a buck can be made, it’s evident that you’ll see those kind of books out there…\n\n","date":"March 30, 2012 at 8:29 am","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","id":"comment-9784","author":"Yannick Clément","site":"shroudstory"}]
