[{"title":"Telegraph article on Cambridge Shroudie Thomas de Wesselow","post":"Apparently, there was also an interview in the flemish newspaper ‘De Standaard’\nhttp://www.standaard.be/artikel/detail.aspx?artikelid=MM3NSNTH\nThe Dutch translation comes out together with the English version.\n\n","date":"March 25, 2012 at 6:54 am","url":"https://shroudstory.com/2012/03/25/telegraph-article-on-cambridge-shroudie-thomas-de-wesselow/","cat":"books","id":"comment-9617","author":"Jos Verhulst","site":"shroudstory"},{"title":"Telegraph article on Cambridge Shroudie Thomas de Wesselow","post":"The subject of the Shroud is seen as “toxic” ?? And these are the people who TEACH the next Generation? \nToxic. TOXIC! Why can’t the Shroud simply be, as de Wesselow says: an intellectual puzzle? Which it certainly is! The Shroud has people around the globe baffled and puzzled and even bent out of shape. \nI think somebody could write a book on the psychological impact of the Shroud, because it is obvious there is something about the Shroud that gets people’s nerves all twangled. And why should that BE, I wonder??  Unless…. there really IS a God and He is deliberately trying to goad people into spiritual awareness? \nIf people could set aside their resistance to God and religion, they would see how stupid they are. I’m glad de Wesselow was able to wise up. That’s very encouraging, I have considerable respect for his honesty.\n\n","date":"March 25, 2012 at 11:54 am","url":"https://shroudstory.com/2012/03/25/telegraph-article-on-cambridge-shroudie-thomas-de-wesselow/","cat":"books","id":"comment-9627","author":"AnnieCee","site":"shroudstory"},{"title":"Telegraph article on Cambridge Shroudie Thomas de Wesselow","post":"Did anyone read the full article, which goes deeply into his book and thoughts? I’m definately in opposition to de Wesslow’s theory, it is rediculous to say the least. He suggests in his book that Jesus was never raised, that it was the image on the Shroud that convinced the deciples and not Jesus’s appearances the following 40 days. Furthermore he believes the appearances were an “illusion” and that everyone misinterpretted the image on the Shroud as being the living Jesus LOL. It truly dumbfounds me how rediculously retarded some theories can be.\nThis book will definately not make my list, thank-you.\nOh and for more nonsense and some laughs; read some of the comments to the article, some people are just so angry that this Shroud is here!\nRon\n\n","date":"March 26, 2012 at 2:04 am","url":"https://shroudstory.com/2012/03/25/telegraph-article-on-cambridge-shroudie-thomas-de-wesselow/","cat":"books","id":"comment-9649","author":"Ron","site":"shroudstory"},{"title":"Telegraph article on Cambridge Shroudie Thomas de Wesselow","post":"Angry that the Shroud is HERE? I suppose that is a very strong indication that it truly IS the Sign of Jonah for this generation. I’ve forgotten now who said that… Oh yes, Dr. Peppler. I was so impressed with his statement, I actually wrote it in notes. \nDr. Peppler quotes this verse, which is a perfect description of society now, “A wicked and adulterous generation asks for a miraculous sign! But none will be given it except the sign of the prophet Jonah.” Mat 16:4\nJesus himself said it.  And it’s scary to read it, especially in connection with the Shroud. I think Dr. Peppler was incredibly on-target with that observation.\n\n","date":"March 26, 2012 at 3:01 am","url":"https://shroudstory.com/2012/03/25/telegraph-article-on-cambridge-shroudie-thomas-de-wesselow/","cat":"books","id":"comment-9651","author":"AnnieCee","site":"shroudstory"}]
