[{"id":"comment-38026","author":"chantal_boisselier","post":"The spiting snake is still spitting his venomous prose while minding about my alleged ‘violation of the etiquette’!! Can the alleged ‘man’ stop putting words in my mouth again (a pathological habit of his I presume) Re my Torun paper, .I JUST wrote the SAME THING but in a different expository writing style, THAT’S ALL. Can Dan DO something and STOP Colin Berry making all this VENOMOUS NASTY FUSS about nothing?. Can we mean science and archaeology here for G.od’s sake?.","date":"2013-06-25","mins":"8:18 am","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue"},{"id":"comment-38053","author":"chantal_boisselier","post":"Reminder for Mr Colin Berry from Max Patrick Hamon, former Professeur à l’Université de Riyad: On June 10, 2012 at 1:55 pm (#6 Reply): “BEWARE! What is presented on SST as “2002 Durante Shroud Face Photograph” is actually nothing but a detailed view of the the 2002 overall Shroud photograph as opposed to a genuine Shroud face photograph. Many significant tiny details are lost.” Most obviously besides having a very poor memory, Mr CB does lack a Ph.D. In optical sciences. Within 2 3 weeks (I am very busy at the moment), I’ll ask Dan to kindly publish on his blog two tables (from the intermediary version of my 2011 Torun Paper) unequivocally showing the partial bloodstain patterns/blood imprints of a Pilate coin obverse on each eye. Keep tune (especially ‘Doctor Ignoramus’).","date":"2013-06-25","mins":"2:05 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue"},{"id":"comment-38058","author":"chantal_boisselier","post":"Can ‘Doctor Ignoramus’ discriminate beetween a blood decal and a blood imprint? What if the blood smearing of the two small coins was deliberate and had a meaning in se? What if the Plate coin obverses could be read as a rebus/silent eulogy in Hebrew and/or Aramaic?.","date":"2013-06-25","mins":"2:32 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue"},{"id":"comment-38055","author":"chantal_boisselier","post":"Reminder for ‘Doctor Ignoramus’: I am a professional enigmatic image cryptanalyst who can discriminate between falsely positive perception, falsely negative perception, misreading in terms of non univocal image patterns and the real thing,,which ‘Doctor Ignoramus’ just can’t. A vous revoir..","date":"2013-06-25","mins":"2:16 pm","url":"https://shroudstory.com/2011/10/23/paper-chase-max-patrick-hamon-on-the-coin-on-eye-issue/","cat":"news_&_views","title":"Paper Chase: Max Patrick Hamon on the Coin-on-Eye Issue"}]
