[{"id":"comment-215909","author":"ryan_jaroncyk","post":"Has any other scientist, besides Dr. Tipler, analyzed and interpreted the rough DNA results published in that 1995 Italian journal?.","date":"2015-12-08","mins":"12:55 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215889","author":"ryan_jaroncyk","post":"The late Sir William Ramsay, 19th and early 20th century Oxford archaeologist, once called Luke an ‘historian of the first rank’. This accolade was based on extensive field research confirming the historicity of many people and places in the book of Acts and the Gospel. Luke’s nativity account is relatively simple and unadorned, unlike typical mythological accounts in ancient history. Luke used the Greek word ‘parthenos’ (virgin) to describe Mary when he could have used other terms. The early church fathers were unanimous in interpreting the virgin birth as a real, historical event, not myth. And many of the church fathers were willing to see many different layers of interpretation, allegorical, theological, and historical, in other areas of scripture. And if the virgin birth is myth, where then would you draw the line? Were the miracles of Jesus really myth? Was his sacrificial death just a metaphor? Was his bodily resurrection just a ‘spiritual’ resurrection? Seems like if one is willing to entertain even the possibility of a supernatural, transcendent Creator, then the virgin birth becomes a live possibility as well..","date":"2015-12-08","mins":"7:29 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215908","author":"ryan_jaroncyk","post":"But Joe, how much then do we take as historical? 80%? 50% 25%? What criteria do we use to make such a judgment? Which scholars do we rely upon to make such judgments? Only the critical scholars? What about the views of top moderate and conservative scholars? Matthew and Luke offer the earliest, independently attested reports of Christ’s birth. While differing in the secondary details, they agree in the primary details. Luke is considered a top notch historian by the likes of the late Oxford archaeologist Sir William Ramsay and the late Oxford historian AN Sherwin White. And Luke was likely the most educated of the Gospel writers. And while many modern scholars would probably not place the Gospels in the same category as modern historical biographies, I have read that some scholars do believe the Gospels fit relatively well within the category of ancient Roman biographies. Finally, we have Jesus being called the ‘son of Mary’ in the Gospel of Mark, which is widely considered to be the earliest Gospel. And we have Paul, in the book of Galatians (written about 50 AD), referring to Jesus as being ‘born of a woman’. While the interpretations of these verses can’t be pressed too far, I have read that some scholars believe these could be implicit references to the virgin birth, as it is unusual in Jewish circles to omit the name of the child’s birth father when discussing an individual’s identity..","date":"2015-12-08","mins":"12:52 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215933","author":"ryan_jaroncyk","post":"The short answer is that it would probably cause me to seriously reconsider other key events and doctrines presented in the Gospels. It would also seem to contradict the Apostles Creed, which is accepted by Catholics and Protestants, as well as the Niceness Creed, which is accepted by Catholics, Eastern Orthodox, and Protestants. It would seem to contradict the unanimous opinion of the early church fathers, who weren’t always unanimous on everything. And it would seem to compromise the unique Divinity of Christ, as well as classical Trinitarian theology, though I am not a theologian. And it would seem to contradict the historic understanding of Isaiah 7:14. So yes Joe. It would raise a lot of red flags in my mind if your view were correct..","date":"2015-12-08","mins":"4:59 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"}]
