[{"title":"Guscin, Dreisbach and the Risk of Dot-Dot-Dotting","post":"Assuming that the studies done on the material removed from the feet, nose and knee areas were done accurately, and I see no reason to believe otherwise; it is a very strong point to the authenticity of the Shroud.Taking Mr.Guscin’s observation(s) into account ofcourse .But that is just one of many individual details found on the shroud that no artist would contemplate adding just too ‘fool’ a medieval crowd…Further testing is warranted, if just to appease the nay sayers though. The big question is whether the Vatican during thier 2002 ‘restoration’ left anything to study??. Anyways, since the oviedo cloth was mentioned; I have probably read just about everything I can find on the Oviedo cloth except Guscin’s book “The Oviedo Cloth”, reason; has anyone checked out the going price for that book? OMG it’s unbelievably expensive to acquire!\nRon.\n\n","date":"September 17, 2011 at 4:04 pm","url":"https://shroudstory.com/2011/09/17/guscin-dreisbach-and-the-risk-of-dot-dot-dotting/","cat":"news_&_views","id":"comment-3926","author":"Ron","site":"shroudstory"},{"title":"Guscin, Dreisbach and the Risk of Dot-Dot-Dotting","post":"I just happened to see this. Could I please have a link or reference to where:\n“Linda T.  writes that Stephen Jones, by the way he quoted Mark Guscin, gives the impression that Kim Dreisbach stated that travertine aragonite is further proof that the Shroud is that of Jesus.” \nso that I can see for myself what she claims is the problem caused by my inserting ellipses into the quote?\nHere is my quote at http://members.iinet.net.au/~sejones/quotes/TSoT/stuc0706.html being referred to:\n“I wrote to the Rev A Dreisbach of the AICCSST (Atlanta International Centre for Continuing Study and Exhibit of the Shroud of Turin) to see if he knew anything about the carbon dating of the sudarium in Arizona. Unfortunately, his answer was negative … However, he did make some other very interesting points. In relation to the dust particles on the nasal area of the Shroud, he mentions an analysis carried out on particles from the foot area. He says: `microscopic dirt particles taken from the foot area during the 1978 examination were eventually analysed by Joseph Kohlbek at the Hercules Aerospace Laboratory in Salt Lake City, Utah and found to be travertine aragonite – a rare form of calcite also found near the Damascus Gate (i.e. the one closest to Golgotha) in Jerusalem. That finding was later confirmed by Dr Levi Setti using an electron probe microscope at the Enrico Fermi Laboratory in Batavia, Illinois.’ This interesting information is further proof that the Shroud is that of Jesus, because no forger, either pious or impious, nobody who made a portrait of Christ, for whatever reason, would ever think of including such details, which would have been ignored anyway until this present age with its microscopic possibilities.” (Guscin, M., “The Oviedo Cloth,” Lutterworth Press: Cambridge UK, 1998, pp.78-79)\nThe words of Dreisbach’s that I left out and replaced by ellipses in the above quote were: \n“I regret that I am not informed about the details of Dr Baima Ballone’s `highly contaminated’ sample of the Oviedo Cloth which he had sent as gas in leaky capsules to Dr Paul Damon at Tucson. My best guess would be that he acquired them in 1994 when he was present in Oviedo with that group and Alan Whanger, M.D. of Duke University.”\nAs can be seen, this has nothing to do with the issue of “travertine aragonite – a rare form of calcite also found near the Damascus Gate (i.e. the one closest to Golgotha) in Jerusalem” being found near the feet area of the Shroud, which was the topic of my quote.\nAs can also be seen above is that I added single quotation marks that were not in Guscin’s book to make it clear where Dreisbach’s words ended and Guscin’s began.\nStephen E. Jones\n\n","date":"September 17, 2011 at 8:46 pm","url":"https://shroudstory.com/2011/09/17/guscin-dreisbach-and-the-risk-of-dot-dot-dotting/","cat":"news_&_views","id":"comment-3930","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Guscin, Dreisbach and the Risk of Dot-Dot-Dotting","post":"Stephen, I think I found it. Look at your blog http://creationevolutiondesign.blogspot.com/2007/06/bogus-shroud-of-turin-7-dirt-on-feet-of.html. Look for “That finding was later confirmed by Dr Levi Setti … This interesting.” The single quote seems to be missing after Setti… and one might think that “This interesting” is part of Kim’s words. I think this is what Linda is referring to. Hope that helps and I don’t think it is that big a deal (but it makes for an interesting posting on a slow news day).\nDan\n\n","date":"September 18, 2011 at 5:52 am","url":"https://shroudstory.com/2011/09/17/guscin-dreisbach-and-the-risk-of-dot-dot-dotting/","cat":"news_&_views","id":"comment-3931","author":"episcopalian","site":"shroudstory"},{"title":"Guscin, Dreisbach and the Risk of Dot-Dot-Dotting","post":"F.Y.I…I have a tape recording taken from a Shroud exhibition in BC in  2006 where Rev.\nDreisbach was the sole presenter.   Rev. Dreisbach speaks about the finding of travertine arogonite on the tip of the nose and knees of the man of the Shroud.  It was an unforgettable presentation for many reasons, but this is where I learned first about the soil findings on the Shroud.\nC. Wharton\n\n","date":"February 24, 2012 at 3:03 pm","url":"https://shroudstory.com/2011/09/17/guscin-dreisbach-and-the-risk-of-dot-dot-dotting/","cat":"news_&_views","id":"comment-8677","author":"C. Wharton","site":"shroudstory"},{"title":"Guscin, Dreisbach and the Risk of Dot-Dot-Dotting","post":"Interesting! Thanks for the clarification. I had read they found dirt on the nose and knee areas but was not aware of it being travertine arogonite. Only the dirt of the feet had been mentioned in the finding of such,…..Makes for some interesting contemplation, in as, this assumed forger really put alot of thought and effort into this hoax, didn’t he? ;-)\nThanks again.\nR.\n\n","date":"February 24, 2012 at 10:44 pm","url":"https://shroudstory.com/2011/09/17/guscin-dreisbach-and-the-risk-of-dot-dot-dotting/","cat":"news_&_views","id":"comment-8683","author":"Ron","site":"shroudstory"}]
