[{"id":"comment-212519","author":"daveb_of_wellington_nz","post":"I don’t see that very much of the above discussion has anything to do with the posted article at all, the possibility of an Indian provenance for the Shroud cloth; not the early Church in India, lions eating Christians in Rome, nor the compiling of the New Testament and its associated apocrypha. Hugh Farey alone has raised a relevant issue, the question of whether imported cloths were present at Masada. When a year or two ago, I raised the issue of Diana Fulbright’s paper on the complex weaves evident at the Akeldama site, which included some at Masada, Charles Freeman jumped down my throat asserting that the majority of these were imported and few were in linen. In fact, Fulbright’s paper gives citations indicating that some of the cloths were indeed imported. Frankly, given the trade known to have occurred along the Silk Road, together with far flung Roman garrisons, Jospeh’s original shroud cloth might have come from just about anywhere within the Old World, including Asia and the Russias. Direct contact was unnecessary, as the trade caravans commonly occurred in relay sections, a bit like changing horses in mid journey (or I suppose camels). The presence of imported cloths from faraway places in the ME of the first century cannot be a contentious issue..","date":"2015-10-14","mins":"6:13 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-160191","author":"daveb_of_wellington_nz","post":"In the absence of any known reputable acheiropteios (not made by human hands) image of Christ, the cultural norm would have been to represent Christ and the saints according to the cultural norms of the artisan. The bearded Christ only seems to have become traditional following the emergence of the Image of Edessa around the sixth century. In an oriental culture, Christ would have been depicted with oriental features. I am acquainted with several Maori depictions of Jesus, Mary and Joseph, commonly wearing moko (facial tattoo) huia feather in the hair (signifying chieftainship), and wearing a feathered cloak (sign of royalty), notwithstanding known European depictions. The statues in the early colonial NZ churches normally had light Irish features, usually with blue eyes. Artisan’s motives are not solely religious, they are also (even subconsciously) culturally affirming..","date":"2014-10-07","mins":"3:31 pm","url":"https://shroudstory.com/2014/10/07/an-early-beardless-jesus-with-short-hair/","cat":"archaeology","title":"An Early Beardless Jesus with Short Hair"},{"id":"comment-212496","author":"daveb_of_wellington_nz","post":"I do not see how the detailed history of early Christianity in India might relate to the possible origins of the Shroud cloth in India, except only to indicate that there was communication and transport between India and the Middle East, and consequently trade. This is already well known through the alternative route of the Silk Road, but the article referring to a sea route is certainly an interesting speculation. I’ve occasionally mentioned on this site previously, that it was not necessary for the cloth to have originated in the Middle East, but in view of the active trade routes and the presence of far flung Roman garrisons throughout the empire, that the cloth might well have come from anywhere between ancient Gaul and Afghanistan or even China. In the 4th century BC Alexander had ventured as far east as the Indus Valley. The knowledge of Linen is very ancient and was widely known throughout most of the ancient civilisations, dating back to at least the 5th millenium. An interesting brief article on the history and other aspects of linen by Janis M James can be found at: http://timeless creations.ca/Linen.pdf. Sample extracts: “Domestication of fiber flax to say nothing of seed flax occurred in India and China before that of cotton – more than 5,000 years ago. Some scholars believe that flax originally came from western Persia and spread over to other countries regarded to be the regions of early flax cultivation – India, China and Central Asia and westwards and southwestwards, primarily, to Babylon and Egypt. ” … … ” … … In the regions of early flax cultivation in Central Asia (Afghanistan, mountainous areas of Bukhara, and Turkmenistan) flax cultivation has remained primitive until the turn of the 20th century. / Flax has been known in Russia since 2000 B.C. Ancient manuscripts of the 9th 10th century B.C. Contain evidence of linen made by Slavs. … … ” James also has an interesting picture of some modern linens, but they are based on some ancient patterns which are quite intricate. If it were possible to find some DNA traces in the fibres of the Shroud cloth, then we might speculate on whether it would be possible to identify the likely or feasible origins of the flax..","date":"2015-10-14","mins":"2:15 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-106604","author":"daveb_of_wellington_nz","post":"Louis mentioned this a few days ago Apr 27, report was from a different web site. We both noted that subject identity was still speculative – [Archaeologist Padro says “could be… Jesus”, inscriptions still to be translated]. Conceivable it could be a saint [St Mark supposed to have been in Egypt], If it’s meant to be Jesus, it might only be representational, [Augustine said nobody knew what he looked like] Tombs date to 6th 7th century. Mandylion emerged in Edessa ~540 AD, earliest known icon of Jesus is Christ Pantocrator, St Catherine’s, Sinai, 6th century. No images of finding available yet. Wait and see..","date":"2014-04-30","mins":"6:19 am","url":"https://shroudstory.com/2014/04/30/newly-discovered-very-early-image-of-jesus/","cat":"archaeology","title":"Newly Discovered Very Early Image of Jesus?"},{"id":"comment-193988","author":"daveb_of_wellington_nz","post":"As a plain weave, it cannot be said to be “distinctive 1st century”. The mixture of wool and linen is curious, and would seem to breach Judaic laws mixing the two. Perhaps as a leper, this may not have been objectionable,as he was already unclean. Diana Fulbright’s paper has a variety of shroud types, some also from the 1st century, some of animal hides. There was a wide variety of burial garments in the 1st century, some excessively expensive, to the point where Gamaliel II directed that he be buried in a plain shroud, and this became the subsequent custom, unless the deceased happened to be clothed in his normal attire. The anniversary custom of placing the bones in an ossuary, discontinued after 70 AD, was apparently not intended here, as unusually the tomb was sealed. The 1st century ossuary practice means that few other 1st century Jewish shrouds have survived, and a unique case cannot be said to be typical of anything. Discovery of a single pine box cannot imply that all modern western burial coffins are pine! ..","date":"2015-03-21","mins":"10:46 pm","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-194119","author":"daveb_of_wellington_nz","post":"Thank you for the correction re mixture of wool and linen. I was relying on Fulbright’s quoting of the discoverer, Prof Shimon Gobson in company with James Tabor, and the two types of cloth surprised me. Fulbright herself says that there seemed to be four types of garment, and it wasn’t a shroud at all, as has been incorrectly reported. Yes I can understand how the mixture might be acceptable in the case of a burial cloth, I may have come across this info previously. She mentions that some fabrics are S twist and some Z, but does not make clear whether these refer to wool or linen. I do not see a problem with authenticity merely the fact of the TS being Z twist, nor that it is not plain weave, because of various active trade routes, the possibility that it may have been imported, even from outside of the Middle East. I do not see that it is necessary for the TS to have a Jewish nor Middle East origin in order to be authentic. I may have commented previously that it may just as easily have been put on the Palestinian market by a Roman soldier previously garrisoned in Gaul for all we may know, Babylonian cubits notwithstanding..","date":"2015-03-23","mins":"5:36 am","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-191667","author":"daveb_of_wellington_nz","post":"L: ” Dan posted the piece of news after my suggestion.” See Dan’s posting “The Latest News on the Gospel of Jesus’ Wife” of May 7, 2014, at: https://shroudstory.com/2014/05/07/the latest news on the gospel of jesus wife/ I noted Louis had provided a recent comment there dated Feb 21, 2015, 4:56 pm referring to the CNN article. I read the article authored by Baden (Yale) & Moss (Notre Dame), was impressed by it, and provided my response to Louis there on Feb 22, 2015 at 5:07 am. The fact that we had both seen fit to comment on the article, may have influenced the decision for the present posting. I note that first comment above by Emmett is timed at Feb 22, 2015, 6:18 am..","date":"2015-02-23","mins":"2:38 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191721","author":"daveb_of_wellington_nz","post":"Andy: I don’t think anyone in the debate, has ever argued that Jesus was ever married, including as it happens Karen King. I have wearied myself repeatedly offering plausible explanations for such fragments suggesting he was, and am not going to repeat them again. However a few of us prefer to have something more substantial to make critical decisions for rejection or acceptance of purported fragments, than mere agenda driven religious extremists of whatever side, or for that matter even the gossip from a reputable journo’s OB network, no matter how sincerely such views might be held. The Baden & Moss paper has now emerged, provides a good professionally arrived judgement, and is sufficient to corroborate the fact of fraudulence. That is quite large step from merely having an uninformed opinion about the matter..","date":"2015-02-24","mins":"6:16 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-212522","author":"daveb_of_wellington_nz","post":"The same frequently complains when the thread goes off topic. I knew when I mentioned it, that the usual pompous response was predictable..","date":"2015-10-14","mins":"7:06 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-191580","author":"daveb_of_wellington_nz","post":"The Coptic fragment forgery was quite cleverly done. The papyrus C14 dating was I think about 4th century, and the ink analysis suggested it was of ancient provenance. Karen King is reported as having a feminist agenda, and so was a natural prime target for the deceit, and it seemed to have her fooled. Despite all the agenda driven conservative protests that no way could it be true, I was prepared to maintain an open mind on the issue until stronger proof came to light. There was no doubt in my mind that Jesus was never married. The silence in the gospels concerning a wife, was I considered sufficient evidence. However many early Christian or quasi Christian communities expected an early date for the parousia and refrained from marriage with the natural consequence that they eventually vanished. It occurred to me, as I think it did to King, that if authentic the fragment might have been an attempt in such a community to justify marriage, and that it is all that it could mean, certainly not that Jesus himself was married. However, one purpose of an open mind is to be able to close it when sufficient evidence comes to light. The paper reported by CNN does that, and it seems to have been quite a clever piece of detective work. The fragment includes text from a known forgery, an alleged Gospel of John in a rare Coptic dialect, which died out in the 6th century, but that particular papyrus was dated to the 9th century. The anonymous provenance of the fragment, and the lack of companion fragments, certainly made it suspect. However there now seems little doubt that it was indeed a forgery. I see no connection with the Talpiot case. It is merely a case of forgers exploiting a lucrative market for seemingly ancient scriptural fragments, particularly if they can create a topical sensation..","date":"2015-02-22","mins":"2:42 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191588","author":"daveb_of_wellington_nz","post":"Louis, I stand by what I said earlier, and also what I’ve said now. Tuition is good and can lead to fruitful speculation for further investigation, but until it’s tested it’s still not proof. That has now been done..","date":"2015-02-22","mins":"4:49 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191589","author":"daveb_of_wellington_nz","post":"Typo: Intuition ….","date":"2015-02-22","mins":"4:50 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191624","author":"daveb_of_wellington_nz","post":"Thank you David G, my sentiments too. Karen King has her own perspectives honestly held. But she seemed to be approaching the object put to her in as professional a manner as she was able, within those perspectives. And that’s all there was to defend. Others had their opinion, but they were just as agenda driven as any other. Anyone can be a target for gulling. Truth eventually won out; It might just as easily have fallen the other way..","date":"2015-02-23","mins":"4:34 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"}]
