[{"id":"comment-154683","author":"daveb_of_wellington_nz","post":"I was able to download the paper to TS folder on my hard drive from Adrie’s jesusking site (Dan’s Alternate Link above). But it took about 24 minutes for the full 18.3 MB. I guess her site was busy with others like minded..","date":"2014-09-24","mins":"12:13 am","url":"https://shroudstory.com/2014/09/23/a-bold-conclusion-the-blood-the-image-the-man/","cat":"blood_studies","title":"A Bold Conclusion:  the Blood, the Image, the Man"},{"id":"comment-12763","author":"daveb_of_wellington_nz","post":"Wilson “The Shroud” 2010, plate 9d shows a three thonged flagrum, with two pellets end of each thong; picture credit says it was reconstructed after Vignon – preumably this means the type of weapon that Vignon envisaged from his examination of the scourge images; plate 9c shows a Roman coin Herculaneum ~100 BC T. Didias, gladiator is using a two or three thonged flagrum against an opponent. Vignon claimed that taller man stood on the right and that shorter man stood on left and had a tendency to whip the legs; they could also aim their flagra to whip around to the front of the body and leave scourge marks there. I’m not aware that Vignon ever identified marks left by the fascia typically used by lictors, as do F & F. I see a difficulty in interpreting the results as F & F have used Photoshop type imaging enhancement techniques to obtain their images, even to the extent of eiiminating the background herring bone (fishbone sic) weave – the pixels have moved! Question has to be “Are we seeing fascia type marks, or are we seeing an unsought byproduct of the claimed image enhancements?” I suspect it may need some further corroboration, before conceding that F&F have definitely identified previously unrecognised injuries..","date":"2012-06-20","mins":"6:41 am","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-12855","author":"daveb_of_wellington_nz","post":"So the sciencebod throws his toys out of the cot yet again, but he’ll be back, he can’t leave it alone, it’s all part of the Great Plan, the Hound of Heaven will catch up with him eventually, ” … with unhurrying chase, and unpertubed pace, deliberate speed, majestic instancy, Come on the following feet … ” He’s caught up with others, He’ll catch Colin yet! Saint Jude patron saint of hopeless cases and lost causes, often seen holding the image of Edessa, sometimes a carpenter’s rule, or would that be a test tube, I see. Saint Thomas was also a doubter, But he gave us his testimony. Am I raving? Possibly. But I’ll still keep praying for hopeless cases!.","date":"2012-06-21","mins":"6:12 am","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-11031","author":"daveb_of_wellington_nz","post":"Colin would know better than any of us that Na Cl is highly soluble in water, along with its ions. Surely only one dowsing would be enough to wash it all away. Or am I missing something here? Refer “The Shroud” Wison, 2010, Fig 1a & Fig 12 show two separate incidents of water damage, the first probably from some unknown storage condensation in an earthenware jar, the second from dowsing to extinguish the 1532 fire. Absence of Na Cl may therefore be no kind of indicative argument; On the other hand any presence of Na Cl could hardly be taken as corroborative of anything, I should think. Is there any way that Na Cl could be retained on the cloth, particularly the blood stains, if it was dowsed? Only if that’s possible can Colin’s query then have significance!.","date":"2012-05-01","mins":"7:00 am","url":"https://shroudstory.com/2012/05/01/blood-question-wheres-the-salt/","cat":"blood_studies","title":"Blood Question: Where’s the Salt?"},{"id":"comment-213942","author":"daveb_of_wellington_nz","post":"It puzzles me a little why Jesus would find it necessary to spontaneously emit neutrons as part of his resurrection process, and how he might be able to do that when he was dead. I would tend to consider resurrection to be an entirely miraculous event and of divine origin, and once resurrected, he would not find it necessary to emit neutrons to aid the process any further. If there is anything at all in the neutron hypothesis, then I wonder if it might have a natural origin due to the presence of seismic induced radon, which has a relatively short half life. The image is clearly that of a corpse, pathologists asserting that rigor mortis is still evident, and not at all as what one might imagine a glorified resurrected Christ might appear. I am not persuaded that the repair hypothesis can be dismissed so easily, partly because of Ray Rogers’ findings, nor am I persuaded of the validity of the C14 dating because of the extremely poor sampling regime. If any of the pollens or other organic debris accumulated some time soon after the resurrection, then they ought not to have been affected by any such neutron emission, and it might be possible to date these accurately, perhaps at some time in the future with further developments in the technology. Possibly some of the debris might then show some consistency with a 1st or 2nd century provenance..","date":"2015-10-30","mins":"4:47 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-213943","author":"daveb_of_wellington_nz","post":"Piero’s suggestion that the effects of neutron emission on linen, its possible effects on C14 dating, the conversion of its nitrogen content, and testing for any image formation in the laboratory seem worthy of consideration and ought to be demonstrable..","date":"2015-10-30","mins":"4:52 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-213972","author":"daveb_of_wellington_nz","post":"Sampath, I agree with Matthew L. Your ref to Mat 22:30 was a reply Jesus gave to the Sadducees in response to an attempt to trap him, seven brothers who serially married the same woman all leaving her widowed; At the resurrection, ‘Whose wife shall she be?’. Jesus replied, “At the resurrection they neither marry nor are given in marriage but are like the angels in heaven.” Angels do not marry! After his own resurrection, Jesus did not appear to many as an Angel as stated by you, but appeared to have a special kind of body which could be touched and do things that a bodily person can, things that pure spirit cannot. St Paul also refers to a bodily resurrection, “We shall all be changed”, and he refers to a glorified body. It is not merely a spiritual resurrection..","date":"2015-10-31","mins":"2:43 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214184","author":"daveb_of_wellington_nz","post":"222 Radon from the Friday earthquake being 7.5 times heavier than air would settle in the floor of the unventilated sealed tomb. Its decay process would emit alpha particles. Matthew 28:1 2 asserts another earthquake occurred on the Sunday morning resulting in the stone being forced from the entrance (an occurrence common enough to those familiar with earthquakes), more radon, and more alpha particles!.","date":"2015-11-04","mins":"3:18 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214056","author":"daveb_of_wellington_nz","post":"I note that of the three items listed by Bob Rucker as a possible effect of neutron emission, image formation does not appear to be included, but the items are more generally related to the possible effect of skewing the C14 dating. I am uneasy about the emission of neutrons from the body as being part of the process of resurrection. It looks too much like pseudo science and also too much like pseudo theology. It remains untestable, and to conceive it as part of the resurrection process strains my credulity. Nevertheless a source of atomic particles as a result of radioactive decay is available, and which might add some credibility to their skewing of the date. All four gospel accounts relate the occurrence of an earthquake. John’s gospel takes it further than the synoptics and attributes an aftershock to the moving of the stone set and sealed into the tomb entrance on the instructions of Pilate at the instigation of the Jewish priests. That all four gospels mention an earthquake suggests to me that it was more than a mere literary device but was in fact a real occurrence. Since about 1980, 222 Rn has been identified as a significant cause of background radiation. It accounts for most of the exposure from background radiation, and is considered the most serious cause of lung cancer among non smokers, particularly for those living in enclosed spaces of lower floors of apartment buildings. It has a half life of 3.28 days. Radon is apparently the only known radioactive gas, and the health risk arises because the daughter products of the decay process are solid particulates, mostly isotopes in the lead chain. 222 Rn is a daughter product of the decay of radium, itself a daughter product of the decay of uranium. It is released from within the ground during earthquakes, and has been investigated as a possible precursor of earthquakes. I have a question for Bob Rucker. Can he envisage that 222 Rn released from within the tomb as a result of an earthquake might produce the effects that he postulates may have occurred as a result of neutron emission? I respectfully suggest that pursuit of this origin of atomic particles might yield a more scientific basis for his theory. I also note that Giovanna De Liso in her seismic investigations of image formation, only ever obtained her images when Radon was detected..","date":"2015-11-01","mins":"5:12 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214130","author":"daveb_of_wellington_nz","post":"Robert, Thank you for your considered reply. I would note that radon gas is said to be about 7.5 times heavier than air, and is a sealed tomb without ventilation would seem unlikely to disperse, but would settle in the lower parts of the enclosed space, in depressions, and particularly so if the floor happened to be recessed below the sealed entrance. After a few days, the quantity would be reduced partly by decay, and no doubt by some dispersion. Whether it might have any bearing on affecting the properties of the cloth could no doubt be investigated. Certainly De Liso claimed that she only ever obtained images when radon was detected as being present. I would comment that Radon is a specific real source of radioactivity, known to occur, whereas neutron emission from a dead body is not, nor is it known whether it is a necessary concomitant of the resurrection process. To Sampath: Simply by googling on “Radon Palestine” and “Radon Jerusalem” several public health investigations and scientific papers came to light, showing that radon was of some significant risk there, not only in the air but also in the drinking water, specific locations being the Gaza strip, Bethlehem, and notably in a Talpiot school, and also various other locations, and sufficient to be of some concern to the health authorities there..","date":"2015-11-03","mins":"4:39 am","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214206","author":"daveb_of_wellington_nz","post":"The earthquake after shock moved the stone, see Matthew 28:1 2. Fortuitous, so the absence of the body could then be more easily witnessed..","date":"2015-11-04","mins":"1:49 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214223","author":"daveb_of_wellington_nz","post":"John, a short lesson in EQ 101: Earthquakes are a regular occurrence in NZ, and EQ Engineering had to be one my specialties. Occasionally we get a big one. There are four kind of waves according to their motion. The P waves are the compression tension waves, a bit like sound waves and arrive first. At an escarpment or cliff, the release of the P wave at the face will hurl rocks and boulders several metres, maybe even up to 20m in a big quake. The tomb rock was sealed against the tomb entrance. Not too difficult to see why the stone shifted. Matthew calls it an angel, which suits his purpose and their understanding of this sort of occurrence..","date":"2015-11-04","mins":"8:20 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-214225","author":"daveb_of_wellington_nz","post":"Sampath, see my response to John G above..","date":"2015-11-04","mins":"8:22 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-200414","author":"daveb_of_wellington_nz","post":"I don’t think so. To validate any claim of anti authenticity, it is necessary to postulate a credible craft process to achieve all the properties of the image. That does not look like succeeding any time soon, despite all the efforts being made to achieve it. The authenticist can claim it was an unknown natural process, or else a miracle, neither of which are admissible by the anti authenticist..","date":"2015-05-28","mins":"6:16 am","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200474","author":"daveb_of_wellington_nz","post":"I should think that if I were in the position of Dr Freeman, I should be concerned at the likely adverse effect on my professional reputation than “to publish in a recognised specialist textile journal”, an hypothesis which so contradicts what is scientifically known about the nature of the image, a superficial oxidation limited to the crowns of the threads, reducible by diimide, the absence of any signs of painting whatsoever, a realistic image of a human corpse which lacks any artistic precursor, with no evidence of any similar artifact, and an hypothesis which lacks the slightest support of any scientific corroboration and lacking any intent to research the same..","date":"2015-05-28","mins":"7:06 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200449","author":"daveb_of_wellington_nz","post":"I should be curious in knowing what both Hugh and Charles make of the pattern of water stains that predate the 1532 fire, and analysed by Aldo Guerreschi which he presented on British TV in 2004, and his explanation that it is consistent with accordian folds and stored in an earthenware jar as were the Dead Sea scrolls which also happened to survive a similar efflux of time. There is no known record of the TS being stored in such a way post dating 1355. However I would not doubt that either of them would be capable of dreaming up some alternative self satisfying scenario..","date":"2015-05-28","mins":"3:54 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200542","author":"daveb_of_wellington_nz","post":"I think it’s fair to say that most of the popes were all men of their age and attempted to deal with the problems of the universal church of their time as best they could. That was the case with St Pius X, and for that matter all those who came after him. However that is not to say that everything a pope has to say on any such matter is necessarily infallible. I have before me from my youth an old battered soft cover copy of “The Papal Encyclicals in their Historical Context” written by Anne Fremantle in 1958, which I still value for its content. In the early 1900s, sound doctrine was in peril as a result of a movement within the Church which sought to follow the extremes of a certain German Protestant trend which saw much of the New Testament as mythology. Certainly there is mythical content there, but Christianity is founded on definite historical events, centred on the life, death and resurrection of Jesus Christ, and its saving power for humanity. The response of Pius X was to issue his encyclical “Pascendi Dominici Gregis” in Sept 1907, condemning what he called “Modernism” and which included a list of proscribed propositions. Reviewing Pascendi now in the 21st century, a few of these propositions now appear quaint, of no great moment, and seem to be from another age which has now passed. The reforms of the Second Vatican Council of the 1960s, which sought to make the Church more relevant to its presence in the world, seemed to pose a threat to those of an ultra conservative mind, who sought to freeze the expression of belief and practice in a single moment of time, that which prevailed from a past age. Out of this we saw such movements as the St Pius X society, the Lefebvre movement, a dogmatic attachment to the old Tridentine rite, a refusal to acknowledge the validity of any subsequent popes, and various other signs, which saw any advance from the 1900s as pure heresy. Thus Donald Sanborne condemns Pope Benedict XVI as a modernist, disrespectfully calling him “Ratzinger” with little acknowledgement of his proper religious title. It is a nasty little piece of polemical writing. This is notwithstanding that many of us can recall Cardinal Ratzinger in his role as head of a doctrinal congregation as seemingly extremely conservative in his care for sound doctrine, as demonstrated in his treatment of such writers as Hans Kung for instance. As Pope Benedict XVI, he reached out to those who had fallen away under the Lefebvre spell, and sought to reincorporate them into the universal church. Small thanks he had for it if we are to judge from such writings as those of Donald Sanborne, who would seem to prefer a church confined to the irrelevance of a past age, with no real witness for Christ in the present world..","date":"2015-05-29","mins":"3:51 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-200366","author":"daveb_of_wellington_nz","post":"Nitrogenous pigments: Tetrapyrroles, porphyrins, and their derivatives: A biologically important class of water soluble, nitrogenous 16 membered ring, or cyclic, compounds is referred to as porphyrins. The elementary structural unit of all porphyrins is a large ring itself composed of four pyrrole rings, or cyclic tetrapyrroles. This basic compound is known as porphin. Porphyrins combine with metals (metalloporphyrins) and protein. They are represented by the green, photosynthetic chlorophylls of higher plants and by the hemoglobins in the blood of many animals. Porphyrins: Many invertebrates display in their skins or shells porphyrin pigments (or salts of them), some showing fluorescence (i.e., the emission of visible light during exposure to outside radiation). In addition, various porphyrins occur in secretory and excretory products of animals, and some kinds, predominantly the phorbides, which result from the breakdown of chlorophyll, have been recovered from ancient natural deposits such as coal and petroleum and from muds of long buried marine and lacustrine strata. Ooporphyrin is responsible for the red flecks on the eggshells of some plovers and many other birds. The African turacos (Musophagidae) secrete a copper salt of uroporphyrin III into their wing feathers. This deep red pigment, turacin, is readily leached from the feathers by water containing even traces of alkali. The green plumes of these birds owe their colour to the presence of turacoverdin, a derivative of turacin. Hemoglobins: Hemoglobins are present in the red blood cells of all vertebrate animals and in the circulatory fluids of many invertebrates, notably annelid worms, some arthropods, echinoderms, and a few mollusks. The hemoglobin molecule consists of a heme fraction and a globin fraction; the former consists of four pyrrole moieties (porphin) with a ferrous iron (Fe2+) atom in the centre. The globin fraction is a protein that may constitute more than 90 percent of the total molecular weight of hemoglobin. Hemoglobins have the capacity to combine with atmospheric oxygen in lungs, gills, or other respiratory surfaces of the body and to release oxygen to tissues. They are responsible for the pink to red colours observed in combs and wattles of birds and in the skin of humans and other primates. Particularly prominent are portions of the face, buttocks, and genital areas of baboons. Chlorophylls: Chlorophyll is one of the most important pigments in nature. Through the process of photosynthesis, it is capable of channeling the radiant energy of sunlight into the chemical energy of organic carbon compounds in the cell. For a detailed account of this process, see photosynthesis. A pigment very much like chlorophyll was probably the first step in the evolution of self sustaining life. Chlorophyll exists in several forms. Chlorophylls a and b are the chief forms in higher plants and green algae; bacteriochlorophyll is found in certain photosynthetic bacteria. The chlorophylls are magnesium porphyrin compounds in which a cyclic tetrapyrrole is attached to a single central magnesium atom. They contain two more hydrogen atoms than do other porphyrins. The various forms differ in minor modifications of side groups attached to the pyrrole groups. In higher plants, chlorophyll is bound to proteins and lipids aschloroplastin in definite and specific laminations in bodies called chloroplasts. The combination of chlorophyll with protein in chloroplastin is of special significance, because only as a result of the combination is chlorophyll able to remain resistant to light. Bilins: Among the metabolic products of certain porphyrins, including the heme portion of hemoglobin, is a series of yellow, green, red, or brown nonmetallic compounds arranged as linear, or chain, structures rather than in the cyclic configuration of porphyrins. These are the so called bilins, or bilichromes. Small quantities of the red waste compound, bilirubin (C33 H36 O6 N4); a green product formed from it by the removal of two hydrogen atoms, biliverdin (C33 H34 O6 N4); and various other chemically similar compounds occur in normal tissues and may be conspicuous in excretory or secretory materials under normal circumstances and certain pathological conditions. The bile pigments, although first identified in mammalian tissues or products (e.g., in the bile of the gall bladder), are by no means confined thereto. Various members of the bilichrome series are encountered in invertebrates, lower vertebrates, and in red algae and green plants. Although the bile pigments of animals arise in all probability from the catabolism of heme precursors, there is evidence that bilirubin, accompanied by iron salts, promotes the synthesis of new hemoglobin when injected into humans, dogs, or rabbits suffering from secondary anemia. Etc, etc, etc …. …. I would conclude that chlorophyll comprises porphyrins attached to a Magnesium atom. Hemoglobin comprises porphins attached to an Iron atom. Bilins are non metallic porphyrins..","date":"2015-05-27","mins":"3:24 pm","url":"https://shroudstory.com/2015/05/27/colin-berry-is-not-seeing-red/","cat":"blood_studies","title":"Colin Berry is not Seeing Red"},{"id":"comment-21275","author":"daveb_of_wellington_nz","post":"Colin is only able to fire his arrows because there has been little in the way of a formal scientific programme on the Shroud since 1978, some 34 years. Most of any work that has been done since then seems to have been carried out by individual enthusiasts, working in an unconnected way, all going in separate directions. Whether that is a good thing or not for arriving at scientific conclusions might be debated. However most of the general work in Science in modern times appears to be best when there is some kind of corporate structure underpinning it to give it coherence. However such work also requires heavy investment, and there are limits to what kitchen science can achieve unassisted. The results will generally appear to be amateurish, and an easy target for pseudo skeptic criticism..","date":"2012-12-28","mins":"3:44 pm","url":"https://shroudstory.com/2012/12/28/colin-berry-hardly-copper-bottomed-evidence-for-so-crucial-a-question/","cat":"blood_studies","title":"Colin Berry: Hardly copper-bottomed evidence for so crucial a question"},{"id":"comment-21278","author":"daveb_of_wellington_nz","post":"“… such work also requires heavy investment, … “: There is no clear indication of any kind of tangible financial return that such an investment could generate – they would be intangible only; Investors look for rather more, unless they can be written off as a tax break. Book sales could be a possibility, but definitely limited. Donations, anyone?.","date":"2012-12-28","mins":"4:55 pm","url":"https://shroudstory.com/2012/12/28/colin-berry-hardly-copper-bottomed-evidence-for-so-crucial-a-question/","cat":"blood_studies","title":"Colin Berry: Hardly copper-bottomed evidence for so crucial a question"},{"id":"comment-88358","author":"daveb_of_wellington_nz","post":"So it is asserted that both coin and flower images can be seen on certain areas where the body image has clearly formed, but that flowers have masked the top of the head and that is the reason why the top of the head has not been imaged. Why then do we not see flower images on the burial cloth in the gap between the face and occiput if there was no separate cloth masking the top of the head from the imaging process, especially as Max asserts that the burial cloth was tightly wrapped there? Or was the layer of flowers at the top of the head made especially thicker so that the imaging process could not penetrate them? Is this at all plausible? The gap is entirely devoid of any imagery at all!.","date":"2014-03-13","mins":"3:14 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88832","author":"daveb_of_wellington_nz","post":"It has been asserted that there is a faint facial image on the back of the cloth discovered when the backing cloth was removed. If present it would not be due to “seepage” but to some other cause associated with whatever the image process mechanism was. Barrie Schwortz and other authors wrote a paper, I think during the last 12 months dismissing the claim. I haven’t been able to find the reference in my files but it is probably on Barrie’s shroud.com site. Dan gave it a posting and there was much discussion debating it at the time. The authors dismissed the allegation claiming it was a form of pareidolia. The human mind has evolved so that it quickly tends to see faces which in fact might not be there. I personally felt that I could see such an image and I thought it precipitate to dismiss it so readily. Unfortunately there seems to be no reliable technical means at present to confirm whether such images have a reality or are merely pareidolia. The authors had attempted such an approach but I was personally unconvinced by it. My personal view remains that there may in fact be such an image, but it remains uncertain. I agree with Hugh’s apparent skepticism that such theories as those of Isabel Pizcek on the body turning contribute little except useless speculation and misapply technical terms in a non scientific way..","date":"2014-03-14","mins":"3:30 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88464","author":"daveb_of_wellington_nz","post":"Are you therefore saying that you consider that there was no cloth masking the top of the head, but that the imaging process was able to penetrate the (presumably thick) layer of flowers at the top of the head to the extent that a few floral images were imprinted there? Yet in other places where you and Avinoam say there were flowers, facial / body / hair images were able to penetrate!.","date":"2014-03-13","mins":"8:54 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-88906","author":"daveb_of_wellington_nz","post":"Hugh, I like the idea of the “double superficiality, as it fitted in rather neatly with his evaporation gradient hypothesis.” It makes quite a bit of sense to me. Fanti may have been the first to assert double superficiality, but he’s not the only to claim seeing it. I think it remains an open possibility and still usefully debatable as to whether it’s there or not. It’s a highly subjective perception, and I think it’s quite possible. The evaporation gradient hypothesis means that there could have been coatings on both sides of the cloth, the body catalyst vapours penetrating the weave but necessarily forming a fainter image on the obverse side. I don’t see how Fanti’s various radiation theories get anything out of it though..","date":"2014-03-14","mins":"6:18 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89361","author":"daveb_of_wellington_nz","post":"Max, from what you’ve written here, I’m getting the impression that the image is not as uniformly superficial as seems to have been the general assertion. If the image was formed on the carbohydrate coating produced as a result of evaporation, it would seem that there might be a few areas where the carbohydrates did not entirely migrate to the surface, but there were a few places where it was left in the body of the cloth, allowing the image to form therein. On the obverse side of the cloth there should be a coating, some of the body vapours would penetrate between the fibres and allow an image to form on the obverse. As well as that, I’m reading that you’re saying that some of the image is in the body of the cloth. Am I reading you correctly?.","date":"2014-03-15","mins":"7:21 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89837","author":"daveb_of_wellington_nz","post":"Max has made the point that Pilate coins were found in Jewish tombs, possibly these coins may also have been placed in the ossuaries as they might have been thought now unclean. The Tyrian silver was apparently used to pay the temple tribute. We do not really know whether the Greek custom of placing coins over the eyes arose in order to “pay the ferry man”, or whether the Charon / Styx myth arose from an established cultural practice of hiding the open eyes of a dead person so they would not seem to be staring, for instance. The USCCB commentary on Matthew 22:17 21 makes some interesting observations: [22:19] They handed him the Roman coin: their readiness in producing the money implies their use of it and their acceptance of the financial advantages of the Roman administration in Palestine..","date":"2014-03-17","mins":"12:38 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89844","author":"daveb_of_wellington_nz","post":"[Accidentally posted before I’d finished]; Further USCCB commentary on Matt 22:17 21; “Repay to Caesar what belongs to Caesar: those who willingly use the coin that is Caesar’s should repay him in kind. The answer avoids taking sides in the question of the lawfulness of the tax. To God what belongs to God: Jesus raises the debate to a new level. Those who have hypocritically asked about tax in respect to its relation to the law of God should be concerned rather with repaying God with the good deeds that are his due;” The Herodians favoured paying the tax, the Pharisees did not, so it’s a calculated entrapment. Clearly the coin of the temple tribute had an image of the emperor on it, yet the Judean people were happy to use this coin of the realm in their commercial transactions. Yet another instance of pharisaic hypocracy. They’re happy to take advantage of the benefits of Roman administration, despite their wrangling over the small stuff..","date":"2014-03-17","mins":"12:47 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89926","author":"daveb_of_wellington_nz","post":"Thanks for the correction Hugh. I had somehow in my mind associated Matt 22:17 21 as a sort of temple tax paid as a tribute to Caesar, which was way off the mark. One of the sources I’ve now checked explains the rabbinic rationalisation of using the Baal inscribed Tyrian silver piece for the temple tax that it was 97% silver whereas the Roman coinage was only 80%; They apparently considered it more important that the correct amount of silver be paid to the temple rather than the prohibition of such an image as Baal. When the Romans closed the Tyrian mint, it was a Jewish mint near Jerusalem that then minted these coins. The Romans did not want to allow an impression of Jewish independence to be created by lettng them mint specifically Jewish coins, and as the Baal coins were acceptable before, that design had to stand. The purpose of the money changers was for the exchange of common coinage for the temple coins. Very likely Judas Iscariot’s 30 pieces of silver were in these temple coins. Matthew has a story that Jesus told Peter and James to catch a fish which had a temple coin in its mouth, so they could pay the temple tax..","date":"2014-03-17","mins":"5:26 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85219","author":"daveb_of_wellington_nz","post":"I can agree with the possibility that there may be a blood smudge in the water mark area between the two head images, and the likelihood that there was some starching of the cloth. However I cannot agree that there was a gap of at least 3.7cm between the top of head and the cloth, and it is not an adequate explanation of the lack of top of head image. Hugh Farey gives a very good explanation of why this is so. See the posting “Top of Head Puzzle” of 16 January and his Comment #15 there. Hugh writes: “Assuming that the bottom edges of the line of bloodstains along the back of the head correspond roughly to the level of the inion of the external occipital protuberance, there is a distance of about 38cm between there and the bridge of the nose, which corresponds well to the same distance on my own head. In other words, the image which is visible is consistent with a cloth wrapped tightly over the head from nose to occipital protuberance, and possibly a cloth about 15cm wide underneath the shroud and tied around the top of the head to account for the lack of image all the way.” I calculate that for there to be a gap of at least 3.7cm, the ventral and dorsal images must be separated by not less than an additional 6cm, which would be easily detected on the Shroudscope images. The measurements and calculations would be well within cartographer Yannick’s ability to confirm. Hint: Assume the path over the head approximates to a semi ellipse. Then for an additional gap of distance ‘h’ at the top of the head, the formula for the additional separation approximates to pi x h / 2. Additional hint: Two bands encircle the globe at the equator; the second band is placed at a distance 1m above the first. What is the difference in length of the two bands? Answer – 6.28m. The absence of an image at the top of the head can only be explained by an intervening cloth such as a type of cap – check Cap of Cahors!.","date":"2014-03-05","mins":"3:38 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-89964","author":"daveb_of_wellington_nz","post":"So the coins used for paying Charon were customarily placed in the mouth, and not the ones on the eyes. Maybe the Greeks placed them on the eyes as well as a mark of respect? If the 2nd temple Jews placed coins on the eyes, they could then fall into the mouth when the flesh rotted during the first year. When the family came to place the bones in an ossuary, presumably any coins among the bones would be left with them, more or less where they fell. Does this make sense? So if the coins had fallen between the jaws, the relatives would leave them there. Or if there were coins in the ossuary, essentially it does not follow that they were intended for Charon anyway!.","date":"2014-03-17","mins":"7:15 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85584","author":"daveb_of_wellington_nz","post":"“Occam’s Razor can’t always account for the poetry that is human behaviour.” Beautifully expressed! I’ll want borrow it sometime!.","date":"2014-03-06","mins":"3:13 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-90130","author":"daveb_of_wellington_nz","post":"MPH – “To Hugh, just hundreds (nor thousands!) of Second Temple period were excavated.” At the time of the Talpiot tomb controversy, I was interested in checking the frequency of names on inscribed ossuaries. I found a web site reference to L. Y. Rahmani, A Catalogue of Jewish Ossuaries, Israel Antiquities Authority and the Israel Academy of Sciences and Humanities (Jerusalem: 1994) The catalogue had only 917 ossuaries of which 231 had inscribed names, 286 names in all. There would be several ossuaries in each tomb. I have not checked on which ossuaries had coins in them, but Max’s 124 coins suggest that the practice was common, if Rahmani’s 917 ossuaries of 1991 and their associated tombs were the ones with the coins. Max’s 2005 source might include more tombs. Perhaps the practice of depositing coins was more widespread than being merely sporadic!.","date":"2014-03-17","mins":"3:26 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-90228","author":"daveb_of_wellington_nz","post":"The two assessments are inconsistent. Summarising Max, 71 coins found in 12 Second Temple period tombs, apparently half of them Pilate coins, Herodian coins involving 27 tombs, 124 coins in all, out of a total of only a few hundred tombs excavated. That looks like about 10% of tombs were found to have coins, plus any other tombs where there were coins, but undiscovered, not mentioned, or else removed. I couldn’t describe that as a rare practice as apparently Haklili does! I suspect a cultural bias seems evident. What are the numerical facts on which Haklili asserts it was rare among Jews, or is it just a sweeping generalisation?.","date":"2014-03-17","mins":"11:30 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-90513","author":"daveb_of_wellington_nz","post":"It occurs to me that regardless of whether 2nd Temple Hellenist or even Hebraic Jews placed coins in the mouth or not, or whether the coins fell from the eyes into the mouth, it might well have little pagan religious significance at all, but may only reflect a cultural habit or practice that had developed, albeit with pagan origins. Just reflect on what the present commercial world and the general public have now done to the Christian religious festivals of Christmas and Easter, which among many have lost any religious significance they once had. Chrissy presents of the latest ipads and chocolate eggs are a far cry from the Incarnation and the Resurrection..","date":"2014-03-18","mins":"6:48 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-90582","author":"daveb_of_wellington_nz","post":"Recapitulating: A number of investigators including MPH have asserted that the Shroud image shows coins of the Pilate era on or near the eyes imagery. Others have challenged this either as pareidolia, or else that they are not sufficiently distinct to be persuasive. However if it could be conclusively demonstrated that the alleged coin images are indeed real, this has to be a powerful argument that the Shroud image indeed dates from the first century, and reinforces the likelihood of authenticity. Some, including YC, have asserted that placing coins on a dead person’s eyes is a pagan custom associated with the Hellenistic myth of Charon and the Styx, and it is therefore unthinkable that religious Jews should do this. However whatever the origins of the custom, and there are good social and practical reasons why it should be done, enough has been said to demonstrate that the practice was not so rare as some may have asserted and it was not so uncommon. It is therefore perfectly acceptable that there may well have been coins placed over the eyes of the TSM. If it is ever conclusively demonstrated and accepted such was the the case, then the anti authenticists have yet another problem they have to resolve. Perhaps a 13th century numismatist associate of Roger Bacon included this bright idea on the bas relief he used when scorching the image on to this expensive and rare piece of linen cloth???!!! A pity he left no written record of the event!.","date":"2014-03-18","mins":"11:06 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-90704","author":"daveb_of_wellington_nz","post":"Max, I accept that it is quite possible that small bronze coins placed on the eyes of a dead persons may eventually fall in between the mandibles, and is one credible explanation of such discoveries. However I’m also open to the likelihood that practices which had originated with some religious or even a more practical purpose in mind, can also have a tendency to survive long after the original purpose has been forgotten so that they become more of a cultural practice or social habit. Palestine had at the time a cosmopolitan population, so that there would even be cross exchanges of practices. I see it in NZ all the time, with various ethnic practices migrating into other cultures. I know families of European ethnicity who after the birth of a child will imitate the Maori practice of burying the after birth sac and plant a tree over it; the tree becomes the child’s own special tree. Here’s a variation which you may have come across when in the Middle East. A lady acquaintance with family working in Arabia, claims that the original purpose in wearing the burkha was to protect the eyes from desert sand storms. The practice was retained even when families migrated away from desert environments, so that it became a cultural practice. Finally, of course it became a religious obligation. I have no idea whether her story has factual substance or not, or whether you are able to corroborate it, but it certainly seems plausible. Back in the 1970s, the psychologist Eric Berne was asserting that many such social rituals, frequently had once served a useful practical purpose, but subsequently had merely become ritualised. We have 3rd and 4th century sources that asserted that the spreading of altar cloths were intended to represent Christ’s burial cloths. As a eucharistic minister I am required to lay out a corporal cloth on the altar before Mass. I am sure that I would be one of the very few ministers aware of the alleged origins of this practice. All such practices have a tendency to survive long after their original intent has been forgotten. However they may be rationalised in other ways..","date":"2014-03-19","mins":"4:57 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85635","author":"daveb_of_wellington_nz","post":"Yannick’s inisistence on a gap between the top of the head and the cloth, entirely ignores what has been said about this. There was no gap! For there to have been a gap of 4cm as he proposes, the ventral and dorsal images had to be separated by at least an additional 6cm. I have explained how he can check this for himself. He is a cartographer and should be able to exercise this skill to confirm what others here have also found. A cloth on the top of the head is the most likely explanation for the lack of image there. Any tilting of the head does not affect this conclusion. He can measure the distance nose to occipital protrusion on his own head and make the same comparison on Shroudscope. Concerning the lack of side imaging, it is my understanding that Mr Latendresse believes the cloth was loosely draped as a temporary measure and the sides of the cloth were too distant there for imaging to occur. On the other hand MPH insists that the burial rite was completed and the cloth fully wrapped the body. In that case it seems to me that the only tenable explanation was that the sides of the body were packed with some of the 100 pound package brought by Nicodemus which masked the sides from the cloth. It is still a mystery to me why the image should be a near orthogonal projection (similar to a photograph) particularly if the body was fully wrapped. That is why I suspect that there could have been some kind of vertical constraint in whatever emanations caused the image. It is just possible that this might also explain the lack of image at the top of the head..","date":"2014-03-06","mins":"5:52 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-91660","author":"daveb_of_wellington_nz","post":"Giovanna De Liso succeeded in obtaining 3 D images of a strictly metallic key, and which was not smeared in blood!.","date":"2014-03-21","mins":"4:13 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85637","author":"daveb_of_wellington_nz","post":"Matthias, the head cloth mentioned in John’s gospel was in a separate place by itself, and is generally considered to have been a full head covering placed over the head to mask the gruesome death rictus during portage to the tomb. Have you ever seen a human face immediately after death? Many believe this to have been the sudarium at Oviedo which matches the Shroud face, has human blood type AB, and shows that some of the blood was shed in life. It would have been removed during the burial rite. Any cap envisaged as masking the top of the head at the time of image formation would have been a separate cloth..","date":"2014-03-06","mins":"6:01 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85778","author":"daveb_of_wellington_nz","post":"Yesm but why on earth is it an orthogonal projection, as if the emanations were constrained vertically? If they were chemical emanations we might expect them to be normal to the body surface, but this does not seem to be the case! If the body was lying on its back, then why is the image a virtual projection normal to a horzontal plane? I have my own suspicions as to the reason but shan’t mention them here..","date":"2014-03-07","mins":"3:37 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85823","author":"daveb_of_wellington_nz","post":"Chamge in refractive index? Ahem..","date":"2014-03-07","mins":"5:48 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85971","author":"daveb_of_wellington_nz","post":"A burst of radiation may have been the cause of image formation, but it is not a view I particularly favour. Nevertheless the image is a near orthogonal projection for some nexplicable reason. I’m inclined to favour some type of chemical reaction, even somewhat along the lines of Rogers or for that matter Vignon, and believe that there has been insufficient experimentation to test these fully. It is possible that gravity may have had a part in this but it is a weak force in respect of vapours. The earthquake might have had something to do with constraining the emanations to the vertical, such as variations in the electric and magnetic fields and possibly radon emission. Otherwise it is necessary to have recourse to the miraculous. I am disappointed that cartographer Yannick does not seem to have followed up mine and Hugh’s suggestion of measuring the nose to occipital measurements, as I believe that this would soon convince him that there can be no gap between the top of the head and the burial cloth, regardless of head tilt. We must all be extremely grateful to Mario Latendresse for his wonderful Shroudscope on the web, but I feel sure that if Mario checked the measurements described he would also see that there can be no gap. The separation of ventral and dorsal images needs to be extended by at least an additional 6cm to produce the 4cm gap required for a lack of top of head image..","date":"2014-03-07","mins":"3:38 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-86019","author":"daveb_of_wellington_nz","post":"I give up! Just measure it yourself!.","date":"2014-03-07","mins":"7:50 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-86283","author":"daveb_of_wellington_nz","post":"A cartographer who will not / cannot make two simple measurements and draw the only logical conclusion possible. Strange! Perhaps he left his Occam’s razor in the bathroom cabinet!.","date":"2014-03-08","mins":"2:52 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-86388","author":"daveb_of_wellington_nz","post":"You still haven’t made the mesurements yourself, then? I sent an email to Mario yesterday setting out the arguments (and thanking him for his marvellous Shroudscope) I don’t know if he will reply or not..","date":"2014-03-08","mins":"10:53 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85279","author":"daveb_of_wellington_nz","post":"It is irrelevant whether the head is tilted forward or not. The distance between the ventral and dorsal head images demonstrates that there was no gap between the cloth and the top of the head, they were virtually in contact (unless there was an intervening cloth) with the burial cloth quite tight at the top of the head. As other body parts produced an image when in close proximity to the burial cloth, there has to be a reason why this did not happen at the top of the head. An intervening cloth seems the most likely explanation – your Occam’s razor! The only other possible explanation is that whatever caused the image did not, for some unknown reason, act through the top of the head. Perhaps whatever emanations caused this were constrained to act vertically, but I’m not entirely happy with that explanation..","date":"2014-03-05","mins":"8:25 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-87195","author":"daveb_of_wellington_nz","post":"Yes! He hasn’t measured it yet!.","date":"2014-03-11","mins":"12:07 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-87244","author":"daveb_of_wellington_nz","post":"I doubbt if that measurement has any significance. You need to be able to measure from a determinable point on the front of the skull to a determinable point on the back of the skull. Hair lines and blood stains on the water mark don’t do it. Typical measurement from bridge of nose to inion is about 36cm. I’m not confident you have a grasp on the issue and I’m sorry but I did not appoint you as arbitrator. I’ve said all I wish to say on this topic for now..","date":"2014-03-11","mins":"3:16 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-87426","author":"daveb_of_wellington_nz","post":"The disposition of the hair is I consider a very weak argument against the presence of a head cloth merely sufficient to mask the Shroud at the crown. I prefer the more objective method of direct measurement, yet once again patiently described by Hugh below, and on whose head the measurement is 35cm. On my head the distance is 36cm, but I am known for an unusually large brain capacity, which probably makes me a big head as well a G.O.M. What is the measurement on Yannick’s and Matthias’ heads?.","date":"2014-03-11","mins":"3:22 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-87430","author":"daveb_of_wellington_nz","post":"I am happy to defer the title of resident G.O.M. To Dan if that’s his preference. However when it is others’ time in due course to become grumpy old men, I hope that they are able to find more pressing commitments and interesting topics to occupy their minds than reading interminable, incessant verbiage of self inflated weakly argued opinion from those with considerably less life experience than themselves, the happy situation which I now enjoy..","date":"2014-03-11","mins":"3:36 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-87540","author":"daveb_of_wellington_nz","post":"And in all of thiis quite unnecessarily long thread, you have not cited a single significant measurement despite several invitations to do so. Why? Because it would immediately destroy your idea of a fold in the cloth! I repeat! I see no point in further discussion. No measurement! No talkee!.","date":"2014-03-11","mins":"10:11 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-19089","author":"daveb_of_wellington_nz","post":"Charles still clings to the myth that there was no AB blood group before the Altai mountains were crossed, and until Asians and Europeans commingled in Hungary around 900 AD. He should discard it, but it seems to be the one thing that enables him to doubt the Shroud’s authenticity, so that is a problem for him, An inspection of any reputable table of distribution of blood groups reveals how tenuous a basis this myth has. Although A group is dominant in Europe, both A and B groups are found throughout Asia in comparable proportions, and AB is significant. Also even populations that have long been isolated have AB occurring (Ainu and Kalmuks). If the Shroud is authentic, then it originated in the Middle East, and mid European.blood group distributions are irrelevant. Percentage distributions of O, A, B, AB, groups are as follows: Arabs – 34, 31, 29, 6; Hindus – 32, 29, 28, 11; Tartars – 28, 30, 29, 13. One could go on, but check the figures on web site: http://www.bloodbook.com/world abo.html Curiously, NZ Maoris and other Polynesian races are believed to have originated in China, where there are now significant percentages of all blood groups, with significant differences between Cantonese and Pekingese, yet NZ Maori remain dominantly O and A. I would remind readers that Alexander the Great arrived in the Indus Valley in 327 BC, and it would not be surprising then if AB blood group was common in the Middle East in New Testament times. Present blood group classification orignates in 1901, and there could have been little interest in typing of blood groups before then..","date":"2012-11-15","mins":"8:45 pm","url":"https://shroudstory.com/2012/11/14/early-evidence-of-ab-blood/","cat":"blood_studies","title":"Early Evidence of AB Blood"},{"id":"comment-38983","author":"daveb_of_wellington_nz","post":"Emmett: “If I was on guard there I surely would have made note of that fact. I wonder if the Romans kept any of those records?” Louis: “It was probably the earthquake that rolled the rock away” Matthew’s gospel will be fairly close to what actually happened. Mt 28:1 8 ‘Towards dawn two Marys visit the sepulchre’, ‘sudden violent earthquake’, ‘ “Angel of the Lord” rolls away the stone’ (i.e. Earthquake rolls the stone); ”Guards go into shock and are like dead men’; ‘Angel gives two Marys the message that Jesus is risen, and is going to Galilee’; Subsequently Mt 28:11 15; ‘Some guards go off to tell the chief priests’, ‘priests consult the elders’, decide to bribe guards’, Instruct guards “This is what you must say ‘His disciples came during the night and stole him away while we were asleep’ and we’ll put things right with the governor if he hears about it.” What’s the penalty for a Roman guard sleeping on guard duty?? I think it may have been Jacobivice who suggested that Mt 28:11 15 may be an indication that that’s what actually happened – disciples stole the body – (no provocation to Louis intended) but it doesn’t bear scrutiny as the gospels make it clear elsewhere that they didn’t believe the women anyway. Re the earthquake rolling the stone: I’m familiar with stories about eathquakes in NZ, and at a cliff face or similar ground discontinuity, it is quite usual for the earthquake wave to split off the rocks and hurl them for quite some distance away. The ‘sealing of the rock’ against the entrance to the tomb may well have ensured that the full force of the EQ wave would be transmitted to the rock forcing it to move..","date":"2013-07-14","mins":"6:32 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-39012","author":"daveb_of_wellington_nz","post":"Emett: There have been all sorts of attempts to explain away the Resurrection. This was merely the first such, from those who had condemned him. There have been others, such as de Wesselow’s explanation that the disciples saw the image on the Shroud, to Hans Kung’s attributing it to a type of awareness of Jesus’ presence, to Dom Crossan’s interpretation of it as a parable, and doubtless there will be many others. None of them bear scrutiny. The concept of Resurrection is so mind boggling that those without faith try to look elsewhere for an explanation which they can rationalise in their minds..","date":"2013-07-15","mins":"6:54 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-39035","author":"daveb_of_wellington_nz","post":"The point being that neither the disciples, or first converts from Judaism, nor Paul’s gentiles, would have lived and died for such a religion, unless they believed that the Resurrection had a factual reality. They would not live and die for such, if it were only a vague psychological awareness, or if they saw it as a parable, or an illusion!.","date":"2013-07-15","mins":"4:35 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-200266","author":"daveb_of_wellington_nz","post":"I’ll follow the next installments with interest. I had a major problem following the audio, not sure if that was the accent, the speaker’s articulation, sound quality, or my hearing problems. Technical issue: I’ve always considered it incomprehensible how a tightly wrapped body could result in an orthogonal contact image with little lateral distortion and no image of the sides. For a contact orthogonal image, I think it more likely that the Shroud cloth had to be more likely loosely draped over the body, with the intention to complete the burial rite after the sabbath. Authors should read over paper on geometrical experiments draping a cloth over a human model by Mario Latendresse: “The Turin Shroud Was Not Flattened Before the Images Formed and no Major Image Distortions Necessarily Occur from a Real Body”, Mario Latendresse, Ph.D. Latendre@iro.umontreal.ca http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.160.656 Slides at: http://www.sindonology.org/papers/latendresse2005a Slides.pdf It will be interesting to see what images the next video installments will show, and whether there is any obvious lateral distortion..","date":"2015-05-26","mins":"3:54 pm","url":"https://shroudstory.com/2015/05/26/fascinating-video-from-dave-hines/","cat":"blood_studies","title":"Fascinating Video from Dave Hines"},{"id":"comment-201296","author":"daveb_of_wellington_nz","post":"Where Mario has his loosely draped cloth over the head of his model, it extends loosely past the forehead. This was debated here quite some time ago. After measuring on Shroudscope, both Hugh and I believed that the Shroud cloth had to be drawn quite firmly over the top of the head to match the likely distance between the ventral and dorsal images. We measured about 35 cm from the bridge of our noses to the occipital bump on the back of our heads. From where we could guess the bump on the back of the head of the TSM, this seemed to require the cloth to be drawn firmly over the head. Problem is that there is no top of head image on the TS, so there had to be a cloth or cap on the top of the head masking it. Mario disagreed with our analysis and had another explanation. But you might like to keep it in mind during your experiments. There is a relic known as the Holy Cap which was supposedly worn by Christ and brought to Cahors cathedral in the Pyrenees from the Holy Land about 1113..","date":"2015-06-08","mins":"2:27 am","url":"https://shroudstory.com/2015/05/26/fascinating-video-from-dave-hines/","cat":"blood_studies","title":"Fascinating Video from Dave Hines"},{"id":"comment-201351","author":"daveb_of_wellington_nz","post":"Reminder for Max! With the greatest respect to your detailed knowledge of ancient burial practices, the Sindon imprint implies no such thing. Whether or not what was supposed to have been done, was done in fact, is entirely a matter of conjecture, John 19:40 notwithstanding. We only have the Shroud and its image, we don’t know how the image was formed, and it can only speak for itself as best we can interpret it. Concerning the disposition of the imaged cloth at the time of burial, the model proposed by Mario Latendresse which he discusses in detail is the one that to date best fits the geometry of the image, with minor modification only. Anything else remains as pure conjecture, until proven otherwise! The near adjacent text John 19:42 deliberately makes the point that it was the Jewish Day of Preparation, giving the hint that whatever was done was likely done somewhat hurriedly..","date":"2015-06-08","mins":"4:04 pm","url":"https://shroudstory.com/2015/05/26/fascinating-video-from-dave-hines/","cat":"blood_studies","title":"Fascinating Video from Dave Hines"},{"id":"comment-98554","author":"daveb_of_wellington_nz","post":"I get the impression that Hugh is allowing his assumed skepticism to get the better of him. If an artery or vein was pierced then the arms would be covered in gore, and with three hours suspension the victim would have bled to death. Has Hugh ever attended an accident where a main blood vessel was severed or ever attempted to stem blood loss with a tourniquet? Perhaps he should leave his forensic analysis to those with some knowledge and experience of it. We’re seeing trickles of blood on the arms not extensive gore. Roman nails were either square or sometimes triangular section, and unlikely to create a seal at their edges so some leakage at least might be expected over a three hour period. I’d recommend a close re reading of Barbet so he may become better informed. If the Shroud is authentic, why would anyone bother adding blood flows that accurately matches gravity, assuming they had sufficient understanding to do so. The fellow in the video standing on a pedestal with near horizontal arms, is hardly an accurate enactment. For Kelly: It is Barbet’s contention that the patibulum was removed from the stipes, and the patibulum with body attached was then transported to the burial site where the nails would have been removed. Four men would have been sufficient to carry the patibulum with the body..","date":"2014-04-12","mins":"12:59 am","url":"https://shroudstory.com/2014/04/07/garlaschelli-and-borrini-study-flawed/","cat":"blood_studies","title":"Garlaschelli and Borrini Study Flawed"},{"id":"comment-21160","author":"daveb_of_wellington_nz","post":"My money would have to be on Barbet’s analysis. It seems that the first suggestion of a pleural effusion was made in a hostile pamphlet “La folie de Jesus’ which Barbet despised and would not even give the author’s name. It set out to prove that Jesus was of unsound mind and was tubercular, which goes against his apparently robust stamina and the active life he led. However it was also suggested by a colleague who Barbet respected, Dr Rene Morlot, but Barbet does not accept his views on the matter. Barbet himself conducted various experiments simulating the lancea wound, and was able to draw off significant quantities of pericardial fluid by aiming at the right auricle – the ventricles would be empty of blood. He deduces that as the blow to the heart from the right was always mortal it was very likely taught in the Roman fencing schools, as the left side was usually protected by a shield. This would then argue against the pleural effusion theory, as the wound would be too high and it would require too much fluid in the lungs of a normally healthy person for it to have been the source of the flow of “water”. Interpreting the Johannine text in a symbolic way only, goes against the very strong emphasis John gives as it being a real event. It is certain that the various writers seeing it in this way knew little or nothing of anatomy, were confused about it, considered that blood could not flow in a corpse, and were desperate in reaching for an explanation. Barbet limits himself to quoting St Jerome: “”This double flow conescrates at the same time the Baptism of water and the Baptism of blood of the martyr.” But for Barbet, it was a real anatomical phenomenon which he had tested and proved. Concerning the authorship of John’s gospel, the following paragraphs are quoted from Encyclopedia Britannica: “Irenaeus calls John the beloved disciple who wrote the Gospel in Ephesus. Papias mentions John the son of Zebedee, the disciple, as well as another John, the presbyter, who might have been at Ephesus. From internal evidence the Gospel was written by a beloved disciple whose name is unknown.” “Because both external and internal evidence are doubtful, a working hypothesis is that John and the Johannine letters were written and edited somewhere in the East (perhaps Ephesus) as the product of a “school,” or Johannine circle, at the end of the 1st century. The addressees were Gentile Christians, but there is accurate knowledge and much reference to Palestine, which might be a reflection of early Gospel tradition.” The insistence of John 19:34 as to the flow of blood and water being an eye witness account, must surely support these verses as being part of this “early Gospel tradition”..","date":"2012-12-26","mins":"10:40 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","title":"Getting the Left and the Right Right"},{"id":"comment-21206","author":"daveb_of_wellington_nz","post":"Anoxie: I have just read through Sue Benford’s paper published on the shroud.com site. I believe she is mistaken in this assertion. I note she appends the initials R.N., M.A. After her name but am otherwise unaware of her scientific qualifications, to make the comments she does. I also note an appended comment by Thaddeus Trenn who teaches in the science and religion program, Victoria College, University of Toronto: “She is correct that a lens would reverse left and right. The cloth original was not dependent upon any lens since the image pixels were the result of direct impact from object to cloth. While her observation is very valuable at excluding the sort of photography Leonardo allegedly conducted, the image on the cloth is like a photographic negative in the light/dark reversal effect. One only needs to compare the negative of the cloth image with the photographic positive of this negative to see the left right reversal. So the positive becomes the left/right corrective, returning the side wound to the right side as on the cloth.” I am now looking at two illustrations in Ian Wilson’s “The Turin Shroud”, ‘Shroud positive, frontal aspect after Enrie’, ‘Shroud negative, frontal aspect, after Enrie’. The wrist wound and the forehead bloodflow ‘3’ stain are clearly visible in both. On the positive print, both images appear on the page left of centre; On the negative, these are reversed and both appear on the page right of centre. Looking at the negative as if it were a print we would say that the wrist wound is on the left wrist, and that the forehead blood stain is above the left eyebrow. In all the literature I’ve read, it is on the left wrist that the wound is clearly visible. Barbet himself is insistent that the wound in the side is on the TS man’s right side, and obviously considers that the Shroud negative shows the correct orientation in direct view without the aid of a mirror as postulated by Sue Benford. I would have rather more faith in Dr Barbet’s forensics than in Ms Benford’s claims. I find in close analysis, the comment on orientation by Thaddeus Trenn somewhat ambiguous. Although the side wound is on the right side of the cloth, viewing it we would say it is on the left side of the body, which would be incorrect..","date":"2012-12-27","mins":"3:45 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","title":"Getting the Left and the Right Right"},{"id":"comment-21210","author":"daveb_of_wellington_nz","post":"When I was in amateur theatrics, more years ago than I care to remember, directions to the actors were always to be understood as “stage left” and “stage right”, which were of course reversed from the audience perspective, but there was then no ambiguity as to what was intended! I recall vaguely that stage right was for the goodies and stage left (sinistra) was for the baddies..","date":"2012-12-27","mins":"5:02 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","title":"Getting the Left and the Right Right"},{"id":"comment-21216","author":"daveb_of_wellington_nz","post":"I’m sorry, I find her explanation contradictory and confusing, and I know I’m not dyslexic. When I see a photo print of a person with a watch on their left wrist, I can see it’s on their left wrist, although it’s on my right. When I see a photo print of the TSM he appears to have a wound on his right wrist, although it’s on my left. When I see the negative of the TSM, the wound appears to be on his left wrist, and it’s on my right. There is a clear and unequivocal reversal of left and right between the positive and negative. The “watch” is actually on the left wrist! Ergo there has been a left right reversal! Ergo, contradictory!, ..","date":"2012-12-27","mins":"7:34 pm","url":"https://shroudstory.com/2012/12/26/getting-the-left-and-the-right-right/","cat":"blood_studies","title":"Getting the Left and the Right Right"},{"id":"comment-14511","author":"daveb_of_wellington_nz","post":"Correction to Christchurch earthquake information. Reported 5:30 PM Tuesday Feb 22, 2011: “The earthquake was magnitude 6.3 and struck at a depth of 5km, 10km south east of Christchurch CBD. It was shallower and closer to Christchurch than the 7.1 magnitude quake on September 4 (2010), which was recorded at a depth of 10km, near Darfield, Three Geonet monitors in the Christchurch CBD recorded much worse ground shaking than was felt during the original September 4 quake. It was expected to have caused a fissure in the ground under its epicentre in Lyttelton. The quake has caused devastation. Emergency services reported multiple fatalities, serious injuries and extensive structural damage to buildings. Hospitals throughout the South Island were cleared to take in a flood of patients from Christchurch.” Earthquake events of Richter 9 are comparatively rare events, and as I mentioned previously, could expect to be widely documented, even in 1st c. Palestine..","date":"2012-08-05","mins":"7:39 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-14552","author":"daveb_of_wellington_nz","post":"My comment at #10 above suggested two SCIENTIFIC reasons why the gaseous diffusion model seemed inadequate alone to produce the image: 1) orthogonality of the image, 2) its high resolution. I am not the first to have suggested this. I think either Gabriel or possibly Paulette may have mentioned this previously. I also mentioned De Liso’s work reported in 2010 – she produced high definition 3 D images as a result of moderate seismic activity. De Liso’s paper is included in the citations mentioned in the Carpentiri et al paper. It can be found at: “Shroud like image formation during seismic activitiy”; Giavanna de Liso; ENEA Frascati Conference May 2010: http://www.acheiropoietos.info/proceedings/De Liso Web.pdf It could also account for the xray qualities of the image mentioned by Chris B at #18 above. However I don’t necessarily concur with his comment: “…seems OVERWHEMLINGLY in favour of a supernatural burst of energy”, but I believe neither can it be excluded. I suggest Yannick perhaps should reread the header at the top of this posting – a more open minded approach seems indicated than he seems prepared to acknowledge. I also think that Gabriel at #17 makes an important point concerning the aragonite samples mentioned in the Lucotte paper. At present the findings mentioned in the Kohlbeck/Nikowsky 1986 paper are orphans, and it would be wonderful if their findings could be given some corroboration..","date":"2012-08-06","mins":"5:40 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-14564","author":"daveb_of_wellington_nz","post":"Following on from Anoxie’s and Gabriel’s comments #15 & #25, I’ll concede that mine at #10 may be inexact: “1) The image is projected orthogonally on to the cloth and there are no images from the lateral aspect (side view);” But I’d also query whether the path is following the shortest distance as Anoxie asserts. It would depend on how the cloth was draped. In earlier postings, Max Patrick Hamon had asserted that the body was completely wrapped, on the basis that the customary rites were completed. Others have suggested that the cloth was merely draped over the body, possibly supported at the sides by the 100 lb package brought by Nicodemus. Still another version has it that if it occurred during the moment of Resurrection, with both the body and the cloth hovering horizontally, suggested by the apparent weightlessness visible on the dorsal image (no dorsal deformation apparent). For their 3 D VP8 simulation calibration, Jumper and Jackson had the cloth lightly draped over.their model. The point I guess I was attempting to make, was that superficially the image is what we would expect to see in an ordinary 2 D photograph, with none of the body’s sides showing on the image, not even indistinctly. For me, this seems to be a fairly compelling argument that gaseous diffusion could not be the primary cause of the image. The boundaries at the edges of the image are reasonably sharp. There is no sign of wrap around. Gabriel’s comment at #25, ” issue of the unique correspondence between each point on the body and on the image” (not a pdf), also implies high resolution, but needs the qualifier that there are no corresponding points from the sides of the body. To me it’s starting to look like high energy particles, or a form of radiant energy. I think that direct contact has to be ruled out because of the apparent 3 D properties..","date":"2012-08-07","mins":"5:31 am","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-14510","author":"daveb_of_wellington_nz","post":"Yannick, like anyone else, may believe whatever credible hypothesis that he prefers. But one attitude that cannot be legitmately adopted, is dogmatic assertion. There is simply insufficient evidence. And that is unlikely to change in the very near future, because any further access to the Shroud for any further testing is unlikely to be permitted. The only progress that can now be made is further examination, analysis and interpretation of data that is already available. No further data or testing is going to happen any time soon. And furthermore, it seems very likely that despite all the testing that has been carried out, this seems unlikely to yield any new definitive information. Yannick may if he so chooses, refuse to believe that the image was caused by the Resurrection. But this cannot be domatically rejected by the evidence. A major problem for any rational explanation in my view arises from: 1) The image is projected orthogonally on to the cloth and there are no images from the lateral aspect (side view); 2) The high resolution of the image. Both of these properties seem to rule out any kind of gaseous diffusion as being the primary cause of the image, but the gases may be conjectured as providing a secondary vehicle allowing the image to be transferred. The orthogonality of the image is strongly suggestive of some kind of directional mechanism. I think this may explain why some of the papers offered, look to such possible sources as neutron or proton exchange, either emanating from the body itself (Resurrection?) or release caused by a physical phenomenon such as earthquake or lighting. And whether we like it or not, this begins to enter the realm of the conjectural. One of the papers referring to possible earthquake source, suggests a Richter 9 earthquake. This is an absolutely devastating earthquake at any depth at all typical, and the historic evidence for this is scant. Giovanna De Liso succeeded in getting high resolution images with 3 D properties at quite moderate levels of seismic activity. Christchurch NZ is still recovering some 18 months after a shallow Force 5 earthquake, with many buildings still being demolished as unsafe, and rebuilding is still in its early stages. A Force 9 earthquake in 1st c. Palestine would have been extensively reported by the likes of Josephus and others. It would have done a lot worse damage than merely rending a temple veil in two, or rolling away the occasional tombstone!.","date":"2012-08-05","mins":"6:50 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-41911","author":"daveb_of_wellington_nz","post":"There are some excellent points in many of the comments above. Despite some of Wilson’s faulty research, I believe he has done more than most others to RAISE AN AWARENESS OF THE SHROUD within the English speaking world. In 1960, I attended a presentation given by our Domincan university chaplain to students at our Engineering School hostel. This was my first real exposure to some of the forensic aspects of the Shroud, and I guess that much of it was probably based on the work of Pierre Barbet and other early pioneers. At the time, I mentally filed it away and thought little more about it. However until I encountered Ian Wilson’s 1978 book on the Shroud, I had never heard of Yves Delage, Paul Vignon, Max Frei’s pollen sampling, the historical aspects involving the De Charnay family, the challenge of the D’Arcis memorandum, and I was ignorant of the Crusaders’ sacking of Constantinople in 1204. I had certainly never heard of the Image of Edessa, and the legends concerning Abgar the Great. I was unaware of the detailed work carried out by the STURP team. A significant contribution that Wilson himself made at this time was to publicise the many similarities to the Shroud facial image of post 6th century icons, coinage images, and the emergence of the Shroud like Lamentation scenes such as those in the Pray manuscript. The English speaking world was largely unaware of many of these aspects, but Wilson’s highly publicised work, which also emerged in paper back, rectified this large scale ignorance. Certainly there was an elite that knew a great deal more, but it seems only to have been confined to the enthusuastic few “in the know”. Clearly, from Charles’ and O.K’s comments above there is a great deal more yet to come to public attention among us Anglophones, such as the various relics mentioned above. They are certain to remain unknown until such time as another Wilson arises to take the same time, patience, labour and effort to bring them to a more common acquaintance. The world is much larger than the regrettably mutually unknown and diverse mother tongues confined to local pockets in Old Europe, and yet the various forms of English are now the most universal and common means of language communication in the Western World, and so these important aspects will continue to remain largely unfamiliar and unrecognised..","date":"2013-08-24","mins":"5:32 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41966","author":"daveb_of_wellington_nz","post":"Hungarian text with English translation of Funeral Sermon & Prayer can be found at: http://1moment.hu/halotti beszed.pdf Essentially it relates how the Fall of Adam brought death into the world (Genesis 3), with intercessory prayers to the Saints for the deceased. I saw nothing there linking it to the redemptive act of Christ or the Shroud. Possibly the text of the Mystery Play might be worth pursuing. Following Hugh’s lead it might be that the hymns give only Latin texts of various canticles used in the Western Church liturgy such as a contemporary version of an Easter Exsultet..","date":"2013-08-25","mins":"4:33 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41940","author":"daveb_of_wellington_nz","post":"Extract from Wiki: “The Codex Pray, Pray Codex or The Hungarian Pray Manuscript is a collection of medieval manuscripts. In 1813 it was named after György Pray, who discovered it in 1770. It is the first known example of continuous prose text in Hungarian. The Codex is kept in the National Széchényi Library of Budapest.” “One of the most prominent documents within the Codex (f.154a) is the Funeral Sermon and Prayer (Hungarian: Halotti beszéd és könyörgés). It is an old handwritten Hungarian text dating to 1192 1195. Its importance of the Funeral Sermon comes from that it is the oldest surviving Hungarian, and Uralic, text.” “The Codex also features a missal, an Easter mystery play, songs with musical notation, laws from the time of Coloman of Hungary and the annals, which list the Hungarian kings.” You’ll need to research further for any more detailed info. Briefly, Hungary came into existence in the late 9th century, when Finno Ugaritic Magyars occupied the middle basin of the Danube. The structure was essentially tribal governed by various warring princes. With raids across Europe. Both the Eastern and Western churches strove to draw them into their orbit. Their raiding efforts suffered severe reverses under the German king Otto I in 955, and the Magyars began to be influenced by Christianity. Embassies were sent to Holy Roman Eemperor Otto II, and in 975 Magyar leaders were received into the Western Church. Stephen I applied to Pope Sylvester II for royal insignia, and according to tradition was crowned king on Christmas Day 1000. This was yet another one of the marvellous achievements of the Ottonians and Pope Sylvester II. I would surmise that the Pray Manuscript was intended as some kind of handbook for use in meditation and worship in the Hungarian language. Its date of 1192 95 places it some nearly 200 years after the coronation of Stephen I, when it would seem that Christianity would by that time be well established. Its composite form might suggest a setting down in print of diverse oral worship practices that had developed over that period. Its primary interest in Shroud forums lies in its striking graphics which are strongly suggestive of an early acquaintance of the nature of the cloth and its image well before 1204. Whether the Funeral Sermon, the Easter Mystery Play or the various hymns may suggest more specific allusions would require a detailed study of the translation of their texts. However the original oral texts might well predate the knowledge that gave rise to the Shroud like graphics. As you may well surmise I am only trying to attempt some intelligent guess work here..","date":"2013-08-25","mins":"7:56 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41982","author":"daveb_of_wellington_nz","post":"Amazon runs a number of ads for copies of the Pray Codex, but says it is temporarily out of stock. No indication of when or if it will become available again. Clearly there are copies of it out there somewhere! Anyone?.","date":"2013-08-25","mins":"6:22 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-41772","author":"daveb_of_wellington_nz","post":"Check out the conclusions of Mc Crone & Nickell, and you’ll discover why it’s not such a bad idea!.","date":"2013-08-22","mins":"4:19 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42044","author":"daveb_of_wellington_nz","post":"I reiterate my comment at #24: Despite some of Wilson’s faulty research, I believe he has done more than most others to RAISE AN AWARENESS OF THE SHROUD within the English speaking world.(etc)…” I was 40 years old when Wilson published his book in 1978, and as I discussed in that comment it was a revelation to me. I realised then that even at age 40, I still had a lot to learn. I do not need the comments of a paranoid Quebecois cartographer to deny me the reality of that experience and who at that time had still to master his first French reader “Jacques & Jeanne” or whatever. Others may be interested in exploring alternative but connected hypotheses to those of Wilson if they have not already done so. – “CHAPTER I. Acheiropoietos Jesus Images in Constantinople: the Documentary Evidence”***Daniel C. Scavone, University of Southern Indiana; http://www.scribd.com/slavisa jevtic/d/66288478 1 – Jack Markwardt’s 1998 paper at Dallas “Antioch and the Shroud” http://www.shroud.com/pdfs/markward.pdf – Markwardt’s subsequent 2008 paper “ANCIENT EDESSA AND THE SHROUD: HISTORY CONCEALED BY THE DISCIPLINE OF THE SECRET” http://ohioshroudconference.com/papers/p02.pdf Of course all of these are hypotheses supported by whatever documentary support and argument that the authors can muster in the light of whatever scarce information can be discovered. As ideas, they are not dogmatic assertions that need to be shot down in flames, but are to be pondered and compared with whatever other hypotheses may be offered. That is how human knowledge advances. Of course professional historians may denigrate the efforts of those not within their ivory towered coterie – they have nothing better to offer! But when has Academia ever been on the side of the Shroud? Not once since the time of Yves Delage in 1905!.","date":"2013-08-26","mins":"5:05 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42089","author":"daveb_of_wellington_nz","post":"O.K.: There are different printings of Wilson’s 2010 book. In my soft cover Bantam Press edition, the example cited by Charles is on page 9 and the purpose of including the “reconstruction” is merely to illustrate a point made in a paragraph on previous page 8 explaining how the head to head frontal/dorsal images came to be in that form. Whoever the artist cited, none of them had the advantage of Secondo Pio’s or Guiseppe Enrie’s photographic negatives demonstrating that the original cloth image is in fact a mirror image, nor did they have access to the 3 D imagery of 20th century VP 8 analysers. In that respect, Wilson’s depiction is the more accurate, showing the left hand over the right and with knees bent. If they had known a little more about crucified bodies, and given some rudimentary thought to how the image might have been formed they might have got it right. At least they placed the hands correctly on the pelvis region for their straight legged depictions as it generally requires bent knees or long arms to place the hands on the pubis. Perhaps the point of Wilson’s citing the “della Rovere” work was to indicate that some understanding of the placement of the imagery was already appreciated by 17th century artists. They would not have had access to the Pray manuscript discovered in 1813. I have often noticed that those who achieve major successes in life often do so by taking short cuts lamented by more thoughtful minds, perhaps more plodding. I have known top professionals who rose to become directors of major enterprises. They relied on others to attend to mundane but absolutely essential details. Their contribution was to cut to the chase, make the point, and to let others attend to whatever was necessary. Generals attend to strategy and subordinates attend to tactics. Publication deadlines have to be satisfied, and sometimes the cursory is the only right answer for the time available. Scientists may prefer to seek the absolute truth in their research, but engineers need a satisfying answer immediately. There are casualties in even the best planned battles. Scholars have time to complete their research theses; authors have deadlines to meet! Wilson’s achievement was to publicise. Others after him will hopefully complete a more fulsome task..","date":"2013-08-26","mins":"5:00 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42123","author":"daveb_of_wellington_nz","post":"Re O.K. Posting Aug 26, 6:10am ~#64, Savio Waliszewski hypothesis: I see a few problems with the hypothesis. 1) Identificaton with the Arculf cloth. Arculf’s story is related at least second , possibly third hand, it may have been elaborated, the story says it is about 8ft long. If it’s the TS we have to assume it was folded in half, or that Arculf guessed wrongly at its length. How was Jesus transferred from the cross to the tomb? Maybe he was carried in the Arculf cloth, which as it would contain blood would need to be included in the burial linens, possibly as an outer wrapping. Hence a tradition that it was part of the burial linens. Guesses are free! 2) S W chart shows Shroud in Jerusalem 33 200. More likely it was transferred to Antioch after Herod’s persecution following execution of Stephen, and unlikely to be in Jerusalem after Roman suppressions 68 72 AD, Masada and all that. Unlikely to be included in Helena’s discoveries or she would have appropriated it along with everything else she took. Check Markwardt’s papers for various deliberately obscure references to Shroud in early Mesopotamian liturgies. JM postulates TS taken from Antioch to Edessa only with the impending destruction of Antioch by both earthquake and Persian invasions. Explains Edessan appropriation of discovery story in a wall, which was more likely in Antioch. Conceivable that Arculf sheet taken from Jerusalem to Constantinople ~1050. Is there any kind of record to support this? 3) S W chart shows Shroud in Constantinople until 1247. Letters from Patriarch to Pope Innocent III complain that the Crusaders took the Shroud following the sacking of Conatantinople in 1204. 4) How did Geoffrey de Charnay come by the Shroud? Check Daniel Scavone’s paper, “BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400”. Scavone gives a credible trail through Othon de la Roche, Lord of Athens, ancestor of Jeanne de Vergy (part of her dowry); explains tradition of Shroud in Besancon, which she replaced with a copy, explains D’Arcy memorandum resulting from his confusion with the painted copy. Http://ohioshroudconference.com/papers.htm.","date":"2013-08-27","mins":"8:37 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42156","author":"daveb_of_wellington_nz","post":"The reasons why Academia and the Scientific Community refuse to take the Shroud seriously has less to do with the work of Ian Wilson than the stiff neckedness of their ivory towered residents. It was thus always so. Refer to the 1902 letter of Yves Delage to the editor of ‘Revue Scientifique’. “… a religious question has been needlessly injected into a problem which in itself is purely scientific, with the result that feelings have run high, and reason has been led astray, If, instead of Christ, there were a question of some person like a Sargon, or Achilles or one of the Pharaohs, no one would have thought of making any objection … I have been faithful to the true spirit of science … I recognize Christ as a historical personage and I see no reason why anyone should be scandalized that there still exist material traces of his earthly life.” Frustrated by the hostile reception his paper had received, and the disinterest of Turin, this agnostic Professor of Anatomy turned his attention to other interests. Wilson writes that since then with the publication and circulation of Pia’s negatives, the situation has changed radically, citing the work of such medical men as Barbet, Moedder, Bucklin, Willis et al. However I believe the stiff neckedness persists and I cannot be so optimistic. A certain Galilean prophet of the first century had a similar problem with the learned establishment of Jerusalem, apparently with the sole exception of one Nicodemus. Universities and other Research Institutions rely on their funding from various commercial enterprises, hoping to turn research into profits with new products. Even government fundings hope for economic returns, and philanthropic grants are usually specific goal directed. There are no profits or economic returns to be made from research into the Shroud and so it is ignored. Research on the TS can only come from voluntary expert enthusiasts, sometimes with personal agendas, often retired from their professional life, or with the hope that their work might sell a book which they can write for meagre returns for their efforts. Even volunteers have to eat. Even movies of the Shroud are made with a distracting “Gee whiz!” factor in order to boost sales, but which are counter productive to serious research. Until such time as a Bill Gates or some other philanthropist can be pursuaded to fund essential research into this relic, despite it being overly protected and confined by its ecclesial guardians, any such research can only continue on an amateur basis. Hence it will continue to be ignored by the various “professional” bodies, and they will refuse to take it seriously..","date":"2013-08-27","mins":"6:00 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42169","author":"daveb_of_wellington_nz","post":"Not being clinically qualified, I do not expect to be able to correct the condition of any deeply ingrained pathological anti Wilson paranoia. I have stated elsewhere that I consider Wilson’s main contribution was to publicise much of the Shroud research and information that remained largely unknown within the Anglophone world. That is a large sector of humanity, even within the confines of Canada. Paul Vignon was a protege of Yves Delage, and we know the reception that their corroboration elicited from the scientific community. Despite the expertise of many later researchers, their Shroud investigations were largely on a voluntary basis, often prompted by a religious persepective. Even Barbet’s work is pervaded by his sense of religiosity. The STURP project comprised self appointed experts working only in a spare time capacity, away from their more usual corporate employments. STURP was only made possible by the financial efforts of Thomas D’Mulhalla, a nuclear physicist who owned and ran the firm of Nuclear Technology in Connecticut. D’Mulhalla with others had acquired through gifts and loans some 2.5 million dollars of advanced equipment, without which STURP would have been a No go! Likewise the various promotions, such as Silent Witness were only possible by the enterprise and financial credibility their promoters could secure from their financial backers. In the area of Academia, there is no such funding available for Shroud research, and so any such further work will remain undone, until such time as there is sufficient financial interest. Meantime it will be limited to voluntary experts with sufficient enthusiasm..","date":"2013-08-27","mins":"8:19 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42215","author":"daveb_of_wellington_nz","post":"Charles: I think you mistake my point. I for one do not have an unquestioning belief in Ian Wilson’s work, and I see evidence in many pro authenticity papers that neither do their authors. Wilson’s work began I believe sometime in the 1970s, he has continued to pursue the investigations he began, certainly up until the last few years. Clearly other information not available to him when he began, has come to light subsequently and needs to be considered. I consider it not at all implausible that perhaps Coptic Christians may at one time have been guardians of important crucifixion relics, burial cloths, and yes even the relic we call the Turin Shroud, perhaps even for some centuries. What I and others object to is not thoughtful criticism of Ian Wilson’s work, or the highlighting of some his errors, but the frequent ad hominem castigating of the man that we often see on this site. Wilson’s publications I believe were not intended as scholarly papers for academic journals, but were intended to inform the public at large of significant information concerning what is arguably the most important relic in Christendom, if it is at all authentic, If it is authentic, then it is not good enough for academicians to confine any knowledge they may have on it, to their own inner circle. I believe they have a moral duty to inform the public, particularly if they have any kind of Christian affiliation. Wilson is one of the few who have responded to that challenge as best he can. Perhaps in the electronic age, Publication Houses may find it difficult to promote such works and they look for a populist angle, which distracts from the truth. I have mentioned that funding is an issue, “Shroud Research” is hardly a professional calling which puts food on the table, and it seems can only continue as a part time hobby by those with the means to sustain it..","date":"2013-08-28","mins":"7:49 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-40221","author":"daveb_of_wellington_nz","post":"The “rain storm” is an invention, and sure, it made the film version more dramatic. The synoptics mention an earthquake, and that the sky was darkened, Luke incorrectly interpreting it as the sun being eclipsed. The likeliest explanation was one of the frequent dust storms blowing from northern Africa. If you want to write a novel, bring in a rain storm by all means. But there’s no scriptural evidence for it, even if it was the spring season..","date":"2013-07-31","mins":"9:54 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40292","author":"daveb_of_wellington_nz","post":"Yannick Clement is so taken up with his own ideas, that he asserts without reason that the earthquake and the darkness were no more than literary devices. All the synoptics refer to the darkness, Luke come lately, a Greek with less understanding of Judaism and the timing of the Passover festival, wrongly ascribes it to an eclipse, which oddly enough corroborates the fact of the darkness as being a reality, for which there is a rational explanation, a dust storm. Even John refers to an earthquake, ascribing it to the moving of the boulder against the tomb. This sounds like an after shock, of which we have had several felt in Wellington over the last week. But there are no earthquakes in Quebec, so they can only be literary devices. Pah! Earthquakes and darkness are fairly public kind of phenomena, and there would be plenty of witnesses around to deny that they happened, if they had not. But these events were included and accepted in the final redactions of the gospel accounts. Portents are certainly seen as useful literary devices signifying supernatural intervention, even Shakespeare used them, check out his Julius Caesar, Act 2. But natural events are natural events, they occur, how we interpret them is a matter for conjecture. The gospel writers clearly saw the coincidence of these natural events, as portents. But that does not signify that they did not happen..","date":"2013-08-02","mins":"12:02 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40324","author":"daveb_of_wellington_nz","post":"Do you also attempt to teach your grandmother how to suck eggs??!!.","date":"2013-08-02","mins":"4:28 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-9881","author":"daveb_of_wellington_nz","post":"Dear Annie Cee, I have just spent a full year with my Bible Study Group, studying each chapter of Reverlations, one per fortnight, and we’re now coming up to the home straight, so I think I know a little bit about Revelations by now, and there’s probably not a great deal you can tell me about it that I’m unlikely to know already. You’ll note that chapters 2 & 3 address the Book to seven significant churches in Asia Minor. Because of the symbolism of there being seven churches, the author probably does intend the Book for the entire church. But even in the 3rd c its canonicity was still being disputed until Athanasius in the 4th c when it was finally accepted. My point in saying that the purpose of the book was to give hope to the early persecuted church, was not to limit its value to later generations, but to state that its purpose is not to set a literal calendar for the end time, as many sects and cults are prone to doing. You may believe what you wish as to where Jesus may have been born, either Bethlehem or Nazareth. Both Luke and Matthew are both set on establishing that Jesus is the Messiah as foretold in the prophecies, and to this end they both have quite different stories to assert that he was born in Bethlehem. The only record of Herod’s slaughter of the Innocents is in Matthew and nowhere else. But there were several reprisals aganst rebellious Jews at this time. Matthew is concerned to establish Jesus as the new Moses, so he wants to bring him out of Egypt, but he needs a story to get him there first. Incidentally, Luke seems to know that Mary and Joseph’s home town is Nazareth, but Matthew apparently does not, but uses Archelaus’ crucifixion of thousands of rebels to justify their settling there. I also happen to know quite a bit about Sir Isaac Newton. He was a misanthrope brought about by his mother having to abandon him to her parents when she remarried. There were few other scientists that Sir Isaac hadn’t had several feuds and differences with. Although a great scientist himself, he was not all that pleasant a person to cross. In later llfe, he turned to various forms of mysticism, including various apocalyptic works..","date":"2012-04-02","mins":"9:02 pm","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9890","author":"daveb_of_wellington_nz","post":"I think I originally came in when Ron [#3 comment] asked when would it be 2 millenia from the crucifixion. In #5 comment, my answer was April 7, 2030. But then I got side tracked by a lot of other issues from Annie Cee, you know like how Adam blamed Eve..","date":"2012-04-03","mins":"12:43 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9878","author":"daveb_of_wellington_nz","post":"One of the most scholarly works I’ve read on Jesus of Nazareth is “A Marginal Jew – Rethinking the historical Jesus – Vol 1”; by John P Meier; Doubleday 1991. Meier is a highly respected Biblical scholar, and he cuts his sources to the very bone. I suggest you Google him to satisfy yourself about his reputation. The discipline that Meier set for himself in this work, is to imagine a type of conclave whereby a Catholic, a Protestant, a Jew and an agnostic – all honest historians cognizant of first century religious movements – were locked up in the bowels of Harvard Divinity School library, and not allowed to emerge until they had hammered out a consensus document on who Jesus of Nazareth was and what he intended. “A Marginal Jew” is what Meier thinks that document would reveal. Part of his agenda seems to be a reaction against the “Jesus Seminar” type of approach. Some of the answers he comes up with might be hard for some conservative Christians to take. For example he asserts that Jesus was probably born in Nazareth rather than Bethlehem. He rejects most speculative assertions about Jesus life. One interesting conclusion is that he makes a decision to rely on John’s gospel to obtain a date for the crucifixion. Here are few of his summary extracts on Jesus’ birth and crucifixion, and other key dates: “Jesus of Nazareth was born – most likely in Nazareth, not Bethlehem – ca. 7 or 6 BC, a few years before the death of King Herod the Great (4 BC), After an unexceptional upbringing in a pious family of Jewish peasants in Lower Galilee, he was attracted to the movement of John the Baptist, who began his ministry in the region of the Jordan Valley around the end of 27 AD or the beginning of 28. … ” “In AD 30, while Jesus was in Jerusalem for the approaching feast of Passover, he apparently sensed that the increasing hostility between the temple authorities and himself was about to reach a climax. He celebrated a solemn farewell meal with his inner circle of disciples on Thursday evening, April 6 by our modern reckoning, and the beginning of the fourteenth of Nissan, the Day of Preparation for Passover, according to Jewish liturgical reckoning. Arrested in Gethsemane on the night of April 6 7, he was first examined by some Jewish officials (less likely by the whole Sanhedrin) and then handed over to Pilate early in the morning of Friday, April 7. Pilate quickly condemned him to death by crucifixion. After being scourged and mocked, Jesus was crucified outside Jerusalem on the same day. He was dead by the evening of Friday, April 7, 30. He was about thirty six years old. ” On that basis, the bi millenial of the crucifixion will occur on April 7 2030. Much and all as I have considerable respect for the scientific work of Sir Isaac Newton, I would not set much store on his calculations for the end of the world. I would also not set much store on interpretations from the book of Revelations for the end time either. Essentially the purpose of this Book was to sustain hope for the early persecuted church by providing an apocalyptic vision for them of the New Jersualem. There is too much analogy and symbolism for the numbers to be taken literally. Jesus himself said no one knows when it will happen, only the Father. If Max Patrick Hamon happens to read this, he may have his own particular comments about some of these aspects..","date":"2012-04-02","mins":"6:51 pm","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9925","author":"daveb_of_wellington_nz","post":"“Our position is truly temporal in this realm. Jesus rescues us from that with the demonstration of Eternal Life through the Resurrection but He gets us there by also demonstrating that our death is also temporal. ***The shroud is the document of His death, it’s current emptiness begets the Hope of His Resurrection and with it our own invitation to Eternal Life.***” Hey Chris, I love that last sentence of yours in #28. Is it yours or copyrighted? I’m going to have to use it myself sometime! Many thanks! daveb.","date":"2012-04-03","mins":"5:27 pm","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-17594","author":"daveb_of_wellington_nz","post":"Thanks for this, Kelly. From what little searching on the web I’ve managed to do, there certainly seems to be a great vacuum in our understanding of the evolution of human blood types, and there are several conflicting “authorities(??)”. One apparently reputable site asserted that human AB was only as recent as 1500 AD, which I think can be dismissed. At the other end of the spectrum, I came across a highly technical study “Evolution of Primate ABO Blood Group Genes and Their Homologous Genes”, Naruya Saitou and Fumi ichiro Yamamoto; http://mbe.oxfordjournals.org/content/14/4/399.full.pdf The authors examined the blood typing in gorilla, chimpanzee, and orangutan. I have no way of knowing how authoritative the paper is, and the paper can only be comprehended by specialists, with much being made of phylogenetic tree theory. From their Table 5, I surmise that A is dominant in chimpanzee, B in gorilla, and AB does seem to occur in orangutan, baboon. Gibbon and Java macaque. However the paper can only be interpreted by a specialist in such studies. In an earlier posting, I noted that there were significant AB occurring in such widely separated peoples as: Ainu, Kamluk, Bombay Hindu, New Guinea Papuan, and so on. North and South American indian populations seemed to be higly dominant in O only, as also are Australian aborigine and NZ Maori. It’s clearly an area where much more work needs to be done..","date":"2012-10-13","mins":"3:47 pm","url":"https://shroudstory.com/2012/10/13/just-how-old-is-the-ab-blood-type/","cat":"blood_studies","title":"Just how old is the AB blood type?"},{"id":"comment-15565","author":"daveb_of_wellington_nz","post":"Congratulations on producing your paper Yannick and getting it onto the web. I notice that you include cartography, geography and astronomy in your activities. Depending on how far you may have taken these interests, I suggest these might be adequate qualifications for you to attempt this litte project. I should like to see any attempts to map the surface of a human body frontal and dorsal, say a mannequin, on to a cloth. You can try the mappings with the cloth tightly wrapped around the body, or else merely draped over the body. I think the results may well illuminate what credible processes might be involved in producing the Shroud image. Clearly tightly wrapped will produce a different image from loosely draped. If the cloth is tightly wrapped and if the process is some kind of chemical contact process, then I think you might find that the mapping produces too wide an image for it to confirm that this was the process involved. On the other hand, if the cloth is loosely draped, it might produce the near orthogonal image that we see on the Shroud. But then we have to decide what might be a credible process that would produce the image. If it is a gaseous flow process, this would seem to contrain the paths of the molecules in some peculiar way. However if it was some kind of radiation or atomic particle process, then this might do it, but then we would have to ask what could the driving mechanism be that would enable this process? I hope that you will be able to find time to give this project some little thought..","date":"2012-08-29","mins":"4:25 pm","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-15594","author":"daveb_of_wellington_nz","post":"Max, This debate about the way the body was in the Shroud at the time the image process occurred, is precisely why I think it important that the body surface of a mannequin or somesuch should be mapped on to a shroud like cloth. There are serious geometric problems in most of the scenarios postulated, and the resultant image that we see. As far as miracles are concerned, I am open to the idea of a supernatural cause for the image. That shows me to be open minded about the possibility, but it doesn’t make me a miraculist, arch or otherwise..","date":"2012-08-29","mins":"9:45 pm","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-15572","author":"daveb_of_wellington_nz","post":"Footnote: Yannick, I stil think the mapping of a mannequin body surface on to a cloth is quite important. It has serious geometrical implications. Also, think about the leg calves, ankles and feet. How was the Shroud wrapped around these, to produce the images we see. They’re so narrow, it would seem that the cloth would even have to be doubled over itself if they were wrapped at all. This suggests to me that the cloth may only have been draped. Note that we already know that there are no images of the lateral aspects of these..","date":"2012-08-29","mins":"6:26 pm","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-15610","author":"daveb_of_wellington_nz","post":"I’d be a happy man if only the essentials of projective geometry were satisfied, never mind anything else. To understand better what I’m driving at, check out the Descriptive Geometry work of Gaspard Monge and Jean Victor Poncelet, both Frenchmen as it happens, so that should be congenial to at least two gentlemen on this site. Both Monge and Poncelet were associated with the Ecole Polytechnique, and both worked with Napoleon. Monge is one of 72 names inscribed on the Eiffel Tower. They were both following the path set out by another French mathematician in the 17th century, Girard Desargues, I studied Descriptive Geometry in my first professional year at Engineering School, 55 years ago, so it’s not a new science. Most of it derives from the work of Monge and Poncelet, and is an essential training for engineers and architects to train them in thinking 3 dimensionally, as well as having its own pragmatic value. The Wikipedia articles on them are barely adequate. The develoment of surfaces of 3 dimensional bodies has a direct relevance to the image we see on the Shroud..","date":"2012-08-30","mins":"1:53 am","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-15634","author":"daveb_of_wellington_nz","post":"I can understand that a body vapour may react with the starches/saccharides on cellulose fibrils to produce a monochromatic colour. But how that can produce a coherent image of an object with high resolution, without geometric distortion, and with 3 dimensionality encoded, will I think remain an eternal mystery to me..","date":"2012-08-30","mins":"7:26 pm","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-15642","author":"daveb_of_wellington_nz","post":"Sorry, Anoxie, Thanks for the trouble you went to in providing the comment and visual, but I still don’t think I can hypnotize myself into buying it..","date":"2012-08-31","mins":"3:57 am","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-15632","author":"daveb_of_wellington_nz","post":"Do I read Max correctly, that he is denying the possibility of miracles? If so, he should check out the requirements of the Vatican Congregation for the Causes of Saints, current prefect Cardinal Angelo Amato. Adequate attestation for the occurrence of miracles is rigorously demanded in each of the steps towards the process of canonisation. Extract: “The miracle may go beyond the possibilities of nature either in the substance of the fact or in the subject, or only in the way it occurs. So three degrees of miracle are to be distinguished. The first degree is represented by resurrection from the dead (quoad substantiam). The second concerns the subject (quoad subiectum): the sickness of a person is judged incurable, in its course it can even have destroyed bones or vital organs; in this case not only is complete recovery noticed, but even wholesale reconstitution of the organs (restitutio in integrum). There is then a third degree (quoad modum): recovery from an illness, that treatment could only have achieved after a long period, happens instantaneously.” I understand that the medical team assessing the alleged miracle frequently comprises or includes non Catholic medical specialists. A genuine Christian certitude on any matter of faith, including the Resurrection must at least start from some rational basis, otherwise it might be classified as fanatacism..","date":"2012-08-30","mins":"4:49 pm","url":"https://shroudstory.com/2012/08/28/mr-prolifics-latest-an-exceptional-article-by-yannick-clment/","cat":"blood_studies","title":"Mr. Prolific’s Latest: “An exceptional article by Yannick Clément”"},{"id":"comment-19537","author":"daveb_of_wellington_nz","post":"I can understand where Yannick is coming from, but there’s not many Catholics throughout what remains of Christendom prepared to go that far. In order to deny the virginal birth, Yannick has to deny the doctrinal truths contained in both Matthew’s and Luke’s infancy narratives. The great German philosopher Hegel observed that all historical movements seemed to go through a threefold process of action, reaction and integration, or as is often expressed: thesis, antithesis, synthesis. It seems that Quebecois Catholics are going through the second stage of this process, in a similar way that the British reacted against the strait jacket of Victorianism. A similar situation prevailed in Ireland, and now with all their covering up of abuse cases, the Irish hierarchy have lost any authority they once had. Such reactions can never be the final answer. The truth has to be distilled in a valid synthesis over a period of time. The doctrine of Mary’s PERPETUAL virginity seems to have arisen in the fourth century, and as Yannick says, it may well have served a very useful purpose in converting pagans to Christianity. That has to have been a good result. Nevertheless the fact remains that adoption was very common in ancient times and Mary & Joseph seem to have been the type of generous people who may well have practised adoption. There are even examples today of childless families practising large scale adoption. Augustus Caesar owed his imperial role solely due to adoption, and other emperors likewise. Even by the evangelists using the Greek word “adelphos” in preference to “anepsios”, it still cannot be categorically asserted that Jesus’ kin were connected by blood, especially in view of these common adoptive practices, J P Meier notwithstanding..","date":"2012-11-27","mins":"6:29 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"id":"comment-19554","author":"daveb_of_wellington_nz","post":"Further to my comments above concerning Roman & Jewish practices on adoption. St Paul’s analogy on adoption in asserting that we are adoptive heirs in Christ can be found in Romans 8:15, 9:26 and Galatians 3:26. Although to some of us now, the analogy might appear a little strained, clearly Paul considers that his readers will relate to it very well, and to me this conveys how widespread the practice was. There is an excellent commentary on these scriptural references, with significant comment on the practice and entitlements of adoption at: http://www.abideinchrist.com/messages/rom8v15.html As well as August Caesar being adopted, the URL makes the point that the emperor Nero was also adopted..","date":"2012-11-27","mins":"3:27 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"id":"comment-19569","author":"daveb_of_wellington_nz","post":"Isaiah 7:14 “Behold a young woman will conceive and bear a son and his name will be Immanuel…” The Book of Isaiah was written over a period of two centuries. This extract is from the first book, written about 740 – 700 BC. The reference to the son is sometimes incorrectly interpreted as referring to Cyrus II who liberated the exiles from Babylon, but this is too late. Isaiah addressed these words to the young Ahaz King of Judah about 733 BC, promising that Jaweh would send him this sign, in his war against Israel & Syria. When the Septuagint was written in Greek about 200 BC, the translators used a word for young woman which came to be interpreted as “virgin”. The evangelists e.g. Matthew, picked this up and applied it to the virginal birth of Jesus. Other remarkable births occur in the OT, e.g. The Genesis story of the birth of Isaac to Sarah when she was well past normal child bearing days. There are others. It seems to be an ancient writers’ convention of signalling that the person being born can be expected to be someone quite remarkable, and is a sign that the person is a sign of God’s (or the gods’) intervention perhaps in a time of some turmoil..","date":"2012-11-27","mins":"8:41 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"id":"comment-19581","author":"daveb_of_wellington_nz","post":"Senior110 asks some profound questions, but they are somewhat off topic for this website; I’ll endeavour to give my own brief answers, but I don’t expect that others will necessary agree. I feel he needs to do some reading by good modern Catholic authors which may help to enlighten him. I suggest he might start by.reading such a simple book as “Jesus of Nazareth” by Pope Benedict XVI – Josef Ratzinger, Doubleday English translation 2007. The book is simple, authoritative and takes account of modern scholarship and I feel strikes a reasonable balance between conservatism and liberalism. He can then advance from that to other works of scholarship. But he should be warned against takng too seriously the liberalism of those who seek to reduce Christianity by a type of rationalism, such as certain writers in the so called “Jesus seminar” brigade. S110 mentions allegories and metaphors and wonders where truth is to be found. I’ll confine my comments to the gospels by way of illustration. Briefly, the evangelists were less concerned to write history than they were to proclaim Jesus as Christ. Do not expect them to write history in the manner of the Jewish historian Josephus for example. They do draw on history, but they were speaking to a people who had their own perspective of the world, and their message had to be understood inside that perspective if it was to be effective. His questions: (1) The early and medieval Church considered that the souls of the just who predated Christ, were in a state called Limbo – they awaited the saving power of Christ’s redemption. It may have been taken from Matthew’s Passion narrative which recounts how the dead came out of their tombs upon Christ’s death on the Cross. Or was it just the perception from the earthquake? My own Bible Study group recently discussed this question in our study of I Peter, who has Christ descending to Sheol to preach to the dead. Or there may be another interpretation of the text. My own view is that we are constrained by our perception of a three dimensional world which is time dependent. But with the divine there is no time – Everything is Now! There is no before nor after. We only ask the question because of our perception of time. But in reality, I suspect that the question may have no real meaning in terms of the spiritual or divine, neither of which are material substances. (2) The general consensus of most scholars is that Matthew was compiled sometime after the Fall of Jerusalem in 70 AD. Some will disagree with that view. About 90% of Mark which most maintain was written earlier, can be found in Matthew, [A dissenting view gives Matthew priority, but I’ll stay with the majority. Encyclopedia Britannica claims that Matthew was written after 70 AD for example.] I maintain that Matthew’s “this generation will not pass away before these things occur” refers to Christ foretelling the Fall of Jerusalem. Matthew is concerned here in demonstrating the foreknowledge of Jesus as part of Matthew’s understanding of who Jesus really was. But the story is also mixed in with a story about the Last Judgement, but no one knows when this will happen. Certainly there was an expectation in the early Church that Christ would return sometime soon. Some of Paul’s epistles, many of which were written before 70 AD, warn against this early expectation and seem to seek to dispel it, as with God, “a thousand years is but a day”. (3) I do not agree with a certain popular view, seen in some postings here for instance, that the God of the Old Testament was a God of hate or vengeance. What I feel we have lost is a sense of God being all powerful, a God of judgement, concerned for justice, and a God of righteousness, because it is fashionable to be uncomfortable with these ideas of God – we are rightfully frightened of a power that is greater than our own mere humanity. He is a jealous God who will not tolerate the lies of false gods. He is also a God of consequences. The punishments that are inflicted on the wicked are seen as a natural consequence of sin, of what happens when one falls away from God. The prophets, and in particular the minor prophets, were concerned with justice for the poor, the weak, the orphans, the widows, and they railed against those who exploited them with a pretence of being holy and following the Law. God is even patient with Pharaoh in the Exodus story – He gives Pharaoh twelve opportunities of releasing His people from slavery. There is much more that could be written on this topic. The Book of Job for example seeks to find an explanation for why bad things happen to good people. I hope that these few notes might go some little way in helping to resolve some of the issues mentioned..","date":"2012-11-28","mins":"6:56 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"id":"comment-19627","author":"daveb_of_wellington_nz","post":"Dear Senior110: I’m sorry to have to dispel your illusions, but your Neale Walsch is just another fake, a false prophet. Our secular world has left a spiritual vacuum in the hearts of people, It probably began with Nietsche in the 19th century who proclaimed the “God is dead! We have killed God!” But as St Augustine said: “Our hearts are restless, O God, until they rest in Thee!” That is the truth, so that our modern generation looks wherever it can, to fill the vacuum that has been wrought. Is Walsche’s version of religion, the version that thousands would live and die for, to be martyred for? Does it uplift the spirit? Does his relativism provide motivation to do good to do others? Does it motivate to peach the gospel of a saving Christ? To set high standards of behaviour? I don’t see how it can do any of these! His so called “Conversation with God” have sold over 3 million copies! Did he give away the profits to charity? Does he give the same example in his life as did Mother Teresa of Calcutta? I suggest you read her “Something beautiful for God” if you are searching for something worthwhile in your life. Relativism is just another modern heresy! Check out the web site: https://www.christiancourier.com/articles/175 neale walsch a new guru for the gullible for a thumbnail comment on this fake! God has given us the freedom to believe whatever we will, and you can believe whatever you like. You say you were baptised a Catholic some 25 years ago. But I’m afraid if you want to discover the truth, you will have to work very much harder at it, and don’t be fooled by popular gurus whose imaginations run riot, whether televangelists or writers of religious fiction!.","date":"2012-11-29","mins":"5:57 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"id":"comment-19655","author":"daveb_of_wellington_nz","post":"Neale Walsch – an eclectic mixture of gnosticism, relativism, pantheism and reincarnation. All heresies. Something for everybody, No truth for anybody! “Conversations with God”? or Conversations with himself? Or Conversations with the father of lies. I’ve known acquaintances who’ve heard voices, but it usually passed when returning to their medication!.","date":"2012-11-29","mins":"9:33 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"id":"comment-19726","author":"daveb_of_wellington_nz","post":"Thanks for this Kelly. Defiitely tin hat territory. I also needed a tightly bound cincture to avoid excessive side splitting from laughter. Is this “getthetruth” site known for sustained tongue in cheek irony, or is it intended to be serious conspiracy theory? Much of it seems dependent on commonly available picture morphing software – you can morph any image to any other. I see they’re also demonising the Royal Navy insignia. ..","date":"2012-12-02","mins":"12:08 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"id":"comment-8361","author":"daveb_of_wellington_nz","post":"This has to be one of the most informative and professional posts that I’ve so far seen on this site. And it’s AB! At 5% AB worldwide and only 3% AB in France where Shroud first emerged in West, together with the match for Oviedo, it has to be significantly persuasive for authenticity. Also no degradation of blood groupings!.","date":"2012-02-16","mins":"3:08 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-19521","author":"daveb_of_wellington_nz","post":"It’s wonderful having a person of Kelly’s standing on board to give us authoritative info and dispel the various myths concerning blood groups, DNA etc. I haven’t seen the doco LOST TOMB OF JESUS, but presume it refers to the Talpiot tomb, on which there has already been much comment on this site. I’ve made the point before that adoption was very common throughout the ancient world as high mortality rates resulted in prevalance of orphans. Under both Jewish and Roman Law adoption gave the same rights as birth. J P Meier in “A Marginal Jew” is insistent from the Greek word used in Mark’s gospel that the “brothers and sisters” of Jesus were precisely that, not half brothers or cousins as Jerome and other 4th century doctors of the church would have it. The 4th century doctrine of.Mary’s perpetual viginity is still viable if said brothers and sisters were adoptees. It could provide another explanation of why family members in any such tomb, regardless of whether its in Talpiot or elsewhere, would not share the same DNA. Pellegrino, one of the Talpiot authors is on record as saying that no evidence of human remains were found in the so called Jesus ossuary, except a small carpal bone, but there were cloth fragments. Pellegrino was hopeful of making some scientific comparisons with the Shroud cloth, but I believe nothing ever came of it. Another wasted opportunity!.","date":"2012-11-26","mins":"2:59 pm","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"id":"comment-8452","author":"daveb_of_wellington_nz","post":"Lots of worthwhile & informative comments there! Excellent reading. Thanks to Ron, Chris & especially Max. Dr Kelly sure hit the jackpot!.","date":"2012-02-19","mins":"2:38 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-8492","author":"daveb_of_wellington_nz","post":"It is but one step from healthy scepticism to downright cycnicism! “I am too much of a sceptic to deny the possibility of anything.” T H Huxley “cynic: a blackguard whose faulty vision sees things as they are, not as they ought to be.” Ambrose Bierce: ‘The Devil’s Dictionary’ “Cynicism is intellectual dandyism without the coxcomb’s feathers” Gerge Meredith: ‘The Egoist’.","date":"2012-02-19","mins":"10:05 pm","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-196365","author":"daveb_of_wellington_nz","post":"My money would still be on Barbet. He discusses the blood flows from the wrists in considerable detail, the scenarios he proposes for the act of crucifixion are I think credible, have several advantages in military efficiency, and include detailed anatomical and triangulation analysis. I feel that Zugibe’s experimental attempts appear to me to be a little too contrived and represent an inadequate depiction. Barbet of course envisages that the prisoner is nailed to the cross beam with his arms stretched out along and parallel to it. On lifting the cross beam onto the upright, the body then sags, and the arms take up a position at 65 degrees to the vertical. He postulates a type of seesaw motion as the prisoner seeks to continue breathing by raising and lowering himself on the nail through the feet. Of the blood flows emanating from the wrists he writes: “… The body thus alternates … between a sagging position and a state of asphyxia and a raised position which brings relief. In each position the vertical flow of blood, which coagulates slowly on the skin, would make a slightly different angle with the axis of the forearm. The flow furthest from the hand, which is at an angle of 65^o, corresponds to the sagging position. The one nearest the hand corresponds with the raised position and gives an angle from of from 68^o to 70^o.” He supports this scenario with further geometrical and anatomical analysis, the amount of stretch available at the joints, and some Pythagoras, etc. Altogether a more thorough analysis than the toy experiments of Garlaschelli and Borrini..","date":"2015-04-14","mins":"9:16 pm","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-196395","author":"daveb_of_wellington_nz","post":"In Barbet’s scenario, I should think that bent elbows would be quite excluded. Remember he is envisaging that the arms are stretched along the cross bar, and the wrists nailed to the cross bar with the arms fully extended. As the cross bar is lifted up onto the upright, the body sags with the full weight taken by the arms only. As the body becomes vertical, simple statics will show that the tension in each arm becomes 207 lb at 65^o. It is only when the feet are nailed to the upright, that this tension can be relieved. I get the impression from Barbet, that he believes he can confirm the 65^o as much from the limits of joint movement between shoulder and upper arm and the consequential triangulation, as much as from the blood flows. The lifting of the crossbar onto the upright does not seem admissible in Zugibe’s scenario where his volunteer is attached to a fixed cross already in position. This allows Zugibe to claim that the arm tensions are much less than 207 lb, and that therefore wrist nailing is not required. Even so, with any significant arm tension at all, with arms outstretched, I should think it very difficult indeed for any traumatised victim to sustain a bent elbow at all. Triangulation from a rigid cross bar would seem to argue against it. We are of course only seeing the blood flows on the outer surface of the arm. One question might need to be resolved by some experimentation, that is, to what extent would the surface contours of the arm under tension provide a track for blood flows along the arm at the angle of 65^o, or would they indeed be vertical. Would the head of the nail jam the wrists hard against the cross bar so that the flow is constricted, or is it sufficient if the wrists are merely pinned to the crossbar, allowing a gap, that would not constrict the flow. The viscosity of the blood at the time of flow, might also be a significant variable. Yet another aspect might be, at what time during the execution did these now visible flows occur? Did they occur while hanging from the cross, or did they occur after the victim had died during his removal from the cross? If the latter, than all bets would be off, as the flows would then depend on the incidental disposition of the arms at the particular time the flows occurred. But that might depend if wrist wounds can bleed after death. My own sightings of blood flows in an abattoir suggest to me that they might well do so, but I would be happy to be corrected by professional opinion..","date":"2015-04-15","mins":"7:20 am","url":"https://shroudstory.com/2015/04/11/new-garlaschelli-and-borrini-study/","cat":"blood_studies","title":"New Garlaschelli and Borrini Study"},{"id":"comment-8280","author":"daveb_of_wellington_nz","post":"As a sometime amateur editor, I’ve discovered that proof reading is an acquired skill, which requires remarkable focus, even so typos still creep through, particularly if you’re prone to complex new word synthesism! Read it through three times before hitting the Post Comment button!.","date":"2012-02-15","mins":"7:28 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-8325","author":"daveb_of_wellington_nz","post":"If Colin is correct in his assertion of no degradation to AB (and I see no reason to doubt this), then that has remarkable implications for the Turin & Oviedo artifacts. Both are alleged to show AB blood residues, whereas world wide AB is only 5.1%, Middle East – 6 – 8%, whereas France where Shroud first emerged in the West is only 3%. The random probability that BOTH should show AB has to be very low, say 0.25%, or conditional probability that one will show the same as the other, only ~5%, but my stat math is now starting to get a bit rusty..","date":"2012-02-15","mins":"6:22 pm","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-8257","author":"daveb_of_wellington_nz","post":"If there were in fact no degradation and the AB for Turin and Oviedo are true readings, then this is reasonably significant. Wikipedia has an extensive table on the distribution of Blood Groups, world wide and for particular indigenous populations. The most common is O at 44%. O is extremely prevalent in New World populations, and even reaches 100% in some cases. A and B are 34.8% and 16.6% respectively. From western Europe through to eastern Asia there is a gradation in the percentages from A to B. Norwegians and Swiss being 50% A,, 7 – 8% B. On the the other hand, Koreans for example are 32% A, 31% B. Group AB averages out as only 5.1%. English & Belgians are only 3% AB; It seems to be highest in Asia, with Peking Chinese reaching 13% AB and the Ainu of Japan the highest at 18% AB. Hungarian Gypsies are 10% AB, Tartars 13% AB. From about Bulgaria in the West, through to Arabs, German & Polish Jews, Armenians, and Egyptians, the percentage for AB is about 6% to 8%, somewhat about or above the world wide mean of 5.1%. The relative rarity of AB therefore lends some little additional weight, to both the Oviedo and Turin artifacts, having a common origin. BUT only if universal degradation to type AB can be discounted..","date":"2012-02-15","mins":"12:40 am","url":"https://shroudstory.com/2012/02/14/new-thread-on-type-ab-blood-does-all-old-blood-become-ab/","cat":"news_&_views","title":"New thread on type AB blood: Does all old blood become AB?"},{"id":"comment-20422","author":"daveb_of_wellington_nz","post":"It’s clear that Yannick doesn’t understand what the gospel accounts are about at all – it is way too reductionist, and his counter reaction to his endemic Quebecois Jansenism is showing. So called legends have.very little to do with it. The evangelists were not concerned about writing history – they were concerned with proclaiming Jesus as Christ and Jesus as Son of God, each in his own particular way, and to suit the congregations they were directed at. The evangelists were not crude fairy story inventors. They were extremely shrewd, they understood their material well, had an exceedingly comprehensive understanding and knowledge of Septuagint scriptures, a knowledge and understanding of scripture which is rarely seen among Christians today, even among many so called scriptural scholars! They certainly used what they knew of history, but they went much further than this. Instead of being so self satisfied with his own reductionist approach, he would do much better as a first step to study Pope Benedict’s “Jesus of Nazareth” a work of considerable scholarship, but still simple enough even for him to comprehend and appreciate. He’s so fond of quoting to us his comprehensive knowledge of Shroud scientific literature, that he would do well to take this first step in understanding the gospels. He may then be able to consider whether he’s able to pontificate on them and give us his opinion then!.","date":"2012-12-14","mins":"7:40 am","url":"https://shroudstory.com/2012/12/12/on-genetic-codes-and-the-shroud-of-turin/","cat":"blood_studies","title":"On Genetic Codes and the Shroud of Turin"},{"id":"comment-24917","author":"daveb_of_wellington_nz","post":"Note to Richard and Hugh: Check posting of Jan 30, 2013, “Guest Posting by Kelly Kearse: Distinguishing human blood from that of other species”, a detailed posting by Kelly. The standard serological tests are sufficient to distinguish human and non human primate blood from that of other animals. Regarding non human primate blood other means are required using other blood components. The posting includes the following: “To date, the only study that directly addresses the human nature of the Shroud bloodstains is an often overlooked report by Baima Ballone et al. That evaluated the expression of additional blood components found on red blood cells, specifically the M,N, and S antigens. (Such antigens have also been studied in the blood analysis of King Tut). The conclusion was that the bloodstains on the Shroud are characterized as MNS positive. What is most significant about these studies is that unlike M and N antigens, which are shared between certain primates and humans, the S antigen is exclusive to humans only. No S counterpart exists in other species, including apes or monkeys. This point was not emphasized (or mentioned) in the report, as the significance of this relationship among primates was not fully elucidated until several years later (in non Shroud related studies). Of the six serological analyses of blood components on the Shroud, this brief study remains the single most definitive piece of serological evidence that directly addresses the human origin of the blood on the Shroud. For a more detailed discussion see: “Empirical evidence that the blood on the Shroud of Turin is of human origin: Is the current data sufficient?” recently published on shroud.com. The full length manuscript is available at http://www.shroud.com/pdfs/kearse1.pdf.” Also mentioned is that the tests were carried out some thirty years ago, and better tests are now available. Regarding Hugh’s comment: “obduracy on my part(?)” I can only say “Probably!” Kelly comments: “Moreover, Adler has effectively commented on the difficulties a forger would encounter in trying to apply clotting blood [of any species] to various regions on the Shroud.”.","date":"2013-02-19","mins":"5:22 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-24997","author":"daveb_of_wellington_nz","post":"A question would have to be when did alleged trickle occur, on the cross or during transport to the tomb? We don’t know how he was transported, maybe two men with body in a carrying sheet, maybe some other means, perhaps strapped over a donkey (but rigor mortis could be a problem this way). To get it closer to blood viscosity, suggest trying the experiment with vegetable oil, see if you get any closer to the same path, Might be a problem seeing the path clearly unless you do it with a separate observer..","date":"2013-02-20","mins":"6:04 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-209458","author":"daveb_of_wellington_nz","post":"Wiki has a very comprehensive article on the claim of the Roza Bal shrine containing the tomb of Jesus, including references to reviews by various heavy weights. In 2004 BBC Four produced a documentary “Did Jesus Die?”, narrated by Bernard Hill and features Elaine Pagels, Peter Stanford, John Dominic Crossan, Paula Fredriksen, Father Jerome Murphy O’Connor, Tom Wright, Thierry La Combe (French Knights Templar conspiracy theorist), Richard Andrews, James Tabor, Steve Mason, and Ahmadi editor Abdul Aziz Kashmiri. Https://en.wikipedia.org/wiki/Roza Bal The web site would seem to have everything there that anyone would want to know in dispelling the claim, including some hoax material. Originally a center of Buddhism, Hinduism, and Shaivism for a thousand years before Islam. As well as Youza Asouf being presumed as a transliteration of “Jesus the Gatherer”, it has also been taken to refer to Gautama Buddha, but then I’m no expert in eastern languages. A footnote at the end of the article may be enlightening or not: “More recently the tomb at Roza Bal began to gain popularity among western tourists as the possible tomb of Jesus. According to a 2010 BBC correspondent report, the old story may have been recently promoted by local shopkeepers who “thought it would be good for business”, and its inclusion in the Lonely Planet travel guide to India helped drive the tourist business.” Sound familiar?.","date":"2015-09-01","mins":"9:42 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209521","author":"daveb_of_wellington_nz","post":"From the Roza Bel web site, I don’t see that any Muslim would have built the tomb. Its history suggests it may have been built by either Buddhists, Hindus or Shaivists. It would seem credible that some foreign holy man might have been buried there. It seems to have suited the founder of the Amidiyya sect to claim that it was Jesus by a transliteration of the name Youza Asouf. Whoever he was, he now seems to be quite unknown, hence the propagation of legendary accounts. I see it as a typical piece of legendary syncretism, the sort of thing that frequently happens with founders of new religious sects..","date":"2015-09-03","mins":"3:46 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209570","author":"daveb_of_wellington_nz","post":"Re Roza Bal shrine: There is no record of the shrine during Kashmir’s Buddhist period, nor during the Kashmir Sultanate (1346–1586) when many Buddhist temples were converted into mosques, such as the Shankaracharya Temple or “Throne of Solomon”. The shrine is first mentioned in the Waqi’at i Kashmir (Story of Kashmir, published 1747), also known as the Tarikh Azami (History by Azam)[13] by the Khwaja Muhammad Azam Didamari, a local Srinagar Sufi writer. Muhammed Azam states that the tomb is of a foreign prophet and prince, Yuzasuf, or in modern local Kashimiri transcription Youza Asouph. A notable court case was brought mentioning the shrine in 1184 AH/1770 AD. The full decision can be read at the URL given above, but of significance would seem to be the finding that the holy man Yuzasuf came to the valley during the reign of Raja Gopadatta, which would seem to be about 1000 years too late for it to have been Jesus late of Nazareth..","date":"2015-09-04","mins":"4:26 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209314","author":"daveb_of_wellington_nz","post":"Curiously it is the only wound apparent on the statue, and from the disposition of the figure, it is easily surmised that it was considered to be a fatal blow, rather than a mere incidental battle wound. Apparently Polybius wrote an evocative account of Galatian tactics against a Roman army at the Battle of Telamon of 225 BC. It would seem that knowledge of the blow was not necessarily confined to the Roman army, but was more widely known among general military circles..","date":"2015-08-30","mins":"2:58 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209285","author":"daveb_of_wellington_nz","post":"Ronald needs to revisit his presumptions concerning the survival of Jesus after crucifixion. Of the three victims recovered at the request of Josephus, only one of them survived even after medical attention, and none of them had been given the fatal percussio blow. In Rome as part of the Capitoline collection, can be found the famous so called Dying Gaul statue, a marble copy of a now lost bronze original probably dating to about 220 230 BC. The model has been identified as a Galatian, and the statue shows a sword wound at the lower right chest, quite identical to the chest wound of the Man of the Shroud. It is a classic blow, known as the percussio, and was taught in the Roman military academies. The consequences are always fatal, as the blow pierces both the heart and the pleural cavity. Under Roman Law, victims of crucifixion could be released to the family upon request, and this would only be denied for the most serious crimes of sedition or piracy. In such cirumstances, the body could only be released after the percussio blow had been delivered to ensure that death had occurred. In the gospel of John we read that the soldiers pierced the side of Jesus so that the body could be released to Joseph of Arimathaea, and that blood and water came out, the ‘water’ being the pericardial fluid. The stain from this flow is apparent on the Shroud. Upon death, the right ventricle is full of blood, and this is the source of the blood at the chest wound of the Shroud. Quite likely it is also the source of the blood across the back flowing there as a result of the transport operation. It may suit some religious perspectives to claim that Jesus survived his crucifixion to be eventually buried in Kashmir. However this claim is utterly lacking in any adequate factual supporting evidence, in view of the manifest percussio blow delivered. Citing one such survivor as reported by Josephus is inadequate, as the circumstances were clearly quite different. One does not wrap a person in a Shroud, and roll a large boulder across the tomb entrance, as reported in all four gospels, if there is any prospect at all that the person might still be alive. Jesus was dead!.","date":"2015-08-29","mins":"11:44 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209320","author":"daveb_of_wellington_nz","post":"Barbet discusses the percussio on pp.51 & 52 of his text. He cites ‘Digest’ a compendium of ancient Roman laws, “The bodies of those condemned to death shall not be refused to their relations (etc)”; Quintilian of 1st century, “Percussos sepelevi carnifex non vetat”; Origen, “percussio sub alas”; Sextus Empericus of the 3rd c. “… the wound in the heart is the cause of death”; discusses ‘blow at the heart … from right side of chest … was certainly studied and well known … in the fencing schools of the Roman armies’; Etc..","date":"2015-08-30","mins":"3:50 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209349","author":"daveb_of_wellington_nz","post":"I get the impression that Barbet had access to scholarly reports that might not now be generally available or in print. His chapter 2 on archaeology aspects, for example, refers to his indebtedness to a Jesuit scholar Fr Holzmeister who had published a study on the subject of crucifixion in Verbum Dei (review of the Pontifical Biblical Institute) in 1934. Likely he also had access to other concurrent sources as well, and he himself was no mean classics scholar. His extremely detailed commentary on the chest wound pp 129 139 etc, suggest to me that it would take some skill and accuracy to direct the spear to pierce the right auricle, the mortal target, and if it were misjudged, the thrust might be unsuccessful. However it is clearly a skill that could be taught with proper training, and his assertion that it would be so taught does not seem unreasonable. I do think it curious that the very same wound also appears on the Dying Gaul statue, and seems consistent with Barbet’s description, notwithstanding Charles’ dismissal of the idea. Ian Wilson first mentioned it, and for all I know perhaps that might be a problem for Charles..","date":"2015-08-31","mins":"5:24 am","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209385","author":"daveb_of_wellington_nz","post":"I consider that the discussion above on the percussio is indeed relevant to the posting, and also the email to Dan submitted by Ronald. As I understand, it is an Islamic belief that Jesus survived his crucifixion. The arguments against this include the gospel accounts “that he gave up the ghost” i.e. That he died, specifically the percussio blow would ensure death as discussed at length by Barbet, the evidence of the chest wound and the blood & serum stains from the chest wound evident on the Shroud cloth, the recorded astonishment of the witnesses afterwards at his resurrection, and the opinion of very many pathologists who have examined the Shroud cloth. David Goulet has pointed to a likely explanation for the belief, and it seems corroborated by a reading of the Ronald email. There we read more of motivation rather than any logical argument. The adaptation of religious beliefs to suit the local culture has always been practised from time immemorial. Thus late Judaism was clearly influenced by the cultures they came in contact with, whether it was from Babylon during the exile, Zoroastrianism from Persian influences, observation of Egyptian funerary practices in Alexandria, or the adaptation of Greek Platonism. It was evident in the founding of Mormonism, and it can be seen in later Pacific cultures, specifically in NZ, with the founding of the Ringatu and Ratana indigenous religions. The interaction of early missionaries with local cultures has often not been a happy one. They have too often neglected the advice of that arch missionary to the east, St Francis Xavier. The following extract on St Francis Xavier, seems apt: “Twentieth century scholarship has dispelled many of the legends connected with Xavier and has also defended him against his critics. A modern estimate puts the figure of those baptized by him at about 30,000, as opposed to the 1,000,000 asserted by Baroque exaggeration. In reality he had to struggle with language wherever he worked and did not possess the gift of tongues attributed to him. He is justly credited for his idea that the missionary must adapt to the customs and language of the people he evangelizes, and for his advocation of an educated native clergy—initiatives not always followed by his successors.” “Research has shown that he always provided for the continuing pastoral care of the communities he founded and did not abandon them after Baptism as some critics maintained. In fact, many of his own efforts were spent instructing those baptized hastily by others. The areas he evangelized in India have remained Catholic to the present day. Vigorous and prolonged persecution in the 17th century did destroy the missions he founded in the Moluccas and Japan but only after thousands had died as martyrs. Even before his death Francis Xavier was considered a saint, and he has been formally venerated as such by the Catholic Church since 1622. In 1927 he was named patron of all missions.” Rev Robert L Birely SJ..","date":"2015-08-31","mins":"3:58 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-209393","author":"daveb_of_wellington_nz","post":"Essentially what seems to happen is that the subject culture, being exploited by colonizers, and even venal missionaries, rejects what it sees as the trappings of the imported religion, more so particularly if these have a colonizing aspect, attempts to accept what it sees as the core message, and then creates its own set of myths and legends to create their own version of the new religion. This seems to have happened with the Ahmadiyya sect, asserting that Jesus was buried in Kashmir. Possibly a reaction against the excesses of the earlier British Raj might have been a factor in creating these mythologies. However, unlike very many religious movements, Christianity is founded less on a set of myths and legends, and is in fact rooted in real historic events, the life, death and resurrection of Yoshua bar Joseph of Nazareth in 1st century Palestine, of which there is ample historic evidence. There is no historic evidence that he was ever in Kashmir, but only myths, legends and subjective interpretations created by local peoples as their way of importing into their culture what they saw as the teaching of a particularly gifted prophet..","date":"2015-08-31","mins":"6:57 pm","url":"https://shroudstory.com/2015/08/24/oy-vey-weve-got-a-problem/","cat":"blood_studies","title":"Oy vey!  We’ve got a problem?"},{"id":"comment-130122","author":"daveb_of_wellington_nz","post":"Clublu: Barbet states that the vena cava would have emptied itself during the transport to the tomb and any remaining blood would have been lost if not collected. He also gives other reasons. Some speculate that the body may have been given a cursory wash and that only the clots remained..","date":"2014-06-17","mins":"12:13 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin"},{"id":"comment-129374","author":"daveb_of_wellington_nz","post":"” ‘When I use a word,’ Humpty Dumpty said, in rather a scornful tone, ‘it means just what I choose it to mean — neither more nor less.’ ‘The question is,’ said Alice, ‘whether you can make words mean so many different things.’ ” Lewis Carroll – ‘Through the Looking Glass’ It is a distinct advantage when one uses technical terms or big words like “stochastic” to have some notion of their meaning first, otherwise one might be accused of Humpty Dumpty thinking: Collins: “stochastic”: 1. (Statistics) a.(of a random variable) having a probability distribution, usually with finite variance. B.(of a process) involving a random variable the successive values of which are not independent. C.(of a matrix) square with non negative numbers in each row that add to unity in each row. 2. (Rare) involving conjecture (Etymology is C17: from the Greek referring to guessing) I rather suspect that the term the authors might be looking for is “discrete variable” as distinct from “continuous variable”, or do they really mean “conjecture”?.","date":"2014-06-14","mins":"7:16 am","url":"https://shroudstory.com/2014/06/14/paper-chase-a-natural-stochastic-process-may-explain-the-coexistence-of-bloodstains-and-an-image-on-the-shroud-of-turin/","cat":"blood_studies","title":"Paper Chase:  A Natural Stochastic Process May Explain the Coexistence of Bloodstains and an Image on the Shroud of Turin"},{"id":"comment-10694","author":"daveb_of_wellington_nz","post":"(Y) – “don’t say 4 options ! I only talk about 3 …” Check posting #2 from Gabriel – “Yannick, don`t you consider a 4th option? It is the real burial shroud of Jesus Christ and a natural mechanism (Millard reaction , defended by Rogers or mercerization defended by Kohlbeck) took place in image formaton.” Barbet’s comments about undisturbed aspect of bloodstains deals with my query: “How does anyone remove a dead body from its burial wraps within two days of death (no corruption) without smearing or otherwise damaging (tearing?) the blood stains?” Now deal with the other queries I raised at posting #6: “The dorsal image shows no sign of body deformation ——— etc Will Maillard or mercerisation normally produce a quasi 3 D image?” And there you have it. Option 3 is looking highly probable!.","date":"2012-04-21","mins":"11:27 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","title":"Please, don’t forget the evidence of the bloodstains !!!"},{"id":"comment-10679","author":"daveb_of_wellington_nz","post":"I see a few problems with 1, 2 (& 4); How does anyone remove a dead body from its burial wraps within two days of death (no corruption) without smearing or otherwise damaging (tearing?) the blood stains? The dorsal image shows no sign of body deformation from the weight of the body (e.g. The buttocks areas), so that it seems to float above the burial slab. Some studies maintain that the image appears to have holographic properties (light from the image diffuses in all directions) – Is this a normal property of Maillard or mercerisation reactions? Will Maillard or mercerisation normally produce a quasi 3 D image? If the answers to these questions are in the negative, I think I’d have to vote for option 3!.","date":"2012-04-21","mins":"4:41 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","title":"Please, don’t forget the evidence of the bloodstains !!!"},{"id":"comment-10690","author":"daveb_of_wellington_nz","post":"My favouring of Option 3 was conditional on the responses to the questions I raised, which as far as I can see have yet to be answered! Options 1, 2 & 4 are not a matter of personal opinion. They can only be accepted if there is satisfactory resolution to these questions, when those options can then be considered subject to further scientific enquiry. If those questions cannot be answered, that only leaves option 3. It is a matter of logical deduction – personal opinion doesn’t enter into it!.","date":"2012-04-21","mins":"8:26 pm","url":"https://shroudstory.com/2012/04/21/please-dont-forget-the-evidence-of-the-bloodstains/","cat":"blood_studies","title":"Please, don’t forget the evidence of the bloodstains !!!"},{"id":"comment-21750","author":"daveb_of_wellington_nz","post":"Thanks Kelly, It’s quite clear in English where adjectives are normally placed before the noun, and usually only after the noun in literary work for some effect. I wonder how that translates into some non English languages where adjectives normally come after the noun (eg. French, even Latin). Any comments from our foreign language correspondents? The adjective ‘positive’ actually refers to the ‘test result’ rather than the blood itself which may be Rh+ or Rh as the case might be..","date":"2013-01-08","mins":"3:07 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","title":"Positive for AB is not the same as AB positive"},{"id":"comment-13953","author":"daveb_of_wellington_nz","post":"Matthias’ so called “facts” are trite and trivial comments, and have been dealt with many times before, on this site and elsewhere. In order to be able to comment effectively, he needs to look into the matter in raher more depth, than he apparently has so far..","date":"2012-07-18","mins":"4:45 pm","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","title":"Reality: Get Real Colin Berry"},{"id":"comment-14439","author":"daveb_of_wellington_nz","post":"The UR Ls provided by Carlos (corneliotel) in the primary posting appear to be a report by the Chambery Poor Clares who mended the burn holes in 1534. The extract appears to come from a book written in the French language under the name of Leon Bouchage and published in 1891. The UR Ls appear to be an Italian Shroud site, the first PDF is in Italian, the second is an English translation, which makes interesting reading. English readers should check: http://www.shroud.it/CLARES.PDF Despite above comments on blood stains, I note that Colin B in a later posting is now claiming that the evidence for no image under the blood stains, appears to be on too tenuous grounds which needs further rigorous confirmation. This matter needs following up..","date":"2012-08-03","mins":"6:37 am","url":"https://shroudstory.com/2012/07/30/sometimes-just-sometimes-colin-berry-talks-sense-but-but-but/","cat":"blood_studies","title":"Sometimes, just sometimes, Colin Berry talks sense. But. But. But."},{"id":"comment-102276","author":"daveb_of_wellington_nz","post":"Stigmata will always be a contentious topic, as there is always the likelihood of subjective elements being involved. We certainly don’t know everything about the human psyche. It is sometimes said that the stigmatist generally receives the marks where they believe the wounds in Jesus occurred. If we believe that there is a divine element in stigmata, then receiving the marks elsewhere might not convey the same spiritual message intended, but may be more disturbing and confusing to the stigmatist than Providence deems necessary..","date":"2014-04-22","mins":"6:01 am","url":"https://shroudstory.com/2014/04/22/stigmata-and-the-shroud-of-turin/","cat":"news_&_views","title":"Stigmata and the Shroud of Turin"},{"id":"comment-26561","author":"daveb_of_wellington_nz","post":"Prevalence of crucifixion: Crucifixion as a form of capital punishment was practised by Persians, Seleucids, Carthaginians, and Romans from about the 6th century BC to the 4th century AD, until Constantine abolished it in the Roman Empire in 337 AD. In 519 BC, Darius I, king of Persia crucified 3,000 political opponents in Babylon; In 71 BC, following the uprising of Spartacus, the Roman consul Marcus Licinius Crassus crucified 6,000 slaves on crosses set up on the Appian Way between Capua and Rome; In 88 BC, Alexander Janneaus the Judean king and high priest crucified 800 Pharisaic opponents. Following the death of Herod the Great in 4 BC, riots broke out in Jerusalem while his heir Archelaus was in Rome obtaining imperial ratification of Herod’s will. The Syrian governor suppressed the uprising, crucifying some 3,000 Jews. Further crucifixions followed the fall of Jerusalem in 70 AD, and Nero practised mass crucifixions during his anti Christian persecutions. Notwithstanding this prevalence, few bodies have been specifically idesntified as crucifixion victims. One reason is that crucifixion nails were highly prized as medical talismans by the Roman soldiery. Another reason is that bones were seldom penetrated by the nails – the Romans were “awfully” good at it. The identity of the crucfixion victim visible on the Shroud is a fair question. For those who have not already read it, my own attempt at an answer can be found on Andy Weis’ Shroud museum site: http://shroudnm.com/docs/2012 07 09 David Belz Shroud Article.pdf To that I might add my additional comments at #9 above. Despite Constantine’s abolishing crucifixion in 337, barbarism continues alive and well in the southern states of Saudi Arabia. This morning’s news reported that seven young men have been sentenced to three days of crucifixion after which they will be finished off by firing squad. Their crime revealed by confessions extorted after torture was that as juveniles they were alleged to be part of a ring of jewellery store thieves. All of them deny killing anyone. Allahu Akbar anyone?.","date":"2013-03-05","mins":"8:59 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-26539","author":"daveb_of_wellington_nz","post":"Hugh’s list of attributes omits one telling piece of circumstantial evidence. How many of his dozen or so speculative burial cloths lack a body but would leave an image of an uncorrupted body, unaffected by subsequent corruption and unsmeared by subsequent deliberate removal of the body? Why would any persons unknown, and entirely notionary, set out to remove a body from its burial cloth within 40 hours after its death? How many of his putative messiahs had implied before their death that they would then return to life within three days? Such a unique assertion has ever only been made by one person who set himself this daunting task and by all the accounts we have, achieved it. This alone can be the only explanation of why we now have a burial cloth without a body, but leaving an image of an uncorrupted body apparently in rigor mortis. Methinks that defence attorney Hugh will have more work cut out for him than he presently imagines to persuade his jury otherwise. Addendum: The high quality of the cloth with its 3:1 herring bone weave is entirely consistent with it being purchased by a wealthy person such as Joseph of Arimathaea, as recorded in all the accounts we have. Nailed it yet?? [Apologies for the deliberate pun!].","date":"2013-03-05","mins":"4:12 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-56344","author":"daveb_of_wellington_nz","post":"Interesting comments on the numbers, Louis. Not only Dravidian Tamil, but Ifrah tabulates several other examples extending as far as Cambodia, Sumatra and Tibet. On the pronunciation of the numbers, a Linguistics expert would see a few connections with other Indo European languages, 2 – duo, 4 – quattuor, 8 – octo, acht; etc. The Sankrit examples shown in Ifrah, even more so. I’d maintain the forehead “3” has no numerical significance, a pareidolia resulting from a blood flow over a furrowed brow. Even if David Goulet below finds it a “fun game”..","date":"2013-12-04","mins":"3:33 pm","url":"https://shroudstory.com/2013/12/04/the-big-3-issue-or-jesus-simply-misspoke/","cat":"blood_studies","title":"The Big 3 Issue or  “Jesus simply misspoke”"},{"id":"comment-56288","author":"daveb_of_wellington_nz","post":"Georges Ifrah discusses the origins and forms of Hindu Arabic numerals comprehensively in Ch 29 of his “From One to Zero”. The essential features are that it is a denary system, with 10 separate symbols including a zero place holder. The only other system that came anywhere near to it in sophistication, was the Babylonian base 60 system of about 1000 BCE. It found its way into the West, through the Moors in Spain and North Africa, initially by Pope Sylvester around 1000 AD, and subsequently by Leonardo Fibonacci around 1200 AD. It had earlier spread through South East Asia, but with symbols particular to local ethnic scripts, and their writing implements. Very likely it entered China through Indian Buddhism, but this is debated. Syrian bishop Severus Sebokht refers to the superiority of the system in the 7th century, in chastising the mathematical arrogance of the Greeks. The earliest alleged known examples are Sanskrit copper plate deeds from the 6th to 10th centuries concerning properties granted to Brahman religious authorities. Other examples are stone inscriptions, including a date corresponding to 875 AD, and numbered verses of a poem. The ‘3’ symbol on the forehead of the TSM, is the result of a blood flow across a furrowed brow. Those with a penchant for number mysticism will want to make something of it, but essentially it is merely pareidolia, an accidental pattern. If a Trinity symbol is to be sought, then the Nicene Creed has the Holy Spirit as No.3, not God incarnate. The book of Jonah is neither an historical nor prophetic book, there are no oracles as in all other prophetic books. Essentially it is a post exilic satire about a reluctant prophet, the only character in the work, a Jew, who comes out of it badly. It was directed against the exclusiveness of a post exilic Judaism, with its policy of a pure blood race of Jews that the reformers Ezra and Nehemiah had implemented in the 5th century. And it’s a fish, not a whale. This should say something to us about the non literal nature of the work. It is interesting that all other characters in the story (non Jewish) are made to look good, all except poor old Jonah! Jonah eventually comes to the realization that God was a universal God, and not the sole property of Israel, the essential intent of the story. I’m no great fan of Marcus Borg, but his solution of the “three days” in the tomb is on the money as far as I’m concerned. Jesus might well have appreciated the essentially fictional nature of the Jonah story, after all most of what he had to say was expressed in parables. I see no problem in his using it to express its close analogy with his being in the tomb..","date":"2013-12-04","mins":"6:16 am","url":"https://shroudstory.com/2013/12/04/the-big-3-issue-or-jesus-simply-misspoke/","cat":"blood_studies","title":"The Big 3 Issue or  “Jesus simply misspoke”"},{"id":"comment-10663","author":"daveb_of_wellington_nz","post":"Neither chemistry nor biology are my first disciplines. However I thought we had settled much of the Blood stain debates with Dr Kelly Kearse’s posting of 16 February. Colin’s comments on her paper I recall (one of many praising it) was “Splendid account … a model of precision and clarity”. You can drop quickly onto Kelly’s posting and related comments on this site by going to Categories (below at right) / Science / Blood Studies. I failed to spot if she had made any comments at the time specifically on Adler’s work, but she certainly dealt comprehensively with work carried out by other reputable scientists. So I’m not sure just what Colin’s problem is, whether (a) He is raising questions solely about Adler’s work, or (b) whether he is seeking to have the whole question of blood stains recycled yet again. With regard to (b) I thought we had been there, done that!.","date":"2012-04-21","mins":"8:03 am","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","title":"Was Adler’s Analysis Science?"},{"id":"comment-10717","author":"daveb_of_wellington_nz","post":"I still don’t see the point in being rude to anyone on this site, on the slender basis that we disagree with their views. It’s a poor debating tactic and totally ineffective as a persuasive ploy in any kind of mature discussion. “Let him without sin cast the first stone.” “First cast the beam out of your own eye …”.","date":"2012-04-22","mins":"4:31 pm","url":"https://shroudstory.com/2012/04/21/was-adlers-analysis-science/","cat":"blood_studies","title":"Was Adler’s Analysis Science?"},{"id":"comment-212345","author":"daveb_of_wellington_nz","post":"Hugh Farey comment above Oct 11, 5:54 pm, relating to dirt on feet, nose and knee, xxx “a speculative extrapolation given spurious authority by (repetition)” xxx: See ref: “Evidence for testing Hypotheses … (etc)” by (Shroud Science group), Dallas, 2005; http://www.shroud.com/pdfs/doclist.pdf , The several items are classified as A, B, C according to the reliability of the observation, A – unquestionable, to C – observed and agreed by some only. On p.7, under 2.1(e) “OTHER”: “A79) Earthy material (limestone composed of aragonite with strontium and iron) was found on the feet of TS Man (Kohlbeck 1986, Nitowski 1986, 1998, Antonacci 2000). Earthy material was also found in correspondence with the nose and the left knee (Pellicori 1981).” Note that item is classified ‘A’; Pellicori 1981 cited as “144. PELLICORI S. F. And EVANS M. S., “The Shroud of Turin Through the Microscope,” Archaeology, January/February 35 43 (1981).” On p.10, under 2.2(e) “OTHER”: “B57) The limestone found on the feet contains calcium in the form of aragonite. Similar characteristics were found on samples coming from Ecole Biblique tomb in Jerusalem (Levi Setti 1985, Antonacci 2000).” Item is classified ‘B’; Citations: “108. LEVI SETTI R.,CROW C., WANG Y. L.: “Progress in H>igh Resolution scannino Ion microscopi and Secondary Ion Mass Spectrometry Imaging Microanalysis”, Scanning Electron Microscopy 2, 1985; 535 552” ; “10. ANTONACCI M., “The Resurrection of the Shroud”, M. Evans and C. Inc., New York, USA, 2000.” Also refer paper by Barta & Bracaglia on H.S.G. Site concerning work by Kohlbeck & Nitowski, relating to identification of limestone with that sampled by Nitowski at the Damascus gate in Jerusalem: http://holyshroudguild.org/ceacutesar barta.html In John Klotz’s narrative of the STURP hands on work in Turin, he states that during the Gilbert’s spectrographic examination, Marty Gilbert identified three anomalous areas – a foot, a knee cap and the tip of nose. Pellicori was summoned and identified it as dirt; Rogers took sticky tape samples, but it seems he sent only the tapes from the foot to Kohlbeck..","date":"2015-10-12","mins":"4:40 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-212461","author":"daveb_of_wellington_nz","post":"There are several ancient flood stories, nearly all of them from civilisations dependent on rivers subject to erratic flooding, and occasionally these floods would be extremely devastating. During the 1980s when I was studying Ancient Mythologies, I recall that one of my fellow students presented a paper identifying several of these stories and their places of origin. However she made a point that there were no such stories emanating from Egypt. Why? Because the Nile floods were predictable, always occurred during a fixed season, and were seen as essential to the fertility of the Nile Valley! In the closing chapters of The Epic of Gilgamesh, we are told of Utnapishtim, who alone of all humanity, except for his family escaped such a devastating flood, and resided at the mouth of the Euphrates. Gilgamesh, overcome with grief by the death of his companion Enkidu, sets out on a journey to find Utnapishtim and to discover the secret of immortality. However a serpent stole the plant from Gilgamesh he had obtained which would give immortality, and so his quest was unsuccessful. Gilgamesh is the first human hero that was ever set down in writing and its earliest known tablets date from before 2000 BC. There are very close parallels with the incidental details of the story of Noah. These would indicate that this story was set down in Genesis during the Babylonian Captivity sometime in the 6th century BC. However there are major differences. In the Utnapishtim story, the floods are sent by a goddess as an act of spite against humanity. The Jewish writers give the story of the flood an entirely different religious meaning, more profound, and Noah is saved as an act of a merciful God. Doubtless there were devastating floods at the end of the Ice Age, but it would seem unlikely that there would be any group memory of such events. The purpose of the Noah story, is intended to be religious, and its setting can be related to devastating floods that occurred in ancient Uruk..","date":"2015-10-14","mins":"12:16 am","url":"https://shroudstory.com/2015/10/11/was-jesus-body-washed/","cat":"blood_studies","title":"Was Jesus’ Body Washed?"},{"id":"comment-188291","author":"daveb_of_wellington_nz","post":"Marcus Borg was a fellow of the Jesus Seminar, a fellow traveller of John Dominic Crossan, neither of whose views are consonant with the resurrection, nor of orthodoxy. Nevertheless Borg was apparently on friendly terms with a more gifted scholar N T Wright despite their considerable religious differences..","date":"2015-02-02","mins":"5:11 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188288","author":"daveb_of_wellington_nz","post":"Paper. Frascati Conference May 2010 by Jose Luis Fernandez Sanchez, makes some comparisons between Oviedo Sudarium and Turin Shroud. Paper seems to adopt a very cautious approach, is consequential to various investigations of sudarium (Ricci ~1960s, Spanish Sindonology from 1989 into 1990s, and included some by author 1984, and other subsequent work), and proposes a number of further investigations. Various assertions are made concerning stains before and after death, position of body at various times relative to death, various pollen studies, carbon dated to around 700 AD (sudarium is heavily contaminated). A & M Whanger applying polarized image overlay technique, Sudarium/Shroud have apparently asserted they found 70 points of coincidence for frontal stains, and 50 points for the rear. Sanchez asserts that validation of these results is required to confirm them. I suggest that David Mo’s queries might be answered by further investigations as proposed by Sanchez. Meantime such a closed mind on the issue does not seem to be an appropriate perspective, in the light of the investigations so far to date..","date":"2015-02-02","mins":"5:02 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188495","author":"daveb_of_wellington_nz","post":"It was Henry Ford who asserted that “History is bunk!” From the various depictions of Christian art we have seen here recently, I’m coming to the conclusion that much of Art is bunk, when we attempt to interpret it as a realistic impression! We have seen on another thread the recent restoration of what is clearly a beautiful depiction of a Savoy display of the Shroud with Cardinal Borromeo, together with a Savoy saint who happened to have died some hundred years or so previously, and many questions were raised about the artist’s depicted impressions of the Shroud which could not be answered satisfactorily. In two art works posted on this thread above, we see artists’ depictions of the flagellation, both comparatively modern works. In both cases we see Christ’s arms bound at waist level. There are apparently no scourge wounds on the image of the TSM’s arms, and the conclusion would have to be that the arms were actually bound above the head. This was apparently the usual practice of Roman flagellation, is noted by Barbet, and there are clearly good executioner reasons why this should be so, particularly if the prisoner should happen to faint during the flagellation. Some clues may be taken from art works, there are small tokens of realism which the artist may be aware of and has attempted to depict, but clearly also much that they are ignorant of. The watchword is caution when it comes to attempting to read too much into what is shown in such works. Realism is often a secondary objective in art, the primary objective being more frequently to inspire empathetic or a devotional state of mind in the observer. It very much depends on the skill, knowledge and intentions of the artist..","date":"2015-02-02","mins":"2:29 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188745","author":"daveb_of_wellington_nz","post":"Pincers / pliers developed from tongs used in smithy work for gripping hot metal, earliest depiction is apparently Greek god Hephaestus in his forge. Pincers proper are most useful for cutting (e.g. Wire) and a wide variety of such useful gripping / pinching tools have developed in modern times for specialist tasks. As an instrument of torture, I suppose they might be used for pinching the flesh, or making cuts, amputating fingers & toes, pulling out toenails, finger nails or teeth, for castration, or for cutting tendons (hamstring) and laming the victim. No executioner should be without a set! Their appearance in the bronze of the flagellation scene above, I would interpret as symbolic. Thus forging is associated with the underworld and the black arts, symbolic of torture instruments, useful for precision locating of crucifixion nails, and as a potential threat of injury. The only useful purpose I can think of in flagellation is for cutting binding ropes or shackles, therefore I would presume essentially symbolic..","date":"2015-02-03","mins":"5:29 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188854","author":"daveb_of_wellington_nz","post":"Most DIY Kiwis (we are famous for using No. 8 wire technology here) would understand the distinction between pliers and pincers well. I recall my father, a typical handyman, had various sets of both. As to forging being a black art: I once had to visit a major workshop down south in Dunedin. It specialised in making or upgrading railway wagons, and had furnaces for smelting. The various molds had been prepared for couplings, buffers brake shoes and the like. I was privileged to see the pour of the molten cast iron. It was indeed a form of engineering magic to see the results of the pour as the various components were formed in all their detail. Forging has always been seen as a form of arcane mystery and wonder from ancient times. Barbet of course had his own explanation for the blood belt across the small of the back. He envisaged a type of twisted sheet for support during transport of the body, and hence creating the blood belt and the impression it left therefore resembled a twisted rope or chain. He was emphatic that all the stains implied that there was a minimum handling of the body..","date":"2015-02-03","mins":"2:12 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188855","author":"daveb_of_wellington_nz","post":"I would consider the pincers to be symbolic only, as I stated above, Feb 3, 5:29 am et seq..","date":"2015-02-03","mins":"2:16 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-188878","author":"daveb_of_wellington_nz","post":"I should like to be able to check the “Recent Comments” column to see what other views have been recently expressed on various topics, without being obfuscated by a long string of repetitive entries of MPH, and missing most other entries. All it requires is for him to exercise a more disciplined approach. He could give some deep thought to what he’d like to write, put it into a text file, come back to it, re edit it to to his heart’s content until he’s satisfied with it, and then post it as a single item. Some of us actually do that, and find that the result is worthwhile, and gives a much better and succinct posting, without later regretting what we ought better to have said. It also makes for much more efficient postings on the blog. No excuses! Just, do it!.","date":"2015-02-03","mins":"3:44 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187268","author":"daveb_of_wellington_nz","post":"All of the forensic pathologists who have ever examined either the Shroud or its imagery, from the time of Yves Delage onward, have never raised a single doubt that any single blood stain might be a subsequent add on. All of them had a forensic explanation for any blood stain they examined, and every blood stain was true to type, pattern and location, even the flow across the small of the back and the patterns at the feet (see Barbet). There is no case presented requiring an answer!.","date":"2015-01-29","mins":"2:12 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187345","author":"daveb_of_wellington_nz","post":"Pathologists, sainted or not, know what genuine blood stains look like. Anyone who doubts it can’t have read John Mortimer’s “Rumpole of Old Bailey”. And they don’t need the cadavers brought into the court room to assess them or give their evidence. Pictures are enough, even when they’re two thousand years old! Name one pathologist who can match Delage, Vignon, Barbet, Willis, Zugibe, who has studied the TS in the same detail, but who is able to deny the reality and integrity of the blood stains there..","date":"2015-01-29","mins":"10:44 pm","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-187399","author":"daveb_of_wellington_nz","post":"DM: “I’m still waiting to see how some “gracious rivulets” are produced when a cloth is pressed against a wounded scalp as in the Shroud .” There is an obvious response to David Mo’s query. He could grow his hair to a sufficient length, fabricate a cap of thorns for himself and jab it firmly on his head with a few hard blows. He might then observe at his own leisure what gracious rivulets might form and make his comparison. Alternatively, if he finds himself insufficiently hirsute, he might find a willing volunteer subject for the experiment. Fortunately, to save himself the trouble, there is a less traumatic solution available. It seems that the Sudarium of Oviedo has an identical pattern of scalp blood flows. And it is known that the Sudarium dates well back into the first millenium. He has already conceded “Making two identical stains that remain identical in the lapse of centuries is impossible.” So that is an interesting commentary on the dating of the Shroud!.","date":"2015-01-30","mins":"5:34 am","url":"https://shroudstory.com/2015/01/29/were-some-bloodstains-added-later-or-maybe-retouched/","cat":"blood_studies","title":"Were Some Bloodstains Added Later or Maybe Retouched?"},{"id":"comment-137878","author":"daveb_of_wellington_nz","post":"I’ve been checking out Radon, which UK workplace and other sources say account for 50% of natural radiation; Most commonly found associated with metamorphic geology, granites, schists, gneiss, and to a lesser extent LIMESTONE (i.e. Jerusalem geology). Accounts for second greatest cause of lung cancers, only after tobacco smoke. See simple comprehensive overview: http://en.wikipedia.org/wiki/Radon Several isotopes, all radioactive, most common is 222 Rn, half life 3.8 days, daughter products also radioactive: Decay chain: Source chain – 238 U to 226 Ra to 222 Rn: Daughter chain: 222 Rn half life 3.8 days, emits alpha to: 218 Po half life 3.10 minutes emits alpha to: 214 Pb half life 26.8 minutes emits beta to: 214 Bi half life 19.9 minutes emits beta to: 214 Po h l – 0.16ms, emits alpha to: 210 Pb h l 22.3 years, etc. De Liso only obtained images in seismically active Piedmont, with emission of radon, changes in geo magnetic electric field, presence of gneiss (metamorphic), and presence of infra sound. A radio active source may be implicated with image formation; Caveat: Beta is not microwave nor UV shortwave as reported by Bernard Power cited by Colin Berry; But alpha and beta might conceivably still be implicated. Uranium source might still be present in limestone but in small amounts sufficient to generate Radon decay chain..","date":"2014-07-13","mins":"8:30 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137981","author":"daveb_of_wellington_nz","post":"Possibly suffered in the translation. She reports on 12 years of field experiments, that’s dedication. The experiments themselves are interesting. What you might make of them could be your subjective reaction to the text. Lots of citations. Check: Shroud like image formation during seismic activity; Giovanna de Liso; ENEA Frascati Conference May 2010. Http://www.acheiropoietos.info/proceedings/De Liso Web.pdf.","date":"2014-07-14","mins":"3:45 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-137964","author":"daveb_of_wellington_nz","post":"I think it’s curious that De Liso seems to have been the only one to have produced anything that looks like persuasive looking images by a natural means. To what extent they match the Shroud image properties (superficiality etc) she doesn’t state in her paper so that has to be a reservation. She did use cloths with aloe and myrrh ‘inhibitions’. Images were of a snake and a metallic key, and the key of course wouldn’t be generating amines. Rogers dismissed the likelihood of radiation causing the TS image, as he couldn’t see it giving the necessary superficiality. I think it may well be that radiation has some kind of role, perhaps in collimating the imaging process, or in producing the orthogonality. I note there has been some research where 50 k Hz power lines seem to have influenced the localised distribution pattern of radon molecules. If it’s a natural process, it’s obviously very elusive, quite complex, but I’d suggest that radiation, although not necessarily the primary cause, may have some kind of significant role. And sure, I’m speculating!.","date":"2014-07-14","mins":"2:24 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-138358","author":"daveb_of_wellington_nz","post":"Tenting, Jul 14 comments: HF 9:02 am, CB 12:53 pm. Any surface curved in three dimensions cannot be developed in the plane without distorting or stretching. The cylinder and cone are not curved in three dimensions and can be so developed; Spheres and ellipsoids cannot. Commonest example is the globe of the earth. It is impossible to create a two dimensional map of the earth and to preserve the scale of all distances between any two places. It is theoretically possible to enclose a sphere with a rubber sheet, to stretch it non uniformly so that all points of the sphere are in contact with the sheet. The distortion stretch of the rubber sheet cannot be uniform but must be variable (simple example – a child’s toy balloon cherry). Most fabrics have neither the elasticity nor extensibility to maintain such contact. If one of the curvatures is fairly flat then some practical fabrics may be sufficiently extensible to maintain contact. Parts of the human body are curved in three dimensions: skull, shoulders, extremities, insteps, buttocks, small of the back. Other parts are curved in two dimensions with only minimal curvature in the third dimension: limbs and trunk and semi planar aspects. It is therefore impossible, a mathematically physical certainty, to wrap a body in a linen shroud so that all parts of the body surface are in contact with it, and some tenting is inevitable where the body is sufficiently curved in three dimensions. This compromises any assertion that the Shroud image can only arise from direct contact with the cloth. Jackson and Jumper have of course shown that some of the imaging process can cross a small air gap, perhaps up to 4 cm, with some attenuation of the image..","date":"2014-07-14","mins":"11:46 pm","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"},{"id":"comment-14284","author":"daveb_of_wellington_nz","post":"My congratulations to Yannick for an excellent paper. One particular aspect I liked about this particular paper of Yannick’s, is that It is self disciplined withour excursions into speculation on theories which I know are close to his heart, but wisely he has refrained from including them and just given facts, and the consequential reasoning to logical conclusions, I would make two observations of a semi technical nature: 1) Identity of the victim: There were thousands, possibly tens of thousands, of victims executed by the barbaric punishment of crucifixon. So identifying the actual victim, “Whose image is on the Shroud?” is a fair and reasonable question. However, capping or crowning with thorns was never a normal part of Roman crucifixion. In the case of Jesus, it was a spontaneous act carried out on the whim of a Roman soldier, perhaps on sighting some thorn branches gathered for firewood, and to mock the claim that he was KING of the Jews. “They dressed him up in purple, twisted some thorns into a crown and put it on him; and they began saluting him ‘Hail, King of the Jews!’ They struck his head with a reed and spat on him; and they went down on their knees to do him homage.” (Mark 15: 16 19). The crowning (capping) of thorns then is clearly seen as being solely part of the mockery as King of the Jews. And UNIQUELY identifies the Shroud man as Jesus Christ. It is just too long a shot to assert that someone else was similarly capped and that it may have been some other victim. Even the Jesuit sceptic Herbert Thurston was obliged to admit in 1903: “If this is not the impression of the Christ, it was designed as the counterfeit of that impression. In no other person since the world began could these details be verified.” 2) Option 4: “In any way, a “dematerialization” of his body at the moment of the resurrection (accompanied or not by a burst of energy) could explain why the body left the Shroud before it started to corrupt,” There is a physics problem with the literal notion of “dematerialisation”. As recently stated on a previous blog, dematerialisation would result in too great a burst of energy as matter would then be converted into radiation, someone estimating that it would be equal to a 10 GT nuclear explosion, which clearly didn’t happen. I prefer an explanation that envisages resurrection of the body as some kind of supernatural transformation – St Paul and theologians explain it as a “glorified body”. One explanation I offered was that the body entered some kind of parallel universe. In other words somewhere in all of creation, there is still a resurrected body of the Christ..","date":"2012-07-28","mins":"7:49 pm","url":"https://shroudstory.com/2012/07/28/yannick-delights-with-another-great-paper/","cat":"blood_studies","title":"Yannick Delights with Another Great Paper"},{"id":"comment-46606","author":"daveb_of_wellington_nz","post":"More extravagant nonsense from the serpent yet again raising its head in the Garden of Paradise..","date":"2013-10-09","mins":"5:35 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"}]
