[{"id":"comment-87042","author":"daveb_of_wellington_nz","post":"Correspondents who may not be aware of it, can find and download an interesting and authoritative paper on the repairs carried out by the Poor Clares in 1534: “Report of the Clare Nuns of Chambery who mended the Shroud in 1534” from the book ‘Le Sainte Suaire de Chambery a Sainte Claire en Ville (Avril Mai 1534) par M. L’Abbe Leon Bouchage 1891: http://www.shroud.it/CLARES.PDF [PDF is secured and so cannot be directly copied and pasted, version is in English].","date":"2014-03-10","mins":"3:57 pm","url":"https://shroudstory.com/2014/03/10/of-google-doodles-and-other-coincidences/","cat":"news_&_views","title":"Of Google Doodles and Other Coincidences"},{"id":"comment-21663","author":"daveb_of_wellington_nz","post":"I can certainly give a readily available example of “I think I see”. The last few years I have has as my desktop wallpaper the standard MS picture of Stonehenge on Salisbury Plain. I’ve frequently noticed that under certain conditons of room lighting, or the angle of the sun coming through the window, that unmistakeable faces, sometimes even of recognizable personages, appear on the faces of the standing stones. I’m also reasonably certain that neither the Stone Age people who carved them, nor a retouching of the picture have intentionally produced this impression. Other readers might like to check it out. It is one small piece of evidence why I remain prudently cautious about claims for seeing various images that may or may not be real objects, notwithstanding Max’s insistence, but I fully understand where he is coming from. There was an earlier discussion some time back concerning Robert De Clari’s claims concerning seeing the various stages of Jesus’s life on the Shroud cloth. Clearly De Clari would be reporting what he believed he saw. At the time, Max produced some coarse images which certainly seemed to support De Clari’s perception. I recall that he mentioned he would endeavour to enhance them with clearer images. If Max has developed those images further, I for one would like a reference to where they might be viewed Another example in the importance of lighting angle, are the wrinkles and folds on the Shroud cloth which become clearly visible only under conditions of raking light, as demonstrated in a John Jackson video posted here some months ago. Clearly the wrinkles and folds are certainly always there, but only become visible under the proper lighting conditions. There are any number of other examples in the type of light, such as whether it’s visible light, UV, or IR. As well as the direct lighting, ambient lighting conditions also must have an effect..","date":"2013-01-06","mins":"3:29 pm","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"},{"id":"comment-21724","author":"daveb_of_wellington_nz","post":"Max, Thanks for the correction. I note your paper, link posted here last October. You wrote: “This would be of no historical and archaeological consequences were not the image misperceptions seen here in conjunction with the TS mature man’s face and the fact they are directly referable to the Image of Edessa’s deliberate mystique of secrecy then prevailing in the Nestorian ancient liturgy and in particular to Easter ritual description that follows:” “[…] On Easter [the acheiropoetic Image] used to change its appearance according to different ages: it shows itself in infancy at the first hour of the day, childhood at the third hour, adolescence at the sixth hour, and the fullness of age at the ninth hour, when the Son of God came to his Passion […] and […] cross. ” [Reference provided] I believe I may have come across the reference at some time previously, and incorrectly attributed it to Robert de Clari. A check on the Clari reference shows this not to be the case. I’m afraid I’ll just have to admit to yet another senior moment – they seem to be piling up these days. Any progress with your enhancement of the images?.","date":"2013-01-07","mins":"6:06 pm","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"},{"id":"comment-21685","author":"daveb_of_wellington_nz","post":"I note Gabriel’s comments above, criticism of particular software used, and in particular the comment: “… the focus on human perception when state of the art techniques, allows moving to objective probabilities of appearance…” The ratio ‘S’ Pearson Product Moment Correlation given in Equation (1) looks very like a Correlation Coefficient most Stat students will be familiar with. The calculated ratio of ‘S’ = 0.4 is dismissed on basis of the subjective pictorial comparison of the violin and the accordion. I suggest that there is an objective Test of Significance that ought to have been carried out by the Stats investigator in this case. In the Standard Correlation test for two variables (x, y), the coefficient of correlation ‘r’ would be transformed into a ‘z’ variable where z = atanh (r) (inverse hyperbolic tangent of ‘r’). The sample value of ‘z’ will then be normally distributed with standard deviation 1 / sqrt(n – 3) where n is the number of data points. This then enables confidence levels to be determined for the true value of ‘z’ and hence ‘r’. If the data are completely uncorrelated, the hypothesis that ‘r’ = 0, can then be tested. I should think a very similar test can be devised for the two dimensional Pearson coefficient, but allowing for the appropriate degrees of freedom..","date":"2013-01-07","mins":"1:17 am","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"},{"id":"comment-21770","author":"daveb_of_wellington_nz","post":"I don’t agree that the Pearson test is unreliable at all! It yields an objective parameter according to a set formula connecting sets of data. False conclusions may be made by the inexperienced or inadequately informed amateur who fails to understand what a statistical test is about, and who fails to probe further in not measuring its significance. I frequently applied it, along with regression analysis during my working life in researching sets of engineering and financial data,. It is more commonly applied when a linear relationship may be assumed between two variables, but it can be extended to multivariate analysis, and also by means of appropriate transformations to include non linear situations, A text book I still have by Paul G Hoel Professor of Mathematics in California and published as long ago as 1962 validates these applications. Karl Pearson 1857 1936 was one of the key founders of modern statistical theory. His correlation test was only one of many contributions he made to the science. “Neither regression nor correlation analyses can be interpreted as establishing cause and effect relationships. They can indicate only how or to what extent variables are associated with each other. The correlation coefficient measures only the degree of linear association between two variables. Any conclusions about a cause and effect relationship must be based on the judgment of the analyst.” (Encyc Brit) Despite this EB quote, non linear and multivariate correlation can still be tested by transforming the data. A paragraph in my comment at #17, indicates the appropriate method of testing levels of significance. Although the paper provides some fascinating observations on optical illusions, referring to Gestalt theory as an explanation, and includes citations and references, it is somewhat devoid of the experimental data. I feel the authors have leaned a little too heavily on the aspect of illusionary experience as a reason for dismissing pareidolia phenomena. I dare say that it may well be possible for confirmatory statistical tests to be devised to establish the presence or absence of alleged images, but I suspect that the matter is far more complex than is covered in the paper or even in comments published here..","date":"2013-01-09","mins":"7:02 am","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"},{"id":"comment-21868","author":"daveb_of_wellington_nz","post":"The shortcomngs in the C14 tests had absolutely nothing to do with any inherent failures in the Pearson correlation test, notwithstanding the perpetrators quoting of it. It had everything to do with an inadequate or non existing sampling protocol. In the trade we call it GIGO = Garbage In, Garbage Out! Find me another example, if you’ve a point!.","date":"2013-01-10","mins":"10:35 pm","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"},{"id":"comment-21893","author":"daveb_of_wellington_nz","post":"The criticisms of the Pearson Correlation Tests attempted above, or for that matter any other generally accepted method of statistical testing, make as much sense as criticising the accepted methods of structural analysis applied to buildings, when incompetently applied. We have buildings that fell over in the February 2011 Christchurch earthquake designed as recently as 1986 because of engineering incompetence. Check http://en.wikipedia.org/wiki/CTV Building , Refer paragraph on Royal Commission of Inquiry. That is not to criticise the proper methods of Structural Analysis. The same principle applies to any method of statistical testing or any other scientific technique when incompetently applied!.","date":"2013-01-11","mins":"2:50 pm","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"},{"id":"comment-21906","author":"daveb_of_wellington_nz","post":"It was an act of scientific incompetence not to adhere to a correct sampling protocol. Any correlation ratio they may have calculated would correctly reflect the data input if correctly done. But the data was not properly representative of the whole, You claim MANIPULATION which is a more serious charge than I would make. The engineer in the CTV building design did not need to make an error in his calculations. He only had to get his structural concepts wrong, which unfortunately he did resulting in the loss of some 100 lives! There is more to correct scientific techniques than mere calculation, whether its statistical sampling measures or anything else!.","date":"2013-01-11","mins":"5:38 pm","url":"https://shroudstory.com/2013/01/06/paper-chase-why-there-are-probably-no-images-of-coins-lettering-flowers-and-whatnots-on-the-shroud-of-turin/","cat":"news_&_views","title":"Paper Chase: Why There Are Probably No Images of Coins, Lettering, Flowers and Whatnots on the Shroud of Turin"}]
