[{"id":"comment-212093","author":"daveb_of_wellington_nz","post":"I perceive a different aspect of this story. I suspect that the good people of Turin may still be locked into a medieval mind set concerning their relic. It generates tourist dollars for their hotels, cafes, restaurants, souvenir shops, tour guides, and even perhaps the occasional Fiat. But only so long as the mystery or enigma remains. Bring in the scientists, let them study the micrographs, and the truth may then be revealed, and it’s no longer the mystery that it was. The fear is that the cloth may be proved to be not what it appears to be. Goodbye to the tourist dollars. Goodbye to the worshippers. But what if indeed it is the burial cloth of the Christ? We can get no closer to the answer, because of this simony. Millions are deprived of knowing the truth, all because of the lame excuse that the scientists are too disputative, too skeptical, too arrogant or too whatever. So likely as not, so long as the fear remains, we will never know the truth..","date":"2015-10-08","mins":"9:11 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-215953","author":"daveb_of_wellington_nz","post":"The notion that Jesus is both truly God and truly Man will I think always remain a mystery hidden from our eyes. With the greater understanding we now have of the science of genetics, perhaps as expressed in our knowledge of human chromosomes, we ask: “If Jesus did not have a human father, how can he be truly man? Conversely if he did have a human father, how can he be truly God?” The traditional response has always been that he obtained his human nature solely from Mary, and his divine nature from being conceived by her being overshadowed by the Holy Spirit. But the modern question of chromosomes now arises and remains with us. The enigma certainly created problems for the early church fathers, as any review of the patristic literature certainly demonstrates. But they saw the problem through the perspectives of classical Greek philosophy, rather than through our modern scientific perspective. It led to many divisions within the early church, and the efforts to wrestle with the problem led to a variety of heresies. Perhaps the most critical of these heresies was that of Arius, which prompted Constantine I to summon the Council of Nicea in 323. Arius had attracted a large following through a message integrating Neoplatonism, which accented the absolute oneness of the divinity as the highest perfection, with a literal, rationalist approach to the New Testament texts. He had taught that Christ is not divine but a created being. The council condemned Arius and, with reluctance on the part of some, incorporated the nonscriptural word homoousios (“of one substance”) into the Nicene Creed to signify the absolute equality of the Son with the Father. The emperor then exiled Arius. The Council of Nicaea, in May 325, declared Arius a heretic after he refused to sign the formula of faith stating that Christ was of the same divine nature as God. Influential support from colleagues in Asia Minor and from Constantia, the emperor Constantine I’s daughter, succeeded in effecting Arius’ return from exile and his readmission into the church after consenting to a compromise formula. Shortly before he was to be reconciled, however, Arius collapsed and died while walking through the streets of Constantinople. The enigma had also I think created problems even for the gospel writers. When did each believe that Jesus became God? For Mark it is at his baptism by John the baptizer in the waters of the Jordan, when John sees the Holy Spirit descending on Jesus in the form of a dove and hears a voice from heaven affirming that this is God’s Son; For both Matthew and Luke, it is right from the time of his conception, so they tell the story of the Annunciation by an angel. But for the evangelist John, it is even before the beginning of time: “In the beginning was the Word, and the Word was with God, and the Word was God. He was in the beginning with God.” But the evangelist John also inserts in the same chapter, Mark’s story of the baptism: “John testified further, saying, “I saw the Spirit come down like a dove from the sky and remain upon him. I did not know him, but the one who sent me to baptize with water told me, ‘On whomever you see the Spirit come down and remain, he is the one who will baptize with the holy Spirit.’ Now I have seen and testified that he is the Son of God.” The enigma continues, and from whatever any limited human perspective we attempt to comprehend it, I think it will remain a divine mystery to our limited understanding. Perhaps that is how it should be, and is intended to be part of the mysterium tremendum, How can a finite mind comprehend a God who is infinite?.","date":"2015-12-08","mins":"10:50 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-215956","author":"daveb_of_wellington_nz","post":"Einstein was right to entertain doubts about the infinitude of the universe, as even Aristotle knew that it was finite. As for human stupidity, it is the corollary to my question..","date":"2015-12-09","mins":"1:16 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216112","author":"daveb_of_wellington_nz","post":"The reference to Luke as the “beloved physician” occurs in Colossians 4:14. “Luke, the beloved physician, and Demas, greet you.” However it has been asserted that this epistle is pseudonymous, written by a Paulinist, and the end of the first century or early second century has been suggested. It was a common enough practice for pseudonymous writers to mention known affiliates of the purported author to lend authority to their writings, and it occurs elsewhere. On the authorship of the third gospel, Encyc Brit comments: “The author has been identified with Luke, “the beloved physician,” Paul’s companion on his journeys, presumably a Gentile (Col. 4:14 and 11; cf. II Tim. 4:11, Philem. 24). There is no Papias fragment concerning Luke, and only late 2nd century traditions claim (somewhat ambiguously) that Paul was the guarantor of Luke’s Gospel traditions.” “The Muratorian Canon 10.1.5 refers to Luke, the physician, Paul’s companion; Irenaeus depicts Luke as a follower of Paul’s gospel. Eusebius has Luke as an Antiochene physician who was with Paul in order to give the Gospel apostolic authority.” “References are often made to Luke’s medical language, but there is no evidence of such language beyond that to which any educated Greek might have been exposed. Of more import is the fact that in the writings of Luke specifically Pauline ideas are significantly missing; while Paul speaks of the death of Christ, Luke speaks rather of the suffering, and there are other differing and discrepant ideas on Law and eschatology. In short, the author of this gospel remains unknown.” Despite the use of the several “We … ” sections in the Acts sequel to the third gospel after ch 12, similar comments relevant to the disparity with the teachings in the Pauline epistles are also evident..","date":"2015-12-10","mins":"5:28 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216177","author":"daveb_of_wellington_nz","post":"Nabber: “daveb’s first para: “it has been asserted this epistle [Colossians] is pseudonymous”? By whom? How authoritative? “It was a common enough practice”? And that proves what? ” Nabber, my position is that I think very little can be proved conclusively. I am only reporting what I read from an authoritative source, which, succinctly, results from the analyses and consequent opinions of reputable exegetes who have studied these problems. The authors of these particular sections from the Biblical Literature article I mentioned above would have included: The Rev. Krister Stendahl: Bishop of Stockholm, 1984 88. Andrew W. Mellon Professor of Divinity, Harvard University, 1981 84; Dean, Divinity School, 1968 79. Author of Paul Among Jews and Gentiles and others. … …Emilie T. Sander: Associate Professor of New Testament, Yale University, 1973 75. Coeditor and translator of The Bible and the Role of Women. The article’s introduction to the Pauline Letters states: “In the New Testament canon of 27 books, 21 are called “letters,” and even the Revelation to John starts and ends in letter form. Of the 21 letters, 13 belong to the Pauline corpus; the Letter to the Hebrews is included in the Pauline corpus in the East but not, however, in the West. Three letters of this corpus, the Pastoral Letters, are pseudonymous and thus are not considered here.” “Of the remaining 10, the Letters to the Colossians and Ephesians are from the hand of a later Pauline follower and II Thessalonians is spurious. How this Pauline corpus was collected and published remains obscure, but letters as part of Holy Scripture were an early established phenomenon of Christianity.” “The letters of Paul, written only about 20 30 years after the crucifixion, were preserved, collected, and eventually “published.” In general, they answered questions of churches that he had founded. When all the Pauline Letters as a corpus were first known is difficult to determine. Because Pauline theology and some quotations and allusions were certainly known at the end of the 1st century, the Pauline Letters probably were collected and circulated for general church use by the end of the 1st century or soon thereafter. A disciple of Paul, possibly Onesimus, may have used Ephesians as a covering letter for the whole collection.” Concerning the Authorship status of the three Pastoral Letters to Timothy and Titus, it is stated: “The Muratorian Canon (a list of biblical books from c. 180 includes references to the Pastoral Letters and notes that they were written “for the sake of affection and love.” They have a place in the canon because “they have been sanctified by an ordination of the ecclesiastical discipline.” These letters, however, do not appear among the Pauline letters in P 46, an early 3rd century manuscript, and there is no clear external attestation in the primitive church concerning them until the end of the 2nd century.” “… … Linguistic facts such as short connectives, particles, and other syntactical peculiarities; use of different words for the same things; and repeated unusual phrases otherwise not used in Paul offer fairly conclusive evidence against Pauline authorship and authenticity.” You are entitled to a different opinion, if you so choose, and I respect it. Peace..","date":"2015-12-10","mins":"8:54 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-152659","author":"daveb_of_wellington_nz","post":"Hugh is probably correct that it is unwise to comment in any kind of detail at this stage. I did feel that the conclusion at the end begged the question, and there was too much ambiguity, with DNA apparently from every place in the globe from America to the Far East. I felt it was a catalogue which needed more analysis to arrive at any true conclusions. Perhaps I’m being precipitate, but I was unable to draw anything definitive from it..","date":"2014-09-20","mins":"7:33 am","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud"},{"id":"comment-152791","author":"daveb_of_wellington_nz","post":"The final conclusion of the paper reads as follows: “Overall DNA data were compared with historical information to verify whether the geographic areas of origin and distribution of land plant species (embryophytes) and human mitochondrial haplogroups are coherent with the proposed temporal and spatial paths of the Turin Shroud. Our experimental findings and additional clues pose a further difficulty to those who postulate a central European origin and a historical interval corresponding to the Middle Ages of the Relic.” Perhaps I am missing something, but I was not so persuaded by the content of the paper. But there may of course be more to come. I saw no reference to plant types that still remained unique to a specific Middle Eastern region. For instance, some of the pollens claimed by Frei, Danin and others, were said to be confined to the Dead Sea area, or the environs of Jerusalem. I saw no such references to similar particular unique geography in the paper. When it came to human mt DNA we read characterized by distinct haplotypes: R, U, H, and few L and M haplotypes. R0 occurs Arabian plateau (Saudi Arabia, Pakistan), smaller frequencies in Anatolia to Dalmatia; R8 in East India; U in Western Eurasia, North Africa, South Asia; U5 among ancient and most common in EUROPE (11%); U2 in South Asia; H is the most frequent in EUROPE; And so on … From this catalogue, I am not following the logic of the last sentence of the conclusion given. But perhaps I am missing something??!!.","date":"2014-09-20","mins":"4:43 pm","url":"https://shroudstory.com/2014/09/20/paper-chase-uncovering-the-sources-of-dna-on-the-shroud/","cat":"paper_chase","title":"Paper Chase:  Uncovering the Sources of DNA on the Shroud"}]
