[{"id":"comment-34510","author":"daveb_of_wellington_nz","post":"EGM: “As important as the shroud would be, or seem to be, would we not expect it to be alluded to in some fashion in the old testament as were other significant events surrounding Yeshua and the Passion narrative?” Exodus 26:31 33: “You are to make a veil of purple stuffs, VIOLET SHADE AND RED, [colour of blood??] of crimson stuffs, and of FINE TWISTED LINEN; you are to have it finely embroidered with cherubs. … You must hang the veil from the clasps and there behind the veil you must place the ark of the Testimony, and the veil will serve you to separate the Holy Place from the Holy of Holies.” cf. I Kings 6:16, the same arrangment in the Temple of Solomon. It seems a similar arrangement was in the Temple of Herod. Matthew 27:50 51: “… But Jesus, again crying out in a loud voice, yielded up his spirit. At that, the veil of the Temple was torn in two from top to bottom; the earth quaked; the rocks were split; …” The Temple veil separated the mundane from the Holy. The Shroud serves to reveal the suffering and death of the Saviour, and might be seen as the boundary wherein the mystery of the Resurrected Christ may be discovered..","date":"2013-05-23","mins":"5:12 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"id":"comment-24203","author":"daveb_of_wellington_nz","post":"Ash Wednesday, a timely reminder that the false impression of our permanence here on earth is but an illusion – our mortal remains shall inevitably return to the dust of the earth whence they came. “Memento homo quia pulvis es, et in pulverem reverteris!” The beginning of Lent, its origins no doubt connected to the spartan conditions at one time prevalent in the late northern winters. Here in the antipodes the standard liturgical calendar is disconnected from the natural cycle of the seasons, so we shall observe Lent at the time of harvest, celebrate the new life of Easter with a winter ahead of us, Advent at the end of spring and the coming of the Light of the World in mid summer. We have long given up the early immigrants’ culinary habits of a hot roast and sticky pudding at Christmas time in favour of a ham salad, or else throwing a trout or sausage on the barbie, perhaps during an outing to the sea side beach. Nevertheless the seasonal liturgies remain popular, with crowded churches at Easter and Christmas. Marking Pope Benedict’s announced resignation, the Wellington Dominion Post editorial commented that Catholic church congregations in NZ were dwindling. That is not my experience. The three Sunday Masses in my fairly spacious parish church are still all well attended, with a multi ethnic congregation, truly catholic in the broadest sense. A similar pattern seems evident in other southern countries. What can rival the pre Lenten fiesta of any South American country? In the Philippines, the Good Friday penitents out rival their northern counterparts with their excesses of self flagellation and crufixion simulations. Last night, I attended a joint Catholic Anglican service for the distribution of the ashes at our local Anglican church. Despite earlier services in the day, both congregations were well represented in a near crowded church. And I obtained a bonus by being asked to proclaim the reading from 2 Corinthians. It all went remarkably well. I nearly forgot to mention; The lady host celebrant performed her priestly duties competently, assisted by her deacon and deaconess, and our own parish priest. Joint Ash Wednesday services in NZ are now an obligatory requirement of both episcopal conferences..","date":"2013-02-14","mins":"6:30 am","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","title":"Ash Wednesday 2013"},{"id":"comment-24273","author":"daveb_of_wellington_nz","post":"Mr Devins may exercise his right as a free human being to adopt his own particular version of “cafeteria Catholicism”, even to denying the inevitable. The gospels tell us that even the elect may be deceived towards the end time. It is an act of beneficent Providence that the Holy Spirit informs Church teaching nonetheless. It is a matter of history that ever since the Roman hierarchy discovered its mistake in condemning Galileo, (WHICH IT HAS SINCE FORMALLY ACKNOWLEDGED) that it has welcomed the discoveries of Science. A case in point is that of Nicolaus Steno (1638 1686), pioneer geologist. Gottfried Leibnitz and the Catholic Church were among the few supporters of Steno, when other scientists and others were still claiming that seashell fossils in sedimentary rocks were the relics of Noah’s flood! Recent popes have welcomed the “Big Bang” hypothesis for Creation, while several American Catholics with their cafeteria approach and Southern Baptists are still recovering from the after effects of the Stopes Monkey trials in USA..","date":"2013-02-14","mins":"3:42 pm","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","title":"Ash Wednesday 2013"},{"id":"comment-24414","author":"daveb_of_wellington_nz","post":"Wasn’t Stopes (Marie Charlotte – promoter of contraception) but Scopes! Scopes Trial: (July 10–21, 1925, Dayton, Tennessee, U.S.), highly publicized trial (known as the “Monkey Trial”) of a Dayton, Tennessee, high school teacher, John T. Scopes, charged with violating state law by teaching Charles Darwin’s theory of evolution. In March 1925 the Tennessee legislature had declared unlawful the teaching of any doctrine denying the divine creation of man as taught by the Bible. World attention focused on the trial proceedings, which promised confrontation between fundamentalist literal belief and liberal interpretation of the Scriptures. William Jennings Bryan led for the prosecution and Clarence Darrow for the defense. The judge ruled out any test of the law’s constitutionality or argument on the validity of the theory, limiting the trial to the single question of whether John T. Scopes had taught evolution, which he admittedly had. He was convicted and fined $100. On appeal, the state Supreme Court upheld the constitutionality of the 1925 law but acquitted Scopes on the technicality that he had been fined excessively. The law was repealed in 1967. In 1967!!! Some right thinking good religious Americans are still struggling with the decision while the rest of the Catholic world moves on!.","date":"2013-02-16","mins":"3:33 am","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","title":"Ash Wednesday 2013"},{"id":"comment-8644","author":"daveb_of_wellington_nz","post":"The Anglican (= Episcopalian) and Roman Catholic Bishops of NZ have directed that wherever possible the Lenten ashes be administered in a joint Liturgy of the Word service (excludes Holy Communion). We’ve done this for a few years now, and are getting better at each time. Last evening I attended the service at our nearby St Christopher’s Anglican church which was well supported by both our local congregations. I was asked to deliver one of the readings which was taken from 2 Cor 5..","date":"2012-02-22","mins":"3:32 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8841","author":"daveb_of_wellington_nz","post":"I see that you’re still indulging in bad tempered gratuitous abuse, which I might be able to accept if it had any validity, but you’re so off track that it calls into question the total credibility of your whole approach. Nhilism: (1) a complete denial of all established authority and institutions; (2) an extreme form of scepticism that systematically rejects all values, belief in existence, the possibility of communication, etc; (3) a revolutionary doctrine of destruction for its own sake; (4) the practice or promulgation of terrorism … etc (Collins) I don’t see that I qualify under any of those categories. Illiteralism: No such word, you made it up! If archaeocryptology is to rely on you for its future promulgation, I wouldn’t give much hope for its future success, as you have no sense of how to persuade or to make useful points in any kind of formal debate. Goodbye Max, you post modernist proto neo Gnostic archaeocryptarcanist! Decrypt that one!.","date":"2012-02-29","mins":"9:48 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8787","author":"daveb_of_wellington_nz","post":"Fascinating piece of cryptic arcanery from Max! Tempting thought BUT: Legend of St Christopher dates from the third century, possibly a little early to be a cryptic reference to the Shroud as I suspect it would not be adequately known about until the sixth century. Though one of the most popular saints, there is no certainty that St Christopher existed historically (==> good cryptic argument). According to the Roman martyrology, he died in Lycia under the Roman emperor Decius (c. 250). In 1969 his name was dropped from the calendar of the Roman Catholic church, and his feast day is no longer obligatory. A pity, as some of my non Catholic acquaintances have mentioned that he was one of the few saints they believed in..","date":"2012-02-27","mins":"11:17 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8803","author":"daveb_of_wellington_nz","post":"Max, If Shroud = Mandylion (Sorry, Yannick) then cloth disappeared between 57 AD and 525 AD and was forgotten, although I could concede it may have been known in Syria. John the disciple saw the linen cloths in the tomb, but he may not be the writer of Revelations. My understanding of Revelations (I’ve just spent the last year with my Study Group on this book) is that its purpose is an apocalyptic vision written to give hope to the persecuted Christian churches under Nero and his successors. It is packed solid with OT allusions e.g. Ezekiel and Daniel. I don’t see that it has any cryptic references to the Shroud image, but maybe you can drop a few hints about this. I do recall that the horseman (“Faithful and True”) of Rev 19:11 16 wore a cloak that was blood stained BEFORE he went into battle and that the following army of horsemen dressed in linen of dazzling white. Anything else?.","date":"2012-02-28","mins":"4:58 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-8831","author":"daveb_of_wellington_nz","post":"Your accusation in your last paragraph is unnecessarily gratuitous, and unhappily we get to see quite a lot of such comment on this site, where one would expect a more Christian, tolerant and open approach. So far, although tempted, I haven’t yet accused you of neo Gnosticism arcanery. Like all the best literature, the books of the Bible operate at several levels, and rationalistic exegesis is only one of many legitimate approaches. You have merely chosen to concentrate on what you call the archaeo cryptic approach. The more usual and religious approach is to explore what the Scriptures have to say on the spiritual level, and on human relationships, and how we should live our lives. Others look for psychological inferences such as Jungian archeotypes, or they are more interested in archaeological or historical aspects, or perhaps the earliest texts. I’m sure you must be aware of the many cross references to the OT texts in the book of Revelations, and this is another legitimate approach. In this highly literate age, the Bible will speak to each individual person according to their understanding, life experience, and cultural background. I see a lot of this among the indigenous folk in my part of the world, both Pasifika and Maori. We now have many Filipino folk here, and they also have their own understanding. We tend to see on this site commentators with their own narrow specialised focus, complete with their own jargon calculated to intimidate others, which they claim is the only legitimate way, a product of an academic age perhaps, but there is a wider world out there. Hopefully, being of a more open frame of mind, I shall look for the features you mention. However I’m also aware that one too easily sees what one wants to see, a variant of cloud gazing..","date":"2012-02-29","mins":"4:20 pm","url":"https://shroudstory.com/2012/02/22/ash-wednesday/","cat":"event","title":"Ash Wednesday"},{"id":"comment-138257","author":"daveb_of_wellington_nz","post":"Effect of lightning in association with earthquake may be an interesting avenue of research to explore. D L Henshaw has carried out fundamental research showing tendency of radon molecules to be attracted to domestic electrical wiring operating at 50 Hz. This has been picked up by a few local authorities in UK concerning their building planning regimes near high voltage transmission lines, because of increased cancer risks with radon, and I spotted a Youtube video on it. There’s also other material generally available. Henshaw’s research paper might be found at: http://www.researchgate.net/publication/262792866 Enhanced deposition of radon daughter nuclei in the vicinity of power frequency electromagnetic fields Synoptic gospel accounts refer to earthquake at crucifixion and Matthew suggests that it was another earthquake that hurled the stone from the tomb entrance. There’s no mention of lightning, but there is reference to a darkness, sometimes interpreted as a wind driven dust cloud. I guess that even dust clouds could be charged with static electricity so that you could then get lightning strikes. So the earthquake would give emission of radon, together with its other effects, and a concurrent lightning strike would result in a very powerful electric current and strong magnetic field surges, maybe concentrating the radon. Lightning of course doesn’t operate at 50 Hz, but maybe that’s not such a significant factor, and it merely happens that only 50 Hz power lines were tested because it’s the standard. If both radon and electricity (lightning type) were both involved in producing the TS image, then it’s not so surprising that the imaging process has remained so elusive. Could this be a new avenue of future research?.","date":"2014-07-14","mins":"5:32 pm","url":"https://shroudstory.com/2014/07/14/bari-conference-a-scientific-event-unprecedented-in-puglia/","cat":"event","title":"Bari Conference:  A scientific event unprecedented in Puglia"},{"id":"comment-193632","author":"daveb_of_wellington_nz","post":"A significant question is: “To whom was the paper by Rogers & Arnoldi directed at?” To other chemists? Unlikely! To non involved scientists in other fields? Only maybe! For the benefit of his non chemistry STURP colleagues? Very possibly! For the benefit of adequately informed persons interested in the Shroud, who might have some broad understanding of science? Most likely! I am not a chemist. I am a retired civil engineer, who succeeded in passing his necessary Chemistry Intermediate quallification, so that I might have some practical use for the subject in such fields as industrial painting technology, and materials engineering. Nevertheless I find much of Roger’s general writing so chemistry dense, that I often find him a difficult read which I can seldom manage to persevere with. By way of contrast I found the 2002 paper by Rogers and his co author, a welcome and informing relief. I did not find it inconsistent, perhaps some minor errors and omissions of little consequence – the man is human. Despite its 30 pages, I did not have to baffled by a welter of over whelming and unnecessarily insignificant technical detail. So Hugh Farey might carp and nit pick that the full details of the pre tests of the pyrolysis effects on medieval paints are not included. It is sufficient for me that a chemist of Rogers’ competence reports that he carried out such tests, but found no evidence of pyrolytic paint products on the Shroud. Nor, if one excepts the loose cannon Mc Crone, did any other member of the STURP team. That has to be significant, in that there were no detectable pyrolytic paint residues remaining as the result of the 1532 fire. I see it as dealing a death blow to the Quem Quaeritis hypothesis. If the image was painted say in the 13th century for this purpose, then there ought to have been sufficient paint residues remaining in 1532 to have been affected by the fire and so be detectable in 1978. But there were not! Rogers noted that saponaria is highly reactive, and gives some comprehensive details on this matter. The banding persuaded him that the weave was of ancient manufacture, involving saponaria. The superficiality of the image, persuaded him that the image resided on the coating, and this was reinforced by the fact that the image could be decolorised leaving intact cellulose fibres at the surface. A colleague Diane Soran is reported as having shown that haemolysis products remain red when affected by saponaria, and this effect persisted. Hugh Farey was unable to replicate this result, so perhaps he was using the wrong recipe. Rogers also gave considerable attention to the detailed reasons why the 1988 radiocarbon sample was anomalous and therefore unrepresentative of the whole. Nevertheless despite demonstrating this fact, Hugh Farey credulously maintains without good reason that the dating should stand. It certainly seems curious that if the Shroud is a sample of the Quem Quaeritis cloths, that it should be the only one to survive, and the likely conclusion would have to be that it is not one such, but dates from a much earlier period when cloth manufacture produced more durable linen. The testy agnostic chemist Raymond Rogers could believe that the Shroud wrapped a crucified human body dating from ancient times. The agnostic anatomist Yves De Lage believed that it wrapped the body of Jesus Christ. The initially skeptical Orthodox Jew Barrie Schwortz is convinced that it is the burial cloth of Jesus of Nazareth. But the Catholic science teacher, editor of the BSTS newsletter, cannot believe that his Lord and Master has left him the tangible material means by which he may advocate the reality and truth of His death and resurrection..","date":"2015-03-17","mins":"3:35 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193558","author":"daveb_of_wellington_nz","post":"Several of the comments raised by correspondents are covered in a 2002 paper, “SCIENTIFIC METHOD APPLIED TO THE SHROUD OF TURIN: A REVIEW” By Raymond N. Rogers and Anna Arnoldi, and which can be found at: http://www.shroud.com/pdfs/rogers2.pdf 1)A detailed outline of the Scientific Method when applied to Shroud Studies, p.1; 2)Effect of 1532 fire on paint products: Hematite expected, heating tests had shown that hematite was reduced to magnetite, no such effect observed on Shroud; Tests had shown that all paint materials were changed by heat and pyrolysis products, some becoming water soluble, and would have diffused through the cloth, 1978 observations showed that nothing had moved with the water to douse the fire, p.4. My conclusion – if the image had ever been painted, there was no sign of any paint residues in 1532. 3)“Bands of different colored yarn can be observed in the weave of the cloth (figure 3). Where darker bands intersect image areas, the image is darker. This proves that the image color is not solely a result of reactions in the cellulose of the linen. Something on the surface of the different batches of yarn produced color and/or accelerated color formation. The observations of bands of color agree with historical reports on the methods used to produce ancient linen. They indicate a very mild bleaching technique, unlike that used after the last crusade in AD 1291” – p.5. Observation would imply that manufacture of cloth predates 1291. 4)“The warp of ancient linen was protected with starch during weaving and the finished cloth was washed in Saponaria officinalis suds. Saponaria is hemolytic, which could explain why the old blood stains on the cloth are still red. Diane Soran (deceased) of Los Alamos, tested hemolysis on Saponaria washed cloth before we went to Turin. The blood is still red on those 25 year old samples. Controls are black.” – p.5. Explanation of why blood stains have retained their red color. 5)“Saponaria is toxic, and it is a potent preservative. A textile conservator told us that old cloths tend to be better preserved than newer ones. Comparison samples loaned to us by the amazing Museum of Egyptology in Turin were still supple, and several dated to several thousand years BC” – pp 5 6. Charles F has noted that no other examples of Quem Quaeritis artefacts are known to survive. Presumably they all post date the abandonment of the saponaria method. 6)Image color does not appear under the blood stains, resides only on the surface of the fibres, could be decolorized with diimide, leaving colorless cellulose fibres – p.7. 7)Image not produced by scorch, nor by radiation, other methods also excluded – pp 8 12. 8)Discussion of 1988 Radiocarbon date, Raes samples, cotton content, varying lignin, – pp 12 16. 9)Extensive discussion on contaminants observed on Raes samples, encrustations, dyes and lakes, gums, splicing, with several micrographs; – pp 17 23. 10)“Conclusion on the association between the radiocarbon date and the time at which the Shroud was produced: The combined evidence from chemistry, cotton content, technology, photography, and residual lignin proves that the material of the main part of the Shroud is significantly different from the radiocarbon sampling area. The validity of the radiocarbon sample must be questioned with regard to dating the production of the main part of the cloth. A rigorous application of Scientific Method would demand a confirmation of the date with a better selection of samples.” – pp 23 24. 11)Various other related discussion – pp 24 29; “A logical hypothesis for image formation must accept the laws of physics and chemistry and explain all of the STURP observations, as follows: [A list of 13 points of observations follow]. “The requirements make it apparent that no single, simple hypothesis will be adequate to explain all of the observations made on the Shroud”. – pp 29 30. 12)Discussion of Maillard reaction hypothesis, including ammonia test on Edgerton linen – pp 31 37..","date":"2015-03-16","mins":"10:34 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193640","author":"daveb_of_wellington_nz","post":"… but considers it as no more than a toy for his intellectual recreation and amusement, content to give to dogs that which is sacred [Matt 6:7].","date":"2015-03-17","mins":"4:53 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193673","author":"daveb_of_wellington_nz","post":"Part of it may be due to differences in vocational temperament. It seems to be in the nature of the scientist that he is willing to take forever in coming to the truth, developing his hypotheses, testing them, revising, retesting, and so on. The engineer never has that luxury. He needs to come to a decision, no matter how difficult or intractable the problem, on time, inevitably a solution which he knows will at least satisfy. He may take the advice of experts, and depending on his assessment of their reliability will factor in margins of safety. Rogers does it for me, no matter how imperfect his work may be.regarded by purists, and at present he is the best that I can see. His work is one among many other reasons that I regard the Shroud as the authentic burial cloth of Christ, and as such I consider it is the most precious relic we have of Him. Most certainly it is potentially that, and so should be approached with proper reverence by the faithful. It cannot be regarded as a mere toy for the mere purpose of a mental exercise. Jesus was no stranger to righteous anger, and I make little apology if I occasionally show a similar zeal in my comments. A Wellington man has just been sentenced to two and a half years jail for insulting the Buddha in Myanmar, despite his apologies to the judge. His crime was merely for depicting a psychedelic Buddha wearing headphones, as part of an advertisement for his downtown bar. In Burma, those who insult any religion may face up to two years jail, plus another two years if it is in writing. Despite what one might think of any drawbacks of the Burmese military regime, they apparently still retain some sympathy for others’ religious sensitivities, a value utterly lacking in the once Christian West. Or to paraphrase Pope Francis “Je ne suis pas Charlie!”.","date":"2015-03-18","mins":"4:58 am","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-193699","author":"daveb_of_wellington_nz","post":"Barbet, in his Preface to “Doctor at Calvary” recalls that Dr Pasteau, President of the St Luke Society of Catholic Doctors of France, was explaining Barbet’s researches to a gathering of high dignitaries at he Vatican. The then Cardinal Pacelli (later Pope Pius XII) along with others went pale with grief and compassion, exclaiming, “We did not know; nobody ever told us.”.","date":"2015-03-18","mins":"1:53 pm","url":"https://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/","cat":"exhibition","title":"Barrie Schwortz:  Not a Painting, Photograph, Scorch or Rubbing"},{"id":"comment-213852","author":"daveb_of_wellington_nz","post":"I suspect that perhaps Heller, Adler and other scientists who had studied the Shroud, came to a conclusion that Mc Crone’s work lacked credibility because he only ever relied on his overly self confident knowledge of microscopy, seemingly shunning other more recent methods of analysis such as spectrography. In one reported interview when asked why he thought that red ochre was present, he fundamentally attributed the conclusion to his own experience of microscopy, virtually saying “Because I said so”. I don’t believe that that’s the way science is meant to work..","date":"2015-10-29","mins":"2:12 pm","url":"https://shroudstory.com/2015/10/29/battle-of-the-chemists/","cat":"presentation","title":"Battle of the Chemists"},{"id":"comment-17539","author":"daveb_of_wellington_nz","post":"Adamo’s suggestion that AB blood only developed in the last 1000 years has to be a nonsense. This is shown by the widely scattered universal distribution of the various blood types. Even such a basic quick search on Wikipedia points to it: Check: http://en.wikipedia.org/wiki/ABO blood group system#Distribution and evolutionary history There are several other web sites showing the universal distribution of blood types, and very likely more authoritative than Wikipedia. Here’s a few sample percentages on the frequency of AB+, roughly 8 times more prevalent than AB : Austria 6.0%; China 5.0%; Czech Rep 7.0%; Finland 7.0%; France 3.0%; Hong Kong 6.35%; Poland 7.0%; Ireland 2.0%; Israel 7.0%; Korea 9.0%; Saudi Arabia 4.0%: Turkey 7.0%. Notes from Encyc Brit: [Blood groups follow laws of Mendelian heredity:] [Comments on racial inheritance:] “By the 1960s and ’70s, scientists were writing about racial groups as populations that differed from one another not in absolute features but in the frequencies of expression of genes that all populations share. It was expected that each race, and each population within each race, would have frequencies of certain ascertainable genes that would mark them off from other races.” “Information on blood groups was taken from large numbers of populations, but when scientists tried to show a correlation of blood group patterns with the conventional races, they found none. While populations differed in their blood group patterns, in such features as the frequencies of A, B, and O types, no evidence was found to document race distinctions.” “The internal variations within races have proved to be greater than those between races. ” If AB originated in Hungary only 1000 years ago, we would expect to see this reflected in the geographical distribution of AB with higher percentages being clustered around central Europe and tailing off into the Middle East and Asia. In actual fact we see significant percentages occuring in such widely scattered locations as: Korea, China, Turkey, Finland and Poland. Adamo’s theory is clearly a nonsense, which seems to be the consensus of most geneticists. AB blood group clearly occurred at some earlier stage of human development..","date":"2012-10-12","mins":"6:41 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17564","author":"daveb_of_wellington_nz","post":"Encyc Brit states that blood grouping follows laws of Mendelian inheritance, which seems reasonable. Tables of ethnic groupings suggest to me that there were very likely rather more blendings of A and B groupings resulting in AB progeny than just the Magyar said to have occurred around 950 AD. Check and unhide ethnic groups table on web site: http://en.wikipedia.org/wiki/Blood type Content is tagged “factual accuracy is disputed”, but nature of dispute is not elucidated. But sample figures for AB (without Rh tags) show: Australian aborigine & NZ Maori 0%; Ainu (Japan) 18%, but Japanese 10%; Arabs & Armenians 6%; Hungarians 5%, but Gypsy (Hungarian) 10%; Hindus (Bombay) 11%; Kalmuks 11%; Koreans 10%; Persians 7%; Tatars 13%; Papuans (New Guinea) 9%; Etc Both North and South American Indian populations show extremely low figures, 0% to 1%. It seems fairly obvious that whenever a B dominant encountered an A dominant, progeny could result in AB, and this appears to have occurred sporadically on a number of occasions, not just in 950 AD. One would expect Isolated populations to have stayed stable at either A, B or O, but this seems belied by the Ainu, Papuan, Kalmuk and other figures, even the Persian. Kelly Kearse posted an excellent article on Shroud’s blood group as AB several months ago on this site. The Sudarium of Oviedo is also AB, and this is known to have been dated at least a few hundred years before 950 AD. It seems drawing a long bow to dismiss the Shroud on the basis that the blood group of AB did not emerge before 950 AD. Someone else can look into the business of whether there are any earlier examples. We have seen on this site allegations that “all old blood degrades to AB” which has been disproved. Are the Shroud sceptics really that desperate to discredit it by such a means?.","date":"2012-10-12","mins":"5:56 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17566","author":"daveb_of_wellington_nz","post":"Concerning Kelly Kearse’s comprehensive posting on AB Blood Group on Shroud and Sudarium: Posting can be found at: https://shroudstory.com/2012/02/16/must read all old blood types as ab not exactly/ Several comments,, including support from, would you believe, Colin Berry!.","date":"2012-10-12","mins":"6:11 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17567","author":"daveb_of_wellington_nz","post":"Concerning ancient Jewish blood types: There is a known source of 1st century Jewish blood samples, which is regularly washed down the drains of the Israeli Antiquities Authority. Whenever a cemetery is discovered as a result of Israeli building development,the ossuaries are recovered, the bones are buried in a common grave, and the ossuaries cleaned with no scientific analysis of the contents. This is noted in Jacobovici’s book on “The Jesus Family Tomb” Bet you can’t get a responsible or coherent reaction out of the IAA on blood types distribution of 1st century Jews, although the data is potentially available there if anyone is prepared to do the work!.","date":"2012-10-12","mins":"6:25 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17573","author":"daveb_of_wellington_nz","post":"And even with the remains of 36 people available to him, your friend Professor Amos couldn’t even say if the blood types of A, B, AB or O were present or not! What does he do to earn his money as District Archaeologist, index ossuaries?.","date":"2012-10-12","mins":"10:06 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17129","author":"daveb_of_wellington_nz","post":"And like the six blind men of ancient India, all the experts will examine the elephant, and no doubt come up with a camel! Some say there were seven, but In the version by John Godfrey Saxe (1816 87) there were only six (it scans better that way): It was six men of Indostan To learning much inclined, Who went to see the Elephant (Though all of them were blind), That each by observation Might satisfy his mind And so these men of Hindustan Disputed loud and long, Each in his own opinion Exceeding stiff and strong, Though each was partly in the right And all were in the wrong So oft in theologic wars, The disputants, I ween, Rail on in utter ignorance Of what each other mean, And prate about an Elephant Not one of them has seen..","date":"2012-10-01","mins":"3:37 pm","url":"https://shroudstory.com/2012/10/01/davor-aslanovski-to-attend-b-s-t-s-british-society-for-the-turin-shroud-meeting/","cat":"event","title":"Davor Aslanovski to attend B.S.T.S. (British Society for the Turin Shroud) Meeting"},{"id":"comment-17949","author":"daveb_of_wellington_nz","post":"Dennis now has about nine comments expressing interest, but also scepticism. Giulio Fanti while critical of Ray Rogers’ Maillard hypothesis, generously offers his advisory services. Colin Berry gives chemistry reasons for his scepticism, and is supported by Adrie van der Hoeven. Ray Schneider is supportive of intent of experiment..","date":"2012-10-20","mins":"6:41 pm","url":"https://shroudstory.com/2012/10/18/denis-mannixs-maillard-experiment-proposals/","cat":"event","title":"Denis Mannix’s Maillard experiment proposals"},{"id":"comment-205702","author":"daveb_of_wellington_nz","post":"Piero, Thanks for the update on the LHC which I’ve been neglecting of late. Doubtless we will eventually see an entirely new batch of technologies develop when all the new data becomes more widely known. The pentaquark would still seem to be the same matter common in our own universe, just a different combination of quarks. I tend to see the resurrected body as made up of an entirely different as yet unknown kind of matter, existing in a different universe, of which our own universe may be a subset. Dark matter which is abundant throughout the universe as yet remains a mystery. Interestingly, two, three and five are Fibonacci numbers which are pervasive throughout nature, either singly or in pairs. I wonder if there might be an octoquark?.","date":"2015-07-14","mins":"3:54 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"id":"comment-205930","author":"daveb_of_wellington_nz","post":"Piero, I do not see my idea of a resurrected body being of an unknown kind of matter as heretical at all. In fact it is sound, both rationally and theologically. What is heretical is to assert that the resurrection was that of a “spiritual body”, which is a contradiction in terms. If it is a spirit, it cannot be a body. 1. It is possible that a spirit may be perceived by men because of a special divine dispensation. Mystics and the scriptures refer to appearances of angels for instance. In Matthew’s gospel, angels appear to St Joseph, but are said to have appeared to him “in a dream”. But a spirit cannot be touched, nor does it eat food. Normally a spirit cannot interact with the matter of our universe. 2. In the accounts of the resurrection, Jesus appears to the apostles (perception); Thomas “touches” his wounds; Jesus “walks” and “talks” with apostles on the way to Emmaus, he “sups” with them; when they are gathered in the upper room, he asks if they have something to eat; when they go fishing, he is seen preparing breakfast for them. I assert that a spirit can do none of those things! Therefore he has some kind of resurrected “body” ! 3. Normal matter cannot pass through walls; Nor can normal matter spontaneously “appear” and “disappear”; nor can it normally levitate itself into the clouds as the apostles saw at the Ascension. Therefore the matter that comprised Christ’s resurrected body must be some kind of matter, as yet unknown to us. That can be the only logical conclusion!.","date":"2015-07-16","mins":"5:54 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"id":"comment-206230","author":"daveb_of_wellington_nz","post":"Hello Angel, Thank you for your comments about Cooper Pairs which I had not known about, but I had been aware of other properties of superconductors, as early as my undergraduate days now in the long distant past. You didn’t mention whether Cooper Pairs also have the property of passing through walls or spontaneously disappearing and reappearing elsewhere. But I’ll check up on your links. My comments on the octaquarks were pure speculation based on no more than 8 being a Fibonacci number. You’re probably aware that the series is: 0, 1, 1, 2, 3, 5, 8, 13, 21 … Each number is the sum of the previous two, and were discovered by Leonardo Fibonacci in the 13th century. They occur abundantly in nature and have several fascinating properties including a relationship with the golden ratio. I can drivel on about them for hours. Need we search for a tredecim quark? Thank you for your kind comments concerning my contributions to the site, and my sincere condolences at the loss of your sister. Blessings, Daveb.","date":"2015-07-20","mins":"4:03 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"id":"comment-22753","author":"daveb_of_wellington_nz","post":"In response to Advocatus Diaboll Hugh and supplementary to salient points made by Advocatus Russ: (i) The victim was Jewish, as evidenced by his long hair and beard, whereas it was the custom in other contemporary cultures to be clean shaven and short haired; (ii) The Shroud is clearly a burial cloth with the victim laid out in death, but is unique in that there is no body present; (iii) The image is that of a body within no more than 40 hours of death as there no sign of corruption. (iii) There is no evidence of smearing of fluid remnants nor damage to the cloth resulting from deliberate removal of the body within the 40 hours of death by persons unknown; (iv) Ergo the body disappeared within 40 hours of death by some means unknown, but very likely by the process called resurrection; There is only one crucifixion victim in history who has a claim to have been resurrected; (v) The cloth having contained a dead body and being blood stained was to be deemed “unclean” by the same Jewish culture and therefore not to be conserved nor revered, but nevertheless for some good reason was so conserved and revered; (vi) Advocatus Diaboli assertion: “Common grave? Then where are all the others?” is most peculiar. Is he denying that the bones of other crucifixion victims, of which there were countless thousand no longer lie in the soil of the Middle East but have also been resurrected? But if he is looking for evidence of crucifixion among these bones he will not find it, as it was the common practice of Roman soldiery to recover crucifixion nails because they were highly prized as medical talismans. It is only the case of a jammed heel bone nail which could not be so recovered that this nail provided evidence of crucifixion in the particular case he mentions. . I conclude that the circumstantial evidence is far more conclusive than Advocatus Diaboli allows, and that indeed the case is proved beyond all REASONABLE doubt! Those who wish to maintain UNREASONABLE doubts may do so if they are so inclined to hold to such view. But that is not how the judicial system works!.","date":"2013-01-26","mins":"3:27 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-22764","author":"daveb_of_wellington_nz","post":"Try excavating Jewish graves with a muster of the ultra orthodox throwing rocks at you, the usual experience of archaeologists there. A nailed heel bone – that was an act of incompetence presumably by a rookie soldier – the usual technique was to nail between the talus bones in the feet – check Barbet – he explains the usual process in great detail. I know about the popped carpal wrist bone found in an ossuary. oddly the only other evidence in that ossuary was a few fibres of a burial cloth – James Cameron hoped to get a match with the Shroud – perhaps he made a tactical error in consulting the Jesuits about it – it came to nothing – incompetence upon incmpetence – Shades of Talpiot!.","date":"2013-01-26","mins":"6:20 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-22768","author":"daveb_of_wellington_nz","post":"Error in mine above – it was not James Cameron seeking to get a match between fibres in the Talpiot Jesus ossuary and the TS, but Charles Pellegrino, one of the authors of a book on the Talpiot tomb..","date":"2013-01-26","mins":"7:18 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-22839","author":"daveb_of_wellington_nz","post":"I doubt if Pellegrino would have had a problem with 1 Cor 15. It may have influenced a comment he once made that apart from the carpal wrist bone that the only other evidence in the Jesus ossuary were traces of linen fibres. Some place had to be found for the immediate placement of the burial cloth as it contained blood, and an ossuary in a family tomb would be as good as any other. Dr Kloner may be correct in his assessment of 36 persons being buried at Talpiot, but otherwise ITA archaeologists generally generate no confidence in any of their assessments of potentially Christian burial sites. The whole Talpiot business was badly mishandled from the very beginning. It was exacerbated by (1) the initial rushed investigation (2) ultra orthodox Jews attacking the archaeologists (3) the demands of the Israeli developers for quick access to the site for their building work (4) the ITA policy of cleaning newly discovered ossuaries without gathering any useful scientific information of their contents (5) Jacobovici’s outrageous sensationalist claims and assertions (6) The predictable conservative evangelical Christian reactions to those outrageous claims (7) Western archaeologists miffed at amateur investigations (8) The defensive posturing of the ITA in the aftermath (9) The failure to take proper account of statistical probabilities in the combination of names appearing on the ossuaries. No one knows nor ever will know the truth about Talpiot, because it was sheer incompetence upon incompetence! And now it is too late because any useful information that might have enlightened has now been irretrievably lost, and positions have become lamentably entrenched. It might well have become one of the most important early Christian sites in Christendom, or not as the case might be. Jesus was not buried at Talpiot but in Joseph of Arimathea’s tomb – then he rose from the dead. But what happened to his burial cloths afterwards? Nobody knows! Too late! Too late!.","date":"2013-01-27","mins":"3:54 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-22878","author":"daveb_of_wellington_nz","post":"(1) Professor Kloner may be a respected archaeologist in Israel. Louis claims he was District Archaeologist there. I presume that means he was associated with the Israeli Antiquities Authority. (the IAA – not ITA as I incorrectly had it above). The IAA has its own agenda, which is to support the interests of the Jewish established religion there, to support Zionism, to defend its own questionable actions and errors, and has little interest in respect of any remnants in the origins of Christianity there; I have already commented on its inadquate treatment of ossuaries found there, whether Christian or other; (2) I am nobody’s catpaw, and desisting from any argument that might play into the hands of others is only relevant to point scoring in a religious or political argument. It can have no place in any objective scientific enquiry; certainly there is little evidence of any kind of objective enquiry in the Talpiot case, and that is the nub of my complaint about it; (3) Agenda driven enquiries are not the exclusive domain of agnostic archaeologists, nor the IAA defending the indefensible, nor sensationalist authors with books to sell, nor even biblical literalists and other evangelicals, but are to be found in every place. Two such agenda driven personalities can be found in the personalities of such worthy churchmen as Canon Ulysse Chevalier and Jesuit apologist Herbert Thurston..","date":"2013-01-28","mins":"4:36 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-22929","author":"daveb_of_wellington_nz","post":"Therefore following through on Hugh’s logic, by noting the resemblance between the Shroud’s facial image and the various early icons, Justinian coins and so on, we may deduce that not only the Shroud but whatever the Image of Edessa was, (if it was not identical to the Shroud), are actually the burial cloth and an image of the totally mythical Greek god Zeus. I can understand why we read this preposterous hypothesis on this blog first. Most pseudo skeptics, often quite intelligent people, can come up with more credible, though hardly as imaginative, arguments. Advocatus Diaboli will have to do a lot better than that! Must try harder!.","date":"2013-01-28","mins":"3:11 pm","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-22886","author":"daveb_of_wellington_nz","post":"I think Ron may be incorrect in asserting that it was the regular practice to dump Jewish crucified bodies into a common or open grave, and that Jesus is the only know case of a decent burial. Pierre Barbet was not only a highly competent pathologist, but he was also a competent scholar in the classics. And this competency illuminates much of his book “A Doctor at Calvary”. He is able to cite several classic authorities on the then current practices. Ron can find in Barbet’s work that relatives’ requests for the bodies of executed criminals were usually granted as a matter of form, and were only denied for the worst offences such as piracy, rebellion or general insurrection, or when the military wished to make an impression on the general population. Barbet even comments that acceptance of bribes for the bodies was considered immoral by the Roman authorities. Coming now to Hugh’s question as to the identity of the TS man, I have another challenge for him and I’m about to raise the probability stakes. It is known that there was such an object as the “The Image of Edessa”, which lies behind the 3rd century Abgar legend, or the Doctrine of Addai. The principal in the legend is King Abgar V, a 1st century contemporary of Jesus, but which in reality more likely refers to King Abgar VIII the Great in the 2nd century and who is credited with establishing Christianity in the city by about 150 AD, certainly by 200 AD. The “Image of Edessa” was said to be a miraculous portrait of Jesus, which soon afterwards disappeared, possibly to Antioch, but resurfaced in Edessa about 525 AD, Very many copies of the “Image of Edessa” were made and distributed throughout eastern Christendom, including for example the Christ Pantocrator, along with many others. The “Image of Edessa”, whatever it was, was eventually taken to Constantinople becoming part of the King’s relic collection. Now Hugh can make any number of comparisons he likes with these various early portraits of Christ. He will then discover, perhaps to his astonishment, that many of these very early portraits of Christ bear an uncanny resemblance to the facial image on the Shroud. This was first observed by Paul Vignon around 1902. The writer Ian Wilson made what he believed was a strong case for the Image of Edessa being the Shroud folded in such a way as to conceal its identity as a burial cloth. Practically all Byzantine art historians disagree with him, but this is irrelevant to the thread of the present argument. The point is that standard likenesses of Christ were developed in the very early centuries of Christianity, which had as their basis an alleged image of him. And these likenesses conform to the facial image of the TSM. I agree that it is possible that these early Edessans and their various copyists might, just might have been mistaken as to the identity of the person on whatever the image was they happened to have. But nevertheless it raises the probability stakes in the jigsaw, and it is becoming less circumstantial than ever. Work with that one, Hugh! Kind regards, daveb..","date":"2013-01-28","mins":"5:42 am","url":"https://shroudstory.com/2013/01/25/eric-j-jumper-to-speak-on-the-shroud-of-turin/","cat":"event","title":"Eric J. Jumper to Speak on the Shroud of Turin"},{"id":"comment-215234","author":"daveb_of_wellington_nz","post":"And as I commented recently, it will continue to go on and on and on with absolutely no resolution. The main flaw I see is that a well established practice of taking grab samples from known ancient textiles was followed, such as those found in tombs, burial clothes and mummy wrappings. That is fine for such cloths where there can be better than reasonable confidence that such cloths have never been subject to any kind of recent repair. That is not the case with the Shroud. It is known that the Savoy family removed small pieces and threads from time to time, as occasional gifts for family members, and various notables. Repairs were carried out to preserve the appearance of the cloth, and it has been alleged that these were skilfully done to the point of being difficult to detect. Therefore the underlying assumption of homogeneity, the basis for a grab sample, is highly suspect. We all know that Raymond Rogers, the one chemist who was most familiar with the chemistry of the Shroud was convinced that he had detected such a repair at the site of the grab sample. That is sufficient in itself to raise suspicion. I would concur with the the main thrust of Antero’s comment, but with one exception: “A new radiocarbon sample should be done only after a mature analysis by experts from several fields of science namely textile, physics and chemistry.” The exception is omitting to mention the importance of representative sampling in any such analysis. Even scientists with their specialist expertise are often unaware of the proper techniques involved in taking truly representative samples, and lack the necessary training in proper sampling theory. They are more often focused on the complex technology of their own particular discipline, than they are of being aware of the complex mathematical techniques involved in the theory of Applied Statistics essential to a valid testable sampling regime. There is course a practicable problem in conserving the integrity of the relic, and it would seem likely that this was a significant factor in the choice of the 1988 sampling site. Perhaps further testing would be better deferred to a later time when less intrusive testing might eventually become available. In the meantime, we may have to be satisfied with the fact of ongoing controversy among the diverse points of view. However, because of the lack of representative sampling in 1988, I consider it an error of close mindedness to make any kind of dogmatic assertions concerning the 1988 sampling. Remember, that no other kind of tests on the sample, apart from radiocarbon dating, were permitted at that time!.","date":"2015-11-28","mins":"5:25 am","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"},{"id":"comment-215250","author":"daveb_of_wellington_nz","post":"And as I stated above it yet goes on and on and on …. The only obvious patches were the burn hole repairs of 1532 by a group of Poor Clare nuns, who were given the simple task of patching up what was nearly a major disaster. “The reweave theory never made any sense.” ??!! It does make sense for instance that Margaret of Austria, with all the resources she had available and well known for her particular skills in tapestry, would seek to preserve the integrity and original appearance of this important Savoy endowment. Similarly, it also makes sense that Princess Clotilde might well act likewise in 1868!.","date":"2015-11-28","mins":"1:52 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"},{"id":"comment-215265","author":"daveb_of_wellington_nz","post":"See Thibault comment Nov 28, more recent posting “Analysis of Fibres, Raes Area”: “Rogers (not myself – [ie TH]), using micro chemistry, found a dye on the other Raes (and C14) threads he had. He also found and end to end splice in Raes #1. Villareal and al. From the Los Alamos laboratory confirmed this observation and found that the splice was secured by a brown crust which seems to be some kind of resin.” Suggests it may be indicative of some kind of reweaving to me! T’ain’t homogeneous!.","date":"2015-11-28","mins":"6:00 pm","url":"https://shroudstory.com/2015/11/25/finally-an-explanation-for-the-exclamation-mark/","cat":"lectures","title":"Finally, An Explanation for the Exclamation Mark!"},{"id":"comment-18143","author":"daveb_of_wellington_nz","post":"[David Rolfe] read out a goodwill message from Ian Wilson (now living in New Zealand). I haven’t been able to find any reference that Ian Wilson is now living here in New Zealand. Last I heard he lived in Queensland (Australia) Northern hemispherites can sometimes be confused about geography south of the equator. There’s about 1200 miles of Tasman Sea (We call it “The Ditch”) between the two countries. Happy to stand corrected, if Ian now actually lives here! Maybe NZ was the address Ian gave in his info to DR?.","date":"2012-10-23","mins":"3:27 pm","url":"https://shroudstory.com/2012/10/23/fly-on-the-wall-summary-of-the-bsts-meeting/","cat":"event","title":"Fly on the wall summary of the BSTS Meeting"},{"id":"comment-110661","author":"daveb_of_wellington_nz","post":"I can vouch for September 14 being the feast day of the Exaltation of the Holy Cross, for it is my brother’s birthday, and I have known of the feast day for at least 60 years. My own birthday occurs on December 25, another significant date in the western church calendar. My sister’s occurs on August 15, the feast of the Assumption, and the anniversary of the mandylion’s arrival in Constantinople in 944. Both my father and father in law shared the same birthday on August 17, within a day after Constantine Porphyrogenitus set the feast day of the mandylion. My wife, my mother and my sister in law also shared the same birthday, March 26, the day after the feast of the Annunciation. Our family has always considered this concurrence of birth dates a remarkable set of coincidences, and hopefully propitious..","date":"2014-05-04","mins":"7:33 am","url":"https://shroudstory.com/2014/05/04/happy-feast-of-the-holy-shroud-day/","cat":"event","title":"Happy Feast of the Holy Shroud Day"},{"id":"comment-102910","author":"daveb_of_wellington_nz","post":"John Iannone is listed on Shroud com as a recognised Shroud speaker and has written several works on the subject. The article appears on ‘Coach Kevin Collins” blog site [sub title “Coach is Right” should be read as a political position not a truth statement]. Article is written by Suzanne Eovaldi and contains several whacky statements. I wouldn’t know if Iannone would own them or not. Main topics on the blog site seemed aimed at an extreme right wing Republican readership, some attacking Obama health care programme. Outside USA, it’s generally considered that USA has the worst health care system of any country in the western world. Other countries less well endowed with economic resources succeed in good publlic health care programmes. You should deal with it..","date":"2014-04-23","mins":"4:21 pm","url":"https://shroudstory.com/2014/04/23/how-many-strange-statements-can-you-count/","cat":"lectures","title":"How many strange statements can you count?"},{"id":"comment-23144","author":"daveb_of_wellington_nz","post":"I just googled Rabbi Photobucket. Apart from Rabbi Sarah, Rabbi Rabbit and a few cartoons, most of the other authentic rabbis had long hair and beards. It’s the way of the utra orthodox in Israel even today. “Galatians 4” is just another fanatical “Hate Catholic, Hate Pope” site, specialising in self deception, fooling themselves, and spreading their lies. Guess who’s behind it, Clue – C S Lewis gets a bad press on that site. Yes it’s Screwtape again!.","date":"2013-02-01","mins":"5:40 am","url":"https://shroudstory.com/2013/01/30/like-a-catholic-hippie-jesus/","cat":"event","title":"Like a Catholic Hippie Jesus"},{"id":"comment-51212","author":"daveb_of_wellington_nz","post":"Jokes don’t need a pedigree! If you can’t come up with your gags, you never get to make it on any Kiwi social scheme. Being entertaining is de rigeur! The besetting crime is being boring!.","date":"2013-11-14","mins":"4:00 am","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-51140","author":"daveb_of_wellington_nz","post":"Louis, I don’t think you get it! The first Creation myth to be set down was that in Genesis Ch 2; It is an anthropic story, probably evolved over camp fires, God “walks” in the garden. He asks questions (omniscience not there yet?) “Adam, where are you?”; There is a talking snake! The Creation story of Genesis Ch I evolved in Babylon during 6th c.BCE, and is a more uplifting story, it was a product of the Jewish exiles exposue to Babylonian systematic and scientific thought. “In the beginning GOD created the heavens and the earth … Let there be light!” But you don’t throw away the old myths and the older story was relegated to Ch 2. Another example: discovery of the full body image of the Shroud in Constantinople, did not result in the old story about Abgar being discarded, it was kept in the Greek liturgy! I think it was Pope John XXIII (Roncalli) who explained to Nikita Khruschev the significance of the Genesis ch 1 story of creation in seven days, each “day” is an age or era. The order in which the individual events are set down is scientific and logical, but without the camp fire mythology. Q: “What is a million years to you, Lord?” G: “Merely a minute!” Q “What is a million dollars to you, Lord?” G: “Merely a cent!” Q: “Please, Lord, may I have a cent?” G: “In a minute!”.","date":"2013-11-13","mins":"3:46 pm","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-50979","author":"daveb_of_wellington_nz","post":"A hair raising litany of incompetences upon incompetences! A perennial question – “Who guards the guardians??!!” It needs more than a Texas sheriff!.","date":"2013-11-12","mins":"3:29 pm","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-51055","author":"daveb_of_wellington_nz","post":"1) John’s NCR reporter would seem to be ignorant of Bart Ehrman’s comprehensive study, “Did Jesus Exist?” and Ehrman although now claiming to be an agnostic, is a highly reputable scholar in New Testament and other classical works who musters several solid independent proofs for the real existence of Jesus as an historical person. He completely demolishes the mythology theories, prevalent at the start of the 20th century and prompting Pius X’s condemnation of Modernism. The mythological approach appears to have been behind the efforts of Herbert Thurston and Ulysse Chevalier to discredit the Shroud, as Secondo Pia’s photographs, tended to support the traditional beliefs of the Church. These two gentlemen hoped to take the Church in a different direction, and so conspired to present Bishop D’Arcis’ so called memorandum to Clement VII in a more persuasive way than could be justified by their improper exercise of scholarship. 2) The traditional association of religion and science is an interesting one. In primal societies, it is the shaman who has all the arcane wisdom; it is evident in the Pacifica and Maori peoples for example where the schools of learning, including astronomy, navigation and other techical skills were taught by various tohunga with specialist expertise, frequently involving chants to be learnt by rote for the actual practioners. In Ancient Egypt the mathematical and science skills for the various civil works were taught by skilled scribes in their schools, refer Rhind papyrus, copied by scribe Ahmes 1650 BCE. In Babylon, however, mathematics and science remained the domain of a priestly caste. The Babylonians were extremely skilled, knowing at least 15 Pythagorean triples 1000 years before the time of Pythagoras, had calculated the square root of 2 to seven decimal places, had developed a base 60 place holder system with a zero, and which was still used in astronomy up to medieval times until it was supplanted by the Indo Arab denary system. It was the Jewish exiles’ exposure to Babylonian science which resulted in their supplanting the Genesis anthropic Creation myth of Chapter 2, with the more elevated and scientific approach of Chapter 1. 3) Pope Francis certainly seems to have the charisma and knows how to touch the hearts of the present age. But yet he is only another Apollos, Paul or Silas. He is not Christ, the person that we see in the image of the Shroud, the evidential sign for our present skeptical age..","date":"2013-11-13","mins":"6:20 am","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"},{"id":"comment-17980","author":"daveb_of_wellington_nz","post":"Re CF 2): Weaves & Cloths: I referred in recent posting under Diana Fulbright header, to her paper givng several examples of cloths and weaves found in Judean Desert: “Akeldama repudiation of Turin Shroud omits evidence from the Judean desert”, Diana Fulbright, Frascati Conference May 2010. Paper is secured, but when I went back to it, Google said it was damaged and could not be repaired. I originally found it at: http://www.acheiropoietos.info/proceedings/Fulbright Akeldama Web.pdf If you can’t find it here, try Frascati Shroud Conference. Paper includes several photographs, and micro photos, close ups and weaves, and also desert weavers, etc. ..","date":"2012-10-21","mins":"3:57 pm","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","title":"On the Day of the BSTS Meeting"},{"id":"comment-18017","author":"daveb_of_wellington_nz","post":"I believe Professor Fulbright wrote her paper in response to comments, partly arising from the single plain weave shroud at Akeldama, and partly exposing the lie to elaborate weaves such as 3:1 herring bone twill of the TS were uncommon in 1st C Palestine, which is the reason for her examples being confined to the Judean desert. The paper needs to be understood in that context, so that other examples from elsewhere were not relevant in that context..","date":"2012-10-22","mins":"4:33 am","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","title":"On the Day of the BSTS Meeting"},{"id":"comment-17981","author":"daveb_of_wellington_nz","post":"Fasciniating commentary Louis; I didn’t know that about Nietzsche, I thought he was the first of the modern atheists – “God is dead”, “We have killed God”. Hawking seems to have fluctuated a bit – His early writings on “Big Bang” theory seem to have him believing in a Creator, and then he satisfied himself that it was all going to be automatic anyway, and there was no need for God, perhaps he wasn’t prepared to make the leap of faith into the dark – like others such e.g. Betrand Russell “He had to know!” Re Pontifical Academy of Sciences” I recall reading several years ago a few science papers written by Pope Pius XII (Eugenio Pacelli) on qasars – he had an active interest in modern astronomy..","date":"2012-10-21","mins":"4:12 pm","url":"https://shroudstory.com/2012/10/21/on-the-day-of-the-bsts-meeting/","cat":"event","title":"On the Day of the BSTS Meeting"},{"id":"comment-25839","author":"daveb_of_wellington_nz","post":"Kelly, you have a remarkable competence in expressing the plain truth in a very tactful manner. If I’d got here first, I would have been much more blunt about YC’s comment! “We must always decode the language of Benedict 16.” What arrogance!.","date":"2013-02-27","mins":"3:31 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-27014","author":"daveb_of_wellington_nz","post":"I suspect that there may be an error in the following assertion: “One big difference is that Byzantine Rite priests are allowed to marry and have children.” My understanding is that in the Greek Orthodox churches for example, it is more usual for seminarians in their last year before ordination to the priesthood, to be encouraged to marry at that time. It is unusual, if not strictly forbidden, for an ordained priest to then marry. Orthodox bishops are selected from unmarried priests, usually those who have followed a monastic vocation, rather than a pastoral vocation. [Notwithstanding St Paul’s injunction that a bishop should only be married to one wife] I would be surprised to learn that this Orthodox discipline is any different among Uniate Ukranians..","date":"2013-03-10","mins":"5:25 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","title":"Picture of Veneration in a Ukrainian Parish"},{"id":"comment-26854","author":"daveb_of_wellington_nz","post":"This posting has little to do with which Pope said what or didn’t say that. It’s about what reliability we can take from newspaper reporting. The press, and media generally, like to posture about the high ideals of the Fourth Estate and demand a licence to publish what they will under the slogan of the “freedom of the press”. In reality most media outlets in the western world exist for one purpose only, to return a dividend to their shareholders. Their employees climb onto this bandwagon knowing full well that in order to feed themselves and their families, they are expected to present their stories in as sensational way as they can, for this will sell their employer’s products and please the shareholders. Notice how this Associated Press reporter first creates the impression of report authenticity by commencing her report with factual quotations, which can be easily checked and confirmed, and consolidates this with a few paragraphs of objective factual commentary. Then comes the creative part. “A Vatican researcher [unnamed] said late last year (writing on the cloth…)”, “But experts [again unnamed] stand by carbon dating of scraps of the cloth …”. Further waffly commentary about “Some (who??) have suggested contamination skewed the results”. No mention of the real reason – the failure to take a representative sample which just happened to be a patch! The effect is to create a doubt in the mind of the reader as to what the Pope and Shroud authenticists believe or have to say on the topic, they are in fact evidently in “cloud cuckoo land”. Bring in a bit of sensationalism – recycle the sex abuse scandal, which has nothing at all to do with the subject in hand, and that, my friends, is how you compose a newspaper report! Many years ago, we had a regular weekly radio programme in NZ, called “Fourth Estate”, a media watch dog programme which provided objective commentary on the failures and successes of media reporting. I guess other jurisdictions probably had similar versions of it. Now the lobbyists of the press conglomerates have seen the dispatch of such useful critical programmes, and we must be our own critics. One enlightening way is to read carefully the stories where we have our own inside information, and to compare the report with what we know are indeed the facts. Similar comments apply to the other reports. Note the Christian Monitor headline “Pope Benedict says Shroud of Turin authentic burial robe of Jesus”. Pope Benedict did not specifically say that at all!.","date":"2013-03-08","mins":"3:56 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-27016","author":"daveb_of_wellington_nz","post":"Extract from Encyclopedia Britannica on Eastern Orthodoxy: “The lower orders of the clergy—i.e., priests and deacons—are generally married men. The present canonical legislation allows the ordination of married men to the diaconate and the priesthood, provided that they were married only once and that their wives are neither widows nor divorcees. These stipulations reflect the general principle of absolute monogamy, which the Eastern Church considered as a Christian norm to which candidates for the priesthood are to comply strictly. Deacons and priests cannot marry after their ordination.” “Bishops, however, are selected from among the unmarried clergy or widowed priests. The rule defining the requirement for an unmarried episcopate was issued at a time (6th century) when monks represented the elite of the clergy. The contemporary decrease in the number of monks in the Orthodox Church has created a serious problem in some territorial churches, in that new candidates for the episcopacy are difficult to find.” A similar discipline would apply in all Byzantine or other Eastern rite churches in communion with Rome..","date":"2013-03-10","mins":"5:56 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","title":"Picture of Veneration in a Ukrainian Parish"},{"id":"comment-200868","author":"daveb_of_wellington_nz","post":"The proposed visit of Pope Francis to the Waldensian Temple is interesting, and only time will tell if it yields a fruitful outcome. Judging from some of the sad comments on the linked web site, a strong bitter anti papal feeling and resentment is still evident among the Waldensian community, while yet another comment is curious that the Pope is visiting heretics. Evidently a spirit of ecumenism has yet to spread its roots in that corner of the world. The original Waldensian movement is one of the earliest reform groups, and dates from the preaching of Valdes in Lyon 1170 76. At the Lateran Council of 1179, Valdes made a profession of orthodoxy and was confirmed in his vow of poverty by Pope Alexander III. However Valdes did not receive the recognition he sought, was condemned by the archbishop of Lyon, and in 1184 Pope Lucius III placed the Waldensians under a ban. Thereafter the Waldensians departed from orthodoxy, and the movement spread rapidly throughout Europe. Rome responded vigorously turning from excommunication to active persecution and execution. A number returned to orthodoxy, and by the end of the 15th century the movement was confined to the French and Italian valleys of the Cottian Alps. A second period in their history began in 1526 when they were introduced to Reformation theology, and thereafter eventually becoming in effect a Swiss Protestant Church, with some emphasis on predestination and millenialism. Years of persecution continued until they were granted full civil rights in 1848. In the 19th century, a number of Waldensian emigrants migrated to Uruguay, and thence established a number of small communities in the United States. The interest of Pope Francis in the Italian Waldensians seems to be connected to his own parents’ origins in the Po Valley, where he still has family, and which seems to remain a stronghold of the movement. It seems typical of Francis that he reaches out to those most disconnected from the main stream, and always in a spirit of reconciliation. He will be reinforced in the knowledge that the prayers of many will accompany him, in the hope of a fruitful and conciliatory outcome..","date":"2015-06-02","mins":"5:39 am","url":"https://shroudstory.com/2015/06/02/pope-francis-june-21-22-schedule-details/","cat":"2015","title":"Pope Francis’ June 21 & 22 Schedule Details"},{"id":"comment-126255","author":"daveb_of_wellington_nz","post":"One cannot prejudge content, but the titles of a few papers on the more contentious, even “way out”, topics send shivers down my spine. I can only hope that permitted discussion will be sufficiently robust, and the authors appropriately challenged!.","date":"2014-06-02","mins":"6:28 am","url":"https://shroudstory.com/2014/06/01/program-and-presenters-for-the-st-louis-shroud-of-turin-conference/","cat":"event","title":"Program and Presenters for the St. Louis Shroud of Turin Conference"},{"id":"comment-194880","author":"daveb_of_wellington_nz","post":"HF: “on balance, I don’t think the Shroud image was made by a dead body at all” I challenge Hugh to name any single known man made.image, not a photograph of a known corpse, which has attracted anything like the same forensic interest as has the Shroud image. Vignon, De Lage, Barbet, Willis, Bucklin, Zugibe, all experienced forensic pathologists were all persuaded that they were examining the image of a corpse, and wrote copiously on the matter, without even a hint that it might not be such. All to the extent that other scientific.workers followed it up with their own various tests. No single painting, brass rubbing, nor other image has ever persuaded such as these to examine the forensics of their subject matter in any detail at all. It is also clear that Charles has made a false induction by claiming that presence of calcium necessarily implies calcium carbonate, hence his gesso hypothesis. There were also traces of strontium and iron present, consistent with the limestone in the neighbourhood of Jerusalem, and a better induction is therefore that the presence of calcium is more likely due to a flax retting process in that neighbourhood. Few artists ever began their work without creating an initial outline of their subject, and they also leave brush strokes. There is no evidence of either in the Shroud image. If the image was created by a man made process at all, then Colin Berry’s sweat imprint would be a more persuasive scenario. Charles may consult his various anonymous experts if he likes, but it is unlikely that any of them have the faintest knowledge of any of the technical and scientific attributes of the Shroud. So it can only be ignorance compounded!.","date":"2015-03-30","mins":"2:44 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194949","author":"daveb_of_wellington_nz","post":"HF: “They begin their investigations by assuming that the image is of a dead body, and working from there.” Barbet was specific in asserting that he had come across no artistic work, in whatever garish gory depictions, that satisfied the forensic details he observed on the Shroud. And I note that you were unable to respond to my challenge of naming any single art work which has attracted anything like the same level of forensic interest. Your comments on calcium: I note that Thibault above has commented that other old linens show the similar concentrations as Adler asserted, and the reasonable induction is that it is due to the retting process indicating likely ancient manufacture. Surface contamination of calcium might conceivably have come from Italian marble or limestone. But a more likely proposition I think is that it originated from aragonite limestone in Jerusalem, possibly from contact with a limestone tomb. I am unaware that northern Italian limestone has the same distinctive character as aragonite..","date":"2015-03-31","mins":"5:18 am","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194982","author":"daveb_of_wellington_nz","post":"That was not the conclusion of the several experienced forensic pathologists I specifically named. Are you able to specifically identify any of the medieval participants including the medieval crucifixion victim whose injuries happen to match those of the gospel accounts? Oh, yes. Colin Berry at one time suggested it might be Jacques Molay!!??.","date":"2015-03-31","mins":"2:01 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-195013","author":"daveb_of_wellington_nz","post":"Thank you Hugh, for the map refs. I have some little acquaintance with geol maps from my Engineering Geology days. The convention is that the surface geology only is shown, and must be superposed on a contour map, to obtain the dips and strikes, and hence the geologist determines the sequence of the strata. The legends provided with these maps fortuitously show the stratigraphy. There are several strata with interspersed limestone, dolomite and chalk, and of course layers of alluvia, and also some flint. The limestone is extensive on the surface geology, but is not specifically labelled as aragonite. From a comment by Nitoswki it would seem that only a limited area can be identified as aragonite, while much of it would seem to be calcite. The area immediately north of Jerusalem is labelled ‘Kub’, coloured yellow, is the Bi’na formation in the Turonian strata, and comprises limestone interspersed with dolomite. Kub pops up all over the place, roughly in a N S strip. Underlying Kub is the Kuw,(coloured green) the Weradin formation in the Cenomanian strata, generally dolomite, and generally lies to the west. Overlying Kub is the Kum, the Menuha formation in the Senonian strata, mainly chalk, and generally lies to the east. It would seem then that the strata generally dip to the west, with the more recent deposits being in the east at this location. . The Shroud samples from soles of the feet, nose and knee analysed by Kohlbeck, were identified as aragonite. He obtained several Jerusalem field samples from Nitowski from about nine different sites. Now it seems that aragonite is indeed widely present and quite common in Jerusalem. However: “Dr. Nitowsky (Sr. Damian of the Cross) sampled in Israel, nine sites which included: 1. Emmaus; 2. Jericho, at Herod’s palace; 3. Qumran ; 4. Beth Shan ; 5 Sepphoris; 6 and 7 Beth She’arim; 8 Jerusalem; 9. Mt Carmel”. The Jerusalem samples are further identified as in the École Biblique tomb complex and more particularly from the bench of the tomb.” She spoke of Limestone (calcium) and not properly of Aragonite. The nine different test sites in Israel were also analysed. The limestone throughout the nine sites changes and she claims that it does not match either Jerusalem or the Shroud of Turin. Only the sample taken from the Jerusalem tomb matched the limestone on the Shroud.” Also Excerpt from a letter to Father Otterbein by Dr. Nitowski “Limestone (calcium) samples were collected from as far south as 30 miles from Jerusalem to as far north as the Galilee and Mt. Carmel. As previously reported, Kohlbeck and Damian had matched a heavy calcium concentration from the foot area on the Shroud of Turin to samples collected in Jerusalem. This evidence was called into question, so sampling around Israel was performed to ascertain if such a test was valid. From as close as 30 miles from Jerusalem, the limestone changes and does not match either Jerusalem or the Shroud of Turin. Therefore, the match between Jerusalem and the shroud is a valid one. ” Essentially then, although it is stated that aragonite is fairly common in Jerusalem, only one of the nine sites submitted by Nitowski matched the Shroud sample, that is from the Jerusalem tomb complex mentioned. Nor is it enough to assert that aragonite is present in the Turonian strata of the Troyes caves or anywhere else. Included with the Shroud and Jerusalem aragonite were the traces of strontium and iron, but no lead. It seems that Sr can replace Ca in aragonite. But the percentages should be able to act as location indicators. More work would need to be done to quantify this aspect..","date":"2015-03-31","mins":"8:42 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-194985","author":"daveb_of_wellington_nz","post":"The incidental challenges to particular claims made by Barbet, does not change the fact that all of the forensic pathologists I named, including Zugibe, were unanimous that the TSM is an image of a real crucifixion victim, whose injuries just happen to match the gospel accounts, whereas artistic portrayals of the same lack accurate forensic detail. But that is a fascinating comment re the Troyes Speleological Society!.","date":"2015-03-31","mins":"2:13 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-195014","author":"daveb_of_wellington_nz","post":"Typo error in para 3 of mine above: ‘It would seem then that the strata generally dip to the EAST, with the more recent deposits being in the east at this location.”.","date":"2015-03-31","mins":"8:50 pm","url":"https://shroudstory.com/2015/03/27/ray-schneiders-five-part-eight-hour-course-on-the-shroud-of-turin/","cat":"presentation","title":"Ray Schneider’s Five Part Eight Hour Course on the Shroud of Turin"},{"id":"comment-33720","author":"daveb_of_wellington_nz","post":"Even old fogies should rejoice in the presence of youthful enthusiasm, even it is ooffee fueled. Can you no longer remember? Incdentally, looks like the page has now been taken down..","date":"2013-05-15","mins":"4:15 pm","url":"https://shroudstory.com/2013/05/15/review-of-the-holy-shroud-exhibition-in-seville/","cat":"event","title":"Review of the Holy Shroud Exhibition in Seville"},{"id":"comment-37343","author":"daveb_of_wellington_nz","post":"CSB: “The 1988 dating is statistically open to dispute certainly (through no fault of the scientists) – but the idea that it is scientifically “meaningless” is just wishful thinking on some people’s part.” The only scientific significance that the 1988 dating has is that the sample showed a date AD 1260 1390, and that the sample therefore is unlikely to be younger than that. To then make an induction as the blurb for the Gilroy Library blurb does, [“These results provided evidence that the Shroud of Turin was not the reported cloth that Jesus Christ was wrapped in after the crucifixion.”] is to ignore the controveries concerning the sampling, the evidence that the sample was not in fact truly representative of the cloth, and to go beyond the limits of valid scientific method. Rogers himself is known to have initially accepted the results and was sceptical of the allegations made by Marino and Benford. True scientist that he was when he looked into the matter, he had to change his mind. To then claim that publication in his journal is tainted merely because he helped to found the journal, is to close the eyes to the evidence he presents. It is a minor matter compared to the gross failure of representative sampling. Pam Moon has recently published three papers which can be found on the shroud enigma web site. Perhaps the most significant of these is: “Coloured Dissolved Organic Matter (CDOM) contamination, mould damage, biocides and the carbon 14 dating of the Shroud of Turin.” After reading this paper, anyone has to be sceptical that C 14 can reliably date any textile whatsoever, unless it has been permanently hermetically sealed for most of its history. I have yet to be made aware of any ancient textile dated by C 14 which has also been corroborated by means independent of C 14 (e.g. Proven provenance)..","date":"2013-06-18","mins":"7:31 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-178232","author":"daveb_of_wellington_nz","post":"It would seem that the concept of ultra montane lies beyond the horizon range of an Italian world view on matters pertaining to THEIR Shroud!.","date":"2014-12-21","mins":"1:41 pm","url":"https://shroudstory.com/2014/12/21/shroud-exposition-youtube-channel/","cat":"2015","title":"Shroud Exposition YouTube Channel"},{"id":"comment-37358","author":"daveb_of_wellington_nz","post":"It’s an interesting dilemma for a scientist with Rogers’ integrity, given his very close association with Shroud research over the years, and also what must have been his awareness of all the personal agenda driven motives of everyone involved in the entire project. By whatever means he came by the material, he becomes aware that the sample is not representative of the whole cloth and there are grounds for the samples having come from a patch. However Flury Lemburg has claimed (still claims) that there are no such signs, and she is a voice that matters. He knows that the custodians are unlikely to agree to revisiting the experiment, and that if he does nothing, the C 14 labs and anti authenticists will be trumpeting their false triumph and that will be the scientific conclusion of the matter. In the meantime, he is sitting on this special information, and he knows he hasn’t much time left to him. He could follow the appropriate professional steps and salve his conscience that way, but he knows that it will be ineffective. I think he took the only proper course that a person with true integrity in his circumstances could do, and that was to get his findings published in the only way immediately available to him, and by that means ensure that posterity knew of it, and they could then make of it whatever they might..","date":"2013-06-19","mins":"3:47 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37350","author":"daveb_of_wellington_nz","post":"Jesterof, I think there are additional implications. Read Pam Moon’s paper I quoted above, and you’ll see the reasons there why C 14 would seem to be an unreliable method to date any ancient textile, regardless of proper sampling protocols..","date":"2013-06-18","mins":"11:28 pm","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-37367","author":"daveb_of_wellington_nz","post":"To say that Rogers may have been used, is merely to sow a suspicion for which there are no grounds, nor any evidence. To say that his findings are “alarmist” is to under rate their importance given that they are a powerful argument that potentially, if not actually, discredits the much publicised C 14 tests that would dismiss what may well be the most important relic in Christendom. As to why anyone would go to the trouble in the 16th century to make such a patch, you may ask Mr Michael Ehrlich of ‘Without A Trace, Inc’ of Chicago, as to why his firm has been carrying out such work for at least 20 years (as at 2005), refer the Benford & Marino paper of 2005; Or you may consult his web site (www.withoutatrace.com). It was certainly within the resources of the House of Savoy who then owned the relic. Mr Ehrlich apparently claims that such work was commonly carried out on highly valued or precious textiles such as tapestries during the 16th century. It is not known how much foreign material it takes to skew the carbon dating of a textile, except by some theoretical model. In addition to reweave material, there is also the question of contamination, fungal, biocides, etc. What is required to settle the matter is a comparison of ancient textiles dated by both C 14 and by some other independent means, such as known proven provenance. I am unaware that there are presently any such examples!.","date":"2013-06-19","mins":"6:37 am","url":"https://shroudstory.com/2013/06/18/shroud-of-turin-talk-in-gilroy-california/","cat":"event","title":"Shroud of Turin Talk in Gilroy, California"},{"id":"comment-161907","author":"daveb_of_wellington_nz","post":"Professor Fanti gave Louis the courtesy of a professional interview despite what must be his personal priorities as a busy departmental head of a University School of Engineering. He extended the courtesy of allowing the interview to be published in the public forum of the reputable academia web site. Louis was courteous enough to bring it to the attention of correspondents on this blog site. Louis has correctly pointed out that Professor Giulio Fanti and Dr. Paolo di Lazzaro are the only scientists in the realm of Shroud studies who are currently dedicating their professional resources to working on the Shroud. Prof Fanti has graciously shared some of the details of that work and given some of his personal perspectives on the matter. Notwithstanding, some of his work has prompted critical comment, some consider the directions of such work ill judged. He also seems to be a somewhat flamboyant character, if that can be a criticism at all. He would not be the first investigator subject to such criticism, but nevertheless persisting despite it all. Of such are the cutting edge of new discoveries made! I suggest that Professor Fanti is no less well informed concerning the properties of the Shroud than any retired chemist working away in his spare time in the family kitchen pursuing his latest novel hypothesis, nor that of any science teacher at a secondary boys high school, who can apparently spare the time away from his charges to indulge in his favourite hobby. The perspectives are merely different!.","date":"2014-10-13","mins":"4:51 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-162091","author":"daveb_of_wellington_nz","post":"I thank Andrea for the correction concerning the position of Professor Fanti. According to web site information he is Associate Professor of Mechanical and Thermal Measurements in the Department of Industrial Engineering at the University of Padova (Padua). His teaching courses are given as ‘Mechanical and Thermal Measurements’ and ‘Industrial Instrumentation’. There may be more recent information..","date":"2014-10-13","mins":"4:45 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-162431","author":"daveb_of_wellington_nz","post":"Hugh, Louis: How long did Jesus take for the resurrection? Check 1 Peter 3:19. “18 For Christ also suffered* for sins once, the righteous for the sake of the unrighteous, that he might lead you to God. Put to death in the flesh, he was brought to life in the spirit.g 19 In it he also went to preach to the spirits in prison,* 20 who had once been disobedient while God patiently waited in the days of Noah during the building of the ark, in which a few persons, eight in all, were saved through water.” USCCB Note on v 18: ” [3:19] The spirits in prison: it is not clear just who these spirits are. They may be the spirits of the sinners who died in the flood, or angelic powers, hostile to God, who have been overcome by Christ (cf. 1 Pt 3:22; Gn 6:4; Enoch 6–36, especially 21:6; 2 Enoch 7:1–5). Check Apostle’s Creed: “He descended into [Hades]”. 1 Peter is generally accepted as authoritative. “The work is pseudonymous, attributed to Peter through Silvanus, whose name constitutes a part of the pseudepigraphic device that strengthens the authority of the epistle.” The work thus reflects an early teaching that after his death, Christ descended to the abode of the dead, and “released them from their prison there”. His first subsequent reappearance on earth is to Mary Magdalen early on the morning after the sabbath..","date":"2014-10-14","mins":"8:44 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-168155","author":"daveb_of_wellington_nz","post":"This is a very contentious topic, and I shall look forward to reading the paper in due course. I hope it becomes available on Barrie’s shroud.com web site. At present I’m unaware of Emanuela’s conclusions in her paper. It seems she is addressing the question of whether the Mandylion was or was not the Shroud. I note her use of the term ‘mediated’ as the source of the various iconic depictions, to bloodstains seen on the cloth, and to the opposing schools of thought. I see that she actually attended the St Louis conference, and so she would be aware of other related papers, including those that do not equate the Shroud with the Mandylion. Time will tell, but I guess we can all expect a fairly bumpy ride over the next few months as the various papers come to light!.","date":"2014-11-03","mins":"5:37 am","url":"https://shroudstory.com/2014/11/03/another-st-louis-conference-paper-available/","cat":"st_louis_2014","title":"Another St. Louis Conference Paper Available"},{"id":"comment-128589","author":"daveb_of_wellington_nz","post":"The Classic Greek writers clearly use sindon for a general all purpose word to mean cloth, often linen. However the fact that the Synoptic gospel authors used it to describe Christ’s burial cloths, both at the time of burial and of resurrection suffice to explain how it specifically came to mean burial cloth in Christian history. But how, when, and by what process that came about is the challenge for a historian – linguist. In the first few centuries of the Christian era, it seems quite tenable to assert that it might well mean some other cloth artifact. Edessa had become a major centre of early Syriac Christian scholarship well before 250 AD, and the Greek synoptics would have been well known to Edessan scholars by then. Bishop Avercius Marcellus, credited with the baptism of Abgar VIII’s household and court, wrote his notable memorial epitaph in Greek..","date":"2014-06-11","mins":"5:18 pm","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128618","author":"daveb_of_wellington_nz","post":"In Revelations ch 19, v v 11 14, a white horse appears, its rider is called Faithful and True, a judge with integrity, a warrior for justice, eyes are flames of fire, head crowned with many coronets; Note that his cloak is soaked with blood, even though it’s before the battle! He is known by the name the Word of God (c.f. John ch 1). Behind him, dressed in linen of dazzling white, rode the armies of heaven on white horses. Etc. Now turn to Greek New Testament: The word used for the rider’s cloak is “imation” = himation (not sindon), Jerome translates it “vestem aspersam sanguine”; The word used for the linen of the celestial armies is “byssininon” (Max’s byssus) (Jerome = “albis vestiti byssinum”). It is interesting that “sindon” is not used in any of this context. Nor does John used sindon, but “othonia”, in describing the burial cloths..","date":"2014-06-11","mins":"7:05 pm","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128865","author":"daveb_of_wellington_nz","post":"Scavone’s intended paper for St Louis is only presently available in its abstract, and it may be premature to prejudge its full content. Charles may be unaware of any significant evidence supporting the Shroud’s authenticity but that is not the view of a large body of scientists who have studied the matter in great detail. Whether or not the Shroud and the Mandylion were the one and the same object, it would seem presumptuous for every professional Byzantine scholar to assert that “There is no way that Image of Edessa can be the Shroud” when there are adequate indications that it might well be. But perhaps that is the distinction between the present state of the disciplines of the humanities and sciences. On the contrary, I know of only one particular tenuous indication of a possible early Frankish acquaintance with the Shroud image, the scourging illustration in the 8th century Carolingian Stuttgart Psalter, but that is easily explained by Byzantine Carolingian contacts at the time. Certainly no professional Gallic scholar has ever considered it worthwhile pursuing a first millenium journey of the Shroud from Jerusalem to France, a rather more tortuous journey than that to Byzantium. Very likely, the reason is that no piece of evidence supporting a possible case has ever been discovered, whereas there are ample indications of its presence in Constantinople! The Greek Orthodox epitaphioi dating from the 12th century and depicting a Shroud like Christ laid out in death are merely one such indication..","date":"2014-06-12","mins":"4:55 pm","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128764","author":"daveb_of_wellington_nz","post":"I’m aware that Charles considers the association of the Mandylion with the Shroud a “misguided journey”, he has published a book with this title, and one does not like to see one’s own child in peril. The first known account of how the cloth came to Edessa is the 4th century work the “Doctrine of Addai”, which was modified in the 6th century becoming the “Acts of Thaddeus”, both of which works Charles will be acquainted. The 6th century work refers to the cloth as tetradiplon, acheiropoietos, and sindon. Certainly the Synoptic authors’ use of the word “sindon” in respect of the burial cloths would have been known to the author of the Thaddeus document, a large burial shroud. I’m coming to the opinion that anything I might say further on the subject would leave Charles quite unmoved from his views of a “misguided journey”. However he might like to take the time to read Daniel Scavone’s comprehensive documentary study of the matter so he is at least better informed of a differing professional view of the matter with supporting evidence, fully cited and annotated, together with analyses of the relevant Greek terminology used: “Acheiropoietos Jesus Images in Constantinople: the Documentary Evidence”, 2006. He can find the paper at: http://www.sindonology.org/scavone acheiropoietos.pdf.","date":"2014-06-12","mins":"8:01 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128899","author":"daveb_of_wellington_nz","post":"Regarding brawls, I am acquainted with Hal Hellman’s series on “Great Feuds”, which include Mathematics, Technology, Science, and Medicine. It would seem that few real advances in certain knowledge were ever achieved without a brawl, and Hellman’s works are truly educational on the history of advances in human knowledge. However he seems to have avoided discussing the humanities. Perhaps the disputations there are incapable of being resolved to any kind of worthwhile conclusion. Hugh may consider that there is logic to assert that “if you think it (the Shroud) may be genuine but definitely not the Mandylion, then another route to France (and other reasons for it not appearing till 1350) would be well worth pursuing” whereas Charles has made it clear that he has no reason for believing it to be genuine. So his French proposition is merely a distraction and a chimera, and no one to date has considered it worth pursuing. No parent likes to disowns his child and Charles’ “Misguided Journey” may be at stake. However to quote the great English poet, Alexander Pope (1688 1744): “A man should never be ashamed to say he has been wrong, which is but saying in other words that he is wiser today than he was yesterday.”.","date":"2014-06-12","mins":"6:31 pm","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-128436","author":"daveb_of_wellington_nz","post":"Charles: “Perhaps we can solve here the reference that establishes ‘sindon’ as a burial cloth. It is regularly translated as such by Dan Scavone but I cannot find such use in any lexicon or Bible commentary that I have. ” No problem! E.g. Matthew 27:59, Jerusalem Bible translates as: “So Joseph took the body and wrapped it in a clean Shroud and put it in his own new tomb … ; Likewise Mark 15:45 (he buys the shroud); Likewise Luke 23:52. Other translations may use a different word from Shroud, (e.g. Burial cloth) but clearly this is meant here. Check Greek New Testament web site, four versions given; Matt 27:59 can be found at: http://www.greeknewtestament.com/B40 C027.htm#V59 “kai labwn to swma o iwshf enetulixen auto sindoni kaqara” (You can transliterate this, I don’t know how yet.) The key word is ‘sindoni’; Jerome’s Latin Vulgate also translates it as “sindone”. I’ll leave you to navigate through the Gk NT to the Mark & Luke texts but they use the same word root. John of course uses the term ‘othonia’. Similarly the Synoptic Resurrection stories also use ‘sindonia’, but ‘soudarion’ referring to the head cloth. Whether ‘sindone’ was a common word Greek used specifically for ‘burial cloth’ is course debatable as you have indicated. However there can be little doubt that merely because of the use of this word in the original gospel narratives, this is what the burial cloths came to be called in the course of Christian history. This would not preclude the word being used for other types of linen cloths..","date":"2014-06-11","mins":"6:18 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-132487","author":"daveb_of_wellington_nz","post":"The paper’s abstract text of Gal 3:1 appears to be the USCCB version, which I suspect is fairly true to the Greek original. Jerome’s Latin Vulgate seems to use a fairly similar translation: “o insensati Galatae quis vos fascinavit ante quorum oculos Iesus Christus proscriptus est crucifixus” Note the word oculos, translated direct from the Greek original ophthalmos. The Jerusalem Bible English translation is not so direct, as its editors evidently believed they were closer to Paul’s meaning with the slightly more circumspect: “Are you people in Galatia mad? Has someone put a spell on you, in spite of the plain explanation you have had of the crucifixion of Jesus Christ?” This JB translation has no sense of the possible use of a visual aid! And “before your eyes” becomes “plain explanation”. The suggestion of Anatolian pollen on the TS has been known since before 1978, with Max Frei’s first set of samples. If one accepts that the TS arrived in Constantinople at sometime, probably 10th century, then any overland route from the Middle East, whether Jerusalem, Antioch or Edessa has to pass through Anatolia, and this journey might suffice as an adequate explanation for the pollen. For that matter, Constantinople is not so distant that pollen drift might be sufficient to account for the Anatolian dust. Correspondents will recall the recent discussion on II Timothy 4:13 14 where Paul urges Timothy to recover the cloak left with Carpus at Troas. This also provided grist for those who believed that Paul was toting the TS around as a visual aid for his mission. An unusual Greek word was used which early translators interpreted as “cloak” whereas it might equally be interpreted as a type of carry bag for the parchments that Timothy was to bring. There are some problems seeing Paul being permitted to use the burial cloths in this fashion. The Jerusalem disciples had good reason for caution towards Paul, and it would have taken considerable time for them to trust him completely, even if they ever did attain this level of relationship. Paul seems to have been at least partly hellenised, whereas the disciples seemed to retain much of their Jewish identity, perhaps not entirely convinced of the worth of Paul’s mission to gentile peoples. This tension is reflected from time to time in various Pauline passages. Custody of the burial cloths would most likely seem to rest with Peter, and the obvious question has to be “Would Peter have sufficient confidence in Paul to entrust the cloths to him, particularly given the known hazardous nature of Paul’s journeys?” Markwardt has suggested that at a much later date in the second century, Bishop Avercius Marcellus of Hieropolis was entrusted with the cloths from Antioch for the purpose of converting the household of Abgar VIII the Great of Edessa, before returning them to Antioch. But the early church had reached a different stage of its development by then. The reading of the Acts and the Pauline letters convey the strong message that it was the quality of Paul’s preaching that won converts, and there are no hints there that the TS had any kind of role in this preaching. It is a mistake I think to take one or two singular verses to prop up such a speculation, pollen notwithstanding..","date":"2014-06-23","mins":"6:19 am","url":"https://shroudstory.com/2014/06/23/anticipating-the-conference-frederick-baltz-proposes-a-new-reference-to-the-shroud-of-turin-in-galatians/","cat":"st_louis_2014","title":"Anticipating the Conference:  Frederick Baltz proposes a new reference to the Shroud of Turin in Galatians"},{"id":"comment-128439","author":"daveb_of_wellington_nz","post":"US Conference of Catholic Bishops (USCCB) translation for Matt 27:59 has: “Taking the body, Joseph wrapped it [in] clean linen” So it’s linen and it’s being used as a burial shroud!.","date":"2014-06-11","mins":"6:29 am","url":"https://shroudstory.com/2014/06/11/anticipating-the-conference-dan-scavone-on-evidence-of-the-shroud-in-edessa/","cat":"st_louis_2014","title":"Anticipating the Conference:  Dan Scavone on Evidence of the Shroud in Edessa"},{"id":"comment-132776","author":"daveb_of_wellington_nz","post":"Yes, I’m aware of it and a few others. Lost 2nd century gospel to the Hebrews has Jesus giving it to the servant of the priest. Problem with St Nino is that she’s late, 4th century; a lot of legendary material can accumulate in 350 years. Markwardt continues the Luke custody story with “… and hidden until it was found by Peter”, citing Scavone’s work. Markwardt points out that several other known Passion relics were dispatched to Antioch, Peter was the one to discover the cloths, he was the first bishop of Antioch, he was the leader of the apostles, and consequently Markwardt has the shroud stored safely in Antioch. Apart from one or two stray verses, the hazardous nature of Paul’s journeys, riots and shipwreck, I don’t see him toting the shroud as a visual aid. Any hints you can find are just not strong enough..","date":"2014-06-25","mins":"4:56 am","url":"https://shroudstory.com/2014/06/23/anticipating-the-conference-frederick-baltz-proposes-a-new-reference-to-the-shroud-of-turin-in-galatians/","cat":"st_louis_2014","title":"Anticipating the Conference:  Frederick Baltz proposes a new reference to the Shroud of Turin in Galatians"},{"id":"comment-128195","author":"daveb_of_wellington_nz","post":"Yannick Clement warned us of this sort of thing years ago. I doubt if there’s a single Shroud scientist outside of Italy who buys into this religious agenda driven pseudo science. They’ve clearly been carried away watching too many old episodes of Star Trek. So a real genuine William Shatner (Captain Kirk) quote is apposite (check thinkexist web site): “Stop and smell the garlic! That’s all you have to do.” Yup! straight from the commander’s lips!.","date":"2014-06-10","mins":"7:58 am","url":"https://shroudstory.com/2014/06/10/anticipating-the-conference-mark-antonacci-on-testing-for-radiation/","cat":"st_louis_2014","title":"Anticipating the Conference:  Mark Antonacci on Testing for Radiation"},{"id":"comment-127006","author":"daveb_of_wellington_nz","post":"I have just re read through Ray Rogers’ 2004 paper, “Frequently Asked Questions”. It has more technical information than any non chemist such as myself can possibly use. However several major points emerge. There is absolutely no trace of paint or dye or ink that can have formed the image; the cellulose of the linen was not involved in forming the image; the image is only present on the top most crowns of the fibres; any form of radiation could not have formed the image as it would have inevitably affected the fibres; the coloration can be removed by the use of the solvent dimide which leaves the fibres underneath completely intact and unaffected; Rogers firmly believed that the coloration lay in the sugar/starch coating of the fibres, and not the fibres themselves. Joseph Accetta is asserting that all properties of the image can be explained by printing techniques available in the 14th century. Unfortunately there are no clues in the Conference abstract of his paper as to what those printing techniques might be. This must be a most mysterious printing process indeed, as according to Rogers it must exclude all dyes, paints and inks, or for that matter any organic compound containing any non organic element, and it cannot involve any kind of radiation, and it must be confined to the surface coating of the fibres and not implicate the fibres themselves. No doubt the conferees will be most curious to discover what this most mysterious printing process might be. Of course Dr Rogers could be incorrect in a few of his assertions, but so far they all remain undisproved. Of course if one ignores facts, one might assert just about anything at all, even a hitherto unknown mysterious printing process..","date":"2014-06-05","mins":"7:15 am","url":"https://shroudstory.com/2014/06/04/anticipating-the-conference-joseph-accetta-on-14th-century-origins/","cat":"st_louis_2014","title":"Anticipating the Conference: Joseph Accetta on 14th Century Origins"},{"id":"comment-129196","author":"daveb_of_wellington_nz","post":"I think it’s fair and human to search, find, probe and speculate. But too seldom can any conclusions be definitive. Nevertheless it teases the brain, and is therefore attractive..","date":"2014-06-13","mins":"4:20 pm","url":"https://shroudstory.com/2014/06/13/anticipating-the-conference-ken-stevenson-on-biblical-hermeneutics-in-shroud-study/","cat":"st_louis_2014","title":"Anticipating the Conference: Ken Stevenson on Biblical Hermeneutics in Shroud Study"},{"id":"comment-162176","author":"daveb_of_wellington_nz","post":"Re ‘Conference is Over’ posting: I had been in contact with Jack Markwardt last August. Discussion on this site at the time had dwelt on his earlier papers concerning Antioch and the Shroud, and I thought he might be interested in following the thread. He had graciously mentioned to me the intent of his St Louis paper, which I gather was quite ground breaking in terms of his new hypothesis. He intended it as an alternative to Wilson’s Mandylion theory. He had apparently become dissatisfied with the Mandylion theory following publication of Mark Guscin’s “Image of Edessa” book in 2009, and again in 2010 when Wilson published his book that year. There seemed to be a number of aspects which he felt could not be satisfactorily explained or resolved. He felt that he had arrived at a satisfactory alternative scenario. I shall look forward to reading it in due course when the conference papers emerge on site. No doubt we shall see some interesting discussions involving the usual contending participants..","date":"2014-10-13","mins":"10:10 pm","url":"https://shroudstory.com/2014/10/11/chart-of-conference-well-so-far-anyways/","cat":"st_louis_2014","title":"Chart of Conference. Well, So Far, Anyways"},{"id":"comment-177725","author":"daveb_of_wellington_nz","post":"HF: “Pam’s excellent paper has elegantly demonstrated how little contamination there is, and therefore how unlikely it is that any reweaving has had any effect on the C14 dating.” That is not a fair assessment of Pam Moon’s paper at all, but is consistent with the correspondent’s persistent attachment to a type of scientism, which conveniently ignores and fails to take into account findings that validly challenge the reliability of the 1988 C14 fiasco..","date":"2014-12-19","mins":"4:49 am","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","title":"New Paper by Pam Moon"},{"id":"comment-177823","author":"daveb_of_wellington_nz","post":"” I think I could persuade your judge … ” You would have a tough task doing so if I was opposing counsel. The verdict would be “Not proven!”.","date":"2014-12-19","mins":"2:53 pm","url":"https://shroudstory.com/2014/12/18/new-paper-by-pam-moon/","cat":"st_louis_2014","title":"New Paper by Pam Moon"},{"id":"comment-161418","author":"daveb_of_wellington_nz","post":"We all know Hugh’s viewpoint on the 1988 C 14 dating. He seems to have come to the conclusion that the waiving of the 1985 agreed protocols is acceptable, that results from a single sample whose representative provenance has been seriously questioned is acceptable, that failing a chi square test and the presence of a gradient is acceptable, that Rogers’ examination of the thread and his discovery of dyes and other extraneous matter can be set aside, that there is no such thing as invisible reweaving despite the evidence of the Benford Marino investigations, that the presence of vanillin in the samples counts for nothing, that there is no need for representative sampling, that the differences discovered by Gilbert Raes in 1975 do not demonstrate heterogeneity, etc, etc. His much vaunted scientific rigour he claims is essential to demonstrate the object’s authenticity is to say the least highly selective when it comes to evaluating the contrary viewpoint!.","date":"2014-10-11","mins":"5:18 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-161499","author":"daveb_of_wellington_nz","post":"There is much there I could comment on. It’s all something of a circular argument. The waiving of the protocols determined that there could be no validation of whether any sampling was representative or not. So there is no reason for saying that the single sample was not representative!!?? Likewise there is no reason for saying that it was! So the waiving of the protocols is only a pity!!?? As the laboratories all did their testing from this single sample, it might have been expected that more or less uniform results were obtained, but this didn’t happen. The Gilbert Raes results (Shroud Spectrum #39/40): No. Of threads / cm: Warp (piece 1 only) 15.6; Weft (both pieces) 25.7; Size of thread in tex (gm / km): Piece 1 – warp 16.3, weft 53.6; Piece 2 – warp 18, weft 73.1; Piece 1 – cotton traces; Piece 2 – no cotton. Despite the number of weft threads / cm being identical in both pieces, there is a major difference in the size (mass) of the threads. Likewise there is a small difference in the size of the warp threads. Therefore it cannot be argued that the Raes samples demonstrated homogeneity!.","date":"2014-10-11","mins":"11:34 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-161799","author":"daveb_of_wellington_nz","post":"HF, Oct 12, 4:17 am: “It did not apparently constitute any evidence to him (Raes) that he was not dealing with a representative piece of the Shroud, and he is widely touted as one of the world’s great experts on textiles.” In 1973, Raes, together with a few others, replaced former members of Cardinal Pellegrino’s Commission 1969 76. This was prior to the 1978 STURP project, and clearly well before the 1988 C 14 sampling was projected. So the question of whether or not the samples were representative was not so much of an issue. It was clearly a pilot investigation, not intended as a dating exercise. It so happened that the the C 14 samples were eventually taken from the same area. Raes was rather more fortunate with his samples, than were the others who among them received only individual threads, perhaps 16 or so, the longest being only 28 mm. In addition to his two threads Raes was given two pieces, Piece 1 (main corner) 40mm x 13mm; Piece 2 (side strip) 40mm x 10mm. So he was fortunate indeed, and would hardly quarrel that they were not representative. In commenting on Raes’ report, Ian Wilson notes: “But, as Raes observed, the size of the threads in Piece 2 certainly seems to be different from that of those in Piece 1. He qualified this by saying that due to the very short length of the threads examined it would be impossible to be sure that they are from fabrics of different manufacture. But the inference is undoubtedly there. And it is strengthened by the fact that Raes was unable to find in Piece 2 any of the cotton traces of the main body of the cloth.” Wilson had his own agenda in distinguishing the sources of the two pieces. But setting that aside, It seems that it was sufficient for Raes to comment on. An alternative hypothesis to the two pieces being of different manufacture, is that one of the areas may have had repair work done to it. It cannot be asserted that the Raes samples demonstrate homogeneity!.","date":"2014-10-12","mins":"7:44 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-162938","author":"daveb_of_wellington_nz","post":"Hugh item 3), ‘blood chain an oddity’??: Previously much discussed here, but not an oddity. A little homework resolves it. Barbet, ch 8, re ‘Journey to the tomb’, section D; Probably five bearers, two carrying patibulum (~176 lbs), two supporting trunk using sheet twisted as band under lower thorax, fifth at feet, body in rigor mortis. Barbet’s description of blood flow on back is consistent with this scenario. Authenticist point of view does make sense, it’s only a problem for non authenticists!.","date":"2014-10-16","mins":"5:19 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162941","author":"daveb_of_wellington_nz","post":"Clearly a vast amount of material was covered in the four days of the conference. Thibault’s list is indicative. It would seem that with only half an hour for many of the papers, the effort was mainly on summary presentation, rather than on any deep consideration or opportunity for much debate or full discussion. That will no doubt come, when all papers become available or are completed. In particular I shall be keen to compare the two papers by Scavone and Markwardt, to see how they might be resolved. Both have been major contributors in the past to a closer understanding of how a credible history of the Shroud might be constructed, despite the difficulties, the lack of a clear trail, and much controversy..","date":"2014-10-16","mins":"5:33 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-128584","author":"daveb_of_wellington_nz","post":"Greasy Fish & Chips may have been popular in Britain in the 19th century but were actually perfected in Australia and New Zealand by Croatian and Greek chefs. The oil must be deep, hot (not smoky) and vegetable (not animal). There are still a few Greek & Croatian takeaways in Wellington, but most have now been taken over by Chinese chefs. My wife and I have excellently cooked crumbed cod, chips, with seafood oyster sauce once a week, an ideal combination. An annual competition is held for the best served Fish and Chips among restaurateurs of the genre throughout New Zealand..","date":"2014-06-11","mins":"4:46 pm","url":"https://shroudstory.com/2014/06/11/will-the-english-show-up-in-st-louis/","cat":"st_louis_2014","title":"Will the English Show Up in St. Louis?"},{"id":"comment-129714","author":"daveb_of_wellington_nz","post":"I have forbears from Britain (arrived ~1850), from Ireland via Australia, from Jersey,also from Alsace Lorraine, from Hesse Nassau, and one British settler took a Ngapuhi lady to wife. But we still know how to enjoy Fish & Chips! Future NZ will see a lot more of Asian descent. My grand son is fluent in Mandarin, his mother’s tongue. I have nephews who are Ngati Porou. It’s a changing world!.","date":"2014-06-15","mins":"4:26 am","url":"https://shroudstory.com/2014/06/11/will-the-english-show-up-in-st-louis/","cat":"st_louis_2014","title":"Will the English Show Up in St. Louis?"},{"id":"comment-26467","author":"daveb_of_wellington_nz","post":"The assertion that only three Sanhedrin members were present at the trial of Jesus seems to rely on an assumption that the original text was set down using the pluperfect tense. This is not the impression that any of the gospel accounts that I know create for me, but rather there is more of a sense of immediacy. It also seems to rely on the unproved assumption of an underlying “Galilean Aramaic sub stratum”. The Greek texts that we have are those received into the canon by the early church fathers. As far as I know, there is no or little evidence of much in the way of a prior text, Aramaic or otherwise, that would substantiate the assertion, but is only an inference made by a few exegetes who are certainly not unanimous in their opinions. My Greek does not extend to its case sensitive aspects, but my Latin certainly does, and Jerome’s Vulgate does not use the pluperfect, but rather the perfect and imperfect (continous) past tenses in describing the trial scene. If you’re not aware of it already, a useful web site for parallel texts, including five various Greek versions, Latin Vulgate, and assorted English translations can be found at: http://www.greeknewtestament.com/B41 C014.htm I suspect however that you may not find that any of the five Greek versions there use the pluperfect, but would be intrigued to be advised otherwise. I imagine that the Chief priests and others were plotting beforehand to see how they might pass the death sentence – the gospel acoounts certainly say as much – but I don’t see how this can be seen as any formal sentencing in absentia. A gospel account records that the Chief Priest tore his robe at an alleged blasphemy. The exclamation “What need have we of witnesses now?” gives a sense of a present trial and interrogation of witnesses, and someone clearly saw this occur to record it. Nevertheless, I do not think it necessary to go to these extreme lengths of argument to concede that John Mark may have been the trial recorder or not as the case might be. I should think that the proceedings were likely conducted in either Aramaic or Hebrew, more likely Aramaic the native language of any prisoner brought to trial, and the record would be in that language. It is equally likely that Mark wrote the gospel memoir from what Peter knew of it and various other oral accounts..","date":"2013-03-04","mins":"9:24 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-198200","author":"daveb_of_wellington_nz","post":"“Who was not invited?” Check: “Over 300 experts of the Shroud arrived today from France, England, Spain, Peru, Mexico, Brazil, Bolivia … ” As I recall, practically all of the 30 or so experts from the 1978 STURP team were from the USA. Not listed?? Hmmm! They didn’t figure in the 1988 team either! “Greater unity” did you say?.","date":"2015-05-03","mins":"6:10 am","url":"https://shroudstory.com/2015/05/03/the-experts-of-the-shroud-in-conference/","cat":"2015","title":"The Experts of the Shroud in Conference"},{"id":"comment-26489","author":"daveb_of_wellington_nz","post":"Max, I’m truly sorry I have to say this, but in my view Riyadh in Islamic Saudi Arabia is more culturally remote from European Languages, let alone Christian scriptural texts even than New Zealand. I could have no reason to suppose that any Saudi would be overawed by an Auckland or Wellington faculty established for the study of the Qu’ran or for that matter the works of Omar Khayyam. I myself have given lectures on ancient Egyptian and Babylonian and medieval Arab mathematics and my brother has taught English to several Chinese students preparing for study at Auckland University. (In fact hundreds, possibly a thousand Asian students study in assorted faculties throughout our NZ universities.) I have studied assorted ancient Mesopotamian myths as translated from the original cuneiform and Phoenician at Massey University NZ, and presented seminar papers on them. But by no means could I claim to be an expert in any of those topics. They are merely part of my portfolio of background knowledge. I do have some acquaintance with the limitations of certain knowledge attainable in academia..","date":"2013-03-05","mins":"4:13 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26548","author":"daveb_of_wellington_nz","post":"Max, Thank you for your detailed exposition of your point of view. I have enjoyed the challenge of this extended dialogue, even though we have not come to an agreed consensus. Are you able to say that nowhere in the gospel of Mark is the pluperfect ever used? In that case it would be a telling piece of evidence supporting your assertions – I may pursue this enquiry myself. I take it that the translation entropy you mention is merely an inter disciplinary borrowing of a technical term to account for the inevitable loss of meaning in all translations from one language to another. Such entropy is only too evident in all forms of communication irrespective of translation, and regularly appears even in the normal exchanges on this web site. If Mark’s gospel was only intended for Roman Gentile Christians, why then was it not written in Latin? Surely Peter in Rome would have access to a Latin literate amenuensis. The fact that it was written in Greek suggests that a more universal audience was intended. Do you know of any other Greek literature written in Rome at this time? As far as I am aware any such tendency for Roman writers to write in Greek did not occur until after Hadrian. I should think that the Peter Mark collaboration would not occur in a vacuum of dialogue. Any linguistic ambiguities arising from Peter’s Galilean background would surely have been sorted in their discussions. Such considerations persuade me to prefer the conservative viewpoint of the majority of exegetes. You may be interested to know that barbarism continues to be alive and well in southern Arabia. A news report this morning advises that seven young Saudis are to be executed by crucifying them for three days and finished off by firing squad. Their crime revealed by confessions extorted under torture, is that as juveniles they were alleged to be part of a ring of jewellery store thieves. But mainly one suspects, this terrible punishment is because they are from the despised southern states..","date":"2013-03-05","mins":"5:59 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26098","author":"daveb_of_wellington_nz","post":"I am sceptical of the Letter to Hebrews being written by Paul, notwithstanding an early tradition that he was the author. It is clearly directed at a Jewish Christian community (hellenised or not), whereas Paul’s main missionary interests were Gentiles. The particular theological emphasis in Hebrews is quite unlike anything else that Paul is known to have written. This may indicate some limitation in the method developed by the paper’s authors. Paul was fluent in Greek and needed no translator. Luke himself was more comfortable in Greek than in Hebrew..","date":"2013-03-01","mins":"4:46 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26124","author":"daveb_of_wellington_nz","post":"Extract from Encyclopeda Britannica: “In the time of Paul, Tarsus, the home of famous Stoic philosophers, was on the main trade route between East and West. Like many of the Jews there Paul inherited Roman citizenship, probably granted by the Romans as a reward for mercenary service in the previous century. This fact explains his two names. He used his Jewish name, Saul, within the Jewish community and his Roman surname, Paul, when speaking Greek. Though he had a strict Jewish upbringing, he also grew up with a good command of idiomatic Greek and the experience of a cosmopolitan city, which fitted him for his special vocation to bring the gospel to the Gentiles (non Jews). At some stage he became an enthusiastic member of the Pharisees, a Jewish sect that promoted purity and fidelity to the Law of Moses. According to Acts, he received training as a rabbi in Jerusalem under Gamaliel I. His knowledge of the Law and of rabbinic methods of interpreting it is evident in his letters.” Not only did Tarsus have a Stoic academy, Paul knows enough Greek philosophy to draw on the Cretan Liar paradox. Elsewhere Encyc Brit observes that it is likely Paul used an amanuensis in the dictation of his letters. His need for John Mark as a translator is an assumption. He may very well have been needed to carry the bags, but then fell out of Paul’s favour..","date":"2013-03-01","mins":"10:27 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26201","author":"daveb_of_wellington_nz","post":"Max, the word in Acts 13:5 for Jon Mark’s role in several Greek texts transliterates as “upereten” as near as I can figure it (1st and 3rd ‘e’ is eta, 2nd ‘e’ is epsilon). Most English translations have it as ‘assistant’ or ‘minister’ and this Greek word is included in Woodhouse’s English Greek dictionary for ‘minister’. Woodhouse does not include the word as a Greek option for “translate”. John Mark was evidently a cousin of Barnabas, and his apparent desertion in Pamphylia was the cause of a violent quarrel between Paul & Barnabas. Later it seems that John Mark & Paul were reconciled – he is mentioned in Philemon & Colossians, as well as in I Peter. If John Mark was also the author of the Marcan Gospel, then JB introduction to synoptics describes the Greek as fairly rudimentary with errors, and I would surmise that a citizen of Tarsus would likely have better Greek, than is apparently the case in Mark’s gospel..","date":"2013-03-02","mins":"8:49 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26237","author":"daveb_of_wellington_nz","post":"I thought it evident that I had consulted a number of sources on the matter. My personal preference is to refer to authoritative sources in such matters than to take refuge in unsubstantiated assertions couched in obscure circumlocuitous arcanery. Notwithstanding the recent attempt at a scientific method to identify the unknown authors of ancient scriptures, the case for the Letter to the Hebrews being written by Paul, or for that matter Luke, appears to be very weak indeed..","date":"2013-03-03","mins":"7:13 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26323","author":"daveb_of_wellington_nz","post":"A number of points: Mark places the two incidents of the young man running off naked, and the ear cutting episode juxtaposed, so that it’s if Mark who runs off naked, then clearly it’s not Mark who has his ear cut. Both Matthew & Luke also mention the ear incident, but without naming the servant. Only John names him as Malchus and there’s no good reason to think otherwise, unless naming of the servant is merely a means of lending credit to the gospel being an eyewitness account. The tradition that Mark assisted Peter in Rome may be based on the closing lines of I Peter, but who the author of I Peter is may still be argued. Nevertheless Peter was generally considered to be the guarantor of Mark’s gospel. Paul in two epistles generally accredited to him also says that Mark is assisting him. It would seem that the only really good reason for asserting that Mark was the Sanhedrin’s secretary, was that all other three gospel accounts of the trial adhere to Mark’s version fairly closely, albeit with some minor additions. But both Nicodemus & Joseph of Arimathaea could also have provided oral accounts which all four gospels could have then followed. My designation of Mark as “bag carrier” was merely to make the point that whatever his intended role in the Pamphylia mission might have been, it was short lived, amd I think you read more into it than I intended. Luke asserts that the ensuing quarrel between Paul & Barnabas (Mark’s cousin) was “violent” and clearly Paul was not at all pleased with Mark in this episode. But if Paul & Mark can be reconciled, then hopefully so can Max & Dave be allowed their different perspectives!.","date":"2013-03-03","mins":"8:10 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26289","author":"daveb_of_wellington_nz","post":"Hugh Farey’s comprehensive comment on the authorship of Letter to the Hebrews is in my opinion sound and rational. It is not known who wrote the Letter, but Paul usually identifies himself as author in his own writings, and the theological emphasis in Hebrews is quite different from Paul’s usual style. There is no shortage of potential candidates. For all anyone knows, it may have been written by Apollos [Acts 18:24 28], an Alexandrian Jew, “an eloquent man with a sound knowledge of the scriptures”, “… helped the believers considerably by the energetic way he refuted the Jews in public and demonstrated from the scriptures that Jesus was the Christ.” Letter to Hebrews does much the same, but Apollos is only one of many possible conjectures. Paul’s towering intellect and cosmopolitan background is equally at home among both Jews and Gentiles, he would seem to have little need for a translator, the multilingual capabilities of such people of those times is easily under rated, although it is evident that he often had recourse to an amanuensis when writing his epistles. I have less quarrel with Max than he imagines. We seem to be of a mind on the paper by Maryam Ebrahimpour et al; John Mark’s possible role as the High Priest’s servant, as the trial recorder, and provider of his temple garment as the burial cloth are quite credible speculations for a number of reasons, such as the possible healing of his wounded ear, if indeed it was Mark. However his assistance on the mission with Paul & Barnabas was cut short by his apparent desertion, although he later seems to have redeemed himself. I should point out to Max that I have done him the courtesy of providing at least one or more of my reference sources, which in the case of Encyc Brit was as recent as 2006, and which by my math wasn’t 50 years ago. I consider that arguments from a recognised established authoritative sourced reference are to be preferred, and I believe more persuasive, than any unsubstantiated, uncited assertions, regardless of any claims to some expertise in such matters..","date":"2013-03-03","mins":"5:05 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26360","author":"daveb_of_wellington_nz","post":"The contributions that Dr Kearse has made to this web site are outstanding, always a delight to read, with remarkable insights, clearly and scientifically expressed, generously sharing his all too rare expertise, but always with a professional prudence matched by the admirable Christian forbearance of his previous comment. They are an utter contrast to the amateur verbal ramblings of the Quebecois master of the inapt and outrageous, whose arrogant confidence in his own narrow vision is only matched by his intolerance of any other viewpoint except his own, and which can no longer claim my slightest interest..","date":"2013-03-04","mins":"3:36 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26436","author":"daveb_of_wellington_nz","post":"Ear incident: My comment was intended merely to illuminate my momentary lapse in confusing the two juxtaposed incidents. You correctly reminded me that John’s gospel identified the wounded servant as Malchus, not Mark. The error was mine. Trial witnesses: Mark 14:53 56: “They led Jesus off to the high priest; and ALL THE CHIEF PRIESTS AND THE ELDERS AND THE SCRIBES ASSEMBLED THERE. [Peter warms himself at fire] THE CHIEF PRIESTS AND THE WHOLE SANHEDRIN were looking for evidence against Jesus on which they might pass the death sentence. SEVERAL indeed brought false evidence against him, but their evidence was conflicting. …” It is plain from Mark that there were rather more present than the three rostered members of the Sanhedrin. As both Joseph and Nicodemus were both secret followers of Jesus, and would both have access to the proceedings, the case for their presence is not so weak as you state. Papias: I am well aware of Papias claims, but Eusebius considered him an unreliable source: “Papias (died c. 130), a bishop of Hieropolis, in Asia Minor, was said by Irenaeus (died c. 200), a bishop of Lugdunum (now Lyon, France) to have been an eyewitness of the Apostle John. Papias had said, “For I did not suppose that the things from the books would aid me so much as the things from the living and continuing voice.” Eusebius (c. 260 c. 340), a church historian, reported these comments in his Ecclesiastical History and pointed out inconsistencies in Papias’ recollections, doubted his understanding, and called him “a man of exceedingly small intelligence.” ” Papias’ claim that Mark wrote accurately Peter’s “memoirs” would refer to the gospel known as Mark, as “memoirs” was the word then commonly used to describe these scriptures. Mark may well have been Peter’s amunuensis in Rome, and it is supported by I Peter for what that is worth. His possible role as official trial recorder is a credible conjecture, but I certainly can’t see it as an indisputable fact. There were several other eye witnesses to the trial, and I think it equally likely that their oral reports of the trial could just as well have been the source of the original gospel account. We are too far removed in time for any kind of factual certainty, and credible conjectures cannot exclude other possible explanations. I think I must adhere to the view that Paul would have been competent in at least koine Greek (Tarsus), Aramaic and classical Hebrew (under Gamaliel I), certainly without the need for a translator in his preaching, although he apparently found it convenient to dictate to an amenuensis for his epistles. I think it unlikely he was the author of Hebrews, but could concede it is just barely possible as Jewish recipients would require a different approach and Paul would certainly have adequate capability to have adjusted to this. But it is unlike other Pauline writings..","date":"2013-03-04","mins":"5:01 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-36661","author":"daveb_of_wellington_nz","post":"Part of the problem is that history is no longer a core subject in our education systems, the focus being more on technology and indigenous cultures, rather than the inherited European traditions. Our decendants, not having any history will be condemned to repeating the errors of their forbears. Meanwhile the religious focus is on building the church of the future, with its multi cultural dimensions, rather than looking back to the past. Few of our priests are younger than 70 years of age, and in Wellington archdiocese there are no current candidates for the priesthood. There will need to be major parish amalgamations, as has extensively happened in the Netherlands (at least two of our local priests are Dutch). We have to accomodate a mix of immigrant cultures, Filipino, Samoan, SE Asian, and include our own indigenous Maori and South Pacific cultures. It is more complex in the African and Asian countries. In the meantime, the gospel must be proclaimed, charitable works undertaken in the social option for the poor. All this creates its own religious focus different from the past. You will see Anglophone tourists, including those from NZ and Australia in Western Europe, fewer in Poland. But our main tourist clientele comes from China and Japan, not so many from Europe, occasionally a few Swedes and Germans. It is a different world!.","date":"2013-06-10","mins":"7:36 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36470","author":"daveb_of_wellington_nz","post":"An unusually interesting, fascinating, informative and intelligent discussion. It is amazing what can come to light when discussions are confined to the issues rather than personalities. But I fail to see the point of O.K’s. Persistent Anglophone xenophobia, based on crass stereotyping. Or have the Europeans forgotten that they would all now be confined to speaking German if it were not for English speaking Americans, British, Anzac, South African, and Canadian allies in 1944? [The Russians were there as well].","date":"2013-06-08","mins":"4:34 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36480","author":"daveb_of_wellington_nz","post":"I am fully aware of the Polish situation. NZ along with other Anglo countries provided refuge for very many Polish children soon after WWII, at the behest of a NZ Catholic priest, Fr Owen Sedden, later a renown bishop in Auckland. I was at College with many of these refugees, a few of them evidently badly ravaged from their experience in German concentration camps. A Polish architect served as an early mentor during my engineering cadetship, so I am informed of general Poish perceptions of the relative merits of both Russians and Germans. A few Polish ladies have also informed me that my surname matches that of an evocative Jewish settlement ‘Belz’ which I believe is near Lvov (now in Ukraine). There is also a village of that same name near Saint Nazaire in Normandy, near where the allied landings occurred. I am also aware of the 1930s efforts by Polish code breakers in providing the essential key to breaking the German Enigma code. However it now seems that many Europeans have forgotten the links with their past and instead prefer to welcome jihadists within their borders while those with other more sympathetic cultures are excluded. We may have saved you from being obliged to speak German, but I doubt if we can save you from being obliged to speak Arabic instead. In 1944, we were unable to find any Frenchman to show our pass ports for entry!.","date":"2013-06-08","mins":"6:37 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36509","author":"daveb_of_wellington_nz","post":"There’s been previous recent discussion about button like objects. Check comments under Dan’s recent posting on Stephen Jones’ coins commentary assertions. Problem seems to be that buttons appear evident from 3 D (e.g. VP 8) pix BUT Is this merely a trick of the brightness or density plotting over the eyes, OR are there in fact true 3 D button like objects? Can the objects be confirmed as clearly visible from enhanced 2 D negatives? Caution required! What you see in 3 D pix is not true 3 D but merely variations in brightness!.","date":"2013-06-09","mins":"5:21 am","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-36656","author":"daveb_of_wellington_nz","post":"O.K.: “Simply found that most of the English world simply doesn’t know anything about many other relics besides the Shroud and Oviedo (the latter thanks only to Guscin and Benett), which have sometimes very interesting connections to the Shroud. I found this ignorance terrible.” I think you have to understand that there are very good reasons for this. Poland has of course remained an intensely Catholic country, even conservatively so, but this is not so much the case in Western Europe, except perhaps for the Latin Mediterranean. In the Anglophone countries, the situation is again quite different, where there has developed a strong Protestant tradition, stemming from intense persecutions during the Elizabethan age and subsequently. In England for example the anti Catholic Penal Laws survived well into the 19th century. The era of nationalism also played a significant part in shaping these cultures and their religious allegiances. In Ireland, Catholicism survived, but the education constraints imposed by the English establishment meant I think that it was an intellectually impoverished Catholicism, but there were of course exceptions. In the Anglophone countries it was inevitable that Protestantism had some impact on the Catholic outlook. Most of these countries, especially of the “New World” were remote from the religious conflicts of Old Europe, and the settlers were for the most part glad to have left them behind, more so their descendants. The European interest in relics was often seen as a commercially driven enterprise, heightened by stories of Tetzel’s provocative sale of indulgences, the underlying quest for “religious tourist attractions” and so on. It led to some scepticism in the value of relics as testament to religious history. Such stories as there being enough relics of the True Cross to build a navy flotilla of ships gained provenance. The religious expression in these countries became more focused on biblical events, with the Protestant emphasis on scriptural authority. In both Australia and New Zealand the Catholic ethos was strongly influenced by traditional Irish pieties: the rosary, the Sacred Heart, and with our French Marist tradition, developments in Mariology. During my college days in the 1950s there was a strong focus, certainly in NZ, on the Fatima apparitions. My own parish church in Tawa, Wellington is dedicated to Our Lady of Fatima, along with about six other churches in NZ. Many NZ Catholics, and even some of my Protestant connections include a pilgrimage to Lourdes in their overseas tourist excursions. Other acquaintances, including our Wellington archbishop have walked the way of St James in northern Spain. In 2003, I did discover in my local public library a copy of “The Quest For The True Cross” by Carsten Peter Thiede and Matthew D’Ancona. I found it an excellent and informative work and included a long review of the book in the church magazine I edit. There are small pockets of local interest in such matters, but they are rare. My own first real encounter with the Shroud was about 1960, when our University Dominican chaplain presented a slide show at my Engineering School hostel. A few devout families, including my own, occasionally had depictions of the Shroud facial image in their homes. However, the suspicion surrounding the authenticity of alleged relics remains, and is not helped by the poverty of adequate evidence in most such cases, which fuel the doubts raised by sceptics. It is perhaps seen as a European preoccupation, while we carry on with our own local religious preoccupations, which are quite different, particularly with the multi cultural immigration that has since occurred. The world is very much wider and more complex than Old Europe may perceive..","date":"2013-06-10","mins":"5:57 pm","url":"https://shroudstory.com/2013/06/07/the-shroud-of-turin-our-lady-of-guadalupe-tilma/","cat":"event","title":"The Shroud of Turin & Our Lady of Guadalupe Tilma"},{"id":"comment-149181","author":"daveb_of_wellington_nz","post":"Gold is dissolved in seawater, but measurements of its actual concentration has been extremely controversial, and is complicated by several issues. Particularly attempts prior to 1980. In 1985 Lucas obtained values of between 5 to 50 ppt (parts per trillion) with an average of about 13 ppt. It appears to be higher around the Bering Sea due to washing of alluvial deposits from Alaska and Siberia. There is no known means yet of extracting it from the sea on any commercial scale, but it is possible that certain thermal bacteria may provide a means in the distant future. There is no known means of synthesising gold through nuclear reactions. Gold most commonly occurs in its natural state or as tellurides. It is the most malleable of all metals and it is possible to draw it in very fine wires or sheets perhaps as thin as 10 nm. It is believed that most of the gold extracted on earth has been deposited by meteorites, particularly in the Wirwaterstrand which accounts for over 50% of the earth’s gold production. There are several myths about the substance and it has frequently been an avenue of confidence tricksters. In medieval times gold dust was sometimes added to foods for culinary decoration, and also to certain expensive liqueurs. It has no nutritional value whatsoever and passes through the digestive system with no beneficial or adverse effects whatsoever..","date":"2014-09-06","mins":"11:15 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-150685","author":"daveb_of_wellington_nz","post":"The above discussion led me to a brief check on anti matter. Much of the theory seems to relate merely to opposite charged particles, e.g. The positron and anti proton. Anti hydrogen has been produced in 1995 by CERN, but of course was almost immediately annihilated. It is possible that antimatter may exist in the form of galaxies, but would be separated from matter at a scale of the distance between galaxy clusters. The amount of antimatter in the Milky way galaxy cannot be more than 1 in 10^7. Soon after the discovery of the antiproton the question was raised as to whether antimatter would be subject to gravitational attraction or repulsion from ordinary matter. This question is of extreme importance because gravitational repulsion between matter and antimatter is inconsistent with the theory of general relativity. Observation of the interference phenomena between K01 and K02 mesons led to the conclusion, by M.L. Good, that the gravitational interaction between matter and antimatter is identical to that between matter and matter. This would seem to discredit the prospects of levitation of any form of any kind of particulate..","date":"2014-09-13","mins":"8:04 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-150796","author":"daveb_of_wellington_nz","post":"It would require a miracle, see later posting, ‘Mystery never proof of anything’. Seeking a natural explanation for a mystery may not always provide an answer, notwithstanding Conan Doyle..","date":"2014-09-13","mins":"5:39 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-150911","author":"daveb_of_wellington_nz","post":"[Refers to the idea of anti gravity levitation postulated in preceding paragraphs above].","date":"2014-09-14","mins":"7:38 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151022","author":"daveb_of_wellington_nz","post":"Angel commented on universe expansion exceeding the speed of light. There were I think a few months when scientists at CERN involved with the LHC, were puzzled by a problem which they originally could seem only to explain by ‘c’ being exceeded. But I believe on closer examination, another explanation was found, and the original report was found to be in error. On the other hand, we have the mysteries of quantum entanglement. Einstein went to his grave trying to unravel the mysteries of inconsistencies between relativity and quantum theory in his search for a G.U.T. But no one else has ever succeeded in resolving it. Wisely at the outset, the Bard has Hamlet saying: “There are more things in heaven and earth, Horatio, Than are dreamt of in your philosophy.” – Hamlet (1.5.167 8), Hamlet to Horatio.","date":"2014-09-14","mins":"7:50 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151087","author":"daveb_of_wellington_nz","post":"Dear Angel: I think your rendering of Genesis 1 can only be considered at the poetic level, which is admissible as such, but not at the exegetical level. There is an excellent commentary on Gn 1 at the USCCB web site which I think you might find extremely interesting. The older original creation story composed by the Jahwist source is actually chapter 2 where God is seen as more of an anthropomorphic being – he talks, walks in the garden, he searches for Adam who is hiding from him, he asks questions “Who told you that you were naked?’ and there is a talking snake. When the Jews were taken into exile, about 540 BC they were exposed to Babylonian science, and to the Babylonian cosmogony. It was during this time that the Priestly source wrote the progressive story of creation we now read in chapter 1, but they still kept the older story. The “us” in chapter 1 reflects the idea of God presiding over a heavenly realm of beings, and although some have argued an implicit trinity from it, that is too much of a stretch. Material creation is bound by the Laws of nature, which as far as we now know includes the limits imposed by the speed of light. Neither the Creator, nor spiritual creation is so bound. They exist outside of Nature. An example of this would be the reported miracles of bilocation, such as those said to have been enjoyed by Padre Pio, and other saints, as directed by God. Verse 1 reflects the ancient understanding of the universe, earth below, a dome above, and a heavenly realm beyond. It ought not to be understood as a literal explanation. There is far more on the USCCB site which I recommend you check out, as there is much more. Http://www.usccb.org/bible/genesis/1 My wife is now demanding I come to the dinner table. Immediately..","date":"2014-09-15","mins":"2:24 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-151104","author":"daveb_of_wellington_nz","post":"Fool’s gold = Iron pyrites = Fe S2 (Iron sulfide) White gold = Magnesium hydroxide Mg(OH)2, Brown gold is brewed from hops and malt. None have any Au !.","date":"2014-09-15","mins":"3:48 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-157426","author":"daveb_of_wellington_nz","post":"Transmutation of Pb to Au: Atomic numbers: Pb – 82; Au – 79; Atomic weights: Pb – 207.21; Au – 197.2; Electron shells: Both complete and full to 5d shell; Pb – 2e at 6s, 2e at 6p; Au – 1e at 6s. Transmutation required: From Pb nucleus, knock out 3 protons + about 7 neutrons; From Pb electron shells, knock out 2e from 6p and 1e from 6s. How does one target nuclei in such a particular manner, or is it haphazard, and is it merely luck? As far as I know, it’s never been done. Most received formal literature seems to say there is no know nuclear process. Sounds expensive. Probably cheaper to try and capture meteorites, reputed source of most of earth’s accessible gold..","date":"2014-09-28","mins":"6:37 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-157398","author":"daveb_of_wellington_nz","post":"Maybe the factual basis of some of these gold issues that Angel has been mentioning, could be related to nanoporous gold which Lawrence Livermore Nat Lab does seem to have been working on. See: https://www.llnl.gov/news/aroundthelab/2012/Aug/ATL 082212 gold.html which does seem to be a valid posting from LLNL. Maybe after that, it’s all “Chinese Whispers” and the stories get out of control and embroidered..","date":"2014-09-28","mins":"4:19 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-157513","author":"daveb_of_wellington_nz","post":"My paternal grandmother and her two brothers were born or brought up across Cook Strait around the 1870s in the town of Nelson, which is now quite a city. I believe they had a young school mate there by the name of Ernie Rutherford. Precocious kid. Seemed to know something about the topic..","date":"2014-09-28","mins":"4:11 pm","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-157575","author":"daveb_of_wellington_nz","post":"Sir Ernest Rutherford, knighted Baron of Nelson, features on the NZ $50 note, Kate Sheppard, NZ pioneer of women’s rights (she secured the women’s franchise in NZ ahead of all other countries) on the NZ $10 note, and Sir Edmund Hillary, conqueror of Mount Everest on the NZ $5 note. We have a reputation for pulling beyond our weight. Rutherford is credited with claiming that all science is either physics or stamp collecting; he had a reputation for frequently intoning the hymn ‘Onward Christian Soldiers’ in his laboratory. Sorry to hear about your exposure to radiation. A brilliant class mate of mine went into nuclear medicine at Auckland Hospital but died of radiation exposure in his early 40s, Mme Curie liked to keep radium night lights in her bed room which also resulted in her premature death. You’ve survived 20 years and are therefore fortunate..","date":"2014-09-29","mins":"12:18 am","url":"https://shroudstory.com/2014/09/04/the-trimurti-of-the-italian-scientific-experimental-studies-on-the-shroud/","cat":"event","title":"The Trimurti of the Italian scientific-experimental studies on the Shroud"},{"id":"comment-45174","author":"daveb_of_wellington_nz","post":"I had not come across the N D Wilson ‘Shadow Shroud’ experiments previously, even though they were way back in 2005, and I have to say I found them intriguing. The results were I thought better than some other poorer attempts to create an image that I’ve seen. For those not familiar with them, I can recommend checking out the link, which opens at an interviews on FA Qs, including responses to some of Dan’s criticisms at the time. You can check out by other links the images there and some background overview on the method. Briefly the idea as I understood it is that a picture is painted on a glass sheet (seems that oil paints were used), and the glass with cloth underneath is exposed to sunlight for several hours, forming an image on the cloth. It is argued that the relative motion of the sun eliminates traces of the brush strokes, and that controlled variations in brightness also give a 3 D effect. I saw no comment there concerning any pre treatment of the cloth. Assuming this is not a leg pull, and that the claims made are in fact kosher, then there are a few technical objections: 1) Could sheets of glass be made large enough? Wilson argues that with “cylindrical glass blowing” in the 11th century it would be feasible to do it with two separate sheets for the ventral and dorsal images; 2) Forgers seldom do one offs, and no other attempts are known; But, such large sheets of glass would have been extremly expensive at the time; 3) The realism of the Shroud image fits into no medieval artistic category, and I think this might be the key objection; 4) The forger did not inform anyone else of the method; why would he want to produce a negative image? why are there no smaller, less expensive medieval examples of this process? However one additional thought did occur to me. If in fact the method as described is genuine, does it say anything about the potential credibility of Giulio Fanti’s hypotheses about the Shroud image being formed by some laser like light process?.","date":"2013-09-23","mins":"6:16 am","url":"https://shroudstory.com/2013/09/23/this-is-one-very-good-way-the-story-is-being-told/","cat":"event","title":"This is one very good way the story is being told"},{"id":"comment-59930","author":"daveb_of_wellington_nz","post":"Louis, I think it’s a counsel of perfection, but it’s not how 21st century minds work any more. First the evidence, then comes faith. In the beginning, Christianity had its roots in the Torah. But the eventual discovery that the Torah had much of mythic content, changes nothing. We are discovering that many of our preconceptions of the Shroud might not be sustained, but it changes nothing..","date":"2013-12-15","mins":"3:27 pm","url":"https://shroudstory.com/2013/12/14/update-on-the-st-louis-conference-october-9-12-2014/","cat":"event","title":"Update on the St. Louis Conference, October 9-12, 2014"},{"id":"comment-47588","author":"daveb_of_wellington_nz","post":"Careful Colin, my surname just precedes “Ber”. So maybe that would give you a soft target. At 51 years married, that gives me an edge, but my dad lived to 92, good genes!.","date":"2013-10-15","mins":"5:04 pm","url":"https://shroudstory.com/2013/10/14/update-on-the-ieee-workshop-september-in-italy/","cat":"event","title":"Update on the IEEE Workshop: September in Italy"},{"id":"comment-150132","author":"daveb_of_wellington_nz","post":"Barrie S mentioned that STURP took a computer to Turin in 1978, but it didn’t work. That was probably the last time a computer was anywhere near the Shroud. I suspect that several of Piero’s questions and suggestions might be able to be answered at some future time with a detailed spectral analysis, possibly even at the molecular level, with the aid of modern number crunching abilities of computer analysis of the spectra. Who knows? We might even be able to detect flowers, pollen residues that escaped being vacuumed off in 2002, even perhaps wine and cheroset residues if they’re still there, although probably now degraded. Meantime we shall have to wait until such time as Vatican authorities have more confidence in scientists’ abilities and open mindedness than they seem to have at present. Too much of the science seems to be agenda driven, regardless of what side of the authenticity divide one looks at it..","date":"2014-09-11","mins":"5:03 am","url":"https://shroudstory.com/2014/09/10/a-report-on-the-bari-conference/","cat":"conference","title":"A Report on the Bari Conference"}]
