[{"id":"comment-64083","author":"daveb_of_wellington_nz","post":"We’ve already exchanged quite a lot of commentary on the relative merits of Barbet vs Zugibe. My recollection is that the fundamental difference is that Barbet is saying that the weight of the body is mainly suspended by the very high tension in the arms, which must in some way be taken by wrist bones to avoid tearng through the palms; whereas Zugibe claims that the bulk of the weight, maybe some 75%, can be taken by nail(s) through the feet. I don’t recall that Zugibe envisages the feet standing on a pedestal. Barbet’s version leads him to conclude that in order to maintain breathing, the crucifarius must therefore exercise some kind of see saw motion constantly transferring his weight from his arms to his legs and back again. He cannot maintain this action indefintely so that death is by asphyxiation. Zugibe does not see breathng as such a problem, as he claims that the weight being taken by the feet allows the crucifarius to breathe well enough. So Zugibe is attributing death to shock. I don’t think it can be claimed that this is hair splitting. I personally don’t find Zugibe’s scenario so plausible. Binding a volunteer’s feet to the upright with a strap, is hardly the same as nailing the feet of a condemned man with all the pain that must have resulted. However I’m not a forensic pathologist, and the bottom line has to be that only one so qualified can arbitrate between the two hypotheses as to which is more credible. At present I’m not aware what other professional corroboration Zugibe was able to muster for his version..","date":"2013-12-21","mins":"7:36 am","url":"https://shroudstory.com/2013/12/21/barbet-vs-zugibe-part-3-on-stephen-jones-blog/","cat":"science","title":"Barbet vs Zugibe: Part 3 on Stephen Jones’ Blog"},{"id":"comment-125562","author":"daveb_of_wellington_nz","post":"I consider all this argument about what a flagrum looked like and what it didn’t look like, is all so much hot air. Any handyman today could make a quite effective flagrum using only the ordinary simple tools readily available in Roman times and still available today. What it would like, would only be constrained by his imagination, what materials were available to him, and its intended purpose. It would not be at all necessary for a rigorous compliance with detailed standing instructions and specifications of Quartermaster General’s Sargent, Roman Legion, stationed in Jerusalem, first century AD, to win inspection for purchase or acceptance, or for that matter general use by any Roman soldier or other person so delegated for the job. Note that it would not be necessary for actual dumb bells to be used to inflict dumb bell shaped wounds. Barbet never said the thongs terminated in dumb bells; Only that the wounds had a dumb bell shape to them. He envisaged two sheep tali (knuckle bones) or lead pellets separated by about 3cm, tied to each thong at some distance from its end, Such a weapon as may have been used to inflict the scourging wounds displayed on the Shroud image is readily identifiable as a type of Roman flagrum, as asserted..","date":"2014-05-29","mins":"4:13 pm","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","title":"And More Still on the Roman Flagellum and Flagrum"},{"id":"comment-125611","author":"daveb_of_wellington_nz","post":"The very least that can be said is: 1) The gospel accounts of both Matthew and Mark both record that Jesus was scourged, apparently the usual prelude to a crucifixion; 2) There are scourge marks on the image of the TSM, about 100 to 120 marks, arranged in pairs, suggesting a scourging of some 50 or so lashes by two different executioners, each using a whip of two thongs each thong fitted with two pellets, perhaps knots, more likely bone or metal objects (possibly lead); 3) The two pellets were separated by a distance of 3cm, and were some distance from the end of each thong as there are instances of thong marks reaching beyond the pellet marks; 4) Such an instrument is entirely consistent with what is known of the Roman flagrum, of which it seems likely there were varieties in specific design, according to the personal preferences of the executioners; 5) Any suggestion as to some other cause is pure speculation unless it can be supported by a reasonably similar weight of evidence..","date":"2014-05-29","mins":"9:21 pm","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","title":"And More Still on the Roman Flagellum and Flagrum"},{"id":"comment-104167","author":"daveb_of_wellington_nz","post":"Hugh refers to Vignon’s 1903 work “Le Linceul Du Christ”. This was the work following his studies of Pia’s negative photos, under Yves Delage, which Delage presented to the Paris Academy, and which concentrated on the anatomical aspects. Its antagonistic reception by the Academy led Vignon to look into comparisons of the various icons. These results were not published until 1938 under the imposing title ““Holy Shroud of Turin: Science, Archaeology, History, Iconography, Logic”; It seems to have been sufficient for the French Academy to have relented and they awarded Vignon their prize. Wilson lists the markings claimed by Vignon as: Vignon Markings: 1) streak across forehead; 2) open square between brows; 3) ‘V’ shape at bridge of nose; 4) second ‘V’ within 2; 5) raised right eye brow; 6) & 7) accentuated left & right cheeks; 8) enlarged left nostril; 9) accented line between nose & lower lip; 10) heavy line under lower lip; 11) hairless area between lower lip & beard; 12) forked beard; 13) transverse line across throat; 14) heavily accented owlish eyes; 15) Two strands of hair at forehead. The markings have often been debated, and have been parodied on Davor Aslanonovski’s web site for instance. Nevertheless it is apparent that many claim to recognise these marks. Recognition of facial likenesses is a highly subjective matter, and artists will all have their own interpretation of what constitutes likeness. It may be salient that it is unlikely that any computer software would be successful in matching a variety of artistic likenesses of the same subject for instance. It may be more relevant to rely on subjective perceptions of recognition of the likeness of icons to the Shroud face, than trying to develop a systematic method as Vignon apparently attempted to do. I personally consider that many of the icons do in fact show a close likeness to the Shroud face. But that is a subjective interpretation for which each of us is entitled..","date":"2014-04-26","mins":"4:35 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","title":"How Valid are the Vignon Markings?"},{"id":"comment-106015","author":"daveb_of_wellington_nz","post":"I know nothing of Zanker’s theory and and am disinclined to look into it. If it gathers enough support and he is able to persuade others, it may survive, otherwise it will become just another discarded hypothesis that disappears into the dustbin of so many other rejected ideas, and there are very many such. I have noted that academic authority often does seem to correlate with ignorance and stupidity, and I think there are good reasons for it. The Renaissance men seem to have been more enlightened, having an adequate generalist background. Not only did each have his particular gifts, but they were able to engage in an informed way on a large variety of topics. Today life is more complicated, and there is a tendency to specialise far too early in one’s career. The ancient Greeks, no matter what their calling were all trained in geometry, an excellent disipline in critical thinking. Euclid’s “Elements” survived some 2000 years, but modern educators thought they knew better and discarded it from the curriculum around the 1960s, in favour of post modernist theories, which contribute little to intelligence. Even the last 500 years in the history of Science have any number of anecdotes of students with brilliant insights, at first rejected by their mentors and professors, often resulting in severe mental anguish for the innovator, but which later proved to be more enduring than the received wisdom. The Galois’ mathematical theory of Groups is only one such example, but there are very many other instances. The aspiring academic, could do no better than once having been trained in his particular discipline, he should secure for himself a wider background and be prepared to study in much broader fields to fit himself for intelligent discourse..","date":"2014-04-29","mins":"4:35 pm","url":"https://shroudstory.com/2014/04/26/how-valid-are-the-vignon-markings/","cat":"art","title":"How Valid are the Vignon Markings?"},{"id":"comment-104521","author":"daveb_of_wellington_nz","post":"Note that Paul Vignon published his main work on iconography in 1938. Guiseppe Enrie, a professional photographer produced results much superior to those of the pioneer amateur Pia’s of 1898, in 1931. Presumably Vignon worked from Enrie’s photographs rather than Pia’s. I think this would negate some of Hugh’s criticisms that some of the marks do not show on Pia’s photographs which are generally acknowledged as inferior to Enrie’s..","date":"2014-04-27","mins":"7:22 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-104633","author":"daveb_of_wellington_nz","post":"Good work, O.K. Ian Wilson included a very comprehensive display of examples of icons and copies of the mandylion in a slide show for his paper he presented at the Valencia conference in 2012. Of some interest is his display of various classifications of the various types of mandylion presentations: rectangular plain or with roundels, decorative lattices; large billowing types. Both the text and slide show files can be found at: http://www.shroud.com/pdfs/wilsonvppt.pdf under heading title “Discovering more of Shroud’s Early history”, Valencia Conference 2012..","date":"2014-04-28","mins":"1:31 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-104813","author":"daveb_of_wellington_nz","post":"There are a number of issues here. Firstly I think that there can be little question that the markings are present to varying degree on very many icons and on representations claimed to be based on the mandylion. Vignon and Wuenschel together deduced some 20 of them, Wilson has reduced them to 15. The second issue is what is the original source of these markings? Vignon was persuaded that it was the Shroud image, and Wilson echoes this. Vignon apparently considered there were markings on the Shroud corresponding to the common elements that he had found on the icons. An explanation is needed as to why the various markings are repeated on so many of the icons. Clearly there was some template on which they were based. The various icons are generally claimed to be based on the image of Edessa, whatever that was. Syriac monks dispersed copies of the image and it circulated around eastern christendom from about the sixth century following the emergence of the original in Edessa. Hugh is setting himself up as a more authoritative observer than Vignon, Wuenschel and Wilson and is denying that he can perceive these markings on the Shroud image. Whether he is justified in doing so might be argued. Certainly other Byzantine art authorities have questioned the relevance of the markings and few of them seem willing to accept the significance of the markings. Why they do not consider them significant seems somewhat astonishing to myself, as they are readily apparent to me and to others and seem to demand explanation. The third issue is whether after setting the markings aside, one can assert a subjective likeness exists between the iconic representations and the Shroud image. In his last paragraph above, Hugh has gone as far as denying that even this is possible. My own subjective interpretation is quite different, and I consider that there is a likeness..","date":"2014-04-28","mins":"7:41 am","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-105132","author":"daveb_of_wellington_nz","post":"Hugh’s objections do not discover the reason why the various markings on iconography regularly occur. The likenesses also show on coinage, gold solidi of Justinian II of 692 AD, and Constantine VII of 945 AD, Homs vase 6th 7th century Louvre (Emesa, Syria). Constantine’s solidus appeared within a year after the mandylion’s arrival in Constantinople, and he was known to have closely inspected it on its arrival there. He describes it as ‘extremely faint, a moist secretion without pigment or painter’s art’; others saw it as blurred. This certainly matches the indistinct image of the Shroud cloth. That such a close similarity to the Shroud image appeared on his coinage is quite remarkable. We do not know how the mandylion image was copied and conveyed to the various iconographic artists, whether there was one or more templates made from the original, or how a standard Christ like portrait came to be. There may have been only one or perhaps merely a few artists involved in making the templates from the original. There was clearly scope for artistic interpretation in creating the templates from the original. It seems likely that only a few artists would have access to the original mandylion. However that such a standard form appeared with repetition of particular features seems clear enough and argues for a common origin. That at least some of these features can be found on the Shroud image, is at least reasonably suggestive that the common source was in fact the Shroud image, however remote from it, subsequent copies came to be..","date":"2014-04-28","mins":"4:45 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-104459","author":"daveb_of_wellington_nz","post":"Thanks to O.K. And also to Dan for the posting. I mentioned the Vignon markings in a recent presentation to my local U3 A group. I intend sending them a reference to the file. It would enhance the file and perhaps assist more widespread distribution, if O.K. Could also find the time to add a subtitle to each of the icons and also their likely dates of provenance, as well as the UR Ls of the sources he has already shown..","date":"2014-04-27","mins":"3:47 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-104528","author":"daveb_of_wellington_nz","post":"I checked the item. I note that one of the archaeologists said “We could be dealing with one of the earliest pictures of Jesus” so the identity is still a little speculative, and as Louis says the inscriptions have still to be deciphered. Saint Mark is sometimes credited with early missionary activity in Egypt. Possibly it might even be him or some other??.","date":"2014-04-27","mins":"7:33 pm","url":"https://shroudstory.com/2014/04/27/more-on-how-valid-are-the-vignon-markings/","cat":"art","title":"More on How Valid are the Vignon Markings?"},{"id":"comment-8227","author":"daveb_of_wellington_nz","post":"Vignon led a small biology team at the Sorbonne Paris which began an analysis of Secondo Pia’s negative (1898) as early as 1900. He subsequently became Professor of Biology at the Institut Catholique, Paris. The team’s results were presented to the Paris Academy of Sciences on April 11, 1902 by Yves Delage Sorbonne professor of anatomy and a well known agnostic. He pointed out the wounds and other data were so anatomically flawless that it seemed impossible they could be the work of any artist. He considered that the image was caused by some physiochemical process in the tomb. Although the paper was favourably received elsewhere, the Academy was so dominated by “rationalists” and “free thinkers” that the Secretary refused to publish the full text, and Delage was warned that he was putting his career in jeopardy. So much for the objectivity of Science! They also have their share of fanatics! Readers are probably aware of Wilson’s detailed comparisons of the Vignon markings with various icons appearing after the sixth century, in his endeavours to show the Mandylion of Edessa and Shroud were actually one and the same object. I also made some comment concerning the.coins that appeared recently on this site, where many of the Vignon markings were readily apparent or had been stylized. But such persuasive evidence will continue to be ignored by the skeptics, merely because it does not match with their preconceived notions and agenda, their preference for reductionism, and they will no doubt continue to fiddle with heating metal bas reliefs, and scorching countless ironing boards..","date":"2012-02-14","mins":"7:06 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"},{"id":"comment-122326","author":"daveb_of_wellington_nz","post":"I find it striking that even absent the halo, the few sketchy lines of the posted picture gives a recognisable picture of Jesus. In fact I would say it is the rudimentary picture of him. The mental processes involved in perception and recognition are not yet fully understood. If the picture rudiments could be quantified, we might then have a better measure for comparing icons with the Shroud image. But not yet ….","date":"2014-05-20","mins":"8:04 pm","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","title":"The Vignon Markings Issue:  A Promoted Comment"},{"id":"comment-8327","author":"daveb_of_wellington_nz","post":"Thanks for the knuckle rap Colin, I needed that. I apologise that offence was taken. I may have been taking too many horse riding lessons recently. My instinctive reactions to comments made might have been better expressed. Half baked history lessons: Scientific feuds: check series by Hal Hellman – John Wiley &,Sons – “Great Feuds in … (Mathematics, Technology, Science, Medicine); Mach Boltzman: check “Boltzmann’s Atom” David Lindley – Simon & Schuster 2001; Nicolaus Steno: – “The Seashell on the Mountaintop” Alan Cutler – Heineman 2003 (“The summit of Mount Everest is marine limestone!”). Recurring themes are establishment close mindedness coupled with manipulation. I’m still interested in informed professional comment on Mouraviev’s paper, although there seem to be some questionable assumptions in his description of the burial work. But I wonder if there may have been some other similar chemical process involved..","date":"2012-02-15","mins":"6:44 pm","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"},{"id":"comment-8278","author":"daveb_of_wellington_nz","post":"Colin, I have no idea whether you’ve bothered to read Scavone’s paper or not. If you had, you would see that unlike some scientific fanatics I’ve come across, he’s not at all dogmatic about his conclusions that they were one and the same object but he weighs the evidence and gives his measured opinion on the matter. As to the apparent clarity of the image, I imagine it may very well depend on the angle of the lighting. In 944 AD, the Mandylion image was clear enough to the future emperor Constantine Porphyrogenitus, but his corrupt brothers Stephen & Constantine Lecapenus found the image very blurred. Perhaps it requires a pure heart to see the truth of such matters. Regardless of the clarity of the Mandylion image, it nevertheless gave rise to countless icons as it was believed to be the true image of Christ not painted by human hands, all of them meticulously copying the Vignon markings, whether they made artistic sense or not. Frankly, I would like to see you lift your game by adopting a more scientific attitude, but that requires more of an open mind that you seem prepared to adopt, For example you could use your chemistry skills to look more closely at such processes as outlined in Mouraviev’s paper: “The Image Formation Mechanism on the Shroud of Turin: A Solar Reflex Radiation Model (the Optical Aspect)” It can be found at: http://www.shroud.com/pdfs/mouraviev.pdf. A closed mind is not uncommon among scientists, one writer makes a living from writing a series of books on the various feuds that have occurred, but it is hardly something to be admired, even though it may suggest loyalty to one’s convictions. Ernst Mach was convinced that atoms did not exist as recently as 1895, with the result that Boltzman committed suicide because of Mach’s influence with the establishment. A year or two later Einstein proved the existence of atoms from his Brownian movement experiments and calculations. Nicolaus Steno, founder of modern geology, was so disenchanted with the bickering among his scientific colleagues, that he abandoned science, converted to Catholicism and entered the church. So you see you are not alone in your single mindedness. Incidentally, I believe it was Niels Bohr whose response to Einstein was: “Stop telling God what to do with his dice!”.","date":"2012-02-15","mins":"7:17 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"},{"id":"comment-8252","author":"daveb_of_wellington_nz","post":"Yannick’s persistent assertion that the Mandylion and Shroud were two separate objects is a lone voice. There are several arguments against it. I have previously referred him to Daniel Scavone’s 1996 paper examining this issue in considerable depth, with all the documented evidence he offers, some 28 pages including notes. I found that Scavone appears to have updated his paper a number of times, the most recent edition I found was dated in 2006. It can be found and downloaded as a *.doc file at: http://www.shroudstory.com/scavone/scavone.doc.","date":"2012-02-14","mins":"8:28 pm","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"},{"id":"comment-119477","author":"daveb_of_wellington_nz","post":"This “watcher on the hill side” does not believe that Vignon was wrong at all. I consider that O.K. Makes a valid point that many of the Christ icons do show Vignon markings, and when they occur, they are consistently more frequent than such markings on non Christ portraits. It would not be uncommon for artists to imitate such features as Vignon markings in portraits of their other subjects. Who can enter the mind of an artist? Artistic styles often seem to follow a fashion. I have previously referred to Ian Wilson’s paper showing several slides of a wide range of Christ icons and representations said to be of the mandylion. Ian Wilson – “Discovering more of Shroud’s Early history”, Valencia Conference 2012; Paper and slide show: http://www.shroud.com/pdfs/wilsonvppt.pdf Unfortunately many of these examples have suffered the ravages of time and neglect, and are sometimes indistinct. Both Vignon and Wuenschel together identified some 20 characteristic markings, and Wilson in his books reduced the number to 15. I would agree that we now need to move beyond Vignon. Clearly the basic idea was to identify those characteristics that were often repeated in the icons, particularly those that had some claim to be representations of the mandylion. But it should not be surprising if such characteristics may sometimes be repeated in other sacred non Christ portraits, as imitating artistic style. The time sequence and geographical dispersion of such characteristics would be important to detect any changing trend or development. Whether this can be done on an objective basis may be awkward, as there would be often some reliance on variable subjective perceptions, as is already too evident in the recent discussions. The project is essentially one that ought to rely on artistic expertise, and it seems unfortunate that few such experts have demonstrated much interest in committing themselves to such a project, but have been content to rely on the received wisdom of their skeptical predecessors. There has to have been a discernible development in the representation of Christ icons, which can be analysed and stated in an authoritative way. Perhaps it does need a multi disciplinary approach as suggested by the initial correspondent. Like all such projects it requires time, interest, serious research, hard work and commitment, of the type that Paul Vignon was prepared to devote to it 80 years ago, before there was ever any concept of the internet and its advantages..","date":"2014-05-14","mins":"6:21 pm","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"},{"id":"comment-120342","author":"daveb_of_wellington_nz","post":"Paul Vignon 1865 1943: biologist, worked with agnostic Anatomy Prof Yves Delage, prepared anatomy paper based on Pia’s photography, presented to Paris Academy by Delage 1902; Published “The Shroud of Christ” 1902; Paper hailed by British Medical Journal “The Lancet” and by Paris “Figaro” Paris Academy dominated by agnostics and “free thinkers”; Academy Secretary refuses to publish paper; Delage writes to Secretary expressing his disgust, turns his attention to other interests, Vignon suffers nervous disposition as a result of Academy’s rebuff. Subsequently traveled, studying icons, identified features common to Shroud; Published 1938: “Holy Shroud of Turin: Science, Archaeology, History, Iconography, Logic” Paris Academy relents, awarded Vignon the French Academy Prize. It would seem that Paul Vignon was better informed 76 years ago than his amateur critics are today. Suggestion – Obtain a copy of Vignon’s 1938 publication, and then comment when adequately informed of his studies, in preference to whistling in the dark!.","date":"2014-05-16","mins":"4:33 am","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"}]
