[{"id":"comment-196969","author":"daveb_of_wellington_nz","post":"I cannot accept OK’s assertion that the gospels were set down as early as he says, nor in fact does mainstream New Testament scholarship. There are several arguments against it, but I shall attempt to confine my comments to a few brief remarks. It seems clear enough that Mark was the first of the gospels to be set down fairly close to its present form, although it seems the final original chapter may been lost and replaced by a later addition. Occasionally some have argued for a Matthean priority, but it seldom withstands scrutiny. Examining the common material in Matthew Mark & Luke, one finds a closer affinity between Matthew & Mark, and between Luke & Mark, than between Matthew and Luke, and this therefore argues for Marcan priority. There is additional common material found in Matthew and Luke, not found in Mark, and this has argued for an additional separate Q source. All four gospels closely follow the Marcan narrative of the passion death and resurrection, with only minor changes of some details, according to the specific author’s proclamation intent. Interestingly there is a concluding literary discrepancy between Matthew/Mark and Luke. Thus Matthew’s narrative begins at Bethlehem, (the Nazarene origins of Mary and Joseph seem unknown to him), and following Mark’s cue, the apostles are instructed to go to Galilee where Jesus will meet them there. Luke on the other hand knows of the Nazareth origins of the family, and has his own separate nativity narrative with a journey to Bethlehem. However Luke concludes his gospel by having the apostles remaining in Jerusalem. In Acts, Luke continues with his Jerusalem location, (literary continuity), the first half of the work being devoted to the Jerusalem church, and the second half on Paul’s mission to the gentiles. It concludes with Paul going to Rome, the centre of the empire, the centre of the world. Thus Luke’s mise en scene traverse is Nazareth – Jerusalem – Rome! The church is now “global”, has “arrived” and this makes for a satisfying conclusion. Luke is not interested in recording the death of either of his leading characters Paul or Peter, it is not part of his “proclamation” and its omission is a weak argument for assigning either Acts or Luke a prior date. Turning now to the Pauline epistles, it is evident that Paul devotes much focus to the tensions between the Jewish origin of the apostles and his own “subversively regarded” mission to the gentiles. The tensions between himself and Peter are recorded. Luke, companion of Paul, also devotes some attention to it in the Acts, such as at the Council in Jerusalem, and elsewhere. Luke has Peter seeing a large sheet descending from heaven with many “unclean” animals who he is instructed to eat, a partial resolution of this tension. However this tension is not reflected in the gospel accounts. The gentile church is fully established, Matthew’s gospel is clearly directed to a gentile community, probably Syrian, but perhaps not necessarily Antioch. His gospel is used in the Syrian church. We do not see the Jewish Gentile contentions evident in the Pauline epistles, nor in Luke’s Acts. The contentions are now in the past, and the church is essentially gentile. As early has his nativity account Matthew even has gentile wise men visit the infant in the manger. Contrast this with Luke’s Jewish shepherd visitors. It is reflected even in Matthew’s concluding discourse where the apostles are instructed to preach the gospel “to all nations”. I think all these are strong arguments for a relatively late compilation of the gospels. The actions and sayings of Jesus would have given rise to many oral traditions, and typical of such societies would soon have acquired a set form to be learned by rote by those trained to proclaim them. They would have soon been committed to writing. The distinctive pericope form of nearly all of the gospel narratives, clearly indicate that this would have been the case. Most of them are terse, brief episodic accounts of individual separate incidents, and are not in the form of a fully integrated continuous narrative. The various authors of the gospels would have assembled their sources, giving them a form and using them to express their own individual particular proclamation intent. Their integrity can be deduced by the relative consistency of the four separate accounts, and reliance on a social tradition well used to critical appraisal of formal oral recitation by rote. This last cannot be over emphasised, but is still evident in other present primal pre literate societies. It is not necessary to assert an earlier compilation into their present final form..","date":"2015-04-20","mins":"4:31 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-196983","author":"daveb_of_wellington_nz","post":"I dare say you’re entitled to an opinion of an earlier compilation, I don’t happen to agree with it, and modern New Testament scholarship rejects it. One does not have to resort to anti christian conspiracies to do so. I use several sources, one of them for instance is John Bowden former editor and managing director of the SCM Press, London, and he is hardly likely to be anti christian in sentiment. An article by Bowden I have before me, gives a date of authorship of Acts as “probably between 85 and 95 AD”, likely towards the end of Luke’s life. There are several significant omissions in Acts, so that of the deaths of Peter & Paul is hardly noteworthy. Apart from chapters 1 & 2, we hear nothing of what happened to most of the original apostles, even though there are many other traditions concerning them. We hear nothing of the Alexandrian church although it was clearly very healthy and significant, and there are only occasional references to the church in Antioch, although it became a principal early centre of christian scholarship. Nevertheless the tensions between the Jewish and Gentile wings of the early church are sufficiently memorable for Luke to draw attention to them in Acts, and are frequently evident in Paul. A further example of this tension might be seen in Luke’s mentioning the neglect of Hellenistic widows and orphans, necessitating the appointment of gentile deacons, as it seems the Jewish members were still not prepared to minister to them. So this attitude held sway for quite some time. When we come to the gospels, all of this seems very much in the past. Thus it is the specifically Jewish rejection of Christ which is at fault, whereas there seems to be an attempt to attenuate the fault of the gentile Roman authorities. Thus ‘Pilate knows that it out of jealousy that the chief priests had delivered Jesus and he seeks to free him’, possibly to be seen as the author’s attempt to minimise the true responsibility of imperial authority in the final condemnation, and to excuse it by placing the blame on the Jewish authorities. Further evidence is suggested in the destruction of the temple, omitted in earlier Mark, but which seems to have already happened “as prophesied” in the other three gospels, although perhaps it might not have been so difficult to foresee. With the expectation of an early Parousia, little point in committing the account to writing would be seen, as everything was soon to come to an end. When this didn’t happen and as the first witnesses passed on, this perception would clearly change, and the need for leaving a written record proclaiming Jesus as the Christ then became more compelling..","date":"2015-04-20","mins":"6:22 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-197023","author":"daveb_of_wellington_nz","post":"OK: The only argument you seem able to muster for a pre 70 AD compilation of the gospels is that the death of Peter and Paul are omitted in Luke’s book of the Acts. I have already given reasons why this is an inadequate argument. “The Gospels are stories about Jesus, not the problems (greater or smaller) of the early church.” Yes, but you’re not reading the sub text, and you are not applying any principles of form criticism. We could equally say that in Paul, his epistles are directed at admonishing his converts to follow the Christian way of life, yet the tensions between the Jewish and Hellenistic wings of the early church are very much to the forefront and are frequently mentioned, Luke recalling them in Acts. These tensions are clearly in the past when we come to the gospels, which are generally addressed to a fully Hellenised church. The consensus seems to be that Mark’s gospel was probably written between 64 70 AD. This is in agreement with a tradition that Mark wrote his gospel after the death of Peter. In Mk ch 13, Jesus foretells the destruction of the temple, but it still seems to be standing at the time of writing, and this leads on to a discussion of the end time when the Son of Man will come in glory. Matthew and Luke, depending as they do on Mark, were clearly written at a later time. Matthew’s “prophecy” of the destruction of the temple seems to already have occurred. The “abomination of desolation” is a phrase adopted from Daniel which refers to Antiochus Epiphanes erecting a statue of Zeus Olympus there, and is equated with a similar subsequent desecration of the temple by the Romans, which seems to have already occurred. I cannot see how you can call the Parousia a pseudo theory. If everything was going to come to an early end, there would seem to be little point in leaving any kind of early record for any posterity. Clearly when the Parousia did not happen as expected, this perception changed. The consensus of all main stream New Testament scholars is that the gospels of Matthew, Luke and John were all written at some time after 70 AD. Your hypothesis that they were set down before this time is singular to yourself and finds no good support from elsewhere. I suggest that the literate character of your modern western experience blinds you to the strength of oral traditions in pre literate societies, which traditions and pericopes formed the basis of the original gospel sources..","date":"2015-04-21","mins":"4:39 am","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-37118","author":"daveb_of_wellington_nz","post":"The obituary and memorial accounts in Dan’s last link above to the Amherst College Magazine make for very sad reading. Here was a man at the top of the game in College, a charismatic leader, capable of writing a 10 page thesis with citations in a single evening which his confreres struggled for a week to produce. He was at the top of his class in Symbolic Logic, a particularly difficult discipline. This was not enough for him and he was captured by the Timothy O’Leary ’60s drug scene, turned to the anti establishment hippie movement, advocated sex with young girls, and was eventually imprisoned on indecency charges. Perhaps his barely marginal involvement as a helper with STURP was prompted less by a generous volunteerism, than an unhealthy fascination with anything arcane. He would have been otherwise capable of truly great achievement. The cliche “How the mighty have fallen” is an aptly sad fit to the case. Achievement requires more than intellectual capability – a psychologically healthy outlook is essential. I recall just a few members of my ’60s classes who were destined to go much the same way..","date":"2013-06-15","mins":"4:51 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","title":"An Antonio Lombatti Poop Dump"},{"id":"comment-13337","author":"daveb_of_wellington_nz","post":"We’ve seen specialists who know everything about nothing. Here’s a generalist who seems to know nothing about everything!.","date":"2012-07-02","mins":"4:33 pm","url":"https://shroudstory.com/2012/07/02/this-is-really-just-a-lead-in-to-quoting-the-daily-mail-on-lombatti/","cat":"news_&_views","title":"This is really just a lead in to quoting the Daily Mail on Lombatti"},{"id":"comment-197086","author":"daveb_of_wellington_nz","post":"I am rather more informed on New Testament scholarship than you seem prepared to give me credit. But on the contrary, much of your argument seems to stem more from religious zeal than objective evidence. You are concerned that a later compilation of the gospels compromises the argument for their factual reliability, whereas their reliability easily rests on their mutual consistency and the strength and integrity of oral tradition in 1st century Middle Eastern cultures. It is not surprising that Matthew places the words of Daniel in the mouth of Jesus; Matthew’s detailed knowledge of the scriptures pervades his entire gospel. Your evaluation of the consensus of NT scholarship as worthless, is your own personal subjective judgement having no good standing, and as you say leaves you open to a charge of fanatacism rather than demonstrating objectivity. I have nothing more to say on the matter..","date":"2015-04-21","mins":"3:26 pm","url":"https://shroudstory.com/2015/04/02/alan-whanger-vs-hugh-farey-on-premier-christian-radio/","cat":"news_&_views","title":"Alan Whanger vs Hugh Farey on Premier Christian Radio"},{"id":"comment-15675","author":"daveb_of_wellington_nz","post":"Maya P: My comments relate to a specific particular movement “The Search for the Historical Jesus”. The so called Jesus seminar is one example of this, but it is way too reductionist in teh view of many scholars working i this field. To understand what I’m driving at, I’d refer you to such a work as “A Marginal Jew” by John P Meyer. He is extremely stringent in his choice of sources, and criteria. I have little doubt that Meyer would reject the Shroud as a primary source of information.","date":"2012-08-31","mins":"9:57 pm","url":"https://shroudstory.com/2012/08/26/barrie-schwortz-announces-latest-changes-to-the-shroud-of-turin-website-stera-inc/","cat":"news_&_views","title":"Barrie Schwortz Announces Latest Changes to the Shroud of Turin Website (STERA, Inc.)"},{"id":"comment-15510","author":"daveb_of_wellington_nz","post":"I thought Simon Joseph’s paper raises some interesting issues. Essentially he makes a plea for the Shroud to be more seriously considered by those involved in the movement, “Searching for the ‘Historical Jesus’ “. However the rigour demanded by historians demands that their sources are beyond reproach, and must be acceptable to their other colleagues working within this discipline. As yet, I think it is fair to say that the Shroud cannot qualify as being a legitimate historic document, despite all the advances made in Shroud research, although it might do at some time in the future. No historian is going to run the risk of compromising his reputation by using the Shroud as such a resource. It does not as yet meet the required criterion of rigour. Any historian using the Shroud as a source for his assertions, would be moving outside the limits imposed by the discipline. It can only be used in a conditional or possibly corroborative way, and then only with the required reservations, possibly to the point of ineffectiveness. There are also some technical issues in the paper which are questionable. The presence of Jerusalem aragonite limestone for instance, still remains an open question, despite the work of Kohlbeck & Nitowski, Simon Joseph also asserts the presence of both X & Y chromosomes despite the work of others that suggested that there were only XX chromosomes. This illustrates the danger of using the Shroud as a kind of document resource in historical work, when so many questions are still debated or questioned..","date":"2012-08-27","mins":"5:43 pm","url":"https://shroudstory.com/2012/08/26/barrie-schwortz-announces-latest-changes-to-the-shroud-of-turin-website-stera-inc/","cat":"news_&_views","title":"Barrie Schwortz Announces Latest Changes to the Shroud of Turin Website (STERA, Inc.)"},{"id":"comment-191581","author":"daveb_of_wellington_nz","post":"The sample is not representative and I would see little point in testing it. Until truly representative samples are taken complying with proper protocols, there is no point in testing pieces which might well be merely patches..","date":"2015-02-22","mins":"2:48 pm","url":"https://shroudstory.com/2015/02/22/bruno-barberis-interview-the-only-serious-and-honest-behavior/","cat":"news_&_views","title":"Bruno Barberis Interview: ‘The only serious and honest behavior’"},{"id":"comment-51841","author":"daveb_of_wellington_nz","post":"So here we have a linen cloth of exactly 8 x 2 Assyrian cubits, made according to the ancient extraction process of linen from flax, with pollens exclusive to the Dead Sea area, of Jerusalem flora flowering in March & April, and of Anatolia, with dirt on the feet and nose comprising Jerusalem aragonite limestone, with an image whose anatomical perfection is comprehensible not until the 20th century, with blood flows on the arms demonstrating the posture of crucifixion, and all consistent with the gospel accounts, and I’m expected to believe that some forger fabricated this wondrous icon for purposes which can only be guessed at, and that he only ever did it once, with no historical record of his attempts, and no present understanding of how he might have succeeded in this endeavour. Now I begin to understand the myth of the Tower of Babel. A babble of confusion in the face of arrogance, vanity and ignorance, as against what can plainly be seen by any child!.","date":"2013-11-17","mins":"11:36 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-96095","author":"daveb_of_wellington_nz","post":"I assume that Hugh is claiming that the variations in the quad mosaics are an inadequate argument for interweaving, and not that the assertion that there is interweaving is itself discredited. Or is he indeed claiming that interweaving is no longer tenable?.","date":"2014-04-03","mins":"5:36 am","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-11758","author":"daveb_of_wellington_nz","post":"Colin’s comments intrigued me, and so I went searching. A precis of Roger’s work on the question of vanillin content can be found at: http://www.tombofjesus.com/ARCHIVE/2007/survival/shroud of turin/Ray Rogers.pdf A few brief summaries from this precis: “Building on research by Stanley Kosiewicz, Rogers was able to produce a mathematical model to act as a chemical dating process. Kosiewicz had analysed the rates of vanillin loss from lignin at a variety of temperatures for over 2 years, and shown that loss rates of vanillin was very low.” As Colin points out, the rate of loss, being a chemical and not a radionuclide process is dependent on several environment factors. Roger’s math model showed the loss rate for 95% of vanillin in lignin was 1319 year at temp 25 C, but increased to 3095 years at 20 C, and so it’s apparent that the loss rate is very susceptible to temp variation. Rogers claimed that the fire of 1532 would not have affected the results much “as the cloth would not have absorbed much heat”. Rogers also stated that if the Shroud was created in 1260 AD then 37% of the vanillin would have remained in the cloth. No samples from any part of the shroud itself gave a positive result for any trace of vanillin. Regardless of the detailed figures, I believe that the key finding that there was no trace of vanillin, has surely to be significant. Yet Rogers claimed that vanillin and also significant cotton contamination was found in the sample swatch. If that is so, then that also has to be sgnificant. I delved further, and was rewarded with the discovery of a detailed paper, being a debate on this work: “Private Internet Debate Challenges Ray Rogers’ Thermochimica Acta Paper” – An exchange of views between Mark Antonacci and Dr. Thibault Heimburger. Http://www.shroud.com/pdfs/debate.pdf Paper was submitted for publication to Barrie Schworz some six weeks after Roger’s death, and Barrie obviously considered it bad form to allow it. However this is really an excellent detailed paper, and those at all interested in the topic should study it. Antonacci disputes Roger’s findings, and gives several criticisms against it. Interestingly, Antonacci maintains his belief that the Shroud is the authentic burial cloth of Rabbi Yeshua. Antonacci’s paper is then followed by a rebuttal from Thibault Heimburger, who I think does a reasonably competent job of countering many of Antonacci’s arguments. The debate is too long and detailed to summarise in brief, but both arguments should certainly be examined closely by anyone at all interested in the issues raised. The paper was ultimately posted on the Yahoo Shroud Science group by Giulio Fanti on May 11, 2005. Message to John Klotz, Yannick Clement, and Colin Berry: If you haven’t already done so, you all really need to peruse the Antonacci / Heimburger paper before commenting further on this topic. LOL daveb!.","date":"2012-05-31","mins":"8:20 pm","url":"https://shroudstory.com/2012/05/31/comment-promoted-ray-schneider-on-charles-freeman-sturp/","cat":"news_&_views","title":"Comment Promoted: Ray Schneider on Charles Freeman & STURP"},{"id":"comment-14229","author":"daveb_of_wellington_nz","post":"Here in the Antipodes, I don’t have the privilege or opportunity of a close personal acquaintance with Barrie. However with hope in my heart, I wrote to him concerning the Aragonite limestone studies, and was delighted to receive a personal detailed response. He was courteous enough to include the following postscript: “I was in New Zealand in 2005 but never got to Wellington. I spent all my time in Auckland as we put on a Shroud exhibit there. Of course, we did make a little side trip to Matamata to see the Lord of the Rings Hobbiton village! I sure love New Zealand! What a beautiful country.” What a delightful man!.","date":"2012-07-25","mins":"5:36 pm","url":"https://shroudstory.com/2012/07/24/barrie-schwortz-responds-to-colin-berrys-rude-criticisms/","cat":"news_&_views","title":"Barrie Schwortz responds to Colin Berry’s Rude Criticisms"},{"id":"comment-15732","author":"daveb_of_wellington_nz","post":"Davor: “In other words, is it not because Jones believes that ‘there is a deeper and darker dimension to these attacks on the Shroud and on Shroud pro authenticists?’ ” (Etc) “And he knows that ‘Therefore, according to Freeman’s presumed personal atheist/agnostic philosophy, Christianity must be false, supernatural miracles are impossible, and the Shroud of Turin must be a fake!’ ” I suspect that Davor is correct in this assessment. Any fair minded critique of Wilson deserves to be heard. However I would tend to concur with Jones’ general view that Freeman’s paper is not so fair minded. It is only too apparent I feel that Freeman’s agenda is suspect. I am not persuaded by Freeman’s arguments. It includes for example this type of circular reasoning (to precis): Early Byzantine art forms would not present a dead Christ (and so would not show blood stains for instance) Notwithstanding the apparent presence of Vignon markings on their images (icons and coins) showing Christ, he is shown as alive and triumphant, without blood stains; therefore the image on Shroud could not have been used as the model on their icons and coins. There is more that I am not satisfied with, for example that there were so many relics and imitations that there could have been no original model; that although the negative image clearly shows a dead Christ, this is not so apparent on the original cloth. I may attempt to address these after I have studied Freeman’s paper in more depth. I did not see in Freeman’s paper an attempt to address Jack Markwardt’s modification of Wilson’s hypothesis, that the Shroud was kept in Antioch until the the 6th century; nor Scavaone’s modification that it was kept in Besancon after being sent to Athens, rather than being held by the Knights Templar. Both of these hypotheses seem more credible than Wilson’s primary hypotheses. Despite Andrea’s claim that much other research had already been carried out in European countries, Ian Wilson deserves credit for reaching a wider public in English speaking countries, and making the Shroud of some topical interest in these countries. As far as I am aware his is one of the few attempts to vest the Shroud with some kind of historical provenance prior to the 14th century, and thus oblige a sceptical world to take it more seriously, than it had hitherto..","date":"2012-09-02","mins":"5:04 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15741","author":"daveb_of_wellington_nz","post":"I consider that Markwardt’s hypothesis has more going for it than Wilson’s theory that the Shroud went to Edessa in the 1st century, and was walled up there for 400 or so years. I’m surprised that from your point of view you don’t seem to think that that’s progress!.","date":"2012-09-02","mins":"5:47 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15698","author":"daveb_of_wellington_nz","post":"Stephen Jones’ egg on face unhorsing is an objective lesson in the dangers of without evidence impugning the character of those we may disagree with, regardless of whether their signatures are Charles Freeman, Ian Wilson, Giulio Fanti, daveb, DA, MPH, CB or YC. The argument is to be addressed not the character. Jones’ site is informative and he is a powerful advocate for the authenticity of the Shroud. However his credibililty has now been compromised by exposing a silly throwaway comment on Freeman’s character as basically unsubstantiated. Readers of his blog will now exercise greater caution in accepting what he asserts, regardless of its true value. There will be flow on negative effects. Bloggers on this site should take careful note, and desist from Ad hominem attacks, which in the long run will always be seen as failing to support their argument. Of course, substantive evidence of character deficiency might be another matter entirely, such as any proven evidence of corruption in carbon dating issues for instance. But if you’re going to attack character, you need to be on much stronger ground than is sometimes seen on this site, and you had better be right! You may have to eat your words!.","date":"2012-09-01","mins":"6:02 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15750","author":"daveb_of_wellington_nz","post":"Andrea N: “1) the Shroud was kept in Antioch: invented. 2) the shroud was in Athens: invented. 3) Was held by the Knights Templar: invented.” Jack Markwardt’s two papers on the Shroud in Antioch are: 1) “Antioch and the Shroud” presented at Dallas conference 1998, (modified in 1999) found at: http://www.shroud.com/pdfs/markward.pdf 2) “ANCIENT EDESSA AND THE SHROUD: HISTORY CONCEALED BY THE DISCIPLINE OF THE SECRET” presented at Ohio conference 2008 at: http://ohioshroudconference.com/papers/p02.pdf “The author’s 1999 hypothesis,that the Shroud was taken, in apostolic times,to the Syrian city of Antioch, concealed and lost in 362,rediscovered in ca. 530, and conveyed to Edessa when Antioch was destroyed in 540,is supported by historical records which evidence the presence of a Christ icon in both fourth century Syria and sixth century Antioch. In the fourth century, Athanasius, the Bishop of Alexandria (ca. 328 373), affirmed that a sacred Christ icon,traceable to Jerusalem and the year 68, was then present in Syria:” citations provided. Daniel Scavone’s paper “BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400” presented at Ohio conference 2008, at: http://ohioshroudconference.com/papers.htm; Scavone postulates that Othon de la Roche took the Shroud to Athens from Constantinople, and then consigned it to his home town of Besancon. Perhaps Andrea N would postulate that Constantinople was also “invented”. But curt dismissal does not create a cogent argument, nor is it a valid response! I know of no assertions that the Shroud was in Cabot, nor Cove, nor for that matter in Wellington NZ. Wilson’s hypothesis that the Knights Templar held it during the “missing years” was a brave attempt to explain its whereabouts during those years, but more effectively covered in Scavone’s paper. I find it remarkable that all these knowledgeable historians, while quick to dismiss genune attempts to discover the Shroud’s true history, can come up with no other meaningful explanations of their own. Perhaps they all think it’s a 14th century fraud!.","date":"2012-09-02","mins":"6:46 pm","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15766","author":"daveb_of_wellington_nz","post":"Yannick should ask himself why such a debate should occur outside the “pro Shroud world”. Would a non Shroudie ever support any constructive hypothesis that might validate the Shroud as auhentic? I think I shall wait for eternity before a non Shroudie “historian” ever comes up with any other kind of constructive hypothesis as to its history. They hide behind “maybe this”, “maybe that”, but as Wilson / Markwardt / Scavone are not part of their academic history establishment “they couldn’t possibly be right”. Or could they?.","date":"2012-09-03","mins":"12:23 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15773","author":"daveb_of_wellington_nz","post":"Thank you David Mo for your references to reviews of Mark Guscin’s book “The Image of Edessa”. I found them both interesting. To some extent I suppose the tone of the reviews was hardly surprising, given the two respective reviewers’ different predelictions. You may be aware that Averil Cameron has directly challenged Wilson on aspects of his hypotheses. Wilson’s response to her is detailed and comprehensive. It can be found in the Meacham archive: http://freepages.religions.rootsweb.ancestry.com/~wmeacham/. Select both and wilson2> for his complete response with citations and bibliographical references. I found Guscin’s concluding paragraph quoted in Wilson’s review of the book rather compelling: “…it should be stressed that there are no artistic representations of the Image of Edessa as a full body image or with bloodstains, and the majority of texts make no reference to either characteristic; but at the same time it is undeniable that at some point in the history of the Image of Edessa, some writers were convinced, for whatever reason, that it was indeed a full body image on a large cloth that had been folded over (possibly in such a way that only the face was visible), and that it did contain bloodstains.” No doubt it would not satisfy Professor Cameron. But then I suspect that nothing ever would, if it did not conform to her own predelictions!.","date":"2012-09-03","mins":"6:40 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-15774","author":"daveb_of_wellington_nz","post":"Error correction to files in meacham archive: “Select both ‘wilson1’ and ‘wilson2’ for his complete response with citations and bibliographical references.” [For some obscure wordpress reason, first file did not display. The main file is wilson1; The wilson2 file is merely an additional page with a few more citations.].","date":"2012-09-03","mins":"7:09 am","url":"https://shroudstory.com/2012/09/01/hat-trick-to-freeman-jones-unhorsed-too-bad/","cat":"other_blogs","title":"Hat trick to Freeman! Jones Unhorsed! Too Bad!"},{"id":"comment-142473","author":"daveb_of_wellington_nz","post":"An example of “Good Science” to whom 50% of the relic might be bestowed: Draw your conclusions from chief spokesman Oxford’s Professor Hall’s published statement: “There was a multi million pound business in making forgeries during the fourteenth century. Someone just got a bit of linen, faked it up and flogged it.” And article in Nature magazine under joint authorship of all 21 scientists who had participated in the C 14 testing: “… conclusive evidence that the linen of the Shroud is medieval”. So it is claimed that conclusive evidence on the whole artifact may be obtained from one unrepresentative sample taken from a soiled contaminated corner! But no other testing of the sample is to be permitted! And the world in general is expected to accept this as the epitome of good professional science! Twenty one scientists and three separate laboratories have so testified! It is only too evident why the Turin guardians and other Church authorities have been reluctant to permit direct access for any further testing. It is prudent to await some later date when Science might have achieved some internal self discipline, recognition of its own limitations, and further advances in testing may be more revelatory than can be achieved using methods currently available. The Catholic Church may be the legal owner of the relic, but it ought to recognise that it also has a custodial responsibility, not merely to Science interests, but to the broad spectrum of Christianity at large, and even to the world in general. A cavalier approach in disposing of the relic merely to suit casual disinterested curiosity could never be condoned. Meantime the excesses of pseudo science, poseurs working beyond their own limitations, and the doubts of skeptics, must needs be tolerated. But they need not be taken too seriously!.","date":"2014-08-05","mins":"4:30 pm","url":"https://shroudstory.com/2014/08/05/5050-colin-berrys-most-outlandish-proposal/","cat":"other_blogs","title":"50/50  :  Colin Berry’s Most Outlandish Proposal"},{"id":"comment-142567","author":"daveb_of_wellington_nz","post":"Colin, I think I can agree with about 70% of your comment. The general consensus was that Ray Rogers had no religious agenda, but came to his views on authenticity from his practice of Science. Some practitioners have concluded differently. His early supposition on the allegations of Marino and Benford was that it was fairyland woo woo but his investigation of the sample revealed good reasons why the C14 finding was suspect. All professions including scientists make their mistakes and this is part of the human condition. What caused Romans to turn into Italians? I should say 2000 years of history including invasions by Visigoths, Huns and Ostrogoths, more latterly the Austro Hungarians and Napoleon, concluding with the Nazi occupation..","date":"2014-08-06","mins":"6:22 am","url":"https://shroudstory.com/2014/08/05/5050-colin-berrys-most-outlandish-proposal/","cat":"other_blogs","title":"50/50  :  Colin Berry’s Most Outlandish Proposal"},{"id":"comment-142577","author":"daveb_of_wellington_nz","post":"There are degrees of doubt. Doubts for good reason are sound. Doubts for no good reason betrays a lack of confidence and inability to come to a decision. Doubts despite evidence may be irrational. Fence sitting provides a most uncomfortable seat and one is likely to fall off. Perhaps my initiating comment was more directed at “the excesses of pseudo science, poseurs working beyond their own limitations,” and irrational doubts, rather than doubts for good reason. But we’re blogging here, not creating doctoral theses..","date":"2014-08-06","mins":"7:20 am","url":"https://shroudstory.com/2014/08/05/5050-colin-berrys-most-outlandish-proposal/","cat":"other_blogs","title":"50/50  :  Colin Berry’s Most Outlandish Proposal"},{"id":"comment-21044","author":"daveb_of_wellington_nz","post":"I merely observed that Hugh would probably get comments about the chromophore beng in the impurity layer, and Yannick’s comments demonstrate that this was a correct prognostication. I also observed that De Liso obtained her best imaging results with an imbibition of the cloths. I do not expect that Colin wil ever be able to prove that the Shroud was produced by some kind of scorch. But at least both Colin and Hugh are conducting some experimentation, instead of merely relying on received wisdom. Who knows where such experiments may lead. As I’ve mentioned elsewhere, Science history is full of examples where experimentation produced unexpected results when the experimenters were looking for something entirely different..","date":"2012-12-23","mins":"10:14 pm","url":"https://shroudstory.com/2012/12/22/a-note-to-thibault-heimburger-from-colin-berry/","cat":"uncategorized","title":"A note to Thibault Heimburger from Colin Berry?"},{"id":"comment-146774","author":"daveb_of_wellington_nz","post":"I wonder if I would be guessing right that the greatest number of visitors to Colin’s site do so because they’ve read a posting here or linked to it from Dan’s Shroudstory site. Is anyone else out there interested in what he’s doing? Sometimes he comes up with some fascinating stuff. But is anyone else out there listening? He’s getting free publicity from here. Maybe he shouldn’t knock it!.","date":"2014-08-28","mins":"8:02 am","url":"https://shroudstory.com/2014/08/28/a-response-to-a-comment-by-colin-berry/","cat":"uncategorized","title":"A Response to a Comment by Colin Berry"},{"id":"comment-20976","author":"daveb_of_wellington_nz","post":"Hugh, If any others are watching, I think you may well get comments about the chromophore on the Shroud cloth being suspected as being in an impurity layer produced by the manufacturing process and not on the fibils themselves, as apparently asserted by Ray Rogers. If you’re planning to advance your experiments further, I suggest you might like to investigate this aspect further. I know that De Liso with her seismic / radon experiments obtained her best results when she imbibed her cloths with a solution of myrrh and aloes, but myrrh is fairly expensive stuff. Concerning the banding effects from photo compressing:. I don’t use i Photo mentioned on Colin’s site, so don’t know its capabilities, but I do quite a lot of scanning from various published photos. Scanning from published photos usually results in a similar banding effect. I find I can usually eliminate the banding using my photo editing software – Photo Impact. Photo Impact has a Blurring tool and also a Focus tool which I find usually eliminate the banding effect and enhances the clarity. Other editing software could well have similar tools.","date":"2012-12-22","mins":"3:00 pm","url":"https://shroudstory.com/2012/12/22/a-note-to-thibault-heimburger-from-colin-berry/","cat":"uncategorized","title":"A note to Thibault Heimburger from Colin Berry?"},{"id":"comment-200615","author":"daveb_of_wellington_nz","post":"Not too difficult to be so wise some 40 years after the event. In 1978, there was a strong lobby that believed it was a painting, and so it had to be addressed. Nevertheless Mc Crone held to that belief to his dying day, and we’ve now seen more recent versions of the same old story with CF’s flaky paint idea. There will never be another STURP, the Italians have seen to that, with their own peculiar agendas. Unlike the Americans, I’m unaware that any of them have been involved in any cutting edge space exploration or atomic energy advances. We did have some Italian engineers out here back in the 1970s building railway viaducts and tunnels, which happened to involve a launching girder collapse, and a few other mishaps..","date":"2015-05-30","mins":"3:38 pm","url":"https://shroudstory.com/2015/05/30/colin-berry-on-sturp/","cat":"other_blogs","title":"Colin Berry on STURP"},{"id":"comment-24279","author":"daveb_of_wellington_nz","post":"I had assumed that Dan’s heading might have been connected to a comment I’d made on his posting of Jan 12: “Stop taking cudgels to each other?” – It was a very thoughtful piece uplifted from Colin’s site. I’d commented: “This looks like a welcome peace offering from Colin. I think it is thoughtful and well written. However, let us not forget that Colin’s web site seems to be agenda driven, with its heading “The Turin Shroud: but for the pseudo science it might have been dismissed long ago as a medieval fake” Contrast this with the more circumspect heading on Dan’s site intro – “Is the Shroud real? Probably.” Colin would win more friends if he was less provocative as to his intentions, and could demonstrate a modicum of open mindedness about even the possibility of authenticity. However I particularly like the point he makes about “known unknowns” and “unknown unknowns” – for I suspect there are many such. In the meantime “Peace!” and let us hope that it is more than just a “Cease fire!” ” Long may it continue! And of course Colin has now removed his agenda driven heading! Does this make the agenda les transparent? I wonder..","date":"2013-02-14","mins":"4:10 pm","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","title":"Colin Berry takes advice from daveb"},{"id":"comment-24335","author":"daveb_of_wellington_nz","post":"It’s your site, so it’s your call. And I agree there’s a lot of pseudo science out there. If I may paraphrase what Max Patrick Hamon has mentioned from time to time, the Shroud is not merely the most studied ancient object in history, it’s also the most badly studied. But bear in mind, that those striving to penetrate its mystery are not so very different from yourself, voluntary enthusiasts mainly, some perhaps with an agenda, some with a pet theory, some just merely hoping to discover something new. There are no large chemical or drug corporates behind it funding the research to discover a new product to sell, not even a formal research foundation nor a University looking for a doctoral thesis. Mainly just amateurs, mostly with a professional background, perhaps a spare time or voluntary retirement project. This constrains what can be done. A hard line has only paid off occasionally in the history of scientific research. More often the answer has been found in some kind of serendipitous synthesis of ideas. Of one thing I am certain: That a closed mind and uncompromising pre judgements have no place in a spirit of true and honest scientific enquiry. That way leads to failure and inevitably to bitter disappointment!.","date":"2013-02-15","mins":"3:43 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","title":"Colin Berry takes advice from daveb"},{"id":"comment-24353","author":"daveb_of_wellington_nz","post":"I see nothing wrong with taking a hard line against any kind of Pseudo science. But in that case, one’s own work needs to be beyond reproach. My own comments on various postings on the Siefker & Spicer so called Critical Review are a matter of record. Robert W. Siefker, M Th, KHS, KC, retired engineer; Daniel S. Spicer, Ph.D, KHS, KC, Professor of physics. I would have respect for Professor Spicer’s Ph D, presumably in Physics. M.Th. I take to be a university qualification in Theology, The KHS & KC are unknown to me, but perhaps it is possible they may be Air Force qualifications. But if any comparisons are to be made with the best research work that has been carried out on the Shroud, I doubt if these two gentlemen would be prominent in my short list. Some excellent research has been carried out, mainly in the fields of pathology and forensics, now somewhat ancient history. That is why I think that any programme aimed at demonstrating that the Shroud is a man made artifact using a type of metal template is doomed to failure. It can only have value as a type of personal entertainment. However, if you are able to show that the image was indeed created by some type of scorch like mechanism, then it could not have been a naturalistic phenomenon, and in view of the forensics, you are then left with seeking an explanation of how an uncorrupted corpse could have brought this about..","date":"2013-02-15","mins":"7:14 am","url":"https://shroudstory.com/2013/02/14/colin-berry-takes-advice-from-daveb/","cat":"other_blogs","title":"Colin Berry takes advice from daveb"},{"id":"comment-47792","author":"daveb_of_wellington_nz","post":"Margaret de Charney passed the Shroud across to the House of Savoy in 1453. It was housed in the newly built Sainte Chapelle 1502. It was installed in a “magnificent silver casket” commissioned by the Dowager Duchess of Savoy, Margaret of Austria in 1509. The fire of 1532 was some mere 23 years later. The circumstances are set out in a book by Abbe Bouchage, and was published in 1891 (prior to Pia’s photos of 1898). The report of the Poor Clare nuns is included in the book, and can be found as a Secured PDF on an Italian shroud web site at: http://www.shroud.it/CLARES.PDF The question of symmetry on the TS is a non problem, it merely results from the symetrical way it was folded. The burn marks are not identical, but are progressive through the layers of the folds. A simple “thought experiment” involving an A4 sheet of paper sliced to correct proportions ought to provide a quick answer satisfying even a ‘rational’ skeptic. A similar explanation is adequate for other symetries such as the “poker holes” and its use as a frontal and dorsal burial cloth over the head..","date":"2013-10-17","mins":"3:31 pm","url":"https://shroudstory.com/2013/10/17/colin-berry-the-1532-fire-was-no-accident/","cat":"other_blogs","title":"Colin Berry: The 1532 fire  was no accident"},{"id":"comment-20733","author":"daveb_of_wellington_nz","post":"I don’t believe it’s a scorch either, but I’d have to agree with Hugh, that superficially it looks like a scorch. There are several problems with Colin’s scorch theory: (a) I can’t see that the TS can be a forgery – there’s too much evidence against it, particularly the forensics; (b) I can’t buy the construction of a conforming template – it’s against all artiistic conventions and the template would be more imposing than the mere image (c) the lack of superficiality of images produced by a scorch. As Colin would have it, I’m trusting my instincts here. However the history of Science is full of examples of serendipitous discoveries; We pursue one single idea which doesn’t work no matter how hard we try, and then out from the sky drops something new and unexpected, an accidental result that we hadn’t expected, or suddenly a new idea which changes our perspective entirely, and another insight is gained. The discussion on fluorescence might hint at some such possibility. I wish Colin well in his kitchen science endeavours. Who knows where they may lead! I don’t believe he’ll be successful in the way that he expects, but yet who knows what unexpected result he may obtain. But he’ll have to be open minded enough to be able to recognise it when the unexpected does occur! It may yet shed further light on some elemental fact on how the image was actually imprinted – Or possibly not as the case may be!.","date":"2012-12-19","mins":"3:14 pm","url":"https://shroudstory.com/2012/12/19/colin-berrys-christmas-present/","cat":"uncategorized","title":"Colin Berry’s Christmas Present"},{"id":"comment-50609","author":"daveb_of_wellington_nz","post":"I’ve been out of circulation the last few days, but the antibiotics and steroids are now starting to kick in, and I’m hopeful of slipping back into recovery mode. As a frequent user of food, and living in a country whose food production is a mainstay of its economy, I was fascinated with some of Colin’s research projects. My maternal side has been afflicted with gall bladder problems, and my dad had a serious case of diverticulitis, both ailments featuring in Colin’s CV. But what really attracted my attention is that Colin is one of the few research scientists I’ve come across who would seem to have had liberal hands on experience with lab rats. I’m just a little disappointed that he hasn’t extended that to some real pioneering Shroud research. He could put Ray Roger’s theories to a genuine crucible test, wrapping up traumatised dead rats in all sorts of linen cloths treated in a variety of ways, holding them under various conditions of temperature, humidity and exposure to light. He could then say, “Look, I’ve tried it, it doesn’t work, Rogers was wrong!” “Or not, …” (as the case might be). One ought not to presume the outcome of an untried experiment, simply because of one’s preferred position or opinion in such matters. Giovanna De Liso experimented for some 12 years in Piedmont, examining seismic effects on Shroud like images, but only used a dead snake and a metallic object. Rats are at least mammalian!.","date":"2013-11-10","mins":"4:38 am","url":"https://shroudstory.com/2013/11/09/colin-berrys-credentials/","cat":"other_blogs","title":"Colin Berry’s Credentials"},{"id":"comment-16757","author":"daveb_of_wellington_nz","post":"It’s good to lighten up occasionally, and Colin’s wit makes a welcome change from the pompous turgid material we see too often from some other contributors. Has he enquired into obtaining a second hand high school lab microscope? That would seem to fit his specification!.","date":"2012-09-22","mins":"4:09 pm","url":"https://shroudstory.com/2012/09/22/laugh-for-today-beery-colins-latest/","cat":"other_blogs","title":"Laugh for Today: Beery Colin’s Latest"},{"id":"comment-9418","author":"daveb_of_wellington_nz","post":"Gabriel, Thanks for the catch up ref re neutrinos, I’ll follow it up (“… may very well …” = I was leaving it open either way). I’m well aware of the dual nature of light, thank you very much. Purpose of the litany was to make the point that even great achievers are not infallible, particularly when obsessed. By the way, how’s Schrodinger’s cat? I think I may have an explanation why the discussion re “scorching” has been going absolutely nowhere for some little time now. I thought it seemed I recognised the symptoms from some undergraduate reading many long years ago. I searched my Encyc Brit on “Freud” and “projection” – came up with this set of extracts: 1 “Defense Mechanism – in psychoanalytic theory, any of a group of mental processes that enables the mind to reach compromise solutions to problems that it is unable to resolve. The process is usually unconscious, and the compromise generally involves concealing from oneself internal drives or feelings that threaten to lower self esteem or provoke anxiety.” 2 “Projection is a form of defense in which unwanted feelings are displaced onto another person, where they then appear as a threat from the external world. A common form of projection occurs when an individual, threatened by his own angry feelings, accuses another of harbouring hostile thoughts.” 3 “Denial is the conscious refusal to perceive that painful facts exist. … ” 4 “Rationalization is the substitution of a safe and reasonable explanation for the true (but threatening) cause of behaviour.” I should also add that the extract has this rider: “…defensive activity is in itself considered no sign of pathology.” There is nothing ad hom intended about this, it is after all a reputable source. It’s just that I for one am getting just a little bit tired of so much circular argumentation, when I would prefer some genuine enlightenment for a pleasant change, my main purpose in visiting this site..","date":"2012-03-18","mins":"6:53 am","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","title":"Welcome to Colin Berry’s new Straw Shedder blog"},{"id":"comment-9429","author":"daveb_of_wellington_nz","post":"Gabriel, I checked out the CERN site on speed of neutrinos, and sure a rerun showed them travelling more sedately, and they’re looking at a faulty connection. However a follow up showed that there was also another problem which may have biased the results the other way. I guess “Watch their space” for further developments. Your comments on C14 dating, seem to overlook the important aspect of a poor sample; It seems that few are taking a conspiracy theory seriously, and the dating might not be too far out as far as the sample goes. The variation in vanillin content between sample and parent material is surely significant, together with excessive cotton contamination of the sample, Result = GIGO! but I take your point that C14 testing may not be applicable to testing of ancient linens for a whole variety of reasons. The dogmatic assertions made by supporters of the 1988 C14 tests contrasts sharply with the more enlightened approach taken by CERN in respect of neutrino speed: “The evidence is beginning to point towards the OPERA result being an artifact of the measurement,” said CERN Research Director Sergio Bertolucci in a statement today. However, to be rigorous about the matter, the laboratories plan to rerun the experiment in May and cross check it with data involving cosmic ray particles. “Whatever the result, the OPERA experiment has behaved with perfect scientific integrity in opening their measurement to broad scrutiny, and inviting independent measurements,” Bertolucci said. “This is how science works.” I particularly like Signor Bertolucci’s final comment: “This is how science works.” Maybe someone should tell the C14 labs!.","date":"2012-03-18","mins":"5:51 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","title":"Welcome to Colin Berry’s new Straw Shedder blog"},{"id":"comment-15914","author":"daveb_of_wellington_nz","post":"Although Collin is playing true to form in his usual vein of mockery, a more tasteful brand of humour would be no bad thing to see more of on this blog site. It would make a welcome change from the unduly prolix verbosity of self importance and carping that we too frequently see here..","date":"2012-09-05","mins":"11:50 pm","url":"https://shroudstory.com/2012/09/05/laugh-for-today-colin-berrys-latest-idea/","cat":"other_blogs","title":"Laugh for Today: Colin Berry’s Latest Idea"},{"id":"comment-21504","author":"daveb_of_wellington_nz","post":"Just watched the video. Brilliant 23 minute video on Shroud of Turin, by teenager Bailey Packard, in search of evidence for the Resurrection. Good objective reporting, some fascinating animations of classic art pictures, well presented, good close ups of Shroud details, science reasonably adequate, with only a little speculation. We need more teenagers like her! Note Consultants included Barrie Schwortz!.","date":"2013-01-02","mins":"7:27 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-9426","author":"daveb_of_wellington_nz","post":"I believe that a reputable authority such as Encyclopaedia Britannica would not indulge in “psychobabble”, but qualifies its remarks quite clearly “… in psychoanalytic theory …” Colin seems to think it’s ad hom argument; Strange, I didn’t say as to where or to whom it might apply. I’m quite capable of recognising how recourse to “defence mechanisms” might very well apply to myself in certain stressful situations. Let those who can read, judge for themselves how it might apply elsewhere! Agreed that the King George positive image is indeed very clear. I wonder to what depth the original negative penetrated? But that’s not stated! As I mentioned previously, I’d prefer to see a move onto some other more enlightening topics for a change, rather than giving any further traction to this scorching hypothesis, which seems to be going nowhere..","date":"2012-03-18","mins":"4:04 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","title":"Welcome to Colin Berry’s new Straw Shedder blog"},{"id":"comment-21545","author":"daveb_of_wellington_nz","post":"Intersting comment by Max re Augustine’s interpretation of John 20:9, which seems at vairance with the common, but possibly mistaken view that from that moment John believed in the Resurrection, However, I think it possible that either view may be tenable i.e. ‘either he now believed the women, or he believed in the Resurrection’. Jerusalem Bible (English translation from French text of JB) has an interesting translation of succeeding v.10: “Till this moment (c.f. ‘as yet’) they had failed to understand the teaching of scripture, that he must rise from the dead.” ‘Till this moment’ suggests that from that moment they did believe in the Resurrection. However we are talking about the merits of a video compiled by a reasonably well informed teen ager, not discussing a thesis by a Stage III Religious Studies student, and the video is well done and a marvellous effort. Re the Meacham URL quoted by Max, I went looking for it but the page has since been removed. Concernng his oft repeated assertion that the body of Jesus was honoured by some kind of special ritual, and that the evangelist or disciple John was actualy Lazarus revived, I think I would invoke J P Meier’s criterion: “What can be gratuitously asserted can be gratuitously denied.” Max may believe these to be the case, but I see no solid grounds for either assertion – they remain merely some interesting speculations,.","date":"2013-01-03","mins":"3:04 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-21498","author":"daveb_of_wellington_nz","post":"Yannick, If you didn’t want to try it with the family cat, you could maybe hunt out a few mink, beaver, even a fox or two or possibly a lynx, from up Ungava way. ; )).","date":"2013-01-02","mins":"6:43 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-21551","author":"daveb_of_wellington_nz","post":"Further comment to mine above re Augustine’s exegesis of John 20:9: Augustine did not know about the image on the burial cloths – he has been quoted as saying that no one knew the physical appearance of Jesus. A more comprehensive expansion of the text [Jn 20:5 9] follows, and may give yet another perspective: [USCCB translation]: “5. He bent down and saw the burial cloths there, but did not go in. 6 When Simon Peter arrived after him, he went into the tomb and saw the burial cloths* there, 7 and the cloth that had covered his head, not with the burial cloths but rolled up in a separate place. 8 Then the other disciple also went in, the one who had arrived at the tomb first, and he saw and believed. 9 For they did not yet understand the scripture that he had to rise from the dead” If at this time, the image had fully developed and was then visible (which could be arguable if the imaging process was better understood), then the sight of the image would certainly cause the disciple to wonder, and come to some understanding of the meaning of “rising from the dead”. This view is of course part of Wesselow’s thesis. For general information, the USCCB text can be found at: http://www.usccb.org/bible/john/20 Those interested in making a point that it was women who first discovered the empty tomb, might be more intrigued by Augustine’s exegesis of v.9..","date":"2013-01-03","mins":"4:31 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-9406","author":"daveb_of_wellington_nz","post":"Like a mini version of The Terminator, “He’s back!!” A sad case, but not the first brilliant scientist with major achievements to his credit, who through obsession screws up in other research. We only remember their successes, and overlook their failures. 1) Aristotle’s Biology became a classic which survived into the European Enightenment, but he screwed up badly in his Physics. 2) Robert Hooke, devised many inventions and devices for the Royal Society, including his invention of the microscope, but refused to accept Newton’s Theory of Light, and persisted in his belief that colours arose from a mixture of Darkness and Light. 3) Johannes Kepler who first postulated the elliptic orbit of Mars, believed that the space between the planets was comprised of Platonic polyhedra. 4) Galileo Galilei was unwilling to accept Kepler’s elliptic orbits, and preferred to maintain a Platonic ideal of circular motion for the planets and moon. 5) Isaac Newton spent much of his final years in pursuing the mystical notions of Hermetic philosophy, and despite his universal renown, quarreled with everybody, including tearing out several pages from his Prinicipia which referred to John Flamsteed’s work. 6) Few scientists in the 17th c would accept the pioneering work of Niklaus Steno in geology, but preferred to believe that fossil shells either grew in the parent rock or were the remnants of the Noachian flood. 7) Huygen’s theory of light as a wave gave way to Newton’s theory that light was comprised of corpuscles. When Thomas Young’s experiments with interference patterns demonstrated that light was indeed a wave there was an outcry from scientists in Britain offended that their hero was being challenged. It was left to the European Fresnel to develop the wave theory of light. Even so the wave character of light must have been evident to Newton from his light rings observable during lens grinding and the fringe patterns at the edges of his prism colours. 9) Despite chemists working on the hypothesis of an atomic theory for some 100 years, Ernst Mach would not accept Boltzmann’s atomic theory working from statistical mechanics, declaring as late as 1905 that he did not believe in atoms which were merely conjectural. Mach’s influence with the European academies resulted in Boltzmann committing suicide. 10) Albert Einstein could not accept the random behaviour of quanta, and spent the last years of his life fruitlessly searching for underlying variables that did not exist. 11) Einstein had demonstrated that no object with mass could exceed the speed of light, as otherwise the mass would become infinite. Recent LHC work indicates that neutrinos may very well exceed the speed of light. All these men had remarkable scientific achievements to their credit, yet they were clearly not infallible, and their obsession with some pet theory would sometimes lead them well astray and off the mark. We need to remember this when faced with unsupported narrowly focused pontifications from a scientist with much to his credit, and whose principal defence appears to accuse his opposition of pseudo science, or of claims of personal ad hom arguments. With so much unknown about the origins of the Shroud image, it is unfortunate that so much effort is being expended on a lame duck theory, when there may well be more fruitful lines of enquiry to pursue..","date":"2012-03-17","mins":"5:45 pm","url":"https://shroudstory.com/2012/03/17/welcome-to-colin-berrys-new-straw-shedder-blog/","cat":"other_blogs","title":"Welcome to Colin Berry’s new Straw Shedder blog"},{"id":"comment-21729","author":"daveb_of_wellington_nz","post":"Max, you have misunderstood my meaning and unduly taken offence when none was intended. The video by Bailey Packard is in my view an excellent effort for a person of her tender years. But one ought not to subject it to the same degree of criticism as one might to a senior student specialising in RS. The points you made might well be valid if her work merited judgment by this more severe criterion. I was certainly not making any comparison with your own comments as that of an under graduate, if that was the meaning you wrongly assumed..","date":"2013-01-07","mins":"10:31 pm","url":"https://shroudstory.com/2013/01/02/david-rolfe-some-hip-dude-in-england/","cat":"other_blogs","title":"David Rolfe, some hip dude in England"},{"id":"comment-43599","author":"daveb_of_wellington_nz","post":"I could agree that there ought to be scope for both Christians and Jews to come to a type of common understanding about Jesus, but there would always be areas of disagreement. I believe there would be very little evidence for Jesus seeking to remove the yoke of the Romans from the Jewish people. There was a yoke, but I believe he saw it being imposed more by the Jewish authorities, Pharisaic Laws and the Saducees, rather than the Romans. An objective view of history might come to the conclusion that the Jewish people never had it so good under the peace inaugurated by Octavian Augustus, and even the Idumean Herods were great benefactors, and relatively benign, despite the gospel accounts and the aversion of the Jews to their Edomite governance. The gospels seem to reflect an expectation that the Messiah would be some kind of political liberator, but nowhere is that apparent in Jesus’ life mission. The political reality of the Jews, sandwiched between the Romans and the Persians or Parthians, would make any prospect of their being any kind of a buffer state unrealistic, and the Romans were by far the best choice of any options they had. The rebellions commencing about 66 AD, eventually proved disastrous. If there is to be any kind of acceptance of Jesus within the Jewish tradition, it must I think be seen in his prophetic role within the tradition of the later prophets, in proclaiming an option for the poor, the underprivileged in his demands for justice, and his condemnation of immorality. It is consistent with and echoes such calls as those of Amos, Micah and Malachi. Jesus’ condemnation of the Pharisees and Saducees, as a “brood of vipers” and “hypocrites” is foreshadowed by their somewhat similar condemnations. John Dominic Crossan’s “Power of Parable” provides some fascinating insights into what appears to be a double edged sword of Jesus’ message, a theme in Rabbi Boteach’s work. Thus early in Matthew’s gospel he condemns slandering and abuse of others, yet later he fulminates against the authorities with his “hypocrites” and “brood of vipers”. A further aspect mentioned by Crossan is that the Synoptics, particularly Gentile Luke, paint Jesus as the victim of the Jews, with their saying “His blood be on us and upon our children”, which has provided unjust rationalisation of historical anti semitism. However in John’s gospel, Jesus is not the victim, but is the one in control of his situation. The decisions are his, even the choice of his moment of death. His answer to the question of the temple tribute to “Render unto Caesar” doen not betoken a political liberator. But he clearly intended to be the liberator of those who were in fact heavily burdened, and had little interest in the misplaced Jewish nationalism of that time!.","date":"2013-09-10","mins":"7:39 am","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article"},{"id":"comment-11787","author":"daveb_of_wellington_nz","post":"CB: “I may be mistaken, but I get the impression that Ray Rogers was very much his own man – and not given to consulting with specialists in his own or related areas.” It has been a common enough complaint, even among the very best scientists: Isaac Newton, Pierre de Fermat, Carl Friedrich Gauss. All of them were secretive in much of their work, and often reluctant to publish. Newton completed his best work during his house confinement during the Black Plague in Oxford, withholding his discovery of the calculus until after Leibniz had already published; Fermat was prone to announcing his discoveries without proof nor documentation, challenging others to replicate them, Gauss was aloof and reclusive, often not publishing his best work e.g. Writing to Bolyai, that he had already made those geometrical discoveries and Bolyai still had two thirds of the work required to complete – this was typical of Gauss; Many of Gauss’s discoveries were only revealed in note form after his death. Establishment of the Royal Society in England and the Academy of Science in France, both in the latter 17th century, was a watershed in scientific development. However science in general remained the poor relation of academia until the middle of the 19th century with the first developments in heavy industry and technology. As Corporates and Nationals became more involved during the 20th century, the scope for individual pioneering work seems to have become more constrained with increasing demands for rigour and peer review. Research was directed at those areas where a profit might be made, or where national interests might best be served. There is little monetary gain to be obtained in researching the sindon, and much of the work seems to have been carried out on a volunteer basis by passionate individuals who were drawn into its mysteries. Hence the work is vulnerable to criticism by those whose vocations and career experience have allowed them to draw on more generous funding and resources where high standards of scientific achievement have been demanded. I get the impression that Ray Rogers very likely carried out much of his work alone, and this was probably the result of his choice of subject. In any pioneering work, there has to be trade offs between quantity and quality – and in the area of undiscovered country, quantity has to be a strong temptation. I understand there remain as yet some eight or so unopened crates held by STURP, containing as yet unknown further results of Roger’s work on the Shroud. Whereas Antonacci has made severe, possibly valid, criticisms of Roger’s claims on inferences from the vanillin content or its absence, Heimburger’s response to those criticisms also needs to be acknowledged. The vanillin content and cotton contamination of the C14 sample swatch is surely significant, in relation to the absence of both in the main cloth. Heimburger’s comments on Mme Flury Lemburg’s limited understanding of the Shroud and its complexity as at 1988 has also to be noted, as also his comments on the capabilities of medieval “invisible repair” work. It is evident that there is yet a long way to go in Shroud research, but this will require a level of funding that may be difficult to access, and also a change in the understandably protective attitude of their artifact by the relevant church authorities. I wonder indeed if it’s ever likely to happen!.","date":"2012-06-01","mins":"8:29 pm","url":"https://shroudstory.com/2012/05/31/comment-promoted-ray-schneider-on-charles-freeman-sturp/","cat":"news_&_views","title":"Comment Promoted: Ray Schneider on Charles Freeman & STURP"},{"id":"comment-57497","author":"daveb_of_wellington_nz","post":"I can’t agree with Matthias, that the wound is on the back of the hand. Go to Shroudscope, choose Enrie Negative Vertical, centre on the wound, and zoom up close. Remember that you’re looking at the left hand, and you’ll see that the blood mark is centred on the narrowest part of the arm, i.e. At the wrist. If you see something different, then it’s not what I see. Look at the shape of the back of your left hand, and then compare it with the outline of the TS wrist and hand..","date":"2013-12-09","mins":"8:09 pm","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","title":"Barbet vs Zugibe"},{"id":"comment-57602","author":"daveb_of_wellington_nz","post":"Nuns in 1534 would not have had the advantage of the Enrie negatives. Nor unlike Pierre Barbet & Frederick Zugibe would they have the advantage of 20th century forensic pathology. Despite Zugibe’s disagreement with Barbet on the entry point of the nail wound, he still seemed to accept the exit point fairly close to the wrist. He illustrates this showing a needle through the hand of a stabbing victim, the exit point certainly close to the base of the hand, and pretty well at the wrist. Other pathologists, Willis & Bucklin seemed to agree with Barbet on the matter, exit point at the wrist. Zugibe’s theories on the nail not completely through the wrist relies entirely on his assertion that adequate support at the feet would relieve the tension in the arms. Arm tension would be 207 lbs without any support at the feet. This tension would tear through the palms, unless it was taken by the carpal bones. Zugibe claimed that foot support would reduce the tension to only 67 lbs. Doing the statics, Zugibe is therefore saying that the arm tension is only taking 56 lbs maximum of the vertical weight of 176 lbs, and that 119 lbs minimum are being taken by the single nail through the feet. I’m inclined to doubt that this scenario is credible. I rather suspect that efficiently minded Roman soldiers had better ideas on what would be effective..","date":"2013-12-10","mins":"5:50 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","title":"Barbet vs Zugibe"},{"id":"comment-43208","author":"daveb_of_wellington_nz","post":"You can find a paper by Frederick Zugibe where he sets out to criticise Pierre Barbet’s theories as to the cause of death of the TSM. Zugibe’s paper itself has also been subject to criticism by other pathologists. This type of controversy is merely one example of just how little that is certainly and definitely known about several scientific aspects of the Shroud, when there is even disagreement among acknowledged experts working in their various fields. Http://www.crucifixion shroud.com/experimental studies in crucifix.htm.","date":"2013-09-07","mins":"7:17 pm","url":"https://shroudstory.com/2013/09/07/rest-in-peace-dr-frederick-zugibe-1928-2013/","cat":"news_&_views","title":"Rest in Peace  Dr. Frederick Zugibe (1928-2013)"},{"id":"comment-43220","author":"daveb_of_wellington_nz","post":"But, if experts fail to agree on important details, tehn they must fail to persuade in a convincing way!.","date":"2013-09-07","mins":"9:09 pm","url":"https://shroudstory.com/2013/09/07/rest-in-peace-dr-frederick-zugibe-1928-2013/","cat":"news_&_views","title":"Rest in Peace  Dr. Frederick Zugibe (1928-2013)"},{"id":"comment-59516","author":"daveb_of_wellington_nz","post":"I think I may have come up with a strong argument supporting wrist nailing: The crucifarius was required to carry his “cross” to the place of execution. This could only have been the patibulum, maybe about the size of a timber rail road sleeper. This is feasible for your average rail road man. The complete cross with upright would be far too heavy to be feasible for him to carry. It implies that the upright (stipes) was already in position securely in the ground. If it wasn’t already in the ground, but joined to the patibulum at the site, and the crucifarius nailed hands and feet while lying down, this is far too much work for the execution party to lift the body and cross complete into the hole, and is inefficient. It implies that the hands only were nailed to the patibulum with the crucifarius being held lying down. The patibulum with the crucifarius suspended from it, is then easily lifted onto the stipes. Now at this stage, the full weight of the body drops suspended by the hands, and the full arm tension of 207lbs has to be taken by the hands. It is necessary that the hands take the full arm tension during this process, and this can only be done if the wrists are nailed so that wrist bones can take the tension. With the patibulum now in position on the stipes, the feet can then be nailed onto the stipes with however many nails it takes. It is only then that the arm tension can be relieved by transferring some of the weight onto the feet. The only other way it can be done is if two of the execution party take the weight of the body until the feet are nailed. This is extra work, and I have more confidence in the efficiency of Roman soldiery. Where Zugibe’s theory fails, is that he had a ready made cross for his volunteers to mount. He did not simulate an actual crucifying scenario..","date":"2013-12-14","mins":"4:52 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-59481","author":"daveb_of_wellington_nz","post":"Essentially Zugibe. Barbet addresses the Shroud image of the feet. Zugibe argues from principles and generalities. My money remains on Barbet!.","date":"2013-12-14","mins":"3:48 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-58963","author":"daveb_of_wellington_nz","post":"Chess & mathematics ought to give him good skills in analysis and logic. High school teacher ought to give him good skills in communication, evident I think in his writing. The question would have to be if those skills provide a broad enough background. Authenticist though I may be, I think some of us find his approach somewhat narrow, and at times unwilling to be more open minded about matters which remain inconclusive, a non specific criticism I’d have to agree. However, I for one find Zugibe’s assertions concerning support of the feet relieving arm tension to some 67lbs only, rather unconvincing..","date":"2013-12-13","mins":"2:55 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-59263","author":"daveb_of_wellington_nz","post":"I’d be confident that Hugh is capable of doing the statics, but it all depends on how much of the weight gets transferred into the arms, and how much is taken by the feet. Barbet envisaged a type of see saw motion, necessary to enable the crucifarius to breathe. Therefore he considered that the weight had to be taken completely by the arms, at least at some phase during this motion. For a 175lb body with arms at 65deg to the vertical, the arm tension is easily calculated to be 207lb. That’s too high a tension to be taken by the flesh of the palms. It has to be taken somehow by the wrist bones if tearing is not too occur. Zugibe’s experiment involved strapping the volunteer’s feet to the upright, and measuring the arm tension with load cells fastened to the volunteer’s gauntlets. He claimed that the maximum arm tension was then only 67lb. So it all depends if you consider whether strapping the feet in this way is an adequate simulation of a nail through the feet. I personally can’t see it. Taking some 75% of the body weight onto the cluster of tarsal bones must have been excruciating, and I would think there would be a natural tendency to transfer the weight back onto the arms, and the risk of palm tearing would be too high. Roman executioners would no doubt vary in their competence and experience. I would expect that most would go for the wrist, and some would be better at it than others, sometimes possibly with the accuracy and expertise that Barbet claimed. Correspondents obviously vary in their opinions as to the whereabouts of the nail exit position. However it is just not possible to sustain a 207lb arm tension by palm flesh alone, and somehow or another it needs to be taken by a wrist bone, or a cluster of bones..","date":"2013-12-14","mins":"6:46 am","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-59454","author":"daveb_of_wellington_nz","post":"O.K: You will have to provide evidence and sources for the comment. Barbet Ch.6 discusses wounds in the feet covering 8 pages in some detail. He refers to the post mortem signs of the feet having been crossed, one foot over the other, he detects blood flows towards both toes and heel, it took 20 hammer blows for a nail to pierce the tarsal area of an ampuated foot, but easily penetrated the second inter metatarsal space, so that adequate support would be provided on the Lisfranc line. He considers that the Malijay theory locating the crucifixion in the direction of the heel cannot be sustained. The Jehohanan example illustrates the difficulty of nailing through the heel, where the nail remained in the heel and could not be removed, see Dr Nicu Haas reconstruction illustrated in Ian Wilson’s 1978 text. Where is the evidence for your assertion?.","date":"2013-12-14","mins":"2:49 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-138560","author":"daveb_of_wellington_nz","post":"A fascinating interview, Louis, which sheds further light on Prof Fanti’s viewpoint. The accompanying background paper is also an excellent summary on aspects of the TS, and the graphics are excellent. His responses to your interview questions come across as properly judiciously cautious, not at all like the dogmatism or singular view that he often seems to be accused of in various reports. His reasons for asserting the corona discharge hypothesis, are clear: one of the few processes apparently that can result in a second superficial image. At least two of his assertions might be contested. He continues to claim that the image resides on the PCW; Ray Rogers of course was convinced that the image resided solely on the starch type coating, and he was able to remove the coloration from an imaged fibre with dimide leaving the underlying fibre quite intact. He also commented that the image emission occurred normal to the body surface; that in itself creates a problem with the orthogonality of the image, which appears more like it being normal to the receptor cloth, and of course there are no imaging signs of the side of the body. I note his comment on radon, where he asserts that there is very little radon in Jerusalem tombs. That might not be the case immediately following an earthquake, when radon is commonly released from within the earth. Giovanna De Liso who has promoted the radon aspects, is of course one of his proteges..","date":"2014-07-15","mins":"6:10 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","title":"A Telling Interview with Giulio Fanti"},{"id":"comment-138780","author":"daveb_of_wellington_nz","post":"I find it difficult to follow Piero’s line of argument here. The use of electricity was practically unknown in ancient times. L Sprague de Camp in his “The Ancient Engineers” p.252 suggests that electro plating of metals may have been known in Iraq and possibly the Orient. He refers to some mysterious jars found near Khujut Rabu’a near Baghdad in 1936 and also at the ruins of Seleucia on the Tigris, which may have been used for this purpose. Otherwise occasional demonstrations of static electricity were little more than a toy and entertainment, but their nature certainly not understood. Piero also refers to Cordiglia’s attempts to create an image using 90,000 volts of electricity. The potential difference between cloud and ground in a lightning strike are of the order of 10 to 100 million volts, the peak return currents are of the order of 30,000 amperes, peak temperatures in the return stroke channel are of the order of 30,000 deg C, leader stroke reaches the ground in about 30 ms, and the return stroke reaches the cloud in about 100 ms. (Encyc Brit). I’m not sure what he means by the radon being a joke, and he asks what was the radon plateau reached to create an image. I can only refer him to De Liso’s work which seems to be one of the few papers where this has been explored, but she does not seem to cover this question in a quantitative way. Some investigators have attempted to postulate hypotheses involving radon, but its role of course is not at all known. It is not known what created the TS image, and I believe that all options are on the table. Radon may have been involved, not necessarily as a primary cause, but possibly as providing some kind of collimation of the image forming particles whatever they were. We can speculate, but without the essential experimental investigations being carried out, I believe we remain still working in the dark. I suspect that the process may be so complex, that the use of Occam’s razor here to isolate a single cause is unlikely to enlighten the true cause of the image..","date":"2014-07-16","mins":"5:08 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","title":"A Telling Interview with Giulio Fanti"},{"id":"comment-138986","author":"daveb_of_wellington_nz","post":"Thank you Piero for your ref on earthquake lights, a phenomenon I had not taken account of, as it seems to be fairly rare. I note the Wiki article mentions they were reported for the Amuri EQ in NZ of 1888. NZ is a seismically active country as we are on the boundaries of a number of tectonic plates. We usually have a few earthquakes of at least intensity 5.0 each year, occasionally up to 7.0. I recall very few reports, if any of the occurrence of earthquake lights at these times. As the sources say, it is probably a piezo electric effect resulting from plate movement. Concerning De Liso’s work: I take it you aware of her paper: “Shroud like image formation during seismic activity”; Giovanna de Liso; ENEA Frascati Conference May 2010. Http://www.acheiropoietos.info/proceedings/De Liso Web.pdf She lists some 14 references at the end, mainly in Italian, which may also be of interest. I feel her paper has I think several unfortunate omissions, and there’s more we’d like to know. She has not responded to any of my email enquiries which were in English. I am unaware of any more recent paper she has written. But I find it striking that she succeeded in producing some very persuasive looking images, from her 500 experiments over a period of 12 years. Encyc Brit article on ball lightning may be of general interest: “Ball lightning: also called globe lightning a rare aerial phenomenon in the form of a luminous sphere that is generally several centimetres in diameter. It usually occurs near the ground during thunderstorms, in close association with cloud to ground lightning. It may be red, orange, yellow, white, or blue in colour and is often accompanied by a hissing sound and distinct odour. It normally lasts only a few seconds, usually moving about and then vanishing suddenly, either silently or explosively. Ball lightning has been reported to cause damage by burning or melting but is usually harmless. Its causes and its relation to common lightning are not known, but among the suggested explanations are: air or gas behaving abnormally, high density plasma phenomena, an air vortex containing luminous gases, and microwave radiation trapped within a plasma bubble. Sometimes bead lightning is mistaken for ball lightning. Bead lightning is most apparent when the current in a cloud to ground flash persists for an appreciable fraction of a second. In these cases, the luminosity also persists and the channel may have regions of enhanced luminosity that resemble a string of beads.”.","date":"2014-07-17","mins":"5:08 pm","url":"https://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/","cat":"news_&_views","title":"A Telling Interview with Giulio Fanti"},{"id":"comment-29021","author":"daveb_of_wellington_nz","post":"I’ve had to delay my comments on Prof Fanti’s work because of other preoccupations. My 78 year old son in law died recently and we’ve had to deal with funeral arrangements and so on. As John Klotz mentioned to me in an email: “If there is ever an appropriate time to deal with the pssing of a loved one, perhaps Holy Week is the week to do it.” There are fundamentally three aspects that merit comment: 1) Publishing the book before the science had been peer reviewed; 2) the reaction of the Turin authorities disclaiming the samples; 3) the science that Fanti used to obtain his conclusions. 1) There has already been comment on this back to front way of doing things. However it is apparently notoriously difficult to obtain peer review in reputable journals to obtain an objective reaction on scientific work conerning the TS, although apparently the work has indeed been submitted. Perhaps Fanti considered his “discovery” was too important to languish while agenda driven reviewers debated his paper. I would doubt that that his motive was profit driven book sales – I would guess that the remuneration of a dean of a mechanical engineering institution would be more than adequate for one’s needs. The obvious diasvantage is that it leaves open accusations of seeking sensationlism. It is unfortunate that only Italian versions are available, as there is a larger catchment of interest. 2) The reaction of the Turin authorities in disowning the samples used seems to be gross over kill, in fact an own goal. If Turin had misgivings about the samples, a more cautious reaction would seem to have been more prudent. It may be that Fanti has provided a strong argument for authenticity, but Turin has now shot itself in the foot by disowning this work. In the land of the Florentine Niccolo Machiavelli, one might have expected more political nous, and less silly posturing. 3) There has been little in any English press releases about any details of the work beyond the claims made and the general methodologies, but no specifics. One is left making all sorts of speculative inferences, and possible objections come readily to mind. One expects that there is no fundamental theoretical basis for the inductions made, but that it is entirely empirical, essentially a type of statistical regression analysis. The underlying assumption seems to be that the various properties tested will be solely age related with little influence from other variables. For example (a) various species of flax – there are many such – Is it known how their properties vary across species? Can the flax species for the various samples be identified? Properties can be expected to vary according to the various processing methods to extract the linen, variable chemical effects, dyeing, retting processes, effects of heat? What about the correlation ratios, and tests of significance? Until a lot more information is available, we are left in a vacuum of ignorance at drawing any kind of valid conclusion!.","date":"2013-04-01","mins":"4:23 pm","url":"https://shroudstory.com/2013/04/01/alan-boyles-cosmic-log-on-fantis-new-book/","cat":"news_&_views","title":"Alan Boyles Cosmic Log on Fanti’s New Book"},{"id":"comment-31791","author":"daveb_of_wellington_nz","post":"And then by a process of logical induction the Shroud of Turin dates to the 12th 13th centuries?? Ha! Gotcha!.","date":"2013-04-24","mins":"4:02 pm","url":"https://shroudstory.com/2013/04/21/fanti-et-al-s-paper-for-free-at-least-for-now/","cat":"other_blogs","title":"Fanti, et al.’s Paper for Free, at Least for Now"},{"id":"comment-43641","author":"daveb_of_wellington_nz","post":"Louis, I am adequately aware of Crossan’s doctrinal short comings. It has been a persistent error of history that MEN were condemned, whereas it would have been more enlightening if it had only focused on the ERRORS they taught. “Hold on to that which is good!” (I Thess. 5:21). I found much that is good in Crossan’s “Power of Parable”. To attack everything that a person teaches, because of other errors, is I consider a form of “Ad hominem” argument and a “Non sequitur”. Concerning my principal argument that Jesus sought to be a liberator of those who were genuinely suppressed, I find it interesting that Pope Francis is apparently seeking to revive an acceptable form of Liberation theology. I am an advocate of John P Meier’s historical approach. I do not see anything in the gospels or in Paul, supporting the idea that sees Jesus as any kind of a political liberator from Roman imperialism, as apparently argued by Rabbi Boteach. The Book of Revelations written in the shadow of persecution, might see it differently..","date":"2013-09-10","mins":"4:10 pm","url":"https://shroudstory.com/2013/09/10/david-rolfe-challenge-to-richard-dawkins-embedded-in-pj-media-article/","cat":"press_coverage","title":"David Rolfe challenge to Richard Dawkins embedded in PJ Media article"},{"id":"comment-31793","author":"daveb_of_wellington_nz","post":"My dear father, God rest his soul, used a hollow ground cut throat razor for shaving most of his life. Every evening he would carefully hone it on a razor leather strop before shaving. Dr Occam’s razor is clearly losing its edge!.","date":"2013-04-24","mins":"4:13 pm","url":"https://shroudstory.com/2013/04/21/fanti-et-al-s-paper-for-free-at-least-for-now/","cat":"other_blogs","title":"Fanti, et al.’s Paper for Free, at Least for Now"},{"id":"comment-31663","author":"daveb_of_wellington_nz","post":"I disagree. Even this raw paper looks fairly persuasive, and Fanti appears to have done a thoroughly professional piece of research in this case. Gabriel has frequently commented on the suspect nature of C14 results in the case of textiles, and has advocated that other more reliable methods are available..","date":"2013-04-23","mins":"4:19 pm","url":"https://shroudstory.com/2013/04/21/fanti-et-al-s-paper-for-free-at-least-for-now/","cat":"other_blogs","title":"Fanti, et al.’s Paper for Free, at Least for Now"},{"id":"comment-31739","author":"daveb_of_wellington_nz","post":"If C14 is such an accurate dating test, then someone may like to explain why C14 dates the Sudarium of Oviedo to the 6th century. There’s a reasonably good case for the relic’s authenticity. If true it should date no later than the 1st century. I wonder what Fanti’s test would date it to? A 200 year tolerance within the 1st century would surely raise questions about the reliability of C14 tests on ancient textiles!.","date":"2013-04-24","mins":"6:08 am","url":"https://shroudstory.com/2013/04/21/fanti-et-al-s-paper-for-free-at-least-for-now/","cat":"other_blogs","title":"Fanti, et al.’s Paper for Free, at Least for Now"},{"id":"comment-31691","author":"daveb_of_wellington_nz","post":"Dating of Fanti’s Shroud sample is not cited in his paper. Very shrewd! He’s looking to get the method reviewed first, before he springs it!.","date":"2013-04-23","mins":"11:15 pm","url":"https://shroudstory.com/2013/04/21/fanti-et-al-s-paper-for-free-at-least-for-now/","cat":"other_blogs","title":"Fanti, et al.’s Paper for Free, at Least for Now"},{"id":"comment-92752","author":"daveb_of_wellington_nz","post":"A very perceptive comment, ek!.","date":"2014-03-24","mins":"2:41 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93010","author":"daveb_of_wellington_nz","post":"There has been extensive discussion on the location of the nails previously, much of it centred on Zugibe’s critique of Barbet’s claims. However, in discussing the instruments of crucifixion Barbet is able to cite several classical sources to support his case, whereas Zugibe seems to be relying entirely on his own static experiments with volunteers and drawing his conclusions entirely from those. Part of Zugibe’s critique is that the high arm tensions calculated by Barbet, are not necessary as he claims that the foot support was sufficient to reduce these arm tensions considerably. That could be debated, as during the death agonies of the crucified he would at times seek to relieve the pain in his feet by transferring the weight to his arms. However it is Barbet’s contention that the vertical stipes was a permanent fixture, and that the condemned man was only required to carry the patibulum, the cross piece. Stipes were certainly a permanent fixture in the colosseum. Having been brought to the place of execution, the man is laid flat on the ground, and his outstretched arms nailed to the patibulum. Binding might be used to restrain his struggling. With the nailing complete, four executioners could then easily lift the patibulum on to the stipes. At this stage the man’s complete weight is taken by the arms, the arm tension increasing as his feet leave the ground and his body falling to the vertical position. It is only when his feet are nailed to the stipes that he can relieve his arm tension. Consequently this method requires that the nails be placed in a location where they will not tear through the palms, as the arm tension can exceed 200 pounds force. It is only if the man is nailed to the full cross while lying on the ground, that wrist nailing might be avoided. The whole cross with the man attached would then have to be lifted by the execution party, and placed into a prepared hole. This is obviously a rather more onerous and inconvenient process for the executioners. I am not informed of any sources that assert that this method was ever a normal practice, despite many artistic portrayals of it. Barbet traces the background history of the implements used for crucifixion, and is able to cite classical texts in support of his argument. Wherever the nailing may have occurred at the base of the hands, it seems to be quite necessary that the nails be placed so that the man’s weight could be transferred using bony structures to avoid tearing of the palms at some stage during the process..","date":"2014-03-25","mins":"5:35 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-92903","author":"daveb_of_wellington_nz","post":"Two comments: 1) Only the nail exit point is at all visible, the entry point is not! Measuring the same distance on the inside of the palm assumes the nail went in at right angles. I’d credit an expert Roman executioner with rather more savvy; he’s going to make the entry where he knows the nail will penetrate and hold the victim secure; the nail will follow its own course through the base of the hand through whatever spaces between the bones it can find, which is most likely at a skew. 2) The observation by ekmcmahon is still valid, it takes any human artist out of the picture, they always show the nail through the palm!.","date":"2014-03-24","mins":"11:48 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93176","author":"daveb_of_wellington_nz","post":"I have just noted Charles Freeman’s comments #2 #6, and his expectation that Fanti might have a defender. He should be more patient, we have a 12 hour time zone difference, and his comments were posted in the middle of the night here. Professor Fanti is an academic mechanical engineer, not a pure scientist; although it is true that European engineering tends to be more focused on the pure sciences than are practitioners with an English or American tradition which tend to draw more on applied sciences. If authentic, the actual true dating of the Shroud will only give one limit for the dating of the crucifixion, the earliest possible but not the latest possible. Likewise the actual true dating of the crucifixion would only give the latest possible date of the Shroud but not the earliest possible. Fanti’s methods of dating depends on a systematic mechanical erosion of the cellulose over time. But there are other factors which can cause this erosion such as questions of handling, storage, folding, climate amongst others. Common with all man made products from natural substances, there will also be considerable variability among specimens, an aspect familiar enough to all engineers. Fanti’s methods depends on an underlying assumption that time is the dominant factor. The graphs he has prepared from fabrics with known dates have a considerable spread reflecting this variability, and there are also outliers. The methods are novel, and in their early stages of development, and even drawn from a fairly limited population. More data is required to corroborate them further, and to obtain better fixes. However they will only ever give probable limits because of the innate variability. Nevertheless they seem likely to be worthwhile, as a method of corroboration or as a flag to challenge other dating results. The disparate results from the various methods he has developed show that more refinement is necessary, and it may be that a combination of the methods is required to achieve any reliability. Applying the methods to dating of the Shroud requires that the subject samples chosen for dating are representative, and the samples he had available might therefore be challenged on this account. To average out the results to obtain a magic date of 33 AD might be seen as an abuse of the method verging on pseudo science, and which is unnecessary towards obtaining a general acceptance of the techniques he has used, which remain in an early stage of development..","date":"2014-03-25","mins":"4:25 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93954","author":"daveb_of_wellington_nz","post":"Eight out of the ten most recent comments at the present time have all been made by Yannick Clement under this particular posting. They all say exactly the same thing. Does he imagine that such repetition makes his argument any more valid? It does not! He is entitled to his views on the matter, as others are to theirs. I for one do not accept his arguments. I am prepared to accept that he may very well be right that the Mandylion was not the Shroud, but I remain personally of the view that it very well may have been. And I am entitled to hold this view as Yannick is entitled to hold the opposite. Yannick, Charles and various academics may imagine that the Mandylion and Shroud were two different objects and speculate on alternative routes by which the Shroud may have come to Constantinople, but they are utterly unable to muster a smidgeon of evidence to support any case for any such alternative route. It is too plainly evident that the 6th and 7th century iconography throughout Eastern Christianity has Shroud like likenesses and features. It is known that these were frequently claimed to be based on the Image of Edessa, whatever that was. Futhermore it is also known that the original image, later called the Mandylion, only emerged in Edessa from about the year 540 AD. To borrow an overworked favourite expression of Yannick’s “This speaks very loudly to me!” In 943 AD the Armenian general John Kurkuas on behalf of the Byzantine emperor swept through Mesopotamia with an army of 80,000 men conquering everything before him, and arrived at the gates of Edessa. We all know the startling offer he made. But he only wanted one thing, “Give us the Mandylion!” Generals on such a winning streak as Kurkuas had do not set out on an expedition for just any old painted icon. Again “This speaks very loudly to me!” On its eventual arrival in Constantinople, the future emperor Constantine Porphyrogenitus, describes the image in terms which seem very like that of the Shroud image ‘extremely faint, a moist secretion without pigment or painter’s art’; others saw it as blurred. Once more, “This speaks very loudly to me!” No other object in the history of the Byzantine imperial relic collection received any such celebratory reception as did Kurkuas’ delivery of the Edessan Mandylion in Constantinople! This sequence of argument speaks louder I think than any notional interpretation of ancient texts such as the “Acts of Thaddeus” nor any of its later accretions. Hence it is at least equally valid to hold the view that the Mandylion and Shroud were one and the same object, as it is to hold an opposing view of the matter!.","date":"2014-03-27","mins":"4:04 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-94346","author":"daveb_of_wellington_nz","post":"Following the stoning of Stephen, Herod Agrippa instituted a persecution of the apostolic church in Jerusalem, and many fled to Antioch. If the Shroud is indeed authentic then it had to be in the custody of the apostlic leadership and would also have been taken to Antioch, along with other relics of the Passion. In the year 70 AD the city of Jerusalem was destroyed, and any surviving relics would not have been held there any longer. So it is in Antioch that we must assume that the Shroud was taken, and unlikely ever to be held in Jerusalem subsequently. It is an error to place too much weight on the Doctrine of Addai, and the description of the portrait as a towel or veil. Eusebius discovered the story in the archives of Edessa about 315 AD and incorporated it into his Ecclesiastical History. It refers to an exchange of letters between Abgar V Ukkama and Jesus. Eusebius incorrectly assumed that it was literally true. However the Doctrine of Addai also incorporates several subsequent accretions. For example it describes the finding of the true cross along with the crosses of the two thieves, ascribing the discovery to the wife of the emperor Tiberius, whereas the discovery is more properly attributed to Saint Helena the mother of Constantine, and who lived ~248 – 328 AD. Furthermore it describes the death of Addai and the erection of a memorial to him, which only occurred ~190 AD. It is only too apparent that the “Acts of Thaddeus” is pseudonymous and was written probably not too long before Eusebius first discovered it. The Image of Edessa first emerges there about the year 540 AD, and was most likely taken there from Antioch with the impending destruction of the city by earthquake and by Persian invasion. It can be no coincidence that very soon after the Image’s first apearance in Edessa ~540 that there is a veritable welter of icons all with Shroud like features, and all ascribed to being copied from the Image of Edessa. It is too improbable to assert that this Image of Edessa was different from the Shroud image for these likenesses to be so pervasive. I have suggested above at #61, from Markwardt’s explanation of the origins of the Doctrine of Addai, that it was intended as a coded allegory referring to the conversion of Abgar VIII ~180 190 AD, when the image may have been used by Bishop Avercius to assist in this. The Bardaisanic “Hymn of the Pearl” suggests that Bardaisan had indeed seen the full body image at the court of Abgar VIII. Very likely the Shroud was returned to Antioch by Palut the first bishop of Edessa, rather than its being retained in Edessa. On its eventual arrival in Constantinople, what was thought to be known of the Mandylion was written up in a lengthy Narratio including the Doctrine of Addai. Eventually the Byzantines discovered that the Mandylion which they had captured from Edessa was in fact the burial cloth of Christ. However they were not about to abandon the various legends attributed to it and which they had worked into their various liturgies. That would be unthinkable to the Byzantine mind set. So the myth that there were two different objects survived. Much of the early history of the Shroud has been lost as it was in the possession of the Arian heretics in Antioch for some time, and any documentation they may have had was destroyed by the Orthodox who were the ultimate victors. It is a gross error to read the Doctrine of Addai or the Acts of Thaddeus as a literal version of whatever the image was that was used for the conversion of the Edessan court, and certainly not for Abgar V Ukkama..","date":"2014-03-28","mins":"6:44 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-94124","author":"daveb_of_wellington_nz","post":"David Goulet, Thomas: Two of the most interesting and informative papers on the Mandylion theory are by Jack Markwardt, particularly his “ANCIENT EDESSA AND THE SHROUD: HISTORY CONCEALED BY THE DISCIPLINE OF THE SECRET” of 2008; http://ohioshroudconference.com/papers/p02.pdf Markwardt provides many ancient references associating the burial cloths with ancient liturgies. He makes a case for the Shroud being taken to Antioch in apostolic times, where it was hidden in a wall at the “Gates of the Cherubim” in 362 AD and forgotten until its rediscovery there in about 540 and then taken to Edessa, prior to Antioch’s destruction by earthquake and Persian invasion. The doctrine of Addai, purporting to be an exchange of letters between Abgar V and Jesus, he considers to be a coded allegory written at the behest of Abgar VIII the Great, commemorating the conversion of Edessa to Christianity during the closing decades of the 2nd century. The purpose of writing it as an allegory was that the benign emperor Commodus was succeeded by the despot Septimius Severus, when persecutions recommenced. He makes a case that Bishop Avircius of Hieropolis, was dispatched by Pope Eleutherius to baptize Abgar VIII’s household, that Avircius was granted temporary custody of the Shroud at Antioch as a kind of visual aid for his mission to Edessa, and later returned it to Antioch. The Shroud’s later rediscovery in the walls of Antioch is echoed in the myth that it was discovered in the walls of Edessa during reconstruction after flood damage. The temporary presence in Edessa is reflected in the “Hymn of the Pearl” attributed to the 2nd century Edessan hymnodist Bardaisan, who it would seem may have seen the full body image at the court of Edessa, judging from the closing verses of the hymn. As Thomas says, there remains ambiguity and greyness, but in my view Markwardt’s paper goes a long way to filling out the gaps, from the Wilson theory, as it would seem unlikely that Edessa became Christian as early as the apostolic age..","date":"2014-03-28","mins":"3:48 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-93974","author":"daveb_of_wellington_nz","post":"More repetition ad nauseam changes nothing!.","date":"2014-03-27","mins":"5:10 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-94469","author":"daveb_of_wellington_nz","post":"O.K: “While we can be certain to the high degree that Othon took possesion of the Shroud, it is possible that he, or his descendants entrusted the cloth to the Templars.” Louis: “O.K. You are on the right track. Good for you.” Refer: ‘BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400’ Daniel Scavone, Ohio Conference, 2008; http://ohioshroudconference.com/papers.htm Scavone makes a number of points re the Templar hypothesis: Confessions of Templars who admitted to worshipping a head were of lowly rank, and unlikely to be privy to the innermost secrets of the order; All such confessions were extracted under torture or threat of torture; The inquisitors had previously directed the same accusation against the Cathars; The accusation that the templars worshipped a head was therefore at the suggestion of the inquisitors and was not initiated by the templars they interrogated. The only other link of the templars to the Shroud I know of was that a namesake of Geoffrey de Charnay, the templar Master of Normandy, was burned at the stake in 1314 with Jaques de Molay the order’s Prior. Geoffrey I de Charnay had a strong interest in knightly chivalry of the type practised by the Templars. It is just possible that the two Geoffreys were connected. If Louis or O.K. Are aware of any other information linking the Templars to the Shroud I should like to know of it. Othon de la Roche was an ancestor of Jeanne de Vergy, the second wife of Geoffrey I de Charnay, and therefore she could be considered to have a claim to the Shroud. Scavone makes a case that Othon would have delivered the Shroud to his home cathedral at Besancon, then in Burgundy, possibly as early as 1207. Burgundy was contested both by France supporting the Avignon anti pope, and by Germany supporting the Pope in Rome. With Germany threatening to take Burgundy, a case can be made for Jeanne de Vergy taking the Shroud from Besancon to save it for France. I believe there may also have been a family connection with Pope Clement VII of Avignon. Soon afterwards, fire destroyed the St Stephen’s cathedral in Besancon. There was a Shroud subsequently in Besancon showing a ventral image only, a copy of the genuine Shroud, and likely the basis of the D’Arcis false allegation that the Lirey Shroud was a painted copy. The Besancon shroud was later torn up for bandages. Note that the Lirey memorial badge shows not only the De Charnay arms, but also significantly the De Vergy arms, and that after the death of Geoffrey I, Jeanne de Vergy took possession of the Shroud as Geoffrey II was still a minor. I suggest a reading of the Scavone paper so that it may be weighed against the Templar hypothesis. Comments?.","date":"2014-03-29","mins":"4:40 am","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-94965","author":"daveb_of_wellington_nz","post":"I am aware that Ian Wilson attempted to obtain further corroborative information from Barbara Frale on her “Templar discoveries”. Persistent requests to do so met with no response, and he was persuaded that there was nothing in her claims. He has written disparagingly of her claims, and seems to consider her unreliable. Her claims of writing on the Shroud showing a type of ‘death certificate’ would seem equally suspect..","date":"2014-03-30","mins":"3:30 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-94994","author":"daveb_of_wellington_nz","post":"New discoveries? “You can bet that it will be Frale.” Real or invented??.","date":"2014-03-30","mins":"5:27 pm","url":"https://shroudstory.com/2014/03/24/giulio-fanti-in-the-spotlight-and-a-crash-course-on-the-shroud-of-turin/","cat":"news_&_views","title":"Giulio Fanti in the Spotlight and a Crash Course on the Shroud of Turin"},{"id":"comment-57223","author":"daveb_of_wellington_nz","post":"So Fanti can get a good result from a smaller sample than can be done with C 14? I thnk that might tell me something about the value of Fanti’s method vis a vis C14!.","date":"2013-12-08","mins":"5:29 am","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-57284","author":"daveb_of_wellington_nz","post":"I think all of Russ Breault’s comment way back at #5 is the most relevant in this thread: “It cannot be taken as authoritative. However it is excellent anecdotal evidence supporting the premise that the 1988 tests were flawed. For that reason, Fanti’s contribution is significant. In view of the fact that it has been 25 years and no additional carbon date has been authorized, what are researchers supposed to do—sit on their hands? I applaud Fanti for pursuing a different tact.” Despite the dispersion of his results, Fanti’s would seem a lot closer to the mark than the 1988 tests. The mere fact that fibres closest to the surface are more likely to be displaced may have as much a bearing than any inherent weakness in them as asserted by Rinaldi..","date":"2013-12-08","mins":"3:08 pm","url":"https://shroudstory.com/2013/12/07/revisiting-fantis-dating-methods/","cat":"science","title":"Revisiting Giulio Fanti’s Dating Methods"},{"id":"comment-7551","author":"daveb_of_wellington_nz","post":"I’m not sure why we should bother. Joe N Ickel, Sciencebod and other skeptics like them have already made up their mind and just keep recycling tired old arguments. They enter the debate with closed minds that it’s a fake and then muster outworn arguments, coupled with mockery and derision, to try to make their case. This is not the way to do good science, and is a complete contrast to the objective, fair minded and analytical approach taken by those working closely with the artifact. Most of Nickel’s other arguments are answered by reference to Ian Wilson’s most recent book “The Shroud”, Random House, 2010. Despite Bishop D’Arcis’ most carefully worded letter of 1389 to Avignon Pope Clement VII, he was unable to provide a single documented reference supporting his charge that Bishop Henry of Troyes had looked into the matter “some 34 years ago or thereabouts” and found that it “had been cunningly painted”, Note that he is even unspecific about the date, even though any supporting documentation would still have been available to him. The truth of the matter is that very likely all the churchmen, Bishops Henry, D’Arcis and the Canons of Lirey, were all moved by avarice to meet their debts, as apart from the Shroud, they had missed out on the largesse of other relics seized from the sack of Constantinople. Pope Clement VII may have known more about it than he let on. He had a close connection with the de Charny family, and he enjoined D’Arcis to perpetual silence on the matter under pain of excommunication. We do not know the history of the Shroud, as its original owner in the West, the gallant and most honourable knight Geoffrey de Charny was killed at the Battle of Poitiers in 1356 defending his king, before he was able to reveal how he came by it. However Ian Wilson attempts a credible reconstruction of its history as the Mandylion of Edessa, and musters several sound arguments to support it. This may not suit the pedants who insist only on facts, but it is the unavoidable vagueness of the history of those turbulent times. That so much can be reconstructed is a credit to Wilson’s perseverance and energy. Wilson also itemises several criticisms of the C14 tests, and describes the jostling for control between John Paul II’s chief scientific advisor Dr Carols Chagas and Turin’s Professor Luigi Gonella. Chagas’ well thought out protocol was scrapped, and Gonella and the AMS laboratories had their way. Without even touching on the likelihood that the C14 sample was a patch, and not the original material at all, Wilson lists the following criticisms: 1. Choosing only of labs using the AMS method, all three being clones of one another; 2. No involvement of a professional textile conservator in choosing the sample; 3, Taking just one single sample, from one single area; 4. Choice of site for the sample being well documented as subject to prolonged repeated handling during the centuries; 5. No provision for any chemical analysis of the sample; 6. Unofficial purloining by Gonella and Riggi of unused portions of the sample for their own personal research purposes; 7. Denial of any other synchronous scientific approaches to the Shroud. Nevertheless, no amount of logical argument will change the minds of the skeptics. They have made up their closed minds on the issue. And still retain the gall to call themselves scientists. Maybe they’d make good lab technicians, and not attempt to be more ambitious..","date":"2012-01-26","mins":"5:50 am","url":"https://shroudstory.com/2012/01/25/correcting-joe-nickell/","cat":"other_blogs","title":"Correcting Joe Nickell"},{"id":"comment-213739","author":"daveb_of_wellington_nz","post":"Thomas, I believe there may be a flaw in your logic. In the first place to use any word that has any meaning at all, such as the term “resurrection” you must first have a definition of what you mean by that, and so we have at least the beginnings of some explanation. We also have the witnesses of the New Testament who pretty well corroborate one another as what they perceived as the “resurrected Christ”. They all perceived him as having at least some transient corporeality; he walked, spoke intelligently with them, they were able to touch him and feel the wounds of his crucifixion, he ate and even prepared a fish breakfast for them. However there is also something mysterious about this corporeality, as it seems he was able to pass through the walls of the upper room where they were hiding, and he could suddenly appear and likewise vanish from their sight, as if into another kind of dimension. So although we can have some understanding of what a resurrected body might be, I can agree that there are clearly natural limits to that understanding, as it is beyond any experience familiar to us. The other flaw I see in your logic is “begging the question”. You make a conditional statement that “if the Shroud image was created by the resurrection”, and then seem to assume that is necessarily true, which although it might be true, is not necessarily the case at all, as even assuming that the Shroud is the authentic burial cloth, you are unable to exclude a natural cause of the image. The fact that a natural cause is as yet unknown, still cannot exclude that possibility..","date":"2015-10-28","mins":"4:10 am","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-213711","author":"daveb_of_wellington_nz","post":"The Spicer hypothesis that image formation may be related to an electric field intrigues me. At the risk of tired repetition of previous comments I’ve made, De Liso in her experiments of seismic image formation spanning some 12 years, claims that images were only formed under a set of unique combination of certain conditions, including coincident variations in the earth’s magnetic and electric fields, an occurrence common enough during earthquakes. It may well tie in with the Spicer explanation. A naturalistic explanation cannot yet be excluded, notwithstanding any unproven fall through hypothesis with improbable physics. I do not believe that the Resurrection event involved the conversion of body mass into pure energy, electro magnetic or otherwise, resulting in the equivalent of megaton nuclear bombs. The NT narratives make it clear enough that the witnesses observed that the resurrected Christ was corporeal enough, and not a phantom. However it was a body that is beyond our present knowledge or understanding of normal physics. I suppose it’s possible that our known universe may only be a subset of a higher universe whose dimensional properties are as yet unknown, a universe which the resurrected Christ seems to have been able to traverse at will..","date":"2015-10-27","mins":"2:24 pm","url":"https://shroudstory.com/2015/10/26/dan-spicer-we-have-a-simple-explanation/","cat":"critical_summary","title":"Dan Spicer:  We have a simple explanation."},{"id":"comment-214152","author":"daveb_of_wellington_nz","post":"The Shroud like similarity of the 692 solidus image is discussed at some length in Jack Markwardt’s St Louis paper. Two other very similar images are the St Catherine’s Pantocrator and the Homs vase, all three distinctive as showing an upper body image, all from the first reign of Justinian II, and quite unlike any Edessan based Mandylion image which more often usually terminate at the neck line. Markwardt interprets the change in the post exilic solidi to a younger beardless Christ as a result of Byzantine superstition. Was it appropriate to use the “Image of God Incarnate” in this way? Justinian did not have long to wait for his answer. Overthrown, having his nose cut off, and sent into exile, he interpreted the defeat as a sign of divine disapproval of this use of the image. Consequently when he was eventually reinstated the coin imagery was changed to an idealised youthful and beardless Christ. It is apparent that the Shroud image was known in Constantinople during Justinian’s reign, and in all likelihood was already there. At this time the Mandylion was still in Edessa, but it was Ian Wilson’s contention that its purported full length image did not become known until after it arrived in Constantinople in 945. The weakness in the Wilson argument then becomes apparent. The Shroud was never the Mandylion. Even Mark Guscin in his Ph D thesis seems to become confused by the prevalence of face only images and reports of a pre 945 full body image. The two images are evidently quite distinctive from each other. It is also Markwardt’s contention based on the Tarragon manuscript, that following a series of continuous earthquakes during the mid 8th century in Constantinople, the Shroud was hidden away in the imperial palace, only to be revealed by a later emperor Alexios around 1200. He claims that this accounts for the apparent disappearance of the Image of Camuliana from the records after about 745 and which he asserts was actually the true Shroud..","date":"2015-11-03","mins":"2:37 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-163982","author":"daveb_of_wellington_nz","post":"“For obvious reasons, the Shroud was always held longways as it was the only way to display the full extent of the images.” Yet another dogmatic statement as to what “always” happened with no evidence in support of it, all with the purpose of dissing any possibility of its authenticity. Certainly there are several occasions since 1355 when the Shroud was frequently displayed in this way and there are several illustrations of this type of depiction. For those Eurocentrics who believe that it only dates from the 14th century, I suppose “always” is close enough. For those who for various reasons believe that it dates from antiquity it most definitely is not. We have the evidence of Robert de Clari and Nicholas Mesarites both claiming to have seen an upright image of Christ in connection with burial linens in Constantinople. Mesarites description of “rising again” implies some kind of mechanism was used for the purpose. The Byzantines were not only competent engineers from ancient times but also ingenious, and were quite capable of producing such a visual display to full dramatic effect. Vern Miller produced photographs under raking light during the STURP investigations. Several fold marks across the cloth are clearly visible under these lighting conditions. Very likely many of the folds arise from various ways of storing the cloth during its long history. Sadly the folds are no longer visible because of the 2002 interference with the integrity of the original. John Jackson has his own particular take on it and maintains that there are definite folds which correspond with the claimed tetradiplon pattern. Many of present correspondents will have seen the video of his presentation on this. He has set up a simulation of the type of mechanism which he conjectures was involved. Absent this agenda, and some fold marks do seem to occur at the locations he claims. His paper “FOLDMARKS AS A HISTORICAL RECORD OF THE TURIN SHROUD” by JOHN P. JACKSON, together with reproductions of Miller’s and others’ photographs can be found at: http://www.shroud.com/pdfs/ssi11part4.pdf. Fold marks are clearly visible, on what must be considered as imperfect reproductions. The paper may or may not convince those with an open mind on the matter, but they remain at least as an admissible possibility. For those with a closed mind, nothing will ever persuade them anyway! I would agree that ranking them as “Class I Evidence” is probably over egging the custard somewhat. However fold marks were definitely present and visible before 2002 of the kind asserted,.","date":"2014-10-20","mins":"6:07 am","url":"https://shroudstory.com/2014/10/20/in-the-belly-of-the-beast/","cat":"critical_summary","title":"In the Belly of the Beast"},{"id":"comment-214161","author":"daveb_of_wellington_nz","post":"Although Edessa was nominally part of the Byzantine empire, the Edessans were more oriented towards a Syriac tradition and somewhat resented their Byzantine subjection. In 639, Edessa fell to the Moslems, whereas the Justinian II solidus is dated 692, when the Mandylion would not have been easily accessible to the Byzantine court. Markwardt in his paper summarises the several scholarly reasons against the Mandylion being the Shroud. O.K. Will need to give a satisfactory explanation of the Tarragon manuscript description of the image that was locked away as a result of the earthquakes. It certainly was not the Mandylion which was frequently displayed in public..","date":"2015-11-03","mins":"4:39 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-214159","author":"daveb_of_wellington_nz","post":"Between 745 and about 1200, only the emperor was permitted to open the casket in which the “Image of God Incarnate” was hidden from other eyes. For a special purpose, he might show the image to others in private, but never publicly. Hence it would seem that Constantine VII permitted his mint officials to view the image. Likewise there would be good reason for Bela III of Hungary, then betrothed to the emperor’s daughter and so heir apparent also to view the image, as appears evident from the HPM, which shows vestigial recollections of this viewing..","date":"2015-11-03","mins":"4:09 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-214169","author":"daveb_of_wellington_nz","post":"Following that logic it would therefore seem that Justinian II in the year 692 was able to produce a Shroud like image on his coinage, inclusive of the upper body, despite the Mandylion having been inaccessible to him and under Moslem control for the previous 53 years!!?? One might wonder why he might show any interest in such a relic, unless he had a better alternative more readily available!.","date":"2015-11-03","mins":"7:16 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-214157","author":"daveb_of_wellington_nz","post":"“And, is it perverse of me to think that Constantine himself probably did not design the coins personally?” If one happens to be emperor, it is usually unnecessary to keep a dog and yet bark oneself!.","date":"2015-11-03","mins":"3:52 pm","url":"https://shroudstory.com/2015/11/03/looking-for-elephants-in-ephemeral-clouds-critical-summary-3-0/","cat":"critical_summary","title":"Looking for Elephants in Ephemeral Clouds (Critical Summary 3.0)"},{"id":"comment-164204","author":"daveb_of_wellington_nz","post":"The question of the removal of fold marks during the 2002 intervention seems ambiguous and enigmatic. I found two seemingly contradictory papers on the Shroud.com site. [Search word was ‘Restoration’ yielding several links and titles of papers] A summary of the Dallas conference yielded a series of Q&A dealt with by Mme Flury Lemburg concerning her intervention. She asserted there had been no ironing, nor laundering, nor steam cleaning, nor the use of weights to remove wrinkles; a weight had been used merely to keep a glass cover in place during the work. Conversely a paper: “SHROUD RESTORATION DATA” First published in LINTEUM, the Spanish Centre for Sindonology magazine, 2002. Http://www.shroud.com/pdfs/n58part7.pdf includes the following: “Aims: [includes –>] ** Remove the organic remains, dust and dirt that had accumulated between the Shroud and the backing cloth; ** Stretch the Shroud to iron out crease marks” “Effects: [includes –>] **Crease marks have been taken out with a system consisting of small lead weights. The Shroud has thus “grown”, and now measures 441.5 x 113.7 cm” The two papers therefore seem to be mutually contradictory concerning the removal of crease marks. I did not search for further information for corroboration one way or the other. During its history, it is evident that the Shroud has been kept for long periods of time folded or rolled in various ways. This is evident from repeated / symmetrical patterns of water stains, the ‘poker hole’ pattern, the Chambery 1532 burn holes, and in recent centuries by being rolled on a baton or staff. In 2004, Aldo Guerreschi simulated a folding indicated by the ancient water stains. The simulation was broadcast on British Television in presence of Ian Wilson who describes it in his 2010 book. The cloth was folded twice lengthwise and then with 12 loose folds widthwise accordian style and placed in a replica of a jar used for storing the Dead Sea scrolls. Guesrreschi succeeded in obtaining an identical pattern of water stains. The poker hole pattern indicates that at this time it was folded with one fold lengthwise and one widthwise. The Chambery burn holes indicate it was at that time folded once lengthwise and also widthwise to produce two symmetrical rows each of four holes. In recent centuries it has been rolled on its staff. In addition we have Wilson’s tetradiplon theory so folded to produce a landscape face. There may have been other long term foldings which are now unknown. Perhaps it was folded in particular ways for Byzantine displays as suggested by Jackson, or even storage in a casket. The retention of fold marks is said to occur because of the breakdown of the linen cellulose crystalline structure. I suggest that this breakdown will not necessarily be as uniform as it might be in a modern machine made product. There will be variations in thread strength and texture resulting from hand spinning and hand loom weaving. Perhaps it cannot be expected that residual fold marks will be clean straight lines across the cloth, but will pursue the line of least resistance determined by its hand made heterogeneity, previous foldings, and such factors as edge distance discontinuities. It would seem unlikely that the folds were ever ironed or pressed into place for permanence. Jackson has attempted to rediscover the ancient methods used for folding, and each of us will have our own views of how successful or uncertain these might be. Whatever, with the apparent, or at least possible, removal of wrinkling in 2002, any rediscovery or review of this work would seem to be a forlorn hope..","date":"2014-10-20","mins":"11:07 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-23029","author":"daveb_of_wellington_nz","post":"“There are other water stains on the shroud that are known to be much older [than 1532] because they appear on artistic drawings of the Shroud made before the 1532 fire.” This looks like a garbled confusion of two separate features. This water stain damage is discussed in some detail in Ch 6 of Ian Wilson’s 2010 boook. He was able to write authoritatively on this feature as he was involved in a TV demonstration with Italian photographer Aldo Guerreschi who had photographed the stains identified during Dr Flury Lemburg’s 2002 restoration work. The repetitive pattern of the stains shows that they occurred when the cloth was loosely folded accordion style into some 52 segments making a bundle roughly 12 inches by 13 inches. It had to be in some kind of container to hold this arrangement. Flury Lemburg and Guerreschi thought an earthenware jar the most likely as other similar ancient articles had been found so stored. A reasonable explanation is that the staining was caused by a puddle of water in the bottom of the jar, possibly as a result of condensation. The TV demonstration replicated this water staining damage. In the same Chapter 6 Wilson also mentions the folding implied by the well know four sets of the “triple poker hole” patterns. The cloth then had to be folded in four making a package roughly 7 feet by 2 feet. An artist’s copy of the Shroud datd 1516 shows these holes, which were therefore unrelated to the 1532 fire. They also seem to be suggested in the Hungarian Pray manuscript of 1195. It would therefore seem that the writer of the comment has confused the two incidents – the water staining and the poker holes. It seems credible that the water staining may have occurred during the Shroud’s very early Middle East history, as other artifacts have been found so stored. Alternatively it may even have occurred during one of its frequent post 1355 peregrinations around central Europe (France Italy Swiss Alps). Check Wilson’s 2010 “The Shroud” for a fuller description. I would doubt that the water staining damage was ever shown in any pre 1532 drawing without some specific reference to it..","date":"2013-01-30","mins":"6:17 am","url":"https://shroudstory.com/2013/01/29/paper-chase-new-the-shroud-a-critical-summary-of-observations-data-and-hypotheses/","cat":"news_&_views","title":"Paper Chase (NEW): The Shroud: A Critical Summary of Observations, Data and Hypotheses"},{"id":"comment-213616","author":"daveb_of_wellington_nz","post":"I believe Hugh is correct in his interpretation of the meaning of “pareidolia”. It seems to be a fairly recent word that has come into the language. My Collins of about 1990 does not include it, nor is there an entry in my Encyc Brit of 2006. My Collins does include the word “eidolon” from the parent Greek, – “1. An unsubstantial image; apparition; phantom; 2. An ideal or idealized figure [C19 from Greek; phantom, IDOL] On line Collins gives the following meaning for pareidolia: “the imagined perception of a pattern or meaning where it does not actually exist, as in considering the moon to have human features” It would be a wrong use of the word to apply it to a published photograph of an easily recognisable scene or person, and yet the photograph would almost inevitably be made up of a series of closely spaced dots which the eye resolves as a clear pattern, as a result of an artifact of the printing process. An ink jet printer in fact produces a similar result but on a much finer resolution. This is fairly close to what we see on the Shroud image. However to see writing on the Shroud as some have asserted, would quite likely be a true pareidolia, if in fact the writing was not truly there. The reports of a face on the surface of Mars resulting from mountain shadows is clearly a case of pareidolia. But merely because the eye is capable of resolving a series of dots into a coherent image is not sufficient for the image to be classified as a pareidolia, if in fact it is a true representation of an objective reality..","date":"2015-10-26","mins":"4:44 am","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-164389","author":"daveb_of_wellington_nz","post":"Mike’s picture is excellent. It’s plain enough that the residual marks are not the straight lines across the cloth that one might expect. But maybe that’s because we’re more used to seeing machine made linen products with uniform creases. Hand spinning of the threads, and hand loom weaving would imply greater variability, and maybe the creases follow the path of least resistance. Yes, I know, I already said that..","date":"2014-10-21","mins":"2:27 pm","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-164241","author":"daveb_of_wellington_nz","post":"Or was it “I think I see”?? Was the post 2002 viewing carried out with raking light?.","date":"2014-10-21","mins":"12:35 am","url":"https://shroudstory.com/2014/10/20/quick-reaction-to-in-the-belly-of-the-beast/","cat":"critical_summary","title":"Quick Reaction to In the Belly of the Beast"},{"id":"comment-199802","author":"daveb_of_wellington_nz","post":"The difficulties are many. A primary difficulty is one of access. The custodians discharge their duty conscientiously over what many regard as a sacred relic. Even the scientists seem too narrowly focused. There are narrow sectional interests. The big advantage of STURP was that it was multi disciplinary and they were all able to work together. We have not seen its like in sindonist studies since. There seems to be a difficulty with regional and national horizons. The Americans who contributed so hugely to our present scientific understanding seem to have been locked out by the Italians, who seem to have their own peculiar perspectives. Large scale funding is required if the investigations are to be anything other than amateur. Much of the science too seldom seems to get as far as the peer review stage. Colin Berry labours on in his kitchen or his garage, but his work seems to be too agenda driven. On the historical front, too much has already been lost. The historians find much to criticise in what meagre documentation there is, and they even complain at intelligent speculation, calling it writing a novel. The ancients were capable of a great deal more than they are generally credited with. As a young man, I found Sprague de Camp’s history on the ancient engineers most enlightening. Given their industry and individual innovation, I do not find it surprising that they might be capable of weaving a herring bone cloth of the dimensions of the Shroud, regardless of what looms might or might not have been generally available at the time. I see no future in the painted linen hypothesis, only that it may be disproved. No ancient or medieval painting has the realistic form of the man on the Shroud. Shred the paint off any portrait on linen. If anything remains, it will still look like only an artifact by human hand. In the meanwhile, the Shroud can serve its purpose as an object of religious meditation, which in these pages is too seldom considered..","date":"2015-05-21","mins":"6:30 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"id":"comment-214471","author":"daveb_of_wellington_nz","post":"Thank you very much Kathleen for your correction, you are quite right, Jn 2:1 11. My only excuse is age and over reliance on what seems to becoming an increasingly faulty memory. But I can confirm that L Sprague de Camp in his “The Ancient Engineers” describes Heron’s several devices, including “A combination of vessels and siphons (that) apparently turns water into wine …” on p.258. Heron’s ‘Mechanics’ was much referred to by medieval engineers..","date":"2015-11-10","mins":"2:06 pm","url":"https://shroudstory.com/2015/11/08/the-process-of-resurrection/","cat":"critical_summary","title":"The Process of Resurrection"},{"id":"comment-214425","author":"daveb_of_wellington_nz","post":"It is not obligatory to believe every miracle story recorded in the gospels, although the healings are probably true. The evangelists were concerned to proclaim Jesus as Lord, not writing history as we now know and understand it. The Cana miracle of turning water into wine is only recorded in Luke, a gentile, probably Greek. A contemporary engineer and resourceful inventor, Heron of Alexandria had created a device giving the illusion of turning water into wine. It is a temping thought that Luke had heard of it, borrowed it, or ascribed it to Jesus. The guarantor of Luke’s gospel in the late 2nd century was said, somewhat ambiguously, to be Paul, although there is no Papias fragment concerning Luke. Collins has a very long definition on the meaning of the word “process”. Simply put a “process” is a series of actions that produce change, and involves time. Probably describing the resurrection as a process is therefore likely incorrect as Dan indicates. The only essential known requirements for resurrection seem to be that one has to be dead at the outset, and afterwards the same person has to be alive in a particular sense, but resuscitation does not count. However there is only one known case of resurrection and how it came about is a true mystery. I shrink from the idea that the Shroud image was in some way a byproduct of the resurrection. If it was a miracle, it was so in its own right, Meantime I prefer to think a naturalistic explanation by some as yet unknown “process” was the likely cause..","date":"2015-11-09","mins":"1:43 am","url":"https://shroudstory.com/2015/11/08/the-process-of-resurrection/","cat":"critical_summary","title":"The Process of Resurrection"},{"id":"comment-214482","author":"daveb_of_wellington_nz","post":"Not a lost sheep, Sampath. Even a small serving can make an adequate meal!.","date":"2015-11-10","mins":"11:35 pm","url":"https://shroudstory.com/2015/11/08/the-process-of-resurrection/","cat":"critical_summary","title":"The Process of Resurrection"},{"id":"comment-21431","author":"daveb_of_wellington_nz","post":"Well done, Yannick! An impressive work of dedication, an extremely useful and readily accessible collection. My congratulations. I’ll look forward to reading through it..","date":"2013-01-01","mins":"3:30 pm","url":"https://shroudstory.com/2013/01/01/a-collection-of-ray-rogers-quotations/","cat":"uncategorized","title":"A Collection of Ray Rogers Quotations"},{"id":"comment-199788","author":"daveb_of_wellington_nz","post":"I see the important lesson from the elephant story as being that each one of the blind men only ever considered one aspect of the object of their study. Consequently they were not able to achieve a consensus. This is what we see in an age of specialisation. Renaissance Man, even the ancient Greeks, had it better when they were given a broad spectrum education. It has been said that the specialist seeks to know more and more about his particular specialisation, until he knows everything about nothing. Conversely the generalist might be said to extend his knowledge of all that goes on in the world, until he knows nothing about everything. It is perhaps a commentary on the natural limitations of the human brain. Its compass is circumscribed, and one person can only digest so much. However to penetrate the enigma of the Shroud, it is not sufficient to concentrate on any single discipline. They may serve to illuminate a particular aspect, but that is not enough. None of them singly can hold the key to the mystery. The broad headings of Science, Religion and History might be able to do it when taken together. But there is so much that we will never know, and much that is now irretrievably lost. Eventually we may be able to catch a glimpse of what might only be a ghostly appearance of the elephant..","date":"2015-05-21","mins":"3:38 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin"},{"id":"comment-50023","author":"daveb_of_wellington_nz","post":"Well said, Kelly! I think my first comments on this site were probably posted around April 2012. Ever since that time I have waited in vain for a single gem of wisdom to inform me from the ranks of Art critics and so called Byzantine experts, that might increase my understanding of their point of view, and so thereby come to some greater wisdom in such matters. Sadly I have had to come to the conclusion that there is in fact no such formal academic discipline as such; it is neither a science nor history as the rest of us might understand by that term, it is rather a type of arcane mystery religion whose infallible doctrines are to be given soulful assent by all neophytes who would seek admission to their ranks, independent of any kind of sensible objective evidence to the contrary. It would add a far better and constructive purpose to their lives if they actually took up knitting, so that their otherwise wasted efforts might take on some useful semblance of productivity by which the rest of humanity might benefit even if only to some minor degree..","date":"2013-11-05","mins":"6:53 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49681","author":"daveb_of_wellington_nz","post":"Damascus Fine Linens Incorporated; Memo to Friends of Jaques de Molay Memorial Fund; Dear Sirs, we regret we are unable to meet the stringent terms of specification for your order as requested to us, and will therefore be unable to meet your order. We admit to some surprise that the high quality linen cloth you ordered should be cut to exactly 8 x 2 old Assyrian cubits, as these went out of fashion some centuries ago around about the time that Sultan Mu’awiyah, blessed be his name, delivered the city out of the hand of the infidel, we believe in the year 661 according to your own system of reckoning. We are mystified at your demand for such a high level of purity in the linen thread, to be absolutely free from cotton. You must be aware that multi tasking is an essential economic necessity in these straitened times, and we expect our spinners to be adept at all fibres. Consequently all our fibres are heaped around our work rooms, float about in the air and can generally get quite mixed up. It wasn’t always like this, but we believe there are some excellent compensating “spin offs”, if you’ll forgive our little pun. We note your requirements for certain botanical contaminations from specific geographical areas. We are on good terms with our brethren in Anatolia who can arrange for the necessary exposures during the appropriate seasons, but would caution you concerning the prohibitive cost of this little indulgence. We cannot however recommend sending the cloth to the Dead Sea Area at this time of year, as our brothers the Mamluks and Abbasids are presently engaged in what may politely be called duck shooting activities, and we would fear for the safety of our couriers and of your order. We are not at all certain whether in fact the plants you refer to, are any longer extent in the area. It is now a fairly barren kind of place. The most perplexing item of your specification seems to relate to some peculiar geology requirement we have never heard of. What in fact is this travertine aragonite limestone of which you speak? And just why do you want to contaminate our lovely linen products with such unspeakable dirt, even if it is from off the streets of the blessed city? What are you? Some kind of nut? Our public librarian claims to have sighted a record of a similar kind of order as yours, but it was well over a millenium ago. He believes it was requested by Joe someone, he thinks it looked like Harry Matthews, or maybe ‘Arry Matthis or some such. May we interest you in purchasing some fine Persian carpets instead. Perhaps these might be a more enduring token of memory for your dear departed friend. They are becoming very fashionable, and I can arrange immediate delivery at reasonable prices..","date":"2013-11-03","mins":"5:14 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-11601","author":"daveb_of_wellington_nz","post":"The ignorance of the young is being perpetrated by education policy makers throughout the western world. They set no store on the cultural heritage from which we are all beneficiaries, if we only knew it. They have abandoned the teaching of history, they set no store on the ancient classics, and the teaching of religion even in the senior classes of our Catholic schools is unduly juvenile, if it still exists there. Even the teaching of science is barely rudimentary. The King James Bible if nothing else was a major milestone in the development of our language. Recently I attended a U3 A lecture given by a popular retired Prebyterian DD speaker. He reported that his university undergraduate grandson had asked him “What was the Reformation?” Gasps from the audience were palpable. Our young people are being trained in ignorance, and civilzation is going down the drain!.","date":"2012-05-25","mins":"4:37 pm","url":"https://shroudstory.com/2012/05/25/richard-dawkins-famed-atheist-supports-free-bibles-in-schools/","cat":"challenge","title":"Richard Dawkins, Famed Atheist, Supports Free Bibles In Schools"},{"id":"comment-17196","author":"daveb_of_wellington_nz","post":"Following on from Louis’ comment above I spent an evening’s surface on Dawkins / Rowan Williams, including the most recent postings. The closest I came to discovering Dawkins’ being prepared to admit the possibility of God’s existence, was that on an atheist scale of 1 to 7, he rated himself as a 6.9. That’s a pretty small religious window, and merely looks like self protection from being accused of being close minded.. A particularly interesting insight on the present philosophy of Humanism was provided in a long article by Michael Ruse, “High priests, holy writ and excommunications – how did Humanism end up acting like a religion?” check http://www.aeonmagazine.com/world views/michael ruse humanism religion/ This was published as recently as October 1. Nevertheless it elicited a veritable battery of adverse comments from dedicated atheists, humanists, rationalists, and that general ilk. There is clearly now apparent a fanatical atheism abroad, particularly among scientists. With that kind of thinking abroad, what is the hope of ever evangelising scientific thinkers? Or will Religion now become dumbed down, with a sole target audience of children and the illiterate?.","date":"2012-10-03","mins":"3:47 pm","url":"https://shroudstory.com/2012/09/29/six-months-ago-today-the-dawkins-challenge/","cat":"challenge","title":"Six Months Ago Today: The Dawkins Challenge"},{"id":"comment-11471","author":"daveb_of_wellington_nz","post":"I find Colin’s comments in his last paragraph above quite fascinating and could well be significant: no nitrogen enrichment; problem of gas flows; sharpness of the image; question of the hair. To me it seems to raise serious questions about the Maillard reaction hypothesis, Shroudies may need to look elsewhere for a natural explanation of the image. I personally find a 2010 paper.by Giovanna de Liso of considerable interest: “Shroud like experimental image formation during seismic activity” Giovann de Liso, [Shroud Conference, ENEA Frascati, Italy, 4 6 May 2010]. Sorry, I don’t seem to have logged the URL, but it should be reasonably easy to find. De Liso conducted a series of experiments over a period of 12 years in her seismic area of West Piedmont, and seems to have produced some quite sharp images. She mentions release of radon during earthquakes, association with rock types particularly gneiss, and influence of ferro magnetism. She does not seem to speculate on what the image formation process might be. The paper has a strong experimental basis, and seems thorough and scientific, which could appeal to Colin. All the gospels mention an earthquake after the crucifixion, and this could well be more than just a dramatic literary device..","date":"2012-05-20","mins":"4:43 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","title":"The Valencia Dawkins Challenge:  No Consensus on Consensus"},{"id":"comment-11478","author":"daveb_of_wellington_nz","post":"Yannick, I have no problems with your comments above at all. I’m quite open minded about whatever the process might have been; At this stage we don’t know, we may never know, and I think it’s fair to look at all credible hypotheses. Possibly unlike yourself, and speaking as a one time hands on civil engineer, I don’t happen to believe in the infallibility of any scientists, regardless of what their names might be, whether it’s Rogers, Berry or Isaac Newton. I think Colin has made a fair comment in his second paragraph, and all possibilities should be considered. I think you’ve done very well, with your pursuing the issue of consensus on the surface of the fibres. LOL.","date":"2012-05-20","mins":"8:09 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","title":"The Valencia Dawkins Challenge:  No Consensus on Consensus"},{"id":"comment-206829","author":"daveb_of_wellington_nz","post":"HF: ” … as the muscles relax after death, and the idea that rigor mortis would suddenly catch the thumbs in just the right position is unrealistic. I still await some confirmation that the flexed thumb suggestion is not a myth.” Rigor mortis is irrelevant in this case, as flexure occurs immediately on nailing. Whether the muscles relaxing after death would make any difference, so that the palms are merely hiding the thumbs in a natural position, the fact remains that Barbet demonstrates that the flexure definitely occurs, and his attributing it to damage to the median nerve seems credible as his amputated arms were fresh. One might speculate a severe case of psychosis scrupulus dubitationis scepticissimi. The following extracts from Barbet, or better still read the full original, or else merely jump to the last three paragraphs. If experimenting, it is important to use freshly amputated arms immediately! Barbet: “I did not appreciate the importance of all this till I had made the following experiment: having amputated an arm two thirds of the way up, I took, immediately after the operation, a square nail with sides of 1/3 of an inch (like those of the Passion), the length of which I had reduced to 2 inches for convenience of radiography. The hand was laid flat with its back on a plank, and I placed the point of the nail in the middle of the bending fold of the wrist, the nail being vertical. Then with a large hammer, I hit the nail, as an executioner would do who knew how to hit hard.” “I repeated the same experiment with several men’s hands (the first had belonged to a woman). Each time I observed exactly the same thing. Once it had passed through the soft parts, and the nail had entered fully into the wrist, I could feel it, in spite of my left hand holding it firmly, moving a little obliquely, so that the base was leaing towards the fingers, the point towards the elbow; it then emerged through the skin of the back of the wrist at about a centimetre above the point of entry, which I observed after removing the nail from the plank. Radiographs were taken at once. I had thought, a priori, that the nail would dig deep into the wrist, and would probably pass through the semi lunar bone, crushing it on its way. The movements of the nail while it was sinking had, however, made me suspect that it had found a more anatomical path.” “In fact, in the radiograph taken in profile, the nail, which is a little bit oblique, in a backwards and upwards direction, passes between the projections of the semi lunar and of the capitate, which remain intact. The radiograph taken from the front is even more interesting; the shadow of the square nail appears to be rectangular, on account of its obliquity. The nail has entered into Destot’s space, it has moved aside the four bones which surround it without breaking one of them, merely widening the space.” “The dissection of the hand confirmed my radiographic results. The point of entry, being a little outside and medial to Destot’s space, the point of the nail reached the head of the great bone, slid along its mesial slope, went down into the space, and crossed it. The four bones were pushed aside, but were intact and by reason of thus being pushed were closely pressed against the nail. Elsewhere the latter was resting on the upper end of the transverse carpal ligament. (Etc). …” “I have in fact repeated this experiment a dozen times since then on the hand of an arm which has just been amputated, moving the point of entry all round the middle of the bending fold. In each case the point took up its own direction and seemed to be slipping along the walls of a funnel and then to find its way spontaneously into the space which was awaiting it. (Etc) …” “But these experiments had yet another surprise for me. I have stressed the point that I was operating on hands which still had life in them immediately after the amputation of the arm. Now, I observed on the first occasion, and regularly from then onwards, that at the moment when the nail went through the soft anterior parts, the palm being upwards, the thumb would bend sharply and would be exactly facing the palm by the contraction of the themar muscles, while the four fingers would bend very slightly; this was probably caused by the reflex mechanical stimulation of the long flexor tendons.” “Now dissections have revealed to me that the trunk of the median nerve is always seriously injured by the nail; it is divided into sections, being broken sometimes half way and sometimes two thirds of the way across, according to the case. And the motor nerves of the opponens muscles and of the short flexor muscle of the thumb branches at this level off the median nerve. The contraction of these themar muscles, which were still living like their motor nerve, could be easily explained by the mechanical stimulation of the median nerve. (Etc) …” Pierre Barbet, “Doctor at Calvary”, Doubleday Image Books, 1963, ex pp. 116 119.","date":"2015-07-29","mins":"4:13 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206812","author":"daveb_of_wellington_nz","post":"Whether Zugibe or Anoxie consider the nail resulted in the thumb flexing into the hand or not, Barbet reports on not one, but on several repeated experiments on different amputated hands, generally from about two thirds up the forearm, and on perhaps a dozen or more. Despite any attempt to steer the nail otherwise, it always found the Destot space, and on each occasion the thumb flexed into the hand. Dissection in each case showed that the median nerve was damaged. I’m unaware that either Zugibe or Anoxie have reported any such replica experiments, but appear to be speaking from merely a position of general theoretical anatomical understanding. Find a few amputated hands Anoxie and try it out. If you don’t have access to them, then you can’t authoritatively criticise Barbet’s actual experiments..","date":"2015-07-28","mins":"11:51 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-11472","author":"daveb_of_wellington_nz","post":"The paper: I mention above “Shroud like experimental image formation during seismic activity” Giovann de Liso, [Shroud Conference, ENEA Frascati, Italy, 4 6 May 2010]. Can be found at: http://www.acheiropoietos.info/proceedings/De Liso Web.pdf.","date":"2012-05-20","mins":"4:50 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","title":"The Valencia Dawkins Challenge:  No Consensus on Consensus"},{"id":"comment-207130","author":"daveb_of_wellington_nz","post":"David Mo: “What is in question is the “respiratory gymnastics” that is the cause of the rubbing of the median nerve, according Barbet. ” I should like a specific reference from David Mo, wherein Barbet is alleged to have claimed that rubbing of the median nerve is caused by the breathing efforts of the crucifarius, as it would seem he has misunderstood Barbet’s claims, or has not read them, or has garbled two quite distinct phenomena. My reading of Barbet is that it is mere hammering of the nail into the wrist through the Destot space, which Barbet claims results in damage to the median nerve, thus stimulating thumb flexure. I do not recall that Barbet discusses the median nerve in connection with breathing efforts, which is the phenomenon challenged by Zugibe. Perhaps David Mo’s distaste of such clinical details, has resulted in some confusion. A few paragraphs towards the end of his discussion concerning the hands, Barbet does state the following: “But, alas, the median nerves are not merely the motor nerves, they are also the great sensory nerves. When they were injured and stretched out on the nails, in those extended arms, … they must have caused the most horrible pain. (etc)” The gospels indicate that death occurred within three hours of Christ being crucified, and this brevity of time surprised Pilate. It hardly reflects the ease of breathing claimed by Zugibe’s volunteers, and his attribution of death simply by shock and trauma, in such a short space of time, may I think be questioned..","date":"2015-08-01","mins":"4:22 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206939","author":"daveb_of_wellington_nz","post":"Artistic convention or not, Barbet hammered at least 12 nails into 12 amputated wrists and obtained 12 retracted thumbs. Barbet was not to my knowledge an ophthalmologist but an extremely experienced forensic pathologist. Regardless of whether a person on this site is an ophthalmologist or not, I should assume that if he can affix the initials MD after his name, he knows rather more about anatomy than one who is unable to stand the site of gore. Zugibe’s scenario appears too contrived to me. He has a volunteer step up to a simulated cross and binds his hands into gauntlets fitted with strain gauges and binds his feet. On that basis he claims that arm tensions do not exceed 67 lbs as against Barbet’s 207 lbs. He does not appear to have considered the mechanics of the actual process involved in crucifixion. The most efficient way a Roman soldier might be expected to direct this operation, would be to nail the prisoners arms on the cross beam while lying on the ground, and then a squad of no more than 5 soldiers can lift the beam on to the upright (stipes). During this procedure the full weight of the body is taken by the arms, and it matters not if the feet are nailed subsequently, the arms have had to bear a tension of about 207 lbs each as correctly calculated by Barbet. Hence wrist nailing would be required. A scenario of requiring the binding of the prisoner to an upright cross, and nailing his arms to the cross beam in situ presumably requiring the assistance of ladders, sounds altogether too clumsy and unreliable. To obtain Zugibe’s figures requires the body to be supported by some unknown means (soldiers?, pedestal? ropes?) until such time as the feet are nailed. I interpret Anoxie’s claims that because the amputated arms of Barbet were severed from the central nervous system, that damage to the median nerve could not have caused the thumb retractions observed by Barbet, and that therefore his interpretation of that being the cause is faulty. I should like to be more persuaded about this point. Barbet is careful to say that his nailing occurred immediately after amputation, claiming that there was still life in the arms(?). Is it not possible for the nerve cells to respond to such a stimulus in that situation, i.e. As soon as they are severed from the central nervous system? I should like a professionally competent based response to that question..","date":"2015-07-30","mins":"3:13 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206906","author":"daveb_of_wellington_nz","post":"Does this help, quoting Barbet from above? ” … dissections have revealed to me that the trunk of the median nerve is always seriously injured by the nail; it is divided into sections, being broken sometimes half way and sometimes two thirds of the way across, according to the case. And the motor nerves of the opponens muscles and of the short flexor muscle of the thumb branches at this level off the median nerve. The contraction of these themar muscles, which were still living like their motor nerve, could be easily explained by the mechanical stimulation of the median nerve.” Any comments, Stan?.","date":"2015-07-29","mins":"5:40 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206947","author":"daveb_of_wellington_nz","post":"Attempting to hammer an 8 mm thick square nail into a man’s arm to near the end of an unbraced cantilevered cross beam which is supported only at its mid point, while standing on a ladder leaning against the cross beam would be a rather hazardous and clumsy way of doing the job. The cross beam would tend to pivot on its central support, would vibrate and offer a most unsatisfactory surface for hammering. Far better to lay the cross beam on the ground where it can offer proper resistance, and hammer the nails in there. Ask any friendly builder. I have known research workers who did all their correct scientific calculations, but failed to take into account the basic engineering requirements of their project, occasionally with near tragic results. I believe this to be a fault with Zugibe’s analysis, as he failed to take into account the actual mechanics of crucifixion..","date":"2015-07-30","mins":"5:27 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206983","author":"daveb_of_wellington_nz","post":"I found several references searching on mechanical stimulation of nerves. Example: “The Effects of Mechanical Stimulation on Some Electrical Properties of Axons” by FRED J. JULIAN and DAVID E. GOLDMAN, From the Biophysics Division, Naval Medical Research Institute, Bethesda; http://jgp.rupress.org/content/46/2/297.full.pdf Sample extracts: “Many cells have the property of producing electrical changes in response to mechanical stimuli. In mechanoreceptors this property is highly developed and these changes can give rise to nerve impulses, Generally, a mechanoreceptor includes a transformer element which modifies the applied stimulus, a transducer element by which the stimulus is converted into an electrical change, and an electrical element in which the electrical change is converted into a nerve impulse (Gray, 1959). … ” “It has been long known that nerve fibers can be excited by mechanical stimuli (Tigerstedt, 1880), and it has been shown that short mechanical stimuli act like cathodal electric shocks (Rosenblueth, Buylla, and Ramos, 1953). Since mechanoreceptors seem to contain a nerve fiber or termination, it is tempting to regard this fiber as providing the transducer membrane. One may then expect the study of the mechanoelectrical properties of an axon to shed light on the behavior of the transducer element of mechanoreceptors.” In light of the above, and in view of anoxie’s contradiction of Barbet’s interpretation, and also Antero’s comment above, I should prefer to be informed of anoxie’s specific qualifications enabling the assertion of this contradiction, and if a specific authority can be referenced..","date":"2015-07-30","mins":"7:20 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-207098","author":"daveb_of_wellington_nz","post":"Surely we must accept at face value Barbet’s reporting that the thumbs flexed when he hammered nails into the wrists. He says he did it on at least 12 separate amputations. Clearly he was then leaving himself wide open to be refuted if subsequent investigators found otherwise. He also reports that the median nerve was damaged on all such occasions, Zugibe’s subsequent denial notwithstanding; I’m unaware that Zugibe repeated Barbet’s experiment with the nail. Barbet therefore reasonably inferred that it was this damage to the median nerve that caused the flexing. He does not report any damage to ligaments or other tissues such as muscles. It did not occur during amputation, but on hammering the nail. If it was not damage to the median nerve that caused the flexing, what is the alternative explanation?.","date":"2015-07-31","mins":"3:37 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-206816","author":"daveb_of_wellington_nz","post":"Nail through Destot space; Thumb flexed; Nerve damaged. Whatever, the thumb still flexed! On each and every attempt!.","date":"2015-07-29","mins":"1:06 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-207168","author":"daveb_of_wellington_nz","post":"If a reputable pathologist such as Barbet states that he drove nails into 12 amputated arms at the fold of the wrist, and each time the thumb flexed, no matter where he publishes such a claim, then it is reasonable to accept that the claim is true. His dissection revealed to him that damage had occurred to a nerve, which he calls the median nerve, and it may be that there is a difference in nomenclature. Zugibe does not seem to offer an alternative explanation as to why Barbet obtained the thumb flexures, nor does he seem to challenge the fact of the flexures. No one else seems able to offer an alternative explanation. Barbet does not report any damage to other related tissues. We seem to be left with either accepting that the thumbs flexed for reasons given by Barbet, or we are left with an inexplicable reason why thumbs flex when a nail is driven into Destot’s space..","date":"2015-08-01","mins":"4:19 pm","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-207452","author":"daveb_of_wellington_nz","post":"In all of the above discussion, no one has offered an alternative explanation as to why Barbet’s experiments with amputated hands resulted in a spontaneous flexure of the thumb into the palm of the hand, not merely once, but on 12 individual occasions. If not the median nerve, what was the cause? A deafening silence is the only reply I’ve so far seen!.","date":"2015-08-05","mins":"2:19 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-207237","author":"daveb_of_wellington_nz","post":"I don’t believe that Dr Zugibe ever drove a single nail into any amputated arm. The best he can do is to show an illustration of some poor woman the victim of a stabbing, with a needle through her hand where she just happened to be stabbed, not a deliberate aimed act of hammering a nail into a wrist at all, a pure random act. He has some volunteers step up to a supposed replica of a Roman cross, binds them into position, very comfortable they are, and claims they have no difficulty in breathing, as if that was the way executions were carried out, and there’s no need for wrist nailing. He shows no dissection of wrists to prove his point, and one might think he is getting all his anatomy out of text books. Barbet hammered nails into amputated wrists, always with the same result, and dissected them afterwards, and reports in some detail. I see no good reason to prefer Zugibe’s theoretical interpretation over Barbet’s detailed analysis of actual experiments carried out by him. No one else has attempted to replicate Barbet’s experiments, and unless and until some other professional makes the attempt and reports otherwise, they must surely stand..","date":"2015-08-02","mins":"4:23 am","url":"https://shroudstory.com/2015/07/28/comment-promoted-colin-berry-on-robert-bucklin/","cat":"science","title":"Comment Promoted:  Colin Berry on Robert Bucklin"},{"id":"comment-9616","author":"daveb_of_wellington_nz","post":"R: Don’t worry, the disciples had to have it explained to them too. Check out the original version, Parable of the Sower – Matt 13:3 8; Explanation – Matt 13:18 23. To hear and accept the message, you need the right disposition, whether it’s the gospel, or any other truth whatsoever, even such as “What is the Shroud?” A closed mind won’t make it – see the lampooning of Christians in the original heading. But God still wills that all may hear his message. Maybe we can help those with crippled minds and attitudes, but that kind of soil needs some fairly tough and harsh cultivating. Hope I’ve made it clearer. We have a lot of rural countryside in NZ..","date":"2012-03-25","mins":"6:42 am","url":"https://shroudstory.com/2012/03/24/someone-who-is-not-a-fan-of-russ-breault-and-the-shroud-of-turin/","cat":"news_&_views","title":"Someone who is not a fan of Russ Breault and the Shroud of Turin"},{"id":"comment-9612","author":"daveb_of_wellington_nz","post":"So there’s this farmer guy, see! And he’s got all this seed, like; But he wants to get the most out of his property and maximise his yield. So he scatters the seed all over the place! But what do you know!? It only ever took root on good ground. Not sure if there’s a lesson in religious economics there or not! Maybe it’s over to us to cultivate the ground first..","date":"2012-03-25","mins":"5:10 am","url":"https://shroudstory.com/2012/03/24/someone-who-is-not-a-fan-of-russ-breault-and-the-shroud-of-turin/","cat":"news_&_views","title":"Someone who is not a fan of Russ Breault and the Shroud of Turin"},{"id":"comment-84976","author":"daveb_of_wellington_nz","post":"And C14 (1988) post dates STURP (1978) who studied the question and found no other cotton elsewhere, except for minor surface contamination. It does seem careless to have ignored the Raes discovery in this area!.","date":"2014-03-04","mins":"7:15 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-84934","author":"daveb_of_wellington_nz","post":"It had been asserted that the world wide web was not operational in 1988, and that therefore the computer hacking hypothesis was “ridiculous”. Stephen has demonstrated that university and military computers were inter connected at this time, and that well known hacking events occurred. So this makes the hypothesis possible and even plausible. But I think it unlikely. The Marino / Benford / Rogers assertions of an “invisible patch” possibly even 19th century, are a much more likely reason for the mis dating, aided by the non representative sampling regime and the ditching of the protocols, and the refusal to carry out any other tests on the samples. Gilbert Raes had already determined in 1973 that the area had cotton contamination, whereas his sample from the main cloth did not. This fact was obviously carelessly overlooked when the choice of the C14 sample area was made. Scientific methods continue to advance, and doubtless there will come a time when more conclusive and non intrusive methods will allow more conclusive results to be obtained. We should wait and see what may transpire in the future..","date":"2014-03-04","mins":"3:53 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-87568","author":"daveb_of_wellington_nz","post":"If jackson is correct in asserting that the 1532 fire would result in the Shroud losing 95% of its vanillin, (and presumably if the temp was higher than 200o C it would be more than 95%), then clearly the presumed patch post dated 1532. Thus in his Thermochemica paper, Rogers writes: “…[Claims 37% of vanillin if 1260 correct]… The Raes threads, the Holland cloth, and all other medieval linens gave the test for vanillin wherever lignin could be observed on growth nodes. The disappearance of all traces of vanillin from the lignin in the shroud indicates a much older age than the radiocarbon laboratories reported.” http://www.shroud.it/ROGERS 3.PDF I have just spent most of a sunny afternoon attempting to search on vanillin. Perhaps the best resource concerning the anomalous nature of the C14 sample is the 2008 paper by Marino and Prior: “Chronological History of the Evidence for the Anomalous Nature of the C 14 Sample Area of the Shroud of Turin” which lists over 46 items of scientific evidence, plus an Appendix. It’s heavy going but well worth reading..","date":"2014-03-11","mins":"11:52 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-87859","author":"daveb_of_wellington_nz","post":"Hugh, I tend to the view that the rate of disappearance of vanillin from linen is so temperature dependent that it is almost worthless as an age determinant, unless it is reasonably certain that the object has been stored at a fairly constant temperature, which would be rare for many artifacts, possibly even extending to mummy wrappings in Egyptian tombs. However in the case of the Shroud, the presence of vanillin in the Raes area would almost certainly indicate that repairs were carried out there post 1532, especially if the fire had eliminated vanillin in the original cloth. This would seem to be a most important conclusion. I think we can forget the Jackson hypothesis on CO contamination skewing the C 14 results. I recently read that C14 proved unreliable in dating snail shells because of the absorption of older carbon in Ca CO3, and that it was also unreliable in peat samples in which more recent vegetable growth had occurred. So there are caveats..","date":"2014-03-12","mins":"3:12 pm","url":"https://shroudstory.com/2014/03/02/jones-the-turin-shroud-is-authentic-get-over-it/","cat":"other_blogs","title":"Jones:  The Turin Shroud is authentic. Get over it!"},{"id":"comment-104151","author":"daveb_of_wellington_nz","post":"Stephen Jones has taken Matt 7:22 23 out of context. In the context of Matt 7:21, it seems that it is not sufficient to confess Jesus is Lord. As for the General Judment mentioned by Chesterbello, the key to heaven will only be granted to those who have carried out the corporal works of mercy, stated and specified three times in Matt 25:31 46. No mention of Grace, no mention of Church. So much for the Faith vs Works debate. Claims of allegiance are not enough, not even prophesying. Acts of care are what is required..","date":"2014-04-26","mins":"4:00 pm","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-103536","author":"daveb_of_wellington_nz","post":"Arguing with a fanatic can bear no fruit worth the eating, and as for winning an argument with such it is impossible. It is an easy matter to take scripture out of context, Screwtape does it all the time. Stephen has taken Matt 7:22 23 out of context. What is the context? It is Matt 7:21; “It is not those who say to me, “Lord, Lord”, who will enter the kingdom of heaven, but the person who does the will of my Father in heaven.” So it is not a matter of mere piety. At the end of his earthly mission in his last public discourse, we have the picture of the Last Judgment, and we learn what must be done. Does it focus on belief? Does it focus on faith? Does it focus on prayer. Does it focus on confessing Jesus as Lord? They’re all important, but no! The key to the kingdom is only held by those who have carried out the corporal works of mercy, repeated three times! see Matt 25: 21 46. So much for the Faith versus Works debate!.","date":"2014-04-25","mins":"7:03 am","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-104257","author":"daveb_of_wellington_nz","post":"Mike M: “Acts of mercy done with the wrong motive can be equally condemning.” Check Matt 21:28 31, Parable of the two sons. “What is your opinion? A man had two sons. He came to the first and said, ‘Son, go out and work in the vineyard today.’ 29 He said in reply, ‘I will not,’ but afterwards he changed his mind and went. 30 The man came to the other son and gave the same order. He said in reply, ‘Yes, sir,’ but did not go. 31* Which of the two did his father’s will?” They answered, “The first.” Jesus said to them, “Amen, I say to you, tax collectors and prostitutes are entering the kingdom of God before you.” Motives are clearly secondary. I think I would place the direct words of Jesus as recorded in Matthew ahead even of St Paul’s more obscure theology. I agree James’ epistle has the correct approach and is consistent with Matt 25:31 46. Luther was reluctant to include James epistle in his translation and only did so out of respect for tradition..","date":"2014-04-26","mins":"9:11 pm","url":"https://shroudstory.com/2014/04/25/some-advice-from-stephen-jones/","cat":"other_blogs","title":"Some Advice from Stephen Jones"},{"id":"comment-17575","author":"daveb_of_wellington_nz","post":"Suggestion: There could well be a crucial question of timing in the whole death trauma, as to when the bilirubin levels in the blood changed from normal. As I understand it, the head cloth could well be placed over the head at some time during the crucifixion to hide the condemned person’s face and his grimacing from passersby – I think there might be something in Jewish Law about it. It could well have been removed during the laying out, the jaw cloths then placed and tied together with any other tying then done, and the body then shrouded and wrapped. Max Patrick Hamon would have some ideas about the whole wrapping business, but a medical expert would need to comment on the timing of bilirubin variations. Because of these timing variations, it is quite possible that both sudarium and shroud might show different bilirubin levels. But it’s all very conjectural..","date":"2012-10-13","mins":"12:17 am","url":"https://shroudstory.com/2012/10/12/stephen-e-jones-starting-a-new-series-of-posts/","cat":"other_blogs","title":"Stephen E. Jones Starting a New Series of Posts"},{"id":"comment-28159","author":"daveb_of_wellington_nz","post":"We have frequently discussed the limestone “dirt” and the “poker holes” on this site. I note a comment in Stephen Jones’ posting that the limestone was only found under the right foot. This is inexact. It was also found on a knee cap and the nose, as if from a fall, prompting John Klotz to recount a story, being tripped up by his dog ‘Bogie’ with the result that John actually fell on his nose and his knee cap, an unduly extreme form of dedicated corroboration. ‘Gabriel’ has often mentioned that the published paper on the limestone lacked peer review and attempts should be made to confirm the results. It has also been suggested that the strontium impurity if quantitatively measured should prove an excellent indicator of geographical provenance. The issue clearly needs revisiting. We also discussed the poker holes in Dan’s posting of February 25, when Stephen first commenced his Part 2.6, which it seems draws heavily on some of Ian Wilson’s commentary, although it has seemed sensible for Stephen not to have accepted the incident reported by Arculf as their cause. There are a number of possible scenarios. One such is that at some early stage the Shroud may have been used as a folded altar cloth and damaged by grains of burning incense. Certain ancient eucharistic rites mention that altar cloths are to be so viewed as being the sindon of the Lord. Another possible scenario is that it may have been subjected to an unknown trial by fire, as I mentioned in a comment on the Feb 25 posting, arising from another comment by Wilson. Wilson’s other source is an Arabic document found in Egypt referring to a trial of the “Image of Edessa”: “Hail Abgar, who was worthy to behold the image of the Lord made without ink on cloth, the image of the worker of miracles. It was not effaced or burnt when it was tested by fire and water before the great multitude.” This may well have been some otherwise unknown trial. However in view of the reference to Abgar, there is a problem here identifying this implicit test as causing the poker holes which obviously happened when the Shroud was folded into four layers. (A) Four layers doesn’t fit with Wilson’s theory of tetradiplon. (B) If this test did cause the poker holes, it is an extremely rare reference to an occasion when the Shroud was folded in this way. The Arabic document does imply a practice of subjecting such objects to trials by ordeal, and perhaps this did happen to the Shroud cloth at some unknown time. Or perhaps we should just accept that the holes may have been caused by some mere mishap such as burning incense..","date":"2013-03-23","mins":"8:08 am","url":"https://shroudstory.com/2013/03/23/stephen-jones-adds-another-part-to-his-series/","cat":"other_blogs","title":"Stephen Jones adds another part to his series"},{"id":"comment-97442","author":"daveb_of_wellington_nz","post":"A point extremely well made. I’ll try to remember that one. But I guess that to err is also human..","date":"2014-04-07","mins":"3:52 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","title":"Stephen Jones is even questioning my beliefs about the Resurrection"},{"id":"comment-97165","author":"daveb_of_wellington_nz","post":"“I told Dan and his commenters that the Holy Spirit had been prompting me to warn both them and Dan that they who personally attack me, a Christian who is only seeking to serve his Lord, that Jesus will, if they don’t repent, avenge their attacks on me.” “I strongly believe that Jesus is going before me in this and that He will progressively reveal what REALLY happened in the C 14 dating of His Shroud.” It is easy to fall into the trap that one is the spokesperson for Jesus. The worst offences committed by Christians were always done in His name. The Egyptian desert monks under St Cyril of Alexandria murdered the renown female mathematican Hypatia for this reason. Dare one mention the horrors committed by the western Crusaders against their orthodox brethren in the east, the methods of the Spanish inquisitors, the horrors perpetrated by both Elizabethan and Jacobite persecutors against those they disagreed with. Stephen is no doubt familiar with Foxe’s Book of Martyrs. One can cite the witch trials of medieval Europe, and those more recently in Salem, check Artur Miller’s “The Crucible”. All done in the name of Christ! But other agendas were at work and the real culprit is laughing his demonic head off in his home of Hades. Stephen is on shaky ground when he accuses other God fearing folk of heresy. But he is following a well trodden precedent! It can be no accident that the most virulent evangelical adherents also tend to become the most fanatic of agnostics and atheists. It is a mind set that drives them, not God’s truth at all..","date":"2014-04-06","mins":"4:05 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","title":"Stephen Jones is even questioning my beliefs about the Resurrection"},{"id":"comment-97211","author":"daveb_of_wellington_nz","post":"Delightful! I’ve passed it on to a scholarly Augustinian priest acquaintance who I think might also appreciate it!.","date":"2014-04-06","mins":"6:51 pm","url":"https://shroudstory.com/2014/04/06/stephen-jones-is-even-questioning-my-beliefs-about-the-resurrection/","cat":"other_blogs","title":"Stephen Jones is even questioning my beliefs about the Resurrection"},{"id":"comment-36813","author":"daveb_of_wellington_nz","post":"The proposed List of Contents indicates that Mr Jones’ focus will be on the Passion narrative, so that it would therefore seem that a forensic type approach is envisaged. He might like to look a little further into the Apostolic and post Apostolic church biblical texts to see if there might be some other indications as well. An obvious one is that he will have to deal with the description of the cloths found in the tomb. Mr Hamon has from time to time mentioned a few other more obscure indications. Are there suggestions or secret indications of the Shroud in various obscure references to linen, apparel and so on? Why did Mary Magdalen mistake the resurrected Christ for the gardener – was it because he wore a himation like a gardener, in reality the Shroud? What is behind the vision of the large cloth that Peter sees descending from heaven – is this an obscure reference to it? There are further suggestions or hints in some Revelations’ texts – the horseman named Faithful and True riding into battle and yet his cloak is already soaked in blood; there are saints dressed in fine white linen, and so on. The gospel accounts were of course written well after the events they describe, but other possible references might be found in some of the other narrative sections. There is an obvious problem of unavoidable speculation in these references, and they can only be inferred from interpretation. They might not appeal to Mr Jones’ preference for an evangelical interpretation of the texts, and he might have to acknowledge an underlying ‘disciplina arcani’ to get at them. It also tends to be a fairly specialized field with which he might have some difficulty. However he has written on such issues as ‘coins on eyes’ and commented on pareidolia. He may like to consider whether there might be obscure references to the Shroud in some of the biblical texts apart from the specific Passion narrative..","date":"2013-06-12","mins":"5:12 pm","url":"https://shroudstory.com/2013/06/12/stephen-jones-starting-new-section/","cat":"other_blogs","title":"Stephen Jones Starting New Section"},{"id":"comment-86288","author":"daveb_of_wellington_nz","post":"Karol Jozef Wojtila as John Paul II was pope from 1978 until his death in 2005. His canonization is set down to occur on April 27, 2014. He had a significant part in the eventual downfall of Soviet communism, commencing in his own homeland of Poland. He was therefore an effective enemy of the Soviet regime and all it stood for, and of course the C14 dating of the Shroud occurred during his pontificate. But there is a simpler solution of why the C14 dating failed to realize a date consistent with a first century provenance, That is of course the non representative sampling and the likelihood that the samples taken were from a patch different from the main cloth..","date":"2014-03-08","mins":"3:15 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-46364","author":"daveb_of_wellington_nz","post":"Regardless of what Catholic John Walsh and Evangelical Stephen Jones might say, the appropriate response of the Catholic Church, still having to cope with the results of a most unsatisfactory radio carbon dating test, has to be “Caution!” No way is it going to seek to be embarrassed by a proclamation one way or the other that later investigations might well prove to be faulty. It is possible for even a pro authenticist to be a fanatic, and their ravings are best ignored..","date":"2013-10-07","mins":"7:07 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"},{"id":"comment-25799","author":"daveb_of_wellington_nz","post":"One needs to understand the spirit world mind set of the ancients, which can be traced back to primeval times. There is always an underlying assumption of divine intervention in the outcome of such tests and ordeals. And it has some connection with oracular divination. The Urim and Thummim contained in the priests’ breastplates ordained in Exodus 28:30 is a relic of this belief, the drawing of lots to decide the replacement apostle in Acts, and in modern parlance we talk of drawing the short straw. In modern times we might see the outcome as a random event, but in ancient times such outcomes were seen as an expression of divine will. Even in late medieval times in Europe those suspected of being witches were subject to various ordeals to test innocence or guilt. I am coming to the view that the event reported by Arculf may have referred to an outer burial cloth, possibly used for transporting the body from the cross to the tomb. Purpose of the Sultan’s test was to make a decision between two claimant groups. However from the wording of the Egypt Arabic report, this could well have been a separate ordeal to test whether the Image was of divine or infernal origin. In this case the Image of Edessa seems to have been specifically involved. If this was the event that resulted in the poker holes (note both fire and water are mentioned), then this would argue for the Image of Edessa and Shroud being the same object, but this can only be conjecture. The holes may well have just as easily been caused when the Shroud was being used as an altar cloth. We like to imagine that our modern methods of testing hypotheses are rather more refined and definitive, but they certainly seem to be less hazardous, particularly if NDT..","date":"2013-02-27","mins":"2:31 am","url":"https://shroudstory.com/2013/02/25/stephen-jones-summarizes-the-burn-marks-and-water-stains/","cat":"other_blogs","title":"Stephen Jones summarizes the Burn Marks and Water Stains"},{"id":"comment-25764","author":"daveb_of_wellington_nz","post":"Re Poker holes: There are at least two possible explanations, either the Wilson hypothesis that they occurred from the “trial by fire” under Sultan Mu’awiyah, or else the Guerresschi / Salcito inference that they occurred, perhaps from burning incense when the Shroud, folded lengthwise and widthwise, was used as an altar cloth. There are a number of very early references that altar cloths were to be considered as the burial cloth of Christ (I can chase these references if wanted). Possibly there may have been occasion(s) when the Shroud was actually used as such. Wilson’s hypothesis that they may have occurred as a “trial by fire” is described in Ch 11 of his “The Shroud” 2010. The trial was reported by Bishop Arculf (check internet on Bishop Arculf). Two competing groups in Edessa were claiming the cloth, The report claims that the Sultan cast the cloth towards the fire, the cloth floated over it and then drifted towards one of the claimant groups, “the believers”. Wilson also mentions another separate source which also refers to a “trial by fire and water”. Wilson notes that the use of a hot poker was a common means of “trial by fire”. The separate source is an Arabic document found in Egypt referring to a trial of the “Image of Edessa”: “Hail Abgar, who was worthy to behold the image of the Lord made without ink on cloth, the image of the worker of miracles. It was not effaced or burnt when it was tested by fire and water before the great multitude.” This may well have been some otherwise unknown trial. There are problems with the Wilson hypothesis: (1) It is second hand reporting based on Arculf’s oral report of his perception to Abbott Adamnan of Iona, and recorded in Venerable Bede; (2) The event occurred in Jerusalem, but explained by being temporarily housed there during post earthquake rebuilding in Edessa; (3) Arculf reports the cloth as being about 8 feet long which can only be the Shroud if it was folded in two; (4) Arculf does not report an image on the cloth; (5)The cloth may have been an outer burial cloth, possibly used for transporting the body from the cross to the tomb; (6) One needs to read past the legendary elements to the story; (7) The event occurred about 679 AD, which argues against Wilson’s Mandylion hypothesis. When it was still supposed to be hidden in its frame. Notwithstanding these problems, the holes may have been caused by some other unknown “trial by fire and water”, (perhaps using a hot poker) and mentioned in the Arabic document..","date":"2013-02-26","mins":"4:51 pm","url":"https://shroudstory.com/2013/02/25/stephen-jones-summarizes-the-burn-marks-and-water-stains/","cat":"other_blogs","title":"Stephen Jones summarizes the Burn Marks and Water Stains"},{"id":"comment-46592","author":"daveb_of_wellington_nz","post":"Louis, Thank you for the reference at #17. I went past the image, yes well chosen, and onwards to read the article, thought provoking and well written. It deals with the problem of the universal deafening silence to anti Christian persecution in very many parts of the world. In NZ we are I think, or more truthfully have been, better served by the media than much larger countries, preoccupied as they are with their own internal concerns. We are better informed than many other western populations concerning international issues. Accordingly the content of the article came as no new revelation to me, as it might to others. The writer makes a valid point concerning the silence with which such anti Christian persecution is universally treated. We have a cynical saying here, perhaps common to other smaller countries, that “War is God’s way of teaching geography to Americans.” I have worked with professionals from USA during my long career, often finding them to be less informed about international matters than my fellow countrymen. I recommend the article to others. Concerning the TS’ value in the quest for Faith, I see its role as at least a useful proselytising tool to a cynical atheistic generation, self satisfied with its own accomplishments, gods of their own handiwork, but which craves a sign of the truly divine..","date":"2013-10-09","mins":"2:36 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"},{"id":"comment-46388","author":"daveb_of_wellington_nz","post":"A paraphrase of Pope Benedict XVI quoted in the UK announcing the beatification of John Henry Newman in September 2010: “Faith without adequate reason, is fanaticism!”.","date":"2013-10-07","mins":"3:07 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"},{"id":"comment-46444","author":"daveb_of_wellington_nz","post":"That is not the issue; your statement “A faith which depends on relics, … is no faith at all” is I consider unduly judgmental. For reason to operate at all, it must flow from empirical evidence of some kind. Relics may properly serve as one type of such empirical evidence for some persons and I do not see that condemnation is at all in order! I would turn the accusation around and say that “Faith wothout Reason is no Faith at all!” It would in fact be unthinking Fanaticism!.","date":"2013-10-08","mins":"2:08 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"},{"id":"comment-141219","author":"daveb_of_wellington_nz","post":"It is always an easy matter to criticise those who have gone before, while having the distinct advantage of hindsight, in the case of STURP now more than 30 years. The earlier 1969 73 Turin Commission appointed by Cardinal Pellegrino had been a secretive matter, even the names of the members not being revealed until 1976, only some two years before the STURP team were granted their access to the relic. The names of the Commission are now a matter of record, but they did include Professor Curto an expert on textiles and an agnostic, later replaced by Professor Gilbert Raes of Ghent, who was granted some significant samples. It also included Noemi Gabrielli an art director, presumably knowledgeable on matters of art. Conclusions of this Commission were quite indefinite. The best they came up with was a set of recommendations for further testing, and that no fraudulent substance had been detected, and the results of the sticky tape pollen sampling by Max Frei. Attempts to analyse the bloodstain samples were quite fruitless, and had to await the later investigations by the STURP specialists. The imaging specialist on the later STURP team was Barrie Schwortz. As well there were those with X ray equipment, and various other radiant equipment, UV and IR. The initial ignorance concerning the true nature of the image can be gleaned from Barrie’s later comments, that he imagined he was getting a free trip to Turin, discover that the image had been painted, he would see the sights, and return home. And of course that is not how things turned out at all. Even loose cannon Walter Mc Crone maintained to his dying day that the image had been painted. That was the extent of the ignorance concerning the nature of the image in 1978. It was only when STURP examined the cloth by back lighting so that only the bloodstains remained visible, and when X ray plates determined the absence of any heavy minerals, that painting could be conclusively excluded. The STURP project was carried out under tight constraints and protocols, not merely in time, only 72 hours being granted, but also the requirement of prior approval for their experimental programme. There was therefore only limited opportunity for extending this predefined scope as a result of any fortuitous or serendipitous discovery during the project. It may be true that the reasons for the image negativity with its left right and light dark reversals, because of the type of imaging process inherent in whatever process caused the image, whether by contact or other, was not understood and had not taken root. But that insight has the advantage of a great deal more knowledge resulting from the work of the STURP project itself, and also the advantage of duration in time to reflect on its implications..","date":"2014-07-30","mins":"7:50 am","url":"https://shroudstory.com/2014/07/30/a-significant-criticism-of-sturp/","cat":"other_blogs","title":"A Significant Criticism of STURP"},{"id":"comment-25682","author":"daveb_of_wellington_nz","post":"An excellent paper on the burn marks and water stains was recently referenced by Hugh Farey: “FURTHER STUDIES ON THE SCORCHES AND THE WATERMARKS” by Aldo Guerreschi – Michele Salcito, Dallas Confrence 2005, http://www.shroud.com/pdfs/aldo4.pdf Authors conducted a simulation experiment of the Chambery fire, and succeeded in replicating the damage, which they deduce was from some type of hot bar in the reliquary which fell, giving the scorch marks. They also explain the previous water marks as caused by the cloth being folded concertina fashion and placed in an earthenware jar, possibly as a result of condensation. Wilson mentions a TV demonstration he was involved in with Guerreschi showing how this watermark damage could be replicated. The authors also mention the so called “poker holes” but refrain from an explanation. However I have often wondered if this could have resulted from a trial by fire mentioned by Wllson and reported by Bishop Arculf around 680 AD, see “The Shroud”, Wilson 2010, Ch 11, ‘Trial by Fire’. The trial was ordered by Sultan Mu’awiyah to settle a dispute between two rival factions bickering over the cloth’s ownership. Arculf reports the cloth (as he saw it) as being about 8ft long, which would match the Shroud if doubled, and account for the symmetry of the poker holes. [I don’t need Yannick to tell me that the Shroud is not the Edessa image yet again. He doesn’t know, neither does Wilson, and neither do I!].","date":"2013-02-25","mins":"6:37 pm","url":"https://shroudstory.com/2013/02/25/stephen-jones-summarizes-the-burn-marks-and-water-stains/","cat":"other_blogs","title":"Stephen Jones summarizes the Burn Marks and Water Stains"},{"id":"comment-142958","author":"daveb_of_wellington_nz","post":"It might be not so surprising that there is a variety of interpretations on the question of cotton. It may even be that repairs were carried out in different parts of the cloth, by different persons and at different times. The 2005 Benford Marino paper may illuminate this. The authors mention their interview with Mr Michael Ehrlich of the firm “Without A Trace” in Chicago. Ehrlich confirmed that the modern time saving method of “Inweaving” would be invisible from the front, but easily recognisable from the back as claimed by Flury Lemburg. This seems to be the reason why she dismissed the possibility of “Invisible weaving”. Frau F L is one of the few persons who have inspected the back of the cloth, and of course there is no sign of the “Inweaving” which she would assert would be visible there. This would seem to be the principle reason why she is so frequently quoted as claiming that there is no invisible weaving. The B M paper continues: “However, the technique used in 16th Century Europe, called “French Weaving,” is an altogether different technique from Inweaving.” It results in both front and back side “invisibility.” but nowadays is only done on small scale repairs because of time and cost. “According to Mr. Ehrlich, French Weaving involves a tedious thread by thread restoration that is undetectable.” The paper gives arguments why it seems very likely that French Weaving was the method used. But that is not all! The authors provide a reference by Professor Piero Savarino, later scientific advisor to Cardinal Poletto: In his 1998 booklet, he stated that the 1988 C 14 testing might have been erroneous due to “extraneous thread left over from ‘invisible mending’ routinely carried out in the past on parts of the cloth in poor repair”. Thus it seems likely that “invisible mending” was regarded as maintenance work routinely carried out! Hence this raises the likelihood that there are other parts of the cloth which may well have cotton contamination, along with the mordants, dyes and other substances used in such work. In other words, just not the area from the Raes sample. Considering the difficulties there have been in discerning the contamination in the Raes area, and its implications for the 1988 testing, this raises the possibility that any such future testing would require intense scrutiny of the samples to ensure that they also were not from areas subject to such repairs. This might well prove extremely difficult, as it seems to be only discernible by teasing the threads apart. As to who carried out such work Benford and Marino believe it was done under Savoy Duchess Margaret of Austria in the 16th century. But it might well be that similar work was also carried out by Sebastian Valfre in 1694, and also by Princess Clotilde in 1868 69. Other possible sources of minor cotton contamination could include loom remnants from a previous weave, apparently postulated by Raes, and also from the variety of cotton gloves used by the STURP team in 1978. It is known that the STURP team did examine various areas of the cloth under the microscope in attempts to discern cotton, but apparently found none. However in view of Mr Ehrlich’s comments that the work was invisible from the surface, this may not signify a great deal. It appears necessary to tease the threads apart in order to discern it..","date":"2014-08-08","mins":"7:20 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-15306","author":"daveb_of_wellington_nz","post":"I fall back on John P Meier’s precept: “What can be gratuitously asserted, can be gratuitously denied!” The absence of a wife in the gospels points strongly to the likelihood that Jesus remained celibate. All the more likely as he seems to be a pioneer in the platonic friendships he is able to form with women, unusual for someone of his culture. Likewise, Meier would have it that James is in fact at least the legal brother of Jesus. He may have been adopted, He may have been a step brother from an earlier marriage by Joseph, Or he may have been a true blood brother. BUT we do not know, and can’t know now. Because the Israeli Antiqities Authority went and cleaned his ossuary discovered at Talpiot! Ask those two luminary archaeological “authorities” Simcha Jacobovici & Charles Pellegrino. And they can write a more imaginative yarn than De Wesselow anyway! All that we know of Peter from Acts is that “He went to another place!” Although the parading of the Shroud as a predicate for the core of the Christian faith is properly described as bizarre, I was reminded of a comment in one of Albert Dreisbach’s papers. He asserts (I paraphrase): ‘St Nino of Georgia in the 4th century, maternal nephew of the Patriarch of Jerusalem, reports that the sudarium was found by Peter who took it. Ishodad of Merv writes that whenever Peter made an ordination he arranged it on his head, apparently giving rise to a custom of bishops similarly arranging the turbans on their heads.’ [Lazarus and Jesus: Rev Albert R Dreisbach, Atlanta Shroud Conference 2005, authorities cited]..","date":"2012-08-21","mins":"6:46 am","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"},{"id":"comment-143012","author":"daveb_of_wellington_nz","post":"Thanks Max. I was aware that Valfre had sewn the black silk lining, but had not looked into his abilities. If one can take the inference from the Piero Savarino ref, and the plenitude of weavers skilled in the art who were available during the period 16th – 19th centuries, there might well be more areas of the cloth which were so repaired by various others. Regarding Hugh’s comment that such repairs are readily visible under the microscope and that (weaving) inconsistencies frequently appear on the cloth, my understanding is that STURP searched for cotton in other areas by microscope, but were unable to identify any at that time. So it seems to be yet another enigmatic aspect of the cloth. It seems that nothing should be assumed if whenever any further samples might be taken for testing..","date":"2014-08-08","mins":"4:18 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries"},{"id":"comment-15387","author":"daveb_of_wellington_nz","post":"Max Patrick Hamon :Actually in “the Gospel of Mark” the Aramaic is Peter’s not Mark’s… I couldn’t disagree with that comment..","date":"2012-08-22","mins":"4:16 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"},{"id":"comment-15390","author":"daveb_of_wellington_nz","post":"1 Peter claims to have been set down by Silvanus (3:12). I wonder if Silvanus and Mark collaborated in setting down Peter’s gospel account? Are there any linguistic analyses comparing 1 Peter and Mark’s gospel? Maybe the two forms are too disparate for such a comparison to be made: two essentially different subjects; 16 chapters in Mark, only 3 in 1 Peter..","date":"2012-08-22","mins":"5:55 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"},{"id":"comment-15388","author":"daveb_of_wellington_nz","post":"But quite likely the Aramaic was orally transmitted, and not necessarily committed to writing. For what it’s worth, final verses of 1 Peter (assuming it’s authorship is Peter’s) “Your sister (church?) in Babylon (i.e. Rome) … … sends you greeting, so does my son (metaphor?) Mark. 1 Pet 3:13. (If not Peter’s authorship, at least a tradition that Mark was in Rome with Peter).","date":"2012-08-22","mins":"5:02 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"},{"id":"comment-15320","author":"daveb_of_wellington_nz","post":"If the gospels were ever originally written in Aramaic, we have no way of knowing what the original word for ‘brother’ used in these drafts was, as we only have the Greek. They were certainly never set down in Hindi or Sanskrit..","date":"2012-08-21","mins":"4:50 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"},{"id":"comment-15319","author":"daveb_of_wellington_nz","post":"I wrote a precis of Meier’s Vol 1 of “A Marginal Jew” for my own reference, and copied extracts of his chapter summaries. (I had the book on loan) Re Jesus’ brothers: Meier notes the literary trend from the lierary roughness of Mark, “telling it like it is” to the message proclamation intent evident in Matthew and Luke, to the somewhat more metaphysical intent of John. This is evident for example in describing Jesus’ trade as a woodworker. A similar trend is evident in describing his family relationships. Here are my notes on his brothers: “Meier discusses the fourth century doctrines of Mary’s perpetual virginity, but considers that the “brothers” and “sisters” of Jesus mentioned in the gospels are in fact blood brothers or sisters of Jesus – he refers to the typical use of the Greek word ‘adelphos’ (brother or half brother) rather than other terms (e.g. ‘anepsios’) in common use for relationships such as cousin or step brother – thus he rejects Jerome’s and other patristic interpretations of these relationships. ” In view of the legal status of adoptees, I think it may be inferred that the word used for “brother” might also include these. A summary extract on his virginal conception: “The tradition that Jesus was virginally conceived by the power of the Holy Spirit is also affirmed in both Infancy Narratives. The truth of the claim, which was hardly verifiable even when Jesus appeared on the public stage as an adult, is a fortiori not open to verification today. Decisions on this tradition, limited within the NT to the Infancy Narratives, will largely be made on the basis of one’s philosophical views about the miraculous and the weight one gives to later Church teaching.” “In any case, the precise origins of the virginal conception tradition remain obscure from a historical point of view. A counter tradition that Jesus was illegitimate is not clearly attested until close to the 2d century AD; it is most likely a mocking, polemical reaction to the claims of the Infancy Narratives, perhaps as filtered through popular disputes.” Extract on his marital status: “In the face of all this information about members of Jesus’ family, the total silence about a wife or children is best taken as indicating that Jesus chose the highly unusual – but not unknown – path of celibacy.” In view of Meier’s rigorously conservative approach to his analysis of the material (i.e. Any speculation is absolutely minimal) I feel that his analysis is probably the best we are ever likely to derive on the historical Jesus, until any new evidence might come to light,.","date":"2012-08-21","mins":"4:46 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"},{"id":"comment-15346","author":"daveb_of_wellington_nz","post":"Thank you for mentioning the Peshitta, which is a new topic for me. I found the Wikipedia article an informative introduction to it. It seems to have been a type of Syriac Vulgate finalised in the 5th century from earlier Syriac NT versions. The claim is made that the OT was a 2nd century translation of the Septuagint, includes the deutero canonicals, but with Sirach claiming to be translated from the Aramaic, It is interesting that the Syriac church does not recognise the later NT works (2 Peter, Revelations, etc) as canonical. Although the claim is made that the original NT gospels for instance were translated from Aramaic originals, I think caution is required here. The Western consensus seems to be that the evangelists wrote in Greek, with various degrees of literary competence in the koine, e.g. It is said that Mark’s Greek is a bit rough, whereas Luke’s is more literary. Although Aramaic is likely to have been the native tongue of two of the Synoptic evangelists (Matthew and Mark), Greek was more the lingua franca throughout all of the eastern empire. If there was a desire that these works be read in the churches, then Greek would likely be the language in which they would be set down. John’s gospel seems to include Greek concepts, with his emphasis on the logos. It is an interesting debate, but I feel is somewhat off topic for a sustained discussion here. I think I would have serious reservations re Ernest Martin’s work, as I suspect it is agenda driven (“Church of God”). ..","date":"2012-08-22","mins":"7:52 am","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"},{"id":"comment-15340","author":"daveb_of_wellington_nz","post":"Louis: You are entitled to your view as to the relative merits of Fitzmeyer and Meier, but I don’t necessarily share that. A quick search on Google brought me to a site where it seems they are of similar minds as far as the word “adelphos” goes. But I also discovered the curious idea that the Eastern church (Greek?) had a broader understnding of the word. I have some recollection that Carmignac may be one of a few Frankish biblicists inclined to reject Marcan priority, apparently a curious ultra conservative trend. I don’t think I want to walk there. Meier’s credentials: John Paul Meier is a Biblical scholar and Catholic priest. He attended St. Joseph’s Seminary and College (B.A., 1964), Gregorian University [Rome] (S.T.L, 1968), and the Biblical Institute [Rome] (S.S.D., 1976). Meier is the author of nine books and more than 60 scholarly articles. He was editor of The Catholic Biblical Quarterly and president of the Catholic Biblical Association. Meier is Professor of New Testament in the Department of Theology at the University of Notre Dame. Before coming to Notre Dame, he was Professor at The Catholic University of America..","date":"2012-08-21","mins":"11:02 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"},{"id":"comment-9671","author":"daveb_of_wellington_nz","post":"I followed up Ron’s clues about Dreisbach. There were some postings on this site around Sept 2011. Most of the other Google searches I did weren’t all that successful, despite searching on “Shroud, Dreisbach, Lazarus”. I went to Barrie’s site and searched on Dreisbach and Lazarus but only came up with a PDF by Dreisbach: “THE ATLANTA INTERNATIONAL CENTER, FOR CONTINUING STUDY OF THE SHROUD OF TURIN, INC. ATLANTA, GEORGIA” – “THE SHROUD AND HEALING 1999 (Revised) © Albert R. Dreisbach, Jr.”. This is at: http://www.shroud.com/pdfs/dreisbch.pdf. I quickly scanned through it, and obtained an impression that the paper may have been wanting to associate the Shroud with the Veronica, when it is known that they are in fact two distinct objects (check Veil of Manopello). In this paper, Dreisbach cites several apocryphal works, in order to make what case he is aiming at. Someone may want to check it out and come up with more specific comments about it. It seems Dreisbach an Episcopalian minister, was widely respected among the Shroud world, but he died some years ago..","date":"2012-03-26","mins":"5:38 pm","url":"https://shroudstory.com/2012/03/26/get-thee-upset-or-not-thomas-de-wesselows-new-book-on-the-shroud/","cat":"art","title":"Get Thee Upset! Or Not: Thomas de Wesselow’s New Book on the Shroud"},{"id":"comment-9665","author":"daveb_of_wellington_nz","post":"I’m right there with Annie Cee. I recall reading the “Gospel of Thomas” back in the 1980’s as part of a Religious Studies major. It seems to have been first published in 1959 following its discovery in Upper Egypt in 1945, and because of this excited some interest at the time. It’s just another far fetched Coptic Gnostic writing, merely attributed to yet another apostle to assert its specious apostolic source. There’s probably not a single apostle that some Gnostic didn’t claim to be the author of some specious work or other. There may be some validity in the apocryphal “Acts of Thomas” (Syriac) which describes his martyrdom in Madras. I recently published an article by a local Indian lady parishioner, and it’s evident that St Thomas is widely revered throughout the Christian community in India, and his activities there seem to have borne fruit on the Malabar coast, St Francis Xavier discovered established Christian communities there during his missionary activities in the 16th(?) c. There may be something in the theory that “the men in white” at the tomb were the first arrivals’ impression of the Shroud image. However we have the Emmaus story, where the resurrected Christ walked, talked, ate and drank with two apostles, and the appearance of Christ to the apostles with and without Thomas occurs in the “upper room”. All of them were convinced that Jesus had risen from the dead. This doesn’t sound like a static image at all..","date":"2012-03-26","mins":"3:45 pm","url":"https://shroudstory.com/2012/03/26/get-thee-upset-or-not-thomas-de-wesselows-new-book-on-the-shroud/","cat":"art","title":"Get Thee Upset! Or Not: Thomas de Wesselow’s New Book on the Shroud"},{"id":"comment-36583","author":"daveb_of_wellington_nz","post":"The image does not have to have been caused by the Resurrection as an “arch miraculist” might argue, for it to be PERSUASIVE evidence of the Resurrection; OR as Yannick Clement might insist, as a “sign of the Rersurrection”. I think the value of Occam’s razor in this case is that it can now be argued a) firstly, that the “simplest solution is that the image was caused by some as yet unknown means from shrouding a corpse, and that this occurred before corruption commenced”; b) secondly, that the “simplest solution as to the identity of the corpse is that it was Jesus Christ, who as it happens is the only person who ever claimed to have survived death”; c) thirdly, that the “simplest solution of there no longer being any body present with no sign of manual removal, and no other known place of burial, that the said claims of Jesus Christ, for which there is testamentary evidence, is that they are VERY LIKELY to be true”! I think this is the strict logic of the case and the appropriate use of Occam’s razor. Ultimately, however, as such a claim is outside normal human experience, and it is just possible to conjecture that the body was in fact deliberately removed, the truth of the Resurrection can only be accepted as a Faith decision. The Shroud image is a persuasive but not strictly conclusive argument which can support that Faith decision. The steps (a) through (c) is I think the appropriate use of Occam’s razor. It is not necessary to argue that the image was caused by the Resurrection event itself, for it to be a sign of the Resurrection, whether it was so caused or not. The gap in de Wesselow’s argument is that it does not adequately explain the disappearance of the body, nor who may have removed it, nor for what purpose, nor does it explain who removed the boulder blocking the entrance to the tomb. Clearly the authorities intended that the body remain in the tomb, and the gospel accounts record that the first witnesses did not really expect such an event as the Resurrection, and were in fact slow to accept it. So, who moved the boulder, and who took the body? Now, get out your Occam’s razor once more!.","date":"2013-06-09","mins":"7:44 pm","url":"https://shroudstory.com/2013/06/09/in-case-anyone-thinks-thomas-de-wesselow-isnt-important/","cat":"books","title":"In case anyone thinks Thomas de Wesselow isn’t important"},{"id":"comment-11377","author":"daveb_of_wellington_nz","post":"I heard the interview at the time as we regularly listen to NZ National Radio and I knew it was coming up. I hadn’t appreciated that it was also available on the web, otherwise I should have mentioned it sooner. Katherine Ryan is an experienced, good, reputable interviewer and knew enough of the subject to initiate intelligent questions, but not necessarily the hard ones. She might easily have skewered de Wesselow, as she has other subjects on occasion, but had the courtesy to refrain from doing so this time. I felt that de Wesselow’s performance was only average when it came to any detailed knowledge about the Shroud, but was wide off the mark when it came to his theories about the Resurrection. He has a long way to go before he develops his historical understanding of early Christianity. E.g: I find his belief that early Jewish Christians were influenced by cultural animism verging on the preposterous; I feel that animism just did not feature in their highly developed belief systems. One would not live and die for merely a faint image on a burial cloth. He referred to the evidence of Paul’s letters as being much earlier than the gospels. I suspect that Paul would not even know of the burial cloths or the image. He was convinced that Jesus had risen from the dead on the basis of a personal relgious experience, probably on the Road to Damascus as written in the Acts by Luke, a companion of Paul!.","date":"2012-05-15","mins":"4:17 pm","url":"https://shroudstory.com/2012/05/15/interview-with-thomas-de-wesselow/","cat":"history","title":"Interview with Thomas de Wesselow"},{"id":"comment-9779","author":"daveb_of_wellington_nz","post":"With promotion blurb like that, maybe someone will do him for plagiarism or breach of copyright. The Publicity Promotion hucksters become too focused on creating a celebrity cult, when in fact the truth is: “It’s not about me! It’s not about you! It’s about Jesus! It’s about God!” They can’t understand the need to get their focus right..","date":"2012-03-30","mins":"3:30 am","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","title":"Press Center for The Sign by Thomas de Wesselow"},{"id":"comment-9769","author":"daveb_of_wellington_nz","post":"In any occurrence whether natural or supernatural there’s the phenomenon itself and there’s the interpretation of that phenomenon. The “press release” site has about 70% of the phenomenon right and about 30% of it wrong. As for its interpretation as an object which the early church viewed “animistically” and so explains why it believed that Jesus was resurrected, this is reductionist, speculative and inadequate. 1) It asserts a “Vatican dictated protocol” in sampling resulted in the botch of the C14 sampling. Wilson in his 2010 book demonstrates quite the reverse. The Vatican’s well qualified Professor Carlos Chagas proposed a well researched protocol using seven labs using both the old Libby method and the new AMS method. He was no match for Turin’s Luigi Gonella, a street wise polytech lecturer less qualified than Chagas. It was Gonella’s and Cardinal Ballastrero’s decision to limit the testing to the three AMS labs, all clones of each other, and the decision for the sampling swatch resulted from merely a two hour spontaneous wrangle immediately prior to the sampling. 2) The assertion that the image results from a Maillard type vapourgraph has yet to be proven. Some attempts to research this have been made, but so far results have not been all that convincing, and a lot more work is required before this can be conclusively demonstrated. It is not clear how a vapourgraph could encode 3 D information. As the image is pixellated and confined to the crowns of the fibres, some kind of contact process seems more likely. 3) The press write up seems to make little mention of some of the historical aspects which must also be considered in any work claiming to be a complete explanation. It seems that Wesselow has grasped at a few key elements from the scientific studies and has then extrapolated these to come up with his own subjective and speculative interpretation, which fails to explain why the apostles and early church were prepared to die for their conviction that Christ had truly risen from the dead. So if it’s ever proven that the Shroud is indeed the burial cloth of Christ, this is what the agnostics’ judgment would look like in interpreting the result..","date":"2012-03-29","mins":"5:12 pm","url":"https://shroudstory.com/2012/03/29/press-center-for-the-sign-by-thomas-de-wesselow/","cat":"books","title":"Press Center for The Sign by Thomas de Wesselow"},{"id":"comment-10386","author":"daveb_of_wellington_nz","post":"“1 99% of these paintings show the nails in the palm of the hands, while the man of the Shroud have them in the wrist area.” I recently discussed this aspect of the Shroud with a well informed Biblical scholar. There seem to have been two main methods the Romans used for fastening the condemned to a cross; either by binding the arms to the cross beam or else by nailing, possibly sometimes both. However there are very few crucifixion nails available, as they were highly prized by the soldiery as some kind of curative talisman. However there is at least one other nailed crucifixion victim known as a nail was stuck in his ankle bones. This man had apparently been wrist nailed. The only gospel reference that informs us that Jesus was fastened by nailing is John 20:25 28, referring to doubting Thomas “Unless I see the holes that the nails made in his hands …”, there seems to be no other gospel reference to the method used The Greek word for hands transliterates as “kefir’s” which any Gk dictionary translates as “hands”. However, in Acts 12:8 describing Peter’s miraculous delivery from prison, the same word “kefir’s” is used (.. The chains fell from his hands …). It is unthinkable that the chains bound only his palms, and three of the four modern translations have “the chains fell from his wrists”. Evidently the word includes the wrist area. I have been unable to drop onto a Latin Vulgate version, but I rather suspect that Jerome translated kefir’s as ‘manus’ rather than ‘carpus’ (= wrist). Consequently generations of artists show Jesus as being nailed in the palms, an impossible means of effectively suspending the weight of the body. Many depictions get around this “suspension of disbelief” by showing him standing comfortably on a little pedestal, which stretches artistic licence a little bit too freely. “2. Crown of thorns” I understand a now thornless relic of this is said to be in some Paris institute (chuch or museum??) It was supposed to have been in the Louis XIV collection. Not sure whether its shape is a crown or a helmet. Of course if it wasn’t secured in place, it might roam around his head and pierce his scalp anywhere..","date":"2012-04-14","mins":"10:39 pm","url":"https://shroudstory.com/2012/04/13/russ-breault-here-is-one-gleaning-from-de-wesselows-book/","cat":"art","title":"Russ Breault:  ‘Here is one gleaning’  from de Wesselow’s Book"},{"id":"comment-11481","author":"daveb_of_wellington_nz","post":"I am not going to buy into the argument of WHO is an authority! I am more interested in the argument WHAT! If ANYONE with reasonable competence in the field comes up with a coherent argument or objection, regardless of whether their names are Fanti or anyone else, then they should be heard, their arguments considered, and a proper judgment made, and their argument should not be dismissed out of hand, merely because one disagrees with their viewpoint now or in previous engagement. If the DEVIL comes up with a coherent argument, then it can be evaluated, although one might question his motives. Some may prefer to evaluate an argument on the basis of the reputation of who makes it, but I prefer to evaluate the argument on its own merits! Because WE DON’T KNOW!!!!.","date":"2012-05-20","mins":"9:31 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","title":"The Valencia Dawkins Challenge:  No Consensus on Consensus"},{"id":"comment-202463","author":"daveb_of_wellington_nz","post":"It seems likely that the European Space Agency’s laboratory Rosetta with its lander Philae will have a complete analysis of comet 67 P, now 308 million km from Earth, chemical analysis, physical properties, spectral signatures, details of possible precursor life forming organic molecules, relaying the data to earth and 67 P will display its sun driven shower trail, before refreezing over as it recedes into outer space on its return journey. All before the masters of comedy in Piedmont can draft an outline scientific programme of research for the holy object that has been under their noses these last 500 years. Would it make any difference if we sent the Shroud into a 308 million km orbit? Philae report: http://phys.org/news/2015 06 philae wake up triggers intense.html.","date":"2015-06-17","mins":"2:30 am","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"},{"id":"comment-202190","author":"daveb_of_wellington_nz","post":"I don’t follow Louis’ thread here at all. “Form criticism: a method of biblical criticism that seeks to classify units of scripture into literary patterns (such as love poems, parables, sayings, elegies, legends) and that attempts to trace each type to its period of oral transmission. The purpose is to determine the original form and the relationship of the life and thought of the period to the development of the literary tradition.” Encyc Brit. “Form criticism has become one of the most valuable tools for the reconstruction of the preliterary tradition. This discipline classifies the literary material according to the principal “forms”—such as legal, poetic, and other forms—represented in its contents, and examines these in order to discover how they were handed down and what their successive life settings were until they assumed their present shape and position. In their various ways laws, narratives, psalms, and prophecies are amenable to this approach. By this means some scholars have undertaken to recover the ipsissima verba (“very own words”) of Jesus by removing the accretions attached to them in the course of transmission. The exegetical task assumes a threefold shape as scholars work back from (1) interpretation of the present Gospels through (2) interpretation of the tradition lying behind them to (3) reconstruction of the proclamation of Jesus.” (Etc, etc) “… best biblical scholars …” In whose judgment? Has there been no advance in biblical criticism since 1935??.","date":"2015-06-14","mins":"11:20 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"},{"id":"comment-202265","author":"daveb_of_wellington_nz","post":"I believe I understand the distinction between oral tradition and oral history well enough. It is true that I prefer well established reputable authorities in drawing on my references rather than what might happen to be the current flavour of the month. Re Matthew’s gospel: Matthew is the first in order of the four canonical Gospels and is often called the “ecclesiastical” Gospel, both because it was much used for selections for pericopes for the church year and because it deals to a great extent with the life and conduct of the church and its members. The Gospel grew out of a “school” led by a man with considerable knowledge of Jewish ways of teaching and interpretation. This is suggested by the many ways in which Matthew is related to Judaism. It is in some ways the most “Jewish” Gospel. Striking are 11 “formula quotations” (“This was to fulfill what was spoken by the prophet. . .”) claiming the fulfilment of Old Testament messianic prophecies. Concerning the Matthean Church: Matthew is not only an original Greek document, but its addressees are Greek speaking Gentile Christians. By the time of the Gospel According to Matthew, there had been a relatively smooth and mild transition into a Gentile Christian milieu. The setting could be Syria, but hardly Antioch, where the Pauline mission had sharpened the theological issues far beyond what seems to be the case in Matthew. Matthew has no need to argue against the Law, or Torah, as divisive for the church (as had been the case earlier with Paul in Romans and Galatians, in which the Law was divisive among Gentile Christians and Jewish Christians), and, indeed, the Law is upheld in Matthew (5:17–19). For Matthew, there had already been a separation of Christianity from its Jewish matrix. When he speaks about the “scribes and the Pharisees,” he thinks of the synagogue “across the street” from the now primarily Gentile church. Christianity is presented as superior to Judaism even in regard to the Law and its ethical demands. The Matthean church is conscious of its Jewish origins but also of a great difference in that it is permeated with an eschatological perspective, seeing itself not only as participating in the suffering of Christ (as in Mark) but also as functioning even in the face of persecution while patiently—but eagerly—awaiting the Parousia. There is much more, but the above will suffice. Yes, Matthew’s gospel is marvellously well informed in its anchoring in the Torah and Tanakh, but it was written for what is essentially a gentile church!.","date":"2015-06-15","mins":"4:02 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"},{"id":"comment-201962","author":"daveb_of_wellington_nz","post":"It occurs to me that one possible explanation for the occasional ‘feet apart’ convention, is that some artists might have had difficulty accepting the idea of a single nail through both feet, or misinterpreted the imagery, and presumed that each foot was separately nailed, and so depicted the feet how they believed they ought to be. There was only one ever imaged Shroud, and the expositions were not frequent affairs. Quite likely if direct access wasn’t directly available, some artists copied other copies if there was sufficient client demand for them, and if the template was believed to be sufficiently reliable..","date":"2015-06-14","mins":"6:21 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-202270","author":"daveb_of_wellington_nz","post":"Then you have some catching up to do. I spent over a year around 2008 studying Matthew’s gospel chapter by chapter in a small group under the direction of a well qualified scholarly priest, who had specialist training in Boston and elsewhere, currently seconded to teach theology at an Auckland seminary. His approach tended to be of a more conservative bent than my own preferences. But he drew on a variety of several different authorities and scholarly sources, giving full coverage to them all thus giving the broadest possible analysis. I recall that this was one aspect that most of the authorities seemed unanimous. It needs no ground breaking paper on the Internet to make the point. Curiously Encyclopedia Britannica comes to a similar conclusion..","date":"2015-06-15","mins":"5:43 pm","url":"https://shroudstory.com/2015/06/14/stephen-jones-on-the-thomas-de-wesselow-presentation/","cat":"history","title":"Stephen Jones on the Thomas De Wesselow Presentation"},{"id":"comment-201900","author":"daveb_of_wellington_nz","post":"The Shroud is not a perishable leather wallet, containing brittle effaceable papers, lost in the long grass over several English winters subject to rain, snow, insects and field mice. During most of the 660 years of its most recent sojourn, the Shroud has been kept under lock and key, in sturdy edifices, churches, cathedrals and castles. Its first few expositions at Lirey in the open air were sporadic events. For perhaps a few decades during the 15th century there were annual expositions on the banks of the Doubs River, and it was also taken to Liege and to Macon to be exhibited there. From 1453 to 1983 it was under the care of the House of Savoy, since when it has been in the care of the Turin custodians. It was brought out for public veneration on particular occasions, and not left hanging freely on a wall in some cathedral, to be damaged by continual exposure to the light. It is also known that during these seven centuries, the Shroud was cared for, maintained and repaired with some skill. If the Shroud is the authentic burial cloth of Christ, then its initial environment would have to be in the Middle East, Judea or Syria, a climate conducive to preservation. Those who have studied the clues have it stored in an earthenware jar, or bricked up in a wall, or else stored safely in a deep well. The written clues are few and only occasional, so it is evident that it was seldom exhibited or else used as a banner against invading armies, but kept as a secret to be known only to a select elite. At some time it would have been taken to Constantinople to become part of the imperial relic collection. This is not the story of an object subject to the damaging effects of exposure, moth or mildew, but an object that was carefully preserved. What of other linen objects? At an upper Paleolithic excavation site at Dzudzuana Cave in the eastern European country of Georgia, archaeologists discovered flax fibers that were preserved inside pollen chambers for 34,000 years. To date, they are the oldest evidence of man made textiles ever discovered. The fibers at Dzudzuana showed evidence of having been knotted and dyed bright colors like turquoise and pink, consistent with the style of other artefacts left behind. Fast forward a few thousand years of evolution and innovation and we find, at an ancient site in eastern Turkey, a piece of 9,000 year old, simply woven linen cloth clinging to a bone tool—presumably once wrapped around the handle for a better grip. Archaeologist and ancient textile expert Gillian Vogelsang Eastwood supposes this rudimentary fabric was produced on a crude loom of only four sticks, and woven in a manner derived from the already well established practice of basket weaving. When the mummy of the boy pharaoh Tutankhamun was unearthed in 1922 CE, portions of the linen wrappings that covered his remains were almost perfectly preserved, the hieroglyphed dates still legible despite the millennia. There are other examples, see: http://www.decktowel.com/pages/linen history Thiebault’s review of artist’s copies of the Shroud as given above indicate that all of them endeavoured to replicate the faintness of the image that they saw. The image of the Shroud was never a painting, and there is not a single piece of evidence that can support the notion..","date":"2015-06-13","mins":"11:13 pm","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-14805","author":"daveb_of_wellington_nz","post":"The concept of “soul” is obviously a construct to explain certain abstract properties of the person. Its origins are very ancient indeed, as most primal peoples believe in some kind of a spirit world, and “soul” would seem to be a derivative of this idea. There is hardly a single philosopher or theologian who has not had his own unique ideas of the concept, few of them identical. There is an excellent Wikipedia article on “soul” demonstrating these diverse ideas from very many civilisations, religions and philosophies. Extracts from Encyclopedia Britannica: [Both the Chinese and ancient Egyptians seem to have favoured types of trichotomy:] “The Egyptian ka (breath) survived death but remained near the body, while the spiritual ba proceeded to the region of the dead. The Chinese distinguished between a lower, sensitive soul, which disappears with death, and a rational principle, the hun, which survives the grave and is the object of ancestor worship.” “The early Hebrews apparently had a concept of the soul but did not separate it from the body, although later Jewish writers developed the idea of the soul further. Old Testament references to the soul are related to the concept of breath and establish no distinction between the ethereal soul and the corporeal body. Christian concepts of a body soul dichotomy originated with the ancient Greeks and were introduced into Christian theology at an early date by St. Gregory of Nyssa and by St. Augustine.” “In Christian theology, St. Augustine spoke of the soul as a “rider” on the body, making clear the split between the material and the immaterial, with the soul representing the “true” person. However, although body and soul were separate, it was not possible to conceive of a soul without its body. In the European Middle Ages, St. Thomas Aquinas returned to the Greek philosophers’ concept of the soul as a motivating principle of the body, independent but requiring the substance of the body to make an individual.” [End of Encyc Brit extracts] John Klotz’s assertion that the idea that it is a concept “wrapped snugly in a Middle Age straight jacket” is a tempting one, but the concept is still very current and continues to be debated, if not so much by modern philosophers, then certainly by theologians. However I tend to concur with his assertion that: “It is at the quantum level that we glimpse existence not fettered by normal [Newtonian?] considerations of space and time.” It seems to be a hint that there are certainly other realms. But the concept of Christ’s Resurrection only makes sense in terms of primordial consciousness, if He is identified with this primordial consciousness. I think that the concept of “parallel universes” is a useful mental stepping stone to our understanding of these other realms, and a “supernatural universe”..","date":"2012-08-11","mins":"6:42 pm","url":"https://shroudstory.com/2012/08/11/yannick-clments-summa-theologica/","cat":"news_&_views","title":"Yannick Clément’s Summa Theologica"},{"id":"comment-202189","author":"daveb_of_wellington_nz","post":"You can probably find a reference stating that ancient linen was more durable than medieval linen because of the differences in the manufacturing method. I’m reasonably certain I’ve read something to that effect. Hence you can probably find more intact samples of linen from ancient times, than from medieval times. But I can’t be bothered chasing it up just now merely to rebut such a lost cause. Max’s samples above are good examples. Interestingly the Shroud has survived reasonably intact. What does that tell you?.","date":"2015-06-14","mins":"11:06 pm","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-14631","author":"daveb_of_wellington_nz","post":"To say that scientists with religious beliefs have no credibility when it comes to Shroud research is about as ludicrous as it gets. It utterly fails to acknowledge the role of religion in the development of science, commencing with the Summa Theologica of Thomas Aquinas; pioneers in Renaissance science, including astronomers Copernicus and Galileo, Founders of the calculus Isaac Newton and Gottfried Leibnitz; and so many others who came after them, Kepler, Blaise Pascal and so on. The break through with Aquinas demonstrated that order was to be sought in the workings of the universe, and that phenomena were not the work of a capricious God or random Fate. Even the battling Bernoulli family with all their internal strife were originally intended for the Church. At the heart of the Arab development commencing in the fifth century, was the motivation of Islamic objectives. The atheism and agnosticism of some modern scientists with their so called “rational” approach is a relatively modern phenomenon. Commencing in the 12th c, the universities were founded on religious principles, and required religious affirmation. The assertion makes the assumption that professional scientists are unable to set aside their religious beliefs in a way that compromises their scientific endeavours. It fails to understand the professionalism and integrity with which professional scientists approach their work. Shroud researches have advanced most significantly by those with a religious belief, or as a result of their research, came to such a belief. What is being said is that only atheists can make a useful contribution to Shroud research. This is even more ludicrous than asserting that only scientists with a religious belief should carry out such research! To deify the work of Rogers, is to misdirect the object of true worship. It also fails to allow that in fact, for all we may know, there may only be a supernatural explanation for the image. That only scientists can provide an explanation. In over 100 years of shroud research, they have still failed to come up with an answer! “Trust in the Lord with all your heart and not rely on your knowledge. In all ways Acknowledge him and he will make your paths straight”. Prov 3:5 6.","date":"2012-08-08","mins":"5:16 pm","url":"https://shroudstory.com/2012/08/07/and-yannick-responds-to-giulios-comments/","cat":"news_&_views","title":"Yannick Reacts to Special Issue"},{"id":"comment-14752","author":"daveb_of_wellington_nz","post":"Christ’s body did not dematerialise at the Resurrection. He walked with disciples to Emmaus where he ate and drank with them; Doubting Thomas was able to place his hand in the wound of his side and saw the nail holes [“Place your hand here!”]; Jesus did a fish fry up for his disciples on the shores of Lake Galilee. The gospels report that they saw him taken up into heaven (a parallel universe?). Our present universe is contrained by the dimensions of time and space. We have yet to discover the properties of the supernatural “universe(?)”..","date":"2012-08-11","mins":"5:19 am","url":"https://shroudstory.com/2012/08/11/yannick-clments-summa-theologica/","cat":"news_&_views","title":"Yannick Clément’s Summa Theologica"},{"id":"comment-14599","author":"daveb_of_wellington_nz","post":"This is a very coherent posting by Yannick. The English is excellent, making for easy reading, and if he sought assistance for this, it showed good judgement. I agree with him up to the point that it cannot be definitively asserted that the image had a miraculous origin, as up to the present time there is insufficient evidence. It is an error of judgement for a scientist, or even an engineer, to assert at this stage that it does have a miraculous origin, although one might have a private view about this. However, where I think I may depart from Yannick’s expressed viewpoint, is that it MAY have a miraculous origin. I suggest that one piece of evidence that could support this view, is the apparent lack of body deformation on the dorsal view – it appears to be suspended weightless in space – or to put it another way, it is as if the image was formed in the upright position. It is of course possible that the body may have been placed on its side, which could also explain the lack of dorsal body deformation. It is an obligatory requirement of Catholic belief that miracles can and do happen (Check out the Catholic catechism). However there is no obligatory requirement for any belief that any specific event generally deemed miraculous, was in fact miraculous. It is well known that the Church requires aduequate proof of miracle(s) for the causes of canonisation of saints. Most of these are otherwise inexplicable healings, but other miracles are also admitted (check catechism). Yannick, and also others, in their various comments, often emphasise the importance of understanding the chemical processes involved in forming the TS image. However I also think it important to be accepting of various possible explanations involving the discipline of Physics. The science of Physics may be just as important as Chemistry, and possibly even more so. I have often mentioned in other postings the work of Giovanna de Liso, who obtained intriguing high definition 3 D images under moderate earthquake activity. Earthquakes may be viewed as some kind of supernatural activity in Quebec. I can assure Yannick that we take them in our stride in NZ, and also doubtless they do in California and Japan, and also apparently in Italy. Nor are they rare events in the Middle East. This week in NZ, we have just had one of our dormant central North island volcanos wake up spewing ash, after being asleep for over 100 years, But I suspect it had little to do with the publication of Scientific Research and Essays in Academic Journals!.","date":"2012-08-07","mins":"5:42 pm","url":"https://shroudstory.com/2012/08/07/and-yannick-responds-to-giulios-comments/","cat":"news_&_views","title":"Yannick Reacts to Special Issue"}]
