[{"id":"comment-213788","author":"daveb_of_wellington_nz","post":"HF: “I don’t think the evidence for a significant difference in the areal density of the radiocarbon carbon area, as opposed to the main body of the Shroud, is very strong.” Always and in every case of arguing from evidence, there are two aspects to be considered: 1) the “facts” of the evidence; 2) the “interpretation” of that evidence. For the very same reasons that Hugh lists against heterogeneity, exactly the same can be argued against homogeneity! Facts provided by Gilbert Raes from the two pieces he was given: Piece 1: warp – 16.3 tex; weft – 53.6 tex; Piece 2: warp – 18.0 tex; weft – 73.1 tex; [ tex = gm / km] Interpretation: Draw whatever conclusions you might!.","date":"2015-10-28","mins":"9:52 pm","url":"https://shroudstory.com/2015/10/28/banding-proves-cloth-was-not-repaired/","cat":"guest_posting","title":"Banding Proves Cloth Was Not Repaired?"},{"id":"comment-48550","author":"daveb_of_wellington_nz","post":"Much of the above, written by pseudo skeptical earth scientists, convinced that their particular expertise has all the answers, is arrant nonsense. They strain at gnats and swallow camels. With no formal training in Critical Thinking, they fail to understand the concept of ‘weight of evidence’ as far as all the properties and other features of the TS is concerned. The TS is a challenge to their particular world view, and creates a chronic anxiety that this world view of theirs may indeed be false. Concerning the mixing of kinds, there is no Judaic prohibition on mixing cotton with linen. The prohibition relates to the mixing of animal and vegetable products sucj as the mixing of cotton or linen with wool. It is possible that its origins may have been associated with the practice of pagan priests mixing these products in their garments, or else to restrain lower orders from wearing expensive linen. Its religious significance comes from the concept of distinctions whereby Yaweh’s people of Israel were to be separate from gentiles. Concerning the mixing of cotton with linen: Its earliest occurrence commenced in Egypt about 200 AD with the manufacture of fustian, whereby cotton and linen were used separately for warp and weft threads to compensate for the weaker properties of the other, expense, brittleness, susceptibility to dyes, etc. It slowly spread through North Africa, not reaching Spain until the 13th century. Cotton found its way to Italy possibly as early as the 13th century. Bulk cotton and linen fibres were stored in the same spinning work rooms, the cotton permeating the air, getting on the clothes of the spinners and contaminating linen thread. Cotton as a contaminant of linen would therefore date from this era. There is no such contaminating cotton in the linen threads of the TS, except for that in the Raes area. I have seen several photographs of many of the STURP scientists minutely examining the TS for signs of cotton with microscopes. None of them found any cotton. Possible sources of surface contamination, include the stitching of the 1534 patches with cotton, and perhaps the cotton gloves used by the STURP team. From about the 13th century, cotton was deliberately mixed with linen for a number of reasons: it bulked out the more expensive linen; it compensated the brittleness of linen, and would accept dyes more readily. On the other hand linen was more durable and longer lasting, as lacking pectin needed by moths it was more resistant to insect attack. Raes discovery of cotton in his sample, found its way into Ian Wilson’s 1978 book, leading to the speculation that it was more pervasive, and that perhaps the cloth had been woven on looms also used for weaving cotton, and it was therefore of Middle East provenance. That speculation is no longer viable. Until 1842, the Savoy showings of the TS were always displayed by five bishops holding it along its edge, often in the open air, doubtless with prospects of all sorts of contamination, and damage to the cloth. There are several different illustration of these events on record. Even bishops in those days did not take regular showers! In 1868, Princess Clotilde replaced Valfre’s lining with a new red silk lining. She may well have been the one who carried out the evident repair in the Raes area. She had the skills, and the resources. From 1868, the manual displays had ceased, and from that date, the displays were always held in a static frame. If Clotilde did the repair work, that would certainly account for the skewing of the C 14 date. It may also account for the decision to abandon the manual displays. There is much more evidence corroborating the authenticity of the TS, than the mere absence of cotton in its main body. They include the absence of vanillin as one such. However the absence of cotton is merely another link in the chain of evidence, which places its provenance well before the 1355 display at Lirey. Get over it! You’re wrong! The Shroud is the authentic burial cloth of Jesus of Nazareth! Whether that challenges your world view or not, is your problem!.","date":"2013-10-23","mins":"3:51 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-48557","author":"daveb_of_wellington_nz","post":"Not Jesuits, but I did value the introduction to Thomistic apologetics at the Christian Brothers college I attended, and exposure to the Dominican chaplains at University. In later life, I completed formal papers in ‘Critical Thinking’ and similar related topics in the Dept of Philosophy at Massey U in NZ, hardly geared to a religious agenda. I also completed several assorted papers in their Religious Studies dept, and so have a good understanding of world religions from primal, ancient, modern, western and eastern beliefs, practices, and their critical issues, hardly a singularly selective perspective. I have rather more training in mathematics than most of my other one time professional colleagues in engineering, which you would know requires a keen discipline of thinking and logic. In the last 10 years of my working life I was part of an Internal Audit team in a major NZ Corporate, contributed, and came to understand the nuances of what constitutes real evidence. Incidentally, I was then instrumental in designing their legitimate SAMPLING SYSTEMS for audit purposes, and know something about that as well. I’ve also been a long time fan of John Mortimer’s ‘Rumpole of Old Bailey’. I trust all that answers your query!.","date":"2013-10-23","mins":"5:40 pm","url":"https://shroudstory.com/2013/10/22/comment-promoted-is-cotton-unique-to-the-c14-sample-area/","cat":"carbon_14_dating","title":"Comment Promoted:  Is cotton unique to the C14 sample area?"},{"id":"comment-39701","author":"daveb_of_wellington_nz","post":"1. Figures that Wilson attributes to Vial: I eventually found the 80/40 figures quoted by Andrew above on p.71 of my copy of ‘The Shroud’ (Bantam Press 2010). (I wouldn’t know what heppened to the stray 35 pages.) On the same page, next paragraph, Wilson is quoting the cloth dimensions in feet and inches, so we might surmise the figures mean ‘threads per inch’. Divide 80 and 40 by 2.54, and they equate to 31.5 & 15.7 threads per cm, which is coarser than any of the authorities quoted by Hugh above, including Vial. So the 80 & 40 figures quoted by Wilson look meaningless, unless they were intended as rough indications only. Wilson’s 1978 quoting of Gilbert Raes’ figures (my #6 above) are closer to the mark. Wilson’s citation of Vial is: ‘Le Linceul de Turin – Etude Technique’ in ‘Bulletin du CIETA’, 67, Lyon, 1989, pp 11 35. 2. Charles’ query re Flury Lemburg’s comments re Masada: Wilson discusses this at some length on ensuing pages (my pp 72 74). My reading of Wilson is that Mme F L seemed to envisage that the original bolt of cloth was very much wider than the present Shroud (W’s diagram implies about 3 x wider). The bolt was then expertly cut lengthwise, firstly for the main cloth of the Shroud, and then secondly for a narrow side strip. The two raw edges were then expertly sewn together, so that the final Shroud cloth presented two selvedges on its two outside edges. The seam was not visible from the face side and was only revealed when the backing cloth was removed. It seems that in her 40 years of working with ancient textiles, Mme F L had only come across this type of invisible seam only once before, on the 1st century textiles found at Masada. Wilson provides a diagram of the seam from a Masada cloth sample. Wilson’s bibliography provides three published references by Mme Flury Lemburg, for any further information required..","date":"2013-07-25","mins":"6:04 am","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","title":"Max? Anyone? Thread count for the Shroud of Turin"},{"id":"comment-39626","author":"daveb_of_wellington_nz","post":"I was unable to corroborate the Andrew of Nashville reference from Vial in either of Wilson’s 1978 or 2010 texts – not on p.106 of either. However in the 1978 text. He provides a tabulation from the Raes’ samples which seem consistent with other values quoted above. Ian Wilson – “The Turin Shroud” pub. Victor Gollancz Ltd 1978; Ch VII ‘The Shroud as a Textile’, p.54. Piece I was from the main cloth, included cotton contamination; Piece II from side strip, no cotton. Citing G. Raes, “Appendix B – Rapport d’Analise,” La S. Sindone, supplement to ‘Rivista diocesana torinese’, Jan 1976, p.82: [I (II) = Piece I (II); Wp = Warp, Wf = Weft] No. Threads / cm: 38.6(I, Wp); 25.7(I, Wf); – (II, Wp); 25.7(II, Wf); Thread size in ‘tex’: 16.3(I, Wp); 53.6(I, Wf); 18(II, Wp); 73.1(II, Wf); Direction of twist were all ‘Z’: (Direction of spiral matches centrestroke of letter ‘Z’). ‘Tex’ is a textile specialist term for fineness, indicating that the thread is very fine, but there would seem to be a four fold difference between warp and weft in both I and II. Because there was no cotton in II, Wilson seemed to think that the side strip was added subsequently from a different source. It suited his argument of centralising the facial image for his Mandylion theory. However the cotton may have been added at some later time as part of the so called “invisible reweave” hypothesis, either medieval or later..","date":"2013-07-23","mins":"10:15 pm","url":"https://shroudstory.com/2013/07/23/max-anyone-thread-count-for-the-shroud-of-turin/","cat":"science","title":"Max? Anyone? Thread count for the Shroud of Turin"},{"id":"comment-17213","author":"daveb_of_wellington_nz","post":"Much of the Danish work seems to have been done by Karin Margarita Frei (connections with Max Frei?? – just speculating). My chemistry is limited, but I note that altho’ 87 Sr and 86 Sr are both stable isotopes themselves, the amount of 87 Sr has been increasing over time because it is also a decay product of 87 Rb, and this is said to be evident in meteorites. Is there a possibility that this may compromise its value as a provenance indicator of ancient textiles? Thus we may know the 87/86 Sr ratios of an ancient textile, which may have remained unchanged over time, but is it valid to compare this with a present geographic / geologic region if the ratio in that regions may have changed because of decay of 87 Rb? Can anyone elucidate? If this is a potential problem, would it not then be valid to compare textiles of comparitive ages if the provenance of any one of them were known? Or is this a false problem?.","date":"2012-10-04","mins":"6:34 am","url":"https://shroudstory.com/2012/10/04/more-on-strontium-isotopic-tracing-of-bronze-age-danish-textiles/","cat":"news_&_views","title":"More on Strontium Isotopic Tracing of Bronze Age Danish Textiles"},{"id":"comment-32207","author":"daveb_of_wellington_nz","post":"Further to mine above: In the fourth gospel John 20:3 10, we are told that Peter and the disciple whom Jesus loved both ran to the tomb, but at first only Peter goes in. At this point, Adrie postulates that the other disciple is John Mark, wondering if the burial cloth seen there is indeed his temple garment. This disciple whom Jesus loved is more conventionally thought of as being behind the authorship of this gospel, and is more usually thought of as being the son of Zebedee in Galilee. I find it more credible that John Mark as mentioned in Acts Paul’s epistles and I Peter, the likely author of the second gospel, is a different and distinct person from the John mentioned in the fourth gospel as the disciple whom Jesus loved as a euphemism for the author of that gospel, and who hesitated at the entrance of the tomb..","date":"2013-04-29","mins":"7:31 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","title":"Paper Chase: The seam and missing corners of the Turin Shroud"},{"id":"comment-32204","author":"daveb_of_wellington_nz","post":"Adrie’s present paper appears to be a more developed version of that which has been posted on her Jesus King website “The Turin Shroud as John Mark’s temple garment” and dated October 14,2011. I have mentioned this previous paper a few times in comments on this web site, in discussions about Joseph’s resourcefulness in acquiring an expensive burial cloth on Preparation Day, which was likely a semiholiday for shops and the marketplace. I personally think she makes a credible case for the present Shroud cloth having been a temple garment, and it may have been John Mark’s recovered in the manner she postulates. Alternative options that might need considering are that if it was a temple garment, it may have been Joseph’s own garment, or if not, perhaps Joseph had intended it to be his own burial shroud, as until the time of Gamaliel II (2nd century), it was quite normal for Jewish burials to include items of considerable expense. Plain weave shrouds only became fashionable for the wealthy after Gamaliel II. A major reservation I have with the paper is her apparent identification of John Mark as seemingly the author of both the second and fourth gospels, the beloved disciple, the young man who ran away naked during Jesus’ arrest, and the temple secretary. I am unaware of any authority who would make the same identification, and I feel there is much that can be said against it. John Mark is conventionally thought of as being the author of the second gospel (a source for Matthew’s and Luke’s), the cousin of Barnabas, who according to Acts deserted Paul during his mission to the gentiles, whose mother’s house in Jerusalem was a centre for the apostles to where Peter fled after his release from prison; probably the amanuensis to Peter in Rome, and who seemed later to recover Pauls’ favour and also assisted him; and who later is said to have founded the church in Alexandria where he is said to have died. He may have been the young man who fled naked in the garden. By contrast, the author of the fourth gospel is said to have written it in Ephesus, dying there at an advanced age, is generally identified as the disciple who Jesus loved and who lay on his breast at the Last Supper, could have been one of the sons of Zebedee, and a fisherman in Galilee, seeming unlikely material for a temple secretary. As the identification that Adrie makes, seems to make up a significant component of her paper, I feel that this attempt at overstating her case is likely to run into serious objections, and the paper may unjustifiably stand to fail on this account. I feel nevertheless that she has made a credible argument for the Shroud cloth having been a temple garment, which may even have been John Mark’s. However I also feel that other explanations are also possible and cannot be entirely excluded..","date":"2013-04-29","mins":"6:58 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","title":"Paper Chase: The seam and missing corners of the Turin Shroud"},{"id":"comment-32267","author":"daveb_of_wellington_nz","post":"At the core of Adrie’s story construction of the burial garment, is the loss of the young man’s linen cloth in the garden. The story is only recounted in the second gospel and nowhere else. For this reason commentators have tended to identify the person as that gospel’s author. From Papias 2nd century, the traditional author of the second gospel is said to have been Mark, Peter’s amenuensis in Rome. Mark’s role as amenuensis is supported by the closing verses of I Peter, although that epistle is said there to have been transcribed by Silvanus. I find it difficult to ascribe the complex fourth gospel to John the son of Zebedee, a fisherman, although it seems that this John did finish up in Ephesus. He could well have been the witness referred to in the conclusion of that gospel and provided the oral tradition for much of the narrative. If the long and complex farewell discourses are the authentic words of Jesus, then someone must have written them down at the time or soon after. An alternative view is that the gospel was written by John a presbyter. The gospel is extremely complex operating at several levels, and a more likely explanation might ascribe it to a Johannine school in Ephesus, with contributing elements from various ones, but finally synthesised into a unitary whole, perhaps by a single author and some additional later glosses by others. Only a linguistic analysis of the second and fourth gospels could detect if they were the same author, but in view of the lapse of time between their writings, this may not even be successful, as writers will develop their vocabulary and style over such a period. I suspect that any analysis would conclude that they were different authors. Part of the difficulty in identifying the various participants is the very limited number of first names available in first century Palestine, and any single name whom we may assume is attributed to a single person may in fact belong to several..","date":"2013-04-29","mins":"4:53 pm","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","title":"Paper Chase: The seam and missing corners of the Turin Shroud"},{"id":"comment-32298","author":"daveb_of_wellington_nz","post":"Each of the four gospels has a short section on the calling of the first few disciples. The Synoptics all have a reasonably consistent story of this event, although Luke gives a slightly different version of it. In John however the 3rd and 4th disciples have different names from those in the Synoptics, and it is a different story. In both Matthew and Mark, the event takes place at the Lake of Galilee and all four are fishermen, Simon and his brother Andrew are called, together with their partners James and John, the sons of Zebedee; Mt 4:18 22; Mk 1:16 20. Luke does not mention Andrew, but it is still a fishing scene; Jesus gets into Simon’s boat, preaches, a sub story of a large catch of fish is added in, the three of them then follow Jesus; Lk 5:1 11. In John the story is different. Jesus passes by where John the Baptizer is preaching with two of his disciples, the Baptizer comments “Look there is the lamb of God!” Hearing this the two disciples catch up with Jesus and asks him to show where he lives. One of the disciples was Andrew “the brother of Simon Peter”. Early next morning Andrew meets his brother Simon saying “We have found the Messiah” and takes Simon to Jesus. The next day Jesus meets Philip and says “Follow me.” Philip finds Nathanael, and an interchange between Jesus and Nathanael follows concerning Jesus seeing him under a fig tree, consistent with John’s presenting Jesus as a person with special supernatural knowledge; Jn 1:35 50. In view of the disparities between the 2nd and 4th gospels descibing the calling of the first disciples, there has to be a conclusion that the two gospels were written by two different authors. If the young man who loses his linen cloth in Mark’s gospel is the author of that gospel (Why else mention the incident?) then he cannot be the same person identified as the “beloved disciple” which appears to be a euphemism for the disciple associated with the writing of the fourth gospel. In that case the Adrie hypothesis that the two men are one and the same person has to fail..","date":"2013-04-30","mins":"1:25 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","title":"Paper Chase: The seam and missing corners of the Turin Shroud"},{"id":"comment-32336","author":"daveb_of_wellington_nz","post":"Max, I don’t think I have a problem with that, and I recall we have discussed this very thoroughly in another recent posting. It is Papias who says that the second gospel was written by Mark, although apparently Papias also makes the reservation, “although not in the right order”, whatever he might have meant by that. The way I read Adrie’s paper is that she identifies the “beloved disciple” in the 4th gospel as John Mark. I think it is more a euphemism for the disciple associated with the writing of the 4th gospel. The fourth gospel is the only one to use that expression. Now following your argument that “Mark” is setting down Peter’s version, he would be aware of that gospel’s section on the calling of the first four disciples. But in the fourth gospel, this story is quite different. So I maintain that the “John” associated with the writing of the fourth gospel cannot be the “Mark” associated with the second gospel, who seems to be the “John Mark” mentioned in Acts 12 and elsewhere. If you do not see that as a persuasive argument, can you provide sufficient reasons for identifying John Mark as the “beloved disciple” in the fourth gospel? That would then argue that this “beloved diciple” is not in fact associated with the authorship of the fourth gospel at all, because of the disparity of the two stories I’ve mentioned..","date":"2013-04-30","mins":"7:44 am","url":"https://shroudstory.com/2013/04/29/paper-chase-the-seam-and-missing-corners-of-the-turin-shroud/","cat":"news_&_views","title":"Paper Chase: The seam and missing corners of the Turin Shroud"}]
