[{"id":"comment-215791","author":"agnieszka_jaworowska","post":"As a close friend of Max Patrick Hamon, I confirm Dan did kick out Max Patrick Hamon from the blog… unless Dan’s settings are at fault. Actually Max cannot/is not allowed to comment (each time he has hit the Send button (I was myself a direct witness of this), there is nothing on his screen, not even “your comment is awaiting moderation”. Indeed Dan had already threatened to kick out Max once or twice in the past). Still the fact remains, most curiously Max has been silenced from August the 10th 2015 onward i.e. Just after Louis (a freelance journalist) asked Dan to do sthg about Max as the latter challenged Louis to prove his exegesis of Jn (the empty tomb episode) was wrong (Louis with his mouth full of the name of “his giant” in Biblical exegesis disdainfully told Max he “would be laughed out of court”. However Louis has NEVER substantiated his claim and demostrate Max’s exegesis was wrong and did ask Dan to Silence Max, which Dan did. Until proven otherwise, Max WAS kicked out of Dan’s blog and Louis did have SOM Ething to do with this. Max showed me several emails he sent Dan and the latter had not even the courtesy to reply (Max last email dates back to December the 4th, 2015. Here it is: Dan, (In reply to Dr Chantal Boisselier, a friend of mine who thought you kicked me out of your blog), you wrote (on November 24, 2015 at 8:05 am): “Max was not kicked out. Max is welcome to submit comments that I will look at first before they appear”. Actually (in reply to Charles Freeman misleading prose in the thread on The Sudarium: A Better Provenance and History?) I have attempted twice to post the following comment (and thus check “in deeds” your above assertion): “Since the relic’s coating/image coloration can be scraped off or removed only with adhesive or diimide, actually just thinking alike Charles Freeman “anything old would have been degraded by the passage of time and the original form of the object might not be recoverable”, is definitely NOT “the best position from which to start understanding the original make up of the Shroud images”.” Each time I have hit the Send button, there was nothing on screen, not even “your comment is awaiting moderation”, which leads me to think indeed you did kick me out of your blog (as you once or twice had already threatened me to in the past) and silence me unless your settings are at fault (see Colin Berry’s case). All the best, Max If Max is really “welcome to comment”, how come he cannot? How come Dan doesn’t even reply to Max’s emails? Doesn’t Dan left hand know what his right hand does?.","date":"2015-12-07","mins":"7:32 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"}]
