[{"id":"comment-215803","author":"agnieszka_jaworowska","post":"Since the relic’s coating/image coloration can be scraped off or removed only with adhesive or diimide, actually just thinking alike Charles Freeman “anything old would have been degraded by the passage of time and the original form of the object might not be recoverable”, is definitely NOT “the best position from which to start understanding the original make up of the Shroud images. Reminder for Charles: Yeshu’a’s likeness on the cloth of Edessa was described of old as “imprinted” and consisting of “a moist secretion with no paint or artistic craft, transferred with no artistic intervention onto the cloth”. What does the historian Charles Freeman make of such Shroud Image like characteristics of the Edessa image on the cloth: nothing!.","date":"2015-12-07","mins":"10:18 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215804","author":"agnieszka_jaworowska","post":"Here Max Patrick Hamon, I’m commenting from Agnieszka Jaworowska’s place..","date":"2015-12-07","mins":"10:21 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215835","author":"agnieszka_jaworowska","post":"“Charles wrote: “As the Turin Shroud has nothing whatever In common with the Edessa image. I cannot see the relevance”. Actually the Shroud image ALIKE the Image of Edessa (in Yeshu’a’s likeness) can be described as “an imprint” and “a moist secretion with no paint or artistic craft, transferred with no artistic intervention onto the cloth”. Another historian, Ian Wilson, can see the relevance re the two characteristics if Charles Freeman just can’t Besides ALIKE the cloth of Edessa, (see The Acts of Holy Apostle Thaddaeus, –6th Century CE– that calls the cloth a tetradiplon (cloth doubled in four layers), a Greek term that only appears twice in historical texts, and both times refers to the Image of Edessa, the Turin Shroud was doubled in four layers (see the symetrical burn marks as proof). Can some bell ring in a deaf the British Roman Historian’s ear? Has the word “relevance” a real meaning in British English?.","date":"2015-12-07","mins":"5:33 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}]
