[{"title":"Another Gary Habermas, Shroud of Turin Video.","post":"Almost too realistic an explanation, I could almost feel it.\n\n","date":"August 16, 2014 at 5:23 am","url":"https://shroudstory.com/2014/08/16/another-gary-habermas-shroud-of-turin-video/","cat":"news_&_views","id":"comment-144162","author":"Emmett McMahon","site":"shroudstory"},{"title":"Another Gary Habermas, Shroud of Turin Video.","post":"Does anyone have any details of the radiocarbon dating that came up with a AD 30 plus or minus 70 years  from 1982 that Habermas mentions in his lecture ( at 30 minutes, 30 secs). I had never heard of it before. Provenance of sample, possibility of contamination, laboratory testing it, etc- all the issues that have come up with 1988. Was it an AMS dating -if not where did they get a big enough sample from ?\n\n","date":"August 16, 2014 at 11:04 am","url":"https://shroudstory.com/2014/08/16/another-gary-habermas-shroud-of-turin-video/","cat":"news_&_views","id":"comment-144199","author":"Charles Freeman","site":"shroudstory"},{"title":"Another Gary Habermas, Shroud of Turin Video.","post":"We had quick look at this on 28 April this year. An extremely controversial dating by a scientist who refuses to comment at a laboratory that has not only formally denied that any such testing took place, but also that it did not have the appropriate equipment anyway, of a thread apparently stolen from the Shroud and dated (if it actually was) in the face of the express refusal of the owner to permit it. A single thread, divided into two, giving different dates for the different parts. We don’t know how long this thread was, or whether there was enough for radiocarbon dating anyway. Joe Marino claims to have some more confirmatory evidence that the dating did actually happen, but what credence can be placed on its credibility has been seriously questioned.\n\n","date":"August 16, 2014 at 12:20 pm","url":"https://shroudstory.com/2014/08/16/another-gary-habermas-shroud-of-turin-video/","cat":"news_&_views","id":"comment-144209","author":"Hugh Farey","site":"shroudstory"},{"title":"Another Gary Habermas, Shroud of Turin Video.","post":"Thanks, Hugh. I thought that the controversial thread you are talking about actually dated later – not as early as AD 30. Perhaps Habermas was speaking before all the controversy of it came out but ,as with the coins, some caution is needed before evaluating this video.\n\n","date":"August 16, 2014 at 12:58 pm","url":"https://shroudstory.com/2014/08/16/another-gary-habermas-shroud-of-turin-video/","cat":"news_&_views","id":"comment-144212","author":"Charles Freeman","site":"shroudstory"},{"title":"Another Gary Habermas, Shroud of Turin Video.","post":"Yes, having accessed the acrimonious debate from April of this last year, there was never a claim that the thread was as early as AD 30, so I leave it to others to debate where Habermas got his date from. Surely it must have been an AMS lab to have got a rEsult from the end of a single thread and there seems to be no evidence of one here. Shows how easily stories grow in the telling!\n\n","date":"August 17, 2014 at 2:32 am","url":"https://shroudstory.com/2014/08/16/another-gary-habermas-shroud-of-turin-video/","cat":"news_&_views","id":"comment-144311","author":"Charles Freeman","site":"shroudstory"}]
