[{"id":"comment-46484","author":"josie_l_tyner","post":"Just two questions for the simple, please, who have as much to gain, or loose, as anyone, in the argument for authenticity. Perhaps more. 1) Does the ‘invisible weaving, or any mending done by house of Savoy or others, have anything to do with establishing or debunking the age or authenticity of the SOT? 2) Does the argument over C14 dating take into consideration the bioplastic coating of the Shroud discovered by Garza Valdez, which would naturally skew the results? In fact, isn’t that why the tensile strength experiments at the U. Of Turin were conducted in the first place? I am a painter, and have done quite a few works on linen canvas, you CAN”T put any kind of “dye” or “paint” onto linen without first applying ‘gesso,’or the paint would simply be a smear or be a blob, and NO painting displays the three dimensional attributes discovered by a NASA photographer during the STURP investigation in the 70s. Thanks in advance for your help..","date":"2013-10-08","mins":"11:42 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46548","author":"josie_l_tyner","post":"Thank you for your kind reply, and I appreciate the depth of scholarship involved in the answer. I have to admit that the information that I have about the three dimensional properties of the shroud taken by the NASA jet propulsion laboratory scientist from the STRP team does not agree with your conclusions, and his conclusions assert that the Shroud must have been draped over a three dimensional image to have these properties. That said, there may be information out there of which I am not aware. I would be interested in your point of view on the visual information available on the SOT that reflects facts only recently verified by modern archeology; i.e. The dumbbell shaped marks from the flagellum, the Eastern “crown” of thorns covering the entire head instead of the typical circlet, the nailing thru the wrists instead of the hands, the fact that no contemporary (middle age or Renaissance, supposedly) cultural or plastic archetypes demonstrated by the Shroud are reflected by “relics” that pilgrims could recognize. In other words, how could an artist (considered only a craftsman in the Middle Ages) come by information only the recent science of archeology has now made known? One thing no one seems to ever mention is the fact that the figure of the Man of the Shroud is significantly longer in back than in front, I can’t think that that would go unnoticed by more than a few pilgrims. I am not being cynical at all by pointing out that relics were a big source of income for local churches and monasteries, so why show tithing pilgrims something they did not come to see? Finally, please forgive me if I have not understood this: is it your contention that the SOT initially looked like the well known Secondo Pia negative, and that it has faded with time, leaving only the faint figure we see today? Again, I thank you for your scholarly and informative answer, and appreciate immensely your time and consideration..","date":"2013-10-08","mins":"6:14 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46485","author":"josie_l_tyner","post":"Correction. I know one can dye linen. I rather meant in the sense of forming an image with a pigment. Sorry..","date":"2013-10-08","mins":"11:45 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46550","author":"josie_l_tyner","post":"According to the information I have, the scientist who discovered this was one of the team responsible for analyzing the comparative depths of the areas where astronaut Neil Armstrong and company landed the vehicle on the moon. His calculations were of life and depth critical importance to the moon landing. His work is extremely credible in my eyes. However, to be fair to Mr. Farey, I am going to consult a family member who uses “IMAGE” software in his work and would like to tell you of what I saw (I have only basic computer knowledge). BTW, your work is fascinating and exciting. I would be very honored if you read my answer to Mr. Farey and weigh in on my questions concerning available cultural archetypes in the Middle Ages. I do not understand how a mere craftsman, as any artist would be at the time, would have access to information made only available in the twentieth century. Thank you, continued success to you..","date":"2013-10-08","mins":"6:30 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46926","author":"josie_l_tyner","post":"Terrific video. Surprise! Dan is in it! Enjoyable and informative..","date":"2013-10-10","mins":"6:58 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-48951","author":"josie_l_tyner","post":"So let me get this straight: Bla bla, woof woof, “we’re not sure how old it is.” Got it. Thought everybody did, actually..","date":"2013-10-28","mins":"12:47 am","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-154989","author":"josie_l_tyner","post":"Superparamagnatism? I guess it makes sense. And at this point, since it seeks to expiate the traditional view of the NT writers, wait a minute so Mr. Skurka’s hypothesis can said to back Docetism? So it’s Superparamagnetistic expiate a la Docious? You know, the sound of it is something quite atrocious. But if we say it loud enough….I’m sorry. I couldn’t help myself..","date":"2014-09-24","mins":"8:47 am","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","title":"Superparamagnetism"}]
