[{"id":"comment-51136","author":"josie_l_tyner","post":"My fellow Texans sometimes take their security concerns with a verve sometimes unequalled anywhere in the nation. That said, in the last few years, people have been killed for admitting to the ‘crime’ of Christianity. Think its a joke? Ask any Coptic Christian in Egypt how funny they think it is. Being ‘insulted’ for being a Christian is going to happen. But leaving yourself wide open for paint spraying, screaming, belligerent ( and often dangerous) people is inexcusable. So we don’t do it, y’all.There are many (not in Texas, thank God) who think they would be doing the world a great favor by getting rid of a few of us pesky Christians. If a Texas Ranger is a deterrent to these maniacs than I thank God for them. Maybe the organizers would be happier to plan their next seminar at Brown University. Students refused to allow the police chief of NYC to speak, by screaming, throwing garbage and scrawling obscenities, and calling it a ‘victory for free speech everywhere.’ Maybe Dan would feel more comfortable in an environment where anyone could just bust down the door and spray the congregated intelligentsia with gasoline, or a Molotov cocktail? By the sound of it, there were some definite organizational SNAF Us that turned out to be embarrassing, but providing adequate security was not one of them. We are not scared of firearms in Texas. We believe they should be in the right hands, to protect the innocent from those who would deprive them of their rights to speak and be heard. Seems like the organizers of the event had the issues, not the Texas Rangers. Someone who will not hear an opposing argument is clearly the one to fear, not the man with the Silver Star. I wonder how ‘corny’ Dan would feel if he had to jump behind a Texas lawman with some Christian hating nut coming at him with a knife. We know something in Texas: how many rights to you really have? As many as you can really defend, to the death if necessary. So next time, if y’all are uncomfortable in Big T, go have your conference at Brown. Good luck with that one, y’all..","date":"2013-11-13","mins":"3:02 pm","url":"https://shroudstory.com/2013/11/12/of-enchiladas-listerine-and-dont-mess-with-texas/","cat":"event","title":"Of Enchiladas, Listerine and Don’t Mess with Texas"}]
