[{"id":"comment-48643","author":"josie_l_tyner","post":"Oh Lord, does someone really have to say it again? Anytime a painting, picture, or such image is made, the painting appliance or instrument used to apply pigment ALWAYS leaves telltale stroke marks indicating the way the pigments or pigment was applied. This is called directionality. No directionality on the Shroud, not a painting. Yes, vermillion was found but in medieval times paintings of the SOT were placed against the Shroud itself, “sanctifying” the copy. This was done to many relics because some people just could not make the long pilgrimages required to fulfill a vow. Mercuric Sulfide (vermillion) is bright red; if the Image of the Man is made of vermillion why isn’t it red? And why does 90% of the information on the SOT only appear as a photographic negative? And if it IS a photographic negative, on cloth, why can’t modern science replicate it ?? If it is a painting, why didn’t state of the art equipment used by NASA find this out in the 1970’s STRP team investigation? Not exactly primitive equipment even by today’s lofty standards. It is NOT a painting. We consider other theories because the painting theory is humbug, not possible, unless someone found a way to paint microscopic fibers, sometimes every other one, with a teeny tiny itty bitty little paintbrush. Replicate that, and the painting theory is back on the table. Until then, the mystery endures, and probably always will..","date":"2013-10-24","mins":"10:38 pm","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","title":"Is the Shroud of Turin a Medieval Photograph?"},{"id":"comment-48666","author":"josie_l_tyner","post":"Mr. Farey, I have done tomb stone rubbings in Virginia and West Virginia. “Rubbing” and”dabbing” techniques have as much directionality as a paint brush, believe it. You have to apply dry pigment in a series of strokes, and even if you used your bare hand, the application process still would indicate the direction of the strokes. Not to the naked eye, perhaps. A visual inspection of the SOT show some information, yest but the negative of the photograph taken by Secondo Pia, exposed the incredibly detailed information available in the SOT, You CANNOT see, on a cursory and unaided examination, the abundance of amazing information available on the negative. Yes, of course you can see some of it. But a visual comparison of the two images is astounding, is it not? Why has no one ever seriously TRIED to reproduce the effects on the Shroud? Calotyping is a primitive process using paper, LINEN paper. The Camara Obscura was known to artists and scientists of the Renaissance why no attempts? Sir, there are people in this world who would give ten years of their lives to prove the SOT a fabulous fraud. We can put men on the moon and vehicles on Mars, why can we not ape the (putatively) “fraudulent” product of relic monger? One with no modern laboratory, chemicals, or even the anatomical or archeological knowledge to perpetrate a convincing fraud..we have no answers. What fun? Much more than a matter of “fun” to some of us, sir. No laughing matter to the billions of us who call Him King and Savior. If some unknown medieval forger has mocked our faith by counterfeiting the burial cloth of the Son of God, I would like to know how it was done. And if not, the possibilities for those of use who desire life everlasting, the reunion with our loved and lost, and the drying of every tear, are wonderful indeed..","date":"2013-10-25","mins":"10:50 am","url":"https://shroudstory.com/2013/10/23/is-the-shroud-of-turin-a-medieval-photograph/","cat":"image_theory","title":"Is the Shroud of Turin a Medieval Photograph?"},{"id":"comment-48965","author":"josie_l_tyner","post":"I tried Colin’s theory with an experiment with some barbecued chicken and some ecru (no dye used) needlepoint linen. I used varying degrees of “done ness.” No scorch marks were in evidence. No matter how little or how long I cooked the bird, no “Image of the Yard Bird” imprinted itself on the linen. It occurs to me that from an experimental point of view, if the body was hot enough to scorch linen it was also hot enough to 1) blister and disfigure the skin 2) melt the sub cutaneous fat which would (and did) run out and soak into the linen. Actually, human bodies have a LOT of s.c. Fat; in some cases corpses have been found covered in solid fat (called grave wax, or, scientifically, adipocere.) Also DIFFERENT PARTS OF THE CHICKEN BURN DIFFERENTLY at the same heat. Most importantly I found that the blood oozing from the chicken turned a different color after being exposed to heat. I realize of course that live human and Puritan’s Pride pullet are different, but there you have it, in the spirit of scientific enquiry. The image of the Man is not blistered, presents no oily marks from running fat. No seasonings or barbeque sauce was used. I considered rubbing the chicken with camphor (to simulate myrhh but I don’t know if they are chemically similar, they sort of smell alike. Introduction of too many variables..","date":"2013-10-28","mins":"4:49 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-157074","author":"josie_l_tyner","post":"And I thought roasting the chicken with the linen cloth on top was daring of me. You are a brave, brave man in the cause of Science. We will be waiting for the results..","date":"2014-09-26","mins":"7:40 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-48995","author":"josie_l_tyner","post":"I am repeating the experiment with a plaster souvenir. I did learn quite a bit though. Called three funeral homes, two hung up on me. Finally El Angel funeral home of San Antonio, TX. Answered my question. Different parts of the human body do burn differently at the same temperatures. That is why the temperature of crematoria are gradually increased. But here is something to ponder: why would anyone use a coal to make the holes, when wooden fires were used to burn people? I am going to try the experiment with and without camphor. I am also going to use ALOES. I always wondered why Joseph of Arimathea brought so much darned Aloe ( aloe sativa grows in the Holy Land and Egypt, aloe Vera here in the U.S. Of A. But I think they are basically the same). Do you reckon it might have been used as a fumigant? Stories about mummification (It was still going on in Egypt because in the San Antonio Museum of Art there are mummies dating to the first and second century AD) no doubt were known. I’m not saying J. Of A. Was trying to mummify Jesus! No WAY! But, I mean, who was thinking straight that day?! Anyway, aloe is very gummy, very gooey. Should have results by the end of the wk. Yeah, I guess its a little crazy but lets face it; whoever did this, if indeed it was the product of human hands, had equipment much less sophisticated than mine. Wish me luck..","date":"2013-10-28","mins":"11:09 am","url":"https://shroudstory.com/2013/10/28/of-those-big-meaning-words-superficial-half-tone-and-striated/","cat":"image_theory","title":"Of those big-meaning words: Superficial, half-tone and striated"},{"id":"comment-157095","author":"josie_l_tyner","post":"But D. Isn’t the image on the shroud a negative? The Man of the Shroud has amazing anatomical detail when seen as a “positive,” so much more than pressing someone’s face against a cloth could achieve (had an art class as a child where we did a similar thing with tempera paint; it’s fairly gross and the end result was that each person’s face was fairly indistinguishable from his neighbor’s ) And any linen or such pressed over a person’s face would give the Mask of Agamemnon effect (super big cheeks) that the man of the Shroud does not have..","date":"2014-09-26","mins":"9:24 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-157103","author":"josie_l_tyner","post":"Mr. Freeman many of us here are artists, and we have used both acrylic gesso and the gesso proper for oil paints. The fact is, gesso makes the entire linen very stiff and the constant folding and unfolding would crack the dried gesso, if would flake off in little bits and eventually be gone entirely. The whole point of gesso is that the pigment adheres to it, not to the linen. Many of the ancient guilds of Florence and Sienna and other places had very closely guarded secrets that involved dying, tinting, etc, secrets that may be lost to us today. Even so, one would think that this knowledge would be retrievable by the best scientific equipment the world has to offer? If the craftsmen and burgers of nearly a thousand years ago can baffle doctors of organic chemistry, scientists who have more letters after their name than Carter’s has little liver pills, than I doubt a simple explanation like ‘gesso’ would go unnoticed. An unidentified genius who created a Medieval masterpiece is often called the “Master of the Annunciation (or the deposition, or the Assumption, or whatever he painted). The Master of the Shroud of Turin, whoever he was, apparently turned down every other commission he was offered to create a similar masterpiece, or he died, or he quit painting (or dying or tinting or whatever). Weird, right? Not coming to any conclusions here, but weird. IF and I say IF the Shroud of Turin is not actually the Shroud of the Man here depicted, then my hypothesis is that it is the world’s first photograph, because it is a NEGATIVE. Alchemy was a secret science guarded more closely than any guild secrets, because it was very suspect and allied to the practice of magic. I don’t know how a photographic reagent could have been applied to the cloth without destroying it. And I don’t know how such a thing could have been discovered and then forgotten. I suspect we will do no more than wonder about the SOT, for a long time to come, and perhaps forever. But one this is certain, ANYONE who claims to know exactly what the SOT must be taken with more than a grain of salt..","date":"2014-09-26","mins":"9:52 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-42254","author":"josie_l_tyner","post":"If it were possible to mimic the Shroud of Turin, it would already have been done. It is a thorn in the side to every atheist alive, because they cannot disprove it. The more it has been studied, the more it points to its Divine origin. He knew that the time would come when Christians would be hated, spat upon, and His name would be spoken without reverence and in great blasphemy. He left us, the Catholic and the Protestant.the Orthodox and the Coptic, those who must pray in silence out of fear, a postcard. This postcard could only be read when the camera was invented, and only now, can the Postmark be confirmed thru diligent study. He is telling us He is coming for his children soon, and very soon. And the more it is maligned, mocked, and ignored by the godless, the higher and brighter it will shine. Even so, come Lord Jesus..","date":"2013-08-28","mins":"6:49 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","title":"When is a Scorch NOT a Scorch?"}]
