[{"id":"comment-46930","author":"josie_l_tyner","post":"Giles de Ray was a madman. He may have been a nominal Christian, in fact, he was one of Joan of Arc’s most important commanders. I read his confessions, you can find them online. He did not kill children because he was a Christian. He killed children because, according to his own words, was deeply involved in the occult. In fact, during one occult ceremony when the blood of children was being offered as a sacrifice, he “wished to see the Devil” but in fact chickened out. Crazy people will do what crazy people do: beat their children to death, starve them, kill their enemies or those who disagree with them, and whether they say “God made me do it” or the “Devil made me do it” or “People from outer space controlling my brain with Z rays made me do it” they are still crazy. People have done horrible things in the name of God. But they did these things with ulterior motives, cloaking their evil designs behind holy trappings and the fears and gullibility of the ignorant. To impute this evil to Christianity itself is beneath contempt. No institution has been free of those who would abuse it for their own gain. The next time someone wants to point and say “SEE? He is a Christian and look what he did!” you might want to also say “he did not do this in the name of Christianity. He did it because he was a bad man, no matter what he called himself.” I would be ashamed of that kind of intellectual dishonesty sir. Straw men burn easily..","date":"2013-10-10","mins":"7:31 pm","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-47027","author":"josie_l_tyner","post":"I am a firm believer in modern psychiatry. I was, when I could work, an in home care giver for many mental patients, not only those suffering from forms of dementia associated with brain deterioration but also Alzheimer’s disease and those experiencing psychosis related to frontal lobe deterioration. That said, Gilles de Raes was one of Joan of Arc’s best commanders, a man fully in charge of his faculties and not Inconsiderable intelligence and battle field strategy, when he chose to be. There is Evil, sir, I do believe it, Evil with a big “E.” Monsieur de Raes wanted Power, with a big P. How better to take a short cut to Power than thru the Prince of the Powers of the Air, to whom it is given? If Evil can be dissipated by few hours on a couch with a nice old fellow who says, in a German accent,” Tell me about your Muzzer..” or with a pill, I’m all for it. But that is evil with a little “e,” and even the most horrifying human “monsters,” the Jeff Dahmers, the Ted Bundies, are, at their core, pathetic victims of ill treatment or, as you say, mental defectives. No amount of pills or therapy(or lack thereof) can account for the killing fields of Pol Pot, or Auschwitz. THAT kind of evil nailed the Man to the Cross, and even he was not the Christ, THAT is still true. Mankind is imbued with a sickness, the destructive, seductive desire for power that “seemeth right” but can only bring misery, just like the ring in the famous trilogy by Tolkein, that cannot be wielded for good, no matter how pure or high minded one’s intentions. Some of us still call it ‘sin,’ and the denial and suppression of it’s existence is Evil’s greatest triumph. Yes, there is mental illness, and there is particularly embarrassing contingent of self styled ‘exorcists’ a la Benny Hinn who take shameful advantage of these unfortunates. But look rather in the seats of world power and the private expensive cigar and bourbon back rooms. You will find Evil there, or rather, I hope you never do. Continued success to you sir and my respect always. , your acknowledgement of my poor contribution is an honor for me and a credit to your generosity of spirit..","date":"2013-10-11","mins":"11:41 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-199285","author":"josie_l_tyner","post":"David, I read Paulette’s comment and the way it is written, I think she meant for a joke. Honestly, I could be wrong but she looks like she is needling him for taking the article’s language a little too seriously. People are people and people are biased for or against a cause, human nature is what it is. Obviously Hugh didn’t take it that seriously, by his answer! I have seen him go off on people and believe me, if he thought he were being attacked he would flip on the high beams in a hot minute. I completely and whole heartedly agree with you, we can be sincere people without forcing our beliefs on anyone. Those who do are, in their heart of hearts, not convinced that what they believe is true, and they won’t be, until EVERYONE believes the way they do, or at least until everyone is too intimated to argue with them..","date":"2015-05-16","mins":"12:57 pm","url":"https://shroudstory.com/2015/05/16/christianity-in-sharp-decline-in-the-u-s/","cat":"news_&_views","title":"Christianity in Sharp Decline in the U.S."},{"id":"comment-199273","author":"josie_l_tyner","post":"When was Christianity a “numbers game?” From the earliest days of faith, Lot beseeched the Father to spare a hateful, wicked place for the love of ’10 righteous men.’ No soap, no 10 good guys. How many people were at the foot of that Cross? Two. How many people hung around on Sunday to try and give the Body of their Master a little dignity in death, as He had given them love in life? As Christians, the Lord gave us the Great Commission ” Go ye unto all peoples, unto all lands..” and so we do. He didn’t tell us to count them. In fact, the Christ TOLD us that two thirds of ALL the seeds planted would not sprout. Some will fall on rocks, some on soil too hard to bear fruit. How many Christians are there? The day will come, I believe in my lifetime and I am no Spring chicken, that the ‘people in the know’ will avow that faith is dead. Let them. So what? What to those of us who truly, completely, believe in Him? Caiaphas, Nero, Domitian, Robespierre, Marx, Lenin, Hitler, Stalin, Hitchens… where are they? And Christ still lives and reigns. He told us, “Lo, I will be with until the end of the world.” Even so, come Lord Jesus..","date":"2015-05-16","mins":"7:38 am","url":"https://shroudstory.com/2015/05/16/christianity-in-sharp-decline-in-the-u-s/","cat":"news_&_views","title":"Christianity in Sharp Decline in the U.S."},{"id":"comment-199274","author":"josie_l_tyner","post":"Correction: Abraham, not Lot, pleaded for Sodom. My bad, it’s early in the morning and I just started back to get my BSRN at 57. Those of you out there who pray, pray for me. I hope, in my otherwise worthless old age, to do something besides soak up oxygen. Old people are perhaps the most underused resource world wide, mostly because people tell us we are moldy old sweat socks and need to get out of the way. Well, I don’t plan to any time soon. So somebody pray that Josie has strength, determination and more Ginko Biloba because 5 years ago I wouldn’t have made a mistake like that! Ugh, the shame, sorry father Abraham….","date":"2015-05-16","mins":"7:45 am","url":"https://shroudstory.com/2015/05/16/christianity-in-sharp-decline-in-the-u-s/","cat":"news_&_views","title":"Christianity in Sharp Decline in the U.S."},{"id":"comment-47419","author":"josie_l_tyner","post":"Hmm. Sorry you are not up to the challenge. I am breaking out a dictionary, some of my father’s old books on clinical chemistry, and am now in contact with University of the Incarnate Word of San Antonio to try to unravel what is sure to be an interesting study. When I understand it, perhaps I will disagree with it.. What I think is more likely is that I will come to a place, or places, where I believe he has interpreted data perhaps too subjectively. Either way, before discarding it entirely, I should like to look into it with a scientific point of view, and without prejudice..","date":"2013-10-13","mins":"6:31 pm","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"id":"comment-47438","author":"josie_l_tyner","post":"Dr. Diaz will you be submitting any papers to the IEEE ATSI conference of the Instituto Di Sindologia scheduled at Bari, Italy in 2014?.","date":"2013-10-14","mins":"12:18 am","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"id":"comment-47247","author":"josie_l_tyner","post":"It took me awhile to understand what Dr. Diaz was trying to say. Had to pull out a medical encyclopedia, and it was still confusing because I could not understand his ideas about finding residual EMR on a cloth, purported to be, even by skeptics, more than 500 years old. I understand Dr. Diaz did not have direct access to the Shroud, so how could he examine it for residual EMR? The so called ‘spectral emission line’, presumably, is the result of electromagnetic activity surrounding the Shroud but under what conditions? and when? And what equipment was used to analyze this? As I understand it, the SOT is now kept in an airtight case filled with Argon and some other gasses, would this affect Dr. Diaz results? I got as much info as I could at the local library and the internet about images being produced in cancerous tissue, came up with nothing. And I came up with less than nothing about cytokines and signaling proteins creating embryo like pictures on anything. I would like Dan to invite Dr. Diaz to further explain his findings on this blog. As it is, with no disrespect to dr. Diaz, I can’t understand why a doctor, a pathologist, with a string of letters a mile long behind his name, would imperil his academic credibility by signing his name to this paper. It seems like really bad science, and even worse theology. I do indeed believe in Jesus, but it would seem to me very irresponsible to pass this along, unless someone can explain why finding so called “embryo pictures,” and they don’t look embryonic to me is proof of anything. I know people here who have found mold patches that look like Elvis on their refrigerator, and Mary on a tortilla, and aside from the scientific language, this looks like the same thing. Any chance there is no “Dr. Diaz,” and someone is, as my English e pals say it “having us on?” Sounds like it to me..","date":"2013-10-12","mins":"1:14 pm","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"id":"comment-47409","author":"josie_l_tyner","post":"Dr. Diaz, thank you for your participation. I for one realize that your theories and research, while controversial, deserve at least the effort to understand what they are. There have been many controversial theories for the formation of images on the SOT. Yours is hardly the wildest I have ever heard, believe me. I do not share the impressive academic credentials of many of the contributors to this blog. My father was a BSMT (bachelor of Science in medical technology, Geneva College, New Brighton PA class of 1962), and his concentration was in clinical chemistry. I still have his books and will use them to attempt to interpret some of your research. I will do my best to understand what I can, and continue to research what I don’t. I no longer doubt your absolute sincerity, and do apologize for my joke about the tortilla. You can imagine blogs like this get their share of pranksters. Some of the responses to your obviously sincere posting are in very bad taste, and unworthy of those who have stooped to this level. I think perhaps your theories are so controversial that many have been taken by surprise. I hope you will continue to contribute to this blog. I, for one, look forward to the contributions that make this blog as interesting as it is. Gracias mil..","date":"2013-10-13","mins":"5:12 pm","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"id":"comment-47415","author":"josie_l_tyner","post":"Mr. Berry, I am wearing a nice, even, coating of egg on my face, because I truly believed Dr. Diaz’s paper was a prank. In fact, being a native Spanish speaker, the pronouncement of his name sounds like “Herodias,” I was pretty sure I was right until today. Since the redoubtable Dr. Diaz has taken the time to offer an exposition of his theories, might you not refute him, scientifically, point by point? It seems rather easy to say “mumbo jumbo,” perhaps if you can explain at what points you disagree with him specifically we may all be able to benefit from your experience and acumen. It may take me a little time to digest, but I am certain it will result in a very interesting posting for one and all..","date":"2013-10-13","mins":"5:46 pm","url":"https://shroudstory.com/2013/10/12/in-a-peer-reviewed-scientific-journal/","cat":"news_&_views","title":"In a peer-reviewed scientific journal"},{"id":"comment-44454","author":"josie_l_tyner","post":"Isn’t it strange that this is the ONLY example in the entirety of human history where this has happened? The search for naturalistic answers is a waste of time, since mathematical probability discounts the chances into the untold billions. How much radon gas, exactly, would you need to create an image thru limestone rock, 5 or more feet thick? In a damp tomb? Onto a cloth? Without a light source? The academic community has no shame in advancing the most outlandish, never happened in known history, can’t verify it kind of armchair theorizing because the implications of the Man are too terrifying for them to contemplate. If the learned doctors, or whatever they are, really believe that ‘concurrent variations in the geo/magnetic gobbledy gook’ could account for the image of the Man, then reproduce it in a laboratory. Then we will see how ‘certainly credible’ they are. THEN let them explain how this happened w/o the benefit of hundreds of thousands of dollars worth of equipment in the 1st century. Frightened children climb under the blankets and repeat ‘the boogyman’ doesn’t exist, daddy says so.’ But they still shake and pee their nightshirts in fear, when they feel the hand on their shoulder..and its only Father trying to comfort them with His presence. How sad..","date":"2013-09-16","mins":"5:35 pm","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"id":"comment-44543","author":"josie_l_tyner","post":"I must admit you lost me. “It is not necessary to believe the image was caused by naturalistic means, or miraculous means.” Are there any other possibilities? If there are, could you suggest some? I mean, maybe I don’t quite “get it” but if it did not happen by forces in nature, or out of nature, then what are we left with? I think the TS has been approached by the most sophisticated scientific equipment and the soundest methods available to modern man, for upwards of forty years now. I have been following events concerning the TS since the STRP team in the 1970’s. “We don’t know if any other burial cloths contain images,” archeological evidence has never produced any, has it? “We need to remember that the image is not of a glorious resurrected Christ, but of a very dead corpse. That would seem to rule out etc.” I am sincerely looking forward to your sharing your unique insights on the mechanism of the Resurrection. I had always believed that, barring the information given in the Gospels, this constituted a mystery known only to the Almighty. Christ’s physical body did, indeed, die. Without his complete, utter, physical demise, the whole idea of the Resurrection kind of collapses. Experiments attempting to re create artificially an event that you freely admit occurred providentially would only seem to preclude an accidental occurrence. In fact, you don’t have to look that far. Any photograph produces a negative, doesn’t it? But who knew how to “treat’ a linen cloth in the first century? Has anyone found any chemicals on the TS that would produce such an effect? By me, go ahead, study TS all you want. But all you need to know is right before your eyes. I mean, it would have been truly great to get an image of the Lord smiling, waving “toodle loo” or giving the “thumbs up” sign. But that would preclude the need for any faith at all..","date":"2013-09-17","mins":"3:25 pm","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"id":"comment-46665","author":"josie_l_tyner","post":"Never say anything online that you would not say to a person’s face. Never say anything online you would not say in front of your mother. Nothing is hidden from God, and if you don’t believe that, then believe this: every word typed into cyberspace is there forever, no retraction can recall them, anymore than you can unring a bell. . I think this blog is one of the most marvelous tools in the world to learn about the science and discipline of Syndonology, But sadly it is also a place, as of late, where basic civility and respect seem to be lacking. We all know the study of the Shroud has always attracted its share of conspiracy theorists and ranters, and we all need a good laugh now and then. But haughty, elitest, academic sneering, personal attacks, obscenities…not attractive, folks. I, for one, think if would be a good idea for anyone defending a particular theory, to cite their references so the rest of us can have access to them. Many posters here already do Who knows, you might develop a following. But an undignified and hate spewing presentation does nothing but build barriers to communication. My neighbor La Keisha puts it this way: “God don’t like ugly.” I think she may be right..","date":"2013-10-09","mins":"11:55 am","url":"https://shroudstory.com/2013/10/09/on-holy-trollers/","cat":"news_&_views","title":"On Holy Trollers"},{"id":"comment-149264","author":"josie_l_tyner","post":"Can anyone tell me how this artifact was dated, and what evidence exists that it is indeed ‘not made by human hands?’ I see some very, very real reasons to refute this claim 1) I see no similarity whatsoever between the features of the Man of the Shroud and this image. None. The eyes of the artifact under discussion are very much in harmony with the Siennese school of painting, the hooded, almond shaped eyes in vogue in religious paintings in the 1200s. The nose is poorly done, and is in fact out of the alignment with the mouth. This image’s face reflects no injuries nor bloodstains associated with the Crucifixion and in fact does NOT represent a Semitic man! Any claims made to be ‘not made of human hands’ the Shroud of Turin has supported with scientific evidence, the most modern equipment being unable to refute this just and supported claim. What does science say of this artifact, and who says it?.","date":"2014-09-07","mins":"11:29 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"id":"comment-44557","author":"josie_l_tyner","post":"Sir, if I, or any other Christian, needed an artifact, however hallowed, to bolster my “fairy faith,” I assure you my certitude would be small indeed. In the Gospel, Jesus Himself derided and mourned over the generation that expected “signs and wonders” to prove His sovereignty over the natural and spiritual world. Perhaps you should read my posting with a little more critique and a little less prejudice. I have no problem with scientists of any discipline investigating the TS. What could it hurt? But perhaps you could explain how Mr. Daveb of Wellington NZ can ascribe the production of the TS to neither the natural, or the supernatural. My clear, and I believe, very fair question was, to what other agency could one ascribe the production of the TS, or indeed the production of any object? Does it not have to be one or the other? Not knowing which is one thing, and I assume that could be the object of scientific inquiry. But it came from one or the other, and a course of investigation must start somewhere. The scientific method demands the formation of an hypothesis. “Neither” does not cut the mustard. My second concern is how does one spend decades creating the exacting conditions needed to produce an artifact so unique as to merit world wide scientific attention, and then ascribe its creation to accident and happenstance? My third, and I believe most overriding concern, is the how Mr. Daveb can assert with any expertise whatsoever that we can “rule out the formation of the image to the Resurrection.” If Mr. Daveb has some knowledge as to the exact, or even approximate, circumstances surrounding the events of Easter Sunday 33 C.E. I would hope he would share them on this blog. My point is, how can he even begin to theorize about what evidence constitutes, or does not constitute, evidence of the Resurrection or the effects of the same on the ST?And my favorite quote so far?”It might not be as rare as we imagine.” If in the history of scientific inquiry or archeological discovery the like has been found, I don’t know of it. I would call it rare, sir. Finally, thank you for your heartfelt concern for my frustration levels. Not that you sounded condescending or anything. The simple, the lumpen, and the hoi polloi have as much interest in the progress of Syndonology as those in the exalted and rarified realms of academia. Perhaps more so, because He is our Love Eternal. In the more direct words of St. Severinus the Truculant: “Thou are not the boss of me.”.","date":"2013-09-17","mins":"6:02 pm","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"id":"comment-149568","author":"josie_l_tyner","post":"Thank you, and I did check out your most scholarly work. And I know what I write will probably not make sense, but I have to say that when confronted by both images, there is just not the same feeling. The quiet holiness of the Man of the Shroud fills one with peace, in spite of the obvious violence inflicted upon the body. The face of Manopello seem to me to be disquieting, emotionless, well done to the point of absolute virtuosity, and very inhuman. I can, and have, looked at the face on the SOT, for hours, and feel the closeness of God, and there is something in the Manopello face that makes my skin crawl. Those hooded, emotionless eyes, a face supposedly battered beyond recognition, is somehow there in perfect composure, hardly a hair out of place, no beard pulled out as the Scriptures say, no blow on the face from “Prophecy! Who struck thee!” nothing evidenced on the SOT, where every single blow and bloodstain finds perfect Scriptural confirmation. The Man of the Shroud is a bloody, battered mess, what one would expect a victim of Crucifixion to look like. And where, exactly, does a poor Hebrew woman get byssus? Not impossible, but I never got the impression the better classes of Judea attended the crucifixion processions of criminals. There are miracles and miracles. An opinion based on an emotion is not going to sway anyone either way, but for me, personally, my gut is telling me this is not a picture I want in my home. No reflection on your masterful work of course, I speak of a very subjective feeling of something being ‘not right’ on a level I cannot understand. But for now, I am listening to my gut..","date":"2014-09-09","mins":"1:14 am","url":"https://shroudstory.com/2014/09/07/the-veil-of-manoppello-to-visit-the-philippines-this-month/","cat":"news_&_views","title":"The Veil of Manoppello to Visit the Philippines This Month"},{"id":"comment-149658","author":"josie_l_tyner","post":"I think this man is just ‘having us on,’ as the Aussies say. No one who is a Christian will believe this rubbish, Christians of any denomination will back up what the Bible says; “no one, only the Father in Heaven, knows the day nor the hour when the Son of Man will return.” and “He will come as a thief in the night,” not as Lady Gaga on tour. My daughter calls me Frau Farbissener (affectionately) because I am a dead ringer for Mindy Silverman of the “Austin Powers” series, but can I act? Nope. Unless Mr. Marshall starts healing the sick, raising the dead, vanquishing all evil on the Earth, I just can’t give the coveted “Josie Lu’s Stamp of Approval.” Better we should laugh this one off, have a few yuk yuks at the rather handsome Mr. Marshall’s expense and move on..","date":"2014-09-09","mins":"9:36 am","url":"https://shroudstory.com/2014/09/09/tinfoil-hat-version-of-face-matching/","cat":"tinfoil_hats","title":"Tinfoil Hat Version of Face Matching"}]
