[{"id":"comment-37107","author":"josie_l_tyner","post":"All things of this Earth serve God and His purpose. What if all Lombartti said is true? How does that affect the STURP findings? Is this man serious? I am sorry, but if the criteria for accepting scientifically proven facts is that the researches be free of sin, how crazy is that! I mean, suppose the accused man is guilty. This matters how? I suppose I can’t say “Leonardo was a great Renaissance painter because he was a homosexual.” Or, “Tycho Brahe’s astronomical observations are incorrect because he had siphyllis”. ?That isn’t even Christian doctrine, Protestant or Catholic! I have no idea who this Lombartti, person is, but ‘so what’s your point’ is what I say..it makes no sense at all..","date":"2013-06-15","mins":"1:40 pm","url":"https://shroudstory.com/2013/06/15/an-antonio-lombatti-poop-dump/","cat":"news_&_views","title":"An Antonio Lombatti Poop Dump"},{"id":"comment-36739","author":"josie_l_tyner","post":"This was obviously place before the Giulio Fanti vibrational spectroscopy tests. The writer would have us believe that the ST is no better than the plethora of medieval relics that flourished when the relic trade was both fashionable and lucrative. However, and rather disturbingly for him, the Shroud is unique in every sense an artifact can be. Crucifixion was a common brutality in Roman rule. So where are the other shrouds? Rather like the evolutionist, when asked for his intermediary forms, for the bones of the little birdy the reptile gave birth to one day by mistake, this worthy writer will no doubt say, “we’ll find them someday.” Perhaps. It cannot be linked with any person, but if it had been found in Los Angeles yesterday morning only a hermit living in a cave on Mars could not tell you who it was. Who, indeed..","date":"2013-06-11","mins":"7:51 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","title":"Barrie Schwartz on the Shroud of Turin"},{"id":"comment-36741","author":"josie_l_tyner","post":"* sorry, partially blind. Refers to comment by by l. Singer sorry mr. Hart..","date":"2013-06-11","mins":"7:54 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","title":"Barrie Schwartz on the Shroud of Turin"},{"id":"comment-49898","author":"josie_l_tyner","post":"OK, I am familiar with your postings, and read them carefully. I am inclined to believe that the Shroud is authentic. However, I do not expect my opinion to be universally held, in spite of evidence I believe to be very supportive of this case. And I agree with you to an extent; many people who post here will never, EVER be convinced, not even if the Man of the Shroud starts to sit up and sing ABBA’s “Dancing Queen” in the middle of the Turin Cathedral, at 400 decibels and shatters the windows. Because if they did, their entire world view would have to change. They would have to say “God is real, so I owe Him something and must obey Him.” The atheist is not afraid that there is a God, he is afraid that he is no longer his own god. So don’t expect to convince anyone that the Shroud once wrapped the Son of God. Never will happen, not on this blog. EVER. I am more inclined to believe that, given sufficient evidence, and with continued study, that it can be proved that the SOT once wrapped the historical Jesus of Nazareth. The only problem is how, by what means, did this unique artifact come into existence? If the SOT did NOT wrap a cadaver, than what? NOT plaster hot enough to scorch a linen cloth, and not a dead body hot enough to scorch linen THAT much I am certain of. There are NO such artifacts in existence today, certainly not of the (even disputed) age of the Shroud. Very few are they who possess the scientific acumen to argue the molecular properties of chemical components found on the Shroud, or the have technical savvy to argue how the 3 D properties differ in each equipment used for this study of Sindonology. But those simple ones, like myself, who follow this blog and read as much as they can on the subject, have more to lose or gain than any academic. We have staked our lives, and anything past our lives, on the deeply held conviction and belief that Jesus is not only real, but that He lives and reigns and will come to bring us unto Himself. Having said that, no artifact can provide proof of the Divine. In the Scriptures, Jesus Himself has but faint praise for those whose tottering faith depends on ‘signs and wonders.’ These things are for spiritual babies and toddlers. No mature Christian, of any denomination, stakes their faith on an artifact. If it was somehow made by human hands, this I would truly like to know. But conversely, if this Shroud is a sort of postcard to an age where committed faith is rare, then He willed this for reason, and this I would also like to know. An English poet named Lear wrote a poem called “The Blind Men and the Elephant,” we are all blind men and the Elephant, the Shroud, we many never be able to perceive save through our own pre conceptions and prejudiced beliefs. But I, for one, will continue to try..","date":"2013-11-04","mins":"10:42 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49952","author":"josie_l_tyner","post":"Andrea, I agree with you about RCC priests being among the most tenacious arguers against the examination of the Shroud. But the reasoning behind it is not what you think. Take a look at what the Catholic Church has claimed, in the past to be true: That wine and bread become flesh and blood ( Cannibalism is a horrible concept.) An old English ballad of the Presbyterians tells the story of a Catholic husband whose wife became a Protestant. He invited a priest to celebrate mass in their home, and bade his dissenting wife bake a loaf of fine bread for the occasion. Upon completion of this sacrament, the wife tells the priest “I have put a pound of arsenic in the batter, but since you’ve changed it’s nature, well, that really cannot matter.” She of course did no such thing, but as the screaming priest ran off to get an emetic, she pointed out to her husband that not even HE believed it. The concept of Purgatory is built on the flimsiest of suppositions in the book of Maccabees, praying for the dead may be done without assuming the existence of a place never mentioned by Jesus. Or Moses. Or anyone else. The worst of these inexcusable superstitions, in my opinion, is the exhibition of the so called “incorruptible” saints. I accompanied a former employer to Lourdes many years ago. She was heart broken, and later fired me, for making the resident priest admit that the beautiful Bernadette Soubirous had actually turned black years ago, and what they were looking at was a wax covering. Saint Teresa of Avila, one of three female saints the RCC named Doctors of the Church, was hacked to pieces so parts of her body could be distributed as relics. In the light of the claims and teaching supported by the RCC in the past, are you surprised they are reluctant to make any pronouncements about the Shroud of Turin?.","date":"2013-11-04","mins":"7:40 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-49950","author":"josie_l_tyner","post":"Dave, you bring up a point in your excellent (and hilarious!!) refutation. I have read the work of Max Frei and Alan Whanger. Ok, whatever the critics say. But what of the excellent work of Israel’s leading botanist, Avinoam Danin, and his work? He found, among other pollens, figoneum molis, an herb used unto this day by the Bedouin people for healing superficial wounds. But he also found, around the head, a huge preponderance of the pollen of Gundifolia Dumosim, an extremely nasty spined plant that only blooms in, and around, Jerusalem. Could it have been transplanted? What are the odds? Have you heard of his work? What do you think of it? I stand my ground on the skeptics, nothing you point out, individually or together, however Damascus Linens, Inc. Makes them look, will matter. But you put it with..how is it? Dry British humor, even if you are in NZ. Kudos..","date":"2013-11-04","mins":"7:22 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","title":"Consider Rogers"},{"id":"comment-46570","author":"josie_l_tyner","post":"What if there were an “official position” on the Shroud? What would it matter? Christ Himself said “Ye have seen and believed. Blessed are those who have not seen, yet believe!” He also decried a generation as “faithless” who needed “signs and wonders” to believe. Why should the RCC take a position Jesus Himself would scarcely endorse as a desirable alternative to the trust in Himself He so wants us to have? There is much credible evidence that Shroud of Turin is authentic, and much learned academic study that can hardly be ignored that points to the contrary. I remember when the C14 test was the “last word, oh yeah, it’s a fake, everybody go home.” Well, it seems it was not the last word, after all. The RCC is VERY wise to admit, that, while a relic ‘worthy of veneration,’ so is every plaster statue of every saint and every mummified ‘incorruptible,’ jerked and de hydrated in gilt glass coffins under layers of painted wax to hide their blackened, sunken faces. Given these ‘venerable’ examples, it is probably for the best the RCC make no extravagant claims to authenticity. If I am wrong then perhaps a pilgrimage to the Holy Toe of Saint Dionysius the Areopagite might cure my gout, after all. Please take no offense to my humor, none is intended. But I think my point is well taken..","date":"2013-10-08","mins":"9:29 pm","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"},{"id":"comment-47019","author":"josie_l_tyner","post":"I have seen pictures of the so called “incorrupts.” And what the RCC accepts as incorrupt are, mostly, in a fairly good state of preservation but hardly un accounted for by natural means. Natural mummification is not that unusual. Look up the corpse of St. Rita, from the 1200s. Dessicated for sure, a natural mummy. I have seen the corpse of St. Bernadette. As a caregiver, I travelled with my partially paralyzed employer to Lourdes.( caregivers get awesome rates, sometimes half price.) I told her what she was seeing was a wax mask, and made the custodial priest admit exactly that. They are not allowed to lie to pilgrims anymore. Bernadette’s corpse, initially, had a very lifelike appearance. But after awhile her face turned black as coal. My boss did not appreciate my truth telling, and I was dismissed shortly after returning to the States for “breaking a dear lady’s heart.” But if you want to live in a lie, it better be a better one than that. Same thing for the corpse of Saint Catherine Laboure, St. Vincent de Paul, all covered in wax. The head of Saint Catherine of Sienna is in an awful state, still on exhibition for some reason. THAT is why the RCC takes no position on the SOT. Embarrassing positions they have taken in the past, bowing and scraping and trading in pieces of so much jerked and dried meat in fancy glass coffins. As M Luther once joked, “19 of the original 12 apostles are buried in Spain.” Some of that pre Vatican 2 stuff is pretty much swept under the rug, and they have no plans to trot it out any time soon..","date":"2013-10-11","mins":"10:18 am","url":"https://shroudstory.com/2013/10/07/what-did-stephen-jones-just-say/","cat":"news_&_views","title":"What did Stephen Jones just say?"}]
