[{"id":"comment-203450","author":"josie_l_tyner","post":"We are not going to have unbiased coverage from the media when it comes to the SOT or anything else regarding religion. Catholics, Protestants, Orthodox, etc. Have all been branded idiots by the media, regardless of our level of education or success. And maybe that has more positive ramifications for the believer than we think. We will never, ever be friends of the world, we are hated of the world and will always be, we have had the highest assurance possible of this fact. I was raised in an atheistic household, and had to do my research and reflection, although God leads us to Him by His own means and ways. The author, typically, has failed to mention that NO medieval portrait of Christ, and no Renaissance portrait either, depicts Christ naked. The medical accuracy of the Shroud had never been duplicated by a work of art, NO artist has ever gone that far in terms of morbidity or gruesomeness, not even Matthias Gruenewald. That the blood on the SOT is genuine is no longer in doubt, that the patterns of blood correspond with the stains of the Cloth of Oviedo has been established by forensic science. That pollen corresponding to plants that bloom ONLY in Palestine in the Spring are on the SOT has been established by outstanding biologists in Jerusalem and Europe have been established as fact is not in doubt. We might go on and on, and Carbon 14 tests done on the leg of a mammoth establish that it is 1000 years older than the head of the same frozen animal, but what of it? No evidence presented will be sufficient to move those who have established, a priori, that there are no miracles. All we can really do is wonder what motivates a journalist to write an article with no research behind it, and what motivates the journal to pay someone who writes this kind of poorly researched stuff..","date":"2015-06-24","mins":"7:58 am","url":"https://shroudstory.com/2015/06/24/in-the-eyes-of-the-befuddled/","cat":"press_coverage","title":"In the Eyes of the Befuddled"},{"id":"comment-49144","author":"josie_l_tyner","post":"Ummmm….Edmund Burke, a famous English jurist, said something I must write in paraphrase because I do not remember exactly his great saying. “There is nothing so inimical to the truth as the refusal to examine evidence.” So I will download Mdme. De Sainte Simons’ book on Kindle, if such is available. It’s a cinch it’s not at the local library. The library system in North America is undergoing a “sanitizing” that includes the removal of great Christian works. Oh, you can find anything you want on Islam or Hinduism or Wicca, just don’t ask for a copy of Foxes Booke of Martyrs. EVER. Having said that, you are going to have a hard time selling the idea that Jesus appeared to anyone after His Ascension to a Protestant. Paul heard a voice and was struck blind, and that was it. St. John the Divine saw a vision, but whether he saw in the flesh or otherwise he wisely writes, he was in the Spirit on Lord’s Day, meaning, perhaps, he saw a vision. The RCC has claimed a lot of things, actually. Without going from Wycliffe to Luther and beyond on what I don’t believe in, let me be a little more circumscribed: 1) How could Jesus pose for a picture 300 years after he died? 2) By the Vero Icon, I assume she means the Veil of Veronica. Where is this veil, and is science allowed to examine it with the same rigorous attention given to the SOT? I do not mean the Cloth of Oviedo. There is some evidence it was found with the SOT. 3) You know what? An alien appeared to me and directed me to make a painting of him in his space ship. Not really, but you see my point. 4) Man, I would LOVE to see this photo of Jesus. Really. I mean, if there is a photo, maybe He will let us take another one, right?! Paul Vignon explained how the images of Christ tend to look like one another, and there is tangible, REAL evidence going back to the sixth century, a Byzantine coin reading “Iesu Christus Rex Reginarium ,” exhibiting almost every characteristic found on the Man’s face. There are many others. Tangible evidence, from history and archeology. Well researched in the context of world history, examined by historians and scientists who have achieved pre eminence in their fields of study. Stories about flaming hearts and Jeez a razzi,? Isn’t this why people think we should be wearing tinfoil hats? This is in league with those sad, awful, blackened people jerky covered in pretty wax and paint and displayed in Lourdes and other places. ” A true, historical evidence??” History is not what someone claims to have happened, independently of any corroboration!! Or doesn’t Her Ladyship get that? Let me tell you how I think he looked. In the Gospel, Judas identified Jesus with a kiss on the cheek. Why? Because He looked like everybody else. Not taller, not more handsome, he was so non descript in His earthly walk, somebody needed to point Him out. “A true historical evidence?” Meh. We’ll see..","date":"2013-10-29","mins":"8:00 pm","url":"https://shroudstory.com/2013/10/28/new-book-by-dame-de-saint-simone/","cat":"books","title":"New Book by Dame De Saint-Simone"},{"id":"comment-49149","author":"josie_l_tyner","post":"* Got a look at Wikipedia at all three together. I’ll go with the Vera Icon looks a lot like the SOT. * so can scientists examine it, or what?) But I want to get a look at the stills from the silent movie, “King of Kings: (1923?) because that face looks awfully familiar….","date":"2013-10-29","mins":"9:19 pm","url":"https://shroudstory.com/2013/10/28/new-book-by-dame-de-saint-simone/","cat":"books","title":"New Book by Dame De Saint-Simone"},{"id":"comment-49580","author":"josie_l_tyner","post":"Hugh, repeated the experiment with a plaster statue. Baked at 500 F. Got a good deal of smoke and scorching of the linen cloth, but no imprint. If Colin’s theory is anywhere near viable then it would HAVE to be, in my opinion, with a metallic statute made red hot. I used two statues, a souvenir statue of a Mexican guy in a sombrero, and a plaster statue of Venus I found in a thrift (second hand) store. I also bought a statue of Mary but could not get the paint off. For experiment #1 I cooked the Mexican guy with the cloth. Set off every smoke alarm in my house. For #2 I heated the Venus only, then wrapped the cloth around it. In BOTH cases, the plaster CRACKED under intense heat so it would not be plaster, in the case of CB’s theory is right. I have to go out into the country side next month to bust up a small goat shed. My son is coming with me and is going to help me get a major bonfire going. We are going to heat up an elaborately engraved iron trivet (don’t worry we never did like it much) and attempt to scorch more undyed linen. I don’t think CB is right, but until all possibilities of this theory are experimented, I cannot rationally discard it. I know it will scorch, but will it retain the amazing details in the photo negative? A number of films will also be taken. THIS ONE I will post the pictures. The others showed nothing one would not expect; just some non descript blurs and smoky marks, on the linen used with the the statues, neither of which produced evidence even remotely validating CB’s theory of the heated statues. Again, if CB is right, then the SOT characteristics should be inherent in the appearance of the positive and negative views of the pictures taken. I will keep the blog posted. Best, JT.","date":"2013-11-02","mins":"10:09 am","url":"https://shroudstory.com/2013/10/28/new-book-by-dame-de-saint-simone/","cat":"books","title":"New Book by Dame De Saint-Simone"}]
