[{"id":"comment-4518","author":"yannick_clément","post":"For the question of the authenticity of the 4 relics that are mentioned by M. Fanti, I can say that over the years, I think I have develop a good series of criteria to judge if a relic have some chances to be genuine or not. The first one is one of the most important. I call it the criteria of the “loneliness and authenticity”. In other words, is this supposed authentic relic is alone in his category or is it other object of similar nature around the World ? And is this relic have some really good degree of authenticity attach to it (after some scientific validations were performed on it) ? If there is more than one object that can fit the criteria, then my degree of doubt is higher because that mean that at least one of the two (if not both) are surely false. Also, when I take only the second part of the criteria and found that a relic as not a high degree of authenticity (for exemple, a relic of the passion with no blood stains on it), my degree of doubt is higher because that mean it would have been way more easy for an ancient forger to have produced this kind of relic. If I take this criteria and apply it to the 4 relics, that would give this : I’m not aware of another supposed Shroud of Christ around the world with a very good degree of authenticity like the Shroud of Turin (with confirmed human blood and body images on it). Also, I’m not aware of another sudarium of Christ around the world with the same degree of authenticity like the Sudarium of Oviedo (with stains on it that were found to be of human blood for one part and of a clear fluid coming from a pulmonary oedema for 6 parts). Also, I’m not aware of another tunic of Christ around the world with the same degree of authenticity like the Tunic of Argenteuil (with stains on it that were found to be of human blood). Finally, I’m not aware of another Titulus Crucis with the same degree of authenticity that the one kept in Rome (with ancient forms of writings that were confirmed by specialists). So, it’s fair to say that those 4 relics passes the first criteria. Now, for the second criteria, I call it “the historic possibility” criteria. Is there a good possibility (without having to invent too much special assumptions) that this relic was an authentic object that was taken after the death of the person that was related to it and was kept with great caution by his followers ? For the Shroud, I think the possibility is good, even if I know some people who denied the authenticity by saying that the Jews would never have kept a blood stain burial cloth like that. This argument is very true if we forget the resurrection account (which, I admit, can be consider as a special assumption). It’s only in the light of the resurrection that the possibility is high that someone close to Jesus would have kept his burial Shroud. The same thing is true for the Sudarium and even the Tunic of Argenteuil. Because those cloths contain blood stains that could have been thought as sacred by the disciple of Jesus (in the light of the resurrection), I think there is a fairly good possibility that someone would have kept them. But, I have to say that for the Tunic to be genuine, we must add another special assumption. Like I said before, St John tell us that it was a Roman soldier who was in possession of this cloth after the death of Christ. Then, with this in mind, we have to think that this soldier would not have washed the cloth at all (because there’s a lot of blood stains on it) and would have been kind enough to give it to a follower of Christ later on ! I think the possibility for that to have really happened is really low. For the Titulus, it’s another story because this piece of wood didn’t possess any blood stain (as I know) and I don’t see any good reason for a disciple to have kept this thing. So, we can say that only the Shroud and the Sudarium pass the second criteria, and it’s important to say it : only in the light of resurrection. Forgetting this event, there would have been no reason at all to keep those 2 cloths. My 3rd criteria is what I call “the possibility and the easiness for a forgery”. This criteria is very important because it deals with the logical thinking and even when we take it alone, it can be enough to judge if a relic have a very good chances (or no great chances) to have been forge. When we apply this criteria to the Shroud, it is obvious that the chances for this cloth to have been forge are close to absolute zero. For the Sudarium, the chances are not so low but are, nevertheless, very low. In fact, who, during the 7th or the 8th century, would have known that a person crucified would normally died of a pulmonary oedema link to a suffocation state ? Even in modern history, we had to wait until the experiments and studies of Pierre Barbet to learn that it was probably that way that Christ died on the cross ! Why a forger would want to go so perfect in medical details like that ? To make this kind of relic, all he would have need would have been to put some chicken blood (or blood from another animal) on some parts of the cloth and that’s all ! Don’t forget that the crucifixion was banned during the 4th century. Who during the 7th or the 8th century would have known medical details like that ? And even if he knew them, why would he give himself so much difficulties to achieve a simple relic like that (with no body image or artistic essence) ? For the other 2 relics mentioned by Fanti, the chances for a forgery are much more high because of the simplicity to accomplish it. For the Tunic, someone could have easily put some blood stains on a tunic and that’s it. No need for great medical expertise to accomplish this kind of relic. And, for the titulus, all that is needed is someone with great skills in ancient writings and, during the Middle Ages, there was surely some monks who could have done this kind of relic. So, again, from my perspective, only the Shroud and the Sudarium pass the test of the 3rd criteria. Finally, I have another criteria that I called “the smell of truth”. I admit it is more of an intuitive criteria but I keep it because I believe there’s some space for intuition in a scientific reflection. So, which one of those relics have a smell of truth attached to it ? Personally, my feeling tells me that the Shroud and the Sudarium have a very good smell of truth. The Titulus have more of “a copy from the original” feel. And, for the Tunic, my feeling is in between… In the end, I can say that, from my perspective, only the Shroud and the Sudarium have good chances to be genuine. But I wouldn’t close the door completely for the possibility that the Tunic could also be genuine. But again, the problem is the special assumption that are needed in this case because of the fact that it was kept first by a Roman soldier after the crucifixion… More research are needed to know the truth about those relics and the fact that they all failed to pass the test of the radiocarbon dating should not be count as enough to totally reject them because of the fact that they pass at least some criteria that I state earlier. Nevertheless, the fact that no C14 tests gave a first century date is pretty bizarre regarding other facts coming from other fields in science, especially for the Sudarium and the Shroud… The best would be some direct comparative studies for those 3 relics of Christ that contain blood stains, but it’s surely not for tomorrow !!! With the development of genetic research, I think the blood that is on the 3 relics become more and more important and can lead to some conclusions in the future. A comparative DNA study of the fibers from those cloths could also be a good avenue of research to explore in the future… That’s it for the moment folks !!! I hope M. Fanti won’t be mad at me, but I had to express the fact that I think he’s completely wrong on many aspects of this topic. It’s not because those relics are related to the Passion of Christ (and the resurrection also, for the Shroud) that they were in contact with some unknown supernatural forces… From a purely scientific perspective, thinking that way will never produce something positive because, unless someone could resurrect the dead in laboratory, how in the world can you prove your claims ??? I really think there’s so many other interesting avenues in science to explore regarding the Shroud, the Sudarium and the Tunic than this supernatural fancy..","date":"2011-11-02","mins":"1:05 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4623","author":"yannick_clément","post":"Ron you say : “Remember scientists once thought flight was impossible, scientists once thought the sound barrier couldn’t be broken, science once thought nothing moved faster then light~now that is being challenged. Point is; even these hypothesis being put forward, although they seem like fiction to many, are only so because we have not advanced enough.” Turn the thing around and remember that many religion believed (and still believe in some cases) that an earthquake come directly from God, same thing for a big storm or any disaster ! Those people believe that those NATURAL EVENT came directly from God because they were not able yet to explain them in a scientific way !!! Don’t you think it’s a bit like that with the Shroud ??? Why things that we don’t fully understand have to come from a miraculous event ? You said it well my friend, science is not advanced enough to fully explain every single phenomenon in the universe ! And I think science will never be advanced enough to explain everything… That’s maybe why the Shroud body images are not fully understood FOR THE MOMENT. How can you be so sure that it would be the case in 50 years from now ? I repeat : every single natural causes have not been fully analysed yet. More researches need to be done. At least, we agree on that ! And for the unnatural phenomenon like the Corona discharge (in the case of a dead corpse in a 1st century tomb, we can say that it’s a unnatural phenomenon), how can someone will be able to prove that a phenomenon like that is in any case related to the actual body images on the Shroud ? How can someone can prove that a dead corpse can emit that kind of electrical discharge ? It is something that is IMPOSSIBLE to reproduce in laboratory, so, from a scientific point of view, hypothesis like that will never be able to receive a real scientific confirmation… On the contrary, if someone find the correct receipe to create naturally a body image on a linen cloth, that will be something that could be confirmed in laboratory by independent scientists..","date":"2011-11-06","mins":"10:14 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4576","author":"yannick_clément","post":"Before I will start looking for mystical answers (like our friend Fanti and so many others), I prefer to wait until science as come full circle about the natural hypothesis. That’s all I’m saying. Ask any real scientist you want and he will agree with me about this. When you start to think about supernatural phenomenons before having check out every single natural possibility, it’s not science..","date":"2011-11-04","mins":"1:01 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4642","author":"yannick_clément","post":"Ron, I don’t want to start a war of the words with you. All I can answer is to repeat this : And for the unnatural phenomenon like the Corona discharge (in the case of a dead corpse in a 1st century tomb, we can say that it’s a unnatural phenomenon), how can someone will be able to prove that a phenomenon like that is in any case related to the actual body images on the Shroud ? How can someone can prove that a dead corpse can emit that kind of electrical discharge ? It is something that is IMPOSSIBLE to reproduce in laboratory, so, from a scientific point of view, hypothesis like that will never be able to receive a real scientific confirmation… On the contrary, if someone find the correct receipe to create naturally a body image on a linen cloth, that will be something that could be confirmed in laboratory by independent scientists..","date":"2011-11-07","mins":"11:57 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4643","author":"yannick_clément","post":"In other words, how can any scientist from any time in the future will be able to take a dead corpse into a lab and show that it can emit an electric discharge (or any kind of burst of energy) ? This is pure science fiction. And I want to say this : The gospel NEVER refr to the resurrection of Christ with words like burst of energy or something related. To see the resurrection event that way is only due to Hollywood movies ! It’s a trick of our imagination and nobody will NEVER be able to prove that it really happened like that..","date":"2011-11-07","mins":"12:01 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4682","author":"yannick_clément","post":"A witness of the resurrected Christ is not the same than a by product of the resurrection. It’s just our imagination that actually think that this event should have come with some kind of burst of energy of some sort ! That has a lot to do with Hollywood movies. And as I often say : Jesus resurrection was not the same event than Dr. Frankeinstein who reanimated a monster with an electric discharge ! For the chemical properties of the image, I think a guy like Ray Rogers did understand it pretty well. Of course, more researches need to be done to confirm some of his conclusions. That could happen when a new series of direct tests will be permit by the Vatican. And for the conversion thing, your experience confirm what I just thought… The people interested in the Shroud are mainly people who already have faith but who wants to reinforce their faith (and it’s all right). And even many Christian believers doesn’t care one bit about the Shroud ! It’s sad but it is the reality and we must accept it. The purpose of the Shroud is not to convert anybody and the Catholic Church have understand this aspect perfectly and that’s why this relic is not push forward by the Church to convert people… At least, on this aspect I agree totally with the Church !.","date":"2011-11-09","mins":"9:35 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4652","author":"yannick_clément","post":"I should add that there’s a slim possibility that some people may be convert by this relic but I have serious doubts about that. I think, as Maria state, that the Shroud is more something that can strenghten the faith of you and me who already believe in the resurrection. I really think it’s true..","date":"2011-11-07","mins":"3:21 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4651","author":"yannick_clément","post":"All I say is that there’s nothing in the gospel account of the resurrection to backed up a supernatural hypothesis. In Hollywood movies, yes. In the gospels, no. And you’re totally right about the extreme positions… This morning, I wanted to say something about that versus Max comment but I didn’t had time. Here’s what I want to say about this (to make sure anyone knows where I stand) : I’m a catholic who believe in the resurrection of Jesus and that the Shroud is genuine. I also ASSUME that the images on it were created naturally because I see the Shroud as a material archaeological artefact and I want to stay rational about that. I can’t say 100% sure that it was a natural phenomenon just because it is linked to Jesus Christ and we never know. BUT, to be scientifically correct, until science will have disprove EVERY SINGLE NATURAL POSSIBILITIES THAT CAN EXIST TO CREATE A COLORATION ON A LINEN CLOTH (AND THERE’S MANY THEORITICAL POSSIBILITIES BY THE WAY), I WILL NEVER GO IN THE SUPERNATURAL FIELD BECAUSE FOR ME, IT’S A WASTE OF TIME (SCIENTIFICALLY SPEAKING). WHY ? BECAUSE THOSE HYPOTHESIS WILL NEVER BE REPLICATED IN A LABORATORY. CONSEQUENTLY, SCIENCE WILL NEVER BE ABLE TO CONFIRMED THOSE KIND OF IDEAS. That’s my position and I respect yours. I don’t say I know all truth about the Shroud because I can’t even state for sure one natural hypothesis that can fully explain the images. All I say is that it is prudent to let science explore all the natural possibilities before anything else (and there’s room for a lot more experiments and analysis than what have been done until this day). To me, that’s the proper way to do science. I talk about science here, not faith. I believe myself that the Shroud offer a sign of the resurrection of Jesus. If it would be a proof, don’t you think many more people would have been convert by this cloth ? Personally, I don’t know one single person that have been converted by it. Why ? Simple ! To see the sign of the resurrection on the Shroud, you got to have faith first !!!.","date":"2011-11-07","mins":"3:08 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4683","author":"yannick_clément","post":"Ho ! By the way, I want to add something VERY important about the Shroud : Our faith CAN be reassured by the Shroud and his images (blood and body images) even if we don’t believe it shows any proof of the resurrection and even if we don’t believe the body images come from a by product of the resurrection. I’m the perfect example of this ! My faith was really fortified by the Shroud because of the SIGN of the resurrection that I’m able to see on it, not because I think the body image has something to do DIRECTLY with the resurrection… That’s the way I feel about the Shroud. But I understand that other people like Ron feel differently and it’s ok too, as long as you don’t try to make believe that the Shroud offer really a scientific proof of the resurrection, because it’s not true at all. Acting that way would not be honest and that’s why I react so hard against some scientists who push this issue forward with a clear agenda in mind (I don’t need to mention any name here because the list would be pretty long)..","date":"2011-11-09","mins":"11:26 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4553","author":"yannick_clément","post":"No. He wouldn’t have been happy at all because his views on the Shroud are totally in opposition to the views of a scientist like Rogers..","date":"2011-11-04","mins":"8:31 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-4531","author":"yannick_clément","post":"The Shroud C14 dating have been proven really questionned scientifically by Rogers findings and those findings doesn’t imply some unknown supernatural process or force. For the Sudarium, there’s good reason to believe he was in another part of the tomb, not close to the Shroud and the body, so I think we can really discard any possibility for some unknown supernatural force being responsible for a change in the C14 content of this cloth….","date":"2011-11-03","mins":"8:32 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-9806","author":"yannick_clément","post":"Gabriel, I say Amen to what you just said ! Bravo ! I agree completely. And I can add another question to the last question you ask : Why is it that those who claim to be “authentic sindonologist” always seem to publish some new book on the Shroud that belong very often in the “paranormal” section of libraries ? It seem to me that at least 90% of the new books on the Shroud these days always turn around some new (or old) controversy instead of being prudent and clever (as any good scientific book should be) !!! In other words, I can say that I have a deep (and bad) feeling that the vast majority of these authors do not seek the truth but, instead, they seek to be famous and make money !!! Maybe some people could say to me that this is normal in the full media age we’re in, but I don’t agree with this point of view… Personally, all I’m interested in regarding the Shroud is to know the truth. Period..","date":"2012-03-30","mins":"6:39 pm","url":"https://shroudstory.com/2012/03/30/a-20000-shroud-of-turin-challenge-to-richard-dawkins/","cat":"carbon_14_dating","title":"A £20,000 Shroud of Turin Challenge to Richard Dawkins"},{"id":"comment-4536","author":"yannick_clément","post":"Oups, another little mistake from me : I should have written “proven really questionable”… Excuse my poor english !!!.","date":"2011-11-03","mins":"10:48 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-33226","author":"yannick_clément","post":"Here’s an interesting story reported by William Meacham in his book « The Rape of the Turin Shroud that said a lot about Gonella’s responsibility in the fiasco of the C14 dating » : Shortly before the C14 dating of the Shroud in 1988, Meacham wrote a letter to Steve Lukasik of the STURP team (the team was still on the line to do a new series of direct tests on the Shroud AFTER the C14 sampling) and to Luigi Gonella. In this letter, Meacham gave them 2 very important suggestions in order to make sure that the 3 sub samples used for the dating were truly representative of the main body of the Shroud. Here’s the 2 suggestions : 1 That a micro sample (3 to 5%) be removed from each lifted sample before they are dispatched to the C14 labs, and these tiny pieces be either sent to STURP, or held in Turin, for detailed testing by STURP for contaminants. 2 That STURP run a specific set of examinations (for example : micro Raman spectroscopy, an analytical spectrometer, UV fluorescence, etc.) at the points where C14 samples were lifted in order to find if there were any alien organic or inorganic compounds. After reporting these 2 suggestions that would have make all the difference in the world, here’s what Meacham wrote : “There was no response from either Lukasik or Gonella. Looking back and knowing what we know now, it was a huge pity that these two suggestions were not taken up. THE FAULT LIES SQUARELY WITH GONELLA, SINCE, AS HIS POWER CONSOLIDATED, HE RAN (AND SEEMINGLY REVELED IN) A ONE MAN SHOW FOR THE DECISION MAKING ON ALL ASPECTS OF THE CARBON DATING ENTERPRISE SAVE THE LABORATORY’S OWN INTERNAL PROCEDURES. STURP was clearly in disarray, and Gonella probably had to leave them on the sidelines.” Now, unless Meacham is an idiot or a very naive man (which I really don’t think he is), I think the story he told us here show with great evidence the very bad job done by Gonella in 1988 as the scientific adviser for the C14 dating. And in the very next page of his book, Meacham wrote also this, which speaks very loud too : “(the day of the sampling), Gonella and Riggi finally decided to cut a single strip approximately 1 cm wide by 8 cm long, weighing 300 mg, right next to the small cut that had been made in 1963 at the corner of the cloth to provide the textile expert Raes with a sample. THE REASON, AS GONELLA TOLD AL ADLER, WAS THAT “THE SHROUD WAS ALREADY CUT THERE”. Adler called this the worst possible reason.” The simple fact that Gonella told this to Adler prove what I wrote on the blog yesterday concerning the fact that he was much more interested to preserved the visual integrity and “good look” of the Shroud than to learn the true age of that cloth. And coming from the scientific adviser of the Church for the C14 dating, that’s a real shame. Last question to conclude : If Gonella was so innocent than some want us to believe, then why did he stayed on board of that sad project all the way? If he was so competent as a scientist and if the decision to go ahead with a so risky protocol was not is own decision (meaning that he would have been forced by the Church to shut his mouth and keep on defending this project), then is only duty would have been to drop out of that sad project before the sampling was done. The truth is : HE DID NOT!.","date":"2013-05-08","mins":"8:31 am","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33233","author":"yannick_clément","post":"There would probably not have been a fiasco if Gonella would have step up to do his job of scientific supervisor properly. Making sure that Meacham’s suggestions would have been included into the dating protocol would have been a very good start. But he didn’t even gave any response to Meacham’s letter! That speaks very loud… And if Gonella was locked up by the Church (reading Meacham’s book, this hypothesis doesn’t appear to be realistic at all) and wasn’t able to do his job properly, then he should have step out of this bad project well before the day of the sampling. That’s how he should have acted. But instead, he kept silent to Meacham’s critics and very wise suggestions, and in the end, he stayed on board with the very poorly planed protocol he had in hand… In my mind, that’s not a great sign of profesionalism. There are only 2 ways to conclude on Gonella’s case : 1 Gonella was an opportunist and wanted to stay on board of that very publicized project. Or 2 He was totally incompetent to do this kind of supervision job for a C14 dating (remember that Gonella was not even close to have been an expert in C14 dating). If we believe Meacham, the answer #2 is the right one… In my mind, all this fiasco start right there : the Church authorities made a very big mistake by choosing someone like Gonella to do the supervision of an important dating project like that. That’s exactly where the fiasco of 1988 started. So, we can say that Gonella is the one to blame the most but, in reality, that’s not fair. The ones to blame the most are the Church authorities for having given this important task of supervision to someone as incompetent as Gonella in the field of radiocarbon dating..","date":"2013-05-08","mins":"10:44 am","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-4559","author":"yannick_clément","post":"I agree totally with what you said. I don’t like to debate on who’s the best ? Fanti or Rogers or someone else… But the big problem I can see with the Fantis of this World is that they make an automatic link between the Shroud AND the resurrection of Jesus AND a unknown supernatural force involved that can be thought as a by product of the resurrection and that surely had an impact on the Shroud. Thinking that way is not great science in my book. Even if I’m a Catholic who believe in the resurrection of Jesus, I will fight all my life against illuminated views like that ! Like the majority of people, I’m too rational to give any credibility to those kind of views. If the Shroud would be the one of Napoleon or Alexander the Great, nobody would ever think that way. Unfortunatelly, in this crazy world, there’s many people who desperately want to believe ideas like the ones Fanti promote (and he pretty good at promoting those ideas !). As I said the other day, the Shroud of Turin should be consider and analysed no differently than any other archaeological pieces. If we come back on earth 2 seconds and ask ourselves the question : What process or processes could have been involved to produce the blood and body images we see on the Shroud ? Since it was a victim of crucifixion that was inside the cloth, I think the best rational answer would be : some natural processes that are not fully defined yet but that are surely linked to the traumatized state of the dead. That’s the most rational answer. And I think the reason why those processes are not fully defined yet is because the Shroud research that was done after STURP was mainly focused on supernatural hypothesis (like the Corona Discharge of Fanti) and don’t seem to care about natural hypothesis like the Volckringer pattern, the Singlet Oxygen hypothesis developped by Alan Mills, etc. It seem to me that only Rogers did some serious experiments in the last decade about a natural hypothesis (the Maillard reaction). It’s just too bad he died before having the opportunity to make more experiments about that hypothesis and maybe explore some others natural hypothesis… These days, who the hell can be interested in exploring natural hypothesis of image formation about the Shroud ? Unfortunatelly, it’s not as exciting as the supernatural hypothesis..","date":"2011-11-04","mins":"10:46 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-33247","author":"yannick_clément","post":"One thing for sure (and that thing had a huge influence on the final protocol) : The Church and Gonella himself were obsessed by the preservation of the integrity of the relic (it’s look) much more than finding the real age of the cloth. For these people, preserving the relic at all cost was much more important than the scientific knowledge about it and that’s a shame..","date":"2013-05-08","mins":"1:06 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33253","author":"yannick_clément","post":"It would have been easy to take some tiny samples from at least 3 different locations on the cloth without causing any visible damage and this would have given a result that could have had some chances of being accurate. Taking 3 small samples from various location doesn’t mean you destroy the integrity of the relic… But Gonella and the Church leaders seem to have thought that way, which is a total joke. If they were so obsessed by the integrity of the cloth, why giving permission for a C14 dating anyway? With their line of thinking, it would have been much better if they would have choose to do nothing at all instead of the fiasco of 1988..","date":"2013-05-08","mins":"1:43 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33257","author":"yannick_clément","post":"Now, you start to sound just like an Italian Christian ultra religious guy… Or like Gonella himself. If you really think that way, why doing a C14 dating anyway? One single sample will never give you any guarantee of accuracy and you know it. By the way, most of the samples could have been taken under the patches that were there at the time without affecting at all the integrity of the relic..","date":"2013-05-08","mins":"2:16 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33186","author":"yannick_clément","post":"The real mess was the decision to take only a unique sample in a damaged and most probably repaired corner of the cloth (without doing an in deep microscopic and chemical analyses before dating it) and, sincerely, the scientific adviser of Turin at the time, Luigi Gonella, is one person (probably not the only one) to blame for this unscientific decision that was driven by a mad desire to maintain the visual integrity of the relic at the expense of the good scientific method. Read “The Rape of the Turin Shroud” by William Meacham and you’ll see that I’m right about that. In sum, Gonella, in my book, is the one to blame the most and we must also blame the member of the pontifical academy (Chagas) who was in charge of supervising the building of the protocol and also the C14 labs for having say “yes” to this kind of bad protocol. They should have said “no way” if at least 3 different samples could have been used. But, on the other hand, it’s very easy to understand why they all decided to proceed anyway… It’s because they knew they would get a great publicity and fame (and probably also more contract and money) by doing this kind of mediatised dating test. In the end, the preservation of the relic (it’s “look”) was more important than finding the real age of that cloth and that’s a shame because it would have been certainly easy to take some threads in various places while not really affecting the look of the relic. In such a bad context, they should have kept the Shroud in his reliquary in 1988 and do nothing at all. That would have been the most intelligent move to make….","date":"2013-05-07","mins":"3:29 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33259","author":"yannick_clément","post":"Precision… That’s what I meant. Thank you for the correction. Adler talked about that in a presentation he did at a Shroud conference in 1998. With only one sample, you will never be certain if this piece of cloth you take to be dated is representative of the main cloth. Gonella should have known that basic thing and he should have recommanded the Church authorities to not go ahead with the dating if the protocol remained unchanged to date at least 3 samples from 3 different spots. And concerning the material that could have been taken under the patches, since these were not fitting very well with the burn holes, I’m sure it would have been possible to find enough undamaged threads under these patches that were not burned or scorched by the fire of 1532. These kind of unaltered threads would have been the most logical choice for a proper carbon dating..","date":"2013-05-08","mins":"3:08 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33194","author":"yannick_clément","post":"That’s not the opinion of William Meacham and, on the contrary to you Thibault, Meacham was there in Turin. Sorry but I prefer to believe an eye witness like him than your personal opinion on that matter. Meacham was clear about the FACT that between the building of the protocol and the sampling of 1988, Gonella went more and more over his head on the issue of the preserving the integrity and the appearence of the Shroud AT ALL COST at the expense of the good scientific method. As the scientific adviser of the Turin authorities, he was the one who had the most control over the final decision concerning the C14 protocol and the way the sampling would be done and, honestly, he failed miserabily to do a good scientific job during that time. Look, even the additional sampling done by Riggi after the C14 sampling was done SHOULD NEVER HAVE BEEN AUTHORIZED BY GONELLA. This was done behind closed doors and only served the selfish purpose of one man (Riggi and maybe of Gonalle himself too) instead of being properly done under good control conditions and as part of a research protocol built by a team of scientists in the same way STURP did their job in 1978. As the scientific adviser for the Turin authorities, nobody will ever make me believe that Gonella had not the capacity to stop Riggi of doing the selfish sampling he did after the official sampling he made for the C14 labs. The truth is this : he did nothing at that moment. I know in the pro Shroud world (a world full of politically correctness bullsh**), it’s not of a good tone to make hard critics against Gonella (for whatever reason), but concerning the C14 dating and the additional sampling done by Riggi later on the same day, those critics made by Meacham and others are FULLY DESERVED. Gonella was probably a good and honest man, but that doesn’t change a thing about the FACT that he failed to do his job properly in 1988. PERIOD..","date":"2013-05-07","mins":"4:41 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33198","author":"yannick_clément","post":"One last thing for Thibault and anybody who will read this : Imagine that scenario… Some weeks or months before the C14 sampling, if Gonella would have step up in front of the Turin authorities and told them that, after reflection, the protocol he had help to built was too much risky concerning the level of accuracy of the dating result. Question: Do you really believe the Turin authorities and the Vatican would have ignored this kind of alarm signal given by their scientific adviser and would have go on nevertheless in spite of the good sense to do the dating anyway??? Do you seriously believe that this is what would have happened if Gonella would have do his job correctly by telling the truth to the Church authorities about the high risk of failure that was existing for a C14 dating like that, which was design to be done with only one sample taken from a damaged corner??? If you say that this is what would have happened, then I have nothing else to say than : bullsh** my friend..","date":"2013-05-07","mins":"4:54 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33266","author":"yannick_clément","post":"Read Meacham’s book and you’ll find the truth about this whole mess..","date":"2013-05-08","mins":"4:29 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-34779","author":"yannick_clément","post":"I just finish to read Mr. Maloney’s interesting comment and here are, for me and in order, the 3 most probable causes of the light contamination of the Shroud with madder rose that was found in only 2 of the 32 sticky tape samples collected by STURP in 1978 and not found anywhere by Mr. Maloney himself in all the 26 sticky tape samples collected by Max Frei in 1978: 1 The numerous manipulations and the numerous folding and unfolding of the cloth over the centuries. Note: This hypothesis of mine, which I still consider as the most probable explanation for the light contamination found by Mc Crone, came to my mind because of one important scientific fact reported by Al Adler in his book The Orphaned Manuscript in which he indicated that the dried surface of every bloodstains on the Shroud have been abraded a lot over the years, which caused an important scattering of microscopic blood particles all over the cloth, in bloodstained areas as well as in unstained areas on the cloth. And as Adler said, this can only have been caused by the numerous manipulations, folding and unfolding of the cloth over the centuries. Note that these numerous manipulations of the Shroud have to be considered as a solid historical fact. So, if that’s what really happened for the dried surface of the bloodstains, then I think it’s fair to assume that a similar transfer mechanism could have also spread some tiny particles of madder rose in some places of the cloth, even if these contaminated spots are located pretty far from their supposed original place, i.e. The C14 corner, which is probably a repaired area of the cloth where madder rose had been easily found by Rogers and independently confirmed later on by John Brown. 2 A contamination coming from one or many of the 52 True Copies that were laid cloth to cloth and image to image on the original. Note: I didn’t thought about this possibility but, after reading the comment of Mr. Maloney, I came to the conclusion that this type of contamination must be seen as almost as probable as the transfer mechanism I placed in no.1. 3 An accidental contamination coming from a weaver’s workshop. Note: Since there was probably a medieval repair work done by a very skilled weaver in the C14 area with the use of madder rose, it is also fair to presume that a tiny contamination of some small parts of the cloth could have been accidentally caused during this repair work (or during another possible unrecorded repair work – think about the other damaged corner of the Shroud). In the end, no matter what could have caused this light contamination, I think we can forget Mc Crone’s own hypothesis for the simple and good reason that, since the STURP investigation, we know for a fact that the image on the Shroud is NOT a painting or any other form of artwork… Thank you Mr. Maloney for your comment and thanks also for the Mc Crone’s map of STURP samples. Now I know why I was lost with the numbers and letters : it’s simply because Barrie Schwortz used a different system of numbers and letters for his own map of samples! But there is one thing that remain unsolved and that’s this quote from Benford and Marino’s paper that was also presented in Columbus in 2008: “An archaeologist, the late Dr. Eugenia Nitowski, who obtained numerous Shroud fibers from (Raymond) Rogers, conjectured that the red particle contaminates discovered by Kohlbeck were the burial spices Aloes and Myrrh. However, this assumption was based solely on her comparison of the debris with reference photos of the suspected substances and not via chemical analyses. She reported: “The study could go no further (beyond photo comparison), because of the inability to perform testing which would either remove or destroy materials from the tapes.” Along with the lack of any chemical characterization of the debris, the fact that the singular yarn (1 FH) with the impurities came from the ventral missing corner exposed medieval Holland cloth and not the main Shroud, argues strongly against Nitowski’s assumption that the debris was from burial spices. Based on the Quad Mosaic data and Roger’s findings, it is far more plausible that the 1 FH impurities were also red Madder and Gum Arabic as chemically verified by Rogers in multiple adjacent samples.” Question #1 for Joe Marino: Why do you refer to only one sample in which there could have been found some traces of madder rose while Mc Crone and Maloney talked about 2? Question #2: Can you tell me where is located the sample #1 FH? I don’t find it in Mc Crone’s map given by Mr. Maloney… Does it came instead from Barrie’s map? Question #3: Along with the presence of madder rose, you seem to think that there was also some traces of Gum Arabic in this sample 1 FH… Is it a proven fact? I ask this because Mc Crone’s own finding only talks about the presence of rose madder and Mr. Maloney also talks only about rose madder without any reference to the presence of Gum Arabic… This question is somewhat important here because if it’s a proven fact that there was also some traces of Gum Arabic along with the traces of madder rose, then the hypothesis of contamination I placed at #2 in my list would no longer be a viable one I’m affraid and the ones I placed at #1 and #3 in my list would gain even more credibility! So Joe, I hope you will take some time to give me some answers concerning these 3 questions. Thank you in advance!!!.","date":"2013-05-25","mins":"4:57 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34974","author":"yannick_clément","post":"I guess that’s because, as a doctor on the battle fields during WWI, he surely was well aware of the fact that any bloodstains look more red under the sun… And it’s true that when you look at positive pictures from the Shroud (like the ones we can see on Mario Latendresse Shroud Scope website), it is VERY DIFFICULT to distinguish between a bloodstain and a light scorch! This proves that what you said to Mr. Kearse is true: But it IS brown. When you look upon it on the photos, or in the building – it is normal brownish color and not “too red”. As old blood is supposed to be. Very good point!.","date":"2013-05-26","mins":"9:38 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34971","author":"yannick_clément","post":"Your posts jesterof are fabulous because, as you did, I start myself to see more clearly about this issue!!! I think you’re right… And note what I reports concerning Barbet! Even if he did saw the Shroud Under sunlight in Turin in 1933 I think, he still wrote in his book that the bloodstains he saw were surely caused by exudates of humid blood clots and not by whole blood that would have been in a liquid form (a very important fact that was confirmed later on by Baima Bollone and Adler and that Zugibe never seemed to understood). Never in his book did Barbet mention a problem concerning the color of the blood HE DID SAW on the Shroud!.","date":"2013-05-26","mins":"9:32 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34980","author":"yannick_clément","post":"EXACTLY! People like Daveb or Ron will surely tell that I’m biased over Barbet because he is a Frenchman, but I will say it again: This guy is, along with people like Vignon and Rogers, the scientist who, in my mind, understood the Shroud better than anyone else. And what’s the most extraordinary thing about Barbet is the fact that, even if he did saw the cloth live in Turin in 1933, he did all his work from close ups of Enrie’s photos (of course, along with some experiments with real corpse or body parts)!!! The same is true for Vignon. This prove how these guys were clever..","date":"2013-05-26","mins":"9:48 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34977","author":"yannick_clément","post":"The main question that remains unanswered is this: Who started all this “blood is too red” issue? Since Barbet published his book around 1950 and never address that issue, I’m sure this so called “problem” (which is like a Pandora’s box) was published later on, probably before STURP went to Turin. Maybe that’s why some members of STURP had some preconcieved ideas about a potential problem with the color of the blood… That would explain many things. I really would like to know who started this whole issue..","date":"2013-05-26","mins":"9:41 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35012","author":"yannick_clément","post":"Daveb, if you’re honest, you’ll agree with me that you often criticized my French Quebecer root… That’s why I add your name along side of Ron, who is, I admit, the one who often criticized me for considering Barbet as one of the greatest Shroud researcher of all time. Sorry if my comment has offended you….","date":"2013-05-27","mins":"10:11 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35031","author":"yannick_clément","post":"Mr. Kearse, I would like to underline the fact that, in all you said, you forget one possible explanation concerning the fact that the blood on the Shroud appears redder under UV light (under the sunlight for example) and this is what jesterof told us last evening, i.e. That it is truly possible that there is NOTHING UNUSUAL AT ALL WITH THE BLOOD ON THE SHROUD! I based this hypothesis on 2 major points: 1 jesterof told us that, in his mind, there is nothing strange with the fact that the blood on the Shroud, that appears brown normally, become redder under the sun or under another source of UV light. 2 Doctor Pierre Barbet is, to my knowledge, the only Shroud researcher who’s also an expert concerning blood who was able to see the Shroud in sunlight during the 1933 exhibition (he said he saw it at less than 1 meter of distance!) and since he never address the issue of the so called “blood appear to be redder than normal” problem in his book, I have to assume that, in his eyes of experts, there was no problem at all with the color of the blood he saw in sunlight with his own eyes. In the end, if the blood really become redder than normal under the sun (I want to underline the “if” here), maybe this can simply be due to the presence of a level of bilirubin much higher than normal and nothing else. After all, maybe Adler was right after all! I also want to tell people to be very prudent concerning the claims made by people like Fanti and Jackson who, this is evident, wants to use every little thing they can to link the Shroud image with the Resurrection of Christ! Personally, since both of them are not expert in blood at all and both are members of the supernatural fringe, I don’t have any time to waste in listening their “theories” concerning the blood because I know this is only biased thinking based on the “I think I see syndrom”… You do what you want but personally, I prefer by far to listen to experts in blood like Barbet and Adler. Both have seen the Shroud in person in Turin (Adler saw it in 1997) and both have conclude instantaneously that the stains could not have been made of anything else than blood, while never seem to have been bothered by the so called reddish aspect of it. This speaks very loud to me. That’s why I think that if the blood is really redder than normal under the sun, this difference must not be thought as being supernatural in any way… Question to conclude my comment: Don’t you think that if the color of the blood would have been so strange, Adler and Barbet (both experts in blood who saw the Shroud at very close range) would have had some doubts before they conclude that this was surely the real blood of a crucified man? Don’t you think that they would have been much more prudent in their claim? The fact is this: When they saw the Shroud live in Turin, both expert IMMEDIATELY conclude that this could not be anything else than real blood… Again, this simple fact is very telling for me. I really don’t think we should start thinking that the blood on the Shroud is so unusual that it must have been submitted to a burst of UV light! Religiously biased science is truly the worst thing that ever happened to the Shroud of Turin… Note: The critics contained in this comment only concern guys like Fanti and Jackson who have publicly stated that they believed the Shroud image to have been formed during the Resurrection of Christ….","date":"2013-05-27","mins":"12:59 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35038","author":"yannick_clément","post":"My critics were not directed against you at all Mr. Kearse. Read again my final note. It was directed against the so called scientists who are seeking to prove the Resurrection using the Shroud. You just said « I did not become interested in the Shroud to try to prove the Resurrection »… If it’s not a bullsh** statement on your part, then why are you mad at me for giving a friendly advice of being prudent to all the readers out there who will see the supernatural links made by Jackson, Fanti et al. Between the blood on the Shroud and a burst of UV light that you reported in your previous long post? I have nothing against any Christian scientist, as long as this person keep his faith in his back pocket while doing his scientific research….","date":"2013-05-27","mins":"2:25 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35032","author":"yannick_clément","post":"Important precision concerning my previous comment : Barbet is not only the only blood expert to have seen the Shroud in sunlight during the 1933 exhibition, but to my knowledge, he’s the only blood expert to have seen it that way (and at very close range) in all the history of Shroud science… I think this is truly an important fact concerning the question of the color of the blood..","date":"2013-05-27","mins":"1:20 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34797","author":"yannick_clément","post":"Joe, here’s my previous questions (just in case you missed it): These are questions concerning the possible presence of Gum Arabic along with the possible madder rose in the sample analyzed by Nitowski: Where is this sample now? Who owns it? Would it be possible to do some more chemical analyses of this particular sample? I ask this because a confirmation of the presence of madder rose and Gum Arabic in an area of the cloth located so close to the C14 corner would truly represent a great piece of evidence to back up your own hypothesis! I’m sure you can answered these questions….","date":"2013-05-25","mins":"7:18 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35047","author":"yannick_clément","post":"I know the motivation of guys like Fanti and Jackson because they publicly state them! They wrote so many papers which tried to sell the idea that the image come from a burst of something at the time of the Resurrection than it would take someone naive as hell to not understanding what kind of motivation these guys have… Please read this comment of mine and I dare you to say you disagree with me: https://shroudstory.com/2013/05/25/an important and highly informative guest posting by paul maloney/#comment 35046 AM I THE ONLY ONE AROUND HERE WHO KNOW HOW A SCIENTIST SHOULD ACT??? Come on! On this subject, I highly recommand everyone to read the first portion of Rogers book….","date":"2013-05-27","mins":"5:05 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35045","author":"yannick_clément","post":"Calm down Mr. Kearse. I’m not mad at you either. I just found it strange that everytime I criticize those who are using their “science” to prove the Resurrection (in the cases of Jackson and Fanti, THIS IS AS EVIDENT AS THE NOSE IN ANYONE’S FACE), you seem to jump to the ceiling like the critic was directed against you personally, while it’s not. Read again the note I carefully wrote at the end of my previous comment and you’ll understand that I never criticize you in this post. I just want people to be aware that some people, who are no expert in blood, are trying to convinced other people that the Resurrection must have been the cause of the so call reddish aspect of it, while, as jesterof said last evening, it is probably normal that this kind of traumatic blood (and possibly any other ancient blood) become much more red under sunlight (or another UV light source)! Don’t you see what kind of bullsh** game these supernatural fanatics are playing? Why is it a crime to criticize those who pretend to do science while their motivation is evidently elsewhere than finding the real truth concerning the Shroud, whatever this truth might be? When a scientist make public claims that the Resurrection of Christ has been the cause of the image and possibly also the cause of the reddish aspect of the blood (which is, in fact, wrong outside a UV lighting), while he knows that science is far from having been able to discard every possible natural explanations, I ask you the question: At that moment, what happen to the independence of mind that, as a scientist, he MUST HAVE TO DO GOOD SCIENCE??? How can a religiously driven science be a good science anymore? If my critics directed against these kind of so called scientists have offended you, I’m truly sorry… But I hope you will understand now that my principal motivation is to defend the integrity of Shroud science in front of a bunch of religious freaks. One last question: Beside some Christian faithful and maybe some supernatural lovers, who the hell will buy their pseudo scientific crap, especially when it come to find a proper explanation for the image?.","date":"2013-05-27","mins":"4:55 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35040","author":"yannick_clément","post":"Thanks again to Joe and Paul for this answer. Again, I will print that out and read it more carefully later on….","date":"2013-05-27","mins":"3:38 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35108","author":"yannick_clément","post":"Kelly go to sleep! ; ).","date":"2013-05-28","mins":"8:24 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35046","author":"yannick_clément","post":"One last and important comment: Until science can completely discard every single natural explanations concerning the image and the reddish aspect of the blood under UV light (remember folks that it is far from being the case, even if STURP came out empty of a complete explanation), I’m sorry but it is completely anti scientific to try to find a supernatural explanation for these things. Deep down in my heart, I know that this is not how it is suppose to be. Deep down in my heart, I know that this is not how any scientist who is independent of mind on the subject would act. And deep down in my heart, I know that Rogers agree with me presently while sitting on his cloud….","date":"2013-05-27","mins":"5:02 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35110","author":"yannick_clément","post":"Here’s a message for Paul Maloney : First of all, I want to thank you for all the interesting information you provided me in the last couple of days. You little story concerning Ray Rogers’ samples and the way he reacted with you when he learned that Kohlbeck had given them away was nearly hillarious! But at the same time, this story show how professional Rogers was as a scientist. And it shows another sad reality: the way the Shroud samples were handled over the years has not been great, scientifically speaking. The chain of custody was often broken. Many samples were damaged and some others really seem to have been completely lost. All this mess could have been prevent if the Church authorities would have taken legal actions BEFORE the sampling was done by STURP and also by Riggi and Frei in 1978. They should have made sure that every single sample taken from the Shroud would belong ONLY FOR A DETERMINED TIME to the person or the team who take them in order for them or for him to perform their testing and if the team or the person would have wanted to give them to another specialist during that period of time, this team or this person should have been legaly forced to inform the authorities every time. Then, after the time that would have been determined, the samples should have been given back to the authorities, so that they could have stored them properly for future analyses or another time frame could have been legaly determined with the team or the person who took the samples, if this team or this person would have needed more time to do more tests and analyses on them. That way, no chain of custody would have been broken and no sample would have been lost. I hope that if there is another round of direct testing on the Shroud in the future, that will be the way the Church authorities will act versus the samples that will be taken. Now, concerning my question regarding the sample 3 CB and if it is a proven fact that it was taken from a bloodstained area, I can see by your answer that it is far from being the case! So last evening, I check out Barrie Schwortz paper entitled “Mapping of Research Test Point Areas on the Shroud of Turin” (published in 1982) and note that at the corresponding spot, the sample number was 12 (Original Test Plan ID #3 B) and the description of the data point was “Serum/Blood”! So, my question to Paul is: Does it prove that this particular sample was really taken from a bloodstained area or was it just a simple assumption of the STURP team before they went to Turin, while they were planning their sampling procedure? I guess Barrie Schwortz could help us here… I also note that there seemed to be a slight variation of location between Barrie’s location point on his own map and Mc Crone’s location. Barrie’s point seems to be further away a little bit from the body image. One thing’s for sure: If it would be proven that there really were some bloodstains in this particular area (and not just some microscopic particles of blood that could have been scattered there), that would mean that this is another area of the cloth where there are bloodstains that are located outside the body image and I really think this would be important to prove such a thing, because it could potentially give us some precious information concerning the exact configuration (or, more probably, configurations) of the cloth around the body before and after it was finally placed in his final resting place (which was probably a stone tablet carved inside a stone wall of the tomb). I’ll wait for Paul’s reply… Thanks!.","date":"2013-05-28","mins":"8:26 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35109","author":"yannick_clément","post":"This comment is a reply to jesterof comment #114: After reading with attention the part of Goldoni’s paper in which he reprint an extract of the final report of the Pellegrino commission which performed investigations on the Shroud from 1969 to 1976, I think we can assume that the “blood is too red” issue come from a bad understanding of a comment made by Antoine Legrand who was allowed by this commission to do an visual indoor examination of the Shroud… The reports stated that it was at this occasion that Legrand made the observation that the color of the blood was not as bright as the color he saw during the 1931 exhibition of the Shroud, when the relic was exposed in open air and by the light of the sun. I really think that it is at this occasion that someone misunderstood Legrand’s observation and, as you say, changed the “it is very bright upon sun light exposure” to simply (and wrongly) “it’s too bright”… And since the Pellegrino commission ended his research work in 1976, just about the time the STURP team was formed, it is fair to assume that some members of the team heard about this wrong statement that the blood of the Shroud seemed to be too bright (or too red) and take it for granted. That could easily lead us to think that, most probably, these team members had a preconceived idea versus the color of the blood when they went to Turin to examine the cloth in 1978. And because of the important media attention concerning the work of the STURP team, this “blood is too red” issue (which is in fact a misunderstood issue that originated from a clever observation of Antoine Legrand during the 1970s) got more and more attention, so much in fact that it went on to stay alive until this day… I really think this guess of mine of what have started the “blood is too red” (or too bright) issue has some good chances to be very close to the truth. Jesterof, what do you think? If I’m right about that, then it is very unfortunate that Legrand never went on publicly to set the record straight versus this issue concerning the blood on the Shroud, which gives the impression that there is a real problem with the color, while it is very probable that there is none, considering the fact that it is a blood that was shed by a highly traumatized man….","date":"2013-05-28","mins":"8:25 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35134","author":"yannick_clément","post":"As I said, if this is correct, it’s very sad that Legrand never set the record straight about that… And here’s another question for you: In a previous comment (which gave me great lights about the whole issue), you mentioned this: “It (the blood on the Shroud) changes color (brightens) only upon exposition to bright sunlight or UV light – which explains immediately why bilirubin was brought up at all – it is bilirubin which brightens it up, because it reacts with UV light.” Taking that into account, here’s my personal opinion on the whole “blood is too red” issue: In the end, the reddish aspect considered too bright of the blood of the Shroud when it is exposed to sunlight (or another UV source) could be due to a level of bilirubin in the blood much higher than normal, just like it was described in Adler’s hypothesis. So, the question is: Do you think pretty much the same as me? Or did I miss something from all the numerous comments you wrote in the last days?.","date":"2013-05-28","mins":"4:38 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35111","author":"yannick_clément","post":"Here, I would like, once and for all, explain my point of view versus those who think the Shroud image is directly related to the Resurrection of Christ : I don’t care if any Christian or supernatural lover out there believe this! I don’t care at all, EXCEPT if this person presents himself as a real scientist and make belief publicly that there is good pieces of evidence on the cloth to support such a BELIEF. That’s when I say: ONE MINUTE!!! STOP PLEASE!!! THIS ISN’T SCIENCE NO MORE!!! WE JUST WENT OFF TRACK!!! In other words, belief is ok. Trying to use science to back up such a belief is not science anymore. It is called “religiously driven pseudo science” in my mind. And everytime I will see such acting on the part of someone presenting himself as a real scientist, you can be sure that I will raise the red flag of scientific integrity! In fact, the only honest thing a scientist could say about the image on the Shroud is this: FOR THE MOMENT (these words are very important), this image remains unexplainable, but that doesn’t mean a supernatural event is the cause of it. That simply means that science is still searching a natural explanation that can account for its chemical and physical characteristics. This research can well lead to a proper finding in the future. I think any scientist, believer or not, should agree with this kind of statement. Unfortunately, in the Shroud world, many scientists doesn’t seem to think like this… And that’s what really bugs me! That’s all I have to say about it and I hope people will finally understand my motivation for the numerous critics I’ve expressed over the years on this blog. Now, can let’s talk about science… real science!.","date":"2013-05-28","mins":"8:27 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34800","author":"yannick_clément","post":"Thanks Joe! Last question for you: Can you confirm to me that both Mc Crone and Nitowski have only analyzed samples that were taken by STURP and not by Max Frei or Riggi? By the way, if you forward my previous question to Mr. Maloney, it would be a very good thing to give him also the comment I wrote just for him. Would be nice if you could give him the link of this comment of mine, which is : https://shroudstory.com/2013/05/25/an important and highly informative guest posting by paul maloney/#comment 34781 Thank you for doing this. I just want to be sure Mr. Maloney will read this..","date":"2013-05-25","mins":"7:28 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35201","author":"yannick_clément","post":"Thanks for this short and precise answer….","date":"2013-05-29","mins":"8:25 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35230","author":"yannick_clément","post":"Here’s a question for jesterof, following his comment #159: Do you think that the probable fact that “bilirubin is still there” in the bloodstains can be simply due to the very traumatic state in general and of the blood in particular of the Shroud man? In other words, beside things like a presence of residues of saponaria that could have acted on the bloodstains (this is a possibility, I agree with you), don’t you think that the most simple, probable and rational explanation for the probable fact that “bilirubin is still there” remains the very probable and unusual presence of some high level of substances in the blood related to the traumatic state of the Shroud man at the time of death? Of course, we can first think about the probable high level of bilirubin that could have had an impact on the fact that “bilirubin is still there”, but we can also think of other possible high level of substances like urea, lactic acid, etc… What is your opinion about that? Maybe the answer simply lies in the fact that the bloodstains were made of highly traumatic exudates of blood clots?.","date":"2013-05-29","mins":"10:52 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35273","author":"yannick_clément","post":"Because I’m pretty sure Adler was aware of that issue of the instability of bilirubin versus the long preservation it should have endure until today, I really wonder what was his own hypothesis about that. I don’t think he ever addressed that particular issue publicly in his writings or during a presentation, but I might be wrong. Would be nice to know what was his idea about that… But I have to repeat my previous question to you jesterof: Don’t you think that some other substances that could have been present in the traumatic blood of the Shroud man at the time of his death could have played a role (maybe crucial) in helping the bilirubin to get preserved in the bloodstains until today? Is it possible that a high level of urea, of lactic acid or of some other substances like that (substances probably present in the blood in the context of a tortured body) could have been the main cause of the preservation of bilirubin until today?.","date":"2013-05-29","mins":"2:03 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35274","author":"yannick_clément","post":"Oh by the way, I wonder if the fact that the bloodstains were made of exudates of blood clots instead of whole blood could not also be another possible explanation for the probable good preservation of the bilirubin in these bloodstains. What do you think jesterof? Is it possible that the very particular nature of these stains could have helped for the preservation of the bilirubin until today?.","date":"2013-05-29","mins":"2:08 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35283","author":"yannick_clément","post":"One last reply to jesterof: In the end, is it also possible that, even though bilirubin is pretty unstable, that it could be preserved NATURALLY (without the help of anything special) in certain circumstances, especially if the bloodstained cloth has always been carefully preserved over the centuries? Here, I think particularly about the very probable fact that the Shroud had been very rarely exposed to open air and, more importantly, to sunlight… In such a context of a cloth well preserved and almost always kept in the dark and in a container of some kind, don’t you think that this could have been enough good conditions to have naturally preserved the high level of bilirubin inside the bloodstains for all these years? Good question, don’t you think?.","date":"2013-05-29","mins":"3:46 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35257","author":"yannick_clément","post":"Mr. Kearse wrote this in his comment #162 : “Yannick, what exactly is the best empirical evidence that the Shroud was once treated with saponin weak background fluorescence? I know historically there is evidence of the processing methods of linen, but am referring in relation to the STURP findings (Rogers). Saponin glycosides were assayed for, but not detected, correct? Anything else? I believe Heller & Adler developed a test with sulfuric acid but this was negative saponin products may no longer remain, etc.” My answer: You’re right, neither Rogers or Heller and Adler were able to detect any traces of saponaria on the STURP samples, even though they did various analyses to detect it. Maybe this is due to the fact that saponaria traces has been “washed away” over the centuries. Maybe also this is due to the fact that saponaria never was used to washed the final cloth and another kind of natural detergent was used. It think it’s a proven historical fact that some ancient linen cloths were washed with other products than saponaria, but I must say that I never did any researches about that. Some months ago, Dan posted something interesting about Pliny the Elder writings. Supposedly, he never mentioned saponaria as the main product used to wash the cloths during Antiquity, but another kind of natural detergent made with olive oil. Nevertheless, Rogers main source of information concerning the possible use of saponaria didn’t come from an ancient book written by Pliny the Elder but from Anna Maria Donadoni, who was a conservator at the Turin’s Museum of Egyptology and a true expert in ancient fabrics. She told Rogers that washing the final linen cloths with saponaria was common during Antiquity… In fact, this particular product was often used because it was able to make the cloth more supple. So, in the end, who knows? I think the incapacity of STURP to detect traces of saponaria is probably due to one of the two possibilities I just mentioned… And I don’t think that if the cloth was washed with another sort of detergent, this could make a noticeable difference concerning the image formation hypothesis of Rogers because there are still many other possible sources of carbohydrate impurities that could have been left on the cloth after his final washing… And concerning your question “what exactly is the best empirical evidence that the Shroud was once treated with saponin?”, I can only talk for Rogers (and not for other STURP members). Here’s the most relevant quote from Rogers book that can give you a proper answer: “Saponaria hydrolyzes to produce some aglycones that are fluorescent in the blue white region, and the non image part of the Shroud is weakly fluorescent with a maximum at about the correct wavelength, 435 nanometers. The fluorescence support the idea that the cloth had been washed in struthium (note: I think this is another name for saponaria).” Rogers also wrote that saponaria is toxic and it is potent preservative, which can explain the very good state of the linen, even today. Finally, there is the finding of Rogers concerning the fact that saponaria is hemolytic, which could have played a role in the color of the bloodstains today. For Rogers, there’s no doubt that this finding was another interesting clue to think that saponaria had really been used to wash the final cloth. But all those clues are just what we can call “circumstancial evidences” and nothing more… No doubt that more testing should be done on this question with more modern instrument and analytical methods. While we all wait for this to happen, I think it would be great if some true expert in ancient textile could be found in order to see what they think of the possible use of saponaria in the context of an ancient burial linen cloth like the Shroud, possibly made during Antiquity. I also think it would be nice if some experiments could be done on linen samples prepared with all the possible known method of manufacture that were used during Antiquity and see what kind of fluorescence can be produce (in order to see what could be the best match with the fluorescence of the Shroud and also in order to see what kind of carbohydrate impurities could be produced and where these impurities could be found on the cloth – only on the surface or deep inside the cloth)..","date":"2013-05-29","mins":"1:03 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35336","author":"yannick_clément","post":"Thanks a lot for these replies jesterof! I will print them out and read them more carefully later today..","date":"2013-05-30","mins":"8:26 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35362","author":"yannick_clément","post":"Message for jesterof : After reading the answers you gave me concerning the 3 hypotheses I wrote down yesterday that could maybe explain the preservation of the bilirubin inside the bloodstains until this day, I first want to say that I agree 100% with you about the fact that, since there are plenty of possible natural explanations for this, there is absolutely no reason to imagine some supernatural cause, unless of course someone belong to the supernatural findge of the Shroud world and desperately wants to back up his ideology! Also, I want to say that while I read your answers, I realized that my three hypotheses (or a combination of two or three of them) have all some chances to be relevant in the case of the bloodstains that are present on the Shroud. And since history of science has clearly showed that the simplest explanations are very often the correct ones, I think the solution for the preservation of the bilirubin for so long can well be found there. Of course, a lot of proper testing under laboratory conditions should be done to verify my three hypotheses… For the moment, my guess is that the very particular nature of the blood transfer that occurred on the Shroud (exudates of humid blood clots), along with the historical fact that the cloth has been well preserved almost all the time inside some types of containers, away from open air, sunlight and any other source of UV light, can well represent “enough” factors that have lead to the preservation of the bilirubin inside all the bloodstains of the Shroud (or at the very least, most of them). Along with these two factors that we’re sure had some impact on the nature of the bloodstains, the possibility that there could have been some other substances in these stains that were related to the traumatic state of the Shroud man (like urea, lactic acid, etc.) has to be considered very seriously… I really think that this other factor could also have had some impact on the particular nature of the bloodstains on the Shroud. So, why not thinking that it could also had some impact on the preservation of the bilirubin inside these stains until this day? Of course, what would really help to give credits to this hypothesis would be to confirm the presence of such substances in the bloodstains. For the moment, I really don’t think any researcher have been able to confirm such a thing, not even Adler, but I really don’t think that he thought of performing some analyses to verify the presence of substances like urea or lactic acid in the blood samples that he had… One thing’s for sure: I never read anything about that in his writings, and nothing more in Baima Bollone’s own writings. If a new series of direct test should be allowed in the future, I hope this lack of testing for such substances (for bloodstained samples as well as body image samples) will be corrected!.","date":"2013-05-30","mins":"1:00 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35471","author":"yannick_clément","post":"Quote from jesterof : “Personally, I would like to find out WHY the blood stains on the saponaria treated cloth in the experiment stained in a bright red color and that stayed that way for 27 years. This question is not answered and one can not explain it just by bilirubin amount, because there is no time for the blood in the sample to metabolize the hemolyzed hemoglobin to it’s metabolites. But it does stay red, becasue of hemolysis – so is it enough? I mean do the broken erythrocyte membranes serve as a preservation material against oxidation?” Here’s the opinion of Rogers on this topic (we can find it in his book about the Shroud): “Incidentally, we found that Saponaria Officinalis are hemolytic; they break the membranes of red blood cells and release the red hemoglobin. Hemolysis is used to determine the hemoglobin content of blood. WHOLE BLOOD darken as it ages on cloth; however, the blood spots on the Shroud are still QUITE RED after centuries of known history. Diane Soran of Los Alamos tested hemolysis on Saponaria washed cloth before we went to Turin. The blood is still red on those 25 years old samples although the blood on the non Saponaria washed control samples is black. This fact might help confirm that ancient technology was used to produce the cloth.” I hope this can help you jesterof… Note that Rogers committed one important mistake in his lab experiment: he used whole blood to reproduce the bloodstains on the Shroud while, since Adler’s analysis, we know that those stains were produced by exudates of blood clots and not by whole blood. But I think we can forgive Rogers since he was not an expert on blood and also, he did his experiments BEFORE the analyses of Adler… Also, I want to point out the term used by Rogers, who saw the Shroud live in Turin, to describe the color of the blood : “quite red”… I think this goes very well with the observation made by Antoine Legrand in the 1970s concerning the fact that the bloodstains on the Shroud were not as red and bright when they are seen in a room with no sunlight than when they are seen under the light of the sun, as he was able to see them in 1931… Obviously, the term “quite red” must not been understand as “bright red”. Of course, we can think that, even inside a room, these stains are still redder than normal, but the difference versus other ancient bloodstains is surely not as great as some as said over the years and it can well be due to a high level of bilirubin inside these stains, like it was described by Adler..","date":"2013-05-31","mins":"1:03 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35514","author":"yannick_clément","post":"We both agree..","date":"2013-05-31","mins":"4:32 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35762","author":"yannick_clément","post":"Here’s a long reply to the last post written by Paul Maloney: https://shroudstory.com/2013/05/25/an important and highly informative guest posting by paul maloney/#comment 35418 Paul, even if Barbet is not here no more to answer our questions, the fact is that he left us a very complete book about the Shroud in which he addressed all the possible issues that were important for him. Like we cleverly say in French (personal translation): Talks are flying away but writings stay! In truth, the only things we can find about the color of the blood in his book are two short mentions of its particular color and only one of these use the term “special coloration” (remember that Barbet saw it in sunlight) without any attempt to explain it and any mention that this was seen as a real problem for him (or that it was a problem for other Shroud researchers like Vignon or Legrand) regarding the question of its authenticity. Note that since I never read anything that was written by Vignon and Legrand, I’m still curious to learn if they talk specifically about the color of the blood somewhere and if they did, I wonder if they ever mention it as being a “problem” regarding its authenticity, but since Barbet don’t talk about a problem regarding the color of the blood while quoting these two researchers on the subject, I seriously doubt that they were considering it as a real problem… Maybe Paul, you can tell me more about the writings of Vignon and Legrand on the subject. Anyway, as I said the other day, the simple fact that Barbet IMMEDIATELY recognized that the bloodstains could not be anything else than bloodstains made with real blood exudates from blood clots is enough for me (as it should also be for you) to understand that the color of the blood was nothing close to be a problem in his mind of expert. Or else, it’s evident that he would have had some doubts before shooting out loud: look, this is true blood! That’s not at all the reaction he would have had if the color would had been problematic regarding the question of the authenticity of the blood. The fact is this: Barbet was SURE AND CERTAIN that the blood was real blood and he was also SURE AND CERTAIN that these stains were formed by exudates of humid blood clots and not from fresh blood that would have been in liquid form. Note that Adler too had the same exact reaction when he first saw the Shroud in person in Turin in 1997! The very telling reactions that Barbet and Adler had in front of the Shroud versus the question of the authenticity of the blood, no matter is color (which is truly a secondary question that was not even addressed by Barbet publicly), is well enough to understand that theses stains on the Shroud are nothing else than real human blood that have stained the cloth versus a very particular process that was described first by Barbet (exudates of moistened or re moistened blood clots) and then, later on, was scientifically approved and confirmed by Adler (and also Baima Bollone). That’s what really matters in the end, and that was the main goal of the long comment of mine that was posted by Dan on his blog the other day… Question for you Paul: WHAT ELSE DO YOU NEED TO BE CONVINCED THAT THE BLOOD IS REAL HUMAN BLOOD AND THAT ITS COLOR DOESN’T REPRESENT A PROBLEM REGARDING ITS AUTHENTICITY? Personally, what I’m convinced is this: The bloodstains on the Shroud are real exudates of human blood clots that possessed a highly traumatic nature. And if the color of the blood would have been as “problematic” and “unusual” as some people in the Shroud world would wanted us to believe (we both know that many “shroudies” wants to use this “particular color” to make another direct link with the Resurrection), both Adler and Barbet would never have reacted the way they did when they first saw the bloodstains on the cloth! You can say anything you want, you will never convinced me of something else… Their reactions (very much the same) were too much telling to mean anything else than there was no real problem for them concerning the color of the blood versus the question of its authenticity! This is evident to me. And if it is so, this can only mean one thing: Both experts had already an explanation for it! The only difference that remains is that we know Adler’s explanation while we don’t know the one of Barbet. But in the end, it’s nothing important because it’s evident that if he didn’t had a natural and rational explanation for the color, Barbet would have been much more prudent in his claims that the blood was made of real human blood. And I don’t believe that thinking that way makes me distort the historical truth. Remember that a lot of person at the time believed the Shroud and these stains to have been created by a medieval painter! In that context, if Barbet would had been puzzled by the particular color of the blood, don’t you think like me that he would have had some hesitation before crying out loud publicly: this is blood! ? Don’t you think like me that if Barbet would had been puzzled by the particular color of the blood, the painting theory would have come back into his mind, with the result that he would have had some serious doubts about its authenticity? I REALLY THINK SO MY FRIEND! Again, this is pure logical thinking versus the known historical facts. I really don’t think this can be seen as a distortion of the historical reality or a free extrapolation from me. And concerning Mc Crone’s claims, everyone must recognize that he was no expert in blood and, truly, the anecdote you gave us concerning Anderson’s conclusion and the way he reacted to it is enough to understand that he was doing a biased kind of science against the authenticity of the Shroud… His conclusion versus the blood has absolutely no value in my mind, especially in the light of the conclusions of true experts like Baima Bollone and Adler… Now, to get back on the question of the color, I think jesterof (a physician) have brought us the proper way to look at it. Here’s to me the most important comment he made about that “issue”: “The blood IS brown. When you look upon it on the photos, or in the building – it is normal brownish color and not “too red”. As old blood is supposed to be. It changes color (brightens) only upon exposition to bright sunlight or UV light – which explains immediately why bilirubin was brought up at all – it is bilirubin which brightens it up, because it reacts with UV light. Thanks to Louis’s link (Goldoni – The Shroud of Turin and the bilirubin blood stains) I finally have had the answer to my question and I was right ( in terms that I do not see those stains “too red” at all, because they are not on the presented photos of the Shroud).” I agree completely with him about that. In fact, when you look at any available picture of the Shroud out there, it’s easy to note that most of the bloodstains shows a color that is not very different from a light scorch. So much in fact that when you look closely at scorched areas where there are also some bloodstains, it is VERY HARD to know what if it’s a scorch or a bloodstain… This is a fact that show quite clearly that the “too red” problem have not be well described generally in the Shroud world. As mentioned by jesterof, it really seem to be “too red” only when it is seen in sunlight or under another source of UV light. And as he told us very wisely, there are tons of potential natural explanations for this. Much more researches are needed to know the truth and, until some true expert can make a very large analysis of the “problem”, there’s absolutely no reason to think this can represent a real problem versus the known laws of nature… And concerning the question of the bad way the Shroud samples were handled after STURP investigation, I admit that you have a very good point regarding the fact that, during those years, the Vatican wasn’t the true owner of the cloth. But having said that, you must recognize that things were still as bad as they were back then when the sampling job of Riggi (assisted by Gonella) was done in 1988, at a time when the Pope did owned the cloth! Also, I think the Church authorities, as the official custodian of the Shroud in 1978, could have, at the very least, made the same suggestion as mine (i.e. Taking legal procedures to follow the trace of every sample and make sure all of them could eventually return to Turin) to King Umberto! So, I believe my critic is still relevant. And I hope the next time the Church authorities will allowed a new series of testing on the Shroud, they will take legal actions to prevent such a mess in the future. In my mind, since the Pope is the true owner of the Shroud, he should be recognized also as the true legal owner of any samples taken from it. It’s not proper procedure to take a sample from the Shroud in catimini, away from any public eyes like Riggi and Gonella have done in 1988 and it’s no more proper procedure to give away samples from the Shroud to anyone as if they were Holy Relics, with the high risk of damaging them or even worse, of loosing their traces forever (like it seem to be the case for the samples owned for a time by Nitowski)! I sure hope things will be much different in the future when the Pope will allowed new direct testing on the cloth… Finally, concerning Rogers and his experiments with Saponaria versus the color of the blood, I think we should be VERY PRUDENT versus the results he got for the simple and good reason that he used WHOLE BLOOD to stain his samples, while we know, thanks to Barbet and Adler, that the stains where not made like this but, on the contrary, were made out of exudates of moistened or re moistened blood clots, which caused the formation of very precise mirror images of the wounds and blood flows on the Shroud. So, right off the bat, Rogers experimental set up contained one major experimental flaws and because of that, we must be very careful with the interpretation of the results and I think this kind of experiment should be redone by a blood expert who would use exudates of blood clots to stain his linen samples instead of whole blood in a liquid form… I hope those who believe I always buy anything that comes from Rogers will take good note of this comment of mine! Anyway, even if we disagree on some “issues”, I thank you again Paul for your answers and for the time you took to write them down. Final note #1: I was really surprise to note that you never addressed the main point I brought in concerning the slight difference in the sample map of Barrie Schwortz versus the one of Mc Crone and the question I had concerning the fact that the test plan of STURP was considering the sample 3 CB of Mc Crone has a blood/serum sample… I wonder why you didn’t said a word about this interesting “issue”? Final note #2: Concerning the other comment you wrote which was posted by Joe Marino the other day about the work you do for a pictorial atlas of the various particles and fibers you have found in the Max Frei sticky tapes, I understand perfectly that you’re no expert in spectroscopy or chemistry. That’s precisely why I asked you to find a true expert in one of these fields in order to get a professional verification of your own conclusions. With all your profesionnal experience, I can’t believe you don’t know anyone in these fields that could be interested to make at least a visual survey of your work (without any direct analysis of Frei’s samples). This would be a very good start in my mind before you could publish your work. Of course, doing direct tests to scientifically verified your own conclusions would be much better but, as you say, this is not evident at all since this would need time, money and the proper equipments. That’s why I think you should at least find an independent expert that could make the same kind of visual detection you did in order to get another profesionnal point of view to support and/or correct your own conclusions. In my mind, it’s only after this professional check up work could be achieve that you could publish your work without too much fear of being crushed to the ground by the critics. And here’s one other advice I have for you to avoid too much critics: You should publish your pictorial atlas with the clear mention “PRELIMINARY CONCLUSIONS”. This would be honest from you and this would also encourage others to eventually take the lead of your work in order to push it further… I hope you will take good note of these friendly advices (if you didn’t already had them in mind)..","date":"2013-06-02","mins":"5:00 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35494","author":"yannick_clément","post":"I guess this would need more testing right?.","date":"2013-05-31","mins":"2:42 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34781","author":"yannick_clément","post":"Here’s another message for Mr. Maloney: I think the work you do concerning the pictorial atlas of the many kinds of particles and fibers and other trace “contaminants” that can be found on the 26 Max Frei sticky tapes could well be very important in order to improve our understanding of the Shroud, but I am very suspicious about one important missing aspect of your work, which is the lack of spectrometry or chemical testing to ascertain the physical identity of the individual particles or fibers. By not doing this, I really think you open a wide door for critics coming from outside as much as from Inside the pro Shroud world. That’s why I would like to give you this suggestion: Before the official publication of your interesting work, why don’t you find one specialist in the field of spectrometry and/or chemical analyses, so that he could do some independent analyses of your conclusions? Of course, such a counter analysis would represent a huge task but I definitely think this is the only credible path to follow if you want to avoid critics as much as possible and if you really want your work to be very significant for Shroud research. You say that you used the very same techniques as Walter Mc Crone and Eugenia Nitowski… Have you noticed how much their works have been criticized over the years and how much doubts have been shed on their conclusions? I would be very sad to see the same thing happening to your own work because I’m truly convinced that you’re one of the few scientists involved in Shroud research nowdays that is able to keep is faith in his back pocket while doing his scientific work on the Shroud. That’s why I hope you’ll consider seriously my friendly advice to you..","date":"2013-05-25","mins":"5:33 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34910","author":"yannick_clément","post":"Thanks Joe and Paul! This is very sad to see how bad the monitoring of the samples taken from the Shroud has been done!!!! In my opinion, this is due in good part to the very bad decision of Turin in 1978 and 1988 to have not taken a legal procedure in order to be certain to always follow the trace of the samples that were taken from the Shroud. I’m sure this could have been done properly and legally doen and we would not be in this crappy situation today… Even the taking of some samples (like the ones taken by Riggi and Gonella in 1988 after the C14 sampling) is very questionable and should definately have been done much more properly and not in secret. This kind of additional sampling was not even part of the original protocol of research and, if an agreement could have been obtained from the Church authorities anyway, this should have been done on record and publicly, at the very least… The whole situation of the samples taken from the Shroud is one of the worst crap I’ve ever seen in science..","date":"2013-05-26","mins":"6:00 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34906","author":"yannick_clément","post":"Louis said : “As for the colour of what is said to be blood stains, the Australian Dr.Loy is reported to have affirmed that the blood of people who die after a trauma is very red.” My comment : Very interesting information Louis! This tend to confirm Al Adler’s hypothesis concerning the reddish aspect of the blood on the Shroud that would be due to a higher than normal level of bilirubin in the blood that would have been caused by the long and intense tortures suffered by the Shroud man. Personally, I still believe that Adler’s hypothesis is most rational and probable to explain the reddish aspect of the blood on the Shroud!.","date":"2013-05-26","mins":"5:20 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34916","author":"yannick_clément","post":"Thanks again to Joe and Paul. This is another comment I have printed on paper and that I will read more carefully later on tonight..","date":"2013-05-26","mins":"6:19 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34782","author":"yannick_clément","post":"I’m not satisfy concerning the advice I just give you. So, I’ll write it again that way: Before the official publication of your interesting work, why don’t you find one specialist in the field of spectrometry and/or chemical analyses, so that he could do some independent analyses in order to determined the validity of your conclusions? Now, it’s better….","date":"2013-05-25","mins":"5:36 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34914","author":"yannick_clément","post":"Very good remark concerning the fact that most bloodstains on the Shroud came from exudates of humid blood clots and not whole blood in liquid form. Adler was very specific about that in his articles concerning the blood and I think this could have had some impact on the reddish aspect of the bloodstains on the cloth… One thing’s for sure: If someone in the future would want to reproduce the color of the bloodstains on the Shroud while using a high level of bilirubin, this person will have to do his experiment on dried blood clots that could become humid again on their surface before leaving a mirror image on the cloth. I have to assume that Adler did his color experiments while using exudates of blood clots….","date":"2013-05-26","mins":"6:14 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34913","author":"yannick_clément","post":"Thanks again to Joe and Paul for this answer. I will print it and read it more carefully later tonight….","date":"2013-05-26","mins":"6:06 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34791","author":"yannick_clément","post":"Thank you Joe. So, if I understand correctly, the sample analyzed by Nitowski (1 FH) never was analyzed by Rogers or by Mc Crone right? This 3rd sample contaminated with madder rose seem to mean that madder rose can definately have been scattered in various places of the cloth and, if it’s true, then I think my #1 hypothesis is truly the most probable and, if it’s true, it can be seen as another piece of evidence to back up your own hypothesis of an invisible repair. Now, I’ll wait patiently for your answers to my 2 other questions. Thanks again! One thing’s for sure: when it comes to samples of the Shroud, things are not easy to understand!.","date":"2013-05-25","mins":"6:45 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34911","author":"yannick_clément","post":"Why would you?.","date":"2013-05-26","mins":"6:01 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34921","author":"yannick_clément","post":"Here’s a questioning that came into my mind after the reading of Mr. Maloney’s comment : Is it a PROVEN FACT that the sample 3 CB has been taken from a bloodstained area of the cloth? In his comment, Mr. Maloney wrote this: “3 CB, however, APPARENTLY, is on a blood flow across the back, just below the 1534 patch also on the side strip side of the cloth.” The fact that Mr. Maloney use the word “apparently” seem very ambiguous here… I really wonder if this particular sample really came from the blood flow across the back or not because, in my mind, after watching this particular zone of the cloth with the Shroud Scope of Mario Latendresse, it seems to me that this area is located just outside the blood flow in question, in a non image zone where there are some scorches from the 1532 fire, which shows a color pretty similar to the evident blood flow that is located beside. I wonder if these particular scorches could not have been wrongly taken for a part of the blood flow across the back or if it is really a PROVEN FACT that there is also a portion of the long blood flow across the back there. In other words, is it a PROVEN FACT that some blood material has been found in this sample 3 CB? And even if this was the case, how can we be certain that this blood material was not originally located just beside and have not been move there because of the numerous manipulations, folding and unfolding of the cloth over the centuries? The reason I ask these questions about the sample 3 CB is simple: Since the area that has been sampled doesn’t appear to show any body image, if it could be proven that there really is a continuity of the blood flow there, then this would be another good piece of evidence to think that there really has been 2 different configurations of the Shroud over the body: a first one, which probably became very tight at some point because of the transfer of the enshrouded body from a central place in the tomb to a final resting place inside a wall, and that has lead to the transfer of many humid blood clots on the cloth but no body image and a second one (the final one, probably more loose without the use of any strips except maybe around the feet) that has lead probably to the transfer of some other humid blood clots on the cloth, as well as the formation of the body image. To my eyes, I’m pretty sure that there is a continuity of the blood flow across the back and outside the body image on the other side of the body image (away from the side strip) but I’m not so sure that there really is the same kind of continuity of the blood flow on the side of the side strip, i.e. In the area where the sample 3 CB was taken. That’s why I wonder if this assumption (reported by Mr. Maloney) has been scientifically proven or if it is just another assumption that still needs to be scientifically confirmed? So, I hope Mr. Maloney himself or Joe Marino will read this comment of mine and can bring me the correct answers! Thank you in advance for taking time to do this for me (and surely, for many other bloggers who will read this)! Final message for everyone: Of course, you’re free to comment on my personal hypothesis of two different configurations of the cloth before the formation of the image, but that’s not the main point here… The main point is the questions I asked concerning the presence or not of blood in the area where the sample 3 CB was taken..","date":"2013-05-26","mins":"6:56 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34928","author":"yannick_clément","post":"Sorry, I don’t understand a word of what you’re talking about….","date":"2013-05-26","mins":"7:21 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34929","author":"yannick_clément","post":"The too red aspect of the blood on the Shroud is something that already bugged many STURP members while they were in Turin in 1978! So, thinking that Mc Crone started this issue is completely wrong, I’m sorry. There is a good difference of tonality of color between the blood on the Shroud and most ancient blood and that’s a well recognized fact and this fact MUST BE PROPERLY EXPLAINED. But let’s think about it: If Adler was right about the high bilirubin level, maybe you’re right after all by saying that the reddish aspect of the blood on the Shroud is normal. But you should precise that it is normal IN THE CONTEXT OF SOMEONE WHO HAD BEEN BEATEN, SCOURGED, CROWNED WITH THORNS AND CRUCIFIED PRIOR TO HIS DEATH… By the way, you should note that this isn’t the case for the blood on the Sudarium (at least not for the blood that was shed in life and that is supposed to have come from the nape of the neck). So, if Adler is correct with his hypothesis, that would mean the Sudarium was probably NOT in contact with the same traumatized head….","date":"2013-05-26","mins":"7:27 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34939","author":"yannick_clément","post":"Thanks for the precision. But concerning Al Adler’s hypothesis, I learned from Mr. Kearse that he did some coloration test with different level of bilirubin and the one that came out closer to the color of the Shroud blood was the one with a very high level of bilirubin. I know that this doesn’t prove that the color would still be red 2000 years later, but don’t you think that this bilirubin hypothesis makes plenty of sense in the context of the Shroud on which we see the body image of a crucified victim who had been very badly tortured? In such context, everytime I will expect to see a level of bilirubin in the bloodstains much higher than normal! So, why this hypothesis proposed by Adler would not be the solution for the unusual aspect of the blood color? Sometimes, the most simple answers are the best. And this time, this simple answer of Adler fits perfectly well with the context of the burial cloth of a crucified victim. In my mind, this simple fact give Adler’s hypothesis some crédits..","date":"2013-05-26","mins":"8:08 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34792","author":"yannick_clément","post":"Oh… Forget about my last comment in which I was waiting for the answer to my 2 other questions because I just realize that you answered them all in one shot!!! ; ) Thanks again Joe. Comment concerning the possible presence of Gum Arabic along with the possible madder rose in the sample analyzed by Nitowski: Where is this sample now? Who owns it? Would it be possible to do some more chemical analyses of this particular sample? I ask this because a confirmation of the presence of madder rose and Gum Arabic in an area of the cloth located so close to the C14 corner would truly represent a great piece of evidence to back up your own hypothesis! I’m sure Joe also got the answer for this question….","date":"2013-05-25","mins":"6:49 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34947","author":"yannick_clément","post":"All I can answer is this: please read my comment #69! The fact that many STURP members were bugged by the reddish aspect of the blood on site in Turin in 1978 can be easily confirmed by Barrie Schwortz… He said this many times in interviews..","date":"2013-05-26","mins":"8:31 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34946","author":"yannick_clément","post":"After reading many comments here from Mr. Kearse and jesterof, I ended up with a very bad headache! I remember now why I never was interested to go into science at school… ; ).","date":"2013-05-26","mins":"8:29 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34960","author":"yannick_clément","post":"You got a good point here: I don’t remember that medical experts like Barbet (who saw the Shroud in sunlight in Turin in 1933) or Bucklin have said a word concerning a potential problem with the color of the blood on the cloth. Good point. Maybe this whole issue started because of some STURP members that were not at all medical experts and who only thought (because of a problem of perception as you said) that the blood was too red… Maybe you’re right after all. And maybe the blood on the Shroud doesn’t show too much difference of tone compared to the blood on the Sudarium of Oviedo after all. Only a blood expert who could have seen both cloth in sunlight (not photos but the real cloth) could tell….","date":"2013-05-26","mins":"8:56 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34962","author":"yannick_clément","post":"Message to jesterof: can you tell me your speciality and your scientific background please? Just to know who’s the man in front of me! Thanks!.","date":"2013-05-26","mins":"8:58 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34961","author":"yannick_clément","post":"I think I will back off instead!!! ; ).","date":"2013-05-26","mins":"8:57 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34966","author":"yannick_clément","post":"Ok… I guess that’s good enough for me. :).","date":"2013-05-26","mins":"9:02 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34965","author":"yannick_clément","post":"One more question to jesterof: Since Rogers proved that a 25 years old bloodstain (he used whole blood in liquid form for his experiment) could stay red if the cloth has been washed with saponaria, do you think that if the cloth have really been washed with this substance (remember that no one has ever been able to confirm the presence of any trace of saponaria on the Shroud), this could have had some kind of impact on the color of the blood we can see today on the cloth?.","date":"2013-05-26","mins":"9:02 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34970","author":"yannick_clément","post":"Please read my comment #83… I report the same thing concerning Barbet who also saw the Shroud Under sunlight in 1933 (or 1931 I’m not sure) and who never said a word in his book about a potential problem with the color of the blood. For Barbet, it seemed that the Shroud blood appeared totally normal for ancient bloodstains coming from exudates of blood clots. This fact has always bugged me versus all that was said by others concerning the so called problem of the reddish aspect of the blood. Now, I start to think that maybe you’re right after all and that there is possibly nothing wrong or special with the color of the blood on the Shroud….","date":"2013-05-26","mins":"9:27 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-84827","author":"yannick_clément","post":"If people stop telling what to write here, I will keep on writing on this blog. Otherwise, you won’t see me no more..","date":"2014-03-04","mins":"9:31 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-84568","author":"yannick_clément","post":"And if I want to say out loud that I hate how Fanti (the Italian engineer) is doing Shroud science, I WILL!.","date":"2014-03-03","mins":"4:47 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-84579","author":"yannick_clément","post":"Quote: “Hugh may consider Fanti’s comments as “spectacular nonsense”; I might classify it more as “innate Italianate exaggeration”.” And Yannick Clément see this as “Religious bias coming from a Catholic Italian who try to prove the authenticity of the relic AT ALL COST”..","date":"2014-03-03","mins":"5:34 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-84560","author":"yannick_clément","post":"I would use the 4 letter words here but I can’t… If you don’t like what I say, please pass it by and leave me alone..","date":"2014-03-03","mins":"4:31 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-84532","author":"yannick_clément","post":"Seriously, what else can we expect from someone like Fanti?.","date":"2014-03-03","mins":"2:39 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-84561","author":"yannick_clément","post":"I’m sick and tired of people telling me what to say… I’m free enough and old enough to say what I WANT TO SAY. [Deleted by Dan Porter].","date":"2014-03-03","mins":"4:32 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-84566","author":"yannick_clément","post":"Last comment to Daveb (and anyone else) for today: Did you ever saw me say something like “Don’t say this” or “You have no right to say that”? No. We live in a free world and people can say what they want (at least, I thought this was the case). And then, people have the right to agree or disagree with what have been said. But they have no right to play the “censorship” game by telling other what they can or what they can’t say. Hope people will get me right. There’s a huge difference between censorship and criticism. The first is faschist and anti freedom in essence, the second is one of the most beautiful right we have as a free man. So, I don’t care if you criticize me (you did that so well all the time anyway), but to use censorship against me, no way!.","date":"2014-03-03","mins":"4:45 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-19162","author":"yannick_clément","post":"And many data coming from the Shroud strongly suggest that it is an ancient cloth that has been woven prior to the 8th century because of the technique that was used to manufactured the cloth. Others data also strongly suggest that this cloth has been woven by a Jewish artisan. I don’t have any doubt at all concerning the Antiquity of this cloth, which can only mean one thing: the C14 dating of 88 is completely off track..","date":"2012-11-17","mins":"5:14 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"},{"id":"comment-33327","author":"yannick_clément","post":"Oh… I forgot one more reason why Fanti’s claim regarding the age of the cloth will most certainly fall into the category of anecdotal evidences about the Shroud : it is the simple fact that the results of his research will never be accepted and recognized by the Church authorities. No one (not even Fanti himself) can change that. A new series of direct tests will be the only way to know how accurate Fanti’s conclusion can really be. Until that time, we will never know the truth for sure about that..","date":"2013-05-09","mins":"9:36 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-33343","author":"yannick_clément","post":"Just to summarize my idea about Shroud researchers like Fanti and all the others like him, I would say this : All these people entered in the Shroud world with this line of thinking : « The Shroud is surely the burial cloth of Jesus Christ and must show some physical proofs of the Resurrection on it. Therefore, I’m here to prove the authenticity of this relic and to find those proofs of the Resurrection. » Unfortunatelly, this kind of thinking is frequent in the Shroud world, while it is not at all the right way to approach this cloth and the image on it. Effectively, if those people were honest and unbiased scientists, here what they would think instead : « STURP proved beyond any reasonable doubt that the Shroud is a real burial cloth of a crucified man who look like the Jesus of the Gospels. I will try hard to find the truth about it, no matter what this truth can be. » Rogers thought like that. Adler thought like that. Most of the STURP crew thought like that. Right now, the Shroud world need more scientists who think like that..","date":"2013-05-09","mins":"1:45 pm","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-33400","author":"yannick_clément","post":"It is because of that simple fact that I still don’t understand how Fanti was able to convinced his university to give him big $$$ for a study on highly questionable and very old samples that would NEVER be accepted and recognized by the Church authorities, no matter what could be the final results. As I said earlier on this blog : Fanti must have very good friends with great influence at his university… Personally, I would never have spend 2$ on a study like that. But in the end, if such a study can push the authorities to allow a new series of direct tests on the relic done with a very good team of experts in their own fields of research, then some good thing could come out of this. Only the future will tell..","date":"2013-05-10","mins":"8:30 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-33329","author":"yannick_clément","post":"Another way to do what I call « directed science » is to adjust some of your results (because these results doesn’t fit well with your preconcieved ideas) while leaving other results untouched (because they fall right into the range you expect) and that’s exactly what Fanti and his gang seem to have done with their dating research. This important aspect of Fanti’s scientific work was cleverly underlined in Mr. Gian Marco Rinaldi’s recent critical review of Fanti’s book..","date":"2013-05-09","mins":"9:46 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-33320","author":"yannick_clément","post":"Fanti is not necessarily doing “bad science”, but he do “directed science” in the sense that he believe the Shroud to be authentic and to show some physical proof of the Resurrection (which is ludicrous) from the first day he entered into the Shroud world. That’s a fact and no one can change that. Because of this, I have a tendency to put everything that comes from him in great doubt, unless his conclusion can be independently confirmed by other scientists, which I still wait to see….","date":"2013-05-09","mins":"8:27 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-33407","author":"yannick_clément","post":"Ton ami Carlos Otal ne se gêne pourtant pas pour écrire ses commentaires en espagnol….","date":"2013-05-10","mins":"9:12 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-33357","author":"yannick_clément","post":"Calme toi donc le “ponpon” Thibault! J’ai jamais vu un type aussi “soupe au lait” que toi… Incroyable. Au lieu de constamment chercher la petite “souris” dans ce que j’écris, demande toi donc plutôt si c’est possible que j’aille raison après tout… Pour revenir à ta question, au Québec, et tu demanderas à Mario Latendresse qui va te le confirmer, une “gang”, c’est un groupe de personnes qui se tiennent toujours ensemble et qui pensent généralement de la même façon. Ça n’a rien à voir avec une bande de criminels… Donc, la “gang” à Fanti, dans mon langage, ce sont tous ceux qui “collaborent” de près avec ce sombre personnage qui mériterait juste d’être foutu dehors du monde du linceul à coup de pied au derrière, étant donné tout le mal qu’il est en train de faire à la crédibilité de la sindonologie… Si ça peut te rassurer, je n’ai jamais eu ton nom en tête quand j’écrivais “la gang à Fanti”… Je pensais plus à tout ces universitaires italiens qui ont collaboré avec lui pour son programme de recherche sur les vieux échantillons de poussière qui avaient été pris par Riggi..","date":"2013-05-09","mins":"4:42 pm","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-33322","author":"yannick_clément","post":"I said what I said about Fanti, but be certain that I think exactly the same for many modern Shroud researchers who are greatly biased in favor of the authenticity of the cloth and, worse than everything, are constantly seeking to find some physical proofs of the Resurrection on that cloth. For them too, I’m extremely prudent when it come to trust their conclusions. In their case too, I prefer to wait and see if their conclusions can be backed up by other independent researchers. Because of the subject matter, we need to be prudent like that because it’s so easy for a pro Shroud scientist to carefully choose the data that satisfy his beliefs about the Shroud, while leaving aside some other data, which are truly problematic for his preconcieved ideas… At first sight, that can make a scientific work that looks all right (and that can even be accepted by a peer review commity), but in truth, that produce a « directed » science that doesn’t follow properly (and honestly) the true scientific method. Ray Rogers talk in length about this important problem in his book. It’s a recurent problem that I’m affraid we will have to face more and more in the future, until a new series of direct research done by an unbiased team of experts in their field of science can be allowed by the Vatican. And concerning Fanti’s claim versus the age of the Shroud, I really think these claims will end up in the same category than Max Frei’s claims versus the pollens, i.e. Into the « anecdotal evidences » category. I say this mainly because of the highly questionable nature and representativity of the very old, tiny and damaged (broken fibrils that were not part of the Shroud anymore when Riggi vaccumed them) samples he used versus the main body of the cloth….","date":"2013-05-09","mins":"9:06 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-33323","author":"yannick_clément","post":"Just to push your reflection on the subject a bit further, consider this important truth : It’s evident that a Christian scientist will have much more chances to have some preconcieved ideas about the Shroud that can interfere with a good scientific method than, let’s say, a scientist who is agnostic on the subject… THIS IS EVIDENT and, unfortunatelly, this truth is not even accepted by some pro Shroud people..","date":"2013-05-09","mins":"9:12 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-9809","author":"yannick_clément","post":"Quote : “After a few months ago ENEA researchers have rejected the possibility of a medieval forger.” It’s very weird to see how history is always twisted badly in the Shroud world. First of all, the statement that there’s absolutely zero possibility for a medieval forgery is true only in the potential case that it was a forger doing some form of unknown artwork. And this FACT is not a discovery of ENEA at all. This conclusion was reported first by the STURP team at the beginning of the 80s ! I’m sorry but History (with a big “H”) should not retain that the ENEA is the father of this conclusion while it is, in fact, the STURP team who discover that ! Having say that, I also want to say that, in the case that it would be some forger who would have created the Shroud while using the corpse of a real crucified person like Jesus, I don’t think any credible scientist (not even Di Lazzaro and his group) can absolutely reject this possibility, simply because we still don’t know how the image was formed ! In other words, we know with a very great degree of certainty (let’s say 99 % to stay prudent) that the Shroud image was not made by any kind of art we know (from any period of time in history), but what we don’t know yet, is the question of whether or not this image was created by some chemical process coming from the dead body. If this possibility would be true, then, in the present state of our knowledge, how can we be 100% sure that the man on the Shroud is really Jesus of Nazareth and not some medieval victim of some genious forger ? Everyone who know me understand that I don’t defend at all this hypothesis ! But, to stay scientifically correct and prudent, we always have to keep this possibility alive, even if she doesn’t stand high on a probabilistic scale. Since this is the reality, I don’t think that this quote fron Dan is completely true and correct… What bugs me the most is the fact that it’s not the first time I read this incorrect statement here. Until we can be 100% sure about the age of the cloth, I don’t think anyone can or should completely reject the hypothesis of a medieval forgery done with some yet to be discovered “natural” chemical processes that came out of a dead and tortured body. And I also want to say that even if a new C14 test would came out with a first century date, the skeptics could always say that the cloth is authentic but not the image on it (that could have been done on it centuries later). You see, it will always be impossible to be as categoric as Dan on the possibility that the Shroud can be a forgery. An artwork ? No ! But a natural kind of forgery ? It is possible even if it is unlikely..","date":"2012-03-30","mins":"7:17 pm","url":"https://shroudstory.com/2012/03/28/carbon-dating-of-the-shroud-digging-even-deeper/","cat":"carbon_14_dating","title":"Carbon Dating of the Shroud: Digging Even Deeper"},{"id":"comment-11334","author":"yannick_clément","post":"The best line about the C14 fiasco I’ve ever heard come from Russ Breault. He said in an interview, in order to explain why the original protocol was changed at the last minute (leading to the dating fiasco we know), M. Breault said briliantly something like this : “The Turin autorities prefered aesthetic over a proper scientific set up.” I think M. Breault put the finger on the real problem, which is that the authorities were afraid to do some damage to their precious relic and that’s why they decided to change the protocol. So, I don’t believe in the conspiracy theory. I believe we should blame it mostly on fear of damaging the cloth instead… And I think this is understandable to some extent, but in bad scientific conditions like that, I really wonder why they did a C14 test anyway ? In my mind, you must do it properly or you’re better to do nothing at all, especially on an important test like that !.","date":"2012-05-13","mins":"9:11 pm","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia"},{"id":"comment-11044","author":"yannick_clément","post":"I love this answer from Meacham. I love the direct opinions of Rogers and his work but I’m not sure his opinion about the Thymol issue necessarily mean that a new C14 would be wrong. I’m not sure that was what he mean anyway ! Also, in the documentary where we see him speak to Barrie Schwortz, he said that the charred material that was taken off the Shroud during the restoration and kept in Turin ever since would make very good samples because, in his mind, this kind of material could not have been affected at all by the Thymol treatment of the reliquary… And remember that we speak about a chemical treatment of the reliquary of the Shroud, and not the Shroud itself !!! I think this, too, must never be forget..","date":"2012-05-01","mins":"4:59 pm","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-10967","author":"yannick_clément","post":"For the Vatican, whether the Shroud is authentic or not is not that important. The importance is to whom this image refer to !!! Jesus is much more important than his image (whether it’s real or not) and the Church have understand that perfectly… Our faith MUST rely on a living person, Jesus Christ, and not on his burial Shroud or his image. And we must never forget that the Church position about the authenticity issue is completely link with the scientific research. So, because it is that way, you can be sure that the Church will NEVER problaim this cloth to be the authentic burial cloth of Jesus since science will NEVER be able to do so ! It’s truly impossible for science to claim, without any doubt at all, that this cloth is really the one of Jesus. And that fact was clearly stated in many STURP publications. Of course, with all the circumstantial evidence we know about that cloth, the most likely conclusion, for the moment, is that this cloth is the authentic burial Shroud of Christ. But it’s just that : Circumstantial evidence. It’s different from an undeniable scientific proof… So, forget about a proclamation of the Church who would say : the Shroud is authentic. That will never come, even if many clergymen believe that this cloth is authentic..","date":"2012-04-29","mins":"6:42 pm","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-5834","author":"yannick_clément","post":"Quote : But in archaeological science, being able to reproduce something, doesn’t imply that that’s the technique used. For this part, I agree completely with this guy..","date":"2011-12-21","mins":"11:33 am","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake."},{"id":"comment-10968","author":"yannick_clément","post":"That was Rogers opinion… I would really like to hear a radiocarbon expert about that. We must not forget that this was the reliquary that was treated with this stuff and not the cloth itself..","date":"2012-04-29","mins":"6:44 pm","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-5853","author":"yannick_clément","post":"Yes, I mean Ramsey. And believe me Ron, I stand to what I just said and of course, I include every possible natural process… Reproducing a coloration with some technique doesn’t mean this was the technique that was used in the original sample. This is basic logic and it’s good Ramsey said that. But one thing we must state clearly here is the fact that those UV experiments proves NOTHING at all regarding the Shroud. They are far from being able to produce a real body image (or any kind of image whatsoever) with this technique that will have ALL the chemical and physical properties of the Shroud. And I will add just a personal opinion : If the body images on the Shroud were created by a by product of the resurrection, why it has to be UV light ? In other word, why resurrection would just produce this kind of energy and nothing else ? If there really was a burst of energy during this event (I don’t believe it one bit but many people here do), why there was no other by products released at the same time ? To me, the idea that it was UV light and nothing else that has produced the body images is just completely ridiculous… I say it again : this is just my personal opinion..","date":"2011-12-21","mins":"4:47 pm","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake."},{"id":"comment-5854","author":"yannick_clément","post":"Matt :That is a very good quote and true. – religious people love to jump too conclusions no matter what to protect their beliefs systems.Ramsey just points out the obvious. No system yet it appears to debunk the radio carbon testing, even Jackson’s carbon hypothesis. I’m sure Ramsey wants to know the truth and if that means that the dating was wrong I’m sure they would admit it – he’s a scientist – they want to know the truth and gain knowledge. Obviously he admits it could be flawed but nothing has suggested this till date. Matt, you’re off track a bit here and I will not wrote down all the published papers (by Ray Rogers and others) that proved that the sample chosen to be dated was not representative of the main part of the Shroud. Ramsey represent Oxford lab. In this regard, until new C14 test could be done, he has to be politically correct and stick to the result of 1988. I think that’s why he don’t make big claims against the result of 88. He stay prudent. But I repeat, there’s enough proof that the sample chosen was not representative of the whole cloth. Now, for the question of what really caused this contamination, the most probable answer is an invisible repair, no matter what Ramsey can say about the weave of the sample… The repair is just an hypothesis so far. But it fits with Rogers findings, so, to me, it’s the most probable answer to the question of why the sample was not representative of the main cloth. At the very least, there’s enough question about the C14 dating to ask for a new one done in a better condition than it was done in 1988 (with at least 3 different sites dated and a chemical analysis of the samples done before the test). Unfortunatelly, those things were not done in 88….","date":"2011-12-21","mins":"4:59 pm","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake."},{"id":"comment-33413","author":"yannick_clément","post":"In such a bad context of political games (involving Chagas, Canuto, Gove, all the C14 labs, etc.), the only good move that should have been made by Luigi Gonella, the scientific adviser of the whole project, would have been to drop out of it. But sadly, he did nothing to stop the C14 dating to be made despite of a very weak and risky protocol. More than that, if we believe Meacham, he was one who approved the very bad choice of taking only one sample in a very suspicious corner of the cloth. Not great for a scientific adviser in charge of the supervision of the whole thing. Imagine if he would have drop out of the project, let’s say one month before the sampling date… Don’t you think that such a drastic move would have had some chances of stopping the project of taking only one sample and not making any other direct analyses on the cloth? Who knows ? I think this kind of move would have ring of bell in the Vatican to let them know that something was wrong in this whole project… I still believe Gonella was the best person who could have had some chances of stopping this bad project at the time or, at the very least, to force the authorities to make some important and beneficial changes to the research protocol by droping out of this project before the day of sampling and making public critics in the newspapers. Sadly, he did nothing of this sort (he did not even listen to Meacham’s good advices) and the rest is history..","date":"2013-05-10","mins":"11:08 am","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-5855","author":"yannick_clément","post":"And remember that even Julls from the Arizona lab called for a new C14 dating in his 2010 article !!! That says a lot, don’t you think ?.","date":"2011-12-21","mins":"5:03 pm","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake."},{"id":"comment-33429","author":"yannick_clément","post":"Of course….","date":"2013-05-10","mins":"2:23 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33439","author":"yannick_clément","post":"If I don’t understand the problem, then neither Meacham and all the other archaeologists who still used the C14 dating to determined the real age of ancient cloths..","date":"2013-05-10","mins":"4:26 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33530","author":"yannick_clément","post":"Read again Meacham’s book… He definately calls for a new C14 dating..","date":"2013-05-11","mins":"8:31 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33442","author":"yannick_clément","post":"By the way, in his book, Meacham gave a very good answer to the argument you bring in concerning the idea that the Church should wait for the development of a new method of dating ancient cloths with a higher level of accuracy than C14 dating. Meacham said about this kind of argument that this is a very weak argument in truth because if we would follow it blindly, that mean we would never do nothing and constantly wait for a new method that will be better than the best one we got at present time! You know what? I agree 100% with Meacham about that. Since Rogers work, we know have a pretty good idea of all that went wrong with the C14 dating of 1988. Taking that into account, I think it would be a lot easier to build a much better protocol this time (a protocol that would include many samples and an in deep chemical, microscopic and spectroscopic analyses of the sampled areas) to avoid the fiasco of 1988 and to get closer to the truth concerning this relic. And you know what? This should have been done since a long time now… But maybe the timing was just not right for the Church who don’t live at the same timing than the world. I’m sure this time will come sooner or later..","date":"2013-05-10","mins":"4:40 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33419","author":"yannick_clément","post":"For once, I agree with you. My point versus Gonella is just a try from me to think of what could have been done in 1988 to avoid the C14 mess. After a long reflection based mainly on the book of William Meacham (an eye witness of those sad events), I really think Gonella could have been the one who had the power to change and/or ameliorate the weak protocol of research before the day of sampling. Sadly, he did nothing and, even worse, if we believe Meacham, we have to think that he gave a 100% approval to this bad protocol, which is, for a scientific adviser, not a great proof of competence in the field of radiocarbon dating..","date":"2013-05-10","mins":"1:04 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33517","author":"yannick_clément","post":"I agree completely!.","date":"2013-05-11","mins":"5:56 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33424","author":"yannick_clément","post":"Since Rogers have only found the contaminant he have found in the samples coming from the C14 corner, I seriously doubt that another C14 dating that would be done with a much more complete and fine protocol would give a medieval result Ron. It’s not because one damaged corner of the Shroud was obviously very contiminated that it is the same for the whole cloth! Come on! And even if another sample taken from another part of the Shroud would be very contaminated, a good protocol would make sure this would be found BEFORE any C14 test would be performed. Such a sample would only have to be set aside by the labs. They would be able to do so this time because more than one single sample would be taken! And finally, as I know, C14 dating is still the best test that exist to learn the true age of an ancient piece of cloth. And Ron, if all I said in this comment would be incorrect, then you have to explain to me why an expert on the subject of C14 dating and also on the Shroud like William Meacham would still call for a new and more carefully planned C14 dating in his 2005 book!!! A new and more carefully planned C14 dating that would be done as a part of a more wider test plan is definitively the best thing that could be done in the future to learn the true age of that cloth (except if a safer and more accurate method of dating ancient cloths can be discovered, which is still not the case as I know)..","date":"2013-05-10","mins":"1:32 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33425","author":"yannick_clément","post":"I think Ron is affraid that another C14 dating test would give a result different than 33 A.D. If we truly have a scientific thinking, we should be in favor of a new C14 dating because it would surely bring us much closer to the truth about the Shroud, whatever this truth can be….","date":"2013-05-10","mins":"1:46 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33427","author":"yannick_clément","post":"With the original protocol asking for 3 samples being taken from 3 different areas on the cloth, we would already had a good idea of the precision of the final result….","date":"2013-05-10","mins":"1:56 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-28624","author":"yannick_clément","post":"The only truth regarding that part of the Gospel is that God is Love and Mercy and that, because of this, we are now free from the bundage of sin !.","date":"2013-03-28","mins":"1:04 pm","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","title":"Common Sense for Today"},{"id":"comment-28642","author":"yannick_clément","post":"One more word concerning Fanti’s claims contained in his new book : it’s one thing to get valid and representative samples of the Shroud (and so far, this is far from being proven that his samples were truly valid and representative), but it’s another thing (a very crucial one!) to make good science out of it!!! And concerning this last aspect of the question, let me remind you that any good scientists would never publish the results of a potentially important research like that in a book first but in a peer reviewed scientific journal… What credibility can Fanti obtained from the scientific community with the publication of his research in a popular book? None! How can we be certain if Fanti did good science or not? How can we be certain if Fanti followed the scientific method properly? Note that in my mind, the simple fact that he used some highly questionable samples that were removed from the Shroud so many years ago and then claim he can prove things about the Shroud on the basis of those samples is already an important break into the good scientific method. That speak very loud to me. In the summary of his book, Fanti did use the word “proof” and that’s a shame for someone who claim to be a real scientist. The truth is this : Fanti will never be able to prove anything regarding the Shroud on the sole basis of these highly questionable samples. As I said before, to prove anything about the Shroud, the only way will be new direct testing done on the cloth by a credible, professional and honest scientific team. This kind of acting remind me a great deal of Ian Wilson and some others persons from the pro Shroud world and are surely not what we can call the “correct procedure” to follow if seeking the truth by following carefully the scientific method is your first and principal motivation..","date":"2013-03-28","mins":"3:52 pm","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","title":"Common Sense for Today"},{"id":"comment-3381","author":"yannick_clément","post":"Hello Annie Cee ! I think you’re totally right. The Shroud can be sort of a turning point in someone’s life because, authentic or not, when you look at it, it forces you to face the mysterious question of the death and the resurrection of Christ. In face of the Shroud, you don’t have much choice : You got to ask yourself if you believe in Jesus Christ or not. The Shroud can really shake some convictions !  Nick is a good example of that process initiated by the Shroud… That’s why I think it’s a very good tool for reflection and meditation about Jesus Christ. Thank’s for your comments ! Yannick .","date":"2011-07-22","mins":"10:28 am","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-3321","author":"yannick_clément","post":"Sorry but the only thing science can do with the Shroud is analysing the material aspect of the cloth and tell us more about the cloth, also more about man who suffer in it and about the kind of torture he endure. But as long as learning something about the resurrection by scientifically analysing the Shroud, forget it ! Resurrection was a SPIRITUAL event, completely out of the field of science… By definition, science cannot go outside of the physical world. In fact, science is chained to the physical world. To conclude this point, I would like to quote Barrie Schwortz who once said : We cannot go in a lab and resurrect a corpse to see what kind of imprint he’ll make on a linen cloth !!!.","date":"2011-07-06","mins":"8:08 pm","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-3329","author":"yannick_clément","post":"Hello Nick ! You wrote : “No putrefaction or signs of decay? Blood clots that have perfect outlines that would have been ruptured if torn away from the Shroud? That coupled with what the apostles saw?” You put the finger on the biggest SIGN of the resurrection ! But, it’s a SIGN, not a PROOF… A sign just like the empty tomb was ! This is why I like to call the Shroud of Turin “The Empty Shroud” !!! Because there was really a dead man in this grave cloth and he left the shroud before the putrefaction of the body. I have some question for you (It’s not an attack. I’m just curious to know) : 1 Would you call the empty tomb a proof of the resurrection ??? I don’t think there was ever an apostle who claim that this was a proof… No, it was just a sign ! Why would it be different with the Shroud ? William Meacham said it the best : ” 2 If science ever proof without any doubts that the Shroud cannot be the one of Jesus, how would you react ? If your faith is based on the Shroud, no question you would have a big problem… Here’s a little personal reflexion on this particular subject : If God would have wanted to give us a PROOF of the resurrection, I think Jesus would still be here with us today, walking this Earth and showing his Holy Wounds to everyone !!! : ) But, FORTUNATELY, that’s not how it goes. I said fortunately because I would really fear a God who would impose his presence to me ! God is Love and when your name is Love, you don’t want to force anybody… Remember what Jesus said to Thomas in the upper room ? “Blessed are those who believe without seeing me !” That was not a joke !!! Thank’s for your post and God Bless You ! From a proud catholic guy who don’t need the Shroud to believe in Jesus Christ… but who is really happy to see a sign with the Shroud ! I can say that the Shroud have deepened my faith. Yannick : ) P.S. : As a catholic, I’m also proud that my Church is very prudent with this relic and don’t try to convert people with it. Doing the opposite would not be correct..","date":"2011-07-09","mins":"6:04 pm","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-124789","author":"yannick_clément","post":"The most important thing to note about the scourge marks is the fact that they don’t look as coming from the common whips that were used during the Middle Ages in Europe. Since the Shroud is obviously representing the bloody stigmatas of Jesus Christ, those marks obviously represent scourge marks and not another sort of injury… And as we know, the only thing that can produce this kind of very particular injury is the Roman flagrum that was used in Antiquity. Why people are not able to see what is as obvious as the nose in anyone’s face?.","date":"2014-05-26","mins":"10:48 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-124574","author":"yannick_clément","post":"If the Shroud would really come from the 14th Century, that would mean someone in Europe was crazy enough to crucified someone who was looking like the Byzantine depiction of Jesus with the same kind of techniques used by the Romans during Antiquity. Note that this is a proven fact that the Shroud was used to cover the corpse of someone who was tortured with the known techniques used by the Romans in Antiquity for crucifixion… So, taking this fact into account, we must ask ourselves : In the light of other known false Christian relics made in Europe around that time, did such a scenario make sense or not? Is it possible that someone did all this in order to produce a false relic of Jesus’ burial cloth? Let me laugh….","date":"2014-05-25","mins":"7:08 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-125017","author":"yannick_clément","post":"If people want to push their reflection further on the subject discuss here, I highly recommend reading the superb analysis done by a Jesuit named Werner Bulst, which he published in Shroud Spectrum International many years ago: http://www.shroud.com/pdfs/ssi19part3.pdf I read this recently and was struck by how my own personal analysis of the Shroud, which was done in a completely independent way, was very similar to his own analysis! This fact made me ask the question of why there are not more people interested by the Shroud who came up with the same kind of analysis… I hope this paper will help some people to get a better view of the situation regarding the questions of the authenticity and the image formation. Even if this paper was written many years ago, the core of it is still valid since there has been no other direct test on the relic. The only thing that would be nice to add in such a paper is the works of Rogers, Fazio and Mandaglio, De Salvo and Mills. But beside that, this is a very good paper to read..","date":"2014-05-27","mins":"8:29 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-125040","author":"yannick_clément","post":"Message to David: The conclusion that the scourge marks on the Shroud come from a whip that was similar to a Roman flagrum is not an assumption but a fact… That’s why I said it is as obvious as the nose in anyone’s face. You can question many things about the Shroud, but please, stick to the facts instead of playing the game of wild guesses and extrapolations. The fact that the Shroud man was scourged with a whip that was able to cause similar injuries as a Roman flagrum is not consistent at all with the idea of a forgery done with the use of a real crucified body in Europe during the 14th Century… Period. If this kind of gruesome scenario had really been done, no doubt you would only see long bloody marks left by leather tongues instead of dumbell shape marks left by metal balls or animal bones..","date":"2014-05-27","mins":"10:39 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-125269","author":"yannick_clément","post":"All I know Max is the fact that some intelligent and well educated people like Bults have come to very similar conclusions as I did (while making their study of the Shroud in a complete independent way than I) concerning the Shroud, which is a fact that make me think I’m not as crazy and biased as you might think….","date":"2014-05-28","mins":"11:02 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-124788","author":"yannick_clément","post":"There are more than the blood marks left by a Roman flagrum that indicates the Shroud man was tortured and crucified with the Roman techniques (techiniques by the way that were unknown in medieval Europe). I think principally of the nailing through the wrists instead of the palms (which was not the common way Jesus was depicted in Medieval Europe) and also the use of a cap of thorns instead of a crown, which is a mockery coming from the kind of cap that was often used by Middle Eastern kings in Antiquity (instead of the crown that was normally used by European kings in Middle Ages). But more than this, the principal reason I reject the possibility of a forgery done in the 14th Century in Europe with the use of a real crucified body is the fact that such a gruesome scenario goes far beyond what was necessary for a forger of that time in order to create a false relic of Christ. And if you don’t believe me, look at the few examples of false shrouds of Christ that appeared in Medieval Europe after the crusades! None of those shrouds had even a body image on them and none of those were showing bloody imprints so strikingly close to the reality of a Roman execution done in Antiquity. That’s why I estimate the scenario of a 14th Century forgery done with the use of a real crucified body in Europe has being close to absolute zero on a probabilistic scale… If such a gruesome scenario ever happen, it must have taken place in the Middle East and near the reign of Constantin in the 4th Century (when Christian relics started to appear everywhere in great number throughout the Roman Empire). But I must add that, even then, such a scenario is far less probable than to see the Shroud as the authentic burial cloth of Jesus of Nazareth….","date":"2014-05-26","mins":"10:43 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-4515","author":"yannick_clément","post":"Ron you said : “It almost seems to me that very little credence is given to the ‘tested’ results completed by R.Rogers and released in his paper of 2005.” YOU’RE TOTALLY RIGHT MY FRIEND ! I really suspect that, in the world of the Shroud, there’s alot of people who are simply jealous of Rogers and they tend to deny anything he has done regarding the Shroud. There’s also another big factor that I see at work : The supernatural freeks ! Many people just cannot accept Rogers conclusions (anyone of them regarding many aspects of the Shroud) just because those conclusions put the supernatural completely out of the question !!!.","date":"2011-11-02","mins":"8:31 am","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","title":"Giulio Fanti on the Carbon Dating of Certain Relics"},{"id":"comment-4503","author":"yannick_clément","post":"I want to react to this comment from M. Fanti because I think his point of view is REALLY (AND WAY TOO MUCH) SIMPLIST AND ALSO BIASED ! First, I want to point out that M. Fanti seem to think that there’s only 2 possibilities : 1 ALL the relics he mentioned are fake 2 ALL the relics he mentioned are authentic. I’m not enough stupid to buy that. Some relics may be false and some may be authentic ! How can he pretend that it’s all white or all black with no in between ? Come on ! It is well proven that all along the Christian history, there really was false relics and that some local Church (I won’t go as far as to declare that it was done directly by the Vatican) used them to fool people. There’s no question about that. But at the same time, I want to say that it is not because there really are false relics that the 4 he mentioned are necessarily false too. Again, that would be a too simplistic way to think that every single relic is automatically false ! I’ve read on a french website dedicated to the Shroud (I don’t remember where) a statement that is very true regarding the question of relics : If there is false relics, that mean that there is also authentic relics ! That’s so true. Before some forger were at work later (let’s say around the time Constantin hallowed the Christians to practice freely their religion), it is sure that there was at least some objects that were really related to the disciples of Jesus, or some Saints and Martyrs, or even Christ himself ! If it wouldn’t be the case, now we could say that everybody who think a relic is genuine is a real fool. But, it’s not the case. So, that leaves the door open to the possibility that the 4 relics mentioned here can be authentic. But it’s only a possibility, not a confirmed fact. Another too simplistic approach in M. Fanti comment is the fact that, for him, there’s only one single possibility for the radiocarbon tests to have failed (in the case the relics are genuine) and it’s because of some unknown supernatural factor. Again, I’m not so dumb to buy that ! In 2005, Ray Rogers proved that this simplistic way of thinking is false ! He found in a sample that came from the middle of the C14 region enough evidences that an invisible reweaving took place in this region of the Shroud and that this repair was probably the big factor that is responsible of the medieval date found by the C14 labs. Now, as I know, a reweaving (even an invisible one !) is not something that can be called a “supernatural factor” ! Sorry to say that, but this way of thinking (and to denied the facts) is VERY close of being agenda driven… From my perspective, it’s not worthy of a real scientist who based is judgement and analysis on scientific and confirmed facts and on the known laws of nature. And, by the way, Rogers findings were published in a well respected peer review journal and were well confirmed by INDEPENDENT researchers like John L. Brown of the Georgia Tech Research Institute. Now, that’s a FACT ! So, if the dating of the Shroud was possibly wrong because of some newer material that was added at an unknown date, there’s a possibility that other relics could have been subject to some contamination of unknown nature (that could have been of another kind). One last comment from me about this part of the statement from M. Fanti : I have recently the chance to see some clear evidences that the sample of M. Rogers was perfectly valid. I say that because I know that M. Fanti have tried desperately over the last few years to put the sample of Rogers into question. It’s normal because for him, Rogers findings contradict his ideas about the C14 dating result. But, unfortunately for M. Fanti, Rogers sample really came from the center of the C14 region, so it was a perfectly valid sample to analyse. And maybe in the next couple of months we will know more about that… But I don’t want to talk too much about it for the moment. But I can say that I have seen enough evidences to know that his sample was perfectly valid. And for the Medjugorje proposition, sorry but to use anything related to those events in a scientific comment is ludicrous ! Even the Vatican hasn’t confirmed yet if they consider those possible Marian apparitions as genuine apparitions. There’s no bit of proof that there is some kind of an emission of any supernatural forces during those events. Science cannot state anything about that. Using this kind of argument to comfort his claim his VERY STRANGE coming from a supposed scientist, don’t you think ? In my opinion, this kind of “mystical” comment has not his place in a scientific conversation. As I said, the C14 result for the Shroud was well challenged in a correct scientific way by Rogers and some other independent researchers that have confirmed is findings (except for the paper published by Julls last year, but that’s another story because his paper was published in his own journal !). Now, for the other 3 relics, I’ve never read a scientific paper that can challenge properly those C14 results. But here, I want to say that it’s not because this is a fact that this can be taken as an absolute proof that those relics are false and that the dating was right. More direct investigations are needed, especially for the Sudarium because of the links that have been found between this cloth and the Shroud (some stain matching for example). I also want to state clearly my opinion about C14. I think that, for many people (and I know some personally), the C14 dating method is like a religion and never can failed ! This way of thinking is close of being “fundamentalist”. One this topic, I’m sure that M. Fanti would agree with me ! There’s enough example of wrong dates coming out of some C14 tests that it is a well established fact that this method is NOT 100% sure. By the way, the FACT that some other C14 tests (especially regarding some ancient pieces of cloth) came up with a wrong date is enough proof that, if there is a dating problem regarding the possible relics of Christ, we don’t have to look for some unknown supernatural factor !!! If some natural processes were at work for some other archaeological pieces with the result of giving a wrong date, why would it be different for the Shroud or any other relics of Christ ? I’m really tired to see how much some people are fast to link a relic of Christ (which is a MATERIAL thing) with the resurrection of Christ (which is a SPIRITUAL event) and always try to link it with some unknown supernatural forces that were at work ! Ray Rogers fought those “scientific heresies” all his life and totally I agree with him ! For me, all the relics that can be genuine MUST BE considered like any other archaeological piece of material. PERIOD ! Considering those relics differently because of this thing can be directly related to Christ is not science. And, by the way, the Tunic (which, according to the gospel of John, was taken by a roman soldier) and the Titulus were surely not there in the tomb during Christ resurrection ! So, how in the world some unknown supernatural forces coming out of the body could have had some impact on those objects and would be the reason that explain a wrong C14 dating ? It’s ridiculous. There is even good reasons to believe that the Sudarium wasn’t even close to the body in the tomb (because we don’t see any bizarre stains on the Shroud that would suggest a direct contact with this stained cloth)… Coming back to what I think of the C14 dating, I want to say that it is a big mistake to consider this test as an absolute. It is not. It’s a very good scientific tool to learn more about an archaeological object but there can be problems regarding this test and nobody should consider this test alone when it comes to evaluate an old object. Many more tools exist and must be considered also, along with the C14 dating. And if the dating doesn’t match the other conclusion drawn from other fields, we must question the validity of the C14 dating. On this particular topic, I think anyone should read the marvellous paper written by William Meacham BEFORE the C14 test would be performed on the Shroud of Turin and where he say that we must be very careful not to think this test alone would settle the issue. We can apply the same logic to the other relic dating. Here’s the link for the article : http://www.shroud.com/meacham.htm As an archaeologist, M. Meacham was fully aware of some C14 dating problems along the years and he knew that this test, when taken alone, should not be taken as an absolute proof of anything. It can give some good clues to understand some ancient objects or even confirm others conclusions drawn from other fields of science, but it’s not an absolute proof in itself. It is even truer when it comes to dating ancient relics that have been manipulated a lot over the years. For Meacham, the contamination issue is something science has to consider extremely carefully when it comes to date these kind of relics. But, to finish, I want to say that there’s a very big line between “contamination” and “supernatural factor” and I will surely not cross it !.","date":"2011-11-01","mins":"8:30 am","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","title":"Giulio Fanti on the Carbon Dating of Certain Relics"},{"id":"comment-28598","author":"yannick_clément","post":"During my life (especially because of my pretty good knowledge of history), I have learn to not take for granted anything that comes from someone who do science to back up some ideological ideas, especially when these ideas turn around religion. Note that it’s the same thing for anyone who do science to back up their anti Christian ideas. Because those people are doing science for the wrong motives, I prefer to disregard everything they can say until their conclusion could be scientifically confirmed by some credible and honest scientists who are not known to have any religious or anti religious bias. I think it’s much more prudent to think that way, especially regarding something as much controversial as the Shroud of Turin. And I think the recent history of Shroud science prove that I’m right to think that way..","date":"2013-03-28","mins":"8:49 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-28597","author":"yannick_clément","post":"Just by the reading of the summary of that book, that’s well enough for me to comment since I know Fanti’s religious bias very well. In fact, his bias should be obvious for anyone who has a brain that work normally..","date":"2013-03-28","mins":"8:39 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-28515","author":"yannick_clément","post":"Fanti’s material mainly came from the dust vaccuumed between the backside of the Shroud and the Holland cloth in 1978. This kind of volatile material is much more questionable (the same is true for the pollens by the way) than the few threads analyzed by Rogers that were taken by Gonella himself in 1988. We know for a fact that these threads really came from the area of the reserve piece of cloth cut by Riggi for the carbon dating that was adjacent to the sample used by the C14 labs. NO QUESTION ABOUT THAT. The fact that you and Fanti are constantly questioning the validity of the samples used by Rogers show how anti Rogers you (and Fanti of course) really are. Rogers was such a pro that he didn’t wanted to make any claim just based on the Raes samples he analyzed first and requested from Gonella a few threads from the actual C14 sampling zone that was cut by Riggi. He got it, analyzed it and found the same intrusive things he already had found in his Raes sample. Then (and only then), he published a paper about that which show strong evidence that the C14 corner was not representative of the main body of the Shroud. Now, concerning the dust samples used by Fanti in his own study, no one can really be sure that such a volatile (and old) material was not polluted after the sampling by newer material that has nothing to do with the Shroud??? Also, part (maybe a big part) of the material vaccuumed by Riggi could well have been droped on the Shroud well after the first apparition of the relic in Lirey (ca. 1357). How can someone be sure of the validity and representativeness of such a volatile material??? No one in fact. And the fact that Fanti (who present himself as a true scientist) mainly used that kind of highly questionable samples in order to prove the C14 dating wrong and to prove that the image is a direct product of the Resurrection of Christ is very telling about the bad (religious) motivations and the non professionalism of this person. Fanti is not Rogers and, truly, Rogers was not Fanti… One can be fully trusted because he wasn’t doing science to confort his beliefs. Guess who?.","date":"2013-03-27","mins":"3:44 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-28749","author":"yannick_clément","post":"Al, the only way a new series of testing on the Shroud could be “fully scientific” as you say would be for the Vatican to form a team of credible and highly regarded scientists that have NEVER work on the Shroud before (never wrote about it and never done any researches about it) and that have never been known to be pro or anti religious activists. I think that’s the only way we could finally learn the rest of the truth about the Shroud. I say “the rest of the truth” because I consider the STURP team effort to have been done with profesionnalism and honesty and I think we can trust most of their conclusions (which only shed light on some aspects of the Shroud while leaving others, like the age of the cloth and the image formation process, in the wait to be scientifically determined beyond any serious doubt)..","date":"2013-03-29","mins":"5:30 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-28748","author":"yannick_clément","post":"I completely agree with you Stephen. And, in the end, I think the only way we could settle the issue concerning the Shroud’s age would be, for the Vatican, to allow a new C14 testing, which would be properly done this time (with at least 3 different samples used that would be examined in deep to remove any contamination) and which would be include into a much wider series of direct testing on the relic. Unfortunatelly, I don’t expect this to come in a near future. But who knows? Maybe the new Pope will surprise us!.","date":"2013-03-29","mins":"5:22 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-28985","author":"yannick_clément","post":"After talking on the phone to Barrie Schwortz Friday night, I came to the conclusion that it would be very surprising if any expert in the field of ancient dating came in to analyse the validity of Fanti’s alternative techniques of dating, which have never been used before (as we can tell) to date ancient fabrics. And why did I came to this conclusion? Simply because Fanti publish his results in a commercial book for the general public instead of first publishing them in a credible peer reviewed scientific journal that would have had the obligation to verify the validity of these techniques and the quality of the science applied by Fanti and his group. Because Fanti did not act like a real credible scientist, I’m almost certain his work, techniques and results will be mostly ignored by the scientific community… I think the history will eventually end up considering Fanti’s claims in the same manner than Frei Sulzer’s claims regarding the pollens evidence, i.e. As being anecdotal information concerning the Shroud and nothing else. And I don’t think this kind of opinion will change at all until a new series of direct researches on the cloth can be allowed by the authorities, which could counter verify properly all these claims and see if some of them can really be considered as being valid and solid..","date":"2013-03-31","mins":"10:31 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-28986","author":"yannick_clément","post":"A real honest and profesionnal quest for truth (which is what true science should be all about) should never work with any bias, whether it be for or against religion. Unfortunatelly, in recent times, I don’t think there have been many scientists who did some researches on the Shroud that could fit into that category of totally unbiased scientist… And I think this is somewhat understandable because of the extremely religious aspect of this piece of cloth. It’s understandable, but in my mind, it’s not forgivable! I have too much respect for science to think otherwise..","date":"2013-03-31","mins":"10:57 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-28503","author":"yannick_clément","post":"Quote: “Why jump to anti authenticity conclusions without reading the book first?” Because if we read the book first, that will mean we will have given precious dollars to someone who wants obviously to use the Shroud for at least 2 very wrong motives, which are 1 make believe that the image on this cloth represent a physical proof of the Resurrection of Christ. And 2 making money on our back. You can do what you want but personally, I WILL NEVER BE STUPID ENOUGH TO PLAY FANTI’S GAME. Anyone interested in the scientific aspect of the Shroud knows very well the ideology defended by Fanti. No need to read is book to learn it… He published over the years enough papers about the Shroud for us to know what kind of ideological ideas are put forward in this book. And just the reading of summary prove this. Also, be aware of one thing folks : Fanti’s work was done with HIGHLY QUESTIONABLE samples that would have never been used by any credible and ethical scientist in order to “prove” anything. The fact that all his research is based on this kind of highly questionable material says it all… For example, you would never have seen someone like Rogers or Adler using that kind of samples as a base to proclaim they have proven something regarding the Shroud! But, of course, most people who will read Fanti’s book are not aware at all of these very important subtilities….","date":"2013-03-27","mins":"1:41 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-28507","author":"yannick_clément","post":"I know more about Rogers’ samples than you might think Colin ! I have even saw a drawing made by Gonella himself who represent a proof of the validity of Rogers’ samples concerning his study about the C14 corner. You must also understand that beside Gonella and Rogers, the only person who own these threads for a while was Adler and we both know that he was a profesionnal scientist who surely take a great care of those samples. It’s not the same with the dust taken by Riggi..","date":"2013-03-27","mins":"2:20 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-3117","author":"yannick_clément","post":"I fully agree with this reader comment. And I would like to add this : I believe the shroud is genuine but I don’t mind at all that there is skeptics out there who challenge his authenticity. This is healthy for the debate. At least, I hope those skeptics can be honest and go where the FACTS lead them. Also, I want to say that it’s not the skeptics I fear the most in the shroud world but what Ray Rogers call “The lunatic fringe” ! Those who want to use the shroud to “prove” the resurrection of Jesus. They try hard to prove what science will NEVER be able to prove. Those are the real dangerous people out there….","date":"2011-05-12","mins":"10:51 am","url":"https://shroudstory.com/2011/05/12/kcs-life-based-science-and-the-shroud-of-turin/","cat":"carbon_14_dating","title":"KC’s Science-Based Life and the Shroud of Turin"},{"id":"comment-3799","author":"yannick_clément","post":"I fully agree with all the points you put forward Dan to show that there is no question about the fact that the C14 Raes region of the Shroud wasn’t the same physically and chemically than the main part of the cloth. But you forgot 2 very important quotes that shows that the C14 dating is questionable : Late 2010, Timothy Jull wrote a paper in his own journal Radiocarbon trying to prove that his C14 sample received in 1988 was totally valid for dating. But at the end of his Paper, M. Jull wrote something incredible : he said that it would be a very good thing to do another C14 dating !!! That just prove how much even the C14 labs are not so sure about the result… And there is also what Christopher Ramsey said some years ago about the fact that there is an apparent contradiction between the 1988 C14 result and many other data that seem to suggest a much earlier date for the Shroud. Ramsey is the head of the Oxford Radiocarbon Accelerator Unit which participated in the 1988 Carbon 14 Dating of the Shroud. So, when the C14 people say things like that, that tells something !.","date":"2011-09-06","mins":"9:17 pm","url":"https://shroudstory.com/2011/09/06/mixing-up-faith-and-science-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Mixing Up Faith and Science on the Carbon Dating of the Shroud of Turin"},{"id":"comment-3118","author":"yannick_clément","post":"I also want to say that honest christian (like I am) can see, with the shroud, a SIGN of the resurrection of Jesus but never a PROOF. I think it’s really important to understand this distinction… The shroud to me is a sign of the resurrection, just like the empty tomb was..","date":"2011-05-12","mins":"11:01 am","url":"https://shroudstory.com/2011/05/12/kcs-life-based-science-and-the-shroud-of-turin/","cat":"carbon_14_dating","title":"KC’s Science-Based Life and the Shroud of Turin"},{"id":"comment-4534","author":"yannick_clément","post":"I agree almost completely with this great comment. The only thing I disagree a bit is his evaluation of the probability for the Tunic of Argenteuil. Even if I agree that the possibility is very low that it is authentic, I would put the probability a bit higher (let’s say 10 to 20%) just because of one thing : human blood have been found on the cloth. I know that doesn’t prove anything. But if you put yourself in the shoes of a forger from the 7th or 8th century, why do you really want to put real human blood on this cloth ? There were no DNA and blood analysis during those days. Why a forger would want to be so authentic in his work ? It would have been much more easy for him to use blood from an animal to make this relic. Nobody wouldn’t have make the difference ! In any case, that’s the way I would have done it myself if I would have been this forger. The fact that there’s real human blood on it is not a proof of anything but it can be considered as a point in favor of the “smell of truth” criteria I talked about yesterday. But, on the other hand, the fact that John report that it was a Roman soldier who get it during Christ resurrection make it very difficult to understand how a disciple of Christ would have been able to put his hand on this cloth and why the Roman soldier wouldn’t have washed the cloth ! So, in the end, when I put all those things on a balance, I consider that the probability for this Tunic to be authentic is low (as I say, around 10 to 20%). Comparative studies between the blood on this Tunic and the blood on the Shroud and on the Sudarium would really help to know the truth. When I look at the progress in genetic and forensic science, I think it is something that WILL have to be done in the future….","date":"2011-11-03","mins":"10:44 am","url":"https://shroudstory.com/2011/11/03/modified-geiger-counters-to-measure-holiness/","cat":"carbon_14_dating","title":"Modified Geiger Counters to Measure Holiness"},{"id":"comment-11717","author":"yannick_clément","post":"I think the radiocarbon method of dating ancient object should be consider as it should be, i.e. As one dating tool among others that can be good at time and bad at time, depending on many factors. And if, in a particular case of dating an archaeological artifact, the C14 result come up completely off track regarding all the other evidences concerning this artifact, then, this C14 result must be reject. This is as simple as that and any good archaeologist would act that way ! And for the Shroud, there’s enough evidences to conclude that the dating of 88 MUST be reject..","date":"2012-05-30","mins":"10:49 am","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","title":"New Dawkins Challenge Video"},{"id":"comment-4535","author":"yannick_clément","post":"Oups, I wanted to say “during Christ crucifixion” and I said “resurrection”… But you get the point anyway. : ).","date":"2011-11-03","mins":"10:45 am","url":"https://shroudstory.com/2011/11/03/modified-geiger-counters-to-measure-holiness/","cat":"carbon_14_dating","title":"Modified Geiger Counters to Measure Holiness"},{"id":"comment-11721","author":"yannick_clément","post":"Interesting comment from Mario. But can’t we think that the principle should roughly be the same for more recent objects ? As I know, those too can be really affected by contamination of some sorts, especially objects like the Shroud that have been manipulated alot over the years ?.","date":"2012-05-30","mins":"1:00 pm","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","title":"New Dawkins Challenge Video"},{"id":"comment-11750","author":"yannick_clément","post":"Have you ever thought that the linen cloths mentioned by John could have been the Shroud plus some other (smaller) linen cloths containing a mix of aloes and myrrh (in powder) and those “bags” could have been placed all around the body to avoid bad odours in prevision they had to come back into the tomb to finish properly the burial rite on sunday morning ? A possible scenario like that would explain the use of “cloths” in the plural by John in his Gospel and you wouldn’t be forced to throw out the Shroud ! And it could also explain why there is no body image of the sides of the body on the Shroud….","date":"2012-05-31","mins":"10:38 am","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","title":"New Dawkins Challenge Video"},{"id":"comment-10969","author":"yannick_clément","post":"You can forget about that unless you love conspiracy tales like The Da Vinci Code and stuff like that. Personnaly, I really don’t think so. I think that, after the 2002 restoration, the authorities took all the different samples and data they gathered and put them in a safe with all the other data that were already there since the first scientific investigations of 1973, 1978 and 1988. And then, wisely, they said to themselves (wisely I think) : Let’s wait some time until the dust settles….","date":"2012-04-29","mins":"6:49 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-10972","author":"yannick_clément","post":"Why do you think they did so bad with the statistical processing ? Because science (Rogers, Adler, etc.) has proven since 1988 that the radiocarbon sample was not homogeneous at all (chemically speaking), unlike any other part of the Shroud where chemical homogeneity was proven to be very good. And since that part of the Shroud was not chemically homogeneous at all, all 3 labs get results different from one another in a way they wouldn’t normally expect from a tiny sample of some square centimeters. Because of that, making those result fit into one single general dating result was a hard taks for them and they worked very hard to get there. This FACT that the C14 sample was not homogeneous at all is a very good sign that there was some kind of manipulation in that region (most probably before the 1532 fire, since Adler has proven that threads of the C14 region were affected by a water stain). And the findings of Rogers and Adler of materials that are not present anywhere else on the Shroud are also clear signs of some kind of manipulations in that region. I don’t think we should have great doubts about that. All those facts formed a good portrait that point in one direction : the radiocarbon labs did a decent job in 1988 but they did it on a single sample that was not representative of the main cloth and that was probably repaired before 1532. If we used Ockham razor principle, there’s do doubt at all that the medieval invisible repair is the most likely answer to explain the medieval date given by the labs in 1989..","date":"2012-04-29","mins":"7:32 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-11072","author":"yannick_clément","post":"Adrie, you should listen to Alan Adler presentation at the first conference in Dallas in 1998. Here’s the link to listen to it : http://shrouduniversity.com/podcasts/aladler.mp3 You’ll see that the spectroscopic analysis done by Adler leave no doubt about the FACT that the radiocarbon sample zone was not homogeneous at all !!! And this FACT is in total agreement with the great difficulty that the C14 labs had to make all the data fit into one “coherent” conclusion !!! I wish you a good listening !!! Listen carefully….","date":"2012-05-02","mins":"3:49 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-10929","author":"yannick_clément","post":"Gabriel, I understand what you say. And here’s a quote from you : “As a conclusion, in my opinion, the results presented in this paper do not contribute the least to invalidate the 1988 carbon dating.” I agree to some extend. But, you must not forget all the things found by Rogers that are well enough to show that the part of the Shroud that was dated was not representative at all of the rest of the cloth. By the way, Alan Alder, prior to Rogers, did some spectroscopic analyses at the end of the 90s with some very good technique like fourier transform infrared spectroscopy and publish them in his book “The Orphaned Manuscript”. He was able to put his hands on 3 threads that came from the zone directly adjacent to the C14 sample. Personally, I don’t think we have any good reason to really doubt the findings he made during those examinations, simply because many of them just confirmed ancient conclusions reached by the STURP team before, and also, concerning his examination of the threads coming from the border of the C14 sample, it was pretty much confirmed by Rogers later on. And what was found by Adler in the spectrometric signature between threads coming from the C14 region and other non image threads coming from other parts of the cloth ? A drastic difference indicating, without any doubt, that the chemical composition of the C14 region was dramatically different thant the rest of the Shroud. So, I think Rogers and Adler findings are well enough to understand that the C14 sample that was dated in 1988 was not representative of the whole cloth. Personally, I think a new radiocarbon dating will be necessary, but it will need to be done properly with multiple samples taken from different parts of the cloth. I also agree with you that if other precise dating techniques exist that can be applied to ancient cloths, why not used them ? But I think that another C14 would be interesting nevertheless to, at least, prove even more the invalidity of the first dating done in 1988, because I’m sure that, no matter what would be the result of a new C14 test, it would be different from the first one ! If other good method exist, I think it would be great to see a protocol of dating involving more than one single technique like the C14….","date":"2012-04-28","mins":"9:05 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-10923","author":"yannick_clément","post":"Quote from the paper : “The twelve results from the 1988 radio carbon dating of the Shroud of Turin show surprising heterogeneity.” For me, it’s not at all surprising if you consider the findings of Ray Rogers (BTW, those findings were rejected by Fanti, who simply reject about anything Rogers has ever said or wrote…) and the probability of a medieval invisible repair in that particular part of the Shroud. At the same time, this kind of heterogeneity in one single little sample would be VERY SURPRISING if we consider other hypothesis to explain the medieval dating of the Shroud, like the supernatural hypothesis proclaimed by Jean Baptiste Rinaudo in France… And by the way, in a recent book published in France (last year) written by Brice Perrier, the author cite Fanti who was defending Rinaudo’s hypothesis !!! Incredible !!! Fanti have always claim that the Shroud body images were done by a Corona discharge and here, just to be able to stand one more time against Ray Rogers, here he is to defend another supernatural hypothesis involving a bombardment of protons and neutrons that have nothing to do with a Corona discharge !!! Just with this little example, we can see the kind of ridiculous thinking that goes on in M. Fanti’s mind and, even more, we can note how he belong to the anti Rogers clique that pollutes the Shroud world… A real bad joke..","date":"2012-04-28","mins":"6:12 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-10932","author":"yannick_clément","post":"That’s right. And this charred material was preserved by the Turin authorities. That could make some good samples to analyse. But anyway, I think they could date some threads from other parts of the Shroud, just to see the difference… I don’t think Rogers opinion was definitive about the real effects on C14 dating of the Thymol cleaner used inside the Shroud reliquary. I think it was more of a “could be problematic” kind of opinion..","date":"2012-04-28","mins":"10:04 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin."},{"id":"comment-25073","author":"yannick_clément","post":"For the 1000 time, I’ll say it again : there are well enough historical, artistic and, even more, physico chemical evidences to easily understand that the Mandylion hypothesis of Wilson is completely incorrect. Historians should start to look elsewhere for once in order to find a better hypothesis to explain the Shroud’s obscure years. And if you don’t believe me (or, most likely, don’t WANT to believe me), I suggest you to read again my paper about the numerous problematic facts regarding this weak hypothesis. Here’s the link again: https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment questions about the mandylion hypothesis of wilson 2012 06 28.pdf I suggest also anyone’s interested by this hypothesis to read the very clever paper written by Charles Freeman called “The Shroud of Turin and the Image of Edessa: A Misguided Journey”. Here’s the link: http://cybercomputing.com/freeinquiry/skeptic/shroud/articles/freeman shroud edessa misguided journey/index.htm And finally, here’s the most important thing you should read that could maybe (and finally) convince you of the impossibility of Ian Wilson’s hypothesis concerning the idea that the Shroud and the Mandylion were one and the same relic: Please read CAREFULLY AND WITH AN OPEN MIND the quote #64 of my paper entitled “Raymond N. Rogers’ observations and conclusions concerning the body image that is visible on the Shroud of Turin”. And don’t forget to read also very carefully the personal comment I have add just after the quote from Rogers. Here’s the link for my paper: http://shroudnm.com/docs/2013 01 10 Yannick Clément Reflections on Ray Rogers Shroud Work.pdf I hope this will be sort of an eye opener for some reader… The physico chemical evidence that come from the Shroud is clear : The face region on the Shroud was never more exposed to light, air, dust and dirt than any other parts of the cloth where we see a body image ! PERIOD. Sorry to disappoint all the Wilson’s fanatics out there ! I say this with a big smile on my face because I truly expect to be unable (once again) to change anyone’s mind… It’s been a while now since I have stop believing I could do so here on this blog. Anyway, I thought it was important to emphasize the observations made by Rogers and Adler that are truly relevant to the subject of the Mandylion hypothesis of Wilson..","date":"2013-02-20","mins":"4:38 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights"},{"id":"comment-25322","author":"yannick_clément","post":"Dave, please read my newest comment here: https://shroudstory.com/2013/02/22/david rolfe we need you/#comment 25289 I answer the weak argument you mention. Don’t worry, I’m well aware of it and once someone really start reflecting seriously about it, it become obvious that this cannot explain properly the homogeneity of the fabric in the light of the Mandylion hypothesis of Wilson. Sorry but we know for a fact that the Mandylion was shown many times during its known history and the “Narratio de Imagine Edessena” even say that it was publicly displayed once every year after his arrival in Constantinople in 944, which is much more than the Shroud since the fire of 1532! Also, you have to consider the obvious fact that there was no reliquary that was completely hermetic during that time! It’s evident that air and dust was able to affect the linen fibers of that cloth, particularly the exposed side, which show the face of the living Christ with no bloodstains or injuries….","date":"2013-02-22","mins":"4:39 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights"},{"id":"comment-25196","author":"yannick_clément","post":"I already did take my own advice Dave and that’s why I prefer to base my judgment on the physico chemical evidences coming from the Shroud that were published by experts like Rogers and Adler instead of focusing on some wild assumptions published over the years by Wilson, Scavone, Markwardt and company that were mainly based on some far from being precise descriptions of the Mandylion! ; ) On the contrary to the historical research, which is far from being a precise science, the physico chemical data coming from the Shroud are very solid and very clear about the FACT that the face region of the cloth has never been more exposed to light, air, dust and dirt than any other part of the relic during the course of his long history and, alone, this important FACT is enough for me (as it should be for you too) to completely reject Wilson’s hypothesis because it leaves no room for wild assumptions and speculations, which is the favorite sport of Wilson and many others Shroud historians..","date":"2013-02-21","mins":"4:27 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights"},{"id":"comment-25080","author":"yannick_clément","post":"Please read carefully and with an open mind the quote #63 of my paper entitled “Raymond N. Rogers’ observations and conclusions concerning the body image that is visible on the Shroud of Turin”, along with the personal comment I have added right after. You can read it with this link: http://shroudnm.com/docs/2013 01 10 Yannick Clément Reflections on Ray Rogers Shroud Work.pdf After reading this part of my paper that emphasize some very strong physico chemical evidences against Wilson’s hypothesis, I hope some of you will start to understand that such an hypothesis is most certainly incorrect (with a 99.9% level of confidence) !!! The face region on the Shroud has never been more exposed to light, air, dust and dirt than any other parts of the cloth where we see a body image and that’s the PHYSICO CHEMICAL REALITY. Sorry, but that doesn’t leave too much space for an error of judgment… Wilson’s hypothesis must be regarded as incorrect. Completely incorrect. Historians must start to look elsewhere if they really wants to find a proper explanation for the Shroud’s missing years..","date":"2013-02-20","mins":"5:38 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights"},{"id":"comment-25081","author":"yannick_clément","post":"Forget this second comment of mine which is almost the same as the first one. This is due to a problem with my Explorer page..","date":"2013-02-20","mins":"5:39 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights"},{"id":"comment-25149","author":"yannick_clément","post":"The most important thing to note concerning my comment of yesterday (and it’s very important!), it is the FACT that Rogers and Adler, while making their analyses on fibers samples of the Shroud, NEVER had the intention to back up or discard the hypothesis of Ian Wilson regarding the Mandylion. To me, this constitute a sure proof that there really is no bias for or against Wilson’s hypothesis in their results, which CLEARLY show that there is absolutely no particular part of the Shroud that has been more exposed than the others to light, air, dust and dirt. Effectively, Rogers and Adler were very clear about the FACT that there are no signs of a more intense natural oxidation of the linen fibers in one specific part of the cloth versus the rest of it, which, in itself, completely contradict the Mandylion hypothesis. Every time there is a new historical research published on the subject of the Mandylion hypothesis, whether it is for or against it, there is ALWAYS a danger of bias (conscious or not) on the part of the author of the study. NODOBY CAN’T SAY THIS CONCERNING THE PHYSICO CHEMICAL RESULTS OBTAINED BY ROGERS AND ADLER ! That’s why, to me, this physico chemical evidence is much more credible and important than any historical study that has ever been published about the Mandylion hypothesis in order to judge if this hypothesis has some chances to be correct or not. And sadly for the partisans of Wilson’s hypothesis (who are ALL pro Shroud fanatics at the same time… Funny!), what Rogers and Adler told us about the physico chemical REALITY (this didn’t left a door open for any wild assumptions) is enough clear to understand that the face region of the Shroud HAS NEVER BEEN more exposed to light, air, dust and dirt than the rest of the cloth, which is exactly what would have happened for many centuries if Wilson’s hypothesis was correct. Therefore, there is no other possible and credible conclusion to draw that this one: historians MUST look elsewhere in order to find a better explanation for the Shroud’s missing years, which can well be, in fact, simply due to a very long hiding of the relic during most of the time prior to the most probable public exhibition of it every Friday in the Blacherne Chapel in Constantinople before the sack of the city in April 1204. Note that this is exactly what Emmanuel Poule, a very good Shroud historian, was thinking in the face of the great lack of documentary evidence of a Shroud of Christ with a body image and bloodstains on it prior to 1204 and the testimony of Robert de Clari. I agree that this is surely to most rational hypothesis that can be made right now and the gruesome aspect of the relic is most probably the great responsible for this very long hiding from the eyes of the public. In conclusion, the most important thing to note is the FACT that Rogers and Adler’s findings regarding the physico chemical homogeneity of the whole Shroud were made without any pro or anti Wilson bias and, clearly, these results show that the face region of the Shroud was never more exposed to light, air, dust and dirt than any other parts of the cloth. I think the outcome of these findings is pretty evident regarding Wilson’s hypothesis! And here’s a final message to all the fanatics of Wilson out there: if you don’t like this reflection of mine, blame it on Rogers and Adler! I’m sorry for you but I simply followed the road they traced with their solid observations… Effectively, if we accept the results of their analyses as being professional, honest and scientifically sound, then there’s just one acceptable conclusion to draw: on the base of the physical and chemical observations they made, the Mandylion hypothesis of Wilson simply CANNOT be true! PERIOD..","date":"2013-02-21","mins":"9:26 am","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights"},{"id":"comment-13926","author":"yannick_clément","post":"We have already talked about that subject. In my mind, C14 dating is just one tool among many other tools that are avalaible to date an object. And versus the Shroud, it is now clear that the C14 dating was not representative of the main body of the cloth. Right now, no one can be sure of the true age of the cloth (scientifically speaking), even if we have many good indication that it is a very ancient linen that can well be of the same era than Jesus of Nazareth….","date":"2012-07-17","mins":"4:42 pm","url":"https://shroudstory.com/2012/07/17/paper-chase-sturps-fascinating-1988-draft-protocol-for-future-examinations-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Paper Chase:  STURP’s Fascinating 1988 \"Draft Protocol for Future Examinations of the Shroud of Turin\""},{"id":"comment-11043","author":"yannick_clément","post":"You should read “Rogers was ready” in my last comment… Sorry..","date":"2012-05-01","mins":"4:50 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11042","author":"yannick_clément","post":"Yes, that’s my opinion Ron. Unless someone can PROVE me that the Shroud come from some unnatural event, I will keep my feet on the ground and look for some chemical natural phenomenon(s) to explain the images. It’s not because I believe in the resurrection of Christ that I have to believe the image on his Shroud come directly from it. Read again all the STURP papers and you’ll see that possibility that the image could come from a supernatural event was almost absent of them (except maybe the paper of Jackson who tested many image formation hypothesis including radiation). And the argument that the hypothesis of Rogers cannot explain all the characteristics of the image cannot ruled out every possibilities that the image could have been formed naturally (involving some chemical phenomenon). I’m not sure that Rogers was reading to really discard his hypothesis on the basis you mention. The fact is that he didn’t had enough time to fully test his hypothesis… Also, did you ever thought that his hypothesis could only be PART of the solution and other chemical processes could have been present also ? There’s still many natural possibilities that have not been fully tested yet. Until that day come, I will still push in that direction… like almost every STURP member and as any good scientist should..","date":"2012-05-01","mins":"4:48 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11159","author":"yannick_clément","post":"Of course, this possibility should be examine more closely but I seriously doubt that some kind of Seismic Activity could form an image on a piece of linen that would be found ONLY on the topmost fibers of the cloth !!! Somebody will have to have to show me some samples made in laboratory that can be compared to the Shroud… Personally, I don’t think this hypothesis have any chance whatsoever to be the answer to the mystery of the Shroud… I just don’t see why, for example, the body image created on a contact point between the cloth and the body would not be found more deeply into the cloth than another body image of a body part that was not in direct contact with the cloth. I’m sure you understand what I mean ! And how in the world an event like that would created a body image with the same degree of intensity over AND under the body ? Do you really think the body weight would have absolutely no effect on that kind of image formation mechanism ? To me, this whole hypothesis seems highly unlikely… But, as I say, since it is a “natural” hypothesis, I think science should analyze it properly to see if there’s any chance that this could help to answer some questions about the Shroud. Gabriel said : “I don’t know what the image formation mechanism is nobody does 100% for sure but these are the kind of preliminary works (like other ways of determining the origin and datation of the Shroud beyond C14) that in my opinion deserve further research.” I agree with this point of view and would add some other research area outside the one concerning the body image formation that could be great regarding the Shroud. One example of that : If I was a biochemist, a medical expert or a forensic expert, I would try to verify if it is possible to recreate perfectly in laboratory (using a linen cloth, a real human body and real blood clots) the physical aspect of the bloodstains we see on the Shroud, i.e. The “undisturbed” nature of those bloodstains and the linen fibrils under it. In other word, that would be great if some expert can confirm Pierre Barbet’s opinion that this undisturbed nature of the bloodstains and the linen fibrils under it is scientifically impossible to obtain in the context of the removal a dead body from a linen shroud when that body is covered with lots of dried blood clots that have stuck to the linen surface. I would love to know if there’s any possible condition in which the removal of a dead body from a linen shroud could leave bloodstains with the same physical nature than those on the Shroud. I don’t believe it is possible, but that would be great to get a scientific confirmation of this. I think that could be a very interesting forensic investigation… Don’t you think ? I’m sure this question has never been scientifically explored yet !!!.","date":"2012-05-05","mins":"7:26 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11166","author":"yannick_clément","post":"I just express what I think. It’s seem to me an idea more or less ridiculous. But I’ll promise you I’ll read the paper..","date":"2012-05-05","mins":"11:22 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11185","author":"yannick_clément","post":"I prefer to listen to a top notch chemist who is maybe the person who knew the Shroud the better ever from a pure scientific point of view. Remember that this guy was the lead chemist of Los Alamos for 35 years and he spent 5 days and nights with the Shroud in Turin. When a guy like that say that the body image is not a result of some kind of electric discharge, you know what ? I have a tendency to listen ! If you never read Rogers book, I hope you will in a near future… As I’ll do with the paper of De Liso..","date":"2012-05-06","mins":"8:32 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11182","author":"yannick_clément","post":"One last thing about the hypothesis of the image being created by some Seismic Activity… The main reason I have so much doubts about that thing is the fact that, in Ray Rogers mind, those kind of hypothesis involving some form of electrical discharge (this hypothesis is close to the one defend by Fanti) CANNOT be considered as valid options to explain the body image on the Shroud. Sorry, but since Rogers knew the Shroud very well and also knew electrical discharges very well, I have a strong tendency to believe his judgement about those kind of hypothesis. Daveb, I just want you to read Rogers book and you’ll understand why I’m so skeptical about those hypothesis… But don’t worry, I’ll read the paper of De Liso anyway….","date":"2012-05-06","mins":"7:11 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11004","author":"yannick_clément","post":"Why in the world a return to the spiritual realm would have to be accompanied with some kind of energy release like light, nuclear energy, electric discharge, thunder, drumbeat, sounds, angels signing, etc. ??? Have you ever thought about the real simple possibility (like the God I know is simple) of just a disappearing of the physical body of Jesus from this material world ? Just that. A disappearing of his body from this material world… Without sound, without light, without energy released (why energy should be released anyway ???). Beside Hollywood movies and our imagination, there’s absolutely no indication that there was anything spectacular that was going on at the exact moment of the resurrection of Christ. And if there was nothing more than a Shroud who became empty and nothing else ??? Would you be disappointed ? I think this deserve some thoughts….","date":"2012-04-30","mins":"1:00 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-11213","author":"yannick_clément","post":"This is Fanti’s opinion. Fanti is NOT a chemist and surely not as worthy of the term “scientist” as Rogers was… Of course, anyone can believe Fanti’s conclusions BUT I prefer to trust someone who spend 5 days and nights with the Shroud and who was a true expert in chemistry. That’s my opinion. But I know it isn’t the one of the Shroud clique….","date":"2012-05-08","mins":"8:27 am","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-14263","author":"yannick_clément","post":"I have been blessed to see a copy of a drawing done by Gonella himself showing that, exactly has Rogers said, he took for himself some threads right in the middle of the sample (I mean in the middle of the whole complete single sample that was originally cut) used for dating the Shroud in 1988. Since that day, I have absolutely no doubt at all concerning the validity of Rogers sample that hallowed him to proof that the corner used for dating the Shroud was not representative of the main cloth. Rogers was not a liar and that drawing from the hand of Gonella himself was the best proof of that. Unfortunatelly, since the Anti Rogers crusade rages on in the Shroud world since he died in 2005, some people have tried very hard to discredit Rogers credibility, and the validity of his C14 sample was one sorry episode with a sad purpose like that among others… Final note : Trust me, Rogers sample was exactly what he said it was : a sample of a few threads that were kept by Gonella in 1988 and that come right from the middle of the whole C14 sample. These few threads (if I remember well, Rogers received 2 of them) were probably taken when the whole sample was cut in 2 pieces, one for reserve and the other for the C14 labs. So, you can sleep well tonight, Rogers samples were totally valid to challenge the C14 result of 1988. No matter what the Anti Rogers clan can think or make believe, this is another perfect proof of the rigor, profesionalism and honesty of Raymond N. Rogers. I know this because I’ve seen the drawing done by Gonella in 1988….","date":"2012-07-27","mins":"10:41 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","title":"Savage Treatment in Randi Land"},{"id":"comment-89725","author":"yannick_clément","post":"The only thing we’re sure is the proven fact that the C14 corner was non representative of the main cloth and in the end that’s all that matter… The question of what really caused this discrepancy is secondary. I dream of the day when the scientific community and the Vatican, because of this proven fact, will agree to move on and go ahead with a new C14 dating better done with multiple samples taken from different parts of the cloth after being sure those samples are really representative of the main cloth..","date":"2014-03-16","mins":"7:27 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-11038","author":"yannick_clément","post":"Pure imagination… I understand what you say about reference to light versus God, but I don’t think there’s any proof of that on the Shroud. If Ray Rogers was still alive, he would agree with me about that..","date":"2012-05-01","mins":"3:33 pm","url":"https://shroudstory.com/2012/04/30/paper-chase-new-paper-challenges-rogers/","cat":"carbon_14_dating","title":"Paper Chase: New Paper Challenges Rogers"},{"id":"comment-89727","author":"yannick_clément","post":"I should have written this instead: “The question of what really caused this discrepancy is secondary and I even seriously doubt that someone will ever be able to prove what this cause (or, more probably, causes) really was (were). When it comes to the Shroud, the question of contamination (whether it is chemical or physical) is truly a complex one because there are a lot of unknown regarding the way it was kept over the centuries.”.","date":"2014-03-16","mins":"7:32 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-90047","author":"yannick_clément","post":"Independently, Adler and Rogers have found solid pieces of evidence that this corner was anomalous and not just a bit. That’s enough for anyone intelligent to ask for a back up test done with more than one sample (and samples proven to be representative of the main cloth). Do you have a problem with this logic? I don’t know why someone should be offended if the Vatican decide to ask one more C14 test to be done in order to confirm or not the one made in 88..","date":"2014-03-17","mins":"10:44 am","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-90128","author":"yannick_clément","post":"The reweave is only a hypothesis for the moment and it’s not proven yet. But that’s not important in order to cast serious doubt on the validity of the 88 dating. What matters is this: never mind if there really was a medieval reweaving or not, the fact remains that Adler and Rogers (independent of each other) analyzed threads taken from the C14 corner and found huge chemical and physical difference there in comparison to the samples that were taken elsewhere on the cloth by STURP. That is a solid and proven fact. And that’s well enough to go on a new C14 dating done more properly this time and on various samples. That’s the only thing that really matter..","date":"2014-03-17","mins":"3:21 pm","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-6575","author":"yannick_clément","post":"To study the subject deeply, here’s an advice : Start with Shroud.com Go to the scientific papers and articles page and then, read and reflect. It’s a hard task because the subject is so vast and complicated, but it’s also fascinating….","date":"2012-01-05","mins":"4:05 pm","url":"https://shroudstory.com/2012/01/05/tom-chivers-has-an-opportunity-to-do-some-real-investigative-journalism/","cat":"carbon_14_dating","title":"Tom Chivers has an opportunity to do some real investigative journalism"},{"id":"comment-6594","author":"yannick_clément","post":"I want to report one important comment I’ve read this summer in a French book published about the Shroud and who came from one of the best expert in ancient textile in the world today, Christophe Moulherat, from the Museum of Fabric in Lyon, France. Here’s what M. Moulherat had to say about the possibility that a repair can be invisible : “No, it’s always visible, because WE HAVE THE MEANS TO SEE IT. All is needed is to do an in deep analysis. But to do that, you got to have access to the cloth and don’t observe it with the naked eye, because then, WE DON’T SEE NOTHING, OR ALMOST NOTHING. It needs microscopes.” Then Perrier, the author of the book, state rightly : “This is the kind of exam that was planned by the STURP.” Note : well before the C14 dating of 88, STURP asked the Turin authorities to do a second round of direct tests on the Shroud, along with a well plan C14 dating, but they were sadly taken out of the whole process ! Perrier continue : “This is not what was done by Gabriel Vial and Franco Testore (note : the 2 textile experts that were present in 88 when they took the sample to be dated), who discovered the Shroud only the exact morning when the sampling procedure was done. This is quite incredible, but, even if the dating project took years to be put in place, they waited until the last day to choose the place were the sample was taken, WITHOUT USING A MICROSCOPE.” Then, Moulherat said : “If we have non representative yarns with a will to hide the thing, we first have to think about it and BE EQUIP IN ORDER TO SEE THIS. If it’s not the case, and if the repair is well done, WE CAN PASS BY. IT REALLY NEEDS A FINE ANALYSIS.” Perrier conclude the point by saying : “So, you have to avoid to make it in a hurry with a simple magnifying glass, like it was done in 1988 in Turin.” I think this part of Perrier’s book says it all !!! Except that I would add this : In the STURP C14 procedure, there was a CHEMICAL ANALYSIS planned before the dating but none of the 3 C14 labs involved in the 88 dating did that. And what is the result of this kind of amateur procedure ? The medieval date given to the press in 88 with an exclamation mark at the end !!! So, when you understand the point of view of Moulherat, and when you’re aware of the findings of Rogers published in January 2005, then, how a person with a brain can still think that the C14 result is reliable ??? It’s a joke really….","date":"2012-01-06","mins":"9:29 am","url":"https://shroudstory.com/2012/01/05/tom-chivers-has-an-opportunity-to-do-some-real-investigative-journalism/","cat":"carbon_14_dating","title":"Tom Chivers has an opportunity to do some real investigative journalism"},{"id":"comment-90366","author":"yannick_clément","post":"Personally, in the light of the results of analysis obtained by Adler and Rogers on samples taken in C14 corner area and considering the facts that there is a missing part adjacent to the C14 sample area and that it is historically proven that this area was handled a lot during history, I think we can’t discard both hypotheses (contamination and reweaving) right now….","date":"2014-03-18","mins":"9:02 am","url":"https://shroudstory.com/2014/03/16/so-was-the-small-arizona-piece-in-doug-donahues-custody-ever-made-available-to-barrie-schwortz/","cat":"carbon_14_dating","title":"So, was the small Arizona piece in Doug Donahue’s custody ever made available to Barrie Schwortz?"},{"id":"comment-6595","author":"yannick_clément","post":"If you’re a relative new commer to this topic, then my advice to you is good. This topic is so complex that if you really want to go deep into it, you don’t have choice : you got to read alot of scientific papers on the subject. That’s all I say. I don’t know why you react so bad. It’s just an evidence I point out..","date":"2012-01-06","mins":"9:31 am","url":"https://shroudstory.com/2012/01/05/tom-chivers-has-an-opportunity-to-do-some-real-investigative-journalism/","cat":"carbon_14_dating","title":"Tom Chivers has an opportunity to do some real investigative journalism"},{"id":"comment-6653","author":"yannick_clément","post":"Good comment Gabriel. I think you touch one important point that can well explain why the Church seem to have put the Shroud in the shadow for the moment. I think this kind of “preaching” by what I called “the supernatural fringe of the pro shroud world” (the heart of the preaching being that the Shroud is a material PROOF of the resurrection, which is NOT TRUE AT ALL) is one major reason why the Vatican want to let the dust drop a bit before permitting any new series of direct research on the cloth. Pretending that a material object can scientifically proof the resurrection goes against the official Catholic theology. So, because this kind of preaching seem to gain in proportion since the 1988 radiocarbon dating (and I personally think the situation is getting worse and worse as years go by), I don’t think we’ll see any new direct test being allowed by the Church for a pretty long time. I’m sure the Church is a bit affraid that some scientists from the supernatural fringe could take some foundings that would come from a new series of researches and used those data to push forward their little agendas. I’m sure the Church don’t want that to happen and that’s one major reason why there’s nothing that happen these days. The other major reason is the big critics (well deserved I have to say) that the Church have faced after the 1988 radiocarbon dating and the 2002 restoration. I think after that, the Church officials just thought : maybe it is time to forget about the Shroud for a moment… Message for Dan : I think my letter expressed well my point of view on those ENEA’s experiments, so I don’t think I need to write a direct response to Jones comment. Of course, I disagree with him !.","date":"2012-01-07","mins":"7:23 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6730","author":"yannick_clément","post":"Ron you said : “Whether or not the ‘means’ of the resurrection is a catholic concept or not, means nothing in the study of the Shroud anyways.” And what do you think of that : “Whether or not the man on the Shroud is Jesus of Nazareth SHOULD means nothing in the study of the Shroud anyways.” This is a burial cloth that SHOULD be considered as an archaeological piece of cloth like any other ancient pieces of cloth and study with decent science like it if it was the burial cloth of Julius Cesar or someone like that, and not to be studied with some science fiction based on the imagination of some “true believers” as Ray Rogers called them ! That’s what I think..","date":"2012-01-09","mins":"4:54 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6729","author":"yannick_clément","post":"Ron you ask : “Why not just bury the thing in the vatican vaults, never to be seen again?” Simply because the Vatican respect the people and want them to be able to see the relic in person from time to time (once every 25 years or so). But at the same time, like I said before, they don’t want to use it as a banner to convert people. To me, that’s the reason why they don’t show it more often. They surely don’t want to be accused of proselytism !!!.","date":"2012-01-09","mins":"4:49 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6731","author":"yannick_clément","post":"Rogers called them the “true believers”. You know how I called them ? The supernatural fringe !!! : ).","date":"2012-01-09","mins":"4:56 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6688","author":"yannick_clément","post":"Just to conclude on the topic of the official Catholic theology regarding the Shroud versus the resurrection, I just want to report one very interesting comment I’ve read this summer. It come from Jean Michel Maldamé, a dominican theologian from France. Here’s what he said about the possibility that the Shroud could offer some material proof of the resurrection of Jesus : “It is absurd from the theological point of view ! The word “resurrection” would then lose its sense and would be distorted. This would be a MATERIALISATION OF THE RESURRECTION (note : it’s me who underline) and it’s contrary to the theology teached by the Church. There’s only traces of the resurrection in the gospels and in the testimonies of the apostles.” I agree completely with this position, except that I would add : There is also a trace of the resurrection in the heart of the believer ! But on the Shroud ? Personally, I don’t think so. As I said before : A sign of it, yes (to be found in the undammaged blood stains), but a scientific proof of it, no. That’s what I think and anybody can think otherwise of course..","date":"2012-01-08","mins":"7:38 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6734","author":"yannick_clément","post":"Rogers once used the term “true believers” in a sarcastic way and he borrowed it from another scientist (one who believe the Shroud offer a proof of the resurrection) who once told him : “Ray, you’re not a true believer !” or something like that, just because Rogers didn’t agree with him that Shroud could offer any proof of the resurrection. That’s what Barrie Schwortz told me once. I hope I didn’t deform too much the reality but that’s the way I remember what he told me… I agree with your comment to some extend Ron. Bias is present in the pro Shroud and anti Shroud circles, mainly because of a faith or philosophical reason. You wrote : “This is not JUST a Caesar or Tutankhamun tunic!” It’s true from OUR perspective of believers, but I don’t see any good reason why a real scientist that rely only on the known laws of the universe should see the Shroud differently than if it was the reported Shroud of Caesar with a body image on it ! This is one of the major problem in Shroud science and that’s why I pray that the next research team that will be allowed to study the relic will only have agnostics members ! One more thing I want to say is that many people tend to look at the Shroud and immediately think about the resurrection while the Shroud is nothing more than a burial Shroud that point directly to the Passion and death of Christ instead. That’s another major problem with Shroud research ! Some scientist seem to only think “resurrection” in their researches while I don’t think we can really understand the Shroud if we focus on another thing than the fact that it is a burial Shroud of someone who’ve been beaten, scourged and crucified. We have to always remember that it is the only thing we can see for sure after the STURP investigation : It is an authentic burial cloth of a real crucified man. Personally, if I was a scientist, that’s where I would look to search for an explanation. It’s not any burial Shroud, it is the burial Shroud of someone who has been in a very high traumatic state. That’s one important thing we have to always keep in mind, instead of searching for explanations that relied only on extrapolations, suppositions and speculations. There was a traumatized corpse in that Shroud and he stayed there for less than 36 40 hours. That’s the only thing we know for sure and any credible scientist who want to study the Shroud properly should start there and never forget this important fact..","date":"2012-01-09","mins":"5:52 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-7017","author":"yannick_clément","post":"And you will make me believe that those “scientists” who pretend that the Shroud images came from “some type of burst of energy” are completely free of any religious preconceptions ? You want me to believe that ? Let’s check out a short list of those scientists (those that I know the best) : Di Lazzaro : a good Italian catholic Fanti : a good Italian catholic Jackson : a good American catholic (or protestant, I’m note 100% sure but I think he’s catholic) Rinaudo : a catholic priest !!! The list goes on and on and on ! Find me ONE, just ONE scientist who proposed a “supernatural” hypothesis for the image formation and who is, at the same time, a complete atheist or a complete agnostic, and then I’ll start listening… It’s almost impossible to find one scientist who proposed a “supernatural” hypothesis that is not, in some way, driven by his own personal faith. Almost impossible. In that sense, I will forever have great doubts about their integrity in regard of their hypothesis… And it’s the same thing for a lot of historians in the Shroud world… Never underestimate the danger of bias when it comes to scientists who believe in the resurrection of Christ ! There’s so many bad example of that, can’t you see ?.","date":"2012-01-15","mins":"8:46 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6814","author":"yannick_clément","post":"Relax Ron ! Of course, for me and you who believe in Christ, the Shroud mean more than a simple burial Shroud !!! OF COURSE ! But what I wanted to state is that, from a STRICT SCIENTIFIC POINT OF VIEW, forgetting the religious aspect of it, this cloth SHOULD be examine as any other archaeological artifact. That’s what I was saying. The resurrection question, since we know nothing about the way it was done, should be left out of the question when someone wants to study scientifically this object. Rogers understood that, but sadly, we cannot say the same for many other “scientists” in the Shroud World. When a scientist left his religious feeling interfered with his scientific research, he just put one step OUTSIDE the science field ! Last comment about the meaning of the Shroud : the Catholic church agree with me that, way before the resurrection, the Shroud point out in the direction of the Passion and death of Christ. The resurrection can ONLY be seen with the eyes of faith, while anybody (no matter if he’s a believer or not) is able to see the Passion and death of Jesus when he look at this cloth….","date":"2012-01-11","mins":"12:25 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-7018","author":"yannick_clément","post":"One last comment about the scientists who believe in Jesus Christ : Outside the subject of the Shroud, I have NO doubt about the profesionnalism of those scientists. It’s only when they do their science with the Shroud that I have serious doubts about their objectivity. We have to understand that it’s VERY HARD for someone to put his faith in his back pocket when he do some scientific work about the Shroud. VERY HARD ! And I don’t think there’s many scientists who have been able to do that over the years….","date":"2012-01-15","mins":"8:50 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6662","author":"yannick_clément","post":"I know the Catholic teaching well enough to know that resurrection is only a term of faith that cannot be proved scientifically. There’s nothing in the gospel or in the letters of the New Testament to support a burst of radiation or a burst of UV light or a corona discharge or something similar. There’s no scientific data found by the STURP team that can really support the ASSUMPTION that a burst of radiation, a burst of UV light, a corona discharge or something similar had anything to do with the body images. All these kind of ideas are only based on the ASSUMPTION that the resurrection of Jesus SHOULD have produced a burst of some form of energy from his body. Personally, I found this idea close to the New Age philosophy or something like that and I’m fully aware that it was propagated by Hollywood movies. One thing’s for sure : this whole idea is not a catholic concept..","date":"2012-01-07","mins":"9:42 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6656","author":"yannick_clément","post":"I am a Catholic and I know pretty well the official thinking and teaching of the Vatican… And I repeat it for Ron and others : there’s NOTHING in the official theology of the Catholic church that support the emission of some kind of energy at the moment of the resurrection that would have left some material traces that science could proof. NOTHING. All this idea about some energetics by products of the resurrection that would be responsible for the body images on the Shroud are a simple view of the mind, accentuated by Hollywood movies… This whole idea simply had no concrete theological or scientific bases. Period. Of course, people are free to believe what they want to believe, but it is just that : a belief. It has no real scientific base and it is off track versus the official theology of the Church….","date":"2012-01-07","mins":"8:42 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6663","author":"yannick_clément","post":"Talking about the C14 dating, Ron you said : “It was not just irresponsible and unprofessional but also very suspicious!” I agree that it was irresponsible and unprofessional but I don’t think there was any kind of “conspiracy” to falsify the date or something like that. This decision to change the protocol at the last moment was most probably done because they were affraid that the relic could be “damaged” or his appearence could be “changed” if they permit 3 or more samples to be taken in many places. I think that’s the main reason for this fiasco. And you also said : “Irresponsible media reports have been coming out all along for decades, from both sides. It can’t be that or that SIMPLE.” I THINK IT CAN WELL BE THAT RON ! The Church have been so criticized after the radiocarbon dating that they probably thought that it was a good idea to wait until the restoration was achieved before telling anything to the media. Also, you have to remember that it could also has been made for security reasons because, to do the job, the authorities were forced to move the Shroud (probably for the first time since World War II) outside the Cathedral of Saint John the Baptist. You have to think about that my friend !!!! I’m sure it was one major reason why they did not tell anything to the press before the work was complete. The Vatican have no agenda regarding the Shroud. Maybe Turin have one (maybe some economic agenda), I don’t know. But the Vatican don’t want to used this relic for any purpose at all, and surely NOT to convert anybody to Christian faith with it. If it was the case, they would act very differently, you can bet ! The Church consider this object as a Holy Icon as it should be, since science is not able yet to proclaim without any doubt the authenticity of the relic as the genuine Shroud of Jesus of Nazareth. And before this could be done (will this be the case one day ? I’m really not sure about that), the Vatican position will forever be the same : It is a Holy Icon of the Passion of Christ. Note that they never say that this is a Holy Icon of the RESURRECTION OF CHRIST !!! What do you think of that ??? And what is the main purpose of any religious icons ? To make us the believers reflect upon a Christian subject. That’s it. That’s the official position of the Vatican as it should be..","date":"2012-01-07","mins":"10:01 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6603","author":"yannick_clément","post":"AMEN !.","date":"2012-01-06","mins":"1:56 pm","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","title":"What did Christopher Ramsey Know"},{"id":"comment-6728","author":"yannick_clément","post":"Ron, you seem like another fan of the conspiracy theory ! My security hypothesis makes a very good sense since it was the first time since World War II they had to move the Shroud out of his normal location. And I just want to remind you that they did the same kind of move during World War II, i.e. In total secrecy ! So, you can see that it wasn’t the first time the Turin authorities operated a move of the Shroud in secret. Look like it is part of their “normal” procedure. You seem also to forget that this restoration task took weeks to be completed ! Don’t you think the authorities wanted to give a very quiet working time for the textile experts who did this job of precision ??? Logically, it is the most logical answer. I think I would have done the same. But the big mistake the authorities made was to do no proper scientific consultations with chemists, archaeologists, etc. Prior to the restoration. That’s the problem regarding this restoration. Not the secrecy. They could have made some kind of “secret” consultation with a small group of experts in ancient textile (along with one or two experts on the Shroud) before the job and that would have been fine..","date":"2012-01-09","mins":"4:45 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them"},{"id":"comment-6342","author":"yannick_clément","post":"The thing that I don’t understand his why Ramsey said what he said in the David Rolfe documentary (that the C14 result of 88 was really questionnable) and now, he seem to have completely changed his mind. Is it due to the possible failure of the hypothesis of John Jackson regarding a possible increase of the level of C14 in the Shroud fibers due to Carbon monoxide ? I know he worked with Jackson and, reading Ramsey’s last comment, it seem that Jackson hypothesis has been discard by him. Maybe that’s why he seem to have changed his mind about the possibility that the C14 result of 88 can be wrong ? If it is so, then I think he made a mistake because there’s others viable hypothesis out there, like the french invisible reweaving..","date":"2011-12-30","mins":"9:07 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-6525","author":"yannick_clément","post":"Quote : “Plus doesn’t the point You yourself mention above about the “particular” seam (dating the Shroud to the 1st century), put this medieval Jewish craftsmen in serious doubt???” Good remark. Effectively, it look like it does. But again, we cannot completely disregard the possibility that this supposed medieval Jewish craftmen could have known this very particular kind of seam that seem to really be Jewish in style (if we believe what Flury Lemberg told us). But I agree that this possibility is really thin. But, for the discussion, I think it’s fair to keep this possibility in mind. And I think the high probability that the Shroud came from the 1st century Palestine come from the whole picture of the situation and not from just one or two aspect taken in isolation..","date":"2012-01-03","mins":"8:42 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-6695","author":"yannick_clément","post":"I think I didn’t express myself quite clearly ! I never wanted to say the the linen strips were sewn back on in the tomb ! I wanted to say tha the side strip was sewn back to the main part of the Shroud a very short time after those 2 parts were separated by a cut. I was talking about the side strip here and not the linen strips ! I agree with you on the fact that since it was an incomplete burial rite done on friday, the participants were in a hurry because of the Sabbath and the Passover that was coming and they most probably left the strips of linen in one place in the tomb, without using them for tied up the Shroud. Why they would have to tied the Shroud on friday since they knew they add to come back to finish the job on sunday morning ? Why I think the side strip was sewn rapidly to the main part of the Shroud ? Because the FACT that the body image is precisely in the center of the actual Shroud ! That’s the main reason why I think the side strip was already sewn back with the main part of the Shroud when the body of Jesus was laid in the cloth. When you see the high quality of the blood stains, you have to consider the fact that the Jews who participated in the burial partial rite on friday were REALLY careful ! It really seem to me that they were almost maniacs regarding the details of the rite. I don’t think I’m wrong by saying that the Jews of that time were particularly meticulous. In that context, if the side strip wasn’t there in the tomb, that would mean they would have placed the body not perfectly in the center of the cloth. Of course, when you’re in a hurry, it’s possible that it happened. But I don’t think so. Since the actual body image on the Shroud is right in the center of the cloth, I think it’s more probable that it was the actual configuration of the Shroud in the tomb when the body was laid into it. That’s my own little analysis of the probabilities concerning the side strip..","date":"2012-01-08","mins":"9:29 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-6526","author":"yannick_clément","post":"And for the exact nature of the seam and of the side strip, I think like you, except for the most probable moment when the 2 pieces of material (coming from the same big sheet) were sewn together. Because the banding effect we see everywhere on the Shroud continue almost perfectly from the main Shroud to the side strip, I think the cutting and sewing was done almost at the same time. One thing I really think is that the present state of the Shroud was probably the same when the disciples discovered it in the empty tomb, i.e. That the side strip was probably already sewn beside the main part of the cloth. But we cannot forget the possibility that there was another side strip on the other side and that this strip was taken away afterward for unknown reasons, possibly to sell relic pieces. This possibility is surely there, but since the body image on the Shroud is almost perfectly centered in the cloth, I have a tendency to think my idea is correct : The present state of the Shroud (speaking of it’s textile aspect only) is most probably the same that it was in the empty tomb..","date":"2012-01-03","mins":"8:53 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-6696","author":"yannick_clément","post":"Actually Ron, I have to disagree with you on this other topic. But that doesn’t mean I agree with Max !!! ; ) I think the chapter 20 in St John can be understand in different ways. Personally, the translation I favored the most (because I consider it in the light of the chapter 11, i.e. The raising of Lazarus) is that the disciples found the tomb empty on easter morning with the linen cloths that would have contained the mix of aloes and myrrh still in place on the rock tablet where the body was laid in the Shroud and what St John report as a “sudarium” folded in another place was actually the Shroud of Turin. I think this way to see John description makes more sense when you consider chapter 20 along with chapter 11. Having said that, I want to state that this way of understanding St John doesn’t mean one bit that the Sudarium of Oviedo is not genuine. I think there’s a great probability that is is in fact genuine, but I don’t think St John talked one second about this stained cloth in his gospel. We have to remember that the ancient people used many words to describe a burial shroud and “sudarium” was among those terms, along with “sindon” which is a more “correct” term, technically speaking. But even if “sindon” is more accurate, that doesn’t mean that nobody in those days was using the term “sudarium” as a way to describe a burial Shroud. In fact, in St John’s native language, the Aramaic, Shroud was pronounced “Sudara”. So, for someone used to think in Aramaic instead of Greek, I think it is fair to assume that he could have used the term “Sudarium” to speak of a burial Shroud. And if you compare the terms that St John used in the chapter 20 with those he used in chapter 11, you see that “sudarium” has a more logical meaning in the chapter 20 is we assume he was reffering to the Shroud of Turin. Imagine one second that St John entered in the tomb and found only the linen cloths containing the aloes and myrrh at the place where the body was and then, boom !, he see the Shroud but in another place in the tomb and nicely folded !!! I think that was the “set up” he wanted to describe and he wanted to let us know that the fact that the Shroud was nicely folded in another place was THE sign for him that Jesus was resurrected ! Effectively, if there was some people who would have come to stole the body, NO WAY they would have take time to remove the Shroud from the body and fold it nicely and left it in the tomb !!! For St John, that was the “proof” (meaning a “sign”) that Jesus was really resurrected. That’s the way I see this part of St John’s gospel. Again, I’m like an outsider here because I know that the majority of people think like you on this topic but I don’t care ! I think if it is so, it’s simply because people didn’t thought to consider chapter 11 of St John in their analysis and also because they were kind of fooled by the presence of the Sudarium in Oviedo… Just a fact to support what I’m saying about the use of the term “sudarium” by the ancient people : in the numerous relic lists I’ve talked about from Constantinople (dating mostly from the 11th and the 12th century), there are some writers who used the term “sudarium” while there is a good probability that they were talking in fact about the Shroud of Christ !!! This is one major example for you to understand that it was common use for those people to interchange terms like that when they were talking about burial cloths. Look, even today in french, we have the same exact situation !!! Effectively, we have 2 different words that are often interchanged to talk about the Shroud of Turin : “Suaire” (that mean “Sudarium”) and “Linceul” (that mean “Shroud”). But even if “Linceul” is the correct term to speak about the Shroud (like “Sindon” in Greek), a lot of people still used the more general term “Suaire” to speak about the Shroud (like “Sudarium” in Greek). That’s exactly the same thing with St John in my opinion : He used the more general term “Sudarium” to designate the Shroud while he should have used the better technical term “Sindon” instead. And that’s what have caused this great confusion that still rage today !!!!!!.","date":"2012-01-08","mins":"9:57 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-6388","author":"yannick_clément","post":"The only agenda I can see is that he want to defend at all cost the reputation of the Oxford C14 lab. But again, why did he seemed to be more open in the David Rolfe documentary about the possibility that the test was wrong after all ??? I don’t have a sure answer for this. Maybe he was drunk that day ??? Of course, it’s a joke here. ; ).","date":"2011-12-31","mins":"8:13 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-6389","author":"yannick_clément","post":"Someone told me that this cubit measurement has to be taken with great prudence because it looks like we’re still unsure of the exact lenght of that measure. I think there was even many different lenght for one cubit regarding of the place where you were. Also, I think this kind of measurement could have varied from time to time. Again, it’s just something I’ve heard and I’m not sure… But I think we have to be prudent anyway with this aspect of the question, even if I think the Jacksons can be right about that. Anyway, I think there 2 more solid clues that were find on the cloth that confort the possibility that the Shroud came from the 1st century Palestine : 1 The very particular seem (1st century jewish style) that was found by Flury Lemberg during the restoration of 2002. 2 The aragonite dirt that was found in the right heel region (as I remember) and that chemical tests showed that it there’s a good probability that it came from the Jerusalem area. I tend to rely more on those 2 facts than on the cubit clue….","date":"2011-12-31","mins":"8:26 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-6348","author":"yannick_clément","post":"It is written : C.R. Bronk in the article. So, maybe his real name is “Christopher Ramsey Bronk” instead of “Christopher Bronk Ramsey” ???.","date":"2011-12-30","mins":"9:19 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-10882","author":"yannick_clément","post":"Personally, I would say that since the Shroud is a real burial Shroud that covered a real crucified man with all the stigmata of Jesus Christ (including the crown of thorns that was not common for a crucified viction) and that the type of injuries due to the scourging possessed definately a Roman signature, that’s well enough to invalidate the C14 dating, unless you think that a medieval forger would have scourge (with a Roman flagrum), beaten and crucified a man in order to produce a Christian relic. And if you really think that this is possible, you will have to answer the question why this anonymous forger would have departed so far from the artistic tradition of his time by showing a nude Christ with injuries to the head looking like cap of thorns instead of the traditional headband and with a nail wound in the wrist instead of the traditional nail in the palms !!! If we use Ockham razor, the simpliest and most likely answer for the Shroud is this : It is exactly what tradition say that it is, i.e. The real burial Shroud of Jesus of Nazareth. With all the data we know about the Shroud since 1978, I don’t think there’s another answer who can be near to the truth than this one, even if there are some other possibilities (see my recent open letter about the blood evidence). The fact is that those other possibilities are much harder to defend in face of all science know now about the Shroud. Consequently, those other possibilities are very unlikely. And I must say that the findings of Rogers published in 2005 are complitely coherent with my way of thinking. Another C14 dating will be needed in the future to finally know the exact age of this cloth. While we wait for this to happen, I don’t think it is very imprudent to think the Shroud is 2000 years old. All the other scientific evidence, beside the C14, point in that direction….","date":"2012-04-27","mins":"10:48 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-6445","author":"yannick_clément","post":"That’s very possible Ron but I’m sure you already thought that this is not a clear age indicator for the cloth ! In fact, some Jewish cloth craftman could have know this kind of measure during the Middle Ages and could have easily reproduced them for a false Shroud of Christ he would have made during that time. And in fact, for all we know, this craftman could have done his work in Europe or elsewhere outside Palestine ! So, the cubit thing is for me a simple clue that is maybe relevant but I wouldn’t bet my house that this aspect of the question is a clear proof that the Shroud is 2000 years old and was manufactured in Palestine. The 2 others evidences I talk about are way more “solid” in my opinion… Question about this 4 X 2 cubit measurement for the Shroud : Do you think this prove that the side strip was add to the main part of the cloth in order to make a cloth with precise measures ??? Maybe that was done to respect some ancient Jewish prescriptions ??? Very possible, don’t you think ? I would like to hear other people’s opinion on this topic..","date":"2012-01-02","mins":"12:04 am","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","title":"What’s in a name, Christopher Bronk Ramsey?"},{"id":"comment-10928","author":"yannick_clément","post":"I understand what you mean Paul but I have to disagree a bit with your argument. I think my argument versus the bloodstains offering a proof that this cloth was a real burial shroud of a crucified man is much more solid to discard the idea that the Shroud could be some artwork of any kind. Why I say that ? Simply because science cannot completely discard the possibility that the Shroud was really created by a forger using a “natural” and chemical formula to produce it, instead of using some kind of artistic technique. Like I said in my recent open letter : The Shroud can be a real burial shroud of someone who suffered the same tortures than Jesus, but who cannot be Jesus of Nazareth because a forger produces it “naturally” (without using any art technique). Science can completely reject any artistic technique hypothesis, but not completely reject the hypothesis that it was created by a forger using a natural chemical technique (with some chemical recipe that was kept secret by him and that we don’t know today). I know that sound odd, but on a strict scientific base, we cannot completely reject this possibility. And if this is really what happen (the “if” is very important here), than it can be “normal” that nobody has even been able to reproduce it, even today. In fact, I don’t think every possible chemical formulas involving a corpse and a burial shroud (made with the ancient method) has been fully tested yet !!! So far, science is able to reject any artistic technique for the Shroud, but is not able to completely reject the very unlikely possibility that I just describe. So, a very slim door is still open for the idea of a genious forger (who would have not be an artist but more of a chemist). Personally, I don’t believe this hypothesis, but to be fair and honest, I don’t think we have the right to totally reject it..","date":"2012-04-28","mins":"8:31 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-10921","author":"yannick_clément","post":"The fact is this : Even if an artist or a forger could reproduce artificially the Shroud body images, no one can artificially reproduced the bloodstains. Conclusion : The Shroud is NOT any kind of artwork. Period. Argue otherwise is as dumb as thinking the Universe was created about 6000 years ago, like the Creationists do in USA or to believe the earth is flat !!! That was the main point of my recent open letter about the evidence of the bloodstains but it seem obvious that certain people will never get it. Sad but true !!!.","date":"2012-04-28","mins":"5:42 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-10973","author":"yannick_clément","post":"My point is this : If the Shroud body images were created (on purpose by a forger or not at all) naturally while some chemical phenomenon(s) were going on at the surface of the cloth from the interraction between the corpse in the Shroud and a thin layer of sugar impurities, I think it’s pretty normal that science has not been able to reproduce exactly those body images. It’s not an easy task to find the proper “chemical recipe” to accomplish this and also, to find all the environmental conditions that prevailed at the moment those images were created. The fact that science is not able to recreate something today doesn’t necessarily mean this object came from an act of God ! This would be a great error to think that way. NATURE CAN BE VERY SURPRISING SOMETIMES… That’s why we must left a (very) little opening to the possibility that the Shroud was created by a forger while using a crucified body and a Shroud prepared the old fashion way and who knew that, in some particular conditions, a body image would be formed at the surface of the cloth naturally, because of some chemical phenomenon(s). I know this scenario is highly unlikely, but scientifically speaking, it is “possible” anyway. I don’t think this door will ever be completely closed..","date":"2012-04-29","mins":"7:43 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-10977","author":"yannick_clément","post":"Maybe Paul but… you have to let this opening open anyway when it’s time to analyse all the possibilities. As I said in my open letter, this is the ONLY POSSIBLE WAY that a forger could have created the Shroud (forget any kind of artwork) and that possibility is, as you say, very thin. Conclusion : the forgery hypothesis regarding the Shroud don’t seem to be able to explain the presence of this cloth properly..","date":"2012-04-29","mins":"8:25 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"},{"id":"comment-10890","author":"yannick_clément","post":"M. Colinsberry have only 2 possibilites that is left open to him if he DOESN’T want the Shroud to be the authentic Shroud of Jesus of Nazareth : 1 It is a real burial shroud of someone who suffered the same tortures than Jesus, but who cannot be Jesus of Nazareth because a forger produces it “naturally” (without using any art technique). 2 It is a real burial shroud of someone who suffered the same tortures than Jesus (but who was not Jesus of Nazareth) and was produced by some undetermined natural phenomenon(s). In this case, it would be a purely accidental ressemblance. Beside that, you can forget about some kind of a scorch, some kind of a painting, some kind of a rubbing, etc. The Shroud is not an artwork of any kind. The evidence of the bloodstains alone is well enough to understand that. So, which one of the 2 very unlikely possibilities describe above do you favored the most ??? : ).","date":"2012-04-27","mins":"4:43 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","title":"When History Trumps Science"}]
