[{"id":"comment-18004","author":"yannick_clément","post":"By the way, one last precision: It is COMPLETELY FALSE to pretend that Maurus Green was supporting Wilson’s hypothesis, at least from what we can read in his 1969 paper ! Sadly, it’s true that he left the door open for this wild hypothesis (he must have turned around in his grave since ! He he !) but that’s not the only possible hypothesis he mentioned in his paper… Pretending that this particular article offer a real support to Wilson’s hypothesis would be wrong, completely wrong..","date":"2012-10-21","mins":"7:52 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-27683","author":"yannick_clément","post":"No one will argue with what you just said Ron. At least, certainly not me!.","date":"2013-03-18","mins":"3:46 pm","url":"https://shroudstory.com/2013/03/15/barrie-schwortz-on-beyond-belief-and-coast-to-coast/","cat":"event","title":"Barrie Schwortz on Beyond Belief and Coast to Coast"},{"id":"comment-31439","author":"yannick_clément","post":"Personally, I would say this : science is simply man’s attempt to EXPLAIN how God’s creation works (the question is “how”) while religion is simply man’s attempt to EXPLAIN the profound meaning of God’s creation (the question is “why”). Both are truly important but should not never be mixed together because both are not located on the same level and are not trying to answer the same question..","date":"2013-04-20","mins":"7:27 pm","url":"https://shroudstory.com/2013/04/20/barrie-schwortz-science-is-simply-mans-attempt-to-understand-gods-creation/","cat":"event","title":"Barrie Schwortz: Science is simply man’s attempt to understand God’s creation"},{"id":"comment-18001","author":"yannick_clément","post":"Moise of Khorene account refers most probably to a painted portrait of Jesus face and this account was most probably based on the Doctrine of Addai which clearly refers to a painted portrait of Christ ! Wilson’s hypothesis about the Mandylion is wrong. Period. No credible Byzantine scholar has ever agreed with Wilson’s fantasies to sell books and this fact speaks louder than anything else….","date":"2012-10-21","mins":"7:19 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17441","author":"yannick_clément","post":"M. Freeman, don’t forget that the Shroud IS REALLY a real burial cloth of a real crucified man (whether it be Jesus of Nazareth or another criminal). Science has proven this since the STURP team examination of the cloth in 1978. Did you read my paper on the subject ? Here’s the link : http://shroudnm.com/docs/2012 07 26 Yannick Clément The evidence of the bloodstains.pdf I think you should read this. Once you’ll be convinced (I hope so !) by the evidences I present that this is really a true burial cloth of a real crucified man who bears all the stigmata of Jesus of Nazareth as reported by the Gospels, then I will ask you this simple question : WHY THIS SHROUD CANNOT BE THE REAL SHROUD USED FOR TO COVER THE CORPSE OF JESUS ON FRIDAY EVENING ??? Or even more than this, I think it’s even better to ask yourself the question I wrote at the end of my paper : If the man of the Shroud is not Jesus, than who is it ??? One thing’s for sure : there was a real crucified man under that cloth and some undetermined interactions between the corpse and the cloth produced a body image on the top surface of it. That’s what science can tell for the moment… Starting from this solid conclusion, I truly don’t think there is one better option than to the one that consider the Shroud as the genuine Shroud of Jesus of Nazareth… I’m currently working very hard on a paper about this particular (and complicated) question and right now, the only other “plausible” option I found is the one that would involve a “natural” kind of forgery done after the finding of the True Cross by Constantine’s mother and before the apparition of the first known Pantocrator like face of Christ (the Christ in Majesty mosaic in Ravenna) at the very beginning of the 6th century by someone who would have tortured and crucified himself (with maybe the help of some collaborators) an unwilling victim in order to reproduce the burial Shroud of Christ. In front of all the known data and facts about the Shroud that we know, this is, to me, the only alternative scenario available, but I have to say that it is much more unlikely than the one that consider the Shroud has what tradition report it to be, i.e. The authentic burial Shroud of Jesus. That’s where I stand right now after a very long reflection….","date":"2012-10-10","mins":"4:51 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-18000","author":"yannick_clément","post":"I found his explanation to be very convincing. So it’s 1 1..","date":"2012-10-21","mins":"7:15 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17514","author":"yannick_clément","post":"One last complementary comment versus my previous one : If a new official and proper C14 dating of both the Shroud and the Sudarium would give a similar result of, let’s say 4th or 5th century, then I have to admit that the “natural” forgery scenario would greatly gain in credibility and the idea that the Shroud could be the real Shroud of Jesus of Nazareth would greatly lose on the probabilistic scale… That’s a true possibility, even though I still favored greatly the hypothesis that the Shroud and possibly also the Sudarium (I have to admit that I’m less convinced of the authenticity of this particular relic) could be the genuine burial cloths of Jesus. But to know the truth once and for all about the identity of the Shroud man, the Vatican MUST allowed a new C14 dating of both the Shroud and the Sudarium of Oviedo. No doubt that if this could be done (properly done this time!!!), that would be awesome for our knowledge concerning these 2 cloths..","date":"2012-10-11","mins":"2:40 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17499","author":"yannick_clément","post":"Here’s my reply to comment #24 of M. Feeman : M. Freeman, I understand perfectly your historian point of view and at first sight, it’s far from being stupid. But I would really like if you can read my paper (see the link to it in my previous comment). I think after reading it, you would have no choice than to accept the FACT that the Shroud is a real burial shroud of a real crucified person. From your comment, I can detect that you already think that way to some extend but I wonder if you still think that it can also be the work of an artist. If we could at least agree on this FACT that the Shroud is a real burial cloth of someone who’ve been crucified and who shows all the stigmata of Christ, then that would be a very good thing. Once we accept that fact, the possibilities to explain the Shroud drop drastically ! See my paper… From my perspective, because of that FACT, there are only 2 possible scenarios that doesn’t involve Jesus Christ and that still can pretend to explain the Shroud rationally : 1 It is a “natural” forgery involving the use of a real crucified corpse (something like what you describe in your comment) or 2 It is the Shroud of an anonymous criminal that have been crucified by the Romans and the body image and the bloodstains are showing a purely accidental ressemblance with the Jesus of the Gospels. My upcoming paper on the subject will focus on this second hypothesis and I will show in details that the chances for this scenario to be correct are almost unexisting. So, because of this conclusion that I get after a long analysis, all we’re left with his the first scenario involving a “natural” forgery. But this forgery, in my opinion, cannot have been done after the beginning of the 6th century because of the Vignon’s study that have clearly show a great congruence between the Ravenna mosaic and the facial image on the Shroud. Because of this important conclusion of Vignon, I don’t see how the Shroud and his natural body image could have been forged “naturally” after the creation of this mosaic between 500 and 547 A.D. !!! From the minute you understand that the image on the Shroud is not the product of an artistic forgery, you have to conclude that this image MUST have been present prior to the creation of this mosaic (which is the most ancient artwork that show such a high degree of similitude with the facial image on the Shroud). Effectively, how in the world a forger that would have used a real crucified corpse to do his false relic could have create it after the apparition of this mosaic ??? It’s totally irrational ! Imagine the stroke of luck he must have had in order to find an unwilling victim that would have look so much like the depiction of Jesus on this mosaic !!! First of all, if we still want to believe in such a scenario, we have to assume that this forger was aware of that particular artwork or another similar artwork (like the Pantocrator icons or the Image of Edessa) and we have to assume that he was lucky enough to find someone with a big beard and long hair that look pretty much the same !!!! Or, alternatively, we have to assume that the forger wasn’t aware of these artworks and was so lucky that the victim he choose was looking like these depictions ! In both cases, I estimate the probability to be almost 0 %. Also, we must never forget that some of the Vignon’s marking include particular features visible on the linen cloth itself ! In that context, how in the world the artists who did these artworks could have reproduced such particularities if they were not working with a model of Jesus face that would have been made directly from the Shroud ? It’s almost impossible to think they would have create such particularities just from their imagination without any model from the Shroud… Because of all this, I estimate that if such a “natural” forgery really occurred, it must have been made BEFORE the beginning of the 6th century and most probably after the Edict of Milan in 313 and also most probably after the discovery of the True Cross by Helena (ca. 326). To me, that’s the only possible range of dates for this kind of “natural” forgery scenario. And because of that, I’m truly convinced that if a new C14 dating would be done properly with samples coming from the main body of the Shroud, the result would be prior to the 6th century and I’m truly confident that it would be around the first century A.D. For the simple and good reason that I presently estimate the probability for such a “natural” forgery to have really occurred to be highly unlikely for a number of good reason that would be too long to describe here and that I intent to describe in a future paper. In my mind, it’s much easier to believe that the Shroud is the real Shroud of Jesus than to believe in such an improbable scenario involving a “natural” forgery….","date":"2012-10-11","mins":"1:01 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17442","author":"yannick_clément","post":"When I said “or another criminal” in the first line of my previous comment, I think I should have written “another victim” instead (because of the only plausible alternative scenario that I’ve described). This term would be much better in my mind and I wanted to set the record straight versus my previous comment..","date":"2012-10-10","mins":"4:53 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17519","author":"yannick_clément","post":"M. Freeman, here’s just a very rapid reply : Once you understand that the Shroud is an authentic burial Shroud of a real crucified man and once you come to the conclusion that there is only 2 rational way to explain the Shroud (i.e., 1 It is the authentic burial cloth of Jesus of Nazareth or 2 It is a “natural” forgery involving the use of a real crucified man), then how in the world can you still believe that a forger could have found a person with a big beard and long hair that would look almost exactly like the Pantocrator styled depictions of Christ from the 6th century onwards ???? I found this idea totally ludicrous… The level of congruence between the facial image of the Shroud and these artworks analyzed by Vignon is simply too high to believe in such an irrational scenario. The Pantocrator styled Jesus and the face of the Shroud man is much too similar, sorry. And concerning these other few depictions of Jesus that you mention and that were done prior to the 6th century (there are some also in the catacombs of Rome : did you noticed that all these early depictions of Jesus with long hair and a beard ALL seems to have been done in Rome ? Strange isn’t it ?), have you noticed that the face of Jesus is far less similar to the facial image on the Shroud than what was found by Vignon concerning the artworks he analyzed that were dated from the 6th to the 12th century ? To me, that’s a clear indication that you’re right about the fact that these early Roman depictions of a bearded Christ with long hair that were done between the end of the 3rd century until the 6th century maybe, were most probably influenced by the Greco Roman Gods like Zeus, Jupiter and others or by the traditional depiction of the classical philosopher, instead of being influenced by the Shroud or by a model made directly from the Shroud. So, in my opinion, from the history of art, I think we can only say with a very good level of confidence that the Shroud had some kind of influence on the depictions of Christ ONLY from the beginning of the 6th century onwards and probably not before. So, because of this, we can only conclude that the Shroud and his image was most probably already existing around 500 A.D., which is, by the way, a date that fits right into the alternative dating (1000 B.C. 700 A.D.) given by Ray Rogers from the lack of vanillin in the linen fibers of the Shroud. So, from a pure scientific point of view, and when we analyze all the data and facts from the Shroud, I think this is the most honest conclusion we can get for the moment, i.e. That the Shroud of Turin and his image was most probably present at the very beginning of the 6th century and that it had some kind of influence (direct or most probably indirect) on the apparition of the Pantocrator style depiction of Jesus and on the so called miraculous imprints of Jesus face that surfaced during the second half of the 6th century. In the end, all these artworks influenced by the facial image on the Shroud have greatly contributed to fix the image of Jesus in the mind of the faithful until this day. Note : There is one particular fresco that was found in the St Marcellinus and Peter catacombs in Rome and which date from the second half of the 4th century that I consider to have been potentially influenced by the facial image on the Shroud. It’s not a definitive conclusion from me, but this particular depiction of a bearded Christ with long hair is much more similar with the Shroud’s facial image than all the other Zeus like Christ that were made in Rome from the end of the 3rd century until the 6th century or maybe later… In my mind, I think we should leave the door open from the possibility that this particular artwork of Jesus (which is, by the way, the first known Christ in Majesty artwork ever to be found !) could have been influenced directly (or most probably indirectly) by the Shroud’s facial image and if that’s correct (this is just a possibility for the moment), then that would mean the Shroud and his image was most probably already existing around 350 A.D. Or so., which is a time right after the discovery of the True Cross by Helena… Does that mean that the Shroud could be a “natural” forgery done in the footsteps of that great “discovery” ? Who knows ??? That’s possible, even though, as I said before, I consider this hypothesis highly unlikely for the moment. But as I also said, if another C14 test on the Shroud would give a 4th century result (the “if” is important because we’re very far from there), then I would agree to raise the level of probability for such a scenario… And I have to admit that there’s nothing in all the data and facts we have from the Shroud that can really and scientifically discard the possibility that the Shroud could have been a “natural” forgery done between 313 and 500 A.D., not even Rogers alternative dating ! And we also have to remember that this particular era saw the apparition of a great number of Christian relics (some of them associated directly with the Passion of Christ, like the Sudarium, the Spear, the Sponge, etc., etc.). That’s why I leave the door open for this particular hypothesis, even if I favor much more the scenario which considers the Shroud to be the authentic burial cloth of Jesus, because it’s also important to understand that there is absolutely nothing in all the solid data and facts coming from the Shroud (I don’t mean the 1988 C14 dating, which was scientifically showed to be non representative of the main body of the cloth) that really can discard the idea that this burial cloth of a real crucified man could not be the authentic Shroud of Jesus ! That’s where I stand right now after a very long reflection. I think we’re stuck with these 2 very different hypotheses and only a proper dating of the cloth would help to settle this issue once and for all. I think me and you, we both agree on that !!!!.","date":"2012-10-11","mins":"5:05 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17521","author":"yannick_clément","post":"Another message for M. Feeeman and all the others who might be interested by the 2 C14 dating of the Sudarium of Oviedo that were done in 1990 and 1992. Here’s a page from Stephen E. Jones in which you can find the whole story surrounding these 2 unofficial dating that gave 2 results not far from each other with a global average date of 708 A.D. : http://members.iinet.net.au/~sejones/quotes/T So T/stuc1201.html Go read that ! It’s a very good summary of the situation….","date":"2012-10-11","mins":"5:13 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17520","author":"yannick_clément","post":"Last thing : I never heard the story before about the fact that AB blood only appeared around 900 A.D. !!! Where did you get that ? I’m certain that this point of view is not shared at all by an expert like Kelly Kearse. I will ask him about that in a near future and I hope to give you his point of view….","date":"2012-10-11","mins":"5:11 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17559","author":"yannick_clément","post":"Quote from M. Freeman that is addressed to me : I am sorry if I have missed this in your many postings but where do you think the Shroud was when it was first copied and can you confirm the date when you feel it was copied. Thanks. That will help us explore the context in which the Vignon markings may or may not have spread. My answer : I have no precise idea ! Nevertheless, I would assume that this artistic depiction of Jesus face that served as a model for the Pantocrator like artworks of the 6th century onwards was most probably made shortly prior to the first depiction of that kind and presently, the first known depiction is the one in the Ravenna Basilica. So, I guess this artistic model would have been made around 500 A.D. Of course, this is just a wild guess from me and have no historical value. Honestly, I don’t think we’ll ever know the truth about that but for me, I don’t see any other rational explanation for the Pantocrator like artworks of the 6th century onwards than to think they were made from an original artistic model of Jesus face that was done by an artist who had the chance to look very closely at the body image on the Shroud… Since we know for a fact that the Shroud is not an artwork of any kind, this is the only rational way to explain the apparition of all these Pantocrator like images that present a so high level of similarity with the facial image on the Shroud (far more than what we can expect from pure hazard). Again, the idea that a forger could have been lucky enough to find an unwilling victim for his natural forgery that would have look almost perfectly like the Pantocrator images is just totally irrational and doesn’t get a great score on a probabilistic scale… That mean one important thing : the Shroud and his image MUST have been already existing ca. 500 ! That’s why I’m truly confident that if a new and proper C14 dating could be done on the main body of the Shroud of Turin, the result would most certainly give a middle date that would be prior to 500 A.D. And like I said, in my mind, this middle date would probably be around the first century A.D. Since the very best (and most rational) hypothesis to explain the Shroud in face of all the known data that come from the Shroud is what tradition have always report it to be : the authentic Shroud of Jesus of Nazareth. That’s where I stand in my reflection about that particular relic. Nevetheless, I can’t say the same thing for all the other relics associated with Christ… My level of confidence concerning their potential authenticity is in general much lower than for the Shroud and in the particular case of the Sudarium, I would say that I don’t know what to think for the moment (it looks like a 50/50 kind of thing !!!)..","date":"2012-10-12","mins":"5:02 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17420","author":"yannick_clément","post":"The same is also true for the Sudarium of Oviedo, which was unofficially tested with C14 2 different time and gave 2 results roughly similar of around 700 A.D. I don’t understand the Church to reject at least the idea of a new series of C14 dating (done properly this time with at least 3 samples of each cloth taken from 3 different areas of the cloth) for both the Shroud and the Sudarium. No doubt that these tests would improve greatly our quest for truth concerning both relics..","date":"2012-10-10","mins":"1:02 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17639","author":"yannick_clément","post":"Response to Max : THERE IS ABSOLUTELY NO HISTORICAL INDICATION THAT THE SHROUD OF TURIN EVER SPENT ONE DAY IN EDESSA… Response to M. Freeman : Read again my comment #37 above (https://shroudstory.com/2012/10/10/bsts meeting reminder/#comment 17519). You’ll see that I was already referring to the fresco in the St Marcellinus and Peter catacombs as an artwork (which would be the most ancient if that’s true) that could possibly have been influenced by the Shroud of Turin directly OR BY AN ARTISTIC MODEL made from it (which is the hypothesis I favored the most). I agree with you that, because all the first Shroud like depictions of Christ are located in Italy, we can think that the Shroud could have been present there at the time, but I think this is far from being proven because of the other hypothesis I just raised. Effectively, we can think that only an artistic model of Jesus face made directly from the Shroud was able to reach Italy before 500 A.D. (and maybe as soon as the second half of the 4th century if the fresco from the St Marcellinus and Peter Catacombs really was influenced by this possible model). One thing’s for sure in my head : the Shroud and his image was certainly already existing in 500 A.D. And at least one artist was able to make a depiction of Jesus face from the facial image that is present on the cloth..","date":"2012-10-14","mins":"8:11 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17640","author":"yannick_clément","post":"The contamination problem is certainly an important issue regarding a possible new series of test but it certainly not a reason to avoid doing it!!!! And so far, concerning the test of 1988, the only confirmed problem is a probable medieval repair that was done in that particular corner of the cloth. All the rest of the potential contaminations factors have never been proven to have had any influence whatsoever on the result obtained by the C14 labs… I’m pretty confident that if a new dating would be made with 3 threads taken in 3 different parts of the main body of the cloth and if the labs would make a very intense verification and cleaning of these samples (more intense than what was done in 1988), then we would probably obtain an age for the cloth that would be pretty close to the reality. Don’t forget that an unauthorized and preliminary C14 test was done before the 1988 official dating of the Shroud on one single thread and it gave 2 different results (200 A.D. And 1000 A.D.) for each ends of the thread. If this was due to a splice or something like that (that’s possible because I think this thread came from the Raes sample), then it’s truly possible that the rough date of 200 A.D. Could be very close from the true age of that cloth (which is probably around 30 A.D.). Anyway, I think the Church should allowed a new series of C14 dating for both the Shroud and the Sudarium (and maybe also the Tunic of Argenteuil in France). It’s about time that we know if these relics have good chances to be true or false… I’m sure this will be done someday..","date":"2012-10-14","mins":"8:25 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17433","author":"yannick_clément","post":"I disagree with your vision Anoxie. There are well enough evidence that this whole corner of the cloth (including the reserve piece) where the sample was taken in 1988 is non representative in many ways with the main body of the Shroud. Why losing time with another C14 test in this same anomalous zone ? 3 more samples should be taken in 3 different zones of the cloth with a preliminary check up of the zones chosen to be sure there is not anything wrong with these area and a following microscopic and chemistry verification of the samples to make sure again that they really represent the main body of the cloth. And if I was the Church, I would avoid to choose the charred material that was removed during the 2002 restoration as one of the three sample. Way too much dangers of contaminations there… Each sample (much smaller than the big one that was cut in 1988) should not be divided in three like the other time but each one should be given to three different top notch C14 labs with a clear, complete and proper protocol to avoid at the max the risk of anomalous results. That’s what I think and I also think the same for the Sudarium..","date":"2012-10-10","mins":"3:49 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17746","author":"yannick_clément","post":"Here’s a message to M. Charles Freeman : Yesterday evening, I had the pleasure to read your newest paper “Tetradiplon – The Mystery Solved?” and I want to congratulate you for this excellent description of your hypothesis, along with a direct, simple and clear rebuttal of Wilson’s wild hypothesis !!! 1000 times congratulation for this great paper !!! After the reading, I said to myself : If someone read this paper with no preconceive notion about the Shroud’s obscure past, it’s impossible for this person to still favored Wilson’s hypothesis as the best possible explanation for the lack of reference to a Shroud of Christ with an image on it prior to 1204 !!! IMPOSSIBLE… Your demonstration of Wilson’s weakest points is very easy to understand, even for someone who have almost no notion in history. And if this person complete his reading with my own paper about all the problematic facts related to Wilson’s hypothesis (here’s the link to it: https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment questions about the mandylion hypothesis of wilson 2012 06 28.pdf), I think such a person will never favored this weak hypothesis again… I particularly appreciated the example you gave of a great pro Shroud bias we can find in the Shroud World versus Wilson’s hypothesis when you shed lights on what Scavone has sadly and wrongly written concerning the use of the word “sindon” in the Acts of Thaddeus. Many months ago, I had the pleasure to write on this blog a direct reply to Scavone’s trial to destroy the credibility of my critics concerning Wilson’s fantasies. It was a pure pleasure for me to noticed that you were as critical as me versus Scavone’s totally erroneous (and evidently biased) way to interpret the use of the word “sindon” in the context of the Acts of Thaddeus ! I said to myself : “Gee ! Finally, M. Freeman’s comment versus Scavone is a great proof that I surely wasn’t off track in my own critics of his personal interpretation concerning the expression “sindon tetradiplon” in particular (among other erroneous interpretations he made concerning other ancient manuscripts related to the Mandylion) ! So again, bravo for this critical paper that clearly shows how much disgusting bias is going on in the pro Shroud world versus Wilson’s fantasies. I would add this : Such evident bias just served well all the anti Shroud skeptics on the planet by giving them all the ammunitions they need to look at the pro Shroud researchers as a bunch of religious fanatics full of bias, not worthy of being called “scientists” and consequently without any credibility whatsoever… It’s sad because I’m truly convinced that there are still some scientists in the Shroud world who are really doing an honest quest for truth, but unfortunately, it’s rarely these persons that are on the frontline of Shroud research and gets much of the attention of the public. Consequently, the international scientific community have a great tendency to consider sindonology as a joke without any sense of credibility. On this particular subject, I really appreciate this comment you wrote in your paper: “Sadly, his account (Wilson’s hypothesis) has been accepted uncritically by many of his readers and even now if you put ‘tetradiplon’ into a search engine, you will find accounts suggesting that the Image of Edessa, with its face of a living Christ, was actually part of the folded burial shroud of Jesus that, it is claimed, still exists today as the Turin Shroud.” THIS IS SO TRUE and that’s the main reason why I’ve started my own crusade against this hypothesis of Wilson because after having done my homework, I’m now 100% convinced that this hypothesis is completely wrong and should be set aside. Unfortunately, and that’s one thing you forget to mention in this part of your paper, Wilson’s account concerning the Mandylion has not only been accepted by a good portion of the English speaking shroudies but sadly and this is much worst, it has been accepted blindly by a good portion of the sindonologists themselves (most of them having no historian formation) !!! That’s the saddest thing that’s going on for years in the pro Shroud world and it’s completely disgusting to see. All this look to me as a big propaganda operation that his in fact a very big joke for anyone who know how to do a proper and unbiased historical research on the subject… And the only way this bad joke could end would be for the sindonologist community to publicly acknowledge that Wilson’s idea is most probably false and that we should look elsewhere in order to find the TRUTH about the Shroud’s obscure years. Unfortunately, these days, this is exactly the opposite that’s going on ! Just look at the pro Shroud persons like Jones and Marinelli who have recently tried hard to defend Wilson’s hypothesis AT ALL COST, even though they are not historians ! These sad examples make me think that this big joke is not going to end soon in the Shroud world and it’s very sad to note because it shows that the authentic quest for truth is not what drives the majority of the sindonologists… I dream of the day when all these biased scholars will get out of the way in order to gives more space to all the Shroud researchers who simply wants to find the truth versus the Shroud (people like you M. Freeman, and I must give thanks to Dan and his blog for giving you the opportunity to share your work with the pro Shroud world). And that mean seeking the real truth, whatever this could be, including the possibility that still exist for this cloth to simply be the product of a “natural” forgery done by someone who would have used a real crucified body in order to reproduced the burial cloth of Christ. Note that if this hypothesis is true, it’s most probable that this gruesome creation would have been done shortly after the finding of the True Cross by Helena and the beginning of what we can call the “Christian false relic business” in the Middle Eastern Church (which is an historical fact)… Of course, this is just a possible hypothesis, along with the other one that claim the Shroud to be the genuine burial cloth of Christ and I don’t want to give the impression that I support it. But because I only seek the truth regarding this relic, I MUST keep the door open for that possible scenario, along with the other one that consider the Shroud to be no more than the burial cloth of someone else than Christ who would have been executed by the Romans in the same manner… Acting like this is a proof of unbiased reflection and it’s sad to note that it’s far from being the norm in the pro Shroud world ! Finally, concerning your own hypothesis to explain the use of the word tetradiplon, I think the fact that the word was used ONLY BEFORE the cloth was given to Jesus in order that he could wash his face with it (you underline it many times in your papers, as it should) is one good point in favor of your hypothesis because historically, this is exactly what was going on in some Pagan or Christian ceremonial rituals. Of course, unless there would be new discoveries in some Syriac or Greek manuscripts related to the story of Abgar and the Image of Edessa, I doubt that your idea would reach one day the level of a confirmed theory, but at least, I have to say that I never read before a more rational hypothesis concerning the use of this particular word. And in the end, the most important thing to note in your paper is your very good hypothesis concerning the question of why the author of the Acts of Thaddeus used this unknown and very odd expression to talk about the Mandylion, i.e. Because he simply wanted to gives this miraculous cloth a “special status”. Honestly, this is by far the best explanation I’ve read concerning this question, because it’s the most simple and rational that exist once you put yourself in the historical context of this anonymous author. So, in conclusion, I have nothing else to say, except : Bravo and keep on your good work !!! In the Shroud world, we need more people like you who are honest enough to seek the truth and not their own little truth (which is far from being the same thing) !!! It’s only when most Shroud researchers will act as you do (i.e. With integrity, honesty and an open mind that has no fear to seek the real truth, even if this truth can be something else than you first thought and could consequently force you to change your mind) that we will get closer to the truth regarding this relic and his potentially authentic status. Yannick P.S.: At the beginning of your paper, you wrote this : “Why did these acheiropoieton images first appear in the sixth century? It seems possible that there were the first intimations of iconoclasm and there was a powerful need for evidence that Jesus had ‘authorised’ images of himself by transferring the image of his face onto a cloth (see Hans Belting, Likeness and Presence, Chicago, 1994, p. 56). In order for this idea to have any credibility a legend had to be created to give the sixth century image a history in Edessa that took it back over five hundred years to the time of Jesus.” Even though I also raised the same possible explanation during my own research, there is another possible answer that I tend to put alongside this “anti iconoclast” explanation and it is the historical fact that, during the second half of the 6th century in Edessa (which is the most probable time when the Image surfaced in the city), there was at least 3 different Christian groups, i.e. The Orthodox, the Nestorians and the Monophysits (who were an heretic group who denied the dogma of the 2 natures of Christ: human and divine, related with the whole orthodox concept of the Incarnation). I first encountered this hypothesis in the very good paper of Maurus Green about the Shroud’s obscure years (here’s the link for this paper: http://www.monlib.org.uk/papers/aj/aj1969green.htm) and he said that it was Vignon’s own hypothesis to explain the apparition of the Image of Edessa during that time. In short, this hypothesis maintain that this image of the face of the living Christ would have been created in order to back up the dogma of the 2 natures of Christ against heretic groups like the Monophysits who were well established in Edessa. So M. Freeman, have you ever consider this alternative possibility to explain the apparition of the Image in Edessa at that particular moment, which was well before the official beginning of the Iconoclastic period in 726… What do you think of this possible solution? Note that what’s the most interesting thing about this hypothesis is the fact that later on (during the 7th century I think), there are some texts who states that the Monophysites themselves desperately wanted to put their hands on the relic. In fact, they would have finally succeed and they would have put it in their chapel to venerated it ! It’s possible that the original plan of the Orthodox Church by creating this relic and insert it in the Abgar legend as a miraculous imprint of Christ would have finally return against them ! Effectively, if this is true that the Monophysits wanted to get and venerated this relic, it’s probably because for them, it wasn’t at all a proof of the 2 natures of Christ but instead a proof of their own heretical dogma which pretended that Christ only had one single divine nature… Interesting hypothesis isn’t it ? I really wonder what you think of this. Personally, I think it’s truly possible that these 2 different reasons (both linked with the historical context of the time in Edessa) could be correct in the end and both could have had an important influenced on the decision of the Orthodox Church to create this co called “miraculous” imprint of the face of the living Christ..","date":"2012-10-17","mins":"10:43 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17762","author":"yannick_clément","post":"What would be even greater is if one day in the pro Shroud world, most people could forgot about Wilson’s fantasies and start proposing other possible hypotheses that could explain the lack of ancient written or artistic references concerning a Shroud of Christ that would bear his body image and bloodstains until ca. 1200 in Constantinople… That would be awesome, especially if that would be done by credible historians and not a journalist like Wilson who only publish his “work” in the books about the Shroud that he sell in popular libraries !!!.","date":"2012-10-17","mins":"4:40 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17793","author":"yannick_clément","post":"Yes Max, I saw your post. You must acknowledge one simple thing : In all the ancient manuscripts, there is NO mention at all that a Shroud of Christ was ever present in Edessa. That’s what I ment. Now, if you want to speculate, it’s up to you and you will not be the first and probably not the last !!! But that’s not the proper way to do history..","date":"2012-10-18","mins":"8:30 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17792","author":"yannick_clément","post":"M. Freeman, it would be very interesting if you could verify for yourself the possibility that the Image of Edessa was created by the Orthodox clergy of that city during the second half of the 6th century to fight against the Monophysit heresy that was pretty strong there. In the paper written by Maurus Green in 1969 about the Shroud’s obscure years, here’s 2 quotes where he described this particular hypothesis (you’ll see that some important historians agreed with this scenario) : 1 “Eastern politics being so intermingled with theology, the Edessan Icon was inevitably dragged into both. Dobschiitz and Runciman believe that it was used in the sixth century by the Orthodox clergy of the city to oppose the monophysites who tended to deny the reality of Christ’s human nature. The “self portrait” of Christ was a convincing weapon against such views, despite the fact that later the monophysites made sure of their own copy of the Image.” 2 “A special feature of this iconographic evidence is the evident likeness of the isolated head of the Shroud to the Mandytions. With long hair, staring eyes and absence of neck, it almost seems to be their negative. Could this similarity, coupled with the anomalies common to both, give us the moral certainty that the Shroud was the unique acheiropoietos, kept, as Vignon believed, in some monastery easily accessible to the theologians and artists of Edessa? For centuries it was a holy, but mysterious and embarrassing relic; suddenly, under pressure from the Monophysites, the Orthodox Clergy realise the role that could be played by a copy of the Face of the Shroud, if turned into a living portrait of Christ. The climate was right in the sixth century with the decline of relics in favour of icons. The Abgar legend with Ananias5 role as painter was to hand. All that had to be done was to have a copy made on cloth, “process” it by incubation, give it a plausible miraculous origin and the desired weapon was there to confound the Monophysites, put the Persians to flight and become in course of time the most holy Mandylion. Have we here then the unique source of all “true likenesses”, Veronicas, Epitaphioi and the “figured shrouds” of the West?” This potential explanation for the origin of the Image of Edessa deserves to be verified more deeply by credible historians of the present day. So, I really hope you’ll be one of them !!! Who knows what your research about this hypothesis could uncover ? Personally, because of the probable fact that the Image surfaced in Edessa after the middle of the 6th century (well before the official start of the Iconoclastic period), I have a tendency to favored this hypothesis over the one you proposed in your last paper (the one linked with the idea that the Image of Edessa could have been created to fight against some early Iconoclasts in the Orthodox Church). As I said in my previous comment, it’s truly possible that both hypothesis could be correct to some extent, but I tend to favored the one that his based on the theological battle that was ragging on in Edessa during the second half of the 6th century between the Orthodox Church of that city and his dogma of the 2 natures of Christ and the Monophysits and their idea that Christ only had a divine nature and his human nature was just an appearance of humanity and nothing else. In reality, this particular Christian philosophy was part of a more general philosophy called Gnostic philosophy who always tend to denied the human nature of Jesus Christ… Finally, as I said before on this blog and in my paper against Wilson’s hypothesis (see fact #20 in my paper: https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment questions about the mandylion hypothesis of wilson 2012 06 28.pdf), if the Image of Edessa would have really showed the Shroud’s bloody face, there’s absolutely no doubt at all that the Monophysits would never have tried to get this Image and venerated it, because the gruesome and bloody aspect of the facial image on the Shroud show in great details the human nature of Christ, which goes completely against their philosophy !!! No doubt that if the Monophysits of Edessa would have put their hands on such a relic of Christ, they would have destroyed it ! And on the contrary, there are some historical evidence that they have venerated it !!!! This is another very good indication that the Image of Edessa was nothing more than an image of only the face of the living Christ. Of course, you will never find anything concerning this fact in Wilson’s books about the Shroud and the Mandylion ! So, it’s up to you M. Freeman but if I was you, I would certainly do some research about this very promising hypothesis… In the end, I can say that such a scenario is truly promising and I favored it because it is grounded in the historical context of the second half of the 6th century in Edessa. Note: As I said in the description of the fact #20 you’ll find in my paper, the information concerning the fact that the Monophysits once kept and venerated the Image of Edessa during the 8th century come from an ancient manuscript entitled “Chronicle” written by Michael the Syriac (A.K.A. Michael the Great). I think this would be a very good starting point for you M. Freeman if you ever decided to make some researches concerning the possibility that the creation of the Image of Edessa was mainly due to a theological fight between the Orthodox Church of Edessa and the Monophysit community living in that city. Also, here’s another interesting suggestion for you: I think it would be very nice if you could analyze in deep the recent presentation that Wilson did this summer at the Shroud congress of Valencia in Spain about his Mandylion hypothesis versus the Shroud’s early history. If you didn’t download this presentation yet, here’s the link to the paper : http://www.shroud.com/pdfs/wilsonvtxt.pdf. And here’s the link to the Powerpoint presentation: http://www.shroud.com/pdfs/wilsonvppt.pdf. I’ve read the paper and found an incredible number of wild speculations, extrapolations and very special assumptions link with other things not related necessarily to the sindon tetradiplon expression ! It’s important to note that the sindon tetradiplon expression is only one aspect of Wilson’s argument in favor of his hypothesis concerning the Mandylion… In sum, I really think that if you could make a proper analysis of this whole presentation of Wilson, it would be a nice critical exercise that would show all the erroneous things that’s in there. People interested in the Shroud (whether they are pro Shroud or not) DESERVE to know how wild and sometimes ridiculous the hypothesis of Wilson really is and only a real historian like you can do this with credibility. Of course, I could did this kind of critical analysis myself, but since it would be me, people around here will only throw me tomatoes and some will even not listen at all !!! ; ).","date":"2012-10-18","mins":"8:28 am","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-17999","author":"yannick_clément","post":"Ha ha ha !!!! Increble how pro Shroud people are biased toward Wilson’s fantasy. IT IS PATHETIC and do not deserve more comment from me. I’m just sick and tired to lose my time versus close minded persons who don’t want to see what is as obvious as the nose in anyone’s face for any unbiased Byzantine scholars, i.e. That Wilson’s hypothesis is completelly false AND YOU KNOW IT VERY WELL (but will never admit it for whatever reason that I still don’t understand perfectly well). Welcome to the Pro Shroud’s clique….","date":"2012-10-21","mins":"7:15 pm","url":"https://shroudstory.com/2012/10/10/bsts-meeting-reminder/","cat":"event","title":"BSTS Meeting Reminder"},{"id":"comment-25822","author":"yannick_clément","post":"We must always decode the language of Benedict 16. When he speaks of the Shroud as the “icon of the Holy Saturday”, this means that the Church doesn’t considers at all this relic and its image as a (direct or indirect) of the resurrection but as a natural outcome from the interaction of a dead body and the Shroud it covered, exactly like the work of Ray Rogers, Pierre Barbet, Alan Adler and some others suggest. Because, as far as I know, Holy Saturday is the day when the body of Christ was still dead in the tomb and covered of his Shroud! John Jackson and many others shroudies seem to believe that trying to prove the Resurrection while using the Shroud and his image is really the right thing to do when you are a “good Christian” and a scientist. Unfortunately for Jackson, I think the way Benedict 16 called the Shroud is a great proof that the way Jackson and cie is seeing it (and wants to “use” it) is totally inconsistent with the Church’s point of view (which I totally share)!.","date":"2013-02-27","mins":"12:07 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-25823","author":"yannick_clément","post":"A little mistake can be seen in my first phrase. You should read this instead : “the Church doesn’t considers at all this relic and its image as a (direct or indirect) outcome of the resurrection. Sorry..","date":"2013-02-27","mins":"12:09 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-25932","author":"yannick_clément","post":"Nice comment M. Kearse. But it’s important to understand that when Benedict 16 said “They indeed see the death of Jesus, but they also see his Resurrection”, he should have add this (or people who read or listen to this speach should have add this in their head) : WITH THE EYES OF FAITH !!!! So, let’s read again the real meaning of the Pope’s talk: “They also see his Resurrection WITH THE EYES OF FAITH !” This is truly crucial to understand that there is NO PROOFS OF THE RESURRECTION ON THE SHROUD and there will never be. Only with the EYES OF FAITH can someone see some SIGNS (NOT SCIENTIFIC PROOFS) of the Resurrection of that cloth. This is the reality now and this will most certainly be the reality 1000 years from now ! So, the only way someone can be able to “also see his Resurrection” on the Shroud is and will forever be THROUGH THE EYES OF FAITH, which are very different than the eyes of science… I’m sorry for some of you who will read this but this is the reality : With the pure eyes of science alone, the only thing someone can see on the Shroud is the image of a tortured and dead man who looked like the Byzantine presentation of Jesus. NOTHING ELSE….","date":"2013-02-28","mins":"11:49 am","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-25934","author":"yannick_clément","post":"I second that wish….","date":"2013-02-28","mins":"11:50 am","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-25849","author":"yannick_clément","post":"You don’t need a Phd to understand the difference between the Holy Saturday and Easter !!! In the Catholic tradition, the Holy Saturday is the day Jesus went to Hadès (the place where the deads were parked if you pardon me the expression). The Resurrection is not linked to that day but to Easter morning. When the pope linked the Shroud with Holy Saturday, clearly he was meaning that we should not seek some kind of an evidence of the Resurrection on that cloth. And if you do Dave (or Kelly or Ron or anyone else), then truly, I’m sad for you….","date":"2013-02-27","mins":"4:51 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-26021","author":"yannick_clément","post":"Here, I would like to make a complementary comment concerning the one I wrote 2 days ago in a reply to a post made by Kelly Kearse. I that comment, I was trying to convince Mr. Kearse (and anyone else) to be very cautious before taking the words of Benedict 16 that he quoted at first level and thinking that the Pope was telling his audience that we could really see some kind of a direct and physical piece of evidence of the Resurrection in the image that is on the Shroud. Honestly, I think this is a bad understanding of the Pope’s speech. We must go deeper into Benedict’s reflection and that’s why I used the image of a decoder in my first comment on top of that page. As I said with great emphasis (because this is so important to understand), the only way someone can see a sign (or some signs) of the Resurrection on the Shroud (not proofs!) is through the eyes of FAITH, not through the eyes of science, which can ONLY see and describe the image of a beaten, scourged, crucified and dead man on that cloth and NOTHING ELSE. Note that this kind of observation with the eyes of science must be done and, in fact, was remarkably done during the first half of the 20th century by French scientists like Vignon and Barbet and also by Monsignor Rinaldi (who are the real pioneers of Shroud science) and later on, by the STURP team and others after that who, because they were analysing the Shroud solely through the eyes of science, could not describe anything else than the image of a crucified and dead person! With this kind of physical “look”, it is truly IMPOSSIBLE to see something that can look like a physical proof of the Resurrection on the cloth, simply because this event goes beyond the scope of a true scientific analysis. On that subject, Ray Rogers had some very good and true things to say in his book and I’m sure he said those things because he was aware that in some scientific study of the Shroud (some of them being done by ancient members of STURP unfortunately), some scientists were denaturalising Shroud science by trying to “prove” the Resurrection with the image that we see on the cloth (or at the very least, strongly suggesting the reality of that supernatural event), which is not what we can call an authentic and a good science. So, I’ll repeat it: the only way someone can see something related to the Resurrection on that cloth is through the eyes of FAITH and nothing else and I’m 100% certain that this is what the Pope was meaning in his Turin speech. And I would like to add that, in order for someone to reach that kind of profound level of scrutiny, he MUST go BEYOND the body image and the bloodstains we can see on the Shroud, simply because there is nothing on the cloth (not even the supposed undisturbed aspect of the bloodstains) that can be consider as a definitive proof that something supernatural happen in that shroud. I’m really convinced of this and, in fact, I think the most important sign of the Resurrection we can detect on that cloth with the eyes of faith is the Shroud itself! To me, the simple fact that such a gruesome burial cloth has been kept and preserved for all these years speaks of the Resurrection of Christ louder than anything else! In fact, I don’t think that was anything different 2000 years ago with the empty tomb! That’s why I have a tendency to consider the Shroud in the same category as the empty tomb, which is truly an historical fact that was seen at the time by some persons as a SIGN (not a proof) of the Resurrection of Jesus Christ. Again, we must understand that these believers could never have reach that point simply through the “eyes of science” and they needed their eyes of FAITH instead! Without that kind of look, IT WAS SIMPLY IMPOSSIBLE for anyone in Jerusalem at the time to see anything else than an empty tomb that once contained for a time the crucified body of Jesus of Nazareth… So, I really think we should understand that the words of Benedict 16 concerning a possible way to “see” the Resurrection on the Shroud as something that is completely related to faith and not science and I also think we could change the word “Shroud” for the expression “the empty tomb” in the discourse of the Pope and the meaning would not change at all! Don’t forget that the Shroud can also be seen as an empty object because we know for a fact that it contained the dead body of a man for less than 72 hours and that body “disappeared” at one point. In the end, the reality is this: these two material objects that are the Shroud and the empty tomb can only be view as two signs of the Resurrection and never as two proofs of that event and, in order to reach that point, the eyes of faith are truly needed. I sincerely think that this is the heart of that speech of Benedict 16 concerning the Shroud. And by using the expression “icon of the Holy Saturday”, I think he made things quite clear (at least for me) that this cloth was more directly and physically related to the dead body of Christ than to his glorious resurrected body that first appear to Mary Magdalen the next morning, even though we can still see some signs of that supernatural event by looking at the Shroud WITH THE EYES OF FAITH!.","date":"2013-03-01","mins":"9:27 am","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-25854","author":"yannick_clément","post":"Interesting remark Kelly but I think you should be very careful yourself “that your own views may be casting a rather big shadow here”… When the Pope said “looking at this sacred Cloth through the eyes of faith, one may perceive something of this light”, I really don’t think he was meaning that we can see any kind of physical trace or any scientific piece of evidence of the Resurrection of Jesus on the Shroud! If you think that way, I’m sorry to tell you that it’s a dangerous extrapolation… I often said that myself on this blog : With the eyes of faith, it is possible to see some signs of the Resurrection on that cloth and I’m certain that this was the real sense of Benedict’s statement about being able to see “something of this light” on the Shroud. He was certainly not meaning that the image was the product of a flash of light that came at the moment of the Resurrection!!! COME ON!!!.","date":"2013-02-27","mins":"5:51 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-25852","author":"yannick_clément","post":"Ron, be careful not to mix things here! I’m CONVINCED that Ratzinger personally believe the Shroud to be genuine and I’m sure it is also true for a majority of the Catholic clergy, but as a Pope, he can’t say that the Shroud is the genuine Shroud of Jesus Christ because science WILL NEVER BE ABLE TO PROVE WHAT WAS THE IDENTITY OF THE SHROUD MAN! Also, the fact that many popes (Benedict 16 is just one among many) personally believe the Shroud to be authentic DON’T MEAN FOR ONE SECOND that they also believed that the image on the cloth is a product (direct or not) of the Resurrection! Again, we must be careful here not to mix things up here!.","date":"2013-02-27","mins":"5:40 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-27027","author":"yannick_clément","post":"I need to write here a copy of a previous comment I adressed to Andy in another topic because it’s truly relevant for the subject matter of this particular topic: Andy, don’t you forget that Mary Magdalen was the very first person to have received a missionary task from the Resurrected Christ when he said to her : “Go and tell my brothers that I am resurrected!!!”. So, if Jesus himself wanted that some women became missionaries, who are we to close the door to some Catholic women who says that they have clearly received a call for priesthood from the Holy Spirit??? If Jesus judged that women were good enough to become missionaries, why not priests???.","date":"2013-03-10","mins":"7:45 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","title":"Picture of Veneration in a Ukrainian Parish"},{"id":"comment-25850","author":"yannick_clément","post":"If Benedict 16 would have wanted to make us believe that the Shroud was directly or even just indirectly linked to the Resurrection, he would have used the expression “Icon of Easter” ! COME ON ! The Church NEVER claimed that there is any link at all between that cloth (which she NEVER claimed to be genuine by the way) and the Resurrection of Christ. Of course, anyone can make that kind of link personally, but what I wanted to emphasize is the FACT that the official teaching of the Church versus the Shroud NEVER intend to make believe that some kind of evidence of the Resurrection can be seen on that cloth! You can think otherwise of course, but be sure that if you do, you don’t follow the official teaching of the Church. Why it is so hard to understand that the Shroud is a cloth that show a DEAD MAN, not a living Christ in glory ???.","date":"2013-02-27","mins":"4:57 pm","url":"https://shroudstory.com/2013/02/27/one-day-special-live-tv-exhibition-of-the-shroud-in-turin-cathedral/","cat":"event","title":"One Day Special Live TV Exhibition of the Shroud in Turin Cathedral"},{"id":"comment-26826","author":"yannick_clément","post":"Quote from the Pope : “”The Shroud of Turin offers us the image of how his body lay in the tomb during that time (OF DEATH)” Are you now convince that what I said the other day concerning the meaning of the expression “Icon of the Holy Saturday” was correct??? I really think this new comment from Benedict 16 confirm that the Pope understanding of the Shroud is close to mine, i.e. That it is a relic of the Passion and death of Christ (and also a relic of the Incarnation of God!) well before being an icon of his Resurrection….","date":"2013-03-08","mins":"10:10 am","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-27068","author":"yannick_clément","post":"Ron, there are many ways to understand a certain part of the Gospel. Jesus DID sent Mary to tell the Good News to the apostles and to me, that’s a missionary task AND THAT’S SAYS A LOT ABOUT JESUS POINT OF VIEW REGARDING WOMEN. The actual Catholic Church is far behind that view of Christ in my mind..","date":"2013-03-11","mins":"8:28 am","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","title":"Picture of Veneration in a Ukrainian Parish"},{"id":"comment-27089","author":"yannick_clément","post":"As I said, that’s your opinion, but I disagree with it. I think the Church should always tend to show the unconditional loving face of God to the world and right now, that’s not always what I see. I often see “pharisaism” (you can also call this “intolerance” based on some very ancient Judeo Christian traditions) inside the Church and that piss me off a lot because that’s exactly what Jesus fought against during all his entire ministry and that’s also the main reason why he was killed. But in a sense, the fact that the Church isn’t perfectly showing this unconditional loving face of God to the world is normal since it is made of poor human beings like you and me (and God wanted that way). But that’s not a reason to constantly praying that she change for the best (as we pray for each other in that same way). The Church is not perfect like all the humans are not perfect and there will always be some places for good changes that will make her look more and more like God who is Love. And if you think the Church is not far behind the EVOLUTION of society in many aspects of its doctrine, then I think you should change your glasses… And please, don’t pretend that equality of sex, anti homophobia, anti racism, etc. Are not a great evolution in human history, which, by the way, was not at all initiated by the Church but mainly by the secular world!!! Don’t you believe like me that the Holy Spirit is still at work in our world and that he’s the driving force behind all these positive changes? And don’t you believe like me that the Holy Spirit can inspire men that are not Christian at all? This action of the Holy Spirit outside the official Church is even acknowledge by the Catechism of the Catholic Church!.","date":"2013-03-11","mins":"3:49 pm","url":"https://shroudstory.com/2013/03/10/picture-of-veneration-in-a-ukrainian-parish/","cat":"event","title":"Picture of Veneration in a Ukrainian Parish"},{"id":"comment-85631","author":"yannick_clément","post":"Message for Russ: In your future speaches, I hope you will leave the door open for the possibility of an image formation that could have been totally natural (which doesn’t mean the claim of Jesus’ Resurrection we find in the Gospels couldn’t be true and historical). As I recently said many times on this blog, I hate when people tell me what to say or not say and I sure don’t want to offend you in the same manner. So, just take my comment as a friendly advice. Noticed that I used the words “I hope you will” and not something like “You must”… Hope you will take good note of this comment and, why not, I suggest you to read again my paper about the bloodstains evidence in which I describe the 4 scenarios that, in the light of all the data we know about the Shroud, can still be possible to explain this relic (link: http://www.shroud.com/pdfs/n76part5.pdf). Have a nice trip and I hope there will be alot of people at your lectures..","date":"2014-03-06","mins":"5:43 pm","url":"https://shroudstory.com/2014/03/06/russ-breault-on-the-road-again/","cat":"event","title":"Russ Breault on the Road Again"},{"id":"comment-26932","author":"yannick_clément","post":"Quote: “One of the reasons I have for believing is that there is no explanation for how the image got on the Holy Shroud.” My answer: Ray Rogers and some other true scientists have proposed some interesting explanations over the years that can well be very close to the truth regarding the image on the Shroud and these explanations (Maillard reaction, Volckringer pattern, etc.) are completely resting on natural mechanisms. Of course, since these hypotheses are very complex and hard to reproduce in a lab, we still got no confirmation yet that one of these can really be apply to the Shroud, but nevertheless, in the present state of our knowledge, no one can really discard them, except THOSE WHO DESPERATELY WANT TO USE THE SHROUD TO PHYSICALLY PROVE THE RESURRECTION (i.e. To back up their religiously biased ideology)… Question: What would happen to your faith in the Resurrection if a 100% natural hypothesis for image formation would be proven right in the future??? Personally, I can say that since my faith has grown and is getting a little bit stronger and stronger over the years, my need to rely on the Shroud as some kind of insurance have constantly decrease. I think that if this continue that way (I sure hope so!), then I won’t need the Shroud for my faith no more before the end of my time on Earth. I hope that one day, this relic will only be an helpful tool for me in my meditation about the Passion and death of Christ and nothing else… In sum, the more I advance in my life and in my faith, the more I tend to focus on the Shroud man instead of focusing on his burial cloth. Sure I still love to exchange on that passionate subject, but the more my faith is growing strong, the more the Shroud is becoming secondary. I hope it is the same for all of you! As Christians, we should not “venerate” or focusing too much on Jesus burial Shroud but much more on the God man who came on Earth to show us the real face of love and mercy of the Father! A face of course that we can see on the Shroud (with the eyes of faith)..","date":"2013-03-09","mins":"7:50 pm","url":"https://shroudstory.com/2013/03/08/pope-benedict-says-shroud-of-turin-authentic-burial-robe-of-jesus-it-doesnt-matter-what-science-says-about-its-authenticity/","cat":"event","title":"Pope Benedict says Shroud of Turin authentic burial robe of Jesus & it doesn’t matter what science says about its authenticity"},{"id":"comment-11227","author":"yannick_clément","post":"If I’m right, it’s during the conference of 1991 in St Louis that John Jackson released his famous (or infamous) hypothesis about the body image formation involving the resurrection and the body of Jesus becoming light… In my opinion, that was like the beginning of the end for the credibility of Shroud science outside the Shroud world. Before that time, I don’t think there was too many scientists who proposed a supernatural hypothesis and Jackson was truly the first one from STURP to do so. So, for the history, I think we can say that the release of his hypothesis was a landmark, because it has contributed to open largely the gate to all the pseudo science that you can imagine. I don’t say that Jackson is responsible of all the pseudo science that have follow after his hypothesis was made public, but I think he has encourage some people from the lunatic fringe to come out of the shadow..","date":"2012-05-08","mins":"4:44 pm","url":"https://shroudstory.com/2012/05/08/spreading-rumors-another-u-s-shroud-of-turin-conference/","cat":"event","title":"Spreading rumors:  Another U.S. Shroud of Turin Conference"},{"id":"comment-29036","author":"yannick_clément","post":"The official position of the Church versus the Shroud is pretty much the same than it was during the time of Geoffroy de Charny in Lirey, France, which is this : Until the Shroud can be proven by science to be genuine (will it be possible to reach that point one day?), it is considered as being a representation of Jesus’ Passion and death that can be venerated by the faithful (the same way someone can have a great veneration for the crucifix, for the way of the cross, for the rosary or other things like that). And it’s also important to understand that the Church never declare the Shroud to be a fake or to be the burial cloth of another crucified man than Jesus but, because science is not able yet to prove who the Shroud man really is, the Church cannot officially declare it the authentic burial Shroud of Christ..","date":"2013-04-01","mins":"7:58 pm","url":"https://shroudstory.com/2013/03/30/stories-are-rolling-out-now-on-the-exhibition-of-the-shroud-of-turin/","cat":"event","title":"Stories are rolling out now on the Exhibition of the Shroud of Turin"},{"id":"comment-85899","author":"yannick_clément","post":"Same for me..","date":"2014-03-07","mins":"10:45 am","url":"https://shroudstory.com/2014/03/06/russ-breault-on-the-road-again/","cat":"event","title":"Russ Breault on the Road Again"},{"id":"comment-162081","author":"yannick_clément","post":"To Mike M: Maybe it’s precisely the opposite… And this hard critic of his “science” started when Ray Rogers analyzed his Corona discharge hypothesis and saw that THIS CANNOT BE the answer to the Shroud image….","date":"2014-10-13","mins":"4:17 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-162316","author":"yannick_clément","post":"The problem with Fanti is that he obviously let his faith in the Resurrected Christ (and his idea of what the Resurrection must have produced) interferred into his science. By doing so, he commit the same “sin” as many pro Shroud historian who let their imagination goes much too wild while doing their researches..","date":"2014-10-14","mins":"8:29 am","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-161765","author":"yannick_clément","post":"Along with the few items Bruno Barberis said that must be re examined in a future direct study of the Shroud, I would also underline the crucial question of the image chromophore (which is still debated) and the also crucial question of the banding effect and what seems a very close relationship with the image density. I think these two things should be placed on top of the next test plan, over all the things Mr. Barberis mentioned (even if I agree with him that these things too must be checked out again)….","date":"2014-10-12","mins":"4:58 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-161781","author":"yannick_clément","post":"When Mr. Barberis say “Oxidation and dehydration origins and characteristics”, I think he is referring to the question of the chemical composition of the color chromophore (which Rogers concluded to be ONLY coming from a dehydration process, without the help of any oxidation process). That’s a very important issue to settle of course, but what I have in mind when I talked about the image chromophore is more to determined one and for all the exact location of that chromophore, i.e. In a thin and uneven layer of carbohydrate impurities resting over the fiber, as described by Rogers, or inside the primary cell wall of the fiber itself, which is its most superficial part, as described by Fanti et al. To me, when it comes to determine the most probable mechanism that yield the body image on the cloth, the question of the exact location of the image chromophore is as important (and maybe even more important) as the question of its exact chemical composition….","date":"2014-10-12","mins":"6:07 pm","url":"https://shroudstory.com/2014/10/12/just-the-facts-maam/","cat":"st_louis_2014","title":"\"Just the facts, ma’am.\""},{"id":"comment-161750","author":"yannick_clément","post":"Most of the “suspicious” material found by Rogers and later confirmed by John Brown were so tiny that it took a microscopic backed up by a chemical analysis. It’s evident that Flury Lemberg never did those things and, therefore, it’s not that surprising that she didn’t find any traces of an invisible reweaving….","date":"2014-10-12","mins":"4:04 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-161782","author":"yannick_clément","post":"You should read “it took a microscopic analysis backed up by a chemical analysis”. Now, that’s better….","date":"2014-10-12","mins":"6:08 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-161127","author":"yannick_clément","post":"Even if the C14 dating would have been done on one sample that would have been taken elsewhere than the highly questionable corner that was chosen, the dating result would still need to get a valid scientific confirmation, because that particular dating only involved one single sample divided in 3. In such a context, another C14 dating on at least another sample taken elsewhere on the cloth is truly needed for comparison, no matter what people can think concerning the potential validity of the first dating..","date":"2014-10-10","mins":"4:39 pm","url":"https://shroudstory.com/2014/10/10/st-louis-friday-morning/","cat":"st_louis_2014","title":"St. Louis, Friday Morning"},{"id":"comment-162867","author":"yannick_clément","post":"For once, I tend to agree with Mr. Berry… How many Shroud “conférences” have been done since the STURP examination? A ton! And what is the outcome of all those things? Not much frankly… After all these “conferences”, I wonder why there never been one serious global test plan proposal that could have been submitted to the Turin authorities for a new series of tests. I’m not aware of even just one! To me, all these “conferences” are like watching a one man show after the other, after the other, after the other… And I still wait to see one real concensus effort coming out of this….","date":"2014-10-16","mins":"10:42 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162894","author":"yannick_clément","post":"I recognize that these kind of conferences can stimulates some researches about the Shroud and also creates some partnership. For these reasons, my critic is not all black. But I prefer by far seeing papers about the Shroud published in serious and well recognized peer reviewed journals and I still wait to see a concensus about a new global test plan for a future direct research coming out of these conferences. The fact that this never happen, even though there are maybe 1 or 2 conferences like that every year is what really bugs me..","date":"2014-10-16","mins":"1:04 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163113","author":"yannick_clément","post":"Neutrons have been already proposed long ago by Rinaudo in France and this hypothesis have been set aside rapidly by Ray Rogers who, unlike Rinaudo and a bunch of others proposers, have seen the Shroud image up close and personal in Turin and spent many years afterward analyzing it [removed some all caps]… I recommand you to read Rogers’ book in which you’ll find a section where he analyzed all these high energetic proposals in order to conclude that they do not fit at all with what he observed on the Shroud and especially the fact that the structure of the image fibers are no more damaged by radiations than the non image fibers… Note: you should buy Rogers’ book in PDF version. It’s cheaper! ; ).","date":"2014-10-17","mins":"8:32 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163141","author":"yannick_clément","post":"That’s why I always say that the Resurrected Christ didn’t looked like the Shroud man at all since his closest friends were not able to recognize him after his Resurrection. This was done to respect their liberty and that’s in sync with the God jésus revealed through his ministry and particularly during his Passion. It’s interesting that, in order to recognize him, they always had to see some sign, whether it was his voice (which probably was the same as it was before his death), his stigmatas of the Passion, the breaking of the bread or the miraculous fishing… This particular fact shows how different he surely was! Personally, I think that, along with his voice, he probably only kept the same eyes he had before his death and all the rest was different. After all, the eyes are the mirror of the soul! And when we push the reflection further, we came to understand that this particular fact that the Resurrected Christ changed his appearence so much that his closest friends were not able to recognize him without any signs is a great indication that these account are historically accurate and true, because if the story of the Resurrection was a hoax done by some disciples, they would have make believe that they had absolutely no problem to recognize him and that they had no boubt about it. The fact that this is precisely the opposite that happen is a great sign of truth. And this particular fact is also a great piece of evidence to reject the idea of a mass hallucination, because the imagination of people would have lead them to see Jesus just like he was before his death. When we reflect upon these accounts with logic while taking into account all the known data, we end up thinking that the most probable answer is to believe they’re true. The same thing is also true when it comes to the authenticity of the Shroud..","date":"2014-10-17","mins":"10:48 am","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-162646","author":"yannick_clément","post":"I think that what it really reveal is the presence of a pro shroud clique that contribute heavily to discredit the credibility of Shroud science… But that’s just a personal opinion..","date":"2014-10-15","mins":"1:06 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163166","author":"yannick_clément","post":"Barberis was clear I think about the fact that the authorities will never allow a new series of tests unless a serious multi disciplinary group of experts in their own fields got together and submit a real serious global test plan in the way STURP did back then. I think a Shroud conference could be a good place to start working on this but, unfortunatelly, even though there were a lot of conferences in recent years, I still wait for this to happen….","date":"2014-10-17","mins":"1:00 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-163568","author":"yannick_clément","post":"Here’s a complementary comment concerning the one I wrote yesterday in which I was talking about the fact that Jesus’ disciples were unable to recognize him after his Resurrection without the help of a sign given by him. Because I like to go deep in my reflection of what I found in the Gospels, I propose you this « spiritual » reason for why Jesus didn’t had the same appearence that he had during his earthly life : It was a sign given to the disciples for them to understand that, from that moment on, they must always try to see Jesus in all the human beings they will encounter. In other words, this was a sign given to them to understand that Jesus (God) is hidden in the heart (or the soul or whatever the word you want to call it) of every person and lives there spiritualy (which is the most profound meaning of Matthew 25). To me, along with the fact that God never want to force faith, that’s the main reason for why Jesus had a new appearence (still human, but different) when he encountered his disciples after his Resurrection. I also want to say that when we consider the facts globally (including the probable fact that some disciples decided to take Jesus’ burial shroud from the tomb and preserved it), we’re lead to conclude 2 important things : 1 The empty tomb is an historical fact (because even Jesus’ ennemy never denied that his tomb was empty on Easter morning and, obviously, no one ever found out the missing corpse afterward) and 2 Right after Jesus’ death and burial, there were many of his disciples who were totally convinced that he was still alive, but in a different way. Here, the probable fact that they kept and perserved carefully his burial cloth covered with bloodstains (even though it was a legal impurity for a Jew to touch a cloth that had been in contact with a dead) is a great piece of evidence (at least for me) of the fact that they must have been highly convinced of his Resurrection on Easter day. Note : These 2 important conclusions don’t mean that Jesus’ Resurrection is, in itself, an historical fact, but these conclusions are great indicators for us to undertstand that the apostolic testimony concerning Jesus’ death, burial and Resurrection must be consider very serious and as having a potentially high value. In other words, this post Resurrection testimony is surely not a joke, not a hoax, but on the contrary, came from men and women who were totally convinced that what they said was true. Now, is it possible that an unknown person stole the body of Jesus from the tomb (while leaving his burial shroud there) and make them believe he was still alive (maybe by using someone who looked a bit like Jesus and by making him appear to them on some occasions)? Yes, it is possible to think that. But that’s surely not the most probable conclusion to draw in face of all the facts and pieces of evidence we got… Here, it’s a bit like the image on the Shroud, which we can still think that it came from a « natural » forgery where the forger would have used a real crucified body to make a false Christian relic, even though the corpus of facts and data leads us to conclude that such a scenario is far fetched (even if it is theoretically possible) and there’s another scenario that really seems to be much more probable, i.e. That the image on the cloth came from a natural interraction between the real crucified body of Jesus of Nazareth and his own burial cloth… In sum, I think that if we analyze the situation without bias or preconcieve notions, while taking account of all the pertinent data and observations, we can say that, in the case of the Resurrection of Jesus as well as in the case of the Shroud, it is much more easy to conclude that these are just what it was reported to be (i.e. The Resurrection of Jesus is a true event and the Shroud is the authentic burial cloth of Jesus) than to start building far fetched scenarios, just to contradict the official claims that were made… While reading this previous paragraph, some people (those who don’t know me that much) could find strange that I consider the Resurrection of Jesus to be « probable » in face of all the data, observations and testimonies we have and, at the same time, that I don’t make a direct link between the formation of the body image on the Shroud and this supernatural event. First, I would say that there is nothing in the corpus of data coming from the Shroud that leads me to believe in such a direct link. We don’t find anything in all the STURP papers that have been published in peer reviewed journals that suggest such a thing and there is nothing also in all the later analyses done by Ray Rogers and Alan Adler afterward. And secondly, this is important to remember (and I think most people here are completely unaware of this) that, historically, what have been officially reported in the case of the Shroud is that it was the authentic burial cloth of Jesus showing the image of his dead body at the time he was placed inside it. Effectively, the belief that the image was caused directly by some burst of energy coming from Jesus’ corpse at the exact moment of his Resurrection is a real modern heresy, which originates from the unability of the STURP team to find one clear and definitive solution for the image formation, as well as the very curious C14 results published in 1989 (the « scientific journey » of John Jackson is the most obvious example that illustrate this), while all the other data were pointing in direction of authenticity. Look, you just need to read papers or books that were written about the Shroud before that era to understand easily that the body image formation was almost never associated directly with the Resurrection of Christ, even by the researchers (like Vignon and Barbet for example) who concluded, just like me, that this Shroud is authentic. When you read these « ancient » publications about the Shroud (you can also read an article of Peter Rinaldi, which have been published on this blog last year), you note easily that it was evident for these writers that the image on the Shroud was directly related to the dead body of Christ and not to his « glorious body »! After having studied carefully all the pertinent data and observations related to the cloth and the image, I came out convinced that their conclusion about that was good and that the scenario of an image directly caused by the Resurrection event was an Hollywoodish and heretic idea. One last thing I would like to say about Jesus’ Resurrection is this : I think the error would be to focus on the own personal Resurrection of Jesus, while forgetting (or not understanding) that, in the most profound way, these appearance of the Resurrected Christ were mainly intended to make us understand that his Resurrection is ours too! In other words, I truly believe that the best way to look at Christ’s Resurrection is to see in this event an insurance of our own personal Resurrection that will come for sure at the « end of our time » here on earth! In sum, it is the « heritage » that God saved for us from all eternity… And I think we must do the same kind of « reading » for all the important events in the life of Christ that we find in the Gospels, whether it be his transfiguration, his baptism, his suffering passion, etc. In other words, in these events, we must see our own transfiguration that will surely come after our physical death, our own baptism that has been done a first time by God at the moment he created us and which will be redone in a more complete way at the time of our physical death, our own suffering passion here on earth, which will eventually be transfigured into eternal life and hapinness after our physical death, etc. It’s like Jesus is saying to us : Stop looking at me personally and look at what has been lovingly prepared by God for YOU from all eternity! I think that’s one of the main reason why Christ didn’t appeared to his disciples for a long period of time after his Resurrection and choosed to disappear completely to their eyes after that short period of time. Or else, they would have been even more tempted to only watch the Resurrected Christ without thinking that his own Resurrection was also ours!.","date":"2014-10-18","mins":"4:28 pm","url":"https://shroudstory.com/2014/10/15/thanks-all-around/","cat":"st_louis_2014","title":"Thanks All Around"},{"id":"comment-28982","author":"yannick_clément","post":"This is a very clever discourse of Pope Francis ! I would like to underline these quotes : “This face has eyes that are CLOSED, it is the face of ONE WHO IS DEAD, and yet mysteriously he is watching us, and in silence he speaks to us.” Comment of mine: here on this blog, I mainly said the same thing over and over again to those who I call “the members of the supernatural fringe” ! The Shroud doesn’t show a glorious body of light but a dead man who suffered a great deal. In other words, this is a relic of the Passion of Christ, not a relic of his Resurrection. “This image, impressed upon the cloth, speaks to our heart and moves us to climb the hill of Calvary, to look upon the wood of the Cross, and to immerse ourselves in the eloquent silence of love.” Comment of mine: Again, the Pope underline the fact that this is a relic of the Passion of Christ more than anything else and that it mainly show the extreme love of Christ for mankind, which is in fact, the most compelling revelation of the love of the Father for every one of his children! “By means of the Holy Shroud, the unique and supreme Word of God comes to us: Love made man, incarnate in our history; the merciful love of God who has taken upon himself all the evil of the world to free us from its power.” Comment of mine: This quote is extraordinary for me, because it’s one of the first time I hear a Pope doing a direct association between the Shroud and the Incarnation of God here on Earth, which is for me the most important thing the Shroud had to say to us! Effectively, for me, the Shroud is not a relic of the Resurrection, even though it is possible to detect some signs of that event by looking at this cloth; and beside being evidently a relic of the Passion of the Christ, I truly believe that the Shroud is first and foremost a relic of the Incarnation of God in our humanity and, therefore, should be meditated under this great light, which is something often forgotten in the pro Shroud world where people tend to always put the focus on the Passion, death and, more than anything else, on the Resurrection of Christ. But the simple fact that God accepted to take a real body like anyone else and live here on Earth is very telling on who he really is, which is not the God of Talion that the Jews of Jesus time had in mind, but instead a God who is Love and Mercy AND NOTHING ELSE. “So, looking upon the Man of the Shroud, I make my own the prayer which Saint Francis of Assisi prayed before the Crucifix…” Comment of mine: This link made by the Pope between the Shroud and the crucifix is also an evident sign that, for him, this relic is mainly a relic of the Passion of Christ instead of being a relic of the Resurrection of Christ, and as he said earlier when he mention the peaceful aspect of the face of the Shroud man, we can see something of the confidence of Jesus for his Father, even during this very painful event up until the moment of his death. In my mind, this is a great discourse of the Pope because he kept his feet on the ground, while focusing on the most important aspects of that relic!.","date":"2013-03-31","mins":"9:43 pm","url":"https://shroudstory.com/2013/03/31/text-of-pope-francis-remarks-for-the-televised-exhibition-of-the-shroud-of-turin-on-holy-saturday/","cat":"event","title":"Text of Pope Francis’ Remarks for the Televised Exhibition of the Shroud of Turin on Holy Saturday"},{"id":"comment-26099","author":"yannick_clément","post":"Thanks a lot ! This is truly possible since this particular letter focus a lot on the “infamous” sacrificial aspect of Jesus’ Passion (I say infamous because I truly think this theology is far away from the idea of a God who is love) and we know very well that this theological theme was popular in St Paul’s predication. And can we be surprise? No ! The theology of the sacrifice was all the Jews (and most pagan people) of that time knew and, of course, while St Paul desperately wanted that his Jewish brothers and sisters to recognize Jesus as the Messiah, he evidently choose that well known theme for his predication and applied it to Jesus’ death on the cross. St John and most of the Jewish writers of the first century A.D. Did the same simply because they wanted to make us believe that the scandal of the cross was already predicted by the prophets, which is far from being sure!!! For me, the only purpose of Jesus’ death was to fully accomplish his mission (and never backed up from it), which was “simply” to present the true face of the Father who is Love and Mercy (and nothing else)….","date":"2013-03-01","mins":"4:51 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26543","author":"yannick_clément","post":"Thibault, it’s incredible how you don’t want to understand and that’s why I’m not interested no more to keep on talking with you. This is a pure waste of time. Before I go elsewhere, I would like you to answer the question I asked this morning : Are you naive enough to believe that there are no Shroud researches done these days that are driven by a religious ideology instead of a real and authentic quest for truth (whatever that is)?.","date":"2013-03-05","mins":"4:52 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26445","author":"yannick_clément","post":"This comment proves that Thibault has not understand ANYTHING about the meaning of my point!!! INCREDIBLE. It’s like someone who don’t want to understand. In french, we call this “être bouché des deux bouts”. Thibault, first of all, my comment was not directed toward anyone specifically. Read the explanation I gave to Dan please: https://shroudstory.com/2013/03/01/the face jesus left us/#comment 26393 Of course, you know me enough to know who are the guys I was thinking while I was making my analogy and I can ensure you that Mr. Kearse and Mr. Hugh Farey are not among the list… As I know, these 2 persons doesn’t defend any supernatural hypothesis of image formation, no more than you by the way. I made this analogy for one single purpose: to expose the pathetic act of some researchers who use and deform science in the single dishonest purpose to push their religious ideology, which is something we saw with the Nazi regime and which is something we often see today concerning many philosophical, religious or atheist ideologies. The point I wanted to make is this: Once someone is using science in order to back up an ideology (whatever it is a Nazi, communist, religious or an atheist ideology), I’m sorry but it’s not science no more. And sorry but it’s a fact: In the Shroud world, especially since STURP came up empty of a complete explanation for the image, we saw a bunch of so called “scientists” using their “science” on the Shroud’s image for the sole purpose of “proving” the Resurrection. Sorry again but on the PRINCIPLE, I don’t see any difference between this kind of acting and the kind of acting of the Nazi regime. Don’t you realize that this was just an ANALOGY my friend? My goal was not to call anyone a nazi or something like that! My goal was to denunciate the acting of many so called “scientists” who are not doing Shroud science for the right motive, which should be to find the TRUTH and nothing else. In fact, these persons are doing exactly the opposite: they use their “science” in order to fool the general public and make them believe that we really can find a physical trace of the Resurrection on the Shroud, which is a LIE. Finally, I’m sorry again but when someone mix “science” and “lies” (or even just “biased conclusions and observations”, I don’t think we can call this “science” no more. I HOPE YOU UNDERSTAND MY COMMENT BETTER NOW!.","date":"2013-03-04","mins":"5:52 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26508","author":"yannick_clément","post":"Here’s a complementary note for Thibault : In my previous comment, I use strong words but that was only done to wake you up concerning the fact that you completely pass by the real meaning of my analogy betweenthe nazi scientists and some modern Shroud “scientists”, which is this: both are using science in order to back up their preconceive notions and their ideological concepts (concerning the Shroud, the concept his evidently religious). I sure hope you won’t get upset by this comment. Instead, I hope you will finally realize the real intention I had when I first wrote my analogy..","date":"2013-03-05","mins":"9:33 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26507","author":"yannick_clément","post":"In order to make myself more clear in the mind of all of you who have criticize me recently, I just have one question for you : Are you naive enough to believe that there are no Shroud researches done these days that are driven by a religious ideology instead of a real and authentic quest for truth (whatever that is)? Since the obvious answer to that question is yes, what is the problem with what I said lately on the blog? I just used an easy example taken from the history of the 20th century to remind you that, sometimes (and sadly), science can be used for the wrong motives, i.e. To push an ideological and a biased point of view, and that it is obviously the case for some Shroud researches, especially since the end of the STURP adventure. I didn’t intend to say anything else than this..","date":"2013-03-05","mins":"9:29 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26105","author":"yannick_clément","post":"Sorry for the “twister7” name ! It is my nickname and I wrote it too fast… ; ).","date":"2013-03-01","mins":"5:39 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26107","author":"yannick_clément","post":"God did not tortured his own son on the cross! What a gruesome, ridiculous and crazy idea, by the way. Those who tortured and killed Jesus were us!!! And Jesus only accept that kind of death for one reason: to show us where true love can go and also, as a side effect, to show us that suffering and death will never have the last word. Every living creature created by God is Eternal..","date":"2013-03-01","mins":"5:42 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26312","author":"yannick_clément","post":"Chris, God is Love. Whenever there is a stern warning which is given by the Father, Jesus or Mary, it is simply a powerful call to the convertion and it is there because God knows very well that it is only by walking with him that a human being can really find true happiness on earth. Unversal Salvation is on the way because that’s what God has planed for all eternity. And if that would not be the case, be sure we would not be here today ! He would simply not created anything. The God of Jesus Christ is call Love and Mercy and he will never accept that one single of his children can be lost forever. That’s the profound meaning of the lost sheep parable and I think that, with the eyes of faith, we can see this truth on the Shroud! Peace my friend! YOU ARE SAVED..","date":"2013-03-03","mins":"7:40 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26194","author":"yannick_clément","post":"I will use the words of Ste. Therese of Lisieux (a Doctor of the Church) to answer your question, because one day, someone ask her if she believed in hell (because she was always talking about the Mercy of God who’s name is Love) and here’s what she said (remember that she was named Doctor of the Church by John Paul II and was also named the greatest saint of modern time by Pius X) : “Yes, I believe that there is a hell because that’s what the Church is teaching, but I’m convinced that it is empty!” Once you have experimented the Love and Mercy of God, you cannot believe no more that God will let one single of his children go into darkness for eternity. As the parable of the lost sheep in St Luke teach us, the Father will always go searching the lost sheep (who is everyone of us) UNTIL HE FOUND US and HE WILL BRING US BACK HOME ON HIS BACK! When your name is Love, that’s how you act! And when your name is Love, you don’t force your own son to die on a cross in horrible pain in order to, only then, be able to forgive the poor humans that we are! What a wrong way to see the God presented by Jesus Christ. The best way to understand the Passion and death of Jesus can be found in St. John’s Gospel when he said to Pilatus: “In fact, the reason I was born and came into the world (note: we can also understand: and agree to die on the cross) is to testify to the truth. Everyone on the side of truth listens to me.” The Mission of Jesus was to show us the real face of the Father, which is a face of Love and Mercy for ALL MANKIND and that mission was never more clearly successful than during his Passion when he forgive everyone, even those who just nailed him to the cross… That show us that the Universal Salvation plan of God is on the way and he will succeed to get it done at the end of time. That’s my belief, based on the life and teaching of Jesus Christ and based also on my own personal spiritual experience of God..","date":"2013-03-02","mins":"7:36 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26324","author":"yannick_clément","post":"Believe what you want, I don’t care. One thing’s for sure: your God is not my God and also not the God of Ste Therese of Lisieux (a doctor of the Church) and a bunch of other saints during history..","date":"2013-03-03","mins":"8:14 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26097","author":"yannick_clément","post":"New comparative imagery techniques will surely help eventually to back up Paul Vignon’s conclusion concerning his study of many ancient representations of Christ that were most probably based directly or indirectly on the Shroud. Among these representations, we found the Holy Mandylion of Edessa….","date":"2013-03-01","mins":"4:43 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26056","author":"yannick_clément","post":"“The Shroud is a sign”. EXACTLY !!! And to decode it, sorry but someone needs the EYES OF FAITH and not the eyes of science (which very often, don’t see very far and very deep, spiritually speaking). “The Shroud is a sign”. Please read my numerous comments on that page : https://shroudstory.com/2013/02/27/one day special live tv exhibition of the shroud in turin cathedral/#comments I DIDN’T SAID ANYTHING ELSE THAN THAT, except that I add this important truth : It is a sign and not a physical proof ! Sorry for John Jackson and cie. But it will never be..","date":"2013-03-01","mins":"11:43 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26057","author":"yannick_clément","post":"I just want to add this : The Shroud is a sign, just like the empty tomb was a sign for the people in Jerusalem after Easter morning! That’s why I love to call it “the empty Shroud”….","date":"2013-03-01","mins":"11:45 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26405","author":"yannick_clément","post":"And since the image is most certainly the result of a very complex and probably very rare natural process involving some chemical interraction between a fresh beaten and crucified corpse and an ancient linen fabric, I think it will take a great deal of luck for a scientist to came up with what I call “the right chemical recipe” that can allow the exact reproduction of the image in all its physico chemical aspects. There are just too many unknown factors related to the dead body, the linen cloth, the temperature, humidity, resting place, the possible presence of burial product (on the cloth and/or on the body and/or next to it), etc., etc. The best thing that could be done in my mind is to reproduce a small image of a body part on a linen sample that will present all the known characteristic of the image and I don’t expect someone will be able to do so until a new series of direct test can be performed on the cloth. And even then, I’m not sure..","date":"2013-03-04","mins":"11:41 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26196","author":"yannick_clément","post":"Quote: “The image may have been formed through the transformation of a dead body into a living one by an unknown process.” In the present state of our knowledge, there is absolutely nothing to suggest such an extravagant scenario except the wild religiously biased imagination of some (which sadly count among them some so called “scientist”). May I remember you that this kind of thinking (i.e. The image formation process is unknown, then it can really be due to a miracle event) represent a religiously biased extrapolation from the original conclusion of the STURP team? Such a wild extrapolation should not have his place in a real quest that call itself “scientific”. The ONLY thing we can deduce of STURP’s conclusion is that the process (or processes) that has lead to the formation of this very subtle body image on the cloth is still undetermined, that it surely comes from the interraction between a real body (most probably a fresh corpse that never stained the cloth with liquids of putrefaction) and the surface fibers of the linen cloth and that it is surely a very mild process because the color never penetrated deep into the cloth (it is event possible that the color only reside on a thin layer of impurities without having colored the fibers themselves) and the bloodstains were not denatured by it in any way. That’s the only honest things we can extrapolate from STURP’s conclusion… NOTHING MORE, NOTHING LESS. Does that allow a real competent and honest scientist that got no religious bias to start searching for some supernatural process like a burst of light or a burst of another form of energy coming out of the dead body to only color the most superficial fibers? NOT AT ALL! Ask any atheist, Muslim, Buddhist or Hindoo scientists to analyse the data about the Shroud and then, ask them to tell you the most probable image formation process they think concerning the Shroud’s image and you’ll see that no one will think about any supernatural event! If you got some non christian colleagues, please do the test and you’ll see! If a scientist is searching elsewhere than in a natural image formation process, you can be certain that this particular scientist is religiously biased in his scientific quest for truth and, sorry but when that happen, I don’t think we can call this a real competent and honest scientific quest no more… That’s why I’m truly disgusted to see that, these days, almost every scientists who enter the Shroud world is religiously biased (name me one modern scientist who is not christian believer and who is passionate about finding the truth about the Shroud!!! The list must be very small) and that is looking to find some kind of physical traces of the Resurrection on the cloth, which is totally against the official teaching of the Catholic Church for whom the Resurrection should not have left any kind of physical proofs of it that could force or influence the freedom of people to believe in it or not..","date":"2013-03-02","mins":"7:46 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26200","author":"yannick_clément","post":"I agree to leaves to not start a long and useless debate with you. You are obviously looking at the Shroud with a different perspective than me and I don’t think the world will stop turning because of that..","date":"2013-03-02","mins":"8:48 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26302","author":"yannick_clément","post":"Por qué “a burst”? Because that’s what Jackson, Moran, Rinaudo, Fanti and all the other religiously biased scientists out there are trying to make us believe regarding the formation of the image on the Shroud. On that subject, I think I have summarized very well the situation in my previous comment to Mr. Kearse. Here it is again for you Carlos : The ONLY thing we can deduce of STURP’s conclusion is that the process (or processes) that has lead to the formation of this very subtle body image on the cloth is still undetermined, that it surely comes from the interraction between a real body (most probably a fresh corpse that never stained the cloth with liquids of putrefaction) and the surface fibers of the linen cloth and that it is surely a very mild process because the color never penetrated deep into the cloth (it is event possible that the color only reside on a thin layer of impurities without having colored the fibers themselves) and the bloodstains were not denatured by it in any way. That’s the only honest things we can extrapolate from STURP’s conclusion… NOTHING MORE, NOTHING LESS. Does that allow a real competent and honest scientist that got no religious bias to start searching for some supernatural process like a burst of light or a burst of another form of energy coming out of the dead body to only color the most superficial fibers? NOT AT ALL! Ask any atheist, Muslim, Buddhist or Hindoo scientists to analyse the data about the Shroud and then, ask them to tell you the most probable image formation process they think concerning the Shroud’s image and you’ll see that no one will think about any supernatural event! If you got some non christian colleagues, please do the test and you’ll see! Let me ask you this Carlos: Don’t you realize that the ONLY ONES who are believing that the image is the result of some supernatural event are also believer in the Resurrection of Christ? If that’s not an evident proof of a biased scientific quest, I don’t know what it is! We saw the same kind of biased science in the 30s and during World War II in Germany when a bunch of Nazi’s scientists were using science in order to “prove” the superiority of the arian blood and the inferiority of the Jewish blood ! Why can’t you realize that this is the same kind of bullshit that his going on in the Shroud world since STURP published their conclusion in the 1980s? On that subject, I would like to say this: The fact that the STURP team was unable to find a proper mechanism that can account for the image on the Shroud DON’T MEAN FOR ONE SECOND that this image will never be explainable by science or that this prove (or even just suggest) that a miraculous event must be at the origin of that image. Thinking otherwise is UNSCIENTIFIC (and by implication, religiously biased), PERIOD..","date":"2013-03-03","mins":"6:59 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26317","author":"yannick_clément","post":"Where do you see the Church focussing on physical evidence of God or physical proofs of the Resurrection in his official teaching??? I would love to see that!.","date":"2013-03-03","mins":"8:01 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26298","author":"yannick_clément","post":"The Resurrection left only some SIGNS my friend, because that’s the way God (who is Love, don’t forget that important fact) is acting to respect our freedom ! Love NEVER force anyone… And if there would be some clear and undisputable physical traces of that event (on the Shroud or elsewhere), then how in the world someone could remain free to believe or not? And here’s the best question for you Hugh: What real and unquestionable proof can you bring me in order to prove that event? You CAN’T and THAT’S NORMAL! That’s how it goes. By definition, if someone could find a proof, he would not needs faith no more! This is basic logic… And St John is the Evangelist who understand that aspect the best because he’s the only one who don’t call the mightly deeds of Jesus “miracle” but instead, he call them “signs” (as it should be!). And here’s the most important signs of the Ressurection (for me at least): 1 The testimonies of the disciples after the apparitions of the resurrected Christ. 2 The empty tomb (don’t forget that the empty tomb is a real historical FACT because even the ennemies of Jesus never denied it but instead, they explain it differently). 3 The empty Shroud (which I put on the same level than the empty tomb). In EVERY ONE of these cases, note that someone needs FAITH in order to believe in the Resurrection of Jesus because, each one of these things can be rationally explained without the need to call for a miraculous event. And that’s precisely why most of the Jews of the first century never convert to Christianity! In the end, the most important thing for anyone’s faith is the spiritual experience of God (through the Eucharist, the prayer, charity, etc.) he is living inside of him and the small experience of personal resurrection he also live in his life. Since God is a SPIRIT, the best way to get close to him is through SPIRITUALITY and not through a scientific or a purely human philosophical analysis! In other words, the best way to find God is to look into your heart and not by analysing some colored linen fibers through a microscope (even though I must admit that an honest scientific quest for truth can also get someone closer to God, but it’s not the best way in my mind)!.","date":"2013-03-03","mins":"6:45 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26406","author":"yannick_clément","post":"The Church has NEVER claimed that there is any kind of physical trace of the Resurrection on the Shroud. Only those that I call “the modern religious integrists who use science to back up their ideology” does….","date":"2013-03-04","mins":"11:44 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26407","author":"yannick_clément","post":"And concerning my use of CAPITAL LETTER, let me be clear once and for all: I use this technic just to emphasize what I consider the most important arguments I present. I cannot use the bold characters on this blog, so I use the CAPITAL LETTER method instead. That’s all. I don’t understand why people get upset because of this… That’s completely ridiculous. Are we living in a free world or what?.","date":"2013-03-04","mins":"11:46 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26415","author":"yannick_clément","post":"Just to make things clearer to Daveb: I really don’t remember having made personal attacks the way you often do with me. I never call you (or anyone else on this blog) “idiot”, “inapt” or anything like that… I just use strong arguments to defend my ideas but it’s very different than cheap personal attacks that I often “endured” on this blog from you and from many others. The only “accusations” you can see me doing here concern those that I consider totally “religiously biased” or “dishonest”. That’s very different than calling someone “cretin” or something like that, don’t you think?.","date":"2013-03-04","mins":"12:16 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26393","author":"yannick_clément","post":"No. The analogy I made was right on the target. I was only refeering to the PRINCIPLE of using science in order to push some political, philosophical or religious IDEOLOGY. My analogy imply the Nazi but I could have choose many other examples, like the scientists who use science to back up the creationist ideology… There are a bunch of examples like that unfortunatelly ! If Mr. Kearse thinks that he fits into that category, it’s not my problem. He was not among the persons I had in mind while making my analogy. The persons I had in mind are those who use the Shroud to try to physically prove the Resurrection..","date":"2013-03-04","mins":"9:33 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26409","author":"yannick_clément","post":"May I suggest you look at yourself in a mirror Daveb ??? Hank Williams had a good song that can fits very well with you : BE CAREFUL AT STONES THAT YOU THROW ! Remember Jesus teaching about that? ; ).","date":"2013-03-04","mins":"11:49 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26411","author":"yannick_clément","post":"Matthias, it seems that the only ones who have a problem with my analogy are those who are fitting into that category of people who are willing to use science to back up their ideology, which in the case of the Shroud is religious….","date":"2013-03-04","mins":"11:51 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26077","author":"yannick_clément","post":"Is it possible for you to give us the name of this most certainly Jewish author?.","date":"2013-03-01","mins":"2:00 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26418","author":"yannick_clément","post":"For me Max, the #2 and #3 signs are really signs of the Resurrection BUT ONLY in the light of the apparition of the Resurrected Christ! I should have made that precision and that’s why I put the apparitions in #1 place! Without a faith in the testimonies of the disciples concerning these apparitions, the empty tomb and the empty shroud would be just that: empty things ! And they could surely be explained rationally by people who don’t believe in Christ… But once someone believes in the apparitions of the Resurrected Christ, then these 2 material things that are the empty tomb and the empty shroud can be understand in a completely different way (i.e. As 2 great signs – not proofs – of the Resurrection of Christ). Is it good for you?.","date":"2013-03-04","mins":"2:02 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26448","author":"yannick_clément","post":"Max, the answer to your last question is easy: Mary Magdalen never saw an angel with her own eyes! You surely know that the ancient Jewish writers were often using images in order to express spiritual realities. And a lot of time, the expression “angel of the Lord” was in fact, a way to talk about God… And if Mary was not able to recognize someone that she loved so much, it’s easy to understand that this could only mean two things: 1 it was not Jesus at all. Or 2 it was the Resurrected Jesus but his body appearence was different than the one he had before his death. That mean that the Resurrection of Jesus was not a re animation of a corpse like it was in the case of Lazarus. It was a completely different thing which goes well beyond our space time universe. I believe in the second scenario….","date":"2013-03-04","mins":"6:00 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26524","author":"yannick_clément","post":"It sure does in my mind Max! I’m certain that this apparition (and all the others) were not done by a Jesus who was showing some kind of a “Glorious body”. Mary’s reaction by considering this unknown person as the gardener is very telling about the fact that the body of Jesus during this apparition was most certainly normal (I mean that it was like any normal human body). We must see these apparitions of the Resurrected Christ has “physical apparitions” and we must be very prudent and not extrapolate them into eternity and think that this is a proof that Jesus still has this particular physical body in the Kingdom of God (or thinking that we will still have a physical body after death). These are two very different realities (the physical world and the spiritual world) and it’s certain that there will be no more “physical” matter on the other side. But to come back on these appearence of Jesus, he was somewhat “obliged” to take again a physical appearence in a normal body because he did not wanted them to take him for a ghost. And the fact that he physically appeared to them is also a SIGN that it is not just the soul who will resurrected after death but all the person (body and soul). But again, let’s not think that this resurrected body that everyone will get will be the same nature as our physical body. As Jesus said in the Gospel: “You will be like angels”. That’s very telling ! That mean that we will live a totally different sort of life in a “spiritualized” body (St Paul talks about that in one of his letter) that will not be bound no more to our present physical needs and that will never suffer or die again..","date":"2013-03-05","mins":"11:36 am","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"},{"id":"comment-26434","author":"yannick_clément","post":"I will talk only for myself (a catholic liberal who doesn’t follow every dogmas of the Church and who prefer to think by himself): First question: Of course he was dressed! Have you ever seen a gardener naked? By the way, the fact that she doesn’t recognize his master is very telling about the fact that Jesus chose to appear to his disciples with a different body appearence than he had before his death (the one we see on the Shroud) and I’m pretty sure this was done for one single purpose: TO RESPECT THE LIBERTY OF HIS DISCIPLE AND NOT FORCE THEM TO BELIEVE IN THE RESURRECTION! If you read carefully the texts, the disciples always needed some SIGNS to recognize Jesus in the man they had in front of them. That’s very telling on who God really is, i.e. LOVE. Second question: I have no idea. I guess pretty much like any normal Jew who did a manual work for a living. Don’t forget that the tomb (as well as the place of crucifixion) was located in a garden (or near a garden). In that context, I think Mary Magdalen mistook the man she had in front of her as a gardener not because of his dressing but more likely just as a logical deduction determined by the location of the tomb and the time of the day. Who else than a gardener can you expect to see in a garden very early in the morning?.","date":"2013-03-04","mins":"4:43 pm","url":"https://shroudstory.com/2013/03/01/the-face-jesus-left-us/","cat":"event","title":"The face Jesus left us"}]
