[{"id":"comment-5857","author":"yannick_clément","post":"I SAY AMEN, AMEN, AMEN (triple Amen it is called) TO THIS STATEMENT. This person summarize is a few phrases what I said here over and over again in the past months !!! I agree TOTALLY with every single word of this comment. He said it all. I could even go further when he said “It is an unsatisfactory faith which insists upon forensic proofs.” In this case, I would ask : Is it really something we can call faith ??? Good question to meditate… And I love his first phrase : “When pressed to give his judgment on the shroud’s authenticity, Pope Benedict never went further than to affirm that it could prove a strengthening of faith among those who already believe.” This is exactly what I said here the other day ! ; ) The Shroud is here to strenghten the faith, not to convert people. But I agree with Ron to a certain extend on the idea that the Shroud can also be a good kick start for someone who is not sure about God and who is searching. But it would be, in this hypothetical case, just the start of a long journey and not the destination..","date":"2011-12-21","mins":"5:56 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-6067","author":"yannick_clément","post":"Quote : “The ‘assumption’ being, that it is from a “lack of faith” that people seek more “forensic proofs” or lets call it information from the Shroud.” If it’s not a lack of faith, it’s surely a lack of confidence… That’s why Jesus call us to try to have a child’s faith. A child is full of confidence and never ask for a proof to believe in something !!! We, the adults, then to lose this kind of faith as our rational part grow up. And then, we start to call for proofs in order to believe ! That’s not the kind of faith that was praised by Jesus. So, for the Shroud, it’s not at all an anti christian thing to study and reflect upon this relic (whether it’s in a scientific or spiritual way). Not at all. It can even strenghten our faith ! So, it’s good. But the problem would be that someone base ALL his faith in Christ upon this Shroud. That would be really dangerous… And this kind of faith would surely be very weak. That’s it..","date":"2011-12-23","mins":"7:43 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-5946","author":"yannick_clément","post":"Having said what I just said, I think it’s important to specify that not having this kind of child’s faith yet (I stand in this position like 99% of the adults) is nothing to be ashamed of. It’s normal. But we have to tend to gain this kind of naive faith in a God named “Love”….","date":"2011-12-22","mins":"12:32 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-5922","author":"yannick_clément","post":"I’m sure you’re right. I’m sure the Holy Spirit use this Shroud for the benefit of God (and of course, for the benefit of the persons who start a faith journey because of it). But the main purpose of the Shroud to me that it can strenghten the faith of many people and help the faithful to finally believe that God is Love and not some Bogeyman sitting on a throne in the Sky with a baseball bat in his hands impatiently waiting to punish the sinners and throw them in Hell !!! Even after 2000 years, there’s a lot of people who still see God that way (the Old Testament Way) even if it’s not the face of God that Jesus Christ desperately wanted to show us. And the Shroud to me is the proof of that. When you look at this beaten face full of serenity and peace, it doesn’t fit at all with the face of God so present in the Old Testament (and even also in the New sometimes), i.e., the face of a insensitive Judge of the Universe who only applies the Law of Talion… This face just doesn’t fit with the face on the Shroud. The face on the Shroud fits better with the words of St John : God is Love and he’s the one who love us first… This was my spiritual editorial for today folks ! ; ).","date":"2011-12-22","mins":"11:36 am","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-5932","author":"yannick_clément","post":"Quote : “I’ll bet if you asked Pope Benedict what he really thought in private, his answer would be completely different!” I don’t know for the Pope but I can confirm you, my dear Ron, that I’m not thinking differently in private than I do here ! And I’m sure I’m not alone to think like M. Mullen ! Oh, by the way, I don’t have a bias against the Shroud… It’s not because we consider the Shroud as nothing so important for our faith that we have a bias against it ! ; ) To us (those who think like M. Muller), the Shroud is just a confirmation of the Gospels. Nothing more, nothing less. You also talk about the “meaning” of the Shroud. Ever thought about his message instead ? God is Love and he love so much all mankind that he died for us on the cross and took all the blame, that’s the message and it’s a great one ! To me, the meaning of the Shroud is to be found in this message of love and hope for humanity. Quote : “My faith is intact with or without the Shroud.” I’m really happy it is that way for you Ron. Really. Quote : “There is something about the Shroud which I cannot explain from the first time I gazed eyes on it, which has me in it’s grasp and has me wanting to know more about it’s providence, if such, but moreso of our Lord Jesus.” I’m just like you ! Even if the Shroud is the center base of my faith, I don’t know why but I’m completely fascinated by it. Maybe it’s because, as a child of TV, I’m more attracted by images than maybe the older generations… I think it’s maybe a part of the attraction and fascination I have for this object..","date":"2011-12-22","mins":"11:51 am","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-5936","author":"yannick_clément","post":"I wrote a paper (unpublished) about the thing called “God of the Gaps”. I think there’s many people who think about the Shroud in those terms. When something is not explained yet, some people have a bad tendency to immediately attribute it directly to God. An act of God if you want. And history is full of things that were not explained at a certain period of time and during these days, many peoples thought it was an act of God. Then, science found out the real mechanism of nature behind the phenomenon and those peoples look like fools ! I think the same thing might happen one day with the Shroud is science finally resolve this “mystery” once and for all and explain it in “natural” term. I don’t think you and I will live long enough to see this happen but who knows ???.","date":"2011-12-22","mins":"11:56 am","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-5943","author":"yannick_clément","post":"One last comment for you Ron about faith as teached by Jesus : One of the most important message of Christ in the Gospels is to have a child faith. Remember what he said about the children ? We must become like children to enter God’s Kingdom ! Those who are like them (meaning those who believe with great confidence without needing proofs or without needing to “see”) are the ones with the higher degree of faith in Jesus mind. I don’t pretend I get this level of confidence yet. That would be very pretencious ! But I try everyday to go in that direction. To try to get to this level of confidence which is the higher degree of faith someone can have. It is the degree of faith the Saint’s have. And I think that’s what M. Muller wanted to express when he talked about “It is an unsatisfactory faith which insists upon forensic proofs”. He said that to express the view of the Church : that this kind of faith (I called it the “Thomas faith”) is way below the higher kind of faith praised by Jesus… Having a faith of a child, that’s what Jesus (God) wants for his children. I think we’re here on earth for this reason : To gain more and more confidence. Why ? Whithout confidence, how can you be able to love ? No confidence, no love. This is as simple as this. Here I stop my second spiritual editorial of the day ! ; ).","date":"2011-12-22","mins":"12:21 pm","url":"https://shroudstory.com/2011/12/21/an-unsatisfactory-faith-insists-upon-forensic-proofs/","cat":"news_&_views","title":"An unsatisfactory faith insists upon forensic proofs"},{"id":"comment-125267","author":"yannick_clément","post":"I agree with you 100%. And the bottom line is this: if the Shroud is the product of a forgery, it cannot be anything else than a forgery made with the use of a real scourged and crucified corpse who present many signs of having been tortured with Roman methods. Because of this, I don’t see anyone in Europe during the 14th Century who could have done this or just even imagine to realize such a gruesome plan simply to create a false relic of Jesus burial cloth… As I said before, the only rational possibility that still exist (even if it’s very slim) is to think someone did this in the Middle East around the time of Constantine’s conversion (beginning of the 4th Century) and before he prohibited for good the use of this form of capital punishment….","date":"2014-05-28","mins":"10:56 am","url":"https://shroudstory.com/2014/05/28/goodness-me-look-what-ive-found/","cat":"flagrum","title":"Goodness me, look what I’ve found"},{"id":"comment-3474","author":"yannick_clément","post":"Hello Ron ! Thanks again for your comment. It’s hard for me to compress my argumentation since english is not my native language (I speak french). But, I’ll try ! The question we have to ask ourselves for this topic is this : Since it is proven that there is many types of shapes in the scourge wounds, does it necessarily means that there was many types of weapons used ? The answer is no. I won’t redo all my argumentation about it but I think, if you’re honest (and I know you are) you can agree with my answer to this question. I think claiming that many weapons were used is not the simplest answer to this question. I think the answer I’ve proposed (some slight differences in the transfer process for some wounds associate with some slight differences in the hits given during the scourge) is far more simple. If we take the Occam razor rule for this, I think my explanation is the best because it’s more simple. I don’t say that because I believe I’m better than anyone else. I just say that I honestly believe that, from all the knowledge we have about the Shroud, we don’t need a complicated explanation like the different weapons hypothesis (associate or not with many scourgings) to explain the different shapes of scourges we see on the Shroud. Of course, sometimes the simplest answer isn’t necessarily true but, in this case, with all the data we possess, I firmly believe it’s the most logical answer..","date":"2011-07-29","mins":"1:11 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3448","author":"yannick_clément","post":"I would like to add an argument about my response to Ron. I really don’t think the vast majority of the blood on the Shroud came from blood who was still in a liquid state. In fact, I believe it was a rarity. Personally, I assume that the scourge marks were done by a transfer from clotted blood who were becoming humid again. This is an hypothesis that was first develop by a French doctor named Pierre Barbet and much later, the chemical and microscopic analysis done by Alan Adler seemed to prove that Barbet was right on this particular subject. So, assuming that it is the case, we have to think this process of transfer took some time to operate, especially for wounds who were not bleeding anymore at the time of death. This process doesn’t happen instantaneously and it is logic to think it happen much more easily on wounds that were still bleeding at the time of death ! So, it is very normal to assume that the scourge wounds didn’t leave a big quantity of blood materials on the Shroud because they are wounds who were clotted long before Jesus died on the cross. It’s easy to think those wounds were not bleeding anymore at the moment of death. So, from my point of view, it is really normal to assume that those blood stains are very superficial and didn’t penetrate the cloth that much because the transfer process had surely a hard time to humidify them enough to permit a transfer on the cloth. In fact, I really believe we are lucky that there was even a transfer ! Other wounds like the wrist or the feet or the crown of thorns were still bleeding at the time of death. After death, when the body was laid in the Shroud, those wounds were surely clotted but I presume it didn’t take long for those wounds to start to be humid again and transfer on the cloth. And because these wounds were bigger and were more easy to transfer, it is normal to assume that those are the ones who penetrate the cloth all the way to the other side. But, for the scourge marks particularly, it wasn’t that easy to transfer ! So, in my mind, it’s normal that these wounds are really tiny on the Shroud and it is also normal to believe the blood from those wounds didn’t penetrate that much into the cloth. And, from all this argumentation I’ve made, I can postulate that the different shapes of the scourges wounds we see on the Shroud came probably from slight differences in the quality of the transfer of the clotted blood… Now, I think you got the whole picture of what I believe about the scourge marks, after reading a bunch of scientific articles and books on the subject. And I must admit that this particular subject is important because he can give us many clues on different aspects of Christ Passion, death and emtombment….","date":"2011-07-27","mins":"4:36 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3500","author":"yannick_clément","post":"Hello Ron (and anyone else) ! I can see by your answer that we’re exactly the same ! Like you, I’m no expert in sindonology but I’m very passionate by the subject and spend many hours reading many things about it and reflect a lot about this great mystery. I think it’s not because we’re no expert that we cannot think and make up our mind on the subject ! So, I hope we’ll continue to exchange our ideas on this blog and I’m sure that’ll lead more people to do the same thing, which is a very good thing… Sharing our ideas and hypotheses, along with a good argumentation based on hard scientific facts, observations and probabilities, could only be a good thing for everyone. And let’s hope that we’ll stay open minded enough to accept to ear ideas that are not the same than ours ! I surely did that in the past because, as time goes by, I’ve changed my mind on a lot of things about the Shroud. But one particular thing that I never changed since the beginning is the belief (it’s a belief, not a scientific certitude) that I have that this is indeed the Shroud in which the dead body of Jesus was put into the tomb on Good Friday….","date":"2011-07-31","mins":"7:45 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3476","author":"yannick_clément","post":"Little additional argumentation : I also think the explanation I’ve proposed is the most logical in regard of the knowledge we have about the transfer process of those scourge marks on the cloth. If we agree that those marks are made of blood material transferred from clotted blood, I honestly believe my explanation fits well with the scientific facts. Also, it’s probably the simplest….","date":"2011-07-29","mins":"1:52 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3482","author":"yannick_clément","post":"Me and my big mouth… : ).","date":"2011-07-29","mins":"4:40 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3502","author":"yannick_clément","post":"Now, I want to talk again about the Zugibe’s hypothesis of the washing of the corpse. I don’t know if it was part of Zugibe’s thinking or if it was even the starting point of his hypothesis but I know that some people believe in this hypothesis (not the majority of the medical experts) because they presume that we should see more blood stains on the Shroud than we actually see. Those people think that, after all, the man present so much wounds (particularly scourge wounds) that it would be normal to see more blood stains. I think this way of thinking would be accurate if the blood on Shroud came mainly from blood in a liquid state. It is not the case at all ! Most medical experts concluded that the majority of the blood on the Shroud came from clotted blood that had flowed down and clotted scourge wounds made on blood. The only places where the majority of the expert think there was a transfer of liquid blood are the feet, the lance wounds on the side and the blood flow we see in the lower part of the back. So, for me, it’s absolutely normal that we don’t see on the Shroud all the blood that was left on the dead body of Jesus (note : I often say Jesus because I believe it’s him. To be more scientific, I should say the man on the Shroud. Pardon me this wrongdoing). Since the majority of this blood had clotted since a long time (many hours), for me, it’s normal to assume that a good portion of it never get humid enough to be able to transfer to the cloth. So, the fact that the Shroud look “too clean” versus the possible amount of blood that should have been present on the scourged and crucified body isn’t a valid clue for me in favour of the washing of the body, because of what we know about the probable transfer process from clotted blood. Another clue that lead Zugibe to think that the body was washed is the fact that we actually see a body imprint of the back. In his thinking, if the blood stains on the Shroud could have prevent the formation of an image, then why wouldn’t be the same for the possible clotted blood that was surely (in his opinion) present everywhere on the back. Here, I will not comment on this particular (and interesting !) question because it would need a very long development. Maybe it could be another interesting topic to discuss in the future ? What do you think Dan ? : ).","date":"2011-07-31","mins":"7:53 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3501","author":"yannick_clément","post":"Yesterday, I’ve forgot to write this : Along with the Shroud, the Sudarium and the possible linen strips, there is a very good possibility that at least one more cloth full of blood would have been present inside the tomb on Good Friday. This possibility of another cloth come from the many blood flows that we see on the lower part of the back. As Pierre Barbet point out, those blood flows (that goes from the right side of the back all the way to the other side) is surely due to the use of another cloth for the transportation of the corpse from the Calvary to the tomb. This cloth should have been twisted to serve as a SANGLE and facilitated the transportation of the corpse without having to touch this bloody part of the body. This twisting of this cloth (now lost) would have caused the blood from the side wound to soak into the creases and left some blood on the skin of the lower back. For Barbet, it is this blood that has left some imprints on the Shroud in this area. For him, this blood was not necessarily in a liquid state but instead, just like the blood flow from the side wound, he was at the beginning of the clotted process when the imprints were made. In my opinion, this explanation of the many blow flows that we see on the lower back of the Shroud is the most logical. If we take this explanation from Barbet for granted, then that means 2 important things : 1 The body wasn’t put in the Shroud at Calvary but only when he reached the tomb. 2 This other cloth used for the transportation was surely left inside the tomb (because he was full of blood) along with the Shroud, the Sudarium and the possible linen strips… As I point out, some relics lists from Constantinople mentioned many cloths that were found inside the tomb. It is possible that this twisted cloth full of blood that was used for the transportation would have been part of the relics ? I think it’s surely possible !.","date":"2011-07-31","mins":"7:47 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3492","author":"yannick_clément","post":"Hello Ron ! Like I said yesterday, I came back to you about the specific question of the linen strips (and some other interesting topics). First, I want to emphasise again this important fact : It’s not because we don’t have any linen strips today associate with the Shroud that they never existed before ! So, I don’t think this argument you put forward is very strong to deny the possibility that the Shroud was tied up around the body, at least for some time in the tomb. That’s my personal feeling and you’re free to think differently. I also want to state this : The possibility that the Shroud was, for a time, tied up is not some dream I have about this. It’s not a personal concept that I put forward without any facts. It’s not a personal conception of what the configuration of the Shroud versus the body must have been. If I believe the Shroud, at least for a time, was tied up around the body, it is because some important OBSERVATIONS were made by the STURP team that lead me to conclude that. I also took another interesting observation from a good documentary on the Shroud. And there are also some historical clues that support this conclusion of mine. Taking the historical clues, one of them is that there are some lists of relics from Constantinople that mentioned not just the Shroud of the Lord but many cloths that were found in the tomb. Here’s a list of the historical references that I know : 1 At the end of the 11th century, Alexis Comnène the emperor of Constantinople wrote a letter in which we found a description of relics. Here’s an extract : “the CLOTHS found in Christ sepulchre after the resurrection.” 2 Around 1190, an anonymous description of the relics of Constantinople report this : “part of the CLOTHS that Joseph of Arimathea had the honour to envelop the crucified body of Christ.” 3 1200 : Nicolas Mesarites, the keeper of the relics in Constantinople, did a description of the relics. Here’s part of his description : “The funeral CLOTHS of Christ. They are in linen… because they enveloped, after the Passion, the incomprehensible dead coated with myhrre.” 4 In 1247, Saint Louis, King of France, bought many relics from the Constantinople emperor. In 1248, these relics were kept at the Sainte Chapelle of Paris until the French revolution in 1789. In 1534, there was a big inventory made and in this document, we found the mention “A part of the Shroud of Christ”. Today, the catalogue of the Sainte Chapelle associates this partial relic with LINEN STRIPS. Historically, we don’t know if it was really linen strips or just another cloth, but it’s interesting. Unfortunately, this particular relic, along with many others, was lost during the French revolution. So, that’s it for the historical references that I’ve found about MANY cloths that had been found in the tomb on Easter morning. So, historically, we can’t rule out the possibility that linen strips could have been used with the Shroud and kept as relics. The fact is that we don’t have them today but that doesn’t mean they never existed. And there’s a possible explanation for this disappearance : They could have been easily get lost during the sack of Constantinople or during the French revolution. Now, before analysing some observations that give us good clues about the use of linen strips to tied up the Shroud, we have to keep in mind that the blood stains and the scourge marks, without serious doubts (at least, from my perspective), were made by direct contacts. On the contrary, a vertical projection process account for the image coloration. Science tell us that we have 2 different processes for the Shroud… I don’t see any good arguments that can contradict that claim. Here, along with all the others observations that I’ve put forward during the last few days, I want to share with you 2 VERY interesting observations made by Miller and Pellicori that tend to prove that the scourge marks are made of blood and are not part of the image coloration. On the dorsal part, here’s what they saw : “Scourges are apparent through the scorched shoulder areas above the patches.” And on the frontal part, here’s another observation : “Through the scorches of the upper left arm, can be seen blood or scourges.” Because we know that the scorches are about the same color than the body image, if the scourge marks would have been part of the image coloration, it’s almost certain that we wouldn’t see them at all in the scorches areas. A proof of that can be found in the STURP paper “A Comprehensive examination of the Various Stains and Image on the Shroud of Turin” (Jumper, Adler, Jackson, Pellicori, Heller and Druzik). In this paper, the authors wrote this : “The chemistry of the lightly scorched fibrils is very similar to the chemistry and appearance of the body only image fibrils.” On the contrary, the blood, which possesses a different color than the scorches, can be seen in these areas. For me, when I look at the whole picture (and not just one isolated element), I have no doubt at all that the scourge marks are made of blood material coming from clotted wounds and are not part of the image coloration. I think I’ve showed you enough facts and observations to fully support that claim ! Keeping that in mind, it’s time for 2 important observations that gave us clues about the fact that the Shroud was probably tied up around the body for some time in the tomb. Here it is : 1 In their paper about the UV fluorescence photos, STURP members Miller and Pellicori noted this observation from the dorsal part of the Shroud : “Notice at the expected knee joint that there is no body image and LIMITED SCOURGING. Ron, you point out the fact that the body was in evident rigor mortis in the Shroud. The best clue to confirm this is precisely the knees that are bent like they probably were while Jesus was on the cross. It’s a clue that tells us the rigor mortis came rapidly while the dead body was still nailed to the cross. So, if the knees were still bent because of the rigor mortis, who can some scourge marks could have transferred on the cloth if the Shroud wasn’t tied up with strips of linen in this particular area ? If the Shroud was draped loosely all the time, from the moment the body was put in the cloth, sure enough, we wouldn’t see any marks at all along with no body image. So, if there’s some limited scourging in this particular area that WAS NOT IN CONTACT with the stone, the Shroud must have been tied up at the knees, for a time, to permit a direct contact between the cloth and the back of the knees. Notice that I say “for a time” because, from a logical standpoint, if the Shroud would have been tied up all the time, then the image process would have surely caused some coloration in this zone of probable direct contact and we would see an image of the back of the knees. It’s not the case ! To me, this is THE biggest clue that the Shroud was tied up with linen strips for a short time (long enough to permit the transfer of some “limited” scourge marks), and then, for whatever reason, he was untied and let loose over the body. After he was let loose, we can easily imagine the cloth falling down at the back of the knees until he (almost or completely) rest on the stone. Only after that, the image formation process began and, because the cloth was now away from the back of the knees, there was no formation of an image in this particular region. That’s the most logical hypothesis to explain this particular observation made by Miller and Pellicori. In fact, to me, this is the ONLY viable explanation from a scientific and logical standpoint. If anyone have a better explanation, I want to ear you ! Important note : I want to ear you only if your explanation is compatible with the known laws of physics ! Things like levitation are not acceptable from a scientific standpoint. 2 In an excellent documentary made in England some years ago and entitled “The wonder of the Shroud”, Father Martin Haigh, O.S.B., made a fine observation about the blood flow that we can see outside the body image of the right heel. By the way, I truly recommend this documentary to all of you. Along with the more recent “Unwrapping the Shroud : New Evidence” documentary, it’s the best documentary on the Shroud that I have ever seen. For a Catholic like me, this program was a real blessing ! It talks about the Shroud from a really nice Christian faith perspective. You can order the DVD of this documentary here : http://www.shroudvideo.com/. Getting back to the observation, Father Haigh point out the fact that the blood flow outside the right heel formed a mirror image. If you look at a negative picture of the Shroud, you can easily see what he means. Barbet state that the blood flows we see in the feet area (including the blood flow outside the heel) are a clear indication to him that they were formed by blood in a liquid state that came out of the feet after the body was laid on the back for the entombment. And, to him, it was surely one of the only places where we find blood stains coming from liquid blood on the Shroud. As Father Haigh point out, the blood dropped down from the feet to the heels and formed a pool there and some of this liquid blood went outside the right heel. Now, to explain why we see a double flow outside the heel with the form of a mirror image, Father Haigh explained this with the probable used of a linen strip that tied up the feet and caused the forming of a crease in the linen cloth that lead to the formation of a double stain of blood in this region (with a mirror effect). I really think it’s the best (only ?) way to explain this double flow that form a mirror image. And, as Father Haigh mentioned, small details like that are the best arguments we have in favour of the authenticity of the Shroud as a genuine Shroud of someone who’ve been tortured and died like Christ ! Those little details really help to deny any forgery theory. How in the world a forger could have thought to create small details like that, that are anatomically correct ??? Good question, don’t you think ? : ) Now, you have 2 important observations that gave us very good clues that, at least for a time, linen strips were used with the Shroud to tie it up around the body. I didn’t invent these observations ! I just found them while reading a scientific paper published by STURP and while watching a very good documentary about the Shroud. And these observations stocked in my mind when it came to analysing and understand the blood stains and the scourge marks we see on the Shroud. I firmly believe that we cannot understand properly the blood stains on the Shroud if we don’t assume that, for a time, there were linen strips that were used to tie it up around the body. I also want to state again that, if my transfer hypothesis is right for the scourge marks, it can well be another good clue that the Shroud is a genuine Shroud of someone who died exactly like Christ. Effectively, the fact that this direct contact transfer wasn’t perfect so that we see some slight differences in the shape of the scourges, this, to me, is a clear indication that it was a natural transfer process that came from real scourge wounds of a real tortured man. We can assume that it wouldn’t have been normal to see all these clotted wounds being transferred perfectly everywhere on the cloth while leaving a stain exactly of the same shape ! The contrary would have been strange enough to the point we could think of a forger’s work ! Be, fortunately, it’s not the case on the Shroud. All the scourges have not been perfectly transferred to the cloth. Some are more evident to see than others… And some are MUCH more evident to see than others ! This lead me to point out another interesting observation made by Miller and Pellicori in their STURP paper about the UV photos. It’s an observation that applies to another aspect of the question we discuss recently. They notice that, on the frontal and on the dorsal part, there is some scourge marks that are not visible in normal light but only visible in UV light. It’s pretty much like some tiny blood stains can only be detected with UV lights on a crime scene. I think it’s a very good confirmation of what I said previously about the probable superficiality of the scourge marks on the cloth. To me, that’s why we can’t see these marks on the backlight photos. This observation fits very well with the idea that the scourges are mainly a superficial transfer of clotted blood on the cloth surface, unlike most of the other blood stains who were more fresh and/or more important in size so they could go way deeper into the cloth (many of them goes all the way to the other side of the Shroud). And this observation proves that the transfer of clotted blood from these scourge marks wasn’t done at the same exact intensity and there is some scourges who are more perfectly shaped and much more evident than others. This tends to prove that we are in presence of a NATURAL transfer phenomenon from clotted blood and not an artistic forgery done with real human blood or with red ochre and vermilion. In a forgery, we would expect to see scourge marks about the same intensity everywhere and, consequently, we would expect to see all of them very easily. It’s NOT the case on the Shroud ! Joe Nickell, Dr. Karl and all the other sceptics will have to explain this to me ! : ) Again, I have to say that I’m sorry for the length of this message but I had too much info and arguments to share with all of you !!! I hope you people (and particularly you Ron) will find this message interesting and helpful for your reflexion !!! P.S. : At the very beginning of the documentary, Father Haigh mentioned something VERY IMPORTANT that we, who are passionate about the Shroud, should ALWAYS REMEMBER. Here’s what he said : “I think there is a danger that, during the last 30 years or so, or attention was being focussed far more on the historical and scientific aspects of the Shroud at the expense of a close examination of exactly what is ON the Shroud, the image that is on the Shroud. That’s fundamental because that’s where the main argument is in favour of the authenticity of the Shroud !” I think the double blood flow off the right heel is a perfect example of that. We don’t have to be an historian or a physicist to see a sign there for the authenticity of the Shroud. I think everyone here should never forget this comment. So write down this comment on paper and put it on our fridge !!! And I really hope some of you will bought this wonderful documentary ! It’s really worth the price !.","date":"2011-07-30","mins":"5:05 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3478","author":"yannick_clément","post":"Hello again Ron ! If there’s scourges who are not made from direct contact, then what ? You think some of them are part of the image and some are made of blood ? I have some difficulty to follow your reasoning here. In my mind, it’s all made of blood or all made of image coloration, not both… And what do you do of the fact that the UV photos paper published by STURP mentionned that, for most of the scourges, we clearly see a serum ring around them ? This is a clear indication that those scourges are made of blood material… Maybe I don’t understand well your idea ? I think you will have to explain more in details what you mean by some scourges made of direct contact and some others made from non contact..","date":"2011-07-29","mins":"3:34 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3458","author":"yannick_clément","post":"Hello Ron ! Excellent remarks my friend ! You make me think and it’s a good thing ! I don’t have much time right now for a big reply but I’ll take some time tonight to write you an appropriate comment and post it tomorrow on this page. Right now, I can make a short reply to your last comment about the hypothesis of many weapon used to scourge Jesus. First, I must admit that I didn’t thought about this possibility. It’s an interesting one… Bravo ! But I’m a bit perplex about it. If we take the Gospel account of the Passion for granted, then there’s some chances that Jesus was wearing his tunic on the way to Calvary while carrying his cross. The relic of the Holy Tunic of Argenteuil in France, with all the blood found on the back (same AB blood type than the Sudarium and the Shroud) could be a confirmation of that, but it’s controversial because the C14 dating about this tunic gave a 7th century date. It’s funny because it’s the same thing about the Shroud and the Sudarium ! Anyway, if Jesus really was wearing a tunic during his way to Calvary, I don’t think we should expect the addition of serious injuries on the skin from some whipping. Another good argument against this possibility is the fact that Jesus was so exhausted that he wasn’t even able to carry his own cross all the way. So, taking this fact into account, it is highly doubtful that the Romans would have whipped him a lot and with enough violence to add more injuries on his way to Calvary. The Romans surely didn’t wanted Jesus to die before being crucified ! That’s why they requested Simon to help him carrying the cross… What do you think of those 2 arguments ??? I think it’s fair to assume that all the scourges marks were done prior to the carrying of the cross. To finish this comment, can I ask you a question ? Are you a scientist or someone who is an expert of the Shroud ? You seem very well inform on the subject !!!.","date":"2011-07-28","mins":"10:46 am","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3479","author":"yannick_clément","post":"Hi Maria ! Just a little word to invite you to read the message that I wrote in this same page especially for you. Here’s the details about the message to make sure you don’t miss it : July 29, 2011 at 10:57 am Presently, I think it is message #10 of this page..","date":"2011-07-29","mins":"3:39 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3472","author":"yannick_clément","post":"Here’s a message specially for Maria from the Portugese center of Sindonology. First, I have to thank you for your kind words and your interesting comment. The question you ask at the end is a very good one and recently, I’ve came up with the same explanation than you !!! Exactly what you said. The only way, in my mind, we can explain that there’s scourge marks in places where there’s no body imprint (like the back of the knees), is to think the Shroud was first tied up with linen strips (this configuration can explain very well the scourge marks) and then, after a time that must have been short(and before the image formation process begin), the linen strips were removed (for an unknown reason) and the Shroud was left loose over the body. To me, that’s the only scientific and logic way to explain both the blood stains (with scourge marks) and the body image… Some other explanation (like the body was floating in air in a levitation state) is pure non sense from a scientific point of view. And a supernatural proposition like that doesn’t even fit with all the scientific data we possess about the Shroud ! So, from my perspective, I think your hypothesis on the question is really the best..","date":"2011-07-29","mins":"10:57 am","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3372","author":"yannick_clément","post":"The important thing about the scourge marks on the Shroud is this : The dumbell shape marks are more consistent with a normal Roman flagrum than a normal medieval whip… But there one thing I would love to see : an artifact of a real Roman flagrum. I think I’ve just seen reproductions so far… If someone have an image of a real artifact, please share it with me (with us) ! Thanks !.","date":"2011-07-21","mins":"3:58 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3470","author":"yannick_clément","post":"Hello Ron (and everyone else) ! As I said yesterday, here’s my response to your message about Zugibe’s hypothesis. First, I want to say that, when I wrote the first message that is on top of this page about the fact that blood in a liquid state was probably a rarity on the Shroud, I was really expecting someone to bring forward the washing hypothesis of Zugibe ! I didn’t expect necessarily that it would be you. I think it’s another good comment from you ! As you point out, this hypothesis is highly contested by others doctors who studied the Shroud, starting by Barbet in the 30s. And I should say that it is not an easy subject regarding the Shroud mainly because of the scourge marks. Effectively, we could expect to see more blood on the Shroud, especially on the back and the hypothesis of Zugibe seem to answer the problem. But, if the hypothesis of the clotted blood becoming more humid is correct, I think it’s normal to see only the blood directly on and around the scourge wounds were there would necessarily be more blood crust (and more thick). I think it’s fair to think this crust could have become humid enough to stain the cloth. Also, I think it’s possible, as you point out, that many of those scourge wounds would have re opened before the corpse was put in the Shroud, or, at least, some oozing would have occurred in the wounds areas (Barbet talk precisely about that in his wonderful book). On the contrary, the blood that would have come down from the scourge wounds (it would be logic to assume there was some) was surely clotted since a very long time and wouldn’t be very thick. So, it’s pretty logic to think that this blood didn’t became humid enough to leave a stain on the cloth. I think the humidity hypothesis can explain why there’s not so much blood on the Shroud, especially in the scourge areas. Sure enough, we can assume that the body was covered with much more blood than we see on the Shroud but we can think that some crust of clotted blood was there for too long and/or was too thin so they didn’t became humid enough to stain the cloth. I honestly think it’s the best explanation to understand the blood stains on the Shroud. Of course it’s not a proven fact but it’s a pretty good answer to the problem, don’t you think ? Coming back on the Zugibe’s hypothesis, I want to say that I’ve seen an interview of Gilbert Lavoie on Shrouduniversity.com recently and he mentioned that, from the researches he made in the Mishna and the Talmud, he found out that, when someone died while bleeding, this blood couldn’t be washed at all. Another important point is this : if there was both blood shed in life and shed after death, all the blood couldn’t be washed because it was considered mingled blood and should be buried in the tomb with the corpse. In fact, from what I know, the Jews believed the soul of someone was carried in the blood and that can explain why, if there was blood shed after death, the body shouldn’t be washed. Even the blood who dropped on the ground could be taken to the tomb ! So, to me, the opinion of Lavoie on this particular subject is consistent with what we know of the way the Jews from this time looked at the blood. That can also explain why the Sudarium was left in the tomb because it was covered with blood. On the contrary, Zugibe said that, from his point of view, only the blood shed after death shouldn’t be washed. Who can we trust then ? Zugibe, to support his hypothesis, also report a comment from a Jewish rabbi who state that the normal burial procedure was to wash the body and anoint it even on the Sabbath. Personally, I would say that the fact that the women had to come back to the tomb early Sunday morning to anoint the body contradict directly this affirmation ! Also, this claim seems to talk about a normal death. It doesn’t tell if it was a normal procedure to wash a criminal who died on the cross and shed blood after death. Here, I want to point out some problems I have with this hypothesis (if you can answer them people, thank you !) : 1 I have a great difficulty to believe that the persons who buried Jesus would take fine precautions to wash ONLY the blood shed in life while trying hard to avoid touching the blood shed after death. It is more logic to think it was all of one or all of the other. They washed the body or they didn’t washed it… Obviously, if the body of Jesus was washed, it wasn’t washed completely ! Why ? 2 It’s a fact, the blood on the arms, on the head and on the hair that we see on the Shroud is consistent with someone who’s in a upright position. For me it is obvious this bleeding was done while Jesus was on the cross ! From the stand point of Zugibe’s hypothesis, since it is mostly blood shed in life, it should have been washed. So, why this particular blood, obviously, wasn’t washed ? Don’t make any sense to me. 3 If the body was washed, why aragonite dirt was found on the heels ? And if the body was washed, why dirt was found on the left knee and on the nose area ? Don’t make any sense to me. Ron, you said that the body should have been covered with dirt because he was laid down on the ground at the foot of the cross. It is logic to think that way. But, since dirt was only found in the areas that I mentioned, we have to think of a logical explanation. The best I can found is to assume that the body was laid down on some rocky ground at Calvary and not on a soft ground made of dirt. In fact, from archaeology, we know that the all the region of Calvary (outside the walls of Jerusalem) was an ancient stone CARRIÈRE and that the Golgotha was a rock. So, I assume that the dirt who was found on the Shroud was stocked to the body on the way to Calvary. If I’m wrong, then I don’t understand why they found dirt only in some precise areas like the nose, the knee and the heels… I wouldn’t be logic. 4 Almost EVERY blood stains (including the scourge marks) are surrounded by a ring made of serum that came from the retraction of the blood during the clotting process. For Adler, it is obvious that it is a good clue that the blood stains came from decals of clotted blood as firstly proposed by Barbet in the 30s. I’m not a specialist but I have great difficulty to believe that serum rings like we found everywhere on the Shroud could originate from an oozing of liquid blood coming out of the wounds after the washing of the body (as postulate by Zugibe). And if someone can answered this question, I would really appreciate : Do you know if blood in a liquid state can produce serum ring like we see on the Shroud, AFTER being transferred to the cloth ? 5 Even if we think the washing should have been done (with the researches done by Lavoie, it’s not obvious), we know from the Gospels that the Sabbath was approaching and it was a Grand Sabbath because of the Passover feast. It is obvious that the time factor should be considered while analysing this question. It’s logic to think they didn’t had a great length of time to do the entombment. And a good clue that they didn’t had any time left for an hypothetical washing is the fact that the women had to come back early Sunday morning to anoint the body, a procedure who should have been done, along with the washing, on Friday. In my mind, if the washing was on their to do list, along with the procedure to anoint the body, why they did only part of the whole procedure ? It’s not very logic. I admit that the time factor isn’t the biggest fact against this washing hypothesis because, as claimed by Zugibe, the washing could have been done very fast. Even this last statement is not evident from my point of view because, if we follow Zugibe’s idea, determining which blood have to be wash and which blood have to be left on the body is a process that must take some time ! But, anyway, when we look at the whole picture (stains of blood consistent with someone who was crucified, presence of dirt on many parts of the body, presence of serum stains around almost every blood stains that is consistent with clotted blood), it is not obvious at all that the body was washed… Personally, I don’t buy it. That’s it for all the problems I have with Zugibe’s hypothesis of a washing of the body. I think there are enough problems here to reject this hypothesis. But, sure I’m not a specialist, so I can be wrong. So, if someone can resolve all the problems I just mentioned, I’ll be the first to believe Zugibe was right ! On the other hand, many medical specialists seem to have the same opinion that me on this question, so, I don’t think I’m so off target here ! And Ron, when you said that no linen were found until this day and is a clue for you that there wasn’t any linen strips used in the tomb, I can reply this to you : Where are the other cloths used to wash the corpse ? They surely haven’t done this washing bare hand ! So, why these other cloths (containing the blood of Christ !) haven’t been kept like the Shroud and the Sudarium ??? Good question don’t you think ? In my mind, between linen strips and cloths full covered with the blood of Christ, I think the disciples would have kept the cloths that were used for the washing. What do you think of that ? But, more seriously, the fact that we don’t have with us today those possible linen strips or the possible cloths used for the washing, I don’t think it’s a very strong argument against the possibility that they really have been used in the tomb. And I think I have strong arguments to show that linen strips were used to tied up the Shroud against the body in the tomb (at least for a time). Since this questions need a long development from me, I’ll post another comment about this tomorrow… Getting back to Zugibe, right or wrong, the biggest thing to notice with his washing hypothesis is that, he too, like Barbet, Lavoie, Adler, Bucklin and others specialists, believe that the scourge marks were made of blood who was transferred by direct contact to the cloth. That’s the most important thing in my mind. Zugibe is another medical specialist who supports the idea that the scourges are not part of the body image. It’s evident for him that they are made of blood, just like every other blood stains found on the cloth. That’s what’s important to keep in mind here. Also, the fact you mentioned the Sudarium researches is a good thing. I also believe this relic is directly related to the Shroud. And I think the researches done on this cloth are great to understand better what happen to Jesus. Effectively, these studies state that the body was left about an hour on the cross after death and then, was put down at the feet of the cross for another hour. So, imagine the dead body lying there on the sun for at least 2 hours before being put in the Shroud. I think this can explain better why so much blood stains (especially the scourge marks) did become humid enough to stain the cloth. Again, I’m not an expert but it’s logic to think that the heat of the sun and the humidity (contributing to keep the dead body real warm) plus the fact that the skin was surely covered with sweat at the time of death could have humidified again many clotted wounds (even some who were clotted since a long time). I’ve read many contradictions about the transfer of blood on the cloth but I’ve came to the conclusion that, whatever exactly was the process, it involved mostly clotted wounds who became humid enough to stain the cloth. Now, did the clotted blood became humid again after the body was put in the Shroud (as Barbet’s thought) or was most of it was humid enough before the enshrouding, I’m not sure, even if right now, because of the possible factors I’ve just mentioned, I think it would be logic to think that most of the clotted blood was already humid (at least to some point) when the body as put in the cloth. So, I think it’s fair to assume that most of the blood transfer must have started really soon after the enshrouding and I still think this transfer process from clotted blood was the same for the scourge wounds..","date":"2011-07-29","mins":"8:34 am","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"},{"id":"comment-3425","author":"yannick_clément","post":"Just another quick word to make things more clear. The first sentence from the conclusion of the UV photo study made by Miller and Pellicori from STURP in 1981 state this : “The sharp deatils revealed for the first time, particularly in the scourges, suggest that intimate cloth body contact occured.” This conclusion seem to suggest 2 things : The scourge marks were transfered by direct contact to the cloth and not by a projection (just like every other blood stains), and also, the cloth must have been draped very tight around the body (at least for some time) to permit the transfer of as many scourge marks as we see everywhere on the Shroud..","date":"2011-07-26","mins":"1:03 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3424","author":"yannick_clément","post":"Taking the backlight of the Shroud, it’s an interesting point you made. But, I think it can be due only to the fact that those marks are really thin. And, we must always consider the hard scientific facts contains in the STURP papers that really point toward a bloody nature for those marks. That the main argument for me to believe they are made of blood. Now, for the expected places where we can think there was a contact between the Shroud and the body, it is really hard to say for sure because nobody was there in the tomb ! All we have his hypotheses that can come up close to what was the real configuration in the tomb but I don’t think any honest scientist can claim that he has found FOR SURE AND WITHOUT ANY DOUBTS the exact position of the Shroud versus the body. Also, if we take the scourge marks as made of blood and we consider the fact that blood on the cloth come from a direct transfer, that’s a very good indicator of the fact that the cloth must have been in really close proximity with the body almost everywhere from head to toe (at least for some time). I think those scourge marks are somewhat of a good clue to think the cloth was, at least for some time, tied up to the body with linen strips. That can explain why we can see scourge marks almost everywhere in the body image. Here, it’s only my personal interpretation of what the scourge marks can tell us. And since I’m no more an expert than you, here’s another personal argument in favor of the bloody nature of the scourge marks (2 cents worth) : In the nefative photos of the Shroud, EVERY scourge marks came out white, just like any other blood stains on the cloth and just like any blood stain would came out today in a normal negative photo !.","date":"2011-07-26","mins":"10:51 am","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3445","author":"yannick_clément","post":"Hello Ron ! Your last comment is very interesting. I think your totally right about the Jackson hypothesis of the side strip ! I’ve made the same reflexion that you : If the side strip would have been used to tied up the Shroud around the body, it is almost sure that we would see blood marks on this side strip. Excellent remark. But don’t forget one important thing : It is not because the hypothesis from Jackson is wrong that there were not some others linen strips used to tied up the Shroud around the body (at least for some time) and so, to permit the transfer of all those scourge marks we see almost everywhere on the Shroud. I think the probability for this kind of use during the burial is high. Concerning your point about the image formation mechanism versus the scourge marks, I would say this : If we assume those are made of blood materials coming from clotted blood (I think I’ve supply enough pieces of evidences from the STURP papers to support this idea), then we must assume that those marks were made from direct contacts between the body and the cloth. Every honest scientist who had studied the Shroud has come to the conclusion that the blood stains were made from direct contact. Of course, there’s still your point about the backlight photo of the Shroud that seem to support at first Baima Bollone hypothesis that the scourge marks are of the same nature than the body image, but I think this fact alone is not enough to really support this idea when you compare it to all the scientific data that exist and who point toward a blood nature for the scourge marks. It’s funny because right now, I’m reading a book that can help to explain this phenomenon while still thinking the scourges are made of blood. The book I am reading was written by Baima Bollone in 2000 and the title is “101 questions about the Shroud of Turin”. In it, the author indicate that, during the examination of the cloth in 1978, he noticed that some blood stains had penetrated all the thickness of the cloth and reach the other side while some others blood stains did not penetrate the cloth at all and therefore, were very superficial (he didn’t mention any particular area where it happen). But, with this information in mind, I think there’s a fair possibility that the scourge marks could fit this last description. Regarding their very sharp aspect and the fact that they are not big stains, it think those marks could well be pretty superficial, that is to say that the blood material who probably compose them didn’t penetrate the cloth that much. I think it is logic to think that. In my mind, this could be the best explanation why we don’t see them on the backlight photos. At least, because of the fact that some blood stains are very superficial on the cloth, the observation that the scourge marks are not visible on backlight photos cannot rule out the possibility (very high in my mind) that they are made of blood materials. One thing’s for sure, to make up our mind on this particular topic, we must look at the whole picture and not just one particular detail. Regarding all the facts and observations reported by STURP or Baima Bollone himself, I think the best explanation for the scourge marks is that they are pretty superficial and made of blood material coming from clotted blood. In the present state of our knowledge about the Shroud, I honestly think it’s the best answer. Of course, the analysis of those high definition photos could be a very good thing to support or discredit my conclusion, but I think another series of direct testing (with chemical analysis of fibres taken directly from those scourge marks) would be the best way to know the truth once and for all and finally end this debate !.","date":"2011-07-27","mins":"12:01 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3379","author":"yannick_clément","post":"Thanks M. Di Lazzaro. I was aware of this study but, personnaly, different types of marking from the scourging didn’t necessarily mean that different instruments were used… I think it has more to do with the way those scourge marks were transfered to the cloth, probably by direct contact from clothed wounds like every other blood stains. In my mind, many could have transfered perfectly (dumbell shape marks) and some others may have transfered less perfectly (other types of marks like the scratch marks). I think we must be really prudent when it comes to analysing those blood images on the Shroud. And I really think it’s scientifically logical that not every scourge wounds have been transfered to the cloth in the same exact way even if they came from the same flagrum. I think it’s logic to think that some wounds were more humid than others and then, their tranfer to the cloth was better… And for me, the idea that every scourge wounds didn’t transfered exactly the same way (some more perfect than others) is another good clue that this Shroud is an authentic shroud of someone who’ve been scourge and crucified just like Jesus Christ !.","date":"2011-07-22","mins":"8:36 am","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3426","author":"yannick_clément","post":"Oups… Little error : You should read “Sharp DETAILS”..","date":"2011-07-26","mins":"1:04 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3386","author":"yannick_clément","post":"Hello M. Di Lazarro. Thanks for your comment ! I agree that, when it comes to specific details about the Shroud, there’s always many hypothesis out there. But, the question is : which one is the best ? Personally, I’ve always opted for the most logical and simple explanation when it comes to judge between 2 hypothesis. Always trying to keep in mind the historical context of the first century Palestine is one good way for this. Also, always keep in mind all the facts that came out of direct examination of the cloth (mainly the work done by STURP because it was published in peer reviewed journals) is another good way for this. First of all, to have a good judgement about the scourge marks, first, we have to determine the correct nature of these marks. I know that some medical specialists don’t agree on this particular subject. Some say it is blood marks (I think we can fairly say that it is the majority of them) and some others say it is part of the body image. I think I have a VERY good argument to claim that these scourge marks are probably made of bloody materials from clotted scourge wounds that were transferred to the cloth by direct contact, just like the vast majority of the blood stains on the cloth. The transfer took place because these clotted wounds had become humid enough to permit it (by a process called “fibrinolysis” or simply because of the aqueous atmosphere of the corpse trapped into the shroud). Here’s my main argument : Recently, I’ve read the STURP paper “Ultraviolet Fluorescence Photography of the Shroud of Turin” written by Vern Miller and Sam Pellicori and published in 1981 in the Journal of Biological Photography (peer reviewed journal). In it, my attention was caught by the observations made about the scourge wounds. First important finding : This UV study clearly show that there is some differences in the types of scourge marks on the cloth. And here’s another important findings from this UV study : There is the presence of a fluorescent ring buffer around almost every scourge wounds under UV light ! It had been showed (by Alan Adler in particular) that those fluorescent rings around the blood marks are serum stains coming from the retraction of clotted blood. A ring buffer like that is clearly a scientific sign of the presence of blood and serum. So, even if I’m not a medical expert, the presence of these serum stains around almost every scourge marks (thanks to the UV photos from STURP, it’s a proven fact) are a clear indication that those marks are really what they appear to be : blood stains ! When it comes to analysed the nature of the images on the Shroud, little details like the fluorescent rings around the wounds are really important ! Another really interesting observation made by Miller and Pellicori is that the scourge marks were generally a little more detailed on the dorsal image than on the frontal image. With these 2 FACTS in mind, we are in a better position to judge the hypothesis proposed regarding the fact that there are different types of scourge marks on the Shroud. There’s 2 main hypothesis on this subject : Some explain it by saying that there was many weapons used and some explain it by saying that it is due to the fact that some scourge wounds were better transferred to the cloth than others. I prefer the second because, to me, it is a more logic and simple explanation than the first one. I think it’s more easy to think that some scourge marks are different than others simply because the transfer process of the blood clots on the cloth was better for some wounds than others. I think it’s logic to assume that some scourge marks were more pressed on the cloth than others (the better quality of the marks on the dorsal image under UV light seem to prove this point) and I also think it’s logic to assume that some scourge marks were more humid than others. These arguments provide an excellent and simple explanation for answering why there are different types of scourge wounds on the Shroud. Another important thing : These arguments are consistent with the observations taken from the STURP paper written by Miller and Pellicori. Then, it’s logic to think that the transfer process was probably better for some wounds than others. To finish with this hypothesis, I have to mention another possible explanation that can be added. We can assume that the same scourging instrument could have produced different types of wounds depending on the way it was used (depending on the force of the hit, then angle of the hit, the position of the soldier who hit, the distance of the soldier versus the scourge man, etc.). I think it is also fair to assume that, because there was 2 or 3 leather tongues on a typical Roman flagrum, each tongue could also produce some slight differences regarding the types of wounds. Then, we can assume that some scourge wounds were more superficial than others and also, some slight differences could be seen regarding the shape of the wounds. I think these last arguments can complement the hypothesis of the blood transfer from the scourge wounds. The first hypothesis is less logic in the sense that we have to assume that every scourge marks were transferred at the same intensity level, no matter where they were on the body and how hard they were pressed on the cloth. Logic tell us that the scourge marks on the back have more chance to be better transferred to the cloth and that’s exactly what came out of the UV photos study made by Miller and Pellicori ! But I have to say that the authors also state that theses differences in the precision of the wounds are less important than what they expected at the beginning (but still, the wounds of the back are a little more detailed those on the front). Another problem for me with the first hypothesis is the lack of explanation for the changing of instrument during the scourging process. Why the torturers would have needed to change their weapons during the course of the scourging ? I don’t think it exist any historical references about the use of different weapons during a typical Roman scourging. Lastly, we have also to assume that each ones of the scourge wounds had the same humidity degree to be transferred perfectly so we can see the difference of the markings done by different types of weapons… For me, there’s too much problems to solve here. The other explanation is much more simple and logic..","date":"2011-07-22","mins":"3:42 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3391","author":"yannick_clément","post":"I have to say that I found your message really bitchy and I don’t appreciate that. Sorry if I offend you. I hope you can admit that you’re not more an expert on this field than I. So, can we share ideas without bitter comments ? I don’t think my message was bitchy regarding you (and sure it wasn’t a personal attack), so I expect the same from you… OK ? First of all, my opinion wasn’t based on indirect observations. I have the paper of Miller and Pellicori at home and I’ve read it CAREFULLY. You ? I’ve also bought and read carefully the book from Alan Adler and the one from Ray Rogers. I’ve also read many other papers published by STURP and, maybe you’ll be surprised, but I’ve also read the paper you published with Giulio Fanti about your UV lasers experiments ! It’s not because I’m not an expert in medical field that I’m a twit ! I still have a brain and he works pretty good. I have all the right to make a judgement (as you can too) that is based on facts reported in a peer reviewed journal by an expert in his field. Vern Miller was a real expert to analysed UV photos. He reported fluorescent halos around almost every blood stains AND almost every scourge marks. This is not a joke or something due to hasard. And sorry to contradict you but the serum halos surrounding the blood stains were confirmed by a chemical study by Alan Adler. By the way, I recommand you to read the great book from Adler (The Orphaned Manuscript) that was published soon after his death. You can find it here : http://holyshroudguild.org/orphaned manuscript.html You’ll see some articles by Adler where he confirm the nature of the fluorescent halos around the blood and scourge marks. It is a confirm FACT that those fluorescent halos were composed of serum coming from the retraction of clotted blood. And I have to add that Ray Rogers, in his own book, made things clear about the fact that, after chemical tests, there wasn’t any other body liquid found on the cloth other than blood and serum (he didn’t even found traces of sweat). This is another observation of great value. You talk about Baima Bollone’s opinion. I can talk about Pierre Barbet, Robert Bucklin, Alan Adler or Gilbert Lavoie’s opinion too who think that the scourge marks are made of blood material !!! But, to judge of the quality of an hypothesis versus another one, beside these contradictory opinions from doctors, I mainly based my judgement on pure hard scientific facts and observations. It’s a proven fact that there is serum halos surrounding almost every scourge marks because chemical tests by Adler proves that these halos were composed of serum comming from clotted blood. As Rogers said it well in his book, we can take an observation or a fact for granted only if we have an independent confirmation. In regard of those fluorescent halos around the scourge marks, that’s exactly what we have ! Adler confirmed the fact that these are serum stains and Miller and Pellicori showed that these stains where present around almost every scourge marks. Since we are pretty sure of the presence of halos of serum around the scourge marks, it is natural to think that the nature of those marks are the same than the other blood stains. So, it look like the scourge marks are really made of a transfer from clotted blood just like almost every other blood stains. What’s wrong with that ??? Why should Baima Bollone should be right on this particular point ? He’s a human being and his judgement can be incorrect. Barbet, Adler, Bucklin, Lavoie, etc. They all think the scourge marks are made of clotted blood and they’re not of the same nature than the body image… And STURP studies seem to confirm their ideas on this question. What’s wrong with that ??? This fact suggest to me that the different scourge marks on the cloth are mainly due to slight differences regarding the quality of the transfer process from clotted blood to the cloth. What’s wrong with that ??? I think the hypothesis of many weapons is incorrect in regard of the FACTS we know. What’s wrong with that ? After all, this paper published last year in Frascati is only an hypothesis and it’s not an accepted theory !!! I think I have the right of my opinion on this topic and I think I’ve based my judgement on real scientific facts and not on my imagination or on my personal conception of Roman scourging… Again, what’s wrong with that ??? To conclude, you wrote “This means Shroud is a very difficult topic, and the only hope is to continue to study by using the most advanced instruments and technology.” I TOTALLY AGREE WITH YOU ON THIS POINT ! In my mind, the biggest contribution that would be made from a new serie of direct researches on the cloth (let’s call this STURP 2 !) is that we could confirm or invalidate all the conclusions made by STURP some 30 years ago. And you know what I think ? Most of STURP conclusions would then be confirmed… I’m pretty confident in saying this… But, like every other message I wrote here, it’s just my personal opinion ! Thank you to open your mind enough to accept the fact that, here, I can freely express my opinion, even if I’m just a geographer with a bachelor’s degree and my name isn’t Einstein… And I want to add that we can disagree on many things regarding the Shroud but that doesn’t mean we are ennemies !!! On the contrary, I think it’s really positive to share our different opinions on this mysterious relic… Don’t you think ???.","date":"2011-07-23","mins":"6:27 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3397","author":"yannick_clément","post":"Hello M. Di Lazzaro ! I’ve found another important piece of evidence that help to confirm the fact that the scourge marks are really made of blood material, just like any other blood stains. It came from the great article of STURP entitled “A comprehensive examination of the various stains and images on the Shroud of Turin”. This article was written by Eric Jumper, Alan Adler, John Jackson, Sam Pellicori, John Heller and James Druzik. In it, on page 460, there’s a little section who describe the scourge marks and here’s what we can read : “Under UV fluorescence, they appear to be DARKER THAN THE IMAGE and, also, to be much more sharply defined than they appear in visible light, AS WOULD BE EXPECTED ON THE BASIS OF THE KNOWN SPECTRAL CHARACTERISTICS OF IRON PORPHYRIN COMPOUNDS.” Since iron porphyrin is a component normally found in blood, I think this observation is really important to confirm the fact that the scourge marks are made of blood materials coming from clotted wounds. And if the scourge marks were part of the body image, why they would appear darker than the image, like the rest of the blood stains, under UV light ? These observations plus the observation of a fluorescent halo around almost every scourge marks in UV light should be enough to affirm, without any serious doubts, that the scourge marks are made of blood material and are not part of the body image. In this same section of the article from STURP, it’s written that the scourge marks appear to be somewhat different from the other blood image in the sense that they are more sharply defined. I think it’s this observation who contribute to create an ambiguity around those marks and lead some people, like Baima Bollone, to think they were part of the body image. But all the other observations that I just reported tend to confirm the fact that they are really made of blood and they are not part of the image. It’s just that their shape is more precise and defined than other blood stains. Finally, I think the possibility that these scourge marks are composed of both blood materials and image coloration is pretty low on the probabilistic scale. I don’t know for you, but when I read these facts (reported in peer reviewed journals), my reaction is this one : For the moment, I consider the scourge marks to be made of blood materials coming from clotted wounds and, until another direct analysis of the Shroud can be made that would invalidate these observations, I rule out the possibility that the scourge marks can be part of the body image. Thinking that way is not so dumb because I base my judgement on published scientific FACTS… I hope you, and everyone who read this, will find these observations useful to make up your mind on this particular subject. And I really suggest anyone who’s interested in the science of the Shroud to find the articles published by STURP and to read them carefully. There’s a lot of clues in there that can really help to understand better this relic. P.S. : By the way, I must admit that I fully agree with the comment posted by Impman !!! : ).","date":"2011-07-24","mins":"5:52 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical"},{"id":"comment-3657","author":"yannick_clément","post":"It is written : “The guest (Barrie M. Schwortz) who is an Orthodox Jew, believes that the image on the shroud really is Jesus!” Barrie is a personal friend of mine and I just want to correct something here : Barrie is not an Orthodox Jew at all. He is a Jew who believe in God but who doesn’t participate in the cult of the Sabbath at the synagogue. We can say that he’s a believer but doesn’t practise his religion like many Christians ! The rest of the sentence is completely true; Barrie believe that the Shroud is the genuine Shroud of Jesus of Nazareth. Now, for the question of Jesus being the Messiah, Barrie is not there yet !!! : ).","date":"2011-08-22","mins":"3:22 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","title":"Razor Swift: The Shroud Of Turin Is Real!"},{"id":"comment-3685","author":"yannick_clément","post":"And the persons who analysed forgery hypothesis tend to always forget one particular and very important argument that goes against every forgery hypothesis : The question of the blood on the Shroud ! I’m sorry for the Joe Nickell of this world, but there is no way a forger could artificially create those blood marks that came mainly from clotted blood. NO WAY ! PERIOD ! I even doubt that a team of medical specialist could even create those stains today as perfectly as we see them on the Shroud ! And when you add the FACT that those blood stains were on the cloth first and then, the image formation process begin, it’s even more illogical to believe a forger (from any period of time) could have create this. The only thing left as a weak possible explanation (beside the idea that the Shroud is an authentic burial cloth of someone who suffer the same torture than Christ) would be to think that someone else was really crucified and that his body was put into a shroud. But, here again, there’s a problem : How can you explain the fact that the body disappeared from the cloth before the first signs of putrefaction (40 hours roughly) and without disturbing the blood stains ? Good question, don’t you think ???.","date":"2011-08-24","mins":"1:06 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","title":"Razor Swift: The Shroud Of Turin Is Real!"},{"id":"comment-3786","author":"yannick_clément","post":"Warning : The opinion that will follow doesn’t come from a doctor or a specialist in blood but come from someone who can think and who have read a lot on the subject. Of course, my point of view can be wrong but this is really what I think… I have to disagree a bit with the point of view of M. Winkle. The first thing that came in my mind when I saw the scourging scene of Mel Gibson’s movie was : Not realistic at all ! Gibson, for theological purpose more than for the sake of realism, wanted his Jesus to be bleeding as hell and one way he found to achieve that was to put cutting things in metal (almost like claws) at the end of the leather tongues of the flagrum but, sorry, this is not historically accurate AND this is NOT what we see on the Shroud ! The real flagrum had metal BALLS or round animal BONES at the end of the leather tongues, not metal CLAWS. The goal wasn’t to cause maximum bleeding as many people seem to believe but instead, the principal goal to achieve was to take away the strength out of the person to avoid any kind of resistence from him before the crucifixion. The person was so weakened by the scourging that he could not put up a fight before the crucifixion. And the fact that Jesus had problems to complete his way to the cross and that he died after only 3 hours is an indication that the scourging must have been pretty hard on him. So, the fact that there’s around 120 marks of scourging on the Shroud and that we see them on around 65% of the body is a good indication for this. Sure, the flagrum had multiple leather tongues (2 or 3 tongues and sometime, more than this), so it’s not really 120 hits that he received but, on the other hand, it is almost sure that some bloody scourge marks were not transferred to the Shroud because they didn’t touched the cloth. Here we can think that those hidding scourge marks were mostly on the belly under and around the arms and some could have been under the knees. Also, we must not forget that some more scourge marks could have been on the upper arms and shoulders but, unfortunatelly, the 1532 fire did great damage to this area, so, we’ll never know how much marks could have been there. Little interesting information about this part of the cloth : In the UV fluorescence photos examination made by Miller and Pellicori of STURP, they reported that they could see some scourge or blood marks in the same zone than the scorch marks. Of course, those scourge or blood marks were extremely difficult to see in normal photographs, but they could see them on their UV photos ! Very interesting. It’s an observation that tend to confirm what I once said here : that the scourge marks were made of bloody material transferred to the cloth and they have nothing to do with the body image. It’s a clue for this because, if those scourge marks were part of the body image, it would have been VERY difficult to see them under the scorch marks because both types of image possessed almost the same intensity. The balls or bones at the end of the leather tongues caused probably more a “bloody bruise” kind of injury than all the cutting that is shown in Gibson movie. As I say, Gibson find this trick to achieve his theological goal : showing as much blood as possible to make people understand the sacrificial aspect of the Passion and death of Christ (like the sacrificial lamb of the Passover). Sure, the tongues of the flagrum could have caused some cutting injuries that caused some bleeding (probably where there was more than one hit at the same place) but, in the end, the most important injuries were the bloody bruises that we see on the Shroud and those injuries didn’t causes much bleeding… This is my opinion and you’re free to think something else….","date":"2011-09-04","mins":"9:44 pm","url":"https://shroudstory.com/2011/09/03/the-passion-and-the-scourging/","cat":"flagrum","title":"The Passion and the Scourging"},{"id":"comment-122742","author":"yannick_clément","post":"Already asked myself the same question David (which is like : is it the chicken or the egg?) and I came up convinced that the first option (i.e. The Byzantine icons of Christ were based directly or indirectly on the Shroud image) was much more probable than the second option. Why? Simply because we know for a fact (thanks to the STURP team) that the image on the Shroud comes from some kind of interrection (still undetermined) between a real crucified corpse and the surface of the cloth. So, because of this fact, if the second option would be true (i.e. The Shroud image is based on the Byzantine icons of Christ), that would mean a forger would have needed to find a victim that looks almost exactly like the bearded man we find in most Byzantine icons and then, tortured and crucified him in order to produce a false relic of the Shroud of Christ (not only of the bloody stigmata of Christ but also with an image naturally produced by the corpse or by some product placed on the corpse, like burial spices or something like that). This scenario seem so ludicrous and unrealistic that it is not hard for me to trust in the other one!.","date":"2014-05-21","mins":"2:08 pm","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","title":"The Vignon Markings Issue:  A Promoted Comment"},{"id":"comment-8232","author":"yannick_clément","post":"And here’s what Vignon thought about the great similarities he found between the Shroud image and the Mandylion’s copies or between the Shroud image and the Pantocrator : A special feature of this iconographic evidence is the evident likeness of the isolated head of the Shroud to the Mandytions. With long hair, staring eyes and absence of neck, it almost seems to be their negative. Could this similarity, coupled with the anomalies common to both, give us the moral certainty that the Shroud was the unique acheiropoietos, kept, as Vignon believed, in some monastery easily accessible to the theologians and artists of Edessa? For centuries it was a holy, but mysterious and embarrassing relic; suddenly, under pressure from the Monophysites, the Orthodox Clergy realise the role that could be played by a copy of the Face of the Shroud, if turned into a living portrait of Christ. The climate was right in the sixth century with the decline of relics in favour of icons. The Abgar legend with Ananias5 role as painter was to hand. All that had to be done was to have a copy made on cloth, “process” it by incubation, give it a plausible miraculous origin and the desired weapon was there to confound the Monophysites (Note : this was an heretic group that was present in the Middle East from the 5th to the 7th century, and that doesn’t believe in the humanity of Christ. In fact, they just believe in his devine nature), put the Persians to flight and become in course of time the most holy Mandylion. Have we here then the unique source of all “true likenesses”, Veronicas, Epitaphioi and the “figured shrouds” of the West? This came from an excellent paper written in 1969 by Maurus Green, an historian monk. So, you can see that Vignon never thought one second that this Mandylion could have been the Shroud ! On the contrary, the high level of similarities was for him a proof that the Mandylion was a false relic made from the Shroud !!! EXACTLY WHAT I WAS TRYING SO HARD TO MAKE YOU UNDERSTAND DURING THE PAST WEEK !!! I HAVE NOTHING MORE TO SAY THAN : I AGREE COMPLETELY WITH VIGNON’S POINT OF VIEW ! If the Pantocrator is an icon made by an artist from the Shroud image, why not also the Mandylion ??? Because the Church proclaim it an image not made by hand ??? COME ON !!! Sadly, history prove that it would not have been the first time that some people from inside the Church would have create a false relic for “not so catholic” purpose !!! Indeed, what better than a picture of the human face of Christ that he supposedly created himself in a miraculous way, to reinforce the orthodox doctrine which he had in himself the two natures, human and divine? At least in this case, it would have been created, not to make money, but to fight heresies… It’s not a very nice way to do so, but it was done at least to defend a Catholic truth, namely the reality of both human and divine nature of Jesus Christ… So, if you want an advice from me, I would say : forget this Mandylion hypothesis and look for something else that got more solid arguments and facts instead of a bunch of speculations and extrapolations. I think the hypothesis of Vignon is just that because it really on the real historical context of the 6th century when the Mandylion suddenly appeared in Edessa (and when the first Pantocrator was also created). This hypothesis, historically speaking, is MUCH MORE CREDIBLE. If we use Ockham razor, this one reach a much higher level on a probabilistic scale than the one of Ian Wilson… Of course, this information is present in the paper I’m currently writing because I want people to realize that there are other solid options beside the hypothesis of Wilson… Sadly, most people only focus their attention on Wilson’s ideas and drop all the rest ! Of course, Vignon’s hypothesis doesn’t answer all the questions for the Shroud’s ancient history, but if we are able to read between the lines, it is possible to understand that this relic was considered problematic and even scandalous for the Church of that time (because of all the BLOOD on it and also, because it present a DEAD and NAKED body of Christ). So, in that regard, it is possible to postulate the idea that this relic was known at least from the 6th century on but, during all those years before the sack of Constantinople, it was probably kept inside a reliquary and never publicly showed because of his very particular aspect. On the contrary, because the Mandylion was showing a living Christ without any injuries or blood stains, it was a much more interesting “tool” for the Church to use against any heresies of that time ! Vignon talk about the Monophysites, but it was the exactly the same thing between 726 and 843, when the Church was fighting against the Iconoclasts. Effectively, during that time, the Mandylion was often used by the defenders of the sacred images to prove that Christ himself agreed with the veneration of sacred images because he had created one himself !!! During all those wars against heresies, the Church never used the Shroud and his image to fight heretics. In fact, the Church probably created and used the Mandylion, simply because it was a relic much more “presentable” for the time than the Shroud… We have to look at this subject with the eyes of that time and not our modern eyes ! The historical context is the most important aspect to keep in mind… Sadly, most people don’t do that and think the Church of that time would have used the Shroud to “prove” the resurrection ! This way of thinking is modern and out of context… The Church wouldn’t even had this possibility during that time because the Shroud aspect was simply scandalous for most people ! P.S. : I know everyone’s here (beside maybe Dan) will completely disagree with me (Wilson’s propaganda have sadly worked marvelously well in the Shroud world) but I DON’T CARE. I bring you good information about the subject and you do what you want with it….","date":"2012-02-14","mins":"10:44 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"},{"id":"comment-122743","author":"yannick_clément","post":"Quote: “I think even in the 6th century, people were smart enough to know whether something was made with paint or not.” Reply: Not necessarily in the context of a Church who tell them what to believe or not! So, if the Edessan Church of the 6th Century have created a false relic of Christ (as a teaching tool and also in order to fight the few heretical groups of Christians present in that city at that time in history), of course they would have make believe the image was not painted and of course many Christians would have followed blindly what the Church was telling them! This kind of blind religious following happen all the time throughout history and even today. And think about that: Why many Christians seem to be certain that the image on the Guadalupe Tilma is not painted? BECAUSE THE MEXICAN CHURCH HAS TOLD THEM SO FOR ALMOST 500 YEARS!!! To me, there are some stricking similarities between the two relics and the most obvious is the fact that both relics have been used by the local Church who owns it in order to convert and teach people and also in order to fight heretical groups (in the case of the Tilma, the heretics were of course not some other Christians, but the indians who were following their pagan gods of nature)….","date":"2014-05-21","mins":"2:09 pm","url":"https://shroudstory.com/2014/05/20/the-vignon-markings-issue-a-promoted-comment/","cat":"art","title":"The Vignon Markings Issue:  A Promoted Comment"},{"id":"comment-8236","author":"yannick_clément","post":"Some may be tempted to ask me why I think the hypothesis of Vignon should reach a higher point on a probabilistic scale than Wilson hypothesis ? Simply because the hypothesis of Vignon fits much better with the general depiction of the Mandylion we can find in the documentary and artistic ancient sources (i.e. : a small cloth showing only the living face of Christ, without any blood or clear signs of injuries). Also, it doesn’t need the use of a bunch of speculations and extrapolations to work….","date":"2012-02-14","mins":"12:37 pm","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"},{"id":"comment-8235","author":"yannick_clément","post":"Little correction : You should read that : I think the hypothesis of Vignon is just that (meaning : an hypothesis that got solid arguments) because it rely (and not “really”) on the real historical context of the 6th century when the Mandylion suddenly appeared in Edessa (and when the first Pantocrator was also created). Sorry for this error….","date":"2012-02-14","mins":"11:38 am","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"},{"id":"comment-8245","author":"yannick_clément","post":"Last comment for today : If Vignon is not off track with his hypothesis (and I think he’s not), then we have to realize that it is almost impossible that the Shroud, on the contrary of the Mandylion, was a false relic made by an artist or a forger before the 12th or 13th century ! Exact… Since the appearance of the cloth would have been totally scandalous for that period of time, no way a forger would have want to offend his public by producing a relic with that level of horrific details and with a naked body of Christ… NO WAY. So, unless the C14 dating is correct and the Shroud was really produced during the 13th or 14th century (of course, I don’t believe this one second), then we have to realize that it is almost certain that it is a real burial cloth of someone. I don’t say this for Ron or guys like that who already know that. I say this to all the skeptics out there. Historically speaking, the Shroud could not have been forged before the 12th century. His aspect is simply not consistent with the religious art of that time. It is simply a relic too much horrific and crude for that period of time..","date":"2012-02-14","mins":"5:27 pm","url":"https://shroudstory.com/2012/02/14/the-vignon-markings-more-evidence-against-the-radiocarbon-date-for-the-shroud-of-turin/","cat":"art","title":"The Vignon markings: More evidence against the radiocarbon date for the Shroud of Turin"},{"id":"comment-121588","author":"yannick_clément","post":"I have not followed the comments of people on this page… But here’s my personal opinion on the Vignon’s marking issue: In William Meacham’s paper « The Authentication of the Turin Shroud », he cites Philip Mc Nair, a Doctor in Philosophy who studied the history of Christianity, who said, very cleverly: “It seems to me otiose, if not ridiculous, to spend time arguing… about the identity of the man represented in the Turin Shroud. Whether genuine or fake, the representation is obviously Jesus Christ.” And why could this man said this with so much confidence? Because of the great similarity that exist between the Shroud man’s face and the most common depictions of Christ in ancient Byzantine art, starting with the Christ Pantocrator icons. Vignon could have been maybe wrong on some points (in fact, I’m pretty sure he was on a few), but if we look at the global portrait of the situation, he was certainly correct: Most of the ancient Byzantine representation of Christ (and of course, I include the Mandylion in that group) are showing great similarity with the face on the Shroud. So much in fact that it’s certainly not a coincidence due solely to hazard. It’s evident that there’s a connection there that is strong enough to be taken as a good piece of evidence for the presence of the Shroud as early as the apparition of the first known Christ Pantocrator icon, around the year 500 A.D..","date":"2014-05-19","mins":"6:11 pm","url":"https://shroudstory.com/2014/05/13/vignon-was-wrong-but-well-carry-on/","cat":"history","title":"Vignon Was Wrong But We’ll Carry On"}]
