[{"id":"comment-3224","author":"yannick_clément","post":"Since M. Di Lazarro and his colleague M. Fanti believe the image of the Shroud was produced by with a corona discharge or a UV burst of light during the resurrection of Christ, I want to offer you, the readers of this wonderful blog, a little personal reflection about the image of the Shroud. My reflection is focused on the widespread idea that the image on the Shroud would be due to a byproduct of the resurrection of Christ. This thought came to me recently while reading the STURP article on ultraviolet photographs of the Shroud taken by Vern Miller (Ultraviolet Fluorescence Photography of the Shroud of Turin. By V.D. Miller and S.F. Pellicori, JOURNAL OF BIOLOGICAL PHOTOGRAPHY, July 1981). First, I want to specify an important fact and too often ignored when it comes to the image of the Shroud : In the photos in natural light as much as the pictures in ultraviolet light, there are certain body parts that are not visible. For example, we do not see the feet on the frontal image, as well as the part behind the knees on the dorsal image. If this image was actually caused by the resurrection of Christ, it is miraculous in nature. So don’t you find it strange that God failed to “print” in is totality the image of His Son on the cloth ? If this incomplete image was really the result of the resurrection of Christ, then God would be a poor artist. Indeed, it would mean he would not have been able to finish his “work” in full ! He would have left an image of Jesus’ body with missing parts ! The incomplete image that is on the shroud, although very beautiful and very detailed, gives me much to think it is the result of one or, more likely, many complex chemical processes. Complex processes, yes, but, at the same time, NATURAL. And if that is indeed the case, it is reasonable to think that this image is that of Jesus Christ, but BEFORE the time of his resurrection ! Personally, this image talk to me about the Passion of Christ way before it talk about his resurrection, even if some “signs” (not proofs) of it can be seen on the shroud (with the eyes of faith). I talk about the fact that there was a body in this Shroud, but he didn’t corrupt there. Also, the fact that the blood stains on the Shroud are mostly complete without evident signs of missing parts give the impression that the body simply disappear… The great quality of those stains is really hard to scientifically explain in the context of a body with a lot of blood on it, who would be put in a Shroud and then, many hours later, taken off the cloth. To me, this is the main SIGN (NOT PROOF) of the resurrection of Christ we can see on the Shroud ! Nobody, M. Di Lazarro, M. Fanti or anyone else, will ever be able to scientifically prove the resurrection by using the Shroud or by using anything else from the material world. In this domain, FAITH is needed..","date":"2011-06-04","mins":"7:21 pm","url":"https://shroudstory.com/2011/06/03/it-is-impossible-to-say-that-the-image-of-the-holy-shroud-is-a-fake/","cat":"science","title":"It is impossible to say that the image of the Holy Shroud is a fake?"}]
