[{"id":"comment-14461","author":"yannick_clément","post":"For a long time, my estimation of the probability that the Sudarium was used on the same head than the Shroud was very high. But since a month or so, I’m not so sure about that !!! I have a very important question regarding the level of coherence between the 2 cloths. I have send some emails to some researchers but so far, I never was able to get a precise response for this important question. I have even done a Google research about that and come up empty, which I though was pretty strange… So far, I just get an weak answer from the Spanish forensic researcher who has leaded the research about the Sudarium (doctor Hermosilla) who told me that the Spanish Centro could not answer me about that since it was a question relevant to Baima Bollone. Since that time, I’ve tried 2 times to reach Baima Bollone (I’ve got his email adress from a friend) but go no reply, which is also a bit strange, since my question is very clever and relevant. I still search to get a precise answer and when I’ll found it, I’ll come back to all of you via Dan to let you know both the question and the answer. And I’m convinced that this answer will help us to evaluate more correctly if the Shroud and the Sudarium really were in contact with the same bleeding head. I hope to found something in a near future… Stay tune !!!.","date":"2012-08-03","mins":"8:14 pm","url":"https://shroudstory.com/2012/08/02/how-good-is-the-match-up-between-the-sudarium-and-the-shroud/","cat":"blood_studies","title":"How good is the match up between the Sudarium and the Shroud?"},{"id":"comment-207281","author":"yannick_clément","post":"There are a lots of data coming from the Sudarium (for me, the most important is the high degree of uniqueness of that relic and its gruesome and realism aspect that do not show any artistic value) that seems to indicates that it probably covered the same head as the Shroud, but nevertheless, there are still some questions left for me to be as convinced as I am concerning the authenticity of the Shroud. To be certain that this relic is as genuine as the Shroud, I think I will have to wait until an independent DNA comparison that would not be done by the Spanish team of sindonology, but by a team who have not made any researches on Christian relics. By the way, even if I have no serious reason to doubt the honesty, professionalism and expertise of that Spanish team who analyzed the Sudarium, I would love to see their work being redone by that kind of completely independent team of researchers. I think it would be a very good thing to see hapenning. Same thing for the Shroud by the way..","date":"2015-08-02","mins":"4:13 pm","url":"https://shroudstory.com/2015/08/02/interview-with-mark-guscin/","cat":"sudarium","title":"Interview with Mark Guscin"},{"id":"comment-31659","author":"yannick_clément","post":"Wrong. Ask Barrie Schwortz about that. He saw the Sudarium with his own eyes ! He told me personally that the blood on that cloth was not looking like the blood on the Shroud. It was looking normal for an old blood (i.e. Brownish). Also, I never read a serious paper or a serious book about the Sudarium that was pretending the blood on the cloth was reddish in color. That important discrepancy must be explain by those who believe the Sudarium had been in contact with the same bloody head as the Shroud! Presently, to my knowledge, this question has never been explore in deep and has never even been address properly..","date":"2013-04-23","mins":"3:51 pm","url":"https://shroudstory.com/2013/04/23/new-video-on-the-sudarium-of-oveido/","cat":"news_&_views","title":"New Video on the Sudarium of Oveido"},{"id":"comment-32090","author":"yannick_clément","post":"Quote : “The Oviedo cloth has not been subjected to the same level of intense investigation as the TS.” I disagree completely with that opinion simply because, on the contrary to the STURP team investigation, I’m not aware of even just one paper published by the Spanish team of sindonologist concerning the Sudarium that was published in a serious peer reviewed journal !.","date":"2013-04-27","mins":"6:38 pm","url":"https://shroudstory.com/2013/04/23/new-video-on-the-sudarium-of-oveido/","cat":"news_&_views","title":"New Video on the Sudarium of Oveido"},{"id":"comment-31667","author":"yannick_clément","post":"This is evident. The scientific knowledge concerning the Sudarium is far more limited than the Shroud. In a perfect world, the Vatican would allowed a same scientific team (a kind of CSI team of experts) to fully analyze both cloths side by side in order to see if both were really used on the same corpse. Light must be shed on this issue..","date":"2013-04-23","mins":"4:39 pm","url":"https://shroudstory.com/2013/04/23/new-video-on-the-sudarium-of-oveido/","cat":"news_&_views","title":"New Video on the Sudarium of Oveido"}]
