[{"id":"comment-4441","author":"saleire","post":"Also…they say at Wikipedia of the likeness on the badge: The Brass Effigy is of the son, French Knight Geoffroi de Charny II. It is presented for historical reference only since there are no known images of the father. It is said to be an authentic likeness to the father as well and the son. The Effigy translation was generously provided by author Ian Wilson. It states as follows: ‘Here lies the noble man Monsieur Geoffroy de Charny at one time seigneur of Thory, in the district of Beauvais, who died the 22nd day of the month of May 1398. Pray God for his soul.’.[8] The Effigy is frequently represented elsewhere as being of the father but the translation clearly shows it is of Geoffroi II, the son..","date":"2014-08-12","mins":"11:44 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"},{"id":"comment-4440","author":"saleire","post":"Just a passing thought…I once read that Jacques de Molay was crucified on the back of a door where he was held prisoner, then, left to the point of death before he was taken down and revived….in this time, could they have wrapped him in cloth. They also say that Geoffroi de Charney who was burned at the stake was possibly the uncle of the Charney who was the first recorded owner of the ‘Turin Shroud’ …….","date":"2014-08-12","mins":"11:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/04/22/was-the-shroud-of-turin-intended-as-a-visual-double-entendre-with-an-martyred-knight-templar-serving-as-proxy-for-the-crucified-christ/","cat":"1314","title":"Was the Shroud of Turin intended as a visual double entendre – with an martyred Knight Templar serving as proxy for the crucified Christ?"}]
