[{"id":"comment-21156","author":"vivian","post":"We are to speak the truth in love (Ephesians 415) for those who are fond of quoting scripture. We should be careful not to try to appear superior in our knowledge of scripture, or to use that knowledge to belittle others. If the book brings people to Christ, that is a good thing. The experience was related to the parents by their four year old child. Do you think it might be possible that, because he was four at the time, he embellished certain events, but that the basic story is true? You are seriously worried about him lying to God? The parents are brave people who knew they would face criticism and ridicule, but their purpose was to help others and hopefully bring them to Christ..","date":"2012-12-26","mins":"8:59 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3205","author":"vivian","post":"I had a death experience 48 years ago (at age 17) when no one was talking or writing about them. Only one Christian doctor believed what I told her about what I experienced, even though she had never heard of such a thing! I have not read any of the books about heaven before “Heaven is for Real” because I did not want to taint my memory. At the time, when I told what happened to me I was hospitalized and told I could never go back to live with my parents because I refused to change my story. I was told I must have been halucinating because my home was TOO religious! However what Jesus told me came to pass. I never had an other another grandmal seisure after the one that put me into the hospital where my ministry started to survivors of sexual abuse. I have been ministering in that field every since. I also minister to very ill and dying people to ease their transition over to the after life. The 1st thing I thought of when I was in heaven was: “heaven is really real” so all the things I had been taught in Sunday school are REAL! That is why I read this book. What he said about the colors and how he described Jesus matched what I remember except the MARKS were not in the palms of his hands but in Jesus wrists. This was hard for my mind to comprehend as the only pictures I had seen had scars in the palms of the hands. So I did a study on crucifiction and found out that the nails were placed in the wrist in order to hold the weight of the body. I then went to the web sight to check out Akiane’s pictures. They are the closest I have ever seen to what I remember Jesus looked like when I saw Him. Our God is so faithful and loving to care for us the way He does. Praise Him for all the little glimpses into heaven that He gives people here on earth. They help to strengthen people’s faith..","date":"2011-05-29","mins":"8:38 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
