[{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"“If molecular and atomic technology were applied to the Shroud, it could determine, once and for all, the source of all dated samples. It could further test all proposed explanations for the Shroud’s radiocarbon dating and its unique images from naturalistic to artistic to miraculous. This technology could independently reveal the Shroud’s actual age, the identity of the man buried within it, if it is a forgery and whether a miraculous event occurred to the dead body wrapped within it.”\nReally? How about publishing a detailed protocol (here?), listing all these gee-whizz non- invasive techniques? Have they been piloted on textiles, especially ancient or even modern linens? Links?\n\n","date":"October 31, 2013 at 1:46 pm","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49345","author":"colinsberry","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"Any link to the petition itself? I’m curious to its wording.\n\n","date":"October 31, 2013 at 2:56 pm","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49350","author":"David Goulet","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"For the petition, CLICK HERE. As far as I can tell there are about 235 signatures since April over at ipetition.com. Not many names that I recognize. \nSee: Antonacci Proposing Molecular and Sub-Atomic Testing To Resolve Disputes Regarding the Shroud\nAnd: Speaking of more scientific testing of the shroud \n\n","date":"October 31, 2013 at 3:24 pm","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49352","author":"Dan","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"I notice Antonacci has dropped his claim that his article in the Chinese (or is it Nigerian) internet only, Brooklyn Bridge vanity journal was peer reviewed. Try to find a real physical address for the journal. I doubt Antonacci has any substantive support from any scientists in the shroud community. I hate to think what this is about when you see the same organization of his sponsoring the St. Louis conference.\n\n","date":"October 31, 2013 at 3:35 pm","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49353","author":"Paulette","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"Why is Antonacci’s book publisher putting out this press release?\n\n","date":"October 31, 2013 at 3:39 pm","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49354","author":"Paulette","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"Marino signed the petition on May 9th. So this press release is stretching the truth a bit. There are about 20 duplicates, as many anonymouses, a few stupid names like Bippy123 and a dozen or more Antonaccis. I trust the pope will not be fooled. We should not be.\n\n","date":"October 31, 2013 at 5:52 pm","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49369","author":"Paulette","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"Much as it is easy to understand and even agree with petitions to the Pope, ultimately it does seem that Pope Francis will not buy this. He is very intelligent and blunt-spoken, “fired with the spirit of Christ”, as Church of England primate Archbishop of Justin Welby remarked after meeting him for the first time. If he sees the slightest hint of it being a question of Shroud versus Faith, there will be no positive results.\n\n","date":"October 31, 2013 at 5:53 pm","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49370","author":"Louis","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"On a closer reading, one finds that Antonacci’s protocol is less about “scientific testing” and more about hunch-confirming, his chief aim being to pick up additional signatures of his hypothesized particle irradiation, over and above that pesky surplus of C-14. (How inconsiderate some might think of the Creator to send a love-letter to the 21st century  that was spoiled ,at least for some of us, with its cavalier disregard of accepted grammar as to sow seeds of doubt re authenticity.). What’s more, it’s ideologically-driven hunch-confirming, given Antonacci seems intent on re-starting the Holy Crusades (seriously – just read his own background literature that might be described as Christian-supremacist). OK, this is getting heavy, so I’ll stop here.\n\n","date":"November 1, 2013 at 3:09 am","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49397","author":"colinsberry","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"What, in the petition, does ‘minimally scientific’ mean? The only meaning I can suggest is that science should be pushed as far to one side as possible. Is this what Mark Antonacci is suggesting? I would caution Joe Marino to keep clear of this one if he does not want his conference to become a bit of a farce.\n\n","date":"November 1, 2013 at 3:59 am","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49401","author":"Charles Freeman","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"Seems as though you may suffering from something I get from time to time Charles, called Word Loss Syndrome, It’s a defensive ploy by the brain to make better sense of the world by failing to see certain words, such that what remains makes a great deal more sense. The word your brain filtered out was “invasive”, leaving just “minimally …….. scientific. Don’t fight it. Indeed, there’s an even more sanity-preserving variant of the condition called “Multiple Word Loss Syndrome” to which I feel myself being inexorably drawn…\n\n","date":"November 1, 2013 at 4:56 am","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49406","author":"colinsberry","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"PS. Seriously though, I now find you are absolutely correct about the adjective being missing from the petition, viz:\nWe Request That Pope Francis Allow Sophisticated and Minimally Scientific Testing to be Performed on the Shroud of Turin. \n\n","date":"November 1, 2013 at 5:05 am","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49407","author":"colinsberry","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"Thanks, Colin. Yes, i did double-check with the original  before making a fool of myself!  It has clearly not prevented people signing up – but it does throw into question this whole enterprise and clearly there should be caution all round.\n\n","date":"November 1, 2013 at 5:29 am","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49413","author":"Charles Freeman","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"The only actual test I can find being proposed anywhere is “multispectral imaging,” which is what was carried out in 1978. I dare say it could be done a good deal better with current technology, but to wrap it up in flimflam like “if molecular and atomic technology were applied to the Shroud…” seems disingenuous to me. Or am I missing something?\n\n","date":"November 1, 2013 at 5:27 am","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49412","author":"Hugh Farey","site":"shroudstory"},{"title":"Press Release:  Marino Endorses Antonacci Petition and Proposal","post":"Have you not heard, Hugh? There’s a gee-whiz technology, a spin-off I believe from the Mars Rover program called PITS. From memory, the letters stand for “Particle Interrogation, Total Scan”. Each atom or molecule, i.e. particle, is called up one at a time and required to give an account of itself – what it does, why it is there etc, that information being extracted autonomously by spectral scanning. For something as large as the Shroud, one needs the full Monty, which is known in some quarters as the absolute PITS.\n\n","date":"November 1, 2013 at 5:43 am","url":"https://shroudstory.com/2013/10/31/press-release-marino-endorses-antonacci-petition-and-proposal/","cat":"news_&_views","id":"comment-49416","author":"colinsberry","site":"shroudstory"}]
