[{"id":"comment-197020","author":"emmett_mcmahon","post":"Hi, I’m that old, non scientific guy who in my long life had a few messages from my Guardian Angel. I had written a reply to these sites about a message that I received about the Shroud of Turin. He told me that I am looking at “THE Image of the Living Jesus Christ”. Doing another C 14 test seems to be a very good idea., but please don not cut into the image of Jesus’ body. You are only trying to resolve the date of the fabric, are you not? Maybe take a small piece of the fabric that has the so called ‘scorching’ on it..","date":"2015-04-21","mins":"3:36 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-129034","author":"emmett_mcmahon","post":"All I can say is that I have pity for souls of those who go out of their way to disparage God’s signs..","date":"2014-06-13","mins":"5:15 am","url":"https://shroudstory.com/2014/06/13/the-beat-goes-on/","cat":"hacking","title":"The Beat Goes On"},{"id":"comment-50078","author":"emmett_mcmahon","post":"Anyone who knows me knows that I am not a scientist. However if I understand what I have read here and when I looked up just what thymol is – I am of the impression that they were unconsciously sabotaging their own work. It seems to me that for what ever reason and by what ever unknown method that the Shroud has been and is being preserved. I would have to say that it is God’s will for this to be..","date":"2013-11-05","mins":"3:34 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-50215","author":"emmett_mcmahon","post":"There is nothing wrong with researching and finding better ways to live in this world that diven to us to live in and use for the betterment of mankind in his physical existence, However, there is something about the way some of this research into just how the Shroud is portrayed or demonstrated to still be in existence. Something about some of the writings brings to mind the 1st book, of the Bible and the Tree of Knowledge. Mankind wanting to learn to be as God..","date":"2013-11-06","mins":"3:46 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"}]
