[{"id":"comment-209571","author":"emmett_mcmahon","post":"On the Slide 15 3 D Image you can see the right eyeball of Jesus (left eye looking at it). As I was staring at this photo some time back when it was 1st shown on the Internet The image seemed to grab me mentally – that is when I heard the voice of my Guardian Angel tell me that I was ” looking at the image of the live Jesus Christ”..","date":"2015-09-04","mins":"4:58 am","url":"https://shroudstory.com/2015/09/04/what-do-we-really-know-about-volckringer-patterns/","cat":"3d","title":"What Do We Really Know About Volckringer Patterns?"},{"id":"comment-177218","author":"emmett_mcmahon","post":"I think I understand what is being said but I don’t think I could explain it ..","date":"2014-12-17","mins":"5:49 am","url":"https://shroudstory.com/2014/12/17/a-gedankened-image-forming-process/","cat":"image_theory","title":"A Gedankened Image Forming Process"},{"id":"comment-42257","author":"emmett_mcmahon","post":"Thank you Josie, you are a much more eloquent speaker than I am. You hit it on the nail head. It has taken until these days to really prove and accept what the Shroud really is. It is not just an old shred of cloth from some dead guys grave..","date":"2013-08-28","mins":"7:35 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","title":"When is a Scorch NOT a Scorch?"},{"id":"comment-52292","author":"emmett_mcmahon","post":"And what manner of science did the Holy Mary use when she envisioned Gabriel when he gave her God the Father’s message about her being chosen to be the Earth Mother of The Son of God, Jesus ? Why did she not think that this was an instrument of Satan?.","date":"2013-11-21","mins":"3:13 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-42183","author":"emmett_mcmahon","post":"At first this may seem like a weird question, but did the disciples make any comments about the Lord’s dirty laundry or what ever it was referred to as in those days?? that was written about in the Bible??.","date":"2013-08-27","mins":"11:21 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","title":"When is a Scorch NOT a Scorch?"},{"id":"comment-40540","author":"emmett_mcmahon","post":"Hi I am not a person of many words. In no way can I understand how the image of Jesus Christ on the Shroud of Turin can be considered a “graven image”. I ended up having to look up the term in a few dictionaries. One of them described spiritual words used in the Bible and the others were common words. In no way can I see how our Lord Jesus intended for people to treat that image as a God. It is what it is, an image of Jesus after he was dead and covered with the linen and placed in the grave. There may be some supernatural or spiritual aspects to the image because of his resurrection but those in themselves do not make the image a God, it is just an enhanced image. Has anyone ever seen photographs of their own family members whom they love or even of them selves? What is in your mind when you look at them?? Maybe some people misconstrue their own thoughts??.","date":"2013-08-05","mins":"5:16 pm","url":"https://shroudstory.com/2013/08/05/why-would-jesus-defy-the-2nd-commandment-and-create-a-graven-image-unto-himself/","cat":"news_&_views","title":"Why would Jesus defy the 2nd commandment and create a \"graven image\" unto himself?"},{"id":"comment-42146","author":"emmett_mcmahon","post":"Oh Boy, As I have said before, the Shroud of Christ is a gift from God to us. Believe in it if you will. I hope that I am misconstruing what I am reading. It kind of looks like some people have to know how the Shroud was made to look as it does. They want to do it them selves. They, seem to me, to be wanting to mimic God. Wasn’t that already attempted by the one we have named Satan ?? You have already determined it was not human made, accept that and don’t try to be a God and make one for yourselves….","date":"2013-08-27","mins":"2:24 pm","url":"https://shroudstory.com/2013/08/27/when-is-a-scorch-not-a-scorch/","cat":"image_theory","title":"When is a Scorch NOT a Scorch?"}]
