[{"id":"comment-213588","author":"emmett_mcmahon","post":"Oh Boy, I am not a scientist. My skills are as knowing that it is easier to find your way around in the daytime with the light somehow provided by the Sun than it is at night time with or with out moon light (reflected sun light). As I had said before, I do not see coins covering the eyes but I do see the pupils of the eyes. As others I can see the teeth image, and what almost appears to be some x ray effect in some of the body image of Jesus. I have just accepted the fact that what I see is the remaining image the all powerful infinite Soul of Jesus Christ as it is entering and restructuring (instead of a mostly physical body with the God Soul it is being changed into a mostly God Physical body with the God Soul) the body and whatever the energies /forces involved they also produced the image on the cloth that everyone wants to fight about. So many people are just sure that the Shroud is photo of a painting of a photo that was sprinkled with some residue gathered from all around the world. They are sure that anyone believing that God had anything to do with Shroud are nuts. They are trying very hard to get to the bottom of this so called con job..","date":"2015-10-25","mins":"6:27 pm","url":"https://shroudstory.com/2015/10/25/a-critical-summary-3-0-discussion-one-very-smart-bartender/","cat":"critical_summary","title":"A Critical Summary 3.0 Discussion:  One Very Smart Bartender"},{"id":"comment-51784","author":"emmett_mcmahon","post":"I am very satisfied that the Shroud is not a man made object..","date":"2013-11-17","mins":"5:00 pm","url":"https://shroudstory.com/2013/11/17/barrie-schwortz-on-ewtn-recently/","cat":"news_&_views","title":"Barrie Schwortz on EWTN Recently"},{"id":"comment-144162","author":"emmett_mcmahon","post":"Almost too realistic an explanation, I could almost feel it..","date":"2014-08-16","mins":"5:23 am","url":"https://shroudstory.com/2014/08/16/another-gary-habermas-shroud-of-turin-video/","cat":"news_&_views","title":"Another Gary Habermas, Shroud of Turin Video."},{"id":"comment-175070","author":"emmett_mcmahon","post":"I am one of those who believe that the Shroud of Turin is the actual burial cloth of Jesus Christ. I have given my reasons before on one of these Shroud sites..","date":"2014-12-07","mins":"4:49 am","url":"https://shroudstory.com/2014/12/07/a-response-to-the-critical-summary-presentation/","cat":"uncategorized","title":"A response to the Critical Summary presentation"},{"id":"comment-214410","author":"emmett_mcmahon","post":"The Shroud with it’s image is a gift from God to us as a reminderof what the “Son” went through for us. We humans with our conscious mind stuck in the material have poor memories. Jesus was on earth 2,000 years ago. For some to read that he resurrected after his death, they would say “Oh, that’s nice – prove it” This may be a little reminder for the “hard to believe’ group. Other than that, I don’t know what to say, ask him when your opportunity arrives. In my mind it is a sign of the miracle for us to behold..","date":"2015-11-08","mins":"6:04 pm","url":"https://shroudstory.com/2015/11/08/the-process-of-resurrection/","cat":"critical_summary","title":"The Process of Resurrection"},{"id":"comment-201693","author":"emmett_mcmahon","post":"I don’t just like this video, I love it..","date":"2015-06-12","mins":"5:12 am","url":"https://shroudstory.com/2015/06/12/thomas-de-wesselow-on-why-the-image-is-unlikely-by-an-artist/","cat":"video","title":"Thomas De Wesselow On Why the Image is Unlikely by an Artist"},{"id":"comment-214409","author":"emmett_mcmahon","post":"So, if I understand the non process (meaning that the process does not exist) in my way of thinking it either is or it isn’t – or maybe, it isn’t or it is. So possibly speaking in (forgive me God) God’s almighty all powerful ‘mind’ the instant that he wanted the wine to be there – it was there..","date":"2015-11-08","mins":"5:50 pm","url":"https://shroudstory.com/2015/11/08/the-process-of-resurrection/","cat":"critical_summary","title":"The Process of Resurrection"}]
