[{"id":"comment-201775","author":"emmett_mcmahon","post":"Hi Mike, I feel the same way..","date":"2015-06-13","mins":"5:41 am","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","title":"Also Because of the Shroud of Turin"},{"id":"comment-202863","author":"emmett_mcmahon","post":"What we do know is back when King Henry VIII was in charge, he wanted some changes so e got rid of the RCC and made the Ecc. This way he could easily divorce and get a new wife(s). Had that not happened, then the world would be thinking of the King as a whore monger, no a fitting title for an English King. As a non RCC he had – – what was it – 6 different wives ?.","date":"2015-06-19","mins":"8:01 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","title":"BBC News Magazine:  The Perplexing Image"},{"id":"comment-201043","author":"emmett_mcmahon","post":"I like..","date":"2015-06-04","mins":"2:06 am","url":"https://shroudstory.com/2015/05/28/did-jesus-survive-the-crucifixion/","cat":"article","title":"Did Jesus Survive the Crucifixion?"},{"id":"comment-56972","author":"emmett_mcmahon","post":"This is still 2013..","date":"2013-12-06","mins":"4:49 pm","url":"https://shroudstory.com/2013/12/06/breaking-fizzle/","cat":"press_coverage","title":"Breaking Fizzle?"},{"id":"comment-193035","author":"emmett_mcmahon","post":"With the reading that I have done on this site and the shroud.com site and as I have said before my Guardian Angels voice, I am convinced that the Shroud of Turin that can also be called Christ’s Shroud, is the actual burial cloth of Jesus Christ. The blood and the image that surrounds the body area tells the truth. Christ’s dead body “wrapped” in the Shroud and placed into the tomb. The blood and the dirt and pollen tell us part of that. When his soul re entered his body (remembering that his soul is the Son of God’s Soul) it then re energized his body – the divine power in his soul is what caused the “scorched image” to be made on the Shroud. It is there to cause us to look – wonder – research and to believe that he did in fact come back to life. The resurrection of Jesus Christ He knew that we would be going through some of these doubts. It is as if he is signing his name to the Shroud. He is telling us that yes, his dead human body was placed in this cloth and his loving spiritual body came back to the human body so that we will believe in him for the centuries that we are still here on the Earth..","date":"2015-03-10","mins":"6:39 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-212445","author":"emmett_mcmahon","post":"Wow, the True Cross. I am not saying that there may not be some of the True Cross still in existence but I have read that if a person were to accumulate all of the pieces that claim to be from the True Cross that you would have enough wood to build a small house. Therefore it is evident that not everyone has a piece of the True Cross. It will be interesting to see the outcome of the forensic tests run on the Saint’s bone fragments. What a society we live in ?? Money is more important than the holy religious truth. For the willful liars, does that mean a longer stretch in Purgatory or is it serious enough to land in Lucifer’s hot home as a permanent guest ??.","date":"2015-10-13","mins":"3:48 pm","url":"https://shroudstory.com/2015/10/13/more-carbon-dating-and-other-studies-of-christian-relics/","cat":"article","title":"More Carbon Dating and Other Studies of Christian Relics"},{"id":"comment-192983","author":"emmett_mcmahon","post":"@Daveb of Wellington NZ, Don’t leave – I just ignore the naysayers. It seems that there will always be those either through ignorance or design. If by ignorance – they need help learning and if it is by design then the evil needs people against them sowing the public just what they are..","date":"2015-03-09","mins":"3:40 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","title":"Nice Review of Russ Breault’s Presentation in Wisconsin"},{"id":"comment-190915","author":"emmett_mcmahon","post":"I would hate to speed up time but can March the 1st get here any sooner ?? I can hardly wait for that series to start I am a believer of the Shroud of Turin as being “The Shroud of Christ”..","date":"2015-02-13","mins":"4:45 am","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","title":"Two More Articles About Upcoming CNN Series on Finding Jesus"},{"id":"comment-198585","author":"emmett_mcmahon","post":"Sounds like one fantastic fact filled book..","date":"2015-05-08","mins":"4:07 am","url":"https://shroudstory.com/2015/05/08/major-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","title":"Major New Book by Giulio Fanti and Pierandrea Malfi"},{"id":"comment-213327","author":"emmett_mcmahon","post":"It appears as though it may be necessary to test the Shroud as the what has been observed of/from is not enough convincible data for unbelievers ? Just don’t destroy the Shroud in the process. We have this as a gift from the Lord, we don’t believe it, so short of erasing it, test it..","date":"2015-10-22","mins":"3:11 am","url":"https://shroudstory.com/2015/10/22/new-book-by-mark-antonacci-is-available/","cat":"books","title":"New Book by Mark Antonacci is Available"},{"id":"comment-214288","author":"emmett_mcmahon","post":"If you look close enough, you can actually see the pupils of the eyes. The right pupil is more easily seen as the eyelid is open just a bit more than the eye on Jesus’ left side. That is what grabbed me when I first noticed it some time back and my Guardian Angel told me what I was staring at..","date":"2015-11-06","mins":"6:42 am","url":"https://shroudstory.com/2015/11/06/now-you-can-read-it-online/","cat":"paper_chase","title":"Now you can read it online"},{"id":"comment-202847","author":"emmett_mcmahon","post":"AS I have said before, I had not in the past nor do I now see any coins over the eyes of Jesus Christ nor do I see coins anywhere in the image. Sounds like pareidolia to me. Originally I was not looking for them and did not see them. After a few people said they saw them, I was like “what did I miss?” and went back and looked at a few different copies of the images, but still did not see them..","date":"2015-06-19","mins":"5:49 pm","url":"https://shroudstory.com/2015/06/19/paper-chase-offensive-coins-heads-or-tails/","cat":"paper_chase","title":"Paper Chase:  Offensive Coins? Heads or Tails?"},{"id":"comment-193191","author":"emmett_mcmahon","post":"Maybe a Step brother on the side of his Earth Step father Joseph. The Mother of Jesus remained a virgin for her life..","date":"2015-03-12","mins":"5:45 am","url":"https://shroudstory.com/2015/03/12/here-we-go-again/","cat":"television","title":"Here We Go Again"},{"id":"comment-39285","author":"emmett_mcmahon","post":"Hi, I am a Catholic Christian, this helps me to understand a portion of life after death for as it pertains to the human being but it is still full of mystery to me. Many facets of the topic are still out there in the ether..","date":"2013-07-19","mins":"3:47 pm","url":"https://shroudstory.com/2013/07/19/imagine-taking-easter-out-and-there-just-isnt-a-story/","cat":"video","title":"Imagine taking Easter out and there just isn’t a story"},{"id":"comment-194419","author":"emmett_mcmahon","post":"Where is the video ? Why was it removed or not entered ??.","date":"2015-03-25","mins":"8:32 pm","url":"https://shroudstory.com/2015/03/25/live-from-the-vatican-youtube-channel-ostention-of-the-holy-shrowd/","cat":"press_coverage","title":"Live from the Vatican YouTube Channel: Ostention of the Holy Shrowd"},{"id":"comment-176617","author":"emmett_mcmahon","post":"I have even family members say that Jesus had to marry being a Jewish Rabbi ?? When will people start to think, we are talking about the 2nd person of the Holy Trinity – The Son of God needs a wife??. He had many more serious discussions with the Jewish people and Gentiles – he surely was not worried about looks as being a unmarried human, the divine Son of God!!!.","date":"2014-12-15","mins":"4:53 am","url":"https://shroudstory.com/2014/12/15/science-channels-new-biblical-conspiracies-series/","cat":"video","title":"Science Channel’s new Biblical Conspiracies series"},{"id":"comment-202841","author":"emmett_mcmahon","post":"I checked the schedule out this afternoon and found the program listed as to play at 1230 – 1:45 AM and 11:00 AM 12:00 PM, no idea why the 15 minute time difference ?.","date":"2015-06-19","mins":"4:41 pm","url":"https://shroudstory.com/2015/06/19/set-your-dvrs/","cat":"television","title":"Set Your DVRs"},{"id":"comment-181091","author":"emmett_mcmahon","post":"I’ll be watching and recording..","date":"2015-01-03","mins":"2:57 pm","url":"https://shroudstory.com/2015/01/03/television-an-italian-professor-believes-he-has-the-answer/","cat":"video","title":"Television:  An Italian Professor believes he has the answer."},{"id":"comment-195556","author":"emmett_mcmahon","post":"Maybe she should sit and look into the Face of the Image on the Shroud of Turin saying to herself “I am Mollie Jameson, who are you ?”..","date":"2015-04-07","mins":"2:16 am","url":"https://shroudstory.com/2015/04/07/this-unbelievable-claim/","cat":"video","title":"This Unbelievable Claim"},{"id":"comment-104709","author":"emmett_mcmahon","post":"I am one who believes that the Shroud is the burial cloth of Jesus Christ. I have been trying to dig out some current research on the tilma of Juan Diego that has the image of Our Lady of Guadalupe on it. I had read that the image is the only miraculous Image of the Holy Mary that is referred to as the Our Lady of the Americas and also of the Philippines? I should have said St. Juan Diego..","date":"2014-04-28","mins":"4:54 am","url":"https://shroudstory.com/2014/02/21/youtube-of-barrie-schwortz-on-coast-to-coast-am/","cat":"video","title":"YouTube of Barrie Schwortz on Coast to Coast AM"}]
