[{"id":"comment-38422","author":"richard_savage","post":"Paulette, – Sorry not to respond sooner — have a lot to read and think about… – I don’t have a picture, but I’ll see if I can get a copy of Jackson’s paper claiming to show how the banding continues through the region that the sample was taken from. I do wonder about his use of “region” to describe what he sees — does the banding clearly go through the sample itself, or just through the general area? I’m biased, and hoping the latter. — Rich.","date":"2013-06-30","mins":"1:12 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"id":"comment-38423","author":"richard_savage","post":"Paulette, – Whew! Interesting stuff. — Rich.","date":"2013-06-30","mins":"1:14 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"id":"comment-38427","author":"richard_savage","post":"Paulette, – I don’t quite understand Rogers’ explanation for banding itself, and don’t think I can effectively communicate what I’m tripping over. Do you have an explanation, or know of a link with an explanation? — Rich.","date":"2013-06-30","mins":"2:24 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"id":"comment-193044","author":"richard_savage","post":"Hugh, – Thanks. – But, doesn’t that contradict the 95% confidence level? – Just in case you don’t recognize me, I’m “Jabba” from the other forum..","date":"2015-03-10","mins":"8:34 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193073","author":"richard_savage","post":"Hugh, – Unfortunately, I was thinking of it backwards… that 25% from 50 AD, and 75% from 1600 would show a carbon date of 360 AD. Oh well. – I’ll try to figure it out for myself, but what date would a 50/50 ratio show?.","date":"2015-03-10","mins":"3:06 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193032","author":"richard_savage","post":"Hugh, – Do you have an estimate as to how many years the current evidence of medieval contamination, and biological contamination otherwise, IS sufficient to skew the radiocarbon date by? (Hope that’s coherent.).","date":"2015-03-10","mins":"6:18 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193126","author":"richard_savage","post":"– Thanks, Hugh. – I have to ask… Does the banding show up with the Holland cloth removed?.","date":"2015-03-11","mins":"9:42 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-46377","author":"richard_savage","post":"– I probably missed something (above) dealing with the following — but Michael Ehrlich, head man at “Without a Trace,” told me on the phone that French Weaving required using only thread from the original cloth (taken from less noticeable areas) to do the reweave. If I understood that correctly, French Weaving should have little (if any) effect on the C14 date..","date":"2013-10-07","mins":"11:26 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-192803","author":"richard_savage","post":"– As I understand the current situation, it is generally accepted that there HAS been SOME addition of new threads, as well as some contamination otherwise, to the Shroud. Three questions: 1. Does the age gradient go in the right direction — from young to old as measured from outside to inside? 2.Could the COMBINATION of new threads, and contamination otherwise, account for 1300 years? 3. How many years WOULD be accounted for by the accepted new thread/contamination combination?.","date":"2015-03-08","mins":"12:38 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-46392","author":"richard_savage","post":"Sorry Max. I can’t seem to find it….","date":"2013-10-07","mins":"4:12 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46473","author":"richard_savage","post":"Max, – Thanks. Joe, 1. So far, it appears — to me — that while the French Weaving described by Michael Ehrlich was not fully applied to the Shroud, IT COULD HAVE BEEN largely applied (the only diversion being the failure to use original material for the reweaving). 2) I would have said that the French Weave technique “WAS PROBABLY, largely, applied,” except I can’t explain Hugh’s results… – What do you think?.","date":"2013-10-08","mins":"9:40 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-18599","author":"richard_savage","post":"– Do we have any better idea as to when this DVD will be available to us? – Will we be able to get an English translation?.","date":"2012-10-30","mins":"11:30 am","url":"https://shroudstory.com/2012/10/30/another-article-on-francesca-saracinos-la-notte-della-sindone-documentary/","cat":"carbon_14_dating","title":"Another Article on Francesca Saracino’s “La notte della Sindone” Documentary"},{"id":"comment-41189","author":"richard_savage","post":"OK: Maybe. Maybe the patch goes much deeper than everyone thought, with new vs old threads ratio gradually changing. BTW: the bandings go interrupted from the main cloth to he side strip, but WE KNOW that the side strip was carefully re attached to the main cloth. So perhaps it is possible. OK, – I had never seen the “deeper” possibility discussed. Can you refer me to something?.","date":"2013-08-13","mins":"10:25 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-41340","author":"richard_savage","post":"Max, – Could these techniques account for the (apparent) uninterrupted banding through the sample area? – Can you give me the date in June? – Thanks. — Rich.","date":"2013-08-15","mins":"9:54 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-41196","author":"richard_savage","post":"– So far, the banding seems to preclude the reweave hypothesis… – The “deeper” idea seems reasonable to me, but since it seems that none of the experts (except OK) has mentioned that as an explanation, there is probably a good reason not to. – Any one have any suggestions re “deeper” or otherwise?.","date":"2013-08-13","mins":"12:27 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-41212","author":"richard_savage","post":"OK, – Sorry to keep after this issue, but 1) I don’t really understand how “BTW: the bandings go UNINTERRUPTED from the main cloth to he side strip, but WE KNOW that the side strip was carefully re attached to the main cloth. So perhaps it is possible.” supports a potential reweave in the sample area. And, 2) I have read the two papers you site (more than once), but don’t see them explaining how a reweave wouldn’t interrupt the banding. I’ll go back and look harder. — Rich.","date":"2013-08-13","mins":"4:19 pm","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"},{"id":"comment-17202","author":"richard_savage","post":"– At this point (10/3/2012), I can’t seem to get a coherent version of Oxley’s paper. Http://www.shroud.com/pdfs/oxley.pdf only gets me hieroglyphics. Any suggestions? — Rich.","date":"2012-10-03","mins":"8:36 pm","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","title":"Mark Oxley’s Paper is a Must Read"},{"id":"comment-17239","author":"richard_savage","post":"Ron, – Unfortunately, you are speaking to a computer neanderthal. Though I’ve been using computers since the late 70’s, I seem to have learned about them only what’s been forced upon me. I don’t seem to have the “acrobat” reader; I just have the “Adobe Reader.” Is that good enough? – And then, to be honest, I don’t know what, exactly, my “settings” are, or how to reset them to default… You can see my problem… – But, don’t feel obliged to teach me — it’s something I should have been doing FOR MYSELF all along. I’ve been immature for a long time. – Unless you have a possible quick solution, no worries — I should quit being lazy, and figure this out for myself. For someone as backwards as me, bringing him up to speed through email should be quite difficult. – Someone had directed me to Oxley’s paper. In Googling it, I was quickly sent to Dan’s blog — and here I am. – I’ll let you know of my progress. — Rich.","date":"2012-10-05","mins":"8:00 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","title":"Mark Oxley’s Paper is a Must Read"},{"id":"comment-17240","author":"richard_savage","post":"Ron, – Also, I’m happy to be of help, and I should be able to use the comments above for my own benefit — even if I’m not able to read Oxley’s paper. Thanks again. — Rich.","date":"2012-10-05","mins":"8:07 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","title":"Mark Oxley’s Paper is a Must Read"},{"id":"comment-14260","author":"richard_savage","post":"Cute title..","date":"2012-07-27","mins":"8:14 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","title":"Savage Treatment in Randi Land"},{"id":"comment-14277","author":"richard_savage","post":"– I appreciate your responses (very interesting information) and will salt them away for future use, but it’s starting to look like we don’t have a good answer to the apparent similarity of trace elements between the Raes sample and the rest of the cloth — which seems like strong evidence against the invisible re weave hypothesis. – Any suggestions? — Rich.","date":"2012-07-28","mins":"11:29 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","title":"Savage Treatment in Randi Land"},{"id":"comment-41337","author":"richard_savage","post":"OK, – Thanks again. – So far, the “deeper” idea is my best hope for explaining the banding without discarding the reweave theory. Though, I actually use the idea in a second way… – Perhaps, the reweave was done in such a way so as to not disturb the banding — like the reweave was simply done on top of the original material. I’m sort of “reaching” here, but it’s the best I can do. – Anybody else have a potential explanation for the banding apparently continuing through the sample area? — Rich.","date":"2013-08-15","mins":"9:22 am","url":"https://shroudstory.com/2013/08/08/how-can-any-true-scientist-unconditionally-defend-the-c14-dating/","cat":"carbon_14_dating","title":"How can any true scientist unconditionally defend the C14 dating?"}]
