[{"id":"comment-49230","author":"richard_savage","post":"– Thanks Charles. I think that’s my cue! – How about an ONGOING, well controlled Internet debate? – That’s what I propose, and try to explain, on my blog at http://shrouddebates.com and my website at http://messiahornot.com/Treatise.php. Though, I haven’t worked on either of those sites for a long time, as I’ve been seduced into debate (as “Jabba”) on the James Randi forum at http://forums.randi.org/showthread.php?t=226761 and http://forums.randi.org/showthread.php?t=248163. The first URL refers to the Shroud. I haven’t done very well in the Shroud debate, but have a lot of excuses… – Anyway, I’m suggesting some sort of team, with one spokesperson per narrow “sub issue.” (For instance re “narrow sub issue,” on the Randi forum, most recently, we’ve been debating Carbon Dating/Reweave/Percent Needed/Getting Past the Experts.) – Through Dan’s website — if I could somehow develop some real interest (I’ve been trying for awhile) — we could probably suit up a very serious team. In fact, we could probably suit up multiple serious teams and deal with multiple narrow sub issues at the same time. While, just one narrow sub issue at a time would be extremely tedious, but then, one spokesperson per sub issue would seem like a necessity — at least, in the beginning, in order to “get anywhere.”. – Mostly, I think that 1) We humans need to develop a way for adversaries to effectively “negotiate” with each other (before it’s too late). 2) Contrary to popular opinion, ACTUALLY EFFECTIVE public debate is a real possibility — though, it would probably need to be WRITTEN, at least at the beginning. 3) But then, actually effective public debate could prove revolutionary and could be the beginning of actually effective “negotiating” between serious adversaries. 4) What we desperately need are some recognized scholars of the subject at hand to begin working on and promoting such a thing, and 5) Authenticity of the Shroud is an excellent subject for the beta model…..","date":"2013-10-30","mins":"1:46 pm","url":"https://shroudstory.com/2013/10/30/ideas-for-conferences/","cat":"event","title":"Ideas for conferences"}]
