[{"id":"comment-16895","author":"richard_savage","post":"Carlos and ncalibey, – Thanks. – Unfortunately, the Google translation is hard to understand. I speak a little Spanish, but not enough to help. – Basically, I think that Carlos is saying that the sample was a very bad choice. I agree — but still, the experts seemed satisfied with it — and claim, or at least imply, that the sample itself was not a patch. Certainly, there seems to be a patching involved, but the experts seem to accept that the attached patch is the real thing, and not a reweave — and, they should know. – Hopefully, that can be translated into Spanish well enough to make sense. – Below, I tried to add the images and their explanation, but could only add the explanation. Anyone wanting to see the images will have to go to Carlos’ blog at http://lasabanaylosescepticos.blogspot.com.es/2006/01/la zona de donde se cort.html. — Rich “The top photo in b / n shows the area of the sheet before being cut strip 1cm x 7 cm and weighing 150 mg. “The bottom photo shows the area in color and cut. “The cut was much higher amount, 478.1 mg indicated the electronic balance (Mettler, model AE 166, exactness 0.1 mg) to weigh the piece Prof.Testore G.Riggi had cut from the Shroud. More than three times as agreed in the Protocol and what relates Nature, 150 mg. “[entire event was videotaped, except for the introduction of samples in containers made solo and Cardinal Ballestrero Dr.Tite].” — Rich.","date":"2012-09-25","mins":"11:54 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16983","author":"richard_savage","post":"Anoxie, – That seems to be the only one they really depend upon. – Sorry that I didn’t get back to yo sooner. — Rich Passing Stranger : Right…….. So why have neither Rick (who “hid behind the pseudonym” of Jabba) no any other shroudie dealt with the evidence for the medieval origin of the shroud. At JREF or elsewhere….","date":"2012-09-27","mins":"11:12 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16910","author":"richard_savage","post":"Carlos, – Are these images from the Zurich sample? – Are they “official”? That is, can we CONFIRM that they are images from the Zurich sample? For some reason, the article doesn’t really explain what we’re looking at. – The different sections of the sample seem to show several different weaves — but, I don’t understand what that is supposed to indicate. Does it just indicate that some patching had been done within the sample? If so, shouldn’t that be enough to reject the sample, and shouldn’t the experts have noticed that problem early on? — Richard Carlos, – ¿Son estas imágenes de la muestra Zurich? – ¿Son “oficial”? Es decir, podemos CONFIMAR que se trata de imágenes de la muestra de Zurich? Por alguna razón, el artículo no explica realmente lo que estamos viendo. – Las distintas secciones de la muestra parecen mostrar varios tejidos diferentes – pero, no entiendo lo que se supone que indica. ¿Se acaba de indicar que algunos parches que se había hecho en la muestra? Si es así, no debe ser suficiente para que rechazar la muestra, y no se debe a los expertos han notado que problema desde el principio? — Ricardo.","date":"2012-09-25","mins":"6:31 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16915","author":"richard_savage","post":"Ron, – May I quote you over in the Randi forum? – I’d have to remove what I consider to be “inciting” words — lol, farce, fiasco. – I wouldn’t use your name if you didn’t want me to, but I would point out that it comes from Dan’s blog. — Rich.","date":"2012-09-25","mins":"8:32 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16960","author":"richard_savage","post":"Carlos, – May I quote you over in the Randi forum? — Rich.","date":"2012-09-26","mins":"6:03 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16944","author":"richard_savage","post":"– Interesting. – I should have known that I’d have difficulty just keeping up — even over here, in a friendly (to me) atmosphere. I suppose that I’m naturally slow in trying to express my responses to what anyone says, and now I have several responses to which to respond — each of my responses likely to provoke multiple more responses themselves. Consequently, I quickly develop a quickly growing exponential tree of responses to which I need, or just want, to respond… – And NOW, counting the Randi forum, I’m quickly growing TWO exponential trees of responses to which I need, or just want, to respond… – In my proposed model for actually effective debate, each side has a single spokesperson with his/her own sub thread where he/she directs the conversation and tells his/her opponent which response to answer next. Both sides accept that the process will be tedious, but POTENTIALLY EFFECTIVE — which would be revolutionary… – What we’re having over here is not an OVERALL debate, but there are, and will be, numerous moments of needed clarification, reservation and, even, objection. – Anyway, I have some pressing chores to get done — but, I’ll be back to begin addressing the various responses that need addressing. — Rich.","date":"2012-09-26","mins":"10:38 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16959","author":"richard_savage","post":"Ron : No problem, but why leave out fiasco or farce? …as, it is fact ; ) Did you ever get around to reading those papers I mentioned a while back? Seriously Rich if your going to debate anything, you should study up extensively on the subject. These things I just mentioned, I would think would be common knowledge to anyone serious about the Shroud or Sindonology. Remember knowledge is power….In almost every post I read on there by your ‘opponents’, I noticed major errors. It is obvious most are not well read on the subject, but you must be, if you want to be taken seriously…and shown respect. R Ron, – I’m not sure to which papers you’re referring. – I suspect that some of what I’ve said in previous posts has made it appear that I have read much less than I have. I asked to quote you in addressing the Randi forum — even though I knew about almost all of the issues you raised, and had already pointed out many of them in the Randi forum myself — because I had failed to include some of them, and I liked the way you had put them all together. – In addition, 1) I’m getting pretty old (70), and my memory simply isn’t what it used to be. 2) I think that compared to the mean human population, my memory for specifics (which is what’s important in arguing a case) has always been in the lowest quartile — though I seem to do fine with generalities… 3) Though I include about 60 links about the Shroud at http://messiahornot.com/Bibliography.php, and have 25 more on a separate spreadsheet, I haven’t done a good job of compiling an actually useful “bibliography” — never recording many of the links I’ve used, and poorly describing what I have recorded. I was directed to “Evernote,” and did download it, but haven’t found the time to actually learn how to use it. And, 4) What makes this failure (to develop a useful bibliography) such a big problem over in the Randi forum is the exponential tree (I addressed in my last post above) of responses that I need, or want, to answer over there, leaving me overwhelmed with the need to track down old sources — as well as new sources. – Whatever — thanks for the help, I’ll use your post over there and will greatly appreciate any more help you can give me as we go along… — Rich.","date":"2012-09-26","mins":"5:52 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17018","author":"richard_savage","post":"– Thanks, Ron. – I now remember you saying something about the “separate roots.” I don’t really remember those specific words, but I do remember the warning in general… You were right. – I’ve actually TRIED to do exactly what you suggest above, but it isn’t easy. – For one thing, I will forget my objective of focusing on one aspect at a time, and respond to something that seems especially provocative — and, also easy to answer — but, that provokes multiple responses from the other side… Hard to keep my cool. – I also have NOTES all over the place, but not in the easily accessible list that you imply. I’ll try to gather up the last twenty or so, and make that my list. That should help me to let them go unanswered for “now.” – I do think that I’m still learning a lot about human debate. I include “human” here cause it has to do with human nature. – Thanks for your help — it’s probably exactly what I need. — Rich.","date":"2012-09-28","mins":"9:19 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16985","author":"richard_savage","post":"– Apparently, I wasn’t doing it right. Oh well… – I’ll try to go back to anoxie’s early post, and answer it there. — Rich.","date":"2012-09-27","mins":"11:22 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16984","author":"richard_savage","post":"Richard Savage : Anoxie, – That seems to be the only one they really depend upon. – Sorry that I didn’t get back to yo sooner. — Rich – The above is all I meant to say in my previous post. Sorry about the extra. – Hopefully, I’m doing this right… — Rich.","date":"2012-09-27","mins":"11:17 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17149","author":"richard_savage","post":"Daveb and Ron, – You’re both right, of course… – Let’s see if I can explain why I wish to continue in the Randi forum, in spite of the situation over there. (I know that I’ll sound like some kind of nut, but I honestly believe what I’m about to say… Or at least, I honestly believe that I believe what I’m about to say.) – My first general reason for wanting to continue is HOW IMPORTANT I perceive my two basic goals to be. I think that 1) A METHOD FOR ENSURING ACTUALLY EFFECTIVE DEBATE WOULD BE REVOLUTIONARY, 2) AS WOULD A GENERAL SCIENTIFIC ACCEPTANCE THAT THE SHROUD IS PROBABLY GENUINE… – My second general reason is that I think that both are quite possible… – Now, even though most of the posts from my opponents over on the Randi forum are basically just insults, some of the posts include “accusations” that seem at least somewhat reasonable. I had wanted to unearth the reasonable accusations against Shroud authenticity, and see if we could effectively refute them — and these guys are happy to spell out just what the accusations are. – And then, there is at least one guy over there that seems to be genuinely seeking the truth about the Shroud — and others that might be close. If I can give them some good answers to their reservations, they might actually begin to rethink. I think that would be a giant step in the right direction. – Also, they are somewhat correct about my inability to present satisfactory evidence myself – just that I have a lot of excuses and these guys don’t recognize (or admit?) the validity of my excuses… – Probably, my Number One excuse, is the exponential growth of responses to which I need, or at least wish, to respond. Whatever my response, it tends to trigger numerous new, often provocative, responses. I keep thinking that if I can just stay on point — instead of being seduced off the trail, we will eventually make some progress… – Unfortunately, even responding to you guys takes me off point… – And then, 1. The Randi forum seems to be an extremely popular and respected (by skeptics) advocate for skepticism in general. 2. The aim of my method for debate is not to enlighten my opponents. My aim is to attract a large audience, and enlighten THEM. 3. I think that if we can develop just a SLIGHTLY effective debate between us and those on the Randi forum, we have the beginnings of something important. That is, 3.1. I can’t fully impose my method on their current forum – so, even if I’m right about the overall method, I can’t expect to directly accomplish a whole lot over there, as things stand. 3.2. But then, if I can show just a little bit of “progress” (defined below) over there, and keep working on it, I might eventually be able to convince the administrators over there to allow for an experimental thread using my suggested method. 3.3. Maybe, I could convince Dan, or another one of our leaders to “sponsor” such a debate in front of a large audience on whatever website. 3.4. Whatever, I sure think that someone with some influence needs to be researching the possibility of actually effective debate. (“Progress” being the explicit isolation of BASIC disagreements — where the two sides don’t have anything further to add re the particular, specific, disagreement, and can thereby agree to disagree for now re that particular disagreement – thereby, allowing the audience to best judge that particular disagreement for themselves. Progress does not require “enlightenment” of one of the opponents.) – I’d best get back on point. – Thanks. — Rich.","date":"2012-10-02","mins":"8:50 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16986","author":"richard_savage","post":"Passing Stranger : Right…….. So why have neither Rick (who “hid behind the pseudonym” of Jabba) no any other shroudie dealt with the evidence for the medieval origin of the shroud. At JREF or elsewhere… Passing Stranger, – I wasn’t hiding. “Jabba” has been my preferred pseudonym “forever,” and I just figured that “everybody” used a pseudonym… – I’ve tried to explain my tardiness over there — regarding dealing with the different claims of evidence — numerous times, but no one has taken my excuses seriously… – I will get to those claims of evidence, and my own claims of evidence, as I can find the time. – I think that the other “Shroudies” have preferred to avoid the REACTION to Shroudies at JREF. — Rich.","date":"2012-09-27","mins":"11:52 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17155","author":"richard_savage","post":"Anoxie : There has been no chemical or physical analysis of the samples before c14 datation. You can’t draw any conclusion on the nature of the samples based on Nature’s article. Do they have any other source ? anoxie, – Do we basically know that neither Flury Lemberg or anyone else did no chemical or physical analysis of the samples before c14 datation, or is it that they just haven’t told us specifically what they did in accepting the samples? – But also, what did the 78 STURP research say about that particular area? — Rich.","date":"2012-10-02","mins":"10:51 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17329","author":"richard_savage","post":"Anoxie, – Thanks a lot, again. – I’ll pass this on. – Do you know where I can get more specific info from STURP re that corner? — Rich.","date":"2012-10-08","mins":"8:17 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16734","author":"richard_savage","post":"Ron, – The ultimate goal is to get our debate in front of a neutral audience — people who haven’t made up their minds — and let them chose for themselves who is making the most sense. — Rich.","date":"2012-09-22","mins":"8:02 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17385","author":"richard_savage","post":"Anoxie, – Thanks again. I’ll do as you suggest. – Mostly, I wanted to know what STURP said about that corner. Did they say anything that would support a patch theory, or that the area is anomalous? Did they do any testing on that corner that should have exposed a patch? I’ll see what I can find. I’ll start with “Discrepancies in the Radiocarbon Dating Area of the Turin Shroud.” — Rich.","date":"2012-10-09","mins":"7:39 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17408","author":"richard_savage","post":"Anoxie, – Thanks. – Got it. – Got my work cut out for me. — Rich.","date":"2012-10-10","mins":"9:17 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17656","author":"richard_savage","post":"Anoxie, – Re the “dead end.” I don’t really expect to convince any of my opponents on the Randi forum that any of my “contrary” claims are correct… Instead, I’m vaguely hoping to use that thread to show a somewhat neutral audience that my claims are correct. I’m also getting some much needed on the job training — I have what I believe to be the “basics” of effective debate; what I’m learning through the Randi debate is some of the details. – Obviously, I have a lot of explaining to do — but for now, I need to go take a nap… – Just to keep the Randi thread handy, you can find it at http://forums.randi.org/showthread.php?t=226761&page=90. – Thanks, again. — Rich.","date":"2012-10-15","mins":"8:34 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17386","author":"richard_savage","post":"Anoxie, – Woops. Unfortunately, that link didn’t work. — Rich.","date":"2012-10-09","mins":"7:41 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17870","author":"richard_savage","post":"Anoxie, ` I didn’t really understand what you said — immediately above — but, I’m about to give up on the patch theory for now anyway — unless you, or someone else knows a way around what I discovered yesterday. I’ll explain in my next post. — Rich.","date":"2012-10-19","mins":"11:06 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-17871","author":"richard_savage","post":"– Yesterday, I spoke to Michael Ehrlich, of http://withoutatrace.com/ — the expert to whom Marino and Pryor referred in 2008 (http://shroud.com/pdfs/chronology.pdf) about French Re weaving. He told me that the “invisibility” depended upon using only undamaged threads from the main cloth. – That being the case, the dating wouldn’t be affected… – Does anyone here have an answer to that? – I’ll write to Joe Marino, but I suspect that he’s too busy to answer all his emails… — Rich.","date":"2012-10-19","mins":"11:19 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-18032","author":"richard_savage","post":"Anoxie, – But, as far as I know, Ehrlich is the only expert who has accepted that a French re weaving patch would be essentially invisible — and also, he is the Expert to whom Joe Marino referred in supporting his case. And, as we look closer at what Ehrlich said, it does NOT seem to support Marino’s case. — Rich.","date":"2012-10-22","mins":"8:50 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-18195","author":"richard_savage","post":"– The following is my current best attempt at summarizing the “first level” of claims supporting the authenticity of the Shroud. I plan to present this list to the Randi forum. Please let me know how you think I should revise, delete or add to my list. – I say “first level” because each claim below is supported by other claims — which, in turn, will be supported by more claims, etc. For instance, the Pray Codex would be introduced and discussed under claim # 10 – and, would therefore, need not be added to THIS list. Hopefully, at some point, I’ll get around to focusing on #10, and then, the Pray Codex… – I will present this to the Randi forum as a lead in to beefing up my current focus on #11 – the reliability and validity of the carbon dating. I present this list because my attempt at actually effective debate requires a kind of “murder board” (like they show on detective TV shows) with a diagram giving structure to the overall argument. I hope that translates. 1.The shroud is one of the most studied artifacts in human history. Also, it is at least 700 years old. Even so, no modern artist or scientist has ever been able to fully reproduce or explain it. 2.No similar ancient artifact has ever been found. (If this was a forgery, the genius who forged it, didn’t leave any other (what would have been extremely valuable) examples, or attempts, behind.) 3.Though, in 1981 a mattress cover did develop a similar image when it was left on a man who had just died… (Is this some kind of rare, but totally NATURAL, phenomenon?) 4.Science has essentially proven that the shroud 4.1.Is not a painting. 4.2.Is not a photograph. 4.3.Is 3 D. 4.4.Is holographic. 5.The image on the shroud almost has to be some sort of imprint of someone who was recently tortured and crucified. 6.The figure on the shroud is extremely detailed and in total agreement with the Biblical account of the crucifixion. 7.Some of the correct detail of a victim of crucifixion could not have been known by, seen by, painted by or desired to be painted by any forger 700 years ago. 8.The historical evidence for its early existence is actually substantial and growing. 9.There is plenty of reasonable doubt re the validity of the 1988 carbon dating. 10.Other than the carbon dating, the evidence against the shroud’s authenticity is really quite unimpressive. 11.Other than the scientists involved in the carbon dating, only one involved scientist has argued that the Shroud is not authentic (Walter Mc Crone) – whereas, there have been numerous involved scientists that have argued the opposite. The other notable skeptics are only in the “audience.” 12.There is real blood on the shroud (involving some of the details noted in #7, above), and in the right places. 13.The one involved scientist (from #11) claimed that there was no blood on the shroud. 14.There is a barely visible second image of the face on the back of the shroud – with no discoloration between the two layers. How would an artist do that? 15.In effect, the shroud is a negative. How would a forger know how to do that, be able to do that and why WOULD he do that — hundreds of years before photography was invented? 16.One very unusual aspect of the stitching on the shroud (the side strip) has also been found on a shroud in the ruins of Masada (an ancient Israeli fortress). Masada was destroyed in 70 CE by the Romans. 17.Evidence of pollen and flowers — specific to Palestine in the first century — has been found on the shroud. Other pollen evidence on the shroud fits with the shrouds traditional itinerary. 18.Evidence of appropriate Roman coins is found on the closed eyelids of the victim. 19.If the shroud is not the burial cloth of Jesus, its most likely explanation is that of a forgery perpetrated by space aliens. — Rich.","date":"2012-10-24","mins":"9:03 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-18191","author":"richard_savage","post":"Anoxie, – I wrote to Joe a couple of days ago. So far he hasn’t responded. I figure that Joe only has enough time to respond to a small percentage of his incoming mail. Writing to Joe must be something like writing to Rush Limbaugh. — Rich.","date":"2012-10-24","mins":"8:42 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-18275","author":"richard_savage","post":"Anoxie, – Thanks again. – I think that the following is a good article on the hologram theory. Http://shroud3d.com/home page/introduction holographic observations in the shroud image holographic theory. As far as I know, this claim has not been discounted… – Note that in regard to the flowers and coins (#’s 17 & 18 of my claims), I only say that there is EVIDENCE of these things. Have the claims about flowers, and/or coins, been disproven, or essentially disproven? – A couple of articles about the Hospice mattress cover: http://shroud.com/pdfs/imprint.pdf and http://www.shroud.com/pdfs/mattress.pdf. – You’ve given me a lot of your time already, so I’m reluctant to ask for more – but, I’ll do it anyway… Could you possibly outline your reasons for believing that the Shroud is probably authentic? — Rich.","date":"2012-10-25","mins":"7:55 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-27641","author":"richard_savage","post":"– I think that I asked about this previously (somewhere on Dan’s blog) — but, if I did, I can’t find it… – According to Michael Ehrlich — the head of “Without a Trace,” the company to which Joe Marino refers when claiming that a really invisible patch is possible — the process for producing a really invisible patch requires the exclusive use of undamaged threads from the original cloth. In other words, even if this process was used on the carbon dating sample from the Shroud, the patch should show the same age as the rest of the cloth… – Do we have a counter claim? – (I have a possibility, but don’t know that it really makes sense.) — Rich.","date":"2013-03-18","mins":"9:38 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-18303","author":"richard_savage","post":"Anoxie, – OK. I’ll leave those out. — Rich.","date":"2012-10-25","mins":"5:41 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16752","author":"richard_savage","post":"Challenge #1: – Regarding the carbon dating, several claims have been made as to how the dating could be so far off if the Shroud is authentic. I don’t think that any of those claims (explanations) “hold water.” Let’s consider one at a time. – Probably the most “popular” claim is that the sample tested was actually a patch invisibly re woven by French nuns in the 16th century. I have several reservations to such a claim. Let’s consider just one of those at a time… 1. How could such a patch get past all the experts examining the Shroud? – Thanks. — D.A. (Devil’s Advocate).","date":"2012-09-22","mins":"2:14 pm","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-27645","author":"richard_savage","post":"Anoxie, – Thanks — but, how do I do that? — Rich.","date":"2013-03-18","mins":"10:22 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-34201","author":"richard_savage","post":"– Currently, I’m trying to address the claim made on the Randi forum that the involved scientists chose the sample to be taken from the Shroud. I claimed that the scientists didn’t choose the sample — the church did, and the scientists were just forced to go along with the Church’s choice. Here’s the argument that I eventually came up with. I’ve probably mistated here and there, so any additions, deletions or corrections otherwise would be greatly appreciated. 1.On 26 Aug 1974, on the urging of Ian Wilson, Walter Mc Crone sent a letter to Father Peter Rinaldi, S.D.B., in Turin. In that letter, Mc Crone submitted a proposal to carbon date the shroud. 2.In his book, Mc Crone notes that his proposal changed over the next three years, so he didn’t include the original in his book … but by 1977 at least, as you will see below, he was advocating one of the Raes samples. 3.Harry Gove first learned of the Shroud in a letter dated 8 Jun 1977, from Reverend David Sox – the Secretary General of the British Society for the Turin Shroud (BSTS) — asking if Gove’s new carbon dating method could be applied to the Shroud. 4.In his letter, Sox included the 1977 version of Mc Crone’s proposal that suggested using one of the Raes samples for dating. 5.In July of 77, Gove responded that his new carbon dating method could be used, but that the method would require more work before it should be applied to something so “renowned” as the shroud (even though Gove hadn’t known about the shroud himself, he apparently realized that a lot of people had)… 6.On 16 Feb 1979, Gove sent a letter to the Archbishop of Turin, Cardinal Ballestrero by way of Don Piero Coero Borga (whoever the latter was, for whatever the reason) proposing carbon dating of the Shroud using one of the Raes samples. 7.I can’t get the timing quite straight, or who got the idea from whom, but by 1979 Luigi Gonella, science advisor to the archbishop of Turin, was also advocating one of the Raes samples for the carbon dating. 8.Though, Gonella may have just been following instructions from the Pontifical Academy of Sciences… 9.At that time, STURP also accepted the suggestion. 10.Gove’s letter (#5 above) didn’t make it to Ballestrero until years later (1984?). 11.Somewhere in that time, Gonella changed his mind, claiming that the Raes samples had not been properly cared for and were probably too contaminated to use for the carbon dating. 12.Gove agreed – accepting something else (what, I don’t know) instead. 13.In 84, STURP submitted a protocol, of its own, requiring samples to be taken from 3 different areas on the Shroud. 14.In June of 85, a summary (by David Sox) of the Trondheim protocol just indicated samples (plural). 15.So far, I can’t find a copy of that protocol, but supposedly it specified taking samples from 3 different areas. 16.In the fall of 86, several interested scientific groups sent representatives to Turin, and turned out the Turin Protocol, which called for 7 different tiny samples – but apparently, all adjacent to each other. 17.This conference was organized by Harry Gove, and most of those attending the conference were associated with carbon dating labs. 18.Together, they decided to exclude STURP and STURP’s multi disciplinary approach. 19.The Turin Protocol did require that the samples taken not be near any patched or charred areas. 20.In the end (21 April 1988), Giovanni Riggi, foremost Scientific Advisor to Cardinal Ballestrero, Luigi Gonella and two linen experts, after an hour or two of debate selected one small area adjacent to the Raes sample. 21.They made this selection even though the Raes area had appeared to involve patching, was a few inches away from an area charred by the fire of 1532, was contaminated by the water used to put out the fire, and being one of the two corners held by “volunteers” when displayed hundreds of times over the centuries had to be somewhat contaminated and not chemically representative of the greater shroud… 22.So far, I haven’t been able to find out the limitation of their choices, nor who determined the limitations. (I may have known at one point, but if I did, I can’t remember them now…) 23.From William Meacham at http://shroud.wikispaces.com/CARBON.14.DATING… It is frequently reported that the original C 14 protocol drawn up at the Turin conference of 1986, jointly sponsored by the Pontifical Academy of Sciences and the Turin Archdiocese, was to have seven samples from seven different sites on the Shroud. This is incorrect. At that conference a rough compromise emerged with the protocol calling for seven samples to be taken but from only ONE sampling site. The lab directors rejected the strong resistance on the latter point from a few individuals at the conference, because in the directors’ view having two or more sampling sites increased the possibility of an outlier. They sought at all costs to have a result supported by the largest possible number of labs, primarily for public consumption. 24.So, here’s what I think so far. 25.At first, the scientists were thinking small – and, were trying to take advantage of the samples already tested. They would have preferred samples from multiple areas over the shroud, but knowing the difficulty of getting approval for such samples, were happy to have SOMETHING. 26.Most likely, they would have accepted that the results of using just the one Raes sample would be highly suspect, but under the circumstances, well worth the effort required to obtain them. 27.Later, they realized the possibility of obtaining (slightly) more material, and began trying to advance that possibility. 28.The Turin workshop of 86 allowed the CARBON DATING LABS to advance their own agenda/preferences – and, “the rest is history.” 29.In other words, Scientists did first propose one of the Raes samples, but they did that because they figured that such would be easily allowed by those in charge of the decision (the Church), whereas getting anything more might be impossible. 30.Later, when there seemed to be room for enlarging their expectations, scientists of the carbon dating mentality were in control, outvoted the remaining scientists and allowed for only a tiny sample from a highly suspect corner of the Shroud to be their target..","date":"2013-05-21","mins":"8:58 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"},{"id":"comment-16854","author":"richard_savage","post":"– I’m leaving this reply as a reminder of a particular REASONABLE objection to Shroud authenticity raised at JREF (http://forums.randi.org/showthread.php?p=8642787#post8642787), and as a catalyst to inspire some answers. – Obviously, these guys don’t give any credence to the Shroud anyway — but then, they do have some reasonable objections which I hope we can answer more effectively than I have managed so far… — Rich.","date":"2012-09-24","mins":"9:39 am","url":"https://shroudstory.com/2012/09/21/an-open-thread-for-rich-savage-questions/","cat":"other_blogs","title":"An Open Thread for Rich Savage Questions"}]
