[{"id":"comment-12","author":"richard_savage","post":"Colins (I hope I got that right), – I appreciate your priorities and time constraints – I have, myself, miles to go before I sleep. – But anyway, have you read my ‘chapters’ 3 and 4? – If not, and if you get a chance, please do so – and then, rethink your decision. The debate we propose should advance very slowly and require very little of your time… – Whatever, thanks for the quick response. — Rich.","date":"2012-02-17","mins":"3:17 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","title":"Hello, all you Shroud sceptics out there"},{"id":"comment-8","author":"richard_savage","post":"Colin, 1. Our Purpose: 1.1. “We” are a small team of ‘commentators’ imported from http://www.shroudblog.com. 1.2. We believe – apparently, contrary to current popular opinion – that the preponderance of evidence regarding the Shroud of Turin somehow – but clearly – favors the Shroud’s authenticity… 1.3. (“Authentic” meaning simply that the Shroud was, in fact, the burial cloth of Jesus — at this point, we are not claiming that there is anything supernatural about the Shroud…) 1.4. We also believe that we will be doing a great public service if we can bring our conclusion to worldly consensus. (Such a conclusion should give anyone serious pause – whether believer or nonbeliever, and whether the image on the Shroud is supernatural or not — and should also put any sarcastic skeptics into their rightful places… which would be a good thing.) 1.5. So, our purpose here is to show that the preponderance of evidence clearly favors shroud authenticity, and to bring that conclusion to a worldly consensus… – The above was taken from our website – http://shrouddebates.com/. – Would you like to have a friendly, patient, on line, written debate with us? – You would be ‘allowed’ to recruit all the help you desired, but you would be the official spokesperson. — Rich Savage, rsavage@nycap.rr.com.","date":"2012-02-15","mins":"2:03 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/02/12/hello-all-you-shroud-sceptics-out-there/","cat":"cellulose","title":"Hello, all you Shroud sceptics out there"}]
