[{"id":"comment-12880","author":"maria_da_glória_gonçalves_barroso","post":"To «anoxie» If you have any doubts on scientific questions concerning bloodstains my advice is not to ask Dr. Colinsberry because he’ll always provide misleading answers with the aim of discredit the Shroud. You had better read previous excellent post on this blog concerning Shroud bloodstains by medical immunologist Dr. Kelly Kearse. My husband is a medical doctor and he read all Drs. John Heller and Alan Adler’s papers on blood issue in their book «The Orphaned Manuscript». This book contains several papers by these investigators most of them published in «peer reviewed» scientific journals and the conclusion is crystal clear, Shroud red stains are not red ochre and vermillion in a collagen tempera, actually they are blood. Inasmuch, Professor Adler and Dr. John Heller did nor perform just the Hydrazine test that Dr Collinberry described in a very confusing way. They actually tested not one but several samples from red stains and also studied red stains from human blood on fabrics as controls. The finding of hemoglobin characteristic spectra, other spectrometry data, detection of blood proteins, bilirrubin and other blood components enables them to conclude that there is indeed blood on the Shroud. Italian forensic investigator Professor Baima Bollone obtained similar results working with material collected from other locations on the Shroud. BLOOD ON THE SHROUD IS NOT A GUESS IT IS A SCIENTIFIC FACT. Kindest regards Maria da Glória Centro Português de Sindonologia.","date":"2012-06-22","mins":"5:25 am","url":"https://shroudstory.com/2012/06/20/berry-shroud-was-scourged-not-the-man-a-critical-look-at-faccini-and-fanti/","cat":"blood_studies","title":"Berry: Shroud was Scourged, Not the Man. A Critical Look at Faccini and Fanti"},{"id":"comment-8387","author":"maria_da_glória_gonçalves_barroso","post":"Bravo Dr Kelly Kearse My husband who is a medical doctor and a Shroud researcher commented that at last someone from the medical field shed some light on the AB controversy of the blood on the Shroud. Thus this is a very important independent statement on red stains on the Shroud concluding on the basis of Dr John Heller,Dr Alan Adler and Professor Pierluigi Baima Bollone’s studies that red stains are indeed blood and Dr. Mc Crone’s theory of red ochre and vermillion is to be dismissed once more. I congratulate with all previous comments, this blog is really awesome! Shroudies gotta praise Dr. Kelly Kearse’s amazing work, my husband said it’s excellent and crystal clear there is nothing more to add on this matter and this is one of the best posts ever published on this blog regards Maria da Glória Centro Português de Sindonologia.","date":"2012-02-17","mins":"5:22 am","url":"https://shroudstory.com/2012/02/16/must-read-all-old-blood-types-as-ab-not-exactly/","cat":"blood_studies","title":"MUST READ: A lot of old blood types as AB: Not Exactly"},{"id":"comment-21845","author":"maria_da_glória_gonçalves_barroso","post":"It’s crystal clear that Professor Charles Freeman’s claims on the issue of Shroud’s bloodtyping AB have no other aim but trying to prove that the Shroud of Turin cannot be the one that wrapped Jesus’ body some 2000 years ago. Why is that possibility discarded only on the basis of a single misleading claim and all the other aspects of the Shroud namely concerning ALL THE UNIQUE IMAGE PECULIARITIES are simply neglected? Although he is right questioning the value of performing only serological tests, maybe in a near future there will appear DNA studies on that matter as Dr Kelly Kearse pointed out. Nonetheless Dr. Kelly Kearse provided us one excellent posting entitled «Just how old is the AB blood type?» on this blog last October 13 and she also wrote a very interesting comment on ABO anthropological evolution making a rebuttal of D’Adamo’s theory. I guess that for the moment, what she explained it’s all we can know on this matter without speculating, and surely AB blood type existed long before Christ was born. Best regards Maria da Gloria Centro Português de Sindonologia.","date":"2013-01-10","mins":"12:29 pm","url":"https://shroudstory.com/2013/01/08/positive-for-ab-is-not-the-same-as-ab-positive/","cat":"blood_studies","title":"Positive for AB is not the same as AB positive"}]
