[{"id":"comment-1413","author":"maria_da_glória_gonçalves_barroso","post":"It’s worth watching nevertheless I guess it focused too much on Dr Jackson’s theory on flawed radiocarbon tests allegedly by enrichment with new C14 atoms from carbon monoxide produced in 1532 Chambery’s fire. As far as I remember there was no mention of Sue Benford and Joe Marino’s work or Professor Raymond Rogers studies. BBC has released a good Shroud documentary but newer documentaries such as Unwrapping the Shroud and The Real Face of Jesus provide more reliable scientific information. Regards Maria da Glória Centro Português de Sindonologia.","date":"2010-08-27","mins":"2:41 pm","url":"https://shroudstory.com/2010/08/20/a-must-see-shroud-of-turin-material-evidence-on-veoh/","cat":"carbon_14_dating","title":"A Must See: Shroud of Turin (Material Evidence) on Veoh"},{"id":"comment-33315","author":"maria_da_glória_gonçalves_barroso","post":"Dear friends I guess Professor Fanti’s new methods of dating ancient textiles were recognized as accurate by scientific standards. Other scientists from several italian universities collaborated in the development of this new methodology and their paper on two of the tests employed was accepted in Vibrational Specroscopy Journal. Professor Giulio Fanti is a honest and competent scientist and those who accused him of doing «bad science» are absolutely wrong and making a tremendous injustice towards him. Professor Fanti has given important contribution to Shroud research namely on the image issue and now he provided more strong arguments to doubt 1988 radiocarbon dating of the Shroud. IIT’S EXTREMELY IMPORTANT TO HAVE A SCIENTIFIC DATING OF THE SHROUD 280 B.C. 220 A.D. SO THE POSSIBILITY OF THE FABRIC BEEING FROM THE TIME OF CHRIST IS A REALITY AND NOT A DESIRE FROM DEVOUT CHRISTIANS. On the contrary Shroud skeptic Joe Nickell adds nothing to what we were used to hear from him and nevertheless he is praised by his publisher on his new book. Portuguese members of Centro Português de Sindonologia praise Professor Fanti’s dedication to Shroud research and expressed their support to this discovery after listening to a presentation entitled « Recent Scientific developments on the Shroud» included in the program of « Solemn Feast of The Holy Shroud» held in Fátima Portugal saturday May 4. Best regards Maria da Glória Centro Português de Sindonologia.","date":"2013-05-09","mins":"6:23 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-141","author":"maria_da_glória_gonçalves_barroso","post":"Those who seek the truth shouldn´t be bothered by the predictable behaviour of so called skeptics. They are not interested to know and they hide new evidence that contradicts their claims. I know by heart what they claim about the Shroud beeing a painting , a kind of protophotograph, the conclusions of the «world famous microscopist and forensic expert Walter Mccrone » ,the anatomical errors of the image of The Man of the Shroud, the coherent results of the 3 radiocarbon labs , the lack of historical Shroud records before 1356 ,and a lot of more crap. What do they argue to disclaim the works published in peer reviewed scientific magazines ? I don´t ask them to be believers I just ask them to be honest and have an opened mind to undeniable facts which I summarize FACTS: 1) The Shroud of Turin is neither a painting nor a photograph 2) Science already knows the chemistry of that superficial image and the way it was impressed on the fabric 3) There is yet no explanation ( not from a theological but from a scientific point of view ) for what caused the cromophores on the topmost fibers of the cloth to produce as a whole such an unique negative image with 3 D and Holographic encoding. 4) At present time no one was able to create an image with all the characteristics of the one in the Turin Shroud 5) The image of The Man of the Shroud has forensic evidence that legitimates connecting it to the descriptions of Christ´s Passion as we read in the Gospels 6) As the agnostic doctor Yves Delage concluded in 1902 the man´s image depicted on the Shroud IS INDEED JESUS CHRIST 7) There are indeed reliable documental and pictorial recordings of the Shroud before 1356, altough not in western Europe. It´s preposterous to claim that « the medieval forger of the Shroud was inspired by the Pray Codex » !!! 8) 1988 radiocarbon dating of the Shroud is invalid ; all peer reviewed scientific works concuded that the sample was cut from a area of medieval invisible mending ,so there is no radiocarbon dating of the Shroud ´ The late chemist Raymond Rogers concluded in his peer reviewed article published in Thermochimica Acta that the age of the cloth was surely 1300 3000 years , it could be Christ´s burial cloth 9) Shroud scientific researchers are not trying to convince unbelievers or flawing conclusions to .give support to christian beliefs. They are making non profit investigation on this such unique relic that deserves a special status in scientific world. Greetings, Maria da Glória.","date":"2008-10-01","mins":"9:53 pm","url":"https://shroudstory.com/2008/09/29/francis-bacon-and-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Francis Bacon and the Shroud of Turin"},{"id":"comment-2248","author":"maria_da_glória_gonçalves_barroso","post":"This post pointed out an important fact dealing with intrusion material which I can’t help quoting “so many scientists didn’t anticipate the problem given that there were ample warning signs at the time.” As far as I remember no one mentions Dr. John Tyrer’s advice on that matter, but I think it’s worth remembering. Dr. John Tyrer a british textile expert published an article on the Shroud in textile journal Textile Horizons December 1981 entitled «Looking at the Shroud of Turin as a Textile» and after analyzing photographs of the Shroud ,just by looking at the place where Raes sample had been taken he stated “There is therefore some doubt as to wheter the sample described by Professor Raes as Piece II is the edging strip or part of a patch.IT IS IMPORTANT THAT THIS MATTER BE RESOLVED IF IT IS INTENDED THAT THE FORTHCOMING CARBONDATING TESTS ARE TO BE MADE ON RAES SAMPLE.THE PATCH IS PROBABLY MEDIEVAL.” This was written in 1981.Is this the first clue to help invalidate radiocarbon test dating of the Shroud? I guess radiocarbon labs ignored this advice. If someone is interested to read it the article is available in http://www.shroud.it scientific articles best regards Maria da Glória Centro Português de Sindonologia.","date":"2011-01-20","mins":"10:21 am","url":"https://shroudstory.com/2011/01/19/joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-24","author":"maria_da_glória_gonçalves_barroso","post":"Skeptics can claim whatever fits their hate for religion and God ,nevertheless its not honest to doubt the accuracy and meaning of scientific studies like the Robert Villareal´s and his team from Los Alamos National Laboratory. As we know this study confirms once more that the radiocarbon sample was taken from a rewoven area ( the late professor Raymond Rogers himself a researcher who followed the scientific method applied to the Shroud of Turin had already concluded that in 2005) so 1988 carbon dating can no longer be an argument against authenticity. All other evidences namely historical documents ( skeptics always «ignore » pre 1356 facts that proof Shroud´s existence before that time like Robert de Clari´s text, the sermon of Gregory Referendarius , Pray Codex , Codex Vossianus Latinus and so on ) forensic data and the chemical and physical properties of the image point to only one conclusion THE IMAGE OF JESUS CHRIST after all the inflicted sufferings as the Gospels talk about true science tells us the image was not man made and even now with most advanced technologies its not possible to produce even the face of the Man of the Shroud ( remember that the claimed 3 D encoding of the last experiment to my knowledge by Nathan Wilson – the Shadow Shroud was reliably debunked by the french expert in computer image processing Christophe Mignot who is not a shroud researcher ) As Dan Porter says in his amazing website SCIENCE CANNOT RULE OUT A MIRACLE BUT IT CAN AND DOES RULE OUT FAKERY The only logical conclusion (obviously not explained by science ) is that the Shroud of Turin was the silent witness of that unique event CHRIST ´ RESURRECTION So what else culd it be ? greetings Maria da Glória.","date":"2008-08-27","mins":"9:34 pm","url":"https://shroudstory.com/2008/08/26/more-tetherd-cow-ahead-on-the-shroud-of-turin/","cat":"carbon_14_dating","title":"More Tetherd Cow Ahead on the Shroud of Turin"},{"id":"comment-228","author":"maria_da_glória_gonçalves_barroso","post":"With great sorrow I couldn´t watch Discovery Channel´s documentary « Unwrapping the Shroud » aired last sunday night because portuguese Discovery Channel scheduled other programs and I don´t even know if it will be aired. So ,trying to know people opinion about the subject I read the comments on this blog and I was surprised with so much inaccuracies stated by Mr « uncleducke 316 ». When he mentions «the french scientist » I guess it`s about an experience that took place in June 2005 in Paris Natural History Museum sponsored by Cercle Zéthetique ( a kind of atheist society ) in which Paul Eric Blancrue ( he´s not a scientist but an historian and declared atheist who holds a skeptic website against Shroud´s authenticity ) purportedly would produce ( not a shroud , as uncleduke 316 states) a face like the one in Turin Shroud in 5 minutes with all his properties namely 3 D encoding. To achieve this task iron oxide mixed with a gelatin binder was applied over a cloth moulded on a bas relief of Christ´s face inspired on the Shroud of Turin Obviously the result is quite different from the original, just to mention: The image is not superficial, iron oxide particles go deep in the threads and there is cementation of fibers. It is chemically different ( real Shroud Face results from change in color of a superficial impurity layer composed of starch residues and polysaccharides in topmost thread fibers there is no cementation and colored fibers are side by side with colorless ones ). That face shows obvious distortion, has sharp boundaries ,and appears quite different from the original. Mr. Uncleduke 316 should visit the website http://www.suaire science.com and read Dr. Thibault Heimburger´s article on that subject , compare the images and make his own opinion The alleged 3 D encoding was debunked by a computer sciences and image software expert engineer Christophe Mignot who isn´t even a shroud researcher who after studying that face , «shadow shroud´s face »from Nathan Wilson experiment, and the real Shroud´s Face concluded that only the real one had true 3 D encoding As Episcopalian says there is the possibility that the Man of the Shroud was cleaned before entombment by a scanty washing but that doesn´t preclude remaining blood stains over the body and new blood oozing from the wounds as forensic pathologists like Pierre Barbet , Robert Bucklin and Frederick Zugibe stated. It´s just preposterous to say that «they left the crown of thorns ». It was not a crown of thorns ,forensic analyses of scalp forehead and back of the head of the Man of the Shroud concludes that the multiple puncture wounds namely injury to forehead arteries and veins were produced by a kind of helmet of thorns that was obviously removed when the body was placed and covered by the Shroud If Mr. Uncleduke 316 reads my comment and honestly thinks to have got reliable information I´ll be very pleased. Greetings Maria da Glória.","date":"2008-12-16","mins":"11:28 pm","url":"https://shroudstory.com/2008/12/01/new-shroud-documentary-to-air-on-discovery-channel-in-december/","cat":"carbon_14_dating","title":"New Shroud Documentary To Air On Discovery Channel In December"},{"id":"comment-105","author":"maria_da_glória_gonçalves_barroso","post":"No matter if the person who writes about the Shroud is religious or non believer , should be careful about information sources and always seek the truth. Everybody knows Joe Nickell is an old anti shroud authenticity and his arguments are indeed predictable he mixes little relevant information with misleading one and conceals important data. I agree totally with your rebuttal but I´d like to add some stuff It´s totally false that Gospels don´t mention a burial cloth : you just have to read Matthew , Mark and Luke , all of them mention a cloth that wrapped Christ´s body. If Joe Nickell knew the meaning of « othonia » he wouldn´t take John´s gospel as an argument , and besides he ignores the existence of a tenth century document relative to Edessa cloth which corroborates the evidences that it was indeed the Shroud folded in a way to show only the face – obviously I’m takking about « Codex Vossianus Latinus» kept in Leyden University Lybrary. It´s also ludicrious to say that the image should have distortions , who says that ignores that scientific image studies concluded that whatever made the image acted in an orthogonal way paralell to the gravity line to impress «every surface area point » on the cloth; he also ignores the amazing work of Mario Latendresse explaining why the present distorsions are meaningless. And at last , to finish my long comments just a few words about the so called modern fake I guess it was Nathan Wilson´s Shadow Shroud whose image is completely different from a physical and chemically aspect and although his author claimed 3 D encoding , such claim was debunked by Christophe Mignot a scientist not a Shroud researcher whose expertise is 3 D image analysis ( in http://www.suaire science.com ) I recall Dan Porter´s sentence «Science cannot rule out a miracle but it can and does rule out fakery ». And till now science didn´t rule out the Shroud as a fake. Greetings Maria da Glória.","date":"2008-09-11","mins":"9:24 pm","url":"https://shroudstory.com/2008/09/11/ridiculous-shroud-is-fake-article-at-suite101com/","cat":"carbon_14_dating","title":"Ridiculous ‘Shroud is fake’ article at Suite101.com"},{"id":"comment-1195","author":"maria_da_glória_gonçalves_barroso","post":"I am not a chemist expert but after reading this post I became really worried thinking of the possibility of the Shroud beeing submited to such dating method. When Dr Rowes admits the possibility of employing this new technique for dating the Shroud of Turin I make a legitimate question does he know the nature of chemical change of topmost linen fibers that produced the cromophore? The late Dr. Alan Adler published at least two papers on Shroud conservation and oxidation was considered a big threat to mantain the contrast between image and non image areas. If this method of applying an electrically chargedgas causes oxidation of the surface nonimage fibers will change color and image areas will no longer be discernible. I sincerely hope church authorities listen to a scientific commission opinion before irreversible damage occurs. I utterly agree with all comments namely from Professor Stephen Jones. Let´s preserve the Shroud this sacred linen cloth is a legacy to Mankind best regards Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2010-03-30","mins":"5:09 pm","url":"https://shroudstory.com/2010/03/24/new-dating-technique-might-help-with-the-shroud-of-turin/","cat":"carbon_14_dating","title":"New dating technique might help with the Shroud of Turin"},{"id":"comment-274","author":"maria_da_glória_gonçalves_barroso","post":"Hi Mr. John Andrews Scientific studies concluded that Jesus Christ was wrapped in the Shroud as a corpse and left the imprints of the dorsal and ventral regions of His body on it which are separated by a distance that fits the lenght of the top of the head. The logical conclusion is that the Shroud was folded in two parts. Image studies concluded that some bloodstains don´t match anatomic origin showing cilindrical distortion when the Shroud is flattened namely from head area and clots don´t have abraded surfaces. Not entering into details the logical conclusion is that the body didn´t move while wrapped in the Shroud and there is no scientific explanation how the body was removed from the Shroud. From a theological point of view the Resurection explains all those facts and the Shroud probably stayed folded in two parts as it was before. Nevertheless we can´t be absolutely sure because the only clues we have is the Mozarabic rite intoduced in religious practices in sixth century visigothic Spain by St. Leander bishop of Seville who travelled to East and probably saw the Shroud with the body imprints and so added that to the gospel of John stating « Peter and John ran to the tomb and saw the linen cloths with the imprints of the dead and risen Man » Nobody knows exactly how the Shroud was when the disciples entered the empty tomb that Sunday morning nonetheless we surely know that the Shroud was folded that way by the people who buried Jesus. We cannot say that folding means He will return but we certainly can infer that the image left on the Shroud of Turin is the absolute proof of His Resurrection best regards Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2009-02-19","mins":"10:26 pm","url":"https://shroudstory.com/2009/01/30/tv-alert-unwrapping-the-shroud-new-evidence-to-be-rebroadcast/","cat":"carbon_14_dating","title":"Television Special Feb 1: Unwrapping the Shroud: New Evidence"},{"id":"comment-443","author":"maria_da_glória_gonçalves_barroso","post":"I guess Mita Jain´s post is quite interesting nonetheless I don´t agree with several assertions. She doesn´t care wether the Shroud is authentic or a forgery for her the only thing that matters is that the Shroud is allegedly a symbol of peace and believing it is Christ´s burial cloth is not harmful. For a christian the central question of his faith is Christ´s resurection and that event is the main tenet of christian religion. The apostle St. Paul wrote that if Christ did not rise from the dead then our faith is vain and our preaching is vain. The Shroud of Turin bears an image that has not yet been explained by scientific studies and probably will never be. May be in a near future scientific studies will conclude that what caused the chemical changes responsible for coloring the uppermost fibers of Shroud´s threads was an electomagnetic energy with such a wavelength but that is as far as science can reach As Mita Jain focussed 1988 radiocarbon dating was flawed and can no longer be a skeptic claim against Shroud´s authenticity. As a longtime Shroud researcher with all knowledge I gathered from historical and scientific studies the SHROUD TURNS OUT AS AUTHENTIC and for me it does really matter if it is genuine. Science obviously cannot prove or disprove Christ´s resurection and also cannot prove that the image depicted on the Shroud belongs to Jesus Christ. But the only logical conclusion we can infer is that it is an unexplained image of Jesus crucified naked body on a linen cloth and the result of a miracle and from a theological point of view that miracle was Christ´s Resurection. That´s why I care if the Shroud is genuine it is a material legacy of Jesus Christ to mankind. Let´s think about this best regards Maria da Glória CENTRO PORTUGÊS DE SINDONOLOGIA.","date":"2009-05-04","mins":"9:31 pm","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","title":"Shroud of Turin Opinion"}]
