[{"id":"comment-3469","author":"maria_da_glória_gonçalves_barroso","post":"Hi It’s always a pleasure to read such interesting remarks about the Shroud made by well informed Shroud researchers. I agree that not all roman flagrums have the same size dumbells but there’s no doubt scourge stains are blood marks dumbell shaped with a halo of serum. As far as I remember Professor Alan Adler stated that they are not whole blood but a blood clot exsudate produced by direct contact with the cloth. Nevertheless if we examine the Image of the Shroud surely there are image areas of the body that were not in contact with the fabric but appear on the cloth because image was not produced by a contact mechanism but by a kind of collimated raditional mechanism as Dr Alan Adler stated. Professor Fanti and Professor Mario Latendresse presented interesting papers concluding that the Man of the Shroud’s kind of wrapping was not too tigh the Shroud simply beeing draped over the body just like sixteenth century Della Rovere’s beautiful picture depicted. Holograms of the Man of the Shroud produced by Dr. Petrus Soons and his team showed that scourge marks followed anatomical body segments shape for example concerning thighs or legs they curve in cilindrical way even where there was no contact with the cloth. My doubt is apparently we’re left with a paradoxical situation because we see on the cloth scourge marks that had to be imprinted on the cloth by contact but paradoxically they are in non contact image areas e.g. Inferior thigh areas and superior leg in dorsal body image. Had the body first been tightly wwrapped Dr John Jackson’s way and blood clot exsudate stained the cloth, and afterwards someone released the strips so the Shroud was just covering the body in the tomb when image was produced? It seems to me we’re left with a conundrum. If Yannick , Ron or someone else can help me to solve this I’d appreciate. Best regards Maria da Glória Centro Português de Sindonologia.","date":"2011-07-29","mins":"8:12 am","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","title":"More on Flagrum Proportions and Measurements and Now the Side Strip"}]
