[{"id":"comment-185","author":"maria_da_glória_gonçalves_barroso","post":"After reading this article I can´t help making some comments about Picknett and Prince´s ridiulous theory about the Shroud image. 1 Everybody knows that the first Shroud display in western Europe was in 1356 in a Lirey church in France ; Leonardo da Vinci was born in 1452. How could he make such an artifact before even beiing born? The theory that Duke Louis of Savoy later ordered him to make a more perfect Shroud is preposterous. 2 Their theory deals with a lot of inaccuracies , just to mention: If the photographic emulsion had egg Shroud image fibers shoud test positive for proteins that doesn´t happen and the late chemist Raymond Rogers submited image fibers to Pyrolysis Mass Spectrometry which discarded nitrogenous residues. There were no refrigerators at that time so the tortured and flogged bodies Leonardo «got» would have rotten before such images formed on the cloth. The face of the Man of the Shroud has the features of a semitic man that´s the opinion of anthropologic experts ; Leonardo was an italian. 2 The image of the Shroud is not a photograph Photographs reult from reflected light and from analysis of highlights and shadows an image expert can infer light direction. In the Shroud image there is no light directionality it just seems that the light or whatever made the image comes from the body itself ! A face in a photograph has sharp contours ; the face of the Man of the Shroud has no distinct boundaries fading into colorless areas. Photographic image of a body is always an «albedo » image it don´t has 3 D encoded data unveiled by a VP 8 scan. How can these authors explain that it was possible to produce an hologram from such a photograph? It´s not possible to obtain Holograms from 2 D images as Dr Petrus Soons states and the hologram of the Man of the Shroud had missing data that produced hole like defects explained by the israeli botanist expert Professor Avinoam Danim as places where flowers were laid over the body ! They don´t deal either with the fact that underneath blood stains there is no image. EXPLAIN ALL THIS STUFF Ms Picknett and Mr. Prince !!! If you want to read a detailed explanation just go to Barrie Schwortz´s wonderful website ( http://www.shroud.com ) and search scientific papers his article « Is the Shroud of Turin a Medieval Photograph? » Some years ago, before getting interested in Shroud studies I bought their book Templar Revelation but soon I realized that their claims were absolutely ludicrous and I didn´t finish it and it is still in my bookshelf. It´s just time waste to read such books. Greetings Maria da Glória.","date":"2008-10-23","mins":"10:00 pm","url":"https://shroudstory.com/2008/10/21/the-ridiculous-picknett-and-prince-photograph-theory/","cat":"history","title":"The Ridiculous Picknett and Prince Photograph Theory"},{"id":"comment-11070","author":"maria_da_glória_gonçalves_barroso","post":"I and my husband have been at Valencia Shroud Congress and listened to Dr Marcia Boi´s presentation on the Shroud pollens on April 30, and we guess ETWN News misinterpreted what was conveyed by her lecture. We apologize if we will afford wrong information because the presentation was spoken in spanish and we are portuguese, nevertheless portuguese people usually understand spanish language. Basically she claimed: Gundelia Tournefortii pollens were misidentified, and actually they belong to the species Helychrisum which is an insect borne pollen. The Man of the Shroud (Jesus) was buried as a king so His body was annointed with burial spices accordingly to Jewish burial customs and the body had not been washed. Pollens were tranfered to the cloth only because they were contained in the burial ointments. At the end the attendance questioned her, and my husband asked Dr. Marcia Boi if she had ever considered the possibility that flowers had been laid on the cloth, so there could be an alternative possibility for the presence of insect borne pollens. She answered that Jewish burial rites precluded flowers being laid beside the corpse. We think this presentation deals with several problems: 1 Did experienced israeli botanists Professors Avinoam Danim and Uri Baruch misidentified Gundelia Tournefortii pollens on microscopic examination? 2 What observations back up her claims? It was not clearly stated that she had access to the same pollen samples israeli botanists had observed which were collected by the late Dr. Max Frei. 3 We utterly disagree that the Man of the Shroud was buried like a king, actually who buried him did it hastilly and surely without the honors a king should be granted. 4 Then comes the caveat of body not beeing washed as she asserted. If the body had not been washed is it logical to annoint it thoroughly? Would it be logical to make a «mix» of blood and ointments covering all the body surface? If the body had been covered by a layer of burial oils and blood we must consider two problems: How would it be possible image to be produced on the cloth, namely dorsal image, if blood halts whatever produced chemical tranformations on the cloth responsible for the image? How would it be possible to observe those perfect images of scourging injuries with a roman flagrum with defined outlines and a serum halo? For Dr. Marcia Boi the presence of burial ointments is an an undisputable fact. How can she be so sure if this issue is a debatable question even among sindonologists nevertheless it being a strong possibility. Although Professor Adler and Dr John Heller’s studies did not conclude for their presence onthe cloth they did not exclude it either, and Professor Pierluigi Baima Bollone detected the presence of Aloes and Myrrh onthe cloth by immunofluorescence( at a Shroud Conference in Turin 2000 we have the book with all the lectures) Thats what I and my husband commented after Dr.Marcia Boi’s presentation, which although it showed images with a good quality, did not convince us on the validity of her claims. Warmest regards Maria da Glória and Antero de Frias Moreira Centro Português de Sindonologia.","date":"2012-05-02","mins":"2:19 pm","url":"https://shroudstory.com/2012/05/02/two-thousand-year-old-ointment-residue-discovered-on-the-shroud/","cat":"history","title":"Two Thousand Year-Old Ointment Residue Discovered on the Shroud"},{"id":"comment-1444","author":"maria_da_glória_gonçalves_barroso","post":"In my opinion even if 21st century technologies achieve to obtain an image on a linen fabric with ALL Shroud of Turin’s characteristics that cannot be used either as a skeptical argument or a true pro authenticity one. When I wrote ALL I meant all optical physical and chemical properties of the Shroud image on a fabric,ruling out all the purported Shroud fakes namely Shadow Shroud and Garlaschelli’s, because if we go deeper on scientific analysis neither has the chemistry and optical characteristics of the true Shroud. But let me explain my viewpoint: If a medieval forger managed to fake the Shroud of Turin undoubtedly he would have to perform a miracle and skeptics don’t believe miracles that defy laws of nature. I agree with Dr.Andrew Silverman’s comment because to duplicate Shroud image scientists got to figure out how the image formed on the cloth and till now scientific theories just approach how the image could possibly form on the cloth. But even if an image just like the original one could hypothetically be reproduced by a laboratory experiment it would argue neither against authenticity nor pro authenticity (because if the Shroud is authentic it’s image originated from a human body… and not from an experiment using some kind of energy acting on a linen cloth to color it’s fibers). If the Shroud originates from the 1st century and an hypothetically 1st century forger by a theorethical unknown technology faked the Shroud, that would be still a miracle, perhaps a bigger miracle, but that’s complete nonsense. Considering the third possibility that the Shroud of Turin has imprinted an image resulting from the projection onto the cloth of ventral and dorsal surface points of a real human body (and that is true from a scientific and forensic point of view)that is an unique event which happened once in all the History of Mankind all facts pointing to that body beeing the one of Jesus Christ. Leaving out of discussion here so many other issues I guess will be mentioned on «trial» by Shroud’s attorney the Jury’s verdict can be no other than the SHROUD IS AUTHENTIC. Best regards Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2010-09-23","mins":"10:21 am","url":"https://shroudstory.com/2010/09/22/trial-of-the-shroud-of-turin-at-newman-university-in-wichita/","cat":"history","title":"Trial of the Shroud of Turin at Newman University in Wichita"}]
