[{"id":"comment-423","author":"maria_da_glória_gonçalves_barroso","post":"I agree with Mr.Miller when he states that even famous painters from the renaissance period could not have painted such an image but not just because of lack of technical means the reason is just because microscopical spectromety and chemical analysis discarded paint pigments dyes or stains responsible for the image. As a matter of fact the image «did happen by a means other than painting» it is the visual effect of colored areas of the Shroud fading into colorless ones.Colored areas are the result of chemical change in a thin polysaccharide layer on topmost fibers of Shroud threads but what caused that has not yet been determined with certainty by scientific studies. Of course that it is beyond the scope of science to prove that the image is of Jesus body but with all the historical and scientific knowledge it turns out that it cannot be other than Jesus´image that is the only logical conclusion. When it comes to Mr. Anagliph I guess his claims are simply ludicrous and nobody would believe that painting a body and wrapping it in a cloth authomatically creates a negative like effect on it not to mention 3 D and Holographic properties as the Shroud image posseses. And by the way not just contact body areas produced image on the Shroud non contact areas produced also lighter color effects as distance from the cloth incrases.The flows depicted on the Shroud are real human aged blood as forensic and biochemistry experts concluded. Even so called skeptics or dyed in the wool total skeptic should be wise enough not to equivocate and not to behave as iconoclasts making preposterous assertions. Regards Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2009-04-30","mins":"7:12 pm","url":"https://shroudstory.com/2009/03/08/a-new-comment-promoted-on-tetherd-cow-ahead-discussion-on-the-shroud-of-turin/","cat":"image_theory","title":"A New Comment Promoted on Tetherd Cow Ahead Discussion on the Shroud of Turin"},{"id":"comment-9241","author":"maria_da_glória_gonçalves_barroso","post":"Once more Da Vinci conspiracy theories about Shroud image production are resurrected, this time not by a kind of protophotography technique but by «pyrography». My husband’s new upcoming book about the Shroud does focus on this issue and the reader will understand why such claims are just preposterous. Let’s unveil what he wrote on this subject. As Dr. Barrie Schwortz pointed out back in 2003, areas of scorched linen fluoresce under U.V. Light exposition and Shroud image does not fluoresce under such condition, and besides Irene Corgiat’s scorch image has not encoded 3 D data like the Shroud and doesn’t deal with blood stains problem either. If a microscopic observation would be done on fibers from this scorched image surely the crystalline pattern of cellulose molecules organization would be altered to an amorphous one, which does not happen with Shroud image fibers and colored fibers would not be found side by side with uncolored ones. The Shroud Image is unique and as Professor Alan Adler once stated «Leonardo can rest in his grave» Best regards Maria da Glória Centro Português de Sindonologia.","date":"2012-03-12","mins":"6:46 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","title":"Irene Corgiat’s Shroud of Turin Image"},{"id":"comment-9274","author":"maria_da_glória_gonçalves_barroso","post":"I’m not a scientist and neither is my husband who is a medical doctor but there are some members of Centro Português de Sindonoogia from several fields of science who agree with scientific information conveyed by S.T.U.R.P. Investigators and others. When it comes to the Shroud, real scientific information is gotten mainly from those who had access to direct study of the Shroud and gathered samples for off site studies and later published their findings on peer reviewed scientific journals. S.T.U.R.P. Studies, Professor Raymond Rogers and Professor Adler’s studies are considered crap by Dr.Colinsberry, to him only does matter his own opinion, and that’s truly outrageous to honest Shroud scholars. Shroud science should be based on facts and not guesses. The late Dr. Walter Mc Crone is on the skeptic side but nevertheless his conclusions disagree from Dr. Colinsberry claims of the image on the Shroud being a scorch. Dr. Colinsberry stated that scientific investigation should be done so here goes a challenge for him. Dr. Colinsberry as a great scientist he claims to be should be able to reproduce by his scorch technique a life size image of the Shroud that would fit ALL characteristics and properties of the Shroud image namely optical, microscopical , physical and chemical and which would deal with the blood marks being impressed on the cloth before the image. And why not present this hypothetical work at «Scientific Conference on the Holy Shroud» which will be held at Valencia University Spain next April 28 29 30 ? I guess the comitee is still accepting papers just search http://www.linteum.com best regards Maria da Glória Centro Português de Sindonologia.","date":"2012-03-13","mins":"7:12 am","url":"https://shroudstory.com/2012/03/12/irene-corgiats-shroud-of-turin-image/","cat":"image_theory","title":"Irene Corgiat’s Shroud of Turin Image"},{"id":"comment-826","author":"maria_da_glória_gonçalves_barroso","post":"Hi I agree with everything shroud scholar Russ Breault stated in this excellent post but nonetheless I´d like to focus on some particular aspects of Shroud image. It does not surprises me at all that as Shroud Exhibit is approaching skeptics posit theories and make alleged scientific experiences do discredit the Shroud.The same has happened on Lents with the Gospel of Jude, Talpiot Tombs and all that sort of stuff after da Vinci Code… Actually italian chemistry professor Luigi Garlaschelli claims a medieval forger could have easilly accessed to materials like a linen cloth and red ocher to fake the Shroud. THIS SOUNDS LIKE A DÉJA VU It is a well known fact that red ocher is not responsible for the image on the Shroud and we have a reliable «corpus of evidence» to stste that: Red ocher is mainly natural iron oxide with impurities such as Mn Ni and Co ; Shroud iron oxide appears in a pure form and results from oxidation of Fe bound to cellulose linen fibers in water stains and in scorch areas from charred blood. X Ray Fluorescence and microchemical tests discarded the presence of such metallic contaminants so it turns out red ocher does not make the image neither does iron oxide and why? X ray fluorescence concluded that iron concentration is not increased in image areas but as expected is actually increased in bloodstained areas due to hemoglobin iron So beeing neither red ocher nor iron oxide are responsible for image color and iron oxide does not disappear from the fabric like a touch of magic as professor Garlaschelli tries make us to believe. It is also an established fact that the chromophore of image fibers is a conjugated carbonyl. If we remember the backlit photograph of the Shroud the image is no longer discernible so iron cannot be there in sufficient concentration to form the image. Another aspect I´d like to focus is 3 D encoding No doubt at first sight photogaphic negative of Garlaschelli´s shroud face looks like the real one but if we watch carefully it is not so. Professor Giulio Fanti has already analized the alleged 3 D encoding and results are quite elucidative THE IMAGE APPEARS DISTORTED AND WITHOUT REAL 3 D ENCODING. So beeing I guess it will not have holographic encoding as the true Shroud image does. We cannot take seriously a claim that instead of resulting from a research published in a peer reviewed scientific journal appears in a press release No doubt we have to admit that Garlaschelli´s shroud was a clever experiment and him and his team cunningly produced a shroud with some similarities to the real one but I utterly disagree from CNN news stating «Scientist re creates Turin Shroud to show it´s fake» it should rather state Scientist tries to fake the real Shroud of Turin. But there is just one real SHROUD OF TURIN AND IT WAS NOT MAN MADE best regards Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA http://www.santosudariodeturim.blogspot.com.","date":"2009-10-17","mins":"11:08 am","url":"https://shroudstory.com/2009/10/16/is-the-shroud-of-turin-a-fake/","cat":"image_theory","title":"Is the Shroud of Turin a Fake?"},{"id":"comment-5437","author":"maria_da_glória_gonçalves_barroso","post":"Dear friends I’m really amazed with the wealth of excellent comments on this issue and there is very few lett to add, nevertheless I’d like to make my own statement on this amazing forum of discussion. The bloodstains are overwhelming evidence that the image on the Shroud is from a crucified man who was crucified the way romans did it in ancient times, and besides he had been flogged with a roman torture device called flagrum as has been pointed out. The blood stains are indeed human blood and,even honest agnostics or atheists cannot deny it. Blood marks convey more information as the pattern of puncture head wounds and the spear wound on the right side of the chest ,which match the way Jesus of Nazareth endured His Passion and death on the cross. My husband who is also a Shroud researcher has just finished writting a book (which will be released in Portugal next year) about the Shroud, focussing on the scientific aspects and there roman crucifixion is studied from a medical and archaeological point of view. When romans put someone to death by crucifixion the condemned could not be taken down from the cross alive so on rare circunstances soldiers pierced the chest to confirm death a fact that Yannick Clement very well pointed out, cannot be distinctive from other crucified victims. But when it comes to the blood marks on the head that’s another story because there are no historical records of someone other than Christ to have suffered such a mocking torture. Anyway as Gabriel hypothesized Middle Age fanatics could have crucified someone the way Christ had been crucified namely in Spain, but this interesting theory has to deal with two facts, artistic renditions of Christ depicted Him with a crown of thorns and not with a helmet or cap and there is nothing in the Shroud history linking it to Spain, let alone many other peculiarities of blood marks, and the fact dead bodies don’t impress images on the cloths covering them, at least till now none was found. Ron pointed out the unique characteristics of the Image on the Shroud and I guess that’s a very important fact, and even Professor Garlaschelli with his knowledge of the chemical characteristics of the image on the Shroud could not achieve a similar image on linen. Physical and Mathematics Turin University Professor Bruno Barberis is the author of an interesting book entitled «Shroud, carbon dating and calculus of probabilities» Edition St. Pauls U.K. 1998 that my husband bought at Museo della Sindone in Turin. In chapter The Man of the Shroud and the Calculus of Probabilities he considers seven aspects shared by the Man of the Shroud and Jesus of Nazareth, namely the wrapping of the corpse in a sheet,the head wounds, carrying the cross,crucifixion with nails, the side wound,the hasty burial, and time the corpse stayed in the sheet after burial, and concluded that only one in two hundred billion crucified people could satisfy ALL these conditions put together, in other words, the Man of the Shroud is indeed Jesus of Nazareth. Even not agreeing with criteria Professor Barberis used we must remember that when romans crucified people corpses were usually left on the cross as a deterrent for by passers and the body either rot on the cross or was food for wild animals or birds of prey. Even when the body was removed it was usually thrown into a ditch and only on rare instances if roman authority granted permission for burial, family members could bury the corpse, as Gospels account on Joseph of Arimathea and Jesus burial wrapping with a linen sheet. Most Jewish shrouds did not survive because of the effects of decomposition products from decaying bodies, the Shroud of Turin is one of the very few exceptions. I’ll share with you a fact my husband mentioned and I feel the same. It’s worthless to argue with some atheists on the Shroud because they have no sound knowledge of it and when they are faced with facts as the blood and the oddities of the image they cannot deny, they just «neglect» those facts and simply ask something like this «but why can’t the image on the Shroud be of some guy other than Jesus? there should be lots of bearded males with long hair in ancient Palestine»…it seems that the fact the Shroud could be a «proof» of the existence of the historical Jesus messes with their minds, and their dogmatic atheistic beliefs. Even skeptics consider the image on the Shroud an artistic rendition by painting, photograph, and so on of Jesus Christ. For me it is not unreasonable to think that if image production on the Shroud is still an unexplained phenomena, the image and blood marks entirely matches Jesus Christ as Passion is described in the Gospels, no doubt that is a weird fact. But if JESUS CHRIST WAS ALLEGEDLY THE SON OF GOD HE AND NO ONE ELSE was the only candidate to produce such a weird phenomena. It is not by chance that the last chapter of my husband’s book is entitled «Who is the man of the Shroud final remarks». Best regards Maria da Glória Centro Português de Sindonologia.","date":"2011-12-11","mins":"1:36 pm","url":"https://shroudstory.com/2011/12/07/why-do-we-think-it-is-an-image-of-jesus-on-the-shroud-of-turin/","cat":"image_theory","title":"Why do we think it is an image of Jesus on the Shroud of Turin?"}]
