[{"id":"comment-8228","author":"maria_da_glória_gonçalves_barroso","post":"Hi! Mr «Superfluous Man» seems to be honest when dealing with the Shroud but despite assuming he is not aware of «the state of the art» asserts «technically if one were able to prove that the Shroud was certainly from the year 33 A.D. Even this still would not conclusively prove that it belonged to «Christ» (i.e. There were many other men who were crucified and died in or around that period)». That’s a good question indeed, and I invite him to read the post and excellent comments on this blog entitled « Why do we think it is an image of Jesus on the Shroud of Turin» December 7, 2011. Maybe there he’ll find the answer. I’d be glad to know his advice regards Maria da Glória Centro Português de Sindonologia.","date":"2012-02-14","mins":"8:19 am","url":"https://shroudstory.com/2012/02/13/comment-of-a-superfluous-man-brought-to-the-top/","cat":"news_&_views","title":"Comment of A Superfluous Man Brought to the top"},{"id":"comment-2","author":"maria_da_glória_gonçalves_barroso","post":"Hi shroudies I´m a member of Centro Portugês de Sindonologia ( it´s a center for Shroud studies in Portugal that´s the country where last Savoy´s owner of the relic died in exhile ). It´s a great joy for all portuguese Shroud devoutees to have soon the happyness to contemplate the face of our Saviour as He left His imprint to testify the Resurrection. We hope our good american friends who without any material profit allow access to so wonderful and reliable information in their websites have new scientific information about Ohio Shroud Conference. I´m very curious about what skeptics will claim… Perhaps they´ll say again that´s pseudoscience… We are planning to make new Shroud activities next Lent c you greetings Maria da Glória.","date":"2008-08-20","mins":"7:28 pm","url":"https://shroudstory.com/2008/08/20/dates-for-2010-exhibition-of-the-shroud-of-turin/","cat":"2010","title":"Dates for 2010 Exhibition of the Shroud of Turin"},{"id":"comment-145980","author":"maria_da_glória_gonçalves_barroso","post":"Congratulations. Thank God you found another place for the Museum Go on spreading the Shroud message. Regards. On behalf of Centro Portugês de Sindonologia Maria da Glória.","date":"2014-08-25","mins":"4:36 am","url":"https://shroudstory.com/2014/08/23/new-mexico-shroud-museum-to-reopen/","cat":"news_&_views","title":"New Mexico Shroud Museum to Reopen"},{"id":"comment-1302","author":"maria_da_glória_gonçalves_barroso","post":"I´ve bought the DVD Shroud when I visited Museum della Sindone (Shroud Museum in Turin) during a pilgrimage to Shroud Exhibit May 15. I consider it a very interesting documentary providing the viewers recent and reliable historic and scientific information on the subject nevertheless it contains some unforgivable inaccuracies such as the kind of cross where the Man of the Shroud was crucified and besides it is shown a «crown of thorns» piercing His head. This is misleading information because forensic studies point rather to a kind of torture device like a helmet made of thorny plants. This is an important clue to discard artistic rendition of the Shroud because as far as I know there are no medieval or renaissance Jesus paintings or sculptures with a helmet of thorns. For those who seek recent and accurate information I recommend to watch it. Best regards Maria da Glória Centro Português de Sindonologia.","date":"2010-06-02","mins":"6:39 am","url":"https://shroudstory.com/2010/04/12/press-release-from-performance-films-new-shroud-dvd-from-david-rolfe/","cat":"2010","title":"Press Release from Performance Films: New Shroud DVD from David Rolfe"},{"id":"comment-143361","author":"maria_da_glória_gonçalves_barroso","post":"Accept our sympathy We’re sure God will provide you a way to continue your mission From Portugal,, warmest regards Maria da Glória Centro Português de Sindonologia.","date":"2014-08-11","mins":"4:52 am","url":"https://shroudstory.com/2014/08/10/seam-is-closing-today-the-end-of-an-era/","cat":"news_&_views","title":"SEAM is Closing Today:  The End of an Era?"},{"id":"comment-3238","author":"maria_da_glória_gonçalves_barroso","post":"Dear Dr. Dan Porter On behalf of Centro Português de Sindonologia I wish you get better to keep your wonderful shroud blog always updated Maria da Glória.","date":"2011-06-14","mins":"7:32 am","url":"https://shroudstory.com/2011/06/09/where-have-you-been/","cat":"uncategorized","title":"Where have you been?"}]
