[{"id":"comment-11111","author":"maria_da_glória_gonçalves_barroso","post":"I’ve been at Valencia attending the Congress with my husband an we’re privileged to watch the documentary «The night of the Shroud» which is very interesting and surely no biased on the matter of 1988 radiocarbon dating and their rebuttal by Benford, Marino and Professors Raymond Rogers and Robert Villareal. At the end my husband asked producer Francesca Sarracino when would the DVD be available to the public, and she said maybe next September best regards Maria da Glória Centro Português de Sindonologia.","date":"2012-05-04","mins":"7:45 am","url":"https://shroudstory.com/2012/05/04/the-night-of-the-shroud-premiered-in-spain-by-rai-in-valencia/","cat":"other_blogs","title":"The Night of the Shroud premiered in Spain by RAI in Valencia"},{"id":"comment-11189","author":"maria_da_glória_gonçalves_barroso","post":"Hi Ron I don´t mind answering your question nonetheless the best is to wait for having the opportunity to watch this interesting documentary and then draw our own conclusions. We’ll do it for the second time and with grat pleasure. T He documentary deals with several Shroud issues but it focusses mainly on 1988 radiocarbon tests and the aftermath of their daing results, hence the name of the documentary. I’ll highlight the following aspects The hidden agenda behind planning radiocarbon dating tests involving the labs, Professor Harry Gove and the Vatican is thoroughly analyzed. An updated information about Sue Benford and Joe Marino’s invisible reweaving repair theory, and unbiased information on Professor Raymond Rogers and Robert Villareal’s investigations on residual material from 1988 radiocarbon samples. At the end, people watching the documentary become aware that «the night of the Shroud» has come to an end and the truth will prevail I strongly recommend watching this documentary. Best regards Maria da Glória Centro Português de Sindonologia.","date":"2012-05-07","mins":"5:30 am","url":"https://shroudstory.com/2012/05/04/the-night-of-the-shroud-premiered-in-spain-by-rai-in-valencia/","cat":"other_blogs","title":"The Night of the Shroud premiered in Spain by RAI in Valencia"},{"id":"comment-1436","author":"maria_da_glória_gonçalves_barroso","post":"I utterly agree with comments from Noya and Tersio and despite we’re dealing with Universe creation and Big bang phenomenon I guess we can establish a parallel reasoning with the Shroud of Turin. May be in a near future science will be able to conclude what made de image that is to say determine what caused chemical change on tha thin polysaccharide layer around topmost fibers of the fabric, nevertheless even if a kind of mechanism for example corona discharge ocurred in a given moment and may account for that effect there will be a lotta questions without answer. What caused corona discharge? Why so called by products of that or other phenomena caused those chemical changes? Why those chemical changes resulted in an image effect with such weird charactristics as Shroud of Turin’s image? Did that effect ocur just by chance? I’m sure science won’t answer these questions and like in Big Bang the only logical and right answers will be God and Resurrection regards Maria da Glória Centro Português de Sindonologia.","date":"2010-09-16","mins":"7:06 am","url":"https://shroudstory.com/2010/09/02/stephen-hawking-says-gods-not-needed-so/","cat":"news_&_views","title":"Stephen Hawking says God’s not needed. So?"}]
