[{"id":"comment-4599","author":"maria_da_glória_gonçalves_barroso","post":"Dear friends Professor Fanti is a great scientist who has given important contribution to the scientific study of the Shroud of Turin last couple of years, following the important S.T.U.R.P.’s studies and many others by american researchers. His image computer studies on the Image definitely shed light on the way the Man of the Shroud had been wrapped and his height and relative body parts position by extracting information from image luminance. If you read his papers about the hypothesis of image formation by Corona Discharge you’ll become aware of the complexity of the subject, and no way it goes scientifically against rational hypotheses. Read also his paper about comments on gas diffusion hypotheses and you’ll understand why Professor Rogers’ theory on amyno carbonyl reaction cannot explain all the characteristics of the Shroud of Turin image as admited by himself. Professor Giulio Fanti is crystal clear when he asserts that the Resurrection is a phenomenon non reproducible by science but LEAVING SCIENTIFIC GROUNDS could be the explanation for the hypothezised Corona Discharge and its by products. I agree that the image on the Shroud of Turin is not «the proof» of the Resurrection, and Ressurection cannot be explained by science nonetheless if you’re Christian or Catholic and you believe the Shroud of Turin is authentic and really did wrap the crucified body of Jesus Christ, then it is not absurd to consider the Shroud as the material witness of a weird phenomenon that happened in a dark tomb about 2000 years ago with a man who is supposed to be the Son of God. If scientifically speaking the Shroud is not the «proof» of the Resurrection, from a theological and phylosophical stand point no doubt it is. If we consider ourselves Christians we should not fear to state that the Resurrection was a physical event and the Shroud is an important clue to belive it really was. Best regards Maria da Glória Centro Português de Sindonologia.","date":"2011-11-05","mins":"2:50 pm","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"},{"id":"comment-4640","author":"maria_da_glória_gonçalves_barroso","post":"Dear friends When I wrote my comment I didn’t imagine it was going to start a kind of debate on the Resurrection and the Shroud.I guess I stated crystal clear my opinion on that subject and after reading Yannick’s comment it turns out his point of view doesn’t differ too much from mine. If from a scientific point of view it cannot be stated that the Shroud of Turin is the «scentific proof» of the Resurrection, I and even scientists may infer that although the image depicted on the Shroud was produced by a natural but yet unknown agent,that happened under unknown conditions. So the big question is why a dead body imprints its image on a cloth? The answer will be quite staightforward BECAUSE THAT BODY WAS UNIQUE and a special event happened on that dark tomb some time after the burial. I guess maybe Yannick misunderstood the word «by products» I meant not by products of the Resurrection but by products of a possible natural event such as Professor Fanti’s Corona Discharge hypothesis or other kind of natural phenomena. I think Domenico understands what I mean, nevertheless that was an uncommon phenomena and it happened only once in the History of Mankind and only with a man whom we believe was Jesus Christ. So be it a sign as Yannick calls it or a clue the fact is that the image on the Shroud backs up christian belief on a real and physical Resurecction of Jesus and not a kind of «spiritual» Resurection whatever it may be. We should not claim that the Shroud is the proof of the Resurrection but no doubt its own existence and the message it contains supports that belief. Maria da Glória Centro Português de Sindonologia.","date":"2011-11-07","mins":"10:33 am","url":"https://shroudstory.com/2011/11/04/a-guest-posting-by-giulio-fanti/","cat":"news_&_views","title":"A Guest Posting by Giulio Fanti"}]
