[{"id":"comment-141403","author":"maria_da_glória_gonçalves_barroso","post":"Commenters on this blog are going astray from the point. Iread very interesting comments on ancient art but, The real thing is as follows: There is no known artistic image or produced by any other means, being it of Christ or any other historical or fictional person, with the characteristics pointed out by Dr. John klotz, neither there is any image on a cloth that wrapped a corpse with the mentioned properties. These are ESTABLISHED FACTS and that’s it. Skeptic community keep on searching…… (what a worthless task…) Congratulations to Dr. John Klotz for this Challenge and for his new book THE IMAGE OF THE MAN OF THE SHROUD IS UNIQUE regards Maria da Glória Centro Português de Sindonoogia.","date":"2014-07-31","mins":"5:15 am","url":"https://shroudstory.com/2014/07/26/john-klotz-issues-a-challenge-show-me-an-image/","cat":"books","title":"John Klotz Issues a Challenge:  Show Me an Image"},{"id":"comment-2052","author":"maria_da_glória_gonçalves_barroso","post":"As a modest Shroud researcher I can’t help comment, Dr Mark Oxley’s post is just brilliant it´s the kind of explanation that summarizes crystal clear all reliable scientific information on the controversy of 1988 radiocarbon dating of the Shroud, so there is almost nothing left to add nevertheless I´ll remember one more fact Dr.J. Timothy Jull apparently has neglected. Let alone all microscopic and chemical aspects the late Dr Raymond Rogers pointed out in his paper, he noticed spliced threads in material from the Raes sample and this finding was later confirmed in a study by Dr Robert Villareal and his team from Los Alamos National Laboratory presented at Ohio Shroud Conference held in Columbus 2008. Dr Thibault Heimburger by contrast phase micoscopic studies in remaining material from radiocarbon sampling area,also confirmed the presence of threads where dyed cotton fibers were spliced to linen fibers. I utterly disagree with William, Skeptics Dictionary has nothing worth reading about the Shroud of Turin and Mr. Joe Nickell’s assertions on Shroud matters are always biased by an atheis point of view. Mr Joe Nickell is not a scientist so he has not the right to criticize from a technical point of view Dr Raymond Rogers’ paper which was published in a peer reviewed scientific journal and Dr.Raymond Rogers was absolutely honest stating that Dr Luigi Gonella provided him the radiocarbon threads. Most information about the Shroud on so called skeptic websites is completely misleading and nothing but utter bogus. Dr Mark Oxley’s book «The Callenge of the Shroud» is truly one of the best easy ways to get reliable and updated information on the Shroud of Turin. Hystorical information provided is fantastic and it was a great pleasure reading this book. My sincere congratulations to Dr Mark Oxley for his book and his post. I wish all Shroud of Turin blogger’s a HAPPY NEW YEAR Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2010-12-31","mins":"1:08 pm","url":"https://shroudstory.com/2010/12/30/outstanding-response-to-recent-carbon-dating-paper/","cat":"books","title":"Outstanding Response to Recent Carbon Dating Paper"},{"id":"comment-24643","author":"maria_da_glória_gonçalves_barroso","post":"I’m sorry Ron. Please try to google «the unknown life of christ edgar j. Goodspeed» or http://www.tentmaker.org/books/Famous Biblical Hoaxes.html hope this will work Thanks to Hugh farey for the help Maria da Glória.","date":"2013-02-18","mins":"5:33 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-24342","author":"maria_da_glória_gonçalves_barroso","post":"Holger Kertsten claims are just speculations and the swoon theory has been dismissed long ago by forensic experts. Nevertheless like the Da Vinci theory on Shroud image production this theory surfaces from time to time and we must be aware of it. My husband approaches this subject thoroughly in his book «Sudário de Turim, mortalha de Cristo ou fraude medieval?» (unfortunately not yet in english language..)and for those interested on this issue I provide one of the references he consulted, an interesting reading by historian Edgar J. Goodspeed Famous Biblical Hoaxes or Modern Apochrypha Chapter one The Unknown Life of Christ http://www.tentmaker.org/books/Famous Biblical Hoaxes.html regards Maria da Glória Centro Português de Sindonologia.","date":"2013-02-15","mins":"4:58 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-24646","author":"maria_da_glória_gonçalves_barroso","post":"Sorry for mistyping Hugh Farey Maria da Glória.","date":"2013-02-18","mins":"5:46 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-248","author":"maria_da_glória_gonçalves_barroso","post":"Very good video indeed I guess it´s not an updated one nonetheless it provides quick and reliable information on this subject. Why not the famous new Shroud documentary Unwrapping the Shroud on next post ? greetings Maria da Glória CENTRO PORTUGUÊS DE SINDONOLOGIA.","date":"2009-01-10","mins":"6:09 pm","url":"https://shroudstory.com/2009/01/04/talking-about-youtube-shroud-of-turin-windows-live/","cat":"news_&_views","title":"Shroud Of Turin Video on YouTube"}]
