[{"id":"comment-174927","author":"todd","post":"Hello everyone, I think the discussion on The Shroud of Turin is utterly fascinating! It is amazing how the discussion can take some pretty sharp turns in different directions. I have read a lot of information pertaining to the Shroud. Both for and against authenticity. One of the things I find most intriguing are the 3 D properties of the Shroud. Scientists have confirmed that this piece of linen cloth contains the most advanced image ever seen by man. It is truly a one of a kind. It is the only two dimensional image on earth that can be photographed and turned directly into a 3 D image. This aspect alone is enough to convince me. I do not believe there has ever been anyone in the middle ages, let alone now, that has the ability to create an image with these properties. If so, they would have been the greatest genius to have ever lived. If such a genius did exist, don’t you think that they would have demonstrated their abilities in a different manner? If a genius such as this did exist, don’t you think he would have communicated this ability in some way, to someone? No, I think The Shroud of Turin speaks for itself. If there is someone out there that can find a two dimensional object that can be photographed and the photograph be turned directly into a full 3 D image,[ edited] Thanks for the insights.","date":"2014-12-06","mins":"9:47 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174942","author":"todd","post":"Just show that it has the same properties as the Shroud [edited].","date":"2014-12-06","mins":"10:45 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174949","author":"todd","post":"Great, now all you have to do is present your evidence and research to peer review so that the image can be confirmed to have the 3 D holographic properties of the Shroud of Turin. You are one step closer to being famous, [edited].","date":"2014-12-06","mins":"11:44 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174957","author":"todd","post":"Colin, FYI there is no one on earth that has a two dimensional image that contain the 3 D properties of the TS. IF you doubt this FACT. Please do your homework. If you indeed have in your possession an image that contains the same properties, you are much more intelligent than the finest Physicists on earth. As a matter of fact. The Shroud image can not be explained by physics. Like I said before. IF you have cracked this mystery, you are a super genius. Prove me wrong..","date":"2014-12-06","mins":"12:35 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174952","author":"todd","post":"Colin, I think your next experiment might be to take a photograph of the image that you are showing, and convert the photograph to a 3 D hologram. That would be absolutely amazing!!!!!!!!!! If this is true, you are absolutely the finest genius on earth. Hats off to you……..If it’s true. I would head straight down to the Oxford physics department to let them know that you have cracked the mystery. Your gonna be a legend!!! You have me completely exited about this!!!!!.","date":"2014-12-06","mins":"12:06 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174954","author":"todd","post":"Colin, I have heard a lot of talking. Present your evidence. A simple image won’t due. If this were legit, I’m sure that it would have gotten some serious attention. The fact that I am just seeing it for the first time is a little suspect. Here in lies one of the main issues. People are quick to talk, but when it comes to evidence…………………..Well that remains to be seen?.","date":"2014-12-06","mins":"12:18 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174959","author":"todd","post":"[edited] If it’s true that Colin has managed to crack this mystery, I will be the first to congratulate him. I would like to meet him in person to shake his hand. I am not trying to be brash..","date":"2014-12-06","mins":"12:53 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174965","author":"todd","post":"Hugh, This is the problem. What you are saying is absolutely absurd. If it were true…….. We probably would not be talking about it right now. Fact is that no one on earth can currently explain the UNIQUE PROPERTIES of the shroud. If you say that I am incorrect, then show the proof. [edited].","date":"2014-12-06","mins":"1:50 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174958","author":"todd","post":"Well of course you are right about all of those terrible things. One piece of advice I have for you though. Do not underestimate the power of The Shroud of Turin Image. We may find in this very image some of the answers to the problems that you have listed? Just a thought? Respectfully Yours, Todd Nelsen.","date":"2014-12-06","mins":"12:38 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174978","author":"todd","post":"My apologies. If you have any current information that I am not aware of regarding the image properties I would be very interested. I am only aware of the current studies that have been presented regarding the 3 D properties of the photograghs that we currently have. Sorry if I got carried away. Todd Nelsen.","date":"2014-12-06","mins":"3:32 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174976","author":"todd","post":"David, there is a reason that I was so specific about the two dimensional image having to be photographed, and that photograph made into a three dimensional image. In other words, if you can take a photo of a photo and turn that photo into a three dimensional image. That is the phenomenon that I am referring to. As far as i am aware, the shroud image is the only one on earth that bear these characteristics. What you gentlemen are saying if I am correct…….. That you currently have a means of creating an image that bears the same three dimensional characteristics as the shroud of Turin. I am asking you to present, in a logical manner this evidence so that the rest of us can compare. It’s that simple.","date":"2014-12-06","mins":"3:26 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174979","author":"todd","post":"A far as I am aware, physics has not presented an explanation as to how a two dimensional object , has 3 D caracteristics such as are present on the shroud. Again, If you have any information that refutes this, then I would be interested. Thanks Dan.","date":"2014-12-06","mins":"3:35 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174983","author":"todd","post":"I am sorry if I was not clear. What I am saying is this. If you were to take a photograph of the image that you just posted, and viewed it under a VP 8 analyzer, you would see a flat or distorted image. If you look at an image of the shroud, you get a 3 D image. I understand that we are able to make 3 D images. Not refuting that..","date":"2014-12-06","mins":"4:39 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174990","author":"todd","post":"Here is a quote from a study that I found. “The VP 8 image analysis revealed that a photograph of the Shroud image was “spatially encoded”, i.e., it possessed depth information and resulted in anatomically correct 3 D images of the face and the body. So now they had the scientific proof that the observations of Paul Vignon were correct. It is important to note, that they experimented with lots of photographs of faces and other images, including paintings, and that the result always was a distorted image.”.","date":"2014-12-06","mins":"4:56 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175006","author":"todd","post":"The two most important and irrefutable modern day discoveries, by Pia for one and by Jackson et al for the other, both come from image processing and remote sensing of the Shroud. No picture of any other person, statue, or artwork produces results equal to Pia’s photonegative of the Shroud. No photograph of any other person, statue, or artwork causes results equal to the brightness plot of the VP8 Image Analyzer system viewing a Shroud image. A third, recent improvement of image processing analysis has produced unequaled results from works by Dr. Petrus Soons, by Ray Downing, and by others who have proven the value of spatial database management and processing of Shroud images. These works yield outstanding 3 D models of the data present on the Shroud. My continued work is motivated by these discoveries and process improvements. The Shroud is very exciting. It continues to prove there is always more to learn about all the information it contains..","date":"2014-12-06","mins":"6:55 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175033","author":"todd","post":"Here is a quote from DR. PETRUS SOONS THE SHROUD OF TURIN, THE HOLOGRAPHIC EXPERIENCE “Dr s. Jackson and Jumper used a densitometer to extract the gray scale information and then with the help of the VP 8 Image Analyzer, translated this information into vertical relief, which resulted in the first three tridimensional photos of the Shroud image. They were able to conclude that Vignon’s theory was correct. The work of Prof. Tamburelli confirmed this also. It is important to note that if you use any regular photograph in this process, the result will be distortion and flattening of any three dimensional features, because there is no photograph that contains the 3 D information that we find in the image on the Shroud.”.","date":"2014-12-06","mins":"9:57 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175101","author":"todd","post":"Hugh, So far I have seen and image of a brass Jesus draped in cloth, and a baby. I have heard you say that what I am saying is wrong. All of the studies that I have read say that what you are saying is wrong. Can you provide published work that refutes the claims that have been made that the photos of the shroud of turin have spacial encoding unlike any other photograph? If these claims have been refuted by credible evidence, I would be most interested..","date":"2014-12-07","mins":"10:45 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175257","author":"todd","post":"Hugh, Let’s set the Hologram debate aside. Let’s focus on some of the statements that I have made regarding the spacial encoding of 3 D information. Would you tell me flat out that the Shroud when photographed, does not have any different properties than any other photograph? As for the studies that have been done on the Shroud of Turin. There are many. A lot of this information can be found readily on line. I have listed quotes from two of them that say “No other photograph contains spacial encoding when viewed under the VP 8. If this is not true, then can you please provide information to the contrary ?https://www.shroud.com/pdfs/schumchr.pdf.","date":"2014-12-08","mins":"3:07 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174964","author":"todd","post":"Hugh, Unfortunately you are mistaken. Think Again. Show the evidence. Again, Talk is cheap..","date":"2014-12-06","mins":"1:46 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175261","author":"todd","post":"Quote by: Peter M. Schumacher “Consider the following: The Shroud of Turin induces a result through photographic imaging that is unique, compared to all other photographic results taken from other objects of the same acknowledged period as the Shroud, of prior periods, and to the present day. It is the “data” existing on the Shroud of Turin, which induces the unique photographic results. Therefore, the Shroud image, itself, is unlike any other object or image known to exist.” OK Hugh, Maybe you can respond to this quote. I ask again that you provide published evidence to refute this claim..","date":"2014-12-08","mins":"3:32 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-174974","author":"todd","post":"Hue, Sounds like a lot of talk. Maybe you should submit this with the evidence you are suggesting that refutes the current evidence that shows that the shroud is indeed a 3 D hologram imposed on a piece of linen cloth to a peer review and see if what you say stands up to scrutiny. Again, if this is the case you would be refuting the current claims. If what you say is true………………..present the evidence. [edited].","date":"2014-12-06","mins":"3:00 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175263","author":"todd","post":"OK Hugh, the Holographic properties of the shroud are a theory based on the unique 3 D properties of the Shroud. The theory may indeed be true. Or not. There is evidence to suggest that it is. Here is a quote from a discussion on this matter. “Chidambaram Ramesh gives us his explanation how this holographic 3 D quantum matrix of the body of Jesus Christ could have projected itself onto the surface of the Shroud linen, creating the image of Our Lord Jesus on the Shroud. He gives us also an explanation of some of the very specific characteristics of the Shroud image, the photographic negativity and the built in body to linen 3 D information in the grayscale of the image that ought to be explained by anybody who proposes a new image formation mechanism. When you reconstruct a hologram from the master hologram, it produces a real and a virtual image of the object in 3 D. A copy of the virtual image is always positive. A contact copy of the real holographic image however, is a “negative” image as we can observe in the Shroud image. Photographs of quantum holographic manifestations as recorded for example by Dela Warr’s device show spatially encoded 3 D information when subjected to the Bryce Program or VP 8 Image Analyzer, and this is what we can observe in the Shroud image also. Another series of specific Shroud image qualities like the non directionality, superficiality and the half tone effect can also be explained with this quantum holographic idea.”.","date":"2014-12-08","mins":"4:06 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175287","author":"todd","post":"Hugh, I am sorry to say that it is pretty hard to make a comparison. It is a small photo posted on a web site. I would have a better time considering this work, if there were some study that was provided that could be confirmed by someone besides you and Colin. I have not seen any study that cites Colin’s work. Can you or Colin Provide this? Hugh, Please don’t get me wrong. If this truly does represent a true comparison to the shroud it is amazing, I have never heard of anyone getting even close, so I would be very surprised. It would be the second known object with these special properties, and surely would go along way to possibly explaining how the image on the shroud was formed..","date":"2014-12-08","mins":"8:01 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175289","author":"todd","post":"Hugh, I was unaware, as you may be as well, that Collin’s scorch hypothesis has been ruled out long ago. Attached is a link to a study done on this very subject. Https://shroudofturin.files.wordpress.com/2012/10/scorch paper en.pdf.","date":"2014-12-08","mins":"8:30 pm","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"},{"id":"comment-175381","author":"todd","post":"Well obviously I am not going to get credible studies from you gents to make a logical determination about your image testing. If it were available I’m sure you would point me to it. I will have to conclude on the basis of the conversations, and the fact that the only evidence that you have presented is a photo of a scorched piece of cloth, that you have a long way to go to convincing anyone but yourselves. Colin, if what you say is true, it sounds like all you have to do is take the study that I posted, and to write a counter to this study with your findings, that refute each statement made. I’m sure it would go a long way to proving your point, and eliminate a considerable amount of hot air. It was a pleasure to speak with you fine gentlemen. I am sure there is a group of people out there that will buy your arguments, but as of yet you have not convinced me..","date":"2014-12-09","mins":"11:36 am","url":"https://shroudstory.com/2014/10/11/is-the-shroud-evidence-for-gods-existence/","cat":"other_blogs","title":"Is the Shroud Evidence for God’s Existence?"}]
