[{"title":"\nObituary (2): Dr. Alan Duane Whanger (17 July 1930 - 21 October 2017)\n","post":"\n\nToo much enthusiasm is enemy of objectivityDear Dr. Stephen JonesI praise such excellent and objective post.Those who claim you're an non-objective authenticist should shut their mouths after reading this article on congruence points and instruments of crucifixion allegedly seen on the Shroud.Although we cannot deny that Dr. Alan Whanger's findings corroborate previous Paul Vignon's theory on Byzantine Christ icons his claims are indeed essentially subjective.I utterly agree with you on the claim of hammer and nails which is a «pareidolia».Nevertheless he has provided Shroud researchers interesting findings namely his claims on flower images on the Shroud that were confirmed by israeli botanist Professor Danim and its worth to remember a paper he wrote on X-Ray photographs of the Shroud whose findings add more pieces of evidence against the validity of 1988 radiocarbon dating of the Shroud.To sum up Dr. Alan Whanger will be remembered as a dedicated Shroud scholar and his work will remain as a tool for Shroud researchers.                                       regards                             Antero de Frias Moreira and Maria da Glória Barroso                          (Centro Português de Sindonologia)\n\n","author":"Anonymous","date":"January 10, 2018 at 1:10 AM","url":"http://theshroudofturin.blogspot.com/2018/01/obituary-2-dr-alan-duane-whanger-17.html","site":"moore"},{"title":"\nObituary (2): Dr. Alan Duane Whanger (17 July 1930 - 21 October 2017)\n","post":"\n\nAntero and Maria >Too much enthusiasm is enemy of objectivityAgreed.>Dear Dr. Stephen JonesAgain, it is plain \"Mr\".>I praise such excellent and objective post.Thanks.>Those who claim you're an non-objective authenticist should shut their mouths after reading this article on congruence points and instruments of crucifixion allegedly seen on the Shroud.Thanks again. >Although we cannot deny that Dr. Alan Whanger's findings corroborate previous Paul Vignon's theory on Byzantine Christ icons his claims are indeed essentially subjective.Agreed. Whanger should have published photographs of his best claimed points of congruence on each icon/coin for peer review. >I utterly agree with you on the claim of hammer and nails which is a «pareidolia».And since the claimed crucifixion nail, spear and phylactery (next) are the Whangers' most prominent examples of instruments and objects associated with Jesus' crucifixion, we may reasonably assume that all his claimed such images:\"Other images found include what we think are a sponge on a long stick or pole (identified as the reed Arundo donax), two small nails, a large hammer, a pair of pliers with curved irregular indentations on the inside upper of its jaws, two scourges (two groups of string-like objects), a trowel or spoon, two brush brooms, an entire sandal, a small coiled rope, a cloak and/or tunic, the title (or part of it) nailed above his head, and what appear to be gambling dice. Also found were a head phylactery, arm phylactery, and a Roman amulet.\" (Whanger, A.D. & Whanger, M.W., 2015, \"Other Images,\" Council for the Study of the Shroud of Turin,\" Durham NC)are dubious at best. [continued]\n\n","author":"Stephen E. Jones","date":"January 10, 2018 at 9:11 AM","url":"http://theshroudofturin.blogspot.com/2018/01/obituary-2-dr-alan-duane-whanger-17.html","site":"moore"},{"title":"\nObituary (2): Dr. Alan Duane Whanger (17 July 1930 - 21 October 2017)\n","post":"\n\n[continued]>Nevertheless he has provided Shroud researchers interesting findings namely his claims on flower images on the Shroud that were confirmed by israeli botanist Professor Danim Agreed. I am going to give Whanger credit for that when I get to that part.>and its worth to remember a paper he wrote on X-Ray photographs of the Shroud whose findings add more pieces of evidence against the validity of 1988 radiocarbon dating of the Shroud.Agreed. See my \"X-RAYS #22\" post. Whanger's \"Autoradiography\" was his most important discovery for which he should be remembered, not his \"Points of Congruence.\">To sum up Dr. Alan Whanger will be remembered as a dedicated Shroud scholar and his work will remain as a tool for Shroud researchers.Agreed. But not for his \"Instruments of the Crucifixion\" which only held him up to ridicule by sceptics such as Nickell, who used it to discredit Whanger's other work and ultimately the Shroud itself:\"Shroud of Rorschach ... a retired geriatric psychiatrist, Alan Whanger, and his wife Mary, former missionaries who have taken up image analysis as a hobby ... visualized ... perceived shapes seen--Rorschach-like--in the shroud's mottled image and off-image areas. These include `Roman coins' over the eyes, head and arm `phylacteries' (small Jewish prayer boxes), an `amulet,' and such crucifixion- associated items (cf. John, ch. 19) as `a large nail,' a `hammer,' `sponge on a reed,' `Roman thrusting spear,' `pliers,' `two scourges,' `two brush brooms,' `two small nails,' `large spoon or trowel in a box,' `a loose coil of rope,' a `cloak' with `belt,' a `tunic,' a pair of `sandals,' and other hilarious imaginings including `Roman dice'--all discovered by the Whangers (1998) ...\" (Nickell, J., 2001, \"Scandals and Follies of the 'Holy Shroud',\" Skeptical Inquirer, Vol. 25, No. 5, September, pp.17-20).>regards>Antero de Frias Moreira and Maria da Glória Barroso>(Centro Português de Sindonologia)And to you.Stephen E. Jones----------------------------------MY POLICIES. Comments are moderated. Those I consider off-topic, offensive or sub-standard will not appear. Except that comments under my latest post can be on any one Shroud-related topic. To avoid time-wasting debate I normally allow only one comment per individual under each one of my posts.\n\n","author":"Stephen E. Jones","date":"January 10, 2018 at 9:12 AM","url":"http://theshroudofturin.blogspot.com/2018/01/obituary-2-dr-alan-duane-whanger-17.html","site":"moore"}]
