[{"id":"comment-60111","author":"kelly","post":"The carbon testing was properly done. Read the research report written by the team of people who did the sampling and the team of scientists who did the testing. The carbon testing had three different samples taken, which were independently tested in three laboratories in three different countries. Because the Vatican was intimately aware of every square centimeter of the shroud, it was the cardinal and the scientific advisers who were a major contributor and decision maker on where to take the sample. They chose the area right next to where the Vatican had taken an earlier sample, a location that had no burn marks, no patches, no soiling, no unusual contamination. The samples were cleaned of contaminants under a microscope. The Vatican will never agree to more C14 testing, because they agree with the test results (as do the majority of scientific, historic, and biblical experts). The few ultra religious people who keep coming up with excuses of why the tests aren’t valid will never believe results that show the shroud is a fake, no matter how many times or ways its tested, so no one’s going to put any time or effort or money into it. Regarding Fanti’s test, he came up with the testing method himself, which no other scientist has verified or confirmed. He didn’t allow anyone else to even look at his method or results before he published his book on it. While he says he used the same samples as the C14 testing, of course, that can’t be true. They aren’t available. Besides, if they’re questioning the viability of those samples, then how could he justify using them? Did you read where Fanti got his sample? A vacuum was put between the shroud and its backing, and dust was collected. Fanti tested that dust. How many hundreds of years was the shroud hanging around collecting dust from all over the place? Fanti’s test method and results have nothing to do with science and are another obvious attempt to prove the shroud isn’t a medieval fake. Fail!.","date":"2013-12-16","mins":"3:17 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"}]
