[{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"John , if you accept that you are as likely to be right as I am and I am as likely to be right as you are, then there is no need for exasperation and we can all get on with our studies of the Shroud.\nThere was once a burial shroud (no reason to think otherwise from what the gospel sources tell us)- is the Turin Shroud it, or is another surviving cloth it- or has it vanished at some point in history as vulnerable textiles tend to do?\nAt some point there is going to be a new breakthrough in research- it simply has to happen- perhaps, as with the case of the Horses of St.Mark’s in Venice, through research on different medieval/more ancient artefacts altogether which will illuminate the ‘mystery’ of  the Shroud.\n\n","date":"May 21, 2015 at 10:11 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199771","author":"Charles Freeman","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Charles,\nI appreciate the courtesy of your comment but I do not accept the concept that I am as likely as right as you are or visa versa. The first sentence of my book is “We do not order our lives by proof beyond reasonable doubt.” Nonetheless we do make decisions. \nI have spent my professional career dealing with proving and disproving things. When I graduated law school, I won an award for the best contribution by a senior student to the law review. It was a note on the evidentiary principle of res ipsa loquitur:  the facts speak for themselves. My principal point was that res ipsa was simply an application of the rules of circumstantial evidence.\nI appreciate the fact that it would be a bit of arrogance (if not simony) for me to insist that you buy by book. So here’s a freebee. The arguments about authenticity drawn from my book in the guise of a review of the CNN production of CNN’s Funding Jesus is available on the web at no cost at http://www.shroud.com/pdfs/klotzcnn.pdf (I do not know if that TV program was available across the pond). Excuse my self-absorption if I cite that piece as “Klotz”).\nI will now give you a lecture (I’m not nearly as arrogant as I write) on the Shroud and circumstantial evidence citing four physical objects three of which are in physical existence today and one of which we have available only through a painting of it. The three which physically exist to day are (1) the Shroud of Turin; (Klotz p. 4), (2) The Pray Codex in Budapest Hungary. (Klotz p. 5) and (3) an illustration in the prayer book of Margaret of France (Klotz p. 3). The one which is not in existence but of which we have a painting is the Lier Shroud. (Klotz p. 5).\nThere is no question that three of them are artistic representations and one of them is NOT an artistic representation but actually has burn holes surrounded by a charred ring. (See illustration Klotz P. 4) It should be no surprise that the one with actual burn holes is the Shroud of Turin.\nTwo things of interest about the Lier Shroud. It was created before the fire in 1532 and does not therefore evidence the patches sewn on by the Poor Sister of St. Clare. Neither does the Pray Codex. \nHere’s the kicker in my view, the painting of the Lier Shroud shows the degrading of the burn holes from layer to layer. Neither the Pray Codex NOR  Margaret’s prayer book has that verisimilitude.\nI believe it was Colin Berry who refereed to the Pray Codex as “over-hyped.” I do not know what that means scientifically. It is what it is. Those who wish to denigrate it with elegant invective conveniently ignore the facts. In the upper left hand corner of the drawing is a figure with a cloth draped over his shoulder. It’s actually two illustrations. The top part is the burial of Jesus and it shows, inter alia, Joseph of Arimethea. The bottom part is an Angel announcing the Resurrection to the Mary Magdalene and the women who accompanied her. \nThe important point is the consistency of the burn hole configuration among all four items: the original Shroud and the three representations with the Lier Shroud actually showing variations of the holes through four layers.\nThe conclusion to be reached by this circumstantial evidence is I believe unassailable and actually reaches proof beyond reasonable doubt standards. The Shroud predates the time period allowed by the carbon dating.\nSo no, I do not believe that you are likely to be right under reasonable circumstances and it is not a 50-50 proposition.\n\n","date":"May 22, 2015 at 5:58 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199852","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"John- you know my take on the Pray Codex.\n Anyone who saw the Shroud would have seen a double image heavy with bloodstains. Anyone depicting it would have shown some wounds on Christ and some images on the cloth. Four holes on the coffin lid, probably representing the holes drilled in the marble top to the sepulchre in Jerusalem in the tenth century, are not enough to overrule this.\nMaybe fifty-fifty was being generous to you but I appreciate that you have a book to sell.\n\n","date":"May 22, 2015 at 8:51 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199865","author":"Charles Freeman","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Charles,\nThe burn holes are the “fingerprints” of the Shroud. Their repetition in four different objects in the same pattern connects  them. Please identify any art object on the face of this planet that has similar holes in a similar pattern. I believe I made that challenge before and I recall that you never responded. Correct me if I’m wrong.\nEssentially, all you have done is respond to my inquiry by calling me a mercenary. This side of the pond and I assume on your side also, that’s called an ad hominem attack.  It’s generally disregarded. Shame on you.\nI am sure the pseudo skeptics who can not accept the reality of the Shroud becasue it challenges their world review will welcome your next book. It will win a place of honor right-up there with the carbon dating and it will be just as erroneous. \nI also gather you haven’t bothered to read my article. I wouldn’t make a dime and it wouldn’t  cost you a farthing if you did. The fact that the rather crude artist who drew the Pray Codex didn’t include every detail that you want to see a millennium later doesn’t defeat the probative value of the details he did include. Did you ever hear of a partial fingerprint or palm print?\n\n","date":"May 22, 2015 at 9:26 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199869","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Well if anyone met me and only remembered the palms of my hands or the end of the my fingers I would be pretty disappointed!\n\n","date":"May 22, 2015 at 10:08 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199876","author":"Charles Freeman","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Question to Mr Freeman :\nWhat would you prefer Charles, interviewing Samuel Pepys or the artist who created the Shroud’s image ?\n\n","date":"May 22, 2015 at 12:51 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199884","author":"PHPL","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"PHLP. Samuel Pepys, of course. The artist of the Shroud was no Giotto- he was simply following the iconographical conventions of his day.\n\n","date":"May 22, 2015 at 1:18 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199885","author":"Charles Freeman","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"John, I loved your discourse on the HPM.  You are right on the money.\n\n","date":"May 22, 2015 at 12:26 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199883","author":"Russ Breault","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"I see the important lesson from the elephant story as being that each one of the blind men only ever considered one aspect of the object of their study.  Consequently they were not able to achieve a consensus.  This is what we see in an age of specialisation.  Renaissance Man, even the ancient Greeks, had it better when they were given a broad spectrum education.  \nIt has been said that the specialist seeks to know more and more about his particular specialisation, until he knows everything about nothing.  Conversely the generalist might be said to extend his knowledge of all that goes on in the world, until he knows nothing about everything.  It is perhaps a commentary on the natural limitations of the human brain.  Its compass is circumscribed, and one person can only digest so much.  \nHowever to penetrate the enigma of the Shroud, it is not sufficient to concentrate on any single discipline.  They may serve to illuminate a particular aspect, but that is not enough.  None of them singly can hold the key to the mystery.  The broad headings of Science, Religion and History might be able to do it when taken together.  But there is so much that we will never know, and much that is now irretrievably lost. \nEventually we may be able to catch a glimpse of what might only be a ghostly appearance of the elephant.\n\n","date":"May 21, 2015 at 3:38 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199788","author":"daveb of wellington nz","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"John is correct. We are blind men and trying our best how to explain the image formation on the Shroud. Scientists have concluded many aspects of the image yet historians are trying their best to explain that image is a painting.\n\n","date":"May 21, 2015 at 4:20 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199793","author":"Sampath Fernando","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Don’t be too pessimistic about solving the mystery of the Shroud, DaveB and Sampath. Science is moving forward all the time and it is only recently that there has been serious sturdy of painted linens because so few have survived with their images intact. I see no reason why there should not be breakthrough of some kind which will give, for instance, an irrefutable date for the weave and then we can work from there.\nI feel that you have come to the conclusion that research on the Shroud has come to a dead end and will never move forward. I will be surprised and disappointed if it does not when progress is being made in so many other areas of science.\n\n","date":"May 21, 2015 at 5:11 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199797","author":"Charles Freeman","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Mr Freeman – Do you know anything about the Negative Photographic images? or X-Ray images?\n\n","date":"May 21, 2015 at 6:14 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199801","author":"Sampath Fernando","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"The difficulties are many.  A primary difficulty is one of access.  The custodians discharge their duty conscientiously over what many regard as a sacred relic.  Even the scientists seem too narrowly focused.  There are narrow sectional interests.  The big advantage of STURP was that it was multi-disciplinary and they were all able to work together.  We have not seen its like in sindonist studies since.  There seems to be a difficulty with regional and national horizons.  The Americans who contributed so hugely to our present scientific understanding seem to have been locked out by the Italians, who seem to have their own peculiar perspectives.   \nLarge-scale funding is required if the investigations are to be anything other than amateur.  Much of the science too seldom seems to get as far as the peer-review stage.  Colin Berry labours on in his kitchen or his garage, but his work seems to be too agenda driven.  \nOn the historical front, too much has already been lost.  The historians find much to criticise in what meagre documentation there is, and they even complain at intelligent speculation, calling it writing a novel.  \nThe ancients were capable of a great deal more than they are generally credited with.  As a young man, I found Sprague de Camp’s history on the ancient engineers most enlightening.  Given their industry and individual innovation, I do not find it surprising that they might be capable of weaving a herring bone cloth of the dimensions of the Shroud, regardless of what looms might or might not have been generally available at the time.  \nI see no  future in the painted linen hypothesis, only that it may be disproved.  No ancient or medieval painting has the realistic form of the man on the Shroud.  Shred the paint off any portrait on linen.  If anything remains, it will still look like only an artifact by human hand.  \nIn the meanwhile, the Shroud can serve its purpose as an object of religious meditation, which in these pages is too seldom considered.\n\n","date":"May 21, 2015 at 6:30 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199802","author":"daveb of wellington nz","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Disproving my hypothesis that the Shroud was originally a painted linen with iconography of the fourteenth century whose pigments have disintegrated would be a step forward. It has not yet been done so I am keeping the hypothesis alive. \nAs my article In the The  Church Times makes clear , I don’t believe that the Shroud was originally created to deceive anyone and is worthy of its tradition of continued veneration. So no disagreement with the theme of continued meditation- although there are many other works of art also deserving of such meditation.\nWho knows – the pope may order new scientific investigations this coming month.\nNo, Sampath , I don’t know anything about that imaging ( and no one else seems to either in the present state of knowledge) but presumably it is testable with the most sophisticated technology of the day to give us an up-to-date assessment as to whether the images are any more than linen discoloured after long centuries of being covered by pigments. I hope that this testing happens.  \nIt does not seem likely  that the matter has been scientifically settled for all time with scientific techniques developing as fast as they do.\nIt seems likely that either by further direct testing of the Shroud or through evidence accumulated from other  medieval linens, there will at some point a significant move forward in understanding the Shroud.\n\n","date":"May 22, 2015 at 1:19 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199831","author":"Charles Freeman","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Mr Freeman It is a miracle to get a photographic negative Image after pigments have disintegrated from a original painting.\nFurthermore in fourteenth century no one knew how to paint a photographic negative image with such a detail.\n\n","date":"May 22, 2015 at 1:51 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199836","author":"Sampath Fernando","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Fine, Sampath- it’s a miracle then – all settled – but just as so many miraculous cures were later given scientific explanations I am waiting to see what the scientists come up with.\nThere is no reason why you should read anything I write- you are not my target audience when I write for History Today or the Church Times- but I am not arguing that anyone painted a photographic negative. Instead I am putting forward a hypothesis that the linen was discoloured as a result of being overlaid  by gesso ( that calcium carbonate-thanks,STURP ) and pigments for centuries with the varying thicknesses of the original pigments giving the so-called negative photographic effect.\nI am quite happy to see whether what is only a hypothesis can be proved or disproved by further research. No rush but it would be good to see this further research happen in my lifetime. I clearly have a less stressful approach to this than John Klotz.\n\n","date":"May 22, 2015 at 2:14 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199838","author":"Charles Freeman","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Daveb – In the meanwhile, the Shroud can serve its purpose as an object of religious meditation, which in these pages is too seldom considered.\nYes you are correct Daveb. Today for the first time I saw my wife was meditating in front of a photograph of the Shroud.\nThank to Shroud I am still a follower of Jesus. Otherwise I don’t where I stand. For me Shroud is the only Gospel which shows that how God Loved us.\n\n","date":"May 21, 2015 at 7:30 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199807","author":"Sampath Fernando","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Sampath,\nI believe that the Shroud is more than a Gospel, it is a Revelation which lay dormant until it was unlocked by science. That science has revealed to us the meaning of the blood stains and the image at this pint in human history, is also … providential. \nWe are literally facing the possible, if not inevitable, apocalyptic extinction of the humanity. The engine of our extinction is the selfish abuse of the environment empowered by advances in science. Our survival now depends on extraordinary, unprecedented and perhaps impossible acts of individual and collective selflessness. Science whose inventions have brought us to the brink of extinction can, if properly harnessed, give us the tools to pull us back.\nWhat the Shroud teaches by example the power of love to conquer selfishness and death in even the most dire circumstances. Because the evolution that drove the development of our reflective consciousness was driven by selfishness it may very well have been necessary that God his/herself had to give the example of selfless love through the death and resurrection of Christ. God so loved the world that he gave his only begotten son. \nNo simple human could have given the necessary example.\nThe real miracle and revelation is that Christ partakes of our human nature. One of the jotys of my life is to hear on Christmas eve a line of from O Holy night that may sum up the mystery and revelation of Christ for us all:\n“Long lay the world in sin and error pining;\ntill he appeared and the soul felt its worth.”\nIn an E-Mail today, John Jerpe had the following insight:\n“[T]he present state of the world is such that habitual warfare and weaponized technology increase the probability of something apocalyptic. If we already know that the human community might “self-destruct”, perhaps the Shroud (and the Man in it) are saying that there exists dormant within the human organism an energy source we have not even conceptualized yet, hence the image. i.e. Is the Man in the Shroud simply Jesus or is the man in the Shroud you and I?”\nThe Shroud matters not because Christ was God, it matters becasue it testifies and reveals that he was also human – just as you and I.\n\n","date":"May 21, 2015 at 10:40 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199821","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Thank you Mr. Klotz I agree with you.\n\n","date":"May 21, 2015 at 11:58 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199825","author":"Sampath Fernando","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"One wonders if they have heard about the Shroud:\nhttp://news.yahoo.com/communist-chinas-unlikely-catholic-outpost-tibetans-073224432.html\n\n","date":"May 22, 2015 at 6:19 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199900","author":"Louis","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Fascinating story Louis. Thanks for the post.\n\n","date":"May 23, 2015 at 4:54 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199941","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"You’re welcome, John. The story reminded me of the Chinese Bishop Ignatius Kong Pinmei, who spent forty years in jail.They could not break his spirit and he emerged victorious to become a cardinal.\n\n","date":"May 23, 2015 at 6:06 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199952","author":"Louis","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"I am not sure which way this cuts (no pun intended) but remember that the pathologists agree that the body was in a state of rigor mortis at the time of the informage formation (and assumedly from the time of death to that point at least.)\nThat would mean that his chest cavity was elevated at  an angle (slumping forward while on the cross  wold be an elevation  when laid out in the horizontal.. Post-mortem blood flows would mimic that at the time when the rigor mortis set in.\nThere are illustrations of that I haven’t got the time to dig-up right now.  Maybe somebody might have one at their fingertips.\n\n","date":"May 23, 2015 at 7:01 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199956","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"typo: “time of image formation”\n\n","date":"May 23, 2015 at 7:02 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199957","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Regarding the body in the state of rigor mortis, CES http://www.linteum.com hás produced a full-body sculpture.\n\n","date":"May 23, 2015 at 12:11 pm","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199987","author":"Louis","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"John, you wrote: “(…) the painting of the Lier Shroud shows the degrading of the burn holes from layer to layer. Neither the Pray Codex NOR Margaret’s prayer book has that verisimilitude.”\nActually, the Hungarian Pray Ms lower register ink & pen drawing, fol 28 does show from one layer to another degraded burn holes. The L-shaped  burn-holes  are uniformly smaller than the P-shaped ones.\n\n","date":"May 23, 2015 at 9:51 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199974","author":"Max patrick Hamon","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Thanks for the information. I’ll have to check it out.\n\n","date":"May 23, 2015 at 10:24 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-199977","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz, the Blind men, the Elephant and the Shroud of Turin","post":"Still re the HPMs and TS, I wrote on another thread:\n“the picture of the scourge back I posted was just to show you what SCARS of strokes of canes looked like as opposed to relatively FRESH strokes of flagra. Nervertheless both show just a few overlaps in the form of a diagonal cross, like the shape of the letter X in Roman type. Now, a series/line of three diagonal red crosses can be observed both on the TS man’s scourged back and (oddly standing out amid straight lines of tens of red crosses) on the Hungarian Pray Ms lower section folio 28 cross-covered sarcophagus-shaped like lining oddly folded onto itself to show a set of five P-shaped slightly larger burn holes.”\n\n","date":"May 24, 2015 at 3:52 am","url":"https://shroudstory.com/2015/05/21/john-klotz-the-blind-men-the-elephant-and-the-shroud-of-turin/","cat":"other_blogs","id":"comment-200045","author":"Max patrick Hamon","site":"shroudstory"}]
