[{"title":"John Klotz from his upcoming book","post":"There is an old joke about someone asking directions to a particular place and being told, “You can’t get there from here”.  However comic such an assessment may be in terms of ordinary geography, in certain other areas it is no more than common sense.  In charity, and with all due respect, Mr. Klotz is simply mistaken, and not as a matter of mere inadvertence but technically and fundamentally.\n     While it is unexceptionable that Newton’s work did lead some people to philosophical determinism, it is no less so that Newton himself and many scientists following him were not so deceived.  This is Newton writing in the General Scholium: “But there is no direct sense and there are no indirect reflected actions by which we know innermost substances…  No variation in things arises from blind metaphysical necessity, which must be the same always and everywhere.  All the diversity of created things, each in its own time and place, could only have arisen from the ideas and will of a necessarily existing being.”\n     Newton was not only a man of incomparable brilliance, the greatest mathematician since Archimedes, but a great man in the sense Washington would prove himself great: someone unwilling to press an extreme advantage beyond the bounds of Reason.  It is perfectly possible to acknowledge Newton’s physics and, with Newton, remain a theist with all such belief entails.  It is also possible to acknowledge Heisenberg’s physics and be a complete atheist.  Nor is quantum physics itself, as David Bohm held, necessarily indeterministic, and moreover it is at least infelicitous to say, with Mr. Klotz, that quantum indeterminism consists in obeying the rules of probability.  (What sort of “obedience” accords with philosophic indeterminism?)\n     To say that the notion of quantum information “would explain the ‘substance’ of humanity” is utterly misguided.  It is to credit physics with a level of intelligibility it does not, and cannot, possess.  You can’t get to the substance of humanity from physics.  No less a quantum physicist than Richard Feynman in a lecture once admitted that he had not the slightest idea what he was talking about, only that what he was saying happened to be supremely accurate.  He couldn’t say why it was so, but only that it was so.\n     As for the appearance-substance dichotomy in Aquinas, I have never heard or read of it as a “translation of concerns advanced by Plato”.  Aquinas didn’t call Aristotle “the Philosopher” for nothing.\n     I read this blog to try and keep up with scientific researches relevant to determining the authenticity of the Shroud.  That is very different from trying to use the Shroud or anything else to bootstrap scientistic notions about the philosophical claims of physics.  I therefore respectfully suggest that Mr. Klotz needs to reevaluate his case.\n\n","date":"March 23, 2014 at 12:25 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-92311","author":"R. H. Cahall","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"If the Shroud is authentic, and I think it is, then it opens doors to reality that theologians and scientists have tried to nail shut. If you have never seen it, I recommend the following video featuring Stuart Hameroff at http://vimeo.com/39982578\nYou may not agree with it, but Hameroff is I believe is a serious scientist and his thoughst on quantum information were developed in colaboration Sir Roger Penrose, a Noble Prize winner in physics. Hameroff has pushed the the theories farther that Penrose might like but there a joint piece by them on the brain as quantum computer and thought as a quantum phenomenon in an article  “Consciousness in the Universe: Neuroscience, Quantum Space-Time Geometry and Orch OR Theory”,  Roger Penrose, PhD, OM, FRS, and Stuart Hameroff, MD\nIt is part of a collection of article available on Kindle:\nClarke, Chris; Kragh, Helge; Chopra, Deepak; Penrose, Roger; Joseph, R.; King, Chris; Kafatos, Menas; Mensky, Michael (2011-09-27). Cosmology of Consciousness: Quantum Physics & Neuroscience of Mind (Kindle Locations 669-670). Cosmology Science Publishers. Kindle Edition. \nBy the way, do you have any opinion on Hans Berger and his experience with his sister. There are other similar experiences of individuals, particularly in the stress of wartime. Let me give you one I learned of from a friend who served in Viet Nam. A woman stateside awoke during the night to the sound of a rifle shot. That’s  all she heard. Subsequently she learned that her husband in Viet Nam had died from a rifle shot at the very moment she was awakened. If our consciousness is a quantum phenomenon can they not become entangled with other phenomenon. Is that not description of love?\nI believe that science can supply answers to some of these mysteries. And I quote Russ Breault who lectures on the Shroud and appeared in the History Channel production of the Real Face of Jesus:\n “I call the Shroud the X-Files of Christianity.  Could this 14-foot long linen cloth have captured the greatest paranormal event of all time?”\nI appreciate your taking the time to critique my piece. You raise issues that I will have to  consider although I do not believe that anyone speaks ex cathedra in this area. The description of Newton being deterministic is not original to me. Neither is the concept that Quantum Mechanics is not deterministic. At the least, I will  sharpen my references so that if any one has a beef they can go to the source and understand that they are not arguing with me but the source I have relied on. \nTeilhard described the Phenomenon of Man as a book of science. If so, his division of man into essentially a scholastic duality ought to be supported by science. I believe in realm of quantum information we are approaching that point.\n.\n\n","date":"March 23, 2014 at 1:59 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-92333","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"Much of the discussion about the Shroud involves make believe and one must learn to rely on evidence-based reasoning. Philosophy, Theology, Psychology and Physics have not provided answers to many questions and we have to face this problem head-on to obtain more information.\nThe problem is not new:\nhttps://www.academia.edu/5559678/C._G._Jung_Father_Victor_White_and_privatio_boni\nIf this is not done, then RD will feel like the winner, and more and more churches will continue to close down (nine a day only in the USA). If the Shroud is “proved” to have been the burial cloth of Jesus it can help answer some, but not all, questions.\n\n","date":"March 23, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-92347","author":"Louis","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"I have a correction to make and I should have known better. In The Phenomenon of Man, Teilhard ditched the scholastic appearance/substance dichotomy language and substituted an inner/outer dichotomy which is essentially simply a refinement of the scholastic thought. However, in discussing the inner/outer of things the inner existence is consciousness. That is not an ephemeral, can’t be studied or proven theological construct. That is science and everything I wrote applies. This is something I wrote in the introduction to the manuscript: “Science attempting to explain human consciousness is science attempting to define what the religious call the soul.”\nI stand by that. It means that the issue of the soul is now in play for science. I assume there may be some theologians who might object but given the direction indicated by  Penrose/Hameroff they shouldn’t. \nLouis, God grant I generate enough attention to draw the ire of RD. “Bring it on.”\n\n","date":"March 23, 2014 at 4:36 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-92372","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"John, there are attempts to prove that RD is wrong and your book is one of them. I still think there are gaps to be filled, which Teilhard dismissed as a “side effect of evolution”, therefore the link in #3, and when we come to the soul we are also taken to Freud, who thought that the soul was matter. But, did he go deep enough or do we not have access to his other important writings?\n https://www.academia.edu/5565370/Historians_put_Freud_on_the_couch\nThe direction you are taking is highly appreciated and one can only wish you success, but wait for a while as there is more in the box.\n\n","date":"March 23, 2014 at 4:50 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-92376","author":"Louis","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"I am not familiar with Freud’s ruminations on the soul being matter but probably matter as defined by Newton.  I did a quick Google search for Freud and Quantum and right on top was the following abstract from down under:\n“Aust N Z J Psychiatry. 1989 Dec;23(4):483-90.\nQuantum metaphors in deep psychotherapy.\nMorstyn R.\nAbstract\nMost psychodynamic theories are based on Freud’s models of mental dynamics which were significantly influenced by Newtonian physics. Freud’s attempts to use the then current scientific metaphors led to theoretical and clinical dilemmas particularly in deep psychotherapy and especially with borderline patients. The author argues that as Newtonian principles are useful for describing macroscopic reality, so Freud’s Newtonian constructs are useful to a certain depth of therapy. Beyond that point, scientific metaphors can be retained but the appropriate metaphors are those of quantum physics. Quantum metaphors are used to explore duality, free will and patient-therapist interaction.\nPMID: 2610648 [PubMed – indexed for MEDLINE”\nI believe some later works of Freud which predate the above journal abstract by sixty or so years, dabbled in the quantum but I note that in 1989 this author apparently ties Freud pretty close to Newton. Read your review. Quite interesting.\nHis use of the term “matter” for the soul would be a Newtonian construct not a Quantum one. But frankly, I’m not going there.\n\n","date":"March 23, 2014 at 5:17 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-92385","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"Freud made some huge strides to help us understand the human mind. He did not discover the unconscious, as this was implicit in the literature before him (for instance, Eduard von Hartmann),he found the path that led to it. He was known to have read Shakespeare, Goethe, Schiller, Gustave Le Bon and so forth, but it is strange that he hardly mentions Nietzsche, being a member of the Reading Club in Vienna when he was a young man. You know something? I think Nietzsche and Spinoza influenced him more than Newton.\n\n","date":"March 23, 2014 at 5:35 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-92394","author":"Louis","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"Nice information John, I have never ventured into these territories before.\n\n","date":"March 23, 2014 at 9:05 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-92452","author":"Mike M","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"John, further to #7, you must be able to detect evil when it appears, that is why I referred you to Jung, who told Father Victor White that he was wearing Job’s shoes as he lay dying in England. Better still, Freud had something important to say to the Rev. Oskar Pfister about human nature and, highly intelligent as he was, he knew that the pastor would have to keep quiet.\nI think you will understand what I mean.\n\n","date":"March 23, 2014 at 9:55 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-92469","author":"Louis","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"Good morning, John. I think this will interest you:\nhttp://news.yahoo.com/big-bang-bible-040000314–politics.html\n\n","date":"March 24, 2014 at 10:26 am","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-92673","author":"Louis","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"That sounds interesting.  I’ll have to take some time to read that.  Thanks Dan (and of course, John).\n\n","date":"March 24, 2014 at 6:55 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-92819","author":"Andy","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"Hi John. You may find find something useful to you here:\nhttp://ncronline.org/news/vatican/marx-hubbard-response-cardinal-m-ller\n\n","date":"May 14, 2014 at 10:04 am","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-119220","author":"Louis","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"Louis,\nThanks or the Marx-Hubbard link. Could you send me your your personal E-Mail address. to klotzlaw@gmail.com\n\n","date":"May 14, 2014 at 1:35 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-119331","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"Righto, John, I will do it right away. We have much to talk about — with little time at both ends.\n\n","date":"May 14, 2014 at 1:44 pm","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-119340","author":"Louis","site":"shroudstory"},{"title":"John Klotz from his upcoming book","post":"Good morning, John.\nI sent you my personal e-mail yesterday. Remember you sent me a few lines about Elaine Pagels some time ago on the blog? Here is a link to a 49-minute interview with the top theologian and German Cardinal Walter Kasper, who was once archbishop of Stuttgart-Rottenburg, then went to Rome. Father Matt Malone, Editor of “America”, conducted a good interview, and at minute 3 you will see what the common complaint is about.\nhttp://americamagazine.org/media/videos/cardinal-walter-kasper-mercy\n\n","date":"May 15, 2014 at 10:39 am","url":"https://shroudstory.com/2014/03/23/john-klotz-from-his-upcoming-book/","cat":"news_&_views","id":"comment-119962","author":"Louis","site":"shroudstory"}]
