[{"title":"Six Months Ago Today: The Dawkins Challenge","post":"I don’t see everything, but from my little corner of the world, I have noticed no response at all.  Perhaps a direct letter would work better.\n\n","date":"September 29, 2012 at 10:41 am","url":"https://shroudstory.com/2012/09/29/six-months-ago-today-the-dawkins-challenge/","cat":"challenge","id":"comment-17051","author":"Andy Weiss","site":"shroudstory"},{"title":"Six Months Ago Today: The Dawkins Challenge","post":"Dawkins appears to have changed his mind lately and was reported to have begun entertaining the possibility of the existence of God. He has also held discussions with Archbishop Rowan Williams and perhaps he may have also changed his mind about the Shroud. Then, of course, the gauntlet is too heavy for him to pick up.\n\n","date":"September 29, 2012 at 12:07 pm","url":"https://shroudstory.com/2012/09/29/six-months-ago-today-the-dawkins-challenge/","cat":"challenge","id":"comment-17055","author":"Louis","site":"shroudstory"},{"title":"Six Months Ago Today: The Dawkins Challenge","post":"Following on from Louis’ comment above I spent an evening’s surface on Dawkins / Rowan Williams, including the most recent postings.  The closest I came to discovering Dawkins’ being prepared to admit the possibility of God’s existence, was that on an atheist scale of 1 to 7, he rated himself as a 6.9.  That’s a pretty small religious window, and merely looks like self-protection from being accused of being close-minded.. \nA particularly interesting insight on the present philosophy of Humanism was provided in a long article by Michael Ruse, “High priests, holy writ and excommunications – how did Humanism end up acting like a religion?” check http://www.aeonmagazine.com/world-views/michael-ruse-humanism-religion/ \nThis was published as recently as October 1.  Nevertheless it elicited a veritable battery of adverse comments from dedicated atheists, humanists, rationalists, and that general ilk.  There is clearly now apparent a fanatical atheism abroad, particularly among scientists.  With that kind of thinking abroad, what is the hope of ever evangelising scientific thinkers?  Or will Religion now become dumbed down, with a sole target audience of children and the illiterate?\n\n","date":"October 3, 2012 at 3:47 pm","url":"https://shroudstory.com/2012/09/29/six-months-ago-today-the-dawkins-challenge/","cat":"challenge","id":"comment-17196","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Six Months Ago Today: The Dawkins Challenge","post":"Yes, David correctly draws attention to the atheist scale. It is indeed a small religious window, but it could also be a signal that he is changing his mind,slowly, and this is no surprise because if you look closer he still has a bit of the Anglican in him.\n\n","date":"October 3, 2012 at 7:26 pm","url":"https://shroudstory.com/2012/09/29/six-months-ago-today-the-dawkins-challenge/","cat":"challenge","id":"comment-17199","author":"Louis","site":"shroudstory"}]
