[{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"Pregunta para colinsberry, experto en Industria Alimentaria:\n¿ Inhiben las cifras altas de ácido láctico la producción de vapores de amoniaco y de aminas aromáticas (cadaverina y putrescina)?.\nGracias por la respuesta.\nCarlos Otal.\n\n","date":"May 20, 2012 at 8:41 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11464","author":"corneliotel","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"Bing Translation: Question for colinsberry, expert in food industry:Do they inhibit the high figures of lactic acid production of vapours of ammonia and aromatic amines (cadaverine and putrescine)?.Thanks for the reply.\n\n","date":"May 20, 2012 at 9:19 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11465","author":"Dan","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"+ a.lactico——- INHIBIT———vapor amoniaco, cadaverina, putrescina, etc etc\n(Gracias Dan)\n\n","date":"May 20, 2012 at 9:32 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11466","author":"corneliotel","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"Sorry, I have no Spanish, except non comprendo, and the translation makes no sense to me. I’m also a chemical/biochemical generalist, not an expert. But I do know that lactic acidosis has been suggested to play a role in some theories for chemical imprinting mechanism, although it’s worth bearing in mind that at least in life, compensation mechanisms (e.g. hyperventilation) prevent the blood pH dropping too low (6.8 being reckoned to be the minimum that is compatible with life). Is the suggestion that increased lactic acid would prevent the release of gaseous amines, either by simple acid-base salt formation, or by inhibiting the enzymes that cause putrefaction of amino acids to ammonia and/or organic amines?\nI personally set no store by any of these ideas that rely on gaseous amines, least of all putrefaction products from a recently-deceased corpse. I’m not aware of any evidence that image areas on the Shroud are enriched in nitrogen. There are also objections on so many scores. Gaseous diffusion v laminar flow is one of them – the latter needing an unrealistically high temperature to create a powerful updraught needed to mitigate lateral diffusion/blurred image. There is also the small matter of hair. The latter is non-putrefying protein (keratin) so why should it be imaged?\n\n","date":"May 20, 2012 at 10:10 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11467","author":"colinsberry","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"I wanted to thank daveb for his extended discussion about consensus in expanding my own observation.\n\n","date":"May 20, 2012 at 2:38 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11469","author":"Andy Weiss","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"I find Colin’s comments in his last paragraph above quite fascinating and could well be significant: no nitrogen enrichment; problem of gas flows; sharpness of the image; question of the hair.  To me it seems to raise serious questions about the Maillard reaction hypothesis,  Shroudies may need to look elsewhere for a natural explanation of the image.\nI personally find a 2010 paper.by Giovanna de Liso of considerable interest: “Shroud-like experimental image formation during seismic activity” Giovann de Liso, [Shroud Conference, ENEA Frascati, Italy, 4-6 May 2010].  Sorry, I don’t seem to have logged the URL, but it should be reasonably easy to find.  De Liso conducted a series of experiments over a period of 12 years in her seismic area of West Piedmont, and seems to have produced some quite sharp images.  She mentions release of radon during earthquakes, association with rock types particularly gneiss, and influence of ferro-magnetism.  She does not seem to speculate on what the image formation process might be.  The paper has a strong experimental basis, and seems thorough and scientific, which could appeal to Colin.  All the gospels mention an earthquake after the crucifixion, and this could well be more than just a dramatic literary device.\n\n","date":"May 20, 2012 at 4:43 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11471","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"Daveb, have you at least read the book and all the other writings of Rogers before throwing out his hypothesis to the garbage so easily like you just did here ???  You really think that an expert like Rogers never thought about the things that are put forward by Collinsberry ?  You seriously believe that this guy know better chemistry related to any Maillard reactions than an chemist expert like Rogers ?  You seriously believe that ?  Wow.  When I read this kind of comment, it’s like people think that Rogers was a perfect idiot and a total incompetent !  INCREDIBLE !!!\nI know you love the hypothesis concerning the heartquakes but please, don’t throw the hypothesis of Rogers so easily to the garbage.  That would be a real crime against good science !  Understand that, by saying that, I don’t claim that Rogers hypothesis is surely correct, but I say that it’s not the Collinsberry of this world who will be able, without any credible scientific proofs, to throw down an hypothesis like the one proposed by Rogers.  The fact is that more laboratory experiments need to be done to really verify every aspect of Rogers hypothesis.  Remember that he died well before having been able to fully test his hypothesis, but even then, he was able to obtain some very interesting results (see the photo on page 104 of his book.  It is a colored sample he obtain with a Maillard reaction that really look like the coloration we see on the Shroud).  Also, we have to consider the possibility that the Maillard reaction he proposed can just be PART of the solution and that other process could also have been active in order to complete the image formation process…  We have to left open every door that CANNOT COMPLETELY BE DISCARD because of a lack of laboratory verifications.  On the same basis, we have to left the door open also for other “natural” hypothesis (like the hypothesis concerning the heartquakes) that still needs more laboratory verifications.\n\n","date":"May 20, 2012 at 7:27 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11476","author":"Yannick Clément","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"As I said, I do not claim to be an expert in any one area of chemistry, since I am a biochemist by training. That’s what I used to tell the Biochemical Journal when they kept sending me highly chemical treatises on bilirubin chemistry to referee, but I did once get a personal letter of thanks from the Editor when I said that two very long papers submitted together from a particular Belgian group could be shortened and published as just one. He said he recognized the time and care that had been taken in evaluating the papers’ claims. I do wonder sometimes if Yannick understands the narure of scientific research, one in which most find themselves having to operate outside the narrow confines of their particular speciality, and that applies as much to the late Raymond Rogers as to the rest of us. Prior to getting interested in the Shroud, he was best known for what he published in the field of thermochemistry. I don’t know a lot about thermochemistry, but I have made published contributions in bilrirubin photochemistry, in membrane-bound enzymes and especially in resistant starch and dietary fibre, so i am not sure why Yannick should consider one speciality, one background to be so obviously superior to the other. \nIrrespective, wearing my  referee’s hat, the one I was called upon to wear a few score times, and all done absolutely free of charge  (referees are not paid for their services), here’s the kind of report I might have filed on that paper which appeared in “Melanoidins” that began with quoting Pliny and 2000 year old linen techniques:\n“1 So Pliny described how linen was manufactured, using starch and Saponaria as processing aids. What good evidence is there that the Shroud has starch and Saponaria?  For starch, all I see in this paper is a red colour with iodine/azide used to test for something completely different (sulphur proteins). Why did you not use the standard iodine reagent without the azide?  And why is there no evidence that the cloth has been treated with Saponaria? What is the evidence that it dates back to the Pliny era – scientific evidence that is?\n2.Why the need for starch anyway in this Maillard reaction. Starch is not a reducing sugar unless broken down to glucose, maltose etc?  Ah, I see you have switched from using starch in your model study to “dextrins” i.e. partly broken down starch”? Is that a way to get reducing sugar into the Shroud under the cloak of starch?  If so, that is not terribly scientific, is it, or even transparent?  scientific. And why the need for “Saponaria” in your model. Is it because the Saponaria has pentosan sugars, some of which might just  tbe able to break free from the rest of the polymer, and may then provide more of that “reducing  sugar” that is needed in your model.  Or iare you saying that the combination of starch and a natural soap  helps to release those reducing sugars?   Sorry, but since your model depends crucially on having some reducing sugars you must be chemically precise if you want it to have any relevance to the Shroud.\n3.Now about the other component you need for your Maillard reaction – organic amines. What evidence is there that the image areas of the Shroud have more nitrogen than non-image areas? None? I see.  And I see you use ammonia as the source of amine in your model studies. Ammonia is much lighter and more rapidly diffusible than a much bigger molecule like cadaverine, putrescine etc. \nSo we have some model studies based on ingredients that we cannot be sure are on the Shroud, except perhaps some “starch” (which is not a reducing sugar) and we are asked to believe that the coming together of putrefaction amines – with no evidence they would ever be released in quantity from a recently deceased individual – with starch/hypothetical Saponaria (now conveniently transformed to reducing sugar) can produce all the image characteristics of the Shroud, right down to hair, moustache, beard etc, despite those being stable keratinaceous protein that would never release putrefaction amines.\n4.Sorry, but this journal is Melanoidins. Your paper makes no contribution to melanoidin chemistry. You have simply hypothesised that the Shroud image is the product of a Maillard reaction which then polymerises to a melanoidin, without providing any direct evidence, and your model studies use ingredients that are largely hypothetical as far as a particular piece of fabric in Turin  is concerned.\n5.If you can provide evidence that there is a melanoidin on the Shroud, with extra nitrogen in the image areas, with evidence for diamines as the precursors, with information of which specific reducing sugar(s) is involved, whether hexose or pentose etc, and better still some evidence for unreacted precursor molecules in the non-image areas then it may be possible for me to to recommend your paper for publication.\n\n","date":"May 21, 2012 at 2:17 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11484","author":"colinsberry","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"The paper: I mention above “Shroud-like experimental image formation during seismic activity” Giovann de Liso, [Shroud Conference, ENEA Frascati, Italy, 4-6 May 2010]. can be found at:\nhttp://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\n\n","date":"May 20, 2012 at 4:50 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11472","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"Yannick, I have no problems with your comments above at all.  I’m quite open-minded about whatever the process might have been;  At this stage we don’t know, we may never know, and I think it’s fair to look at all credible hypotheses.  Possibly unlike yourself, and speaking as a one-time hands-on civil engineer, I don’t happen to believe in the infallibility of any scientists, regardless of what their names might be, whether it’s Rogers, Berry or Isaac Newton.  I think Colin has made a fair comment in his second paragraph, and all possibilities should be considered. I think you’ve done very well, with your pursuing the issue of consensus on the surface of the fibres. LOL\n\n","date":"May 20, 2012 at 8:09 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11478","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"Every person who always questioned what Rogers said or wrote ever come with this fatal argument : he wasn’t God !  Of course he was not !  I never pretend he was.  I just want to defend his great contribution to Shroud science.  Unlike most of the Shroud researchers I know, Rogers was able to put his faith in his back pocket while doing his researches on the Shroud and, simply because of that, I have a tendency to trust him a bit more than some others supposed “experts” about the Shroud.  \nAnd here’s a good question for you : why always think that some persons that ARE NOT expert at all in chemistry (like Fanti, Collinsberry and many others) should know better a complex subject like the body image of the Shroud than a real expert like Rogers who was not only a true expert in chemistry and microscopy but also who was one of only few person to have been able to spend 5 days and nights with the Shroud ?  Give me one good reason why I should listen more to Fanti or Collinsberry than to Rogers ?  I just don’t see one good reason for doing so.\nI don’t have problem with people who want to emit some critics versus Rogers conclusions but please, can you bring us real peer-reviewed evidences that clearly show he was wrong ?  It’s so easy to claim he was wrong because someone think he was, but it’s another thing to really prove that he was wrong…  You surely understand what I mean.  And for the moment, I don’t think anyone has really succeed to prove that Rogers conclusions versus the Shroud were really wrong (even if many persons in the Shroud world dream about that every night !!!).\n\n","date":"May 20, 2012 at 8:25 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11479","author":"Yannick Clément","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"We’ve been thru this whole argument before, and Yannick seems to like rehashing the same arguments hoping people will ‘give-up’ and bend to his thinking. The problems with the Milliard reaction are simple and there are a few. EVEN ROGERS ADMITTED THIS IN HIS PAPER! What is wrong with some people that they do not realize this!!. The Milliard reaction even to this novice seems most improbable to the creation of the image, especially if one talks about the MINUTE details of the image in areas known to not have had ANY contact with the body. But the question is still open for further study…can we just leave it at that?\n\n","date":"May 21, 2012 at 11:18 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11495","author":"Ron","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"Ray Rogers would not have defended his hypothesis until his death if he didn’t thought that it was a very good hypothesis.  But I agree with you that even Rogers never claimed that his hypothesis, alone, seemed to be able to explain all and every single observations and facts we know about the Shroud.  Here’s what he said about that on page 110 of his book : “The requirements make it apparent that no single, simple hypothesis will be adequate to explain all of the observations made on the Shroud.  The impurity/Maillard hypothesis is proposed in an attempt to incorporate more observations into a single, complex hypothesis for image formation.  It is important to recognize that Maillard colors WILL FORM every time amines (note from me : that include ammoniac gas) and simple starches and/or sugars come together.”\n\n","date":"May 21, 2012 at 5:29 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11510","author":"Yannick Clément","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"One more thing :  It is important to note that there is some possibilities that the hypothesis of Rogers CAN be one part of a combination of chemical processes.  Rogers himself was fully aware of this possibility.\n\n","date":"May 21, 2012 at 5:33 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11511","author":"Yannick Clément","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"I am not going to buy into the argument of WHO is an authority!  I am more interested in the argument WHAT!  If ANYONE with reasonable competence in the field comes up with a coherent argument or objection, regardless of whether their names are Fanti or anyone else, then they should be heard, their arguments considered, and a proper judgment made, and their argument should not be dismissed out of hand, merely because one disagrees with their viewpoint now or in previous engagement.  If the DEVIL comes up with a coherent argument, then it can be evaluated, although one might question his motives.  Some may prefer to evaluate an argument on the basis of the reputation of who makes it, but I prefer to evaluate the argument on its own merits!  Because WE DON’T KNOW!!!!\n\n","date":"May 20, 2012 at 9:31 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11481","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"Any argument, to be really consider as valid scientifically should be back-up with some real scientific facts and observations DIRECTLY related to the subject.  I don’t see this going on with Collinsberry.  He may ask some good questions every now and then but that’s all.  I don’t think on that basis someone can think that the science of Rogers was off-track…  And repeat it again :  Do you really think for 2 seconds that Rogers never considered those “problematics” before writing down his hypothesis ?  Seriously, it’s a joke.  The guy was a top-notch in his field !\nI ask you a general question (forget the Shroud, that can be applied to any sector of activity) :  When you consider that someone show some clear signs of a conflict of interest, are you willing to trust this person as much as another one that you know for sure that had no real conflict of interest concerning the same subject ???\n\n","date":"May 20, 2012 at 9:47 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11482","author":"Yannick Clément","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"“you say tomato, I say tomahto”.\nThis is what happens when work is not fully cited…………………………\nEXCERPTS FROM http://holyshroudguild.org/drraes-problematic-threads.html\npassword protected\nDr. McCrone writes in “Judgement Day for the Turin Shroud” page 82 on Dec 26 1978, starting with 3-CB a heavy image area, blood from the lance wound using low magnification (10% +10% oli) I could see a heavy crustacean (of blood?) – too red”!  Page 84 on Feb 2 1979 he writes, “I have spent a lot of time looking at the tapes especially the red particles. There are a lot of them and they are definitely inorganic. hundreds of fiber are well-coated with these deep red particles. They are the same particles Pellicori and Evans show in their low power photomicrographs they say this is blood- I say it is an inorganic compound.  In our archives I have more notes written by Dr. McCrone which was not published. ” Dr. McCrone writes  on June 13th 1979, “Sample 3AF (finger image) shows the largest percentage of colored fibre examined it closely the fibers are un-uniform colored over lengths exceeding weave units hence the color is not a surface effect-possible mechanism includes heat or liquid treatment. There are in this sample and others a number of yellow amorphous tubular flaked like a material resin. ( I thought in the part they could be aloes or etc).”\nThe yellow amorphous tubular flaked like material resin was possibly also the same thing Dr. Nitowski saw and was convinced it was Myrrh and aloes just as Dr. McCrone first thought. Steven Schafersman is also correct when he states the madder root was first announced by Dr. McCrone.  This is also confirmed by Paul Maloney, President of ASSIST at a Talk given at the “The Shroud of Turin: Perspectives on a Multi-Faceted Enigma” conference in Columbus, Ohio on August 14-17th 2008, when he states, “Walter McCrone had sent him in 1981 several Kodak transparencies of photos he took of Shroud linen fibers. “On those slides, (Guild also has them) McCrone had written the following note: madder rose, linen fiber, medium (blue) sample 3 CB” 4 and sample 3-AB. McCrone was referring to photomicrographs made on STURP sticky tape samples 3-CB and 3-AB which came from the blood flow across the back nearest the side-strip side of the Shroud and directly adjacent to that flow on linen, itself. It was on that side where someone would have been working their repairs if the re-weave theory is held to be correct. McCrone, of course, due to his belief that the Shroud was painted by an artist, was trying to prove that the Shroud had been in an artist’s studio.” Source: Maloney, Paul C. “What Went Wrong With the Shroud’s Radiocarbon Date? Setting itall in Context.” Talk given at the “Shroud of Turin: Perspectives on a Multi-Faceted Enigma”conference in Columbus, Ohio on August 14-17th 2008.\nComments: Regarding the presence of madder rose on the cloth, Maloney says, “There is now a\nnew way of looking at the presence of that madder rose. Although this is some distance from the\n“Raes Corner” such trace amounts can now be conjectured to explain the dye that was used,\nalong with the aluminum mordant and the gum Arabic as a binder to create the wash to finish the\nre-weave. Thus, it may now be seen not as a contaminant from an artist’s studio, but rather a\ncontaminant from the weaver’s workshop.”\n\n","date":"May 21, 2012 at 11:06 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11494","author":"HSGppf","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"\nYannick Clément :One more thing : It is important to note that there is some possibilities that the hypothesis of Rogers CAN be one part of a combination of chemical processes. Rogers himself was fully aware of this possibility.\nI doubt it highly, read Rogers paper again (closely). Many of the things he states, he states in a hypothetical sense. I think he got to a certain point in his Milliard hypothesis and realized it was not viable. Especially in light of some speculation, yes I sad speculation. He just didn’t live long enough to alter his paper. Please don’t get me wrong, I liked the guy and fully respect much of what he did, and even think alot of what he wrote was well researched fact and truth, but I think, (my own thoughts here) if he had the chance to come back and make one more comment he would admit a Milliard reaction was not or could not be the engine which caused the image and he was man enough to admit it.\nR\n\n","date":"May 21, 2012 at 5:56 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11514","author":"Ron","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"Wow, that’s what I call “SUPER SPECULATION-EXTRAPOLATION-ASSUMPTION” !  I understand now why you like Ian Wilson hypotheses so much…  Incredible.\n\n","date":"May 21, 2012 at 6:38 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11519","author":"Yannick Clément","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"I like Wilson’s hypothesis because it makes sense. You can call it assumption all you like but if you could read HIS PAPER not HIS BOOK, and read it understanding HOW he states things and not so much what he states,  you would understand why I made that comment. Your incredible stubborness on the Milliard reaction amongst other things is getting tediuos and rediculous, believe what you will but please don’t fill this blog with numerous exceedingly long comments which normally only lead to your views on things….seriously.\nR\n\n","date":"May 21, 2012 at 11:34 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11528","author":"Ron","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"I didn’t know that there was a limit in the length of the comment we post here…  ;-)\nInstead of focusing on the length of my comments, I think you should focus more on what I say in those comment…  Sometimes, I think I can come up with some interesting ideas and reflections…\n\n","date":"May 22, 2012 at 10:40 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11542","author":"Yannick Clément","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"And Ron, here’s a comment from Rogers (taken from his book) that you should really take notice :  “The important point is that all of the reducing polysaccharides react rapidly with amines, including the decomposition amines from a body (note : that include ammoniac gas).  This is a very definite phenomenon : given a reducing saccharide and a decomposition amine, THEY WILL REACT.  THEY WILL PRODUCE A COLOR.  THIS IS NOT AN HYPOTHESIS, THIS IS A FACT.”  \nSo Ron, since science have proven that there really is deposits of starch fractions and pectin on the surface of the cloth, you have to imagine that the dead body that was inside the Shroud (we know for a fact that there was one) emit no amines at all (including ammoniac gas) in order to pretend that a Maillard reaction really had nothing to do with the body image we see on the Shroud !!!  I think someone need a very big faith in order to believe that !\n\n","date":"May 21, 2012 at 6:53 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11520","author":"Yannick Clément","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"If there was a Maillard reaction due to the release of gases from the body, then how does one explain no distortion of the image at any orifice locations? Which would in FACT be the first and foremost locations of gases. How do fumes from a body create an image  of such detail? Did fumes also eminate from the hair, the eyes the whole body so perfectly that it marked the cloth to the exact same depth thru-out? C’mon open your eyes the Vapour theory died long ago and even Rogers’ inability to to come to any real sense of a conclusion proves it. Go on wasting your  wasting your time with your fume (maillard) hypothesis.\nR\n\n","date":"May 21, 2012 at 11:47 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11529","author":"Ron","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"One last comment to Ron :  In one of the papers he wrote some years ago, even Fanti (who is far from being an advocate of Rogers) had no other choice than to admit that a Maillard reaction had certainly taken some part in the body image formation on the Shroud !!!  That speak very loud in my ears !!!  Don’t you ???\n\n","date":"May 21, 2012 at 7:19 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11522","author":"Yannick Clément","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"Oh, so now Fanti is not a crackpot when it suites your means? LOL.\nR\n\n","date":"May 21, 2012 at 11:50 pm","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11530","author":"Ron","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"I just thought it would interesting to emphasize the fact that even a pro-supernatural guy agree that it is almost impossible that there was no Maillard reaction at all during the image formation process.  That speak loud to me.  On the inverse, I’ve never seen Rogers pretend that any miraculous event ever took place in the Shroud !!!\n\n","date":"May 22, 2012 at 8:31 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-11540","author":"Yannick Clément","site":"shroudstory"},{"title":"The Valencia Dawkins Challenge:  No Consensus on Consensus","post":"The shroud image has no side images. If there was a maillard reaction it would have created a side image also.\n\n","date":"July 6, 2012 at 12:55 am","url":"https://shroudstory.com/2012/05/20/the-valencia-dawkins-challenge-no-consensus-on-consensus/","cat":"challenge","id":"comment-13524","author":"Bob smith","site":"shroudstory"}]
