[{"id":"comment-35412","author":"jesterof","post":"Max Patrick Hamon : Yes and no as most likely BOTH were subjected to the same image formation process with two different responses though: one positive as blood and the other negative as body. It is first and foremost the image left by a bloody corpse not just that of a blood image or just that a body image. OK, you got me all confused here. I understand that you may have some other valid points to add about the examination of the old archaeological blood vs dry stains of relatively fresh one. Please, do not be so defensive, I, personally, never equated the two, but it would be very interesting to find out some crucial points of difference – if you can name a few, please. I do not doubt your authority, I am really interested – it is easier for somebody familiar with the issue to put it concisely for others than for those uneducated “others” filter tons of irrelevant information on the web. At least that is the way I see those discussions. So back to the quoted message – Max, can you, please, elaborate a bit, what do you mean? that bllod over the body emitted some of it’s substances and together with some of the other forces ( just speculating) formed the image of the body? Because the blood stains are the result of direct contact with the body. Your remark about the lighter head part due to the Oviedo head scarf is very interesting. Would like to learn more as well – from you. Thanks in advance.","date":"2013-05-30","mins":"9:50 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35413","author":"jesterof","post":"Max Patrick Hamon : If the TS blood was lightly mordanted (reminder: mordanting is a blood intensifier), this could account for the blood still looking bright red in full daylight… That is all we talk about here – from different angles. I call it stabilizer/fixator/preservant, you call it mortantor – but essentially it is the same process for the result Can you tell us by what was it mordanted in your opinion?.","date":"2013-05-30","mins":"9:56 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35488","author":"jesterof","post":"Yannick Clément : Most important conclusion to draw from my personal experiment: It is still possible to produce a nice mirror imprint of a dry wound on a fabric, even more than 5 hours after the drying has been completed, as long as there is enough moistening at the surface of the wound. Note also that at least a weak pressure seemed to be necessary to get a nice mirror imprint of small wounds like a scourge wounds we see on the Shroud. Final note: the simple fact that there are halos of serum around almost every scourge wounds on the Shroud is enough to understand that Zugibe’s hypothesis is incorrect because if he was right, the oozing of post mortem blood that would have occcurred after the vigorous washing of the corpse would never have produced these sort of halos of serum that are easy to detect under UV fluorescence light. WHY? what does washing of the body has to do with the postmortem sipping of the bodily fluids from the wounds? Bodily fluids IS plasma practically speaking ( I mean interstitial fluid, mucous, sweat, tears, pleaural fluid, abdominal transsudate and so on) with specific additions and variations depending on the fluid. But they all can produce halos and fluorescence. Most certainly the fluid from the thoracic cavities was an interstitial fluid with some blood diluted in it – the crucified man is dying from lung edema and left ventricular failure, which is certainly depicted in the Gospels as well ( the soldier spearing the lungs and probably the pericardial sac as well).","date":"2013-05-31","mins":"2:07 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35487","author":"jesterof","post":"Max Patrick Hamon : YC, CAN YOU ASWER MY QUESTION PLEASE OR CAN’T YOU?” namely “could you account for potassium giving only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) giving strong signal?” Thanks, Max fot the answer. If the pt is alcalotic ( blood p H is higher than normal) than it is usually accompanied by hypokalemia as there is an exchanhe of H and K ions. However I am not sure the same process can be attributed to blood stains – in alive person hypokalemia is RELATIVE – the K concentration is lower in plasma as K is pushed into the cells, but if one lyses the cells the total amount of K is going to be balanced – because it will come back from the cells into the plasma ( together with all other ingredients of the cell). In a bloodstain yoiu have both cells and plasma components, so amount of potassium is unchanged( because it is a summary of plasma potassium and cell potassium). Please explain why do you make this conclusion – hypokalemia in the stain proves the alcalotic washout of the cloth. And what does hydroxiproline has to do with this? some amount of hydroxiproline is always present in the blood stream ( as a metabolyte of collgaen) it may increase upon certain conditions, but how is it related to the alcaline solution? Thanks..","date":"2013-05-31","mins":"1:57 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35511","author":"jesterof","post":"Yannick Clément : Adler had already an answer for this lack of potassium and it was because most of it would have been stayed inside the clot and have not been released in the exudates that have stained the cloth… that’s mot an answer. Plasma also has potassium level and it should be elevated in a patien with so many traumatic experiences ( because he’ll be acidotic, not alcalotic – p H of the blood would drop).","date":"2013-05-31","mins":"4:10 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35512","author":"jesterof","post":"Yannick Clément : Adler confirm that the bloodstains were made of exudates of blood clots like Barbet described. Not of an oozing of liquid post mortem blood like Zugibe described and that would have been a result of a vigourous washing that would have taken out the dried blood clots. Seriously, Zugibe’s hypothesis is totally incompatible with Adler’s findings. If Zugibe’s was right, Adler would have found traces of complete blood and not of exudates of blood clots. This is completelly different… And the halos of serum around the bloodstains have first been described by Barbet and come from the retraction of the blood clots as they dried. Dr. Lavoie showed that the kind of halo of serum on the Shroud most probably came from that kind of process and he find that he could obtain better results in a vertical position. Again, this is even more confirmation of Barbet’s hypothesis against the one proposed by Zugibe… Do you pretend that if the bloodstains would have been produced by an oozing of liquid post mortem blood as Zugibe proposed (at least for the scourge wounds), Adler would have find the very same kind of blood material he found in his samples and would have made an error by thinking that these bloodstains came from exudates of blood clots? This seem ridiculous to me. Again, I cannot believe that an oozing of liquid post mortem blood would have given the same kind of result Adler have found and described as coming from exudates of blood clots. Yannick, those two hypothesis do not have to contradict each other. I can’ ttell about the clots, but that there WOULD BE sippage postmortem from the wounds I can almost guarantee you. It is always present, especially with so many wounds – not everything will dry..","date":"2013-05-31","mins":"4:12 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35513","author":"jesterof","post":"Seriously, Zugibe’s hypothesis is totally incompatible with Adler’s findings. If Zugibe’s was right, Adler would have found traces of complete blood and not of exudates of blood clots. This is completelly different… Yannick, as a person who is very far from medicine and trauma you seem not to understand that serum from the retraction of the blood clots is going to be the same serum that is sipping from the wounds post mortem….it is NOT going to be whole blood sipping from the wounds post moretm, and from some of the wounds it was N Ot the whole blood before death as well WHY one HAS TO contradict the other is beyond me….","date":"2013-05-31","mins":"4:16 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35524","author":"jesterof","post":"Yannick Clément : But that’s not the conclusion of Adler who completely followed the idea of Barbet, and not Zugibe. That’s my point. Either you are paraphrasing it wrong or the conclusion is wrong..","date":"2013-05-31","mins":"5:53 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35526","author":"jesterof","post":"Yannick Clément : I understand that there is a separation of blood and serum in post mortem blood. I have read that somewhere… But nevertheless, the oozing of post mortem blood described by Zugibe is in liquid form and complete, which is, evidently, very different than exudates of humid blood clots. Adler was totally convinced from the results he obtained that Barbet’s hypothesis concerning the blood transfer was the correct one. Yannick, the nature of most of those wounds is such that they are not oozing whole blood in the alive state, and we are talking about post mortem. The scourge marks would not ooze whole blood, the side wound won’t ooze whole blood, the whole blood might have been oozing form the thorns wounds and crucifixion wounds – but others won’t. Yannick Clément : Also, don’t forget that the precise shape of the bloodstains on the Shroud is only compatible with exudates of humid blood clots and never with an oozing of fresh post mortem blood in liquid form the way it was described by Zugibe. That’s the most compelling evidence, among many other things I talked in my previous posts, that Barbet was right and not Zugibe… They might be talking about different sites. There are plenty of wounds and they are not all the same – so some might be oozing the blood, most will ooze the plasma, some will ooze the serum from clots. Unless they all described the same particular site with opposed theories I do not see them being conflicted at all.","date":"2013-05-31","mins":"5:59 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35631","author":"jesterof","post":"Discoloration is a very wide term. What do you actually mean? A halo like around the face, the face being of a different coloring than the other cloth? Darker or lighter? the Mandylion has the stains which coincide with the on on the Shroud ( the back of the head) as I recall. So if there is a discoloration around the face, does it mean that the Mandylion was not covering the face, just the Shroud ( as your hypothesis)?.","date":"2013-06-01","mins":"1:13 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35782","author":"jesterof","post":"Yannick here you go again. The whole point of my remarks ( not in hostile manner, btw, I do not expect everybody to grasp immediately on something I know professionally, or see it in a different light, because that’s why there is so much training ) were that your point of proving by quotes from one research that the other was wrong is a mistake because you do not take into account that that particular person was referring just to one aspect, not touching the other knowingly, because he is talking ONLY about something he addressed, and he knows the others also know that untouched matters are untouched because they did not address it. May I cal this approach of yours corpuscular, whereas it should be continuous? We already agreed on the issue of bilirubin/UV exposure and why the amount of bilirubin will be increased. I believe you on your experiment. I do not dispute Barbet or Adler or whoever. But I honestly can not understand WHY do you think the description of the halo from a plasma from a blood clot could would contradict the same plasma (as a description of fluid flawing from the side wound)? I already asked this question – when you are talking about the description of ht stains by Barbet/Adler and telling that those contradict what Zugibe is writing – are you talking about the same stains? or you think that Zugibe is wrong in his assumption of the body being washed, because then there won’t be any retracted clots left? But there could be – the body could have been washed not in a way you expect – to wash away all the clots, but it could have been just moistening them, not washing away. On the issue of washing/not washing I think one would benefit more listening not to “blood experts” but those who know the ancient Jewish burial customs and with taking into account that it was Friday evening. The approach to all the possibilities should be complex – and we might want to listen what Max tells us on this – because his approach might have the valuable touch to all the discussion. Though, honestly, I do not see contradiction where YOU see it..","date":"2013-06-02","mins":"6:40 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35796","author":"jesterof","post":"Yannick Clément : Quote: “But I honestly can not understand WHY do you think the description of the halo from a plasma from a blood clot could would contradict the same plasma (as a description of fluid flawing from the side wound)?” Answer: Because of the very precise shape of most of the bloodstains that cannot have been made with an oozing of liquid post mortem blood like it was described by Zugibe (this is particularly true concerning the very precise details not visible to the naked eye that Pellicori and Miller saw on their UV fluorescence photos of the scourge wounds). Adler and Barbet were very clear about the fact that these stains (not only the scourge marks but most of every other bloodstains as well) came from exudates of humid blood clots, which is totally different than bloodstains made of liquid blood. Yannick !!! do you understand the question? “WHY do you think the description of the halo from a plasma from a blood clot could would contradict the same plasma (as a description of fluid flawing from the side wound)?” WHERE do I say about the blood? You do not understand the difference, don’t you?.","date":"2013-06-02","mins":"7:32 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35797","author":"jesterof","post":"Yannick Clément : Quote: “when you are talking about the description of ht stains by Barbet/Adler and telling that those contradict what Zugibe is writing – are you talking about the same stains?” Answer: Of course I am talking about the very same stains, which are the scourge marks. Zugibe thought that they were caused by an oozing of liquid post mortem blood after the removal of the dried clots by a vigorous washing while Barbet (and also Adler) conclude that these stains were made of exudates of blood clots that were still humid enough (Adler) or that became re moistened thanks to the release of water vapor by the corpse (Barbet), so they could leave the kind of precise mirror imprints of themselves on the cloth. Both hypotheses are incompatible. It’s one or the other… We cannot hold both together, sorry. One must be wrong here: Zugibe or the Barbet Adler tandem. Quote: “But there could be – the body could have been washed not in a way you expect – to wash away all the clots, but it could have been just moistening them, not washing away.” No, you clearly are NOT. The side wound was mostly pleural fluid and not whole blood – there hardly would be any clots..","date":"2013-06-02","mins":"7:34 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35798","author":"jesterof","post":"Yannick Clément : Quote: “But there could be – the body could have been washed not in a way you expect – to wash away all the clots, but it could have been just moistening them, not washing away.” Answer: This idea sound very irrealistic to me for many reasons. The main argument against that is the fact that there is absolutely no smudge of blood that would have been caused by an oozing of post mortem blood in liquid form, particularly in the region of the back, which would certainly have happened if only a few clots would have been removed thanks to the washing (which, in my mind, would have certainly happened in a few places, even if the washing would have been done very mildly). Also, the simple fact that dirt have been found in the region of the heels and knees is another strong argument agains the idea of a washing (whether it be a gentle or a vigorous washing). Effectively, I don’t see the Jews of Jesus time (who were very meticulous normally) leaving evident traces of dirt on very exposed body parts like the knees… Finally, if the Shroud is the genuine shroud of Jesus, the idea of a washing has to be seen in contradiction with the Gospel accounts of an hasty and incomplete burial because of the arrival of the Sabbath and Passover feast. Along with these strong arguments, I’m sure that if I think about it for some time, I will come up with some more arguments… But the 3 I just bring you are solid enough to understand that a gentle washing of the body is unlikely… I GIVE UP : ) you do not understand what I am asking and keep repeating the same nonsense – I have never ever even talked about the WHOLE BLOOD oozing or not. My whole point that the wounds I am referring to could not have been whole blood at all.","date":"2013-06-02","mins":"7:37 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35812","author":"jesterof","post":"Yannick Clément : I have to say that the formulation of your question is not easy to understand for a French speaking quebecer like me. Can you ask it again in more clear terms please? I thought you were pretending that there was no différences between an halo of serum caused by the clot retraction process of blood clotting and an halo of serum caused by an oozing of post mortem bleeding. In the case of the Shroud, Adler and Barbet were precise about the fact that the halo of serum (which were first described by Barbet and later confirmed by Miller and Pellicori as also by Adler) were caused by the phenomenon known as clot retraction when the clot is in his drying phase on the skin. I have a hard time to believe an oozing of post mortem blood that would be surrounded by some serum would cause the same kind of bloodstains we see on the Shroud that are surrounded by very nice serum halos. If we believe Barbet and Adler’s conclusions, this kind of serum halo cannot come from anything else than exudates of humid blood clots. And for Barbet, even the big blood flow under the side wound was caused by exudates of a very recent blood clot that was still very humid (because it never got time to dry completely before the body was placed inside the Shroud). My formulation is as clear as possible in this situation – English is not my first language as well, though it is my professional language the point is you are stubbornly talking about whole blood where there won’t be whole blood, mostly plasma.","date":"2013-06-02","mins":"8:12 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35816","author":"jesterof","post":"Yannick Clément : Zugibe DID thought that the scourge wounds were caused by an oozing of fresh post mortem blood and this is in total contradiction with Barbet and Adler’s conclusion. I don’t pretend you had the same idea than Zugibe. I just pretend that Zugibe thought the scourge wounds to have been caused by an oozing of liquid blood and I and Adler and Barbet, we all disagree with him. That’s all I say. Forensic pathology course is long behind me but I do not see BOTH can’t be present as a result of scourging wounds – the one which had whole blood bleeding ( ripped skin) will have the barbet clots, the ones which had abrasions of epidermis over subepidermal hematomas will weep the unclotted blood from hematoma.","date":"2013-06-02","mins":"8:24 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35817","author":"jesterof","post":"Error : do not see WHY BOTH can’t be present.","date":"2013-06-02","mins":"8:25 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35873","author":"jesterof","post":"Yannick Clément : Where do you see on the Shroud imprints of blood wounds coming from the second kind of injury you described (the hematomas)? All that Barbet saw in the scourge wounds was contused injuries that produced enough bleeding at the surface of the skin to left a Mirror imprint on the cloth (pretty much like the wound of my own experience). Contised injuries produce hematomas mostly not an whole blood bleeding.","date":"2013-06-03","mins":"8:43 am","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35907","author":"jesterof","post":"Yannick you may THINK that those are the exact type of woubnds or you may not think they are but you do not have any idea what are you talking about, no offense – but this is obvious by you not even understanding where do you get it wrong. A blog design is not the best for lectures in phorensics, sorry..","date":"2013-06-03","mins":"1:09 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35909","author":"jesterof","post":"Http://www.shroud.com/zugibe2.htm I have no reason not to agre with this in aprticular: “Forgetting all of the other wounds, no one would argue that the scourge wounds were made and clotting begun several hours prior to death. Many of the scourge wounds on the Shroud of Turin are extremely distinct corresponding to dumbbell shaped wounds. Even if the clots from these wounds satisfied the time and moisture criteria postulated by Lavoie’s group, the shape of the scourge wounds including the bloody areas around the wounds would be indistinct and extremely variable in size and shape depending on the depth of the wound, the angle of the wound, the amount of blood flow, the flow pattern and whether or not clothing was adherent to the wounds. Moreover, even if the dripping sweat of the crucified softened some of the dried blood in areas just outside these wounds, only indistinct and variable shaped impressions would result. ” But the pattern of the wounds is almost exactly the same – this will never happen if the wounds are inflicted and left alone with blood,m dust, plasma, sweat for a long time prior to death. “A forensic evaluation of the crucifixion reveals that every movement during the entire time the crucified was on the cross would have restarted bleeding in the hand and foot wounds. The body unquestionably would have been literally covered with blood because the heart pumps about 4500 gallons of blood through more than 60,000 miles of large and small blood vessels throughout the whole body each day. Instead of the very exact imprints of the wounds, the Shroud would instead bear large indistinct masses of blood over the entire image including the face, arms, hands, feet and trunk. Every practicing forensic pathologist knows that even tiny wounds may bleed profusely during heart activity and observes the end results of bleeding from wounds of practically every type on a daily basis” THIS: “It is also of importance to note that scourge markings were made many hours prior to removal from the cross so that encrusted clots would have formed in the wounds therefore making it difficult to understand how the scourge marks would have left such precise imprints.”.","date":"2013-06-03","mins":"1:28 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35924","author":"jesterof","post":"I have already told you that your scratching is NOT the same type of wounds inflicted on the Shroud Man, so they are useless in a sense. I do not doubt you can transfer a wound imprint to a cloth from a clot – that is not the point a t all. The point is your experiment does not prove your thesis – that it is exactly like the scourge wound on th Man of the Shround. Not to mention that it is a SINGLE woubnf on a clean skin in an air conditioned XXI century environment, not multibple differnet wounds under the scorching sun and with additional tortures involevs. I can’t help that you simply do not understand why the differnece in the wounds IS important, as is important the number of those and additional factors. If the person states “it looks like a scourge wound” but it is a scratch wound one can’t take it seriously, becasue it is a proof that you do not understand all the confounding factors. P.s. You are such a prolific writer that I will just answer your last coment.","date":"2013-06-03","mins":"2:37 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35925","author":"jesterof","post":"“Zugibe was wrong about the idea that ancient blood clots that have dried for several hours cannot left a mirror bloody imprint on a cloth.” Zugibe NEVER stated that at all. It seems to me that you do not understand what his point was as well..","date":"2013-06-03","mins":"2:40 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35983","author":"jesterof","post":"Read his articles on the site shroud.com. Or refresh them, if you read before. Maybe you will realize that his theory is right and it does not conflict with Barbet’s mechanism of transferring the imprints..","date":"2013-06-03","mins":"9:01 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35984","author":"jesterof","post":"One more remark – stop referring YOUR ideas( or your understanding of somebody’s else ideas) as Zugibe’s, Barbet’s or anybody else. I have not had time to check precisely on Barbet – but whatever you attribute to Zugibe ( “vigorous” washing, etc) is clearly your own fantasies. I’ve head some time to read his articles on blood today..","date":"2013-06-03","mins":"9:05 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36179","author":"jesterof","post":"Louis :Dr. Zugibe also attributed the Jospice imprint to bilirubin. Well, common sense tells me that if bilirubin can so easily be the cause of well defined images, with photographic qualities, the we should see this phenomenon everyday. It does not prove or disprove anything. He is a forensic medical examiner, not a ghost chaser : ) And him being wrong on Jospice does not change the issue that Yannick does not understand what he is reading and makes conclusions which has nothing to do with the conclusions of the article authors themselves.","date":"2013-06-05","mins":"10:24 am","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36196","author":"jesterof","post":"Louis :Jesterof, You have gone off the point, the discussion is about bilirubin and imprint/image formation, not about ghosts. It is Spiritualism, not Parapsychology, recognised by the UN, that is interested in ghosts. Regarding the rest, it is YC who has a point and what he says is also in keeping with NT accounts,given the little time that was available between the removal of the body on the cross and burial, and, between Dr.Zugibe and these NT accounts, I am inclined to agree with the latter. We were not discussing the test. We were discussing the blood stains and the views of the two researchers on the method of forming them. Upon checking the articles of one of them turns out the interpretation by Yannick which he has been so prolificly posting is totally his own interpretation, not what the author writes. Whatever one or the other author is telling about anything else, including the bilirubin Jospise omrints is irrelevant – one might be right on one issue and wrong on the other. Especially if the “other issue” is not from his area of expertise.","date":"2013-06-05","mins":"12:23 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36197","author":"jesterof","post":"Addition – nowhere in his articles ( on blood) does Zugibe implies about “vigorpus wahsing of the body” – this is a complete confabulation on Yannick’s part as is his confabulation on the part of ” sipping postmortem blood” – in the article I’ve provided, which discusses the issue of the blood imprints and why Zugibe thimks the body was rinsed or washed, though not vigorously )))), and he is right, btw – the uniformity of the imprints could and would not happen if any additional contamination of the surface of the skin, including blood, won’t be removed – one can not get the exact same imprints becasue the sweat, dirt, blood, lymph will mess up everything. If skin surface is somewhat cleaned the blood/plasma clots in the indentitions of the skin formed by flagrum will reamin and leave the similar imrints on the cloth. But the latter can’t be achieved with all other contamination..","date":"2013-06-05","mins":"12:32 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36199","author":"jesterof","post":"Yannick Clément :[Edited] [C]an you please answer this simple question that I ask you again and again and again and that you always seem to avoid: How in the world can you obtain very precise mirror image imprints of dumbbell shape wounds on a linen cloth made with an herringbone weave if these wounds are oozing fresh post mortem blood in liquid form, especially in the back region where there was certainly a high pressure caused by the body weight and how in the world can you avoid to produce smudges of blood (again, especially in the back region) in such a context? I did and even provided the quotes for explanation. I can’t answer your own fantasies, though. You do not listen to what is being said, you repeat your own conclusions – the issue on “vigorous washing” is just one example. You might be passionate about the issue but there is no need to be passionate – it serves you better when you try to think about and read what is written without preconcieved views.There is no feud between Barbet and Zugibe on the clots ( there is on method of crucifixion, but not on this one). Zugibe does not dispute the method of transfer of the clots to the cloth – the clots in the skin indentitions formed by fllagrum. But in order for those imprints to look so alike as they are – the skin surrounding those indentitions with clots should be relatively clean – otherwise the imprints will never be the same. And that is the ,main point of Zugibe’s article ( his photographs prove that as well).","date":"2013-06-05","mins":"12:43 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36215","author":"jesterof","post":"Louis : Jesterof,OK, you got the point now when you say that “one might be right in one issue and wrong in the other”. It is exactly what had been written on the Jospice imprint that I was contesting. Being a physician, you are in a better position to argue about the body washing, but my suggestion is that you read Barbet first so that you get a more complete picture of what has been published in books so far. Best. I do not need to read Barbet in order to contest Yannick’s distortion what Zugibe said.I do not dispute Barbet’s conclusions and neither does Zugibe ( on the blood imprints of the Shroud left by scourge marks). He did not deny the transfer possibility Barbet described, he never wrote about “oozing of postmortem blood” and his conclusion about the possibility of the body being washed exactly because the flagrum imprints are almost exactly the same is correct. And he never described the body washing as “vigorous” Everything else is is beyond this particular discussion – I do not intend to cover all the points of difference – one a t atime.","date":"2013-06-05","mins":"3:24 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36216","author":"jesterof","post":"Yannick Clément : I don’t think you read the paper of Zugibe with the same eyes than me! Look at the example of transfer he provide us in his paper. The oozing of blood is in liquid form! The washing (by the way I already said that the term “vigorous” was from me to avoid people could think of a simple rising without any wash) proposed by him would REMOVE THE DRY CLOT COMPLETELY and produce an oozing of LIQUID BLOOD. How can you get an oozing of something else than liquid blood if you remove the dry clot of the wound? It’s evident you will get an oozing of LIQUID BLOOD. And Barbet was categorical about that: Except in the region of the feet, there is no bloodstains on the Shroud that were made by a transfer of liquid blood. It’s not me who talk, it is Barbet. This kind of liquid blood transfer proposed by Zugibe would never produce precise dumbbell shape mirror images of scourge wounds, especially in the back region because of the body weight pressure. Jesterof, can you, for once, address that issue of the body weight pressure that would without any doubt have produced many smudges of blood and imprecise bloodstains if Zugibe was right about an oozing of liquid post mortem blood following a washing (forget « vigorous » if you want) of the body just before it was placed inside the cloth? I never read anything from you concerning this important argument of mine… I suggest you read the article again. If you have any questions on the areas which you do not understand – you are welcome to ask. Zugibe DID NOT CONTEST Barbet’s theory of transfer of the scourge marks at all ( at least not in the article provided, and I did not find other articles on these particular imprints) and did not write about “oozing of the liquid blood” – read the article AGAIN and try to comprehend what is written there. He did not even touch it. His postulate ( which is correct) is only about the possibility of the body being washed – and the marks being almost exactly the same is the proof of hist postulate..","date":"2013-06-05","mins":"3:30 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36217","author":"jesterof","post":"2 Yannick To make your refreshing easier I will ct&paste the exact paragraph from Zugibe’s article about the scourge marks so everybody can see that there is no “oozing of liquid postmortem blood” tat all the same as there is no “vigorous washing” : “The Scourge Wounds If the deceased individual had not been washed, these well defined wound patterns depicted on the Shroud could not be present. First of all, most of the blood within the scourge wounds of the victim would have been clotted and the blood located both at the periphery and outside of the wounds would have dried long before the victim was placed on the cross. According to the experiments of Lavoie et al., a cloth would have to be placed on a moist clot no later than 2 ½ hours after bleeding stopped ( 5 ). In addition, these authors indicate that moistened clots have to be transferred within an hour for a good mirror image transfer to take place. Forgetting all of the other wounds, no one would argue that the scourge wounds were made and clotting begun several hours prior to death. Moreover, most forensic experts agree that the Man of the Shroud shows evidence of rigor mortis because of the bent knees and absence of a neck, therefore indicating that the crucified was dead for some time before being taken down from the cross. Thus, according to the studies of Lavoie’s group, these perfectly defined wounds should not have transferred at all. Yet many of the scourge wounds on the Shroud of Turin are extremely distinct corresponding to dumbbell shaped wounds. Even if the clots from these wounds satisfied the time and moisture criteria postulated by Lavoie’s group, the shape of the scourge wounds including the bloody areas around the wounds would be indistinct and extremely variable in size and shape depending on the depth of the wound, the angle of the wound, the amount of blood flow, the flow pattern and whether or not clothing was adherent to the wounds. Moreover, even if the dripping sweat of the crucified softened some of the dried blood in areas just outside these wounds, only indistinct and variable shaped impressions would result. However, if the body was washed, the dried blood around the wounds would be removed causing an oozing of bloody material within the wounds resulting in the production of relatively good impressions of the wound. In order to test this hypothesis, pieces of linen and paper towels were gently touched (not pressed) against wounds from accident victims who lived for several hours following the accident. Relatively no impressions were made. This was repeated after the wounds were rinsed with water and allowed to soak on the wounds for several minutes. Only indistinct bloody impressions were made. The wounds were then washed and this procedure tried again. This resulted in reasonably good impressions of the wounds ( Fig. 1 ). “.","date":"2013-06-05","mins":"3:38 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36222","author":"jesterof","post":"And since when BLOODY MATERIAL is a liquid post mortem blood? bloody material can be moistened blood clot inside the wound. Learn the terms first..","date":"2013-06-05","mins":"4:26 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36223","author":"jesterof","post":"Bloody material is what it is – bloody material, which incorporate anything bloody, clots included..","date":"2013-06-05","mins":"4:30 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36225","author":"jesterof","post":"Yannick Clément : Or do you think the oozing described by Zugibe would have had enough time to clot (but not to dry completelly) before the body would have been placed inside the Shroud? If this is what you think (honestly, I can’t see anything else), then I’m affraid you’re wrong. Why the Jews who did the burial in haste (if it’s really Jesus) would have lose time (maybe 15 to 30 minutes) before placing the body inside the Shroud after his washing? This is highly speculative (even magical thinking) which doesn’t fit right in the context of an hasty burial, don’t you think? If a ritual washing occurred, no doubt that they would have placed the body inside the cloth right after and, in such a context, the oozing described by Zugibe would have been one in liquid that would have produced indistinct bloodstains with a number of evident smudge, especially in the back region because of the weight of the body… I’ll wait for your explanation. Explain to me what you really think in precise details. No, I think exactly in the same way as Zugibe described – the blood, sweat, dust outside the wounds was washed out and only the hematomas, or clots, or both inside the wounds remained – therefore the shape of dumbbell is retained. Upon laying the body to the Shroud the pressure would cause the imprints to reflect the shape of the wound ( unlike the not that exact shape on the Zugibe’s figure). If the skin is not washed – there is no way one would have such exact shaped marks in a form of a blood stain appear on the cloth. No conflict with what Barbet wrote whatsoever..","date":"2013-06-05","mins":"4:42 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36226","author":"jesterof","post":"Yannick Clément : And can you prove to me that a washing of the dry clot will produce an oozing of a moistened blood clot everytime? It’s very hard for me to believe this… In Figure 1 of Zugibe’s paper, the oozing don’t appear to me as a “moistened blood clot” but as an oozing of liquid blood…. I do not have to prov you anything – I just proved for everybody interested that you have no idea what you are talking about – at all.","date":"2013-06-05","mins":"4:44 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36230","author":"jesterof","post":"Yannick Clément : Seems like it’s you mother fucker who don’t know what you’re talking about. I’m sick and tired of being called dumb by someone who look at non scientists like were dumb… If you do not want to be called dumb( and I did not, btw) – do not post dumb conclusions (with a pathos better reserved for other occasions) which have nothing to do with reality and learn the basics first. And some basic manners hove to loose with dignity – as well. Au re·voir : ).","date":"2013-06-05","mins":"4:55 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36229","author":"jesterof","post":"Yannick Clément : which Zugibe pretend is exactly how the scourge marks where formed on the Shroud, following a washing (vigorous enough to remove the dried clot – is it good enough for you now?) of the body. New confabulations? Zugibe is NOT pretending tha this is exactly the way how the scourge marks were formed he is showing the differnece of the imprint of the wound after washing the dried blood from the skin vs the inability to obtain an imprint when everything was dried If you do not comprehend what are you reading it is just a pity. Blood clot is not only the dried widely dispersed blood on a skin as well….","date":"2013-06-05","mins":"4:52 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35239","author":"jesterof","post":"It is your personal assimption. Barbet, as a surgeon, clearly has seen numerous dried and old blood stains. Not centuries old, obviously, but your statement about a surgeon seeing only fresh blood is wrong..","date":"2013-05-29","mins":"11:44 am","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35246","author":"jesterof","post":"Max Patrick Hamon : Ok, it was blood. However bilirubin just cannot in se account for the blood colour on the TS. There is something else (if ever there is bilirubin). Why not? If the color change is only upon UV exposure it IS bilirubin.","date":"2013-05-29","mins":"12:19 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35248","author":"jesterof","post":"Hugh Farey : Not bilirubin. Bilirubin isn’t red. It can’t make things “more red.” That is not the point. The color is not “more red” it is changing upon exposure to bright sunlight or UV exposure as clearly witnessed by Lagrand, it is standard old brownish without it. Bilirubin is uv sensitive. It was demonstrated in experiment by Italian group of researchers – can’t post a link ( writing from the phone) but it was provided by Louis in the other thread.","date":"2013-05-29","mins":"12:25 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35252","author":"jesterof","post":"Hugh Farey : Miller and Pellicori (Ultraviolet fluorescence photography of the Shroud of Turin, Journal of Biological Photography, 1981) say that the the blood does not fluoresce. UV exposure makes no difference to the colour of the blood. It isn’t bilirubin. It does not have to fluoresce. It changes color – not immediately, but after or after some time. It is one set of researchers against another ones : ).","date":"2013-05-29","mins":"12:40 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35259","author":"jesterof","post":"Max, why do you keep insisting it has to look orange? It is not pure bilirubin dried : ) Even the icterus of the skin differs from person to person as a subjective color perseption with the same amount of bilirubin in blood. The researchers who tested the color change of blood stains after irradiating it with UV light tested the blood wth only 2 4 times higher than normal levels of bilirubin, not 500.","date":"2013-05-29","mins":"1:10 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35256","author":"jesterof","post":"Louis : Jesterof, any fresh hands on examination of the relic does not seem possible now, so our hands should be crossed to see if the archdiocese of Turin will release the more than a thousand microphotographs in its possession. These will help a lot. Best. That sure will help as would some uniformity in terminology. However, the latter is not going to happen.","date":"2013-05-29","mins":"1:02 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35265","author":"jesterof","post":"Hugh Farey : Thanks for mentioning that, Jesterof. I’m not sure what paper Louis was referring to but http://www.ohioshroudconference.com/papers/p04.pdf describes an experiment involving blood with extra bilirubin added, which turned bright red after six hours of exposure to ultraviolet light. It is suggested that UV radiation turns bilirubin into lumirubin and isolumirubin, but these are both yellow. I should like to know what chemical change makes bilirubin bright red before I found this paper wholly convincing. Yes, that is tve one. Forgive me, but you are repeatedly making the same mistake – stating the color of singled out bilirubin as yellow or orange. But is not pure bilirubin which stained the cloth!!!! It is blood with higher than normal levels of bilirubin which stained it – we do not know how much of bilirubin was in the blood but even a modest increase will change the color of the blood after UV exposure. 2 Yannick – I answered in that thread.","date":"2013-05-29","mins":"1:28 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35299","author":"jesterof","post":"Max Patrick Hamon : Just in case Jesterof could miss my #49 rely: Jester, I do agree, it JUST CANNOT BE PURE BILIRUBIN DRIED (I already wrote there is something else if ever there was bilirubin!). Now you wrote it was BROWNISH without exposure to bright sunlight or UV exposure: “The color (…) is changing upon exposure to bright sunlight or UV exposure as clearly witnessed by Lagrand, it is STANDARD OLD BROWNISH WITHOUT IT.” The only snag is I saw it myself carmine mauve in situ cathedralis torinensis NOT just brownish! Would you be so kind as to you give me Legrand’s exact quote AND account for the carmine mauve colour, please? I wote it obviously as a conclusion form the facts described by the involved in direct observation of the Shroud themselves. I never saw the Shroud in vivo : )Did I understand you correctly, that you personally saw it? I do not have Legrand’s quote, I first read about the whole issue ( that it was Legrand who saw the Shroud in 1931 and then later and expressed surprise ) 3 days ago when I went by that ling which Louis posted. I have always wondered about that speculation of “too red” or “too bright” and thought it was from the STURP time( and myself was wondering why was it connected to bilirubin), but when I read there Legrand’s surprise it became obvious that if the color enhancement happened upon UV exposure, than bilirubin IS the answer, becasue it is the only probable component in the blood which is reactive to light ( probable as a result of the torture).","date":"2013-05-29","mins":"6:27 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35271","author":"jesterof","post":"This is blood not dye pallette. You are not adding something to brown – it waas already there when it was red. And you can not state it changes color to “bright red” – the description of the color varies and it is very subjective. What is bright for you might not be so bright for me. I do not dispute there might be something else – blood of a tortured person will have a lot more, than just bilirubin and hemoglobin. This is from the article, but it does not say if those were fresh stains or dried onesv – that would be interesting. From these decals we obtained three sets of samples with increasing concentration of bilirubin: one was maintained as it was, one was aged 10 hours in a stove at the temperature of 120°C, and one was exposed to ultraviolet radiation (365 nm) for 6 hours and kept under continuous observation. The visual examination of the two first sets of samples was not able to catch any colour change on the many different concentrations of bilirubin. The visual inspection was confirmed by a spectrographic examination. In the third set of sample the blood stains of all decals, after 6 hours of irradiation, took a bright red colour..","date":"2013-05-29","mins":"1:57 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35300","author":"jesterof","post":"Max Patrick Hamon : The something else could be an external heating source in se (in the course of a Judean ritual in the shape of fumigation/burning aromatic aloetic woods/myrrh, some CARBON MONOXIDE could have been liberated along with smoke). CO is not stable.","date":"2013-05-29","mins":"6:27 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35354","author":"jesterof","post":"Max Patrick Hamon :To Jesterof: The true fact is carbon monoxide (CO) in conjunction with a mordanting image formation process can also act as blood intensifier. If it does not as time passes. The image formation has nothing to do with amount of CO in the blood stains NOW or upon first viewing of the by modern scientists.. I know CO and it’s interactions with Hgb all too well. It’s affinity is thousands time stronger, but it does not stay there forever..","date":"2013-05-30","mins":"11:26 am","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35355","author":"jesterof","post":"If it doesn not DISSOCIATE from Hgb molecule – for some reason that part of the phrase was cut off.","date":"2013-05-30","mins":"11:26 am","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35356","author":"jesterof","post":"Max, as I recall the image color was never referred as unususlly bright, neither was it ever considered blood related Those are the stains which are brightening upon UV light exposure. CO IS a brightening fsctor, even in not high concentration ( empirically – 3 5% will be enough for the blood appear brighter).","date":"2013-05-30","mins":"11:31 am","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35380","author":"jesterof","post":"Max Patrick Hamon : Jesterof you wrote: “I never saw the Shroud in vivo : )Did I understand you correctly, that you personally saw it?”. Yes. I did see it twice (once I was even standing nearly two meters away from the relic). No, “in vivo”means “live”, in reality( as an opposite to “in vitro” which literally meant in the glass, but usually is referred to something viewed on a glass slide, in a glass jar, etc) It menas I never saw the Shroud except the photos and screen. Sorry for the confusion.","date":"2013-05-30","mins":"4:00 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35379","author":"jesterof","post":"Max Patrick Hamon : Reminder for Jesterof: Besides the blood being red in bright sunlight, the Turin Sroud body image, seen under a certain angle and light, is IRIDESCENT (as a translucent straw yellow impression). This observation is totally consistent with a light/pre mordanting image formation process (whether or not any carbon monoxide liberated along with fumigation smoke were trapped “there for ever” in the process). I have never touched the issue of the image. I have no idea how was it formed, but I do not think it is connected to the blood.","date":"2013-05-30","mins":"3:58 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-35382","author":"jesterof","post":"Max, so did you observe any kind of “carmine mauve brightness”? And did you know before you saw it already about the others perception of the color or you viewed it before anybody’s else description?.","date":"2013-05-30","mins":"4:04 pm","url":"https://shroudstory.com/2013/05/29/a-guest-posting-by-yannick-clment-two-quotes-about-the-blood/","cat":"blood_studies","title":"A Guest Posting by Yannick Clément: Two Quotes About the Blood"},{"id":"comment-36970","author":"jesterof","post":"2 Hugh Farey Lincoln could not have had Kleinfelter’s. Marfan’s – yes, there is a possibility for this.","date":"2013-06-14","mins":"12:56 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36969","author":"jesterof","post":"Scientists now believe Abe Lincoln also had Kleinfelter’s syndrome. No, Abe Lincoln could not have had Kleinfelter’s by a default. I suggest you read on a syndrome to figure out why. I have hinted on it in a post which you understood as me saying that Kleinfelter’s are usually short, whereas I actually said the diametrically opposite LOL There are other syndromes involving unusually tall stature. One of them is attributed to Lincoln.","date":"2013-06-14","mins":"12:52 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36972","author":"jesterof","post":"The DNA analysis of these targets, separate & distinct from those involving sex related genes, indicated that DNA from multiple individuals was present on the Shroud. Therefore, no conclusion can be made. That is the whole point – the DNA studies could not have proven anything.","date":"2013-06-14","mins":"1:04 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37036","author":"jesterof","post":"Angel : Yes, that was the Shroud study. DNA aside, Jesus had the symptoms associated with Kleinfelter’s. Long hands and thin fingers are associated with both Kleinfelter’s and Marfan’s, but enlarged breasts in the male is associated with Kleinfelter’s, and that defines the shroud Jesus. Did you look at the enlarged Shroud frontal image? Did you notice the male breasts? As well, there is a high risk for breast cancer in males with Kleinfelter’s, so these men must also have inherited the mutant BRCA1 or BRCA2 gene. Best, No, he DID NOT. And there are no male breasts on the Shroud..","date":"2013-06-14","mins":"9:55 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36494","author":"jesterof","post":"Hi, Angel, In one of the threads ( I do not remember which one) it was revealed that the color changes upon exposure to UV light – it brightens in a broad sunlight – which will approve the hypothesis of bilirubin being responsible for that, But I can not connect methemoglobin to any of possible pathological processes connected to the Passion. It is usually high in some metabolic disorders or upon poisoning with some substances. Why should it be high in the Man of the Shroud is difficult to understand..","date":"2013-06-08","mins":"9:59 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36977","author":"jesterof","post":"Colinsberry : jesterof : 2 colinsberry ( I am glad you lifted up your self imprisonment))) http://www.ncbi.nlm.nih.gov/pubmed/16556678 Never mind self imprisonment. I simply have a low threshold for pseudo science. According to your version of genetics (XX genotype) , what the Roman centurion should have said was “Truly this transvestite was the Daughter of God”. My version of genetics is approved by a case reported by geneticists. XX males with SRY gene are not that rare. The one without is is much more rare and is described in the link. But in order to realize this possibility if one does understand what is written there, which you obviously do not( surprise, surprise LOL ).","date":"2013-06-14","mins":"1:29 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36980","author":"jesterof","post":"My darling self proclaimed “scientist” who do not understand the basics of genetcis and who does not know how to hold his own word plus lacks the basics of masculine dignity – I am a board certified American physician..","date":"2013-06-14","mins":"1:40 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36978","author":"jesterof","post":"My version of genetics is approved by a case reported by geneticists. XX males with SRY gene are not that rare. The one without is is much more rare and is described in the link. But in order to realize this possibility one has to understand what is written there, which you obviously do not( surprise, surprise LOL ).","date":"2013-06-14","mins":"1:31 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36986","author":"jesterof","post":"Kelly Kearse : Such XX males described in the link (http://www.ncbi.nlm.nih.gov/pubmed/16556678) are diploid (46) Exactly how might this apply to the birth history of Jesus? Well, He did not have human father, according to Gospel’s, so His chromosomes are all maternal and since there is no source for the paternal gamete with an Y chromosome, one might expect a XX genothype be female only but He still is a male – and how this can happen is described in a link above. Not that I 100% seriously consider all of the above, but the material possibility of incarnation of the Divine has been genetically possible. Obviously, that is a speculation :).","date":"2013-06-14","mins":"2:13 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36983","author":"jesterof","post":"Colinsberry : May 21, 2013 I now know who “jesterof” is, thanks to a little carelessness on her part with choosing an email address. Yes, she is medically qualified, as stated earlier. All the more reason I would say for not indulging in amateur psychiatry on a public forum. I shall continue to regard her as a troll, and avoid this site, until I receive an apology and assurance she will desist in future from making troll like personal attacks. So, “Sherlock” how about holding your own word? Not a month passes and a weak wimp is jumping again LOL.","date":"2013-06-14","mins":"1:48 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36987","author":"jesterof","post":"Colinsberry : You are Fabri Oksana MD, with your initial medical training in the Ukraine. Back in the 80s. Http://ww2.doh.state.fl.us/irm00 Profiling/profile.asp?Lic Id=102020&Prof NBR=1501&External=TRUE I believe you currently hold a position in a Florida hospital as an anaesthetist (UK description). That does not make you an expert on all matters relating to physiology, biochemistry and genetics. What you “believe” is irrelevant here – the old record on the internet are what it is – old records. As anesthesiologist and a primary care doctor I am much more qualified to address the issue of potential psych deficiency clearly demonstrated by your approach to others than you are qualified to judge my knowledge of physiology or biochemistry, Obtain an American medical license first and then we can discuss your qualifications. But before it just learn how to hold your own word. Colonial Brits as an example of dignity deteriorated to pathetic pompous wimps LOL.","date":"2013-06-14","mins":"2:19 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36995","author":"jesterof","post":"A wimpish pseudo scientist unable to hold his word and without any trace of dignity engaged in constant bashing the dead recognized scientists is unable to realize that his own deficiencies are visible through the name calling of those who can not answer? A pompous loser who considers himself extremely qualified to judge others but relieves his own acrimony the moment his own weapon is directed at him thinks it is not obvious what it indicates? One does not need to hold a degree, just to know this type of vile mediocrity LOL.","date":"2013-06-14","mins":"3:18 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37003","author":"jesterof","post":"Kelly Kearse : Not that I 100% seriously consider all of the above, but the material possibility of incarnation of the Divine has been genetically possible. Obviously, that is a speculation :) The link above only describes how a diploid XX person, who is the offspring of two parents, can be a male. The material possibility of incarnation of the Divine being genetically possible, according to this scenario would involve doubling down on Mary’s haploid genome, with the additional step of a genetic change involving a gain or loss of function. That is true, the step of doubling still has to be demonstrated and the exact area which is responsible for the loss of function is still to be found ( as postulate by the authors) but the possibility of a XX male without SRY gene is more valid than XXY, or any Y involvement. As I’ve said, those are just half serious speculations..","date":"2013-06-14","mins":"5:23 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37002","author":"jesterof","post":"You are even more retarded than it looks from your rants.. One can have more than one last name if one is a woman. Besides publications have nothing to do with qualifications, but it is too much for a man who does not keep his word to understand. Keep searching honourless “sherlock”.","date":"2013-06-14","mins":"5:16 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37004","author":"jesterof","post":"Edit – the quote is obviously not yours, I have cut the wrong part..","date":"2013-06-14","mins":"5:24 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37008","author":"jesterof","post":"I think the main problem is trying to apply the laws of (known) science to one of the mysteries of faith. From a theological standpoint, Y involvement would be the most valid why would God’s Son be anything but a normal, healthy male? To me, this just makes sense. How does this happen with a virgin birth? From a scientific standpoint I don’t know. This would fall in the realm of the miraculous but that’s God’s territory. That’s where faith would come in. Maybe in heaven there’s a Dv D (available as a bundle together with the creation of the universe). I do not know if there is an answer to this question from a scientific point as well. Including the definitions of “normal healthy male” ( or female, for that matter) – with all the combinations of factors involved recently it has been not the 23d pair of chromosomes as a determinant only. But that is a broader question. It is one of those areas where materialistic explanation and it’s logic is short of answers – yet. But there should be an explanation, maybe we just do not know it..","date":"2013-06-14","mins":"6:15 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36571","author":"jesterof","post":"Angel, thank you to bringing that together. However, my point was – why on earth is he mentioning methemoglobin – this one particular hemoglobin can be found in blood only in a person with some specific diseases ( which by description from the Gospels Jesus Christ does not fit) or as a result of poisoning by some external substances. It is not a byproduct of any severe trauma, or hemolysis.Bilirubin and it’s origins is a totally different matter – and I have never disputed bilirubin at all ( I am a physician and I have worked in a Critical Care medicine a lot) That is why I find it strange that he also mentions methemoglobin and it is never discussed more by anybody.","date":"2013-06-09","mins":"5:17 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37009","author":"jesterof","post":"Louis : Even the Talmud talks about the messiah as a pre existent being and, to take this further, such a being only needed a womb for the incarnation of the Divine to take place. That is true, but if we are trying to prove the authenticity of the Shroud by applying earthly characteristics ( bilirubin, methemoglobin, AB( ) type of blood, types of pollen, specifics of ancient burial etc) than the question of genetic combinations arises as well – Angel’s assertion on Kleinfelter’s, is in this area and though it is pure speculation, obviously, but if we think ( as kelly proposes) that there should be a genotype of normal male (XY) her approach is a possibility as well. I am short of an answer – where would a Y( and the rest of 22 autosomal paternal chromosomes) come from :) Anybody has any suggestion?.","date":"2013-06-14","mins":"6:22 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37015","author":"jesterof","post":"Louis : Jesterof, such questions led a secular and intellectually honest Jew like Stephen Jay Gould to propose the NOMA. He was open minded and stated that he would be comfortable even discussing philosophy with Pope John Paul II, also a philosopher. The point is this: Gould was an agnostic and a good scientist and he also knew that something was missing, science could not explain everything. That placed him head and shoulders above Pinker, Harris, Dawkins and the lesser known atheists. I agree and I, personally, do not need any proofs, as I suppose does not need Kelly, Angel or yourself. But we all are engaged in semi scientific ( since we are speculating on the other people research and data) discussion and trying to prove as much as possible from an earthly point of view – in the frame of what we know. I have to admit, though, that the desire to have the materialistic scientific explanation of as much as possible (so the remaining conclusion of supernatural will be obvious) is partially driven by the desire to convince our agnostic counterparts :).","date":"2013-06-14","mins":"6:48 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37023","author":"jesterof","post":"Angel : jesterof, you may have misunderstood my post. I did not state varicies were in the nose. Varicies line the esophagus in patients that have liver damage (cirrhosis), but when these varicose veins rupture, the patient bleeds from the nose and the mouth. I’ve had to take a man to the ER with this condition, at least, four times and believe me there was massive bleeding from the nose. Blood was not only all over the bathroom floor, but on the walls as well. It is one of the most gruesome sights, with respect to blood, a person will ever encounter. Best, That is correct. But this is NOT a nose bleeding, so you can not try to prove that a person can bleed a half a liter from his nose ( as from nose trauma) by variceal bleeding which has a nose as an outlet, not a sourse for the blood. Variceal bleeding can be massive, because it is from the vessel structure and under pressure, plus there is a hypocoagulable state because of the liver insufficiency. Neither of these are present if the person has a nose trauma and bleeds from his nose due to trauma ( unless, of course the person has also a liver insufficiency with hypocoagulation or deficiency of some of the clotting factors, but neither of those is present in Jesus Christ case).","date":"2013-06-14","mins":"8:17 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37026","author":"jesterof","post":"Angel : The blood Ron Wyatt tested was blood from the crucifixion cross hole and that blood revealed a haploid (24 chromosomes), with the XXY trisomy. Years ago, when the blood from the Shroud was tested by Leoncio Valdes, a female researcher posted an article on the web that has since been removed. She stated Jesus had Down syndrome and mentioned a trisomy. This just gets better and better Now it is Down syndrome LOL Angel, do not tell me you have never seen people with Down syndrome. It is so rmarkable, that seen once even non medical person will distinguish it in the future. Neither of those features are present on the man of the Shroud. Not to mention the impossibility of somebody with clear physical abnormality ( and often cognitive impairment) would have any chance in those cruel times to gather crowds or have disciples – those were not politically correct times of the present ( even now people can be cruel towards visible physical impairments) The “blood from a crucifixion hole” clearly sounds like hunt for the Holy Grail to me. Do you really believe that? *** rolling eyes smiley*** Because I do not – I can believe only the studies related to the blood of the Sudarium, the Shroud or if anybody would conduct a DNA determination of any of the known pieces of the Eucharistic miracles..","date":"2013-06-14","mins":"9:01 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37031","author":"jesterof","post":"Angel : I just saw a paragraph attached to an article on Kleinfelter (Kleinfelter’s) where it was stated it would be interesting to test Lincoln for Kleinfelter’s, since he was tall and lanky. I also saw another link on Marfan’s, associated with Lincoln, but that wasn’t mentioned in the initial paragraph inclusion on the article I was reading. It’s Down syndrome, but is it Kleinfelter or Kleinfelter’s. I’ve seen it spelled both ways. Which of the two is correct? Best, Kleinfelters are infertile. Lincoln had children. Case closed.","date":"2013-06-14","mins":"9:37 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37029","author":"jesterof","post":"Angel : Secondly, If one had pleurisy and at the moment of death a sword was thrust into this person’s pleural cavity, fluid (water) would immediately seep out. Here is an excerpt of “Pericardial Effusion” the link below: He did not have pleurisy. He had pulmonary edema. Pericardial effusion has nothing to do with it. “Those who were flogged would often go into hypovolemic shock, a term that refers to low blood volume. In other words, the person would have lost so much blood he would go into shock. The results of this would be 1) The heart would race to pump blood that was not there. 2) The victim would collapse or faint due to low blood pressure. 3) The kidneys would shut down to preserve body fluids. 4) The person would experience extreme thirst as the body desired to replenish lost fluids. He did not loose much blood. He was in shock – but not because of the blood loss but becasue of pain, severe dehydration and rhabdomyolysis your results as 1,2,3, can cause a smile, because those are just bites of what is going on in a human body in the shock conditions. They are not incorrect, they are simply just some of. And one might be tachycardica and hypertensive prior to becoming bradycardic ad hypotensive – or another combination of parameters – depending on a time frame. Since Jesus did not loose blood massively adn severe dehydration does not egual severe hemorrhage, the last terminal stage of shock ( hypotension,bradycardia and death) would not develop in a 12 hour time frame. There is evidence from Scripture that Jesus experienced hypovolemic shock as a result of being flogged. No there is no such evidence becasue He did not have hypovolemic shock hwile carrying the croos to Gogotha – he was in a pain shock and was developing severe dehydration, but this was still not hypovolemic shock. He fell down not because of the hypotension ( if that would be the case, He would not get up) but because of lot of trauma after scourging and the heaviness of the cross – that was too much. Another indicator that Jesus suffered from hypovolemic shock was that He declared He was thirsty as He hung on the cross (John 19:28), indicating His body’s desire to replenish fluids. Which not a proof of hypovolemic SHOCK just a proof of hypovolemia as a result of dehydration. One does not have to be in shock and still be hypovolemic. As I stated above – if His fall would be from hypotension as a late stage of shock ( which is usually seen quickly only upon severe hemorrhage, not dehydration – that is more prolonged) He would not be able to get up and would have died there – o the road. Prior to death, the sustained rapid heartbeat caused by hypovolemic shock also causes fluid to gather in the sack around the heart and around the lungs. I can guarantee you He was having tachycardia from the agony in Gethsemane. And rapid heartbeat does not cause fluid to gather in the pericardium or around the lungs. Not even in a week time frame, and we are talking here hours – that is not enough time for pleural effusion or pericardial effusion to accumulate. This gathering of fluid in the membrane around the heart is called pericardial effusion, and the fluid gathering around the lungs is called pleural effusion. This explains why, after Jesus died and a Roman soldier thrust a spear through Jesus’ side (probably His right side, piercing both the lungs and the heart), blood and water came from His side just as John recorded in his Gospel (John 19:34). No it does not explain it – because there is no way enough fluid will accumulate in the pericardium or pleural space in less than 12 hours we have, unless the fluid is blood as a result of mechanical trauma ( which is not the case) Interstitial fluid from the lungs is a result of pulmonary edema which was one of the causes of death and which developed already after crucifixion – and pulmonary edema is a result of acute heart failure with literally flooding of the lungs with interstitial fluid The explanations for the blood and water flow are closely related at several points. All physicians who have examined the question agree that Jesus was already dead when the chest wound was inflicted. The blood and water most probably flowed from both the heart and the chest cavity. That is true, but blood is ALWAYS in the heart, which when pierced will give the flow of the blood and it is also always in the lungs – lungs are filled with blood, because they are the filter for it, so to say, so piercing of the lungs will cause blood flow as well – no need to additional accumulation of blood anywhere. Fluid is a result of the pulmonary edema, which was a process preceding death and basically the cause of such a rapid death.","date":"2013-06-14","mins":"9:31 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37033","author":"jesterof","post":"Angel, look at Down’s, because you clearly are oblivious that it is one of the most remarkable visible abnormalities : http://www.google.com/imgres?imgurl=&imgrefurl=http://www.dsrf.org/blog/dsrf blog/speech and language therapy for adults with down syndrome&h=0&w=0&sz=1&tbnid=fqo BC0dztsi PGM&tbnh=183&tbnw=275&prev=/search%3 Fq%3 Ddown%2 Bsyndrome%2 Bteen%26tbm%3 Disch%26tbo%3 Du&zoom=1&q=down+syndrome+teen&docid=QV Tt UIK0uw G Us M&hl=en here are the explanations for the distinct facial features ( none of which have anything to do with the features of the Man of the Shroud): http://sathiyam.tv/english/featured/march 21 world down syndrome.","date":"2013-06-14","mins":"9:45 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37035","author":"jesterof","post":"Angel : jesterof, I don’t care if Abe Lincoln has Kleinfelter/Kleinfelter’s or Down Syndrome. That was a remark by someone at the bottom of an article I was reading and it was in reference to Abe being tall and lanky. Males with Marfan’s syndrome are also tall and lanky and the connective tissue is weakened, which causes other problems. From what I’ve read there is a defect, with reference to the production of the protein fibrillin. Lincoln could not have had Marfan’s syndrome because his hands were not long and thin and he couldn’t have had Kleinfelter’s, because he didn’t have enlarged breasts. Now, Jesus was tall. Jesus’ arms and legs were longer than normal and His hands were long and thin. As well,Jesus had a long, narrow face, like Senator John Kerry and He had breasts, as is clearly seen on the Shroud frontal image. Therefore, excluding the chromosome count, Jesus’ symptons align more with Kleinfelter’s than Marfan’s. Best, I am sorry, but your reasoning just clearly indicated you neither know what Marfan or Down’s or Kleinfelter is about nor have any idea that there is variability of expression of the syndrome, therefore the statement Lincoln could not have had Marfan’s syndrome because his hands were not long and thin and he couldn’t have had Kleinfelter’s, because he didn’t have enlarged breasts simply indicates that you do not have idea what you are talking about. Marfan’s can be without long hands and Kleinfelter’s can be without enlarged breasts ( as a matter of fact adult Kleinfelter’s look mostly normal males). But Down’s can not happen without special facial features which makes all of the Down’s syndrome people look alike..","date":"2013-06-14","mins":"9:53 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37130","author":"jesterof","post":"Kelly, don’t you think that overemphasizing one system or one organ is not going to work in the long run? Our body is such a perfect design I keep admiring it.But in it’s entirety, not in corpuscular approach Endorsing “t cells”, or “R protein receptor”, or “endorphin release” is, probably, a good money making move ( since the general public is mostly very uninformed) but it is usually neutral at best. Sometimes even harmful..","date":"2013-06-15","mins":"7:58 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37132","author":"jesterof","post":"Kelly Kearse : Absolutely not. Different strokes for different folks. Focusing on a particular area of interest can allow the opportunity to look into something more thoroughly, to really deepen understanding. You can’t get this from an entirety type view, but it’s an individual thing. I think it can work terrific in the long run, but not everyone is the same. For me, it’s never been about making money, it’s going with what you feel. I was not talking about interests and professional preferences. I won’t be able to talk to the patients in a clinic for all day long myself )))) it was mostly in lieu of enhancing the system or organ in the body to “improve health”. Sorry for misunderstanding : ).","date":"2013-06-15","mins":"9:15 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36590","author":"jesterof","post":"Angel : jesterof, isn’t Methemaglobin a product of severe liver damage?</ NO.","date":"2013-06-09","mins":"9:43 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-37239","author":"jesterof","post":"Don’t know about Sodom and Gomorrah, but a claim about “blood of Christ” in the hole from the Cross is priceless. However I did not find anything about that in his site – but Angel claims his discovery is real : ).","date":"2013-06-17","mins":"6:58 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36591","author":"jesterof","post":"Kelly Kearse : Ex vivo, as blood dries, (Fe 2+) hemoglobin is oxidized to (Fe 3+) methemoglobin. Thanks..","date":"2013-06-09","mins":"9:44 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36592","author":"jesterof","post":"Or did the oxidized blood (brown) turn bright red ONLY on irradiation with UV light? Best, yes. That is the whole point. It is not bright red without UV or sunlight.","date":"2013-06-09","mins":"9:45 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36594","author":"jesterof","post":"Angel, thee processes you describe are CHRONIC, the stress and it’s result in Jesus’s body were ACUTE, not chronic. There was no time to develop accumulated methemoglobinemia ( which is a possibility if someone is exposed to nitrates/nitrites), but there is no reason to think that’s the issue here. Methemoglobin is not a catabolite of hemoglobin. Bilirubin, urobilinogen are. In a normal state as well. Upon stress one has more hemolysis than normal ( there is normal hemolysis of old erythrocytes all the time and myocytes get catabolized as well – those with myoglobin). It is a normal turnover in a body – new cells are being produced, old are being destroyed and metabolized – by the liver mostly, but not only. If one is in extreme conditions like Jesus Christ was – hemolysis is enhanced and there will be also rhabdomyolysis ( breaking of the muscle). The degree of every process is unpredictable as is not very predictable the extent of the impact on the kidneys and liver. However, the markers of failure of these organs are going to b present in the bloodstream even in few hours..","date":"2013-06-09","mins":"9:55 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36595","author":"jesterof","post":"Kelly Kearse : In the other threads, there is much discussion about the effects of UV light and interpretation of blood color. Analytically, Adler described methemoglobin this is expected as blood dries and ages. Yes, I know about UV light ( I’ve participated there). I just keep forgetting that drying of the blood is the process by itself )))) therefore looking at methemoglobinemia as in vivo process.","date":"2013-06-09","mins":"9:57 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36628","author":"jesterof","post":"Max Patrick Hamon : Jesterof, you wrote: “There was no time to develop accumulated methemoglobinemia (which is a possibility if someone is exposed to nitrates/nitrites), but there is no reason to think that’s the issue here.” Really? Re nitrates and TS blood colour: Ferric nitrate is a PURPLE crystal. It is used as catalysts and dye mordant. Mordant gives a RED colour. Mordanting takes place under alkaline conditions (e.g. Ammonia present in heavy sweating/Red Heifer ashes mixed with water/water mixed with Jerusalem malky stone dust). Now the Jerusalem malky stone dust contains iron oxide and the TS bloody body image blood colour can range from carmine RED to carmine MAUVE… I was talking about IN VIVO time.","date":"2013-06-10","mins":"12:35 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36649","author":"jesterof","post":"Angel : jesterof, Thank you. Do you know if the increased levels of bilirubin in the Shroud blood weredefined as conjugated bilirubin or unconjugated bilirubin? And if Dr. Adler found high levels of bilirubin, wouldn’t there be jaundice and wouldn’t the liver be responsible for the jaundice? I do not know which type it was, but in case of intravessel hemolysis it would be mostly unconjugated hemoglobin. There is a mnetioning in someones article about 30 seconds, but that is in theory with a healthy liver – it seems to me people tend to think in a laboratory terms in a clear case of a complicated clinicla scenario – therefore I would assume that it would be a mixed type of bilirubin – the one conjugated with hyaluronic acid in the liver and the one which is not. It is not the liver responsible for the jaundice it is bilirubin responsible for it. Liver responsibility is it’s conjugation with hyaluronic acid. Jaundice is not immediately visible while the levels of bilirubin might be already quite elevated.","date":"2013-06-10","mins":"4:50 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36654","author":"jesterof","post":"Error glucuronic acid, not hyaluronic.","date":"2013-06-10","mins":"5:26 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36653","author":"jesterof","post":"Angel. I do not need to see it in a link. I treat it. : ) You seem not to understand that there is a humongous difference between a chronic state ( which hemolytic anemia, for instance is) and an acute hemolysis which is stress and trauma related ( which is not a hemolytic anemia). Besides I do not see anything in the link which will condrradict anything I’ve said.","date":"2013-06-10","mins":"5:24 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36699","author":"jesterof","post":"Angel : jesterof, you’re the expert! I am referencing Methemaglobinemia. Jesus may have been exposed to nitrites or nitrates found in either contaminated soil or drinking water. Under these circumstances, iron in the hemoglobin molecule is alterted (Fe^+2, ferrous to Fe^+3, ferric). This is an oxidation process where the color of blood is changed from red to brown. Methemaglobin and hemolytic anemia (acute) would result from exposure to nitrates and nitrites, right? And don’t Nitrates irritate the liver? When the liver is irritated, isn’t there an increase in bilirubin? Didn’t Dr. Adler find an increase in bilirubin? Nitrates and Nitrites http://www.atsdr.cdc.gov/toxfaqs/tfacts204.pdf Best, Angel, There is no medical history of Jesus recorded in the Gospels. One can speculate about exposure to anything but that is just speculation. Kelly already explained the methemoglobin in a DRIED blood, there is no need to speculate about nitriates. There are a lot of substances which can cause liver damage, but one has to take the facts into account, not just general possibilities. By the facts described in the Gospels there are no connection to nitrates/nitrites and there is absolutely no reason to assume Jesus had any liver damage or intravascular hemolysis prior to his torture. His extreme sufferings due to severe stress and trauma has lasted about 12 hours( if you start at Getsymany) and that is consistent with acute damage to multiple organs and systems causing acute intravascular hemolysis as one part of that damage..","date":"2013-06-11","mins":"11:24 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36718","author":"jesterof","post":"Angel : Understood! jesterof, I would imagine a significant amount of Nitric Oxide was released into the bloodstream to counteract the effect of Jesus’ massive blood loss. As well, Nitric Oxide is known to be released with any type of physical exertion, as would have been the case with Jesus carrying the crossbeam. Inhaled Nitric Oxide reacts with hemoglobin to form Methemaglobin, but if severe stress or physical exertion causes an elevation in Nitric Oxide in the body, wouldn’t such an excess also react with hemoglobin to form methemoglobin? What are your thoughts? Best, Why do you think He had a massive blood loos? from where? at the most He lost not more than half a liter of blood, which is not severe blood loss, though it would be a contributing factor to dehydration and shock. And where would that MASSIVE nitric oxide come from? intracellular release of NO would not produce methemoglobinemia, Inhaled NO causes it very minimally. It is a potent ( and expensive) dilatator of pulmonary vessels smooth muscles, used in neonatology and in trating pulmonary HTN Where do you get all those wild ideas?.","date":"2013-06-11","mins":"1:37 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36720","author":"jesterof","post":"Angel : Jesterof, With respect to the bright red color of the Shroud blood, under uv light, it should be noted, porphrin is a tetrapyrrole, just like chlorophyll, and in its oxidized state, it is red and it flouresces. When it is placed under long wave UV light (UV A), it appears as an intense red color. Best, yes, I agree.","date":"2013-06-11","mins":"1:42 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36784","author":"jesterof","post":"Angel : jesterof says: “Why do you think He had a massive blood loos? from where? at the most He lost not more than half a liter of blood, which is not severe blood loss, though it would be a contributing factor to dehydration and shock. ***Angel says: “jesterof, in regard to the scourging, Jesus received 60 lashes (120 wound marks) that are detailed on the Shroud of Turin. Below is an excerpt from Doug Leatherman, MD, on Jesus’ massive blood loss: “There is much disagreement among the authorities as to the scourging. This was a Roman, not a Jewish, custom. The hands were tied high to a tree or post. A whip was made of a short wood handle and heavy leather straps bearing usually the sharp bones of sheep knuckles or lead balls on the ends. The Jews forbade more than forty lashes (thirty nine was the maximum allowed), but the Romans did not have this limit. The scourging was usually carried out by a Roman soldier. The whip was brought down upon the bare back, cutting the skin first; then as the beating progressed, the muscles were laid bare, bruised and bleeding with marked loss of blood. In a significant number of instances this was enough to kill a man. Ribs were broken, nerves exposed. Again and again, down came the whip until either death or unconsciousness occurred. Both venous and arterial bleeding occurred. Large deep, dark, bruised surfaces began to appear. Finally the skin of the back is hanging in long shreds. The whole area is an unrecognizable mass of torn, bleeding tissue.” http://www.churches of christ.net/tracts/job004u.htm Here is an image of the flagrum that was used on Jesus’ scourging. Note the metal balls attached to the leather whip. Http://www.indyprops.com/pp flagrum.htm Therefore, a massive blood loss from 60 lashes would be an understatement. As well, Jesus’ scourging was thoroughly detailed in Mel Gibson’s movie, “The Passion of the Christ.” Best, one won’t loose blood massivel from the scourging. At most it would be half a liter – which I am being VERY generous about. Scourging is very painful and stressful, but it is superficial trauma with no major blood vessels involved, whith coagualtion cascade activated immediately after the first scourge, \\ the picture described does not match the markings on the Shroud – if the skin would be torn off in big stripes as Dr leatheman describes, there should be the appropriate markings on the Shroud – we instead do have almost the same type of bell shaped wounds which are not compatible with above described picture. But even if the picture would be as described, there won’t be “massive blood loss” becasue that trauma is superficial and as I’ve already said the defense mechanisms of the body would already been activated. Clearly, the person theorizing about “massive blood loss” after superficial dermal injury has never been in the operating room. On a side note – what is “massive” in your description? how much is “massive”?.","date":"2013-06-12","mins":"11:39 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36786","author":"jesterof","post":"Hugh Farey : The dorsal image of the shroud by itself utterly refutes the idea that Jesus was flogged to the extent that “the skin of his back is hanging in long shreds” or anything like it. Nor does crucifixion result in massive blood loss, as the nails effectively block the holes they make. Scalp wounds bleed quite well, but nothing like enough to provide a “massive blood loss.” I agree with jesterof. Thank you. I missed your post. As I stated before – one is free to speculate, but in order the case to stand, one has to stick to the facts in the constraction of the reasonable hypothesis. And the facts do not support either nitrate water exposure, nor massive blood loss ( in the distinctions of what massive blood loss is).","date":"2013-06-12","mins":"11:48 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36785","author":"jesterof","post":"Not “massive blood loss”. Angel : jesterof, I’m elated you agree with me on something. :) Best, I agree with you on many things – you just seem to miss on which ones. I agree on bilirubin ( though I do not agree it is from hemolytic anemia), I agree it is bilirubin upon UV light exposure which is causing brightening of the colors. I do not agree that methemoglobinemia can be caused by free radicals, becasue ther won’t be enough of them to cause it, and I do not agree on a water exposure theory – but I explained why : ) ================ Mel Gibson’s movie actually describes the picture very accurately. It is very bloody, but it is NOT massive blood loss, if one knows what is the distinction of massive blood loss..","date":"2013-06-12","mins":"11:45 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36792","author":"jesterof","post":"Max Patrick Hamon :Jester wrote: “I was talking about IN VIVO time”. The true fact is the TS haematic cartography is not only a (palaeo)pathology and blood physiology issue; it is also an archaeological one and as such shall be tackled in the light of a most specific burial ritual/practice (e.g. Most likely use of an alkaline solution and fumigation to rapidly purify and dry the deceased’s body). Max, I know. I am not opining in the area where I am not an expert – and I have never opposed YOUR opinion on that. I can talk about pathology and physiology but I do realize this is not the only contributing factor. I simply am silent on achaelogical theme, becasue my knowledge upon the area will be an equivalent of “female blood” : ).","date":"2013-06-12","mins":"1:18 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36802","author":"jesterof","post":"Add – typo.","date":"2013-06-12","mins":"2:41 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36801","author":"jesterof","post":"David Goulet : I’ll second that request. Ass me to the list : ).","date":"2013-06-12","mins":"2:41 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36806","author":"jesterof","post":"Angel : jesterof, While I respect you and agree with a majority of what you’ve stated, all possibilities must be considered, including nitrites, nitrates and nitric oxide, if specific scientific problems related to the Shroud are to be solved. I disagree – one must include PERTINENT possibilities, chronic nitrate exposure is such a stretch possibility that it is not worth consideration, especially since thee is not even one piece of proof for that, but there are tons of possibilities of other nature – drying and postmortem fumigation/mordanting. Angel : Remember, as well, all things were not recorded in the Gospels. Certainly the Gospels did not mention Jesus had a sex chromosome trisomy (XXY), nor did the Gospels mention, in regard to maternal DNA (mt DNA), Jesus had a mutant genetic marker at 150 T. What specific genetic disease is associated with that marker? As far as I remember the bits and peices of DNA were so fragmented that there was no possibility to draw ANT conclusions fro that. XXY is Kleinfelter syndrome. While there is always a possibility in someone who never had children of their own that such a male has Kleinfelter’s ( unless they are unusually short), there is no reason except the fantasy of a filmmaker to think Jesus Christ had that particular syndrome. Taking into consideration that by Gospels He did not have the source where the Y will come from, it is highly unlikely He was genotypically XXY or even XY If one remebers the birth history of Jesus, one must conclude that His genotype will be that of XX even without a SRY gene – this has been described: http://www.ncbi.nlm.nih.gov/pubmed/16556678 Angel : While it is probable Methemaglobin was the result of trauma and stress, we are not certain Jesus was deficient in producing the diaphorase enzyme, nor if Jesus had an abnormal hemoglobin variant (Hemoglobin M). Methhemoglobinemia would be the result of either of those mentioned abnormalities. No, it is NOT probable that Jesus methemoglobinemia in dried blood resulted from stress and trauma – those DO NOT produce hemoglobinemia. Any speculations on a possibility of any genetic mutation causing methemoglobinemia is a pure fantasy without any background to back it up, so it is not worth to discuss it. Angel : Since, Leoncio A. Garza Valdes was only able to obtain fragmented DNA, there are many things NOT listed in the Gospels that may, in fact, define Jesus. Best, Since there are only fragments of DNA there is nothing to talk about – this is clear speculation and one can consider the whole list of genetic abnormalities to fit them ( since there is neither proof or disproof of that) and chromosomal aberrations, but this is abolutely futile approach not worth any time..","date":"2013-06-12","mins":"3:12 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36807","author":"jesterof","post":"Those do not produce ME Themoglobinemie – typing too fast.","date":"2013-06-12","mins":"3:15 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36827","author":"jesterof","post":"Angel, Jesus was pierced with the sword AFTER DEATH. Get your fact together – read the Gospels.","date":"2013-06-12","mins":"10:59 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36402","author":"jesterof","post":"Angel, red blood cells burst ( hemolysis)under other conditions as well – there were plenty while thee Man of the Shroud was still alive and there are also a lot after death.","date":"2013-06-07","mins":"6:24 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36828","author":"jesterof","post":"There was no blunt trauma to the liver or any other internal organs to cause internal bleeding. You keep inventing nonsense to prove what exactly? even massive blood loss will not release NO in a such amount that it will cause methemoglobinemia – it is impossible. Read about free radicals a bit before producing fantasies. Best : ).","date":"2013-06-12","mins":"11:03 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36829","author":"jesterof","post":"Angel : Question: If a person has a nosebleed, as a result of trauma to the nose, he or she is able to stop the bleeding by applying pressure (pinching the two nostrils together). Correct? Assuming the above scenario, how would Jesus have been able to stop the nosebleed if his hands were nailed to the cross? Best, By coagulation cascade. Which is immediately activated. Nose bleed stops by itself in other words and nose bleed does not produce severe blood loss, unless a person is a hemophiliac, which Jesus was not.","date":"2013-06-12","mins":"11:04 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36830","author":"jesterof","post":"Angel : Internal hemhorrage. Excerpt: “Exsanguination is a relatively uncommon and dramatic cause of death in humans. Blunt force trauma to the liver, kidneys, and spleen can cause severe internal bleeding as well, though the abdominal cavity usually becomes visibly darkened as if bruised. Similarly, trauma to the lungs can cause bleeding out, though without medical attention blood can fill the lungs causing drowning, or in the pleura causing suffocation, well before exsanguination would occur. In addition, serious trauma can cause tearing of major blood vessels without external trauma indicative of the damage.” http://en.wikipedia.org/wiki/Exsanguination Internal bleeding was evident when Jesus was pierced with the sword (blood and water poured out). Excerpt: “A number of forensic pathologists have examined the descriptions (and, in some cases, information on the Shroud of Turin). They all agree that there is no way water could have come out. But, they agree that the heart is surrounded by the pericardium, which contains a watery fluid and a lance thrust would have extracted this fluid, which would look like water. The thrust would also have pierced the heart, drawing accumulated blood. Even if Jesus didn’t die of asphyxiation and even if He didn’t die of congestive heart failure and even if He didn’t die of hypovolemic shock and even if He didn’t die from the internal hemorrhaging itself, He had a large, deep, open chest wound through at least one lung and probably the heart, with internal bleeding. This would have caused internal infection and in a few days He would have died of sepsis, i.e., infection.” Best, I f you connect the BLOOD FROM PIERCED HEART and the interstitial fluid from the pleural pace and the lungs of somebody who died because of the pulmonary edema – and try to pin it as a “proof” of internal bleeding the conclusion is 1) you do not understand neither basic anatomy and physiology 2) you do not know what “internal bleeding” entails 3) there is clear no point FOR ME to proceed in this discussion – the blog format is impossible for quick lectures in anatomy/physiology/basic pathology. P.S. Heart is FULL OF BLOOD – that is the pump pf the blood, it is expected and should be there, as are lungs as well – they are full of blood( 2 to their function) – it’s NORMAL ***sigh***.","date":"2013-06-12","mins":"11:11 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36857","author":"jesterof","post":"Angel : jesterof, When you state Jesus lost, at most, one liter of blood, you are assuming only external bleeding, as seen with the naked eye, and failing to recognize blood loss from internal bleeding. I would conclude Jesus lost, at least, half his blood supply. Excerpt: “What is internal bleeding? While the general public understands that internal bleeding means bleeding that can’t be seen on the outside of the body, medical personnel tend to use terms that describe precisely where inside the body the bleeding is found. The internal bleeding may occur within tissues, organs, or in cavities of the body including the head, chest, and abdomen. Examples of other potential sites of bleeding include the eye, lining tissues of the heart, muscles, and joints. Http://www.medicinenet.com/internal bleeding/article.htm I do not state that Jesus lost “at least ONE LITER of blood” – i state He lost AT MOST HALF a liter of blood – which a big difference, btw. And if you consider a liter of blood to be HALF of a grown man blood supply ( it is called adult blood volume) you need to first check the figures, because it is about 20% of adult man blood volume, often even less. Jesus did not have internal bleeding – there is no reason for that..","date":"2013-06-13","mins":"8:37 am","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36905","author":"jesterof","post":"Angel : No, I do not consider a liter of blood to be half a man’s blood supply. Half a man’s blood supply would be approximately 3 liters. I found your inital post and you did state not more than half a liter, but I am of the opinion Jesus lost more than 500 m L, and that is because of the blood loss from the head, nose and mouth as evidenced by the comparative study of the Sudarium of Oviedo and the Shroud of Turin. Angel, did you ever see anybody in real life loose a liter of blood? Exactly 1000 ml? I suspect that you did not, therefore this amount, or 500 ml or 2 liters are somewhat theoretical for you and you easily throw the figures and the causes, because you have never experienced it in reality. One can not loose even 500 ml from a nose bleeding and mouth bleeding, unless somebody has a very severe case of hemophilia. This is impossible simply because we are designed that way – otherways we would be extinct already. Our defense mechanisms prevent us loosing even 100 ml of blood because of the nose bleed. Or mouth bleed. A blood loss of a liter( without replacement) in a most case scenarios leads to severe morbidity and sometimes mortality, depending on a situation In Jesus case if he would loose a litr of blood upon scourging or have had an internal bleeding of that amount as a result of some blunt trauma ( it does have to be severe) he won’t survive the road to Calvary. Real internal bleeding the ones you have heard about, and connect to here are acute life threatening conditions and lead to the OR STAT, or otherwise they end up in a morgue. Angel : The Sudarium was in direct contact with Jesus’ head and it was noted by the Sudarium scientists how much blood Jesus had lost from the head, mouth and nose. Since the Sudarium sopped up most of the blood, what blood is displayed on the Shroud is not indicative of Jesus’ total blood loss. My statement was Jesus lost approximately half his blood supply. A man’s total blood supply is anywhere from 5 to 6 liters; therefore, 2.5 to 3 liters is what I predicted. Best, The Sudariuum does not prove in any way your hypothesis of massive blood loos. Bleeding – yeas, but not massive blood loss. Sudarium proves a blood loss of about 50 ml If Jesus would loose half of his blood supply He would die at the place of scourging. You have no idea what you are talking about – at all..","date":"2013-06-13","mins":"10:25 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36906","author":"jesterof","post":"Angel : Catherine, it must have been awful for you. I knew a man who suffered from esophageal varicies, liver damage, and I saw several of his nosebleed episodes (gruesome) and the only way to stop the flow of blood was to get him to the Emergency Room. At the ER some type of endoscoptic treatment was performed, where something similar to a carrot stick was placed into the esophagus, putting pressure on the bulging varicose veins and bleeding stopped. The ER doctors stated this man had lost half his blood supply. Best, Do you have any idea why a man who has severe varices will have severe bleeding from them? That is exactly the same reason why he has varices to start with. Do you also know what varices are? And if you oknow can you even compare this to a traumatic nose bleed? those are not even apples and oranges, those are apples and milk..","date":"2013-06-13","mins":"10:34 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36455","author":"jesterof","post":"Angel : Interesting! Yes, more than likely anemia (blood loss), as a result of severe stress, would also have contributed to the hemolytic episode experienced by Jesus, the man on the shroud. Best, His hemolysis was mostly stress related, IMHO and there also was rhabdomyolysis – because of the stress and severe dehydration. This a breakdown of the muscles and myoglobin which is similar to hemoglobin I do not suppose there was a severe anemia due to blood loss, mostly hemolytic The hemolysis of erythrocytes doesn’t matter for the color – because the hemoglobin, which is inside the cells pours outside( free in plasma, until it is conjugated n the liver), but it is still the hemoglobin ( and it’s residues and metabolites) which produces the color..","date":"2013-06-08","mins":"2:30 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36965","author":"jesterof","post":"Varices are not in the nose, so first of all it is not a NOSEBLEED. Second, introducing variceal bleeding in a liver failure patient to prove your theory of nose bleeding leading to the loss of a half of blood volume is absolutely the same as saying that apples are sour, because milk contains lactose. Variceal bleeding from ESOPHAGUS in a patient with liver failure and portal hypertension does not prove your assertion of nose bleeding leading to loss of half of blood volume in a totally healthy person subjected to trauma of the nose. If you do not understand it I can’t help you. But you are comparing apples and milk, not even the apples and oranges.","date":"2013-06-14","mins":"12:36 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36907","author":"jesterof","post":"Angel : jesterof, I would agree with you about minimal blood loss (500 m L), if it werent for the fact Jesus bled one hour before the Sudarium was even placed on His head. The Sudarium of Oviedo is the cloth (head napkin) that was in direct contact with the head of Jesus. The Shroud was placed on Jesus AFTER the Sudarium was removed. See Page 4. 500 ml is not MINIMAL blood loss – it is a big blood loss and that is THE MOST amount Jesus could have lost if one sticks to the description of His torture. Sudariuum proves that He has lost not more than 50 ml. Angel : ” At the bottom of the back of his head, there is a series of wounds produced in life by some sharp objects. These wounds had bled about an hour before the cloth was placed on top of them.” There is a forensic scientist on the Sudarium team. José Delfín Villalaín Blanco DM, Ph D. Professor of Forensic Medicine at the University of Valencia, Spain. Vice President of the Investigation. Spanish Centre for Sindonology (CES). Member of the Investigation Team of the Spanish Centre for Sindonology (EDICES). Jorge Manuel Rodríguez Almenar http://www.shroud.com/heraseng.pdf You state there was minimal blood, but did you include the blood found beneath the cross hole in your total? And if Jesus bled for one hour before the Sudarium of Oviedo was placed on His head, how are you including that blood loss in your total (500 m L, at most)? ***Sigh*** Take care! Best, Jesus did not bleed an hour – it is impossible. He was bleeding upon the trauma inflicted and then the bleeding stops – it is our natural defense mechanism – we clot. Even if some sipping of the plasma occurs, or some fresh blood appears after a clot is scratched – it is not a bleeding like an open faucet. As I previously stated – you have no idea what you are talking about. Angel, what do you do for a living? If that is not a secret..","date":"2013-06-13","mins":"10:41 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36964","author":"jesterof","post":"Angel, I suspect you have a comprehension issue. Where did I state that Kleinfelter’s are short? Is this the same as with my “minimal blood loss of 1 liter”? Jesus did not have Kleinfelter’s syndrome. How many Kleinfelter’s males have you diagnosed and tested? Or is it another theory based on bits and pieces from the web? What is “female DNA”? Probably the same as “female blood” There are no reliable DNA studies to prove ANYTHING in relation to Jesus Christ – it is too fragmented. If one knows at least SOME genetics and applied it to the birth history of Jesus one knows for sure, that Jesus’s haploid combination will not have ANY Y chromosome – it is impossible, given His birth history. His genotype will be XX..","date":"2013-06-14","mins":"12:29 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36973","author":"jesterof","post":"2 colinsberry ( I am glad you lifted up your self imprisonment))) http://www.ncbi.nlm.nih.gov/pubmed/16556678.","date":"2013-06-14","mins":"1:10 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-36966","author":"jesterof","post":"Angel: Varicies are varicose veins and the bleeding would be equivalent to someone who has slashed his or her wrists (a venal bleed). No, it is not equivalent to slashing non variceal veins at the wrists. It is totally different. If you slash only your veins at the wrists, you will not bleed neither to death nor even the half of the blood volume, contrary to the popular belief. One has to slash something else : ).","date":"2013-06-14","mins":"12:46 pm","url":"https://shroudstory.com/2013/06/03/a-guest-posting-ten-questions-for-alan-adler-by-kelly-kearse/","cat":"blood_studies","title":"A Guest Posting: Ten Questions for Alan Adler by Kelly Kearse"},{"id":"comment-29308","author":"jesterof","post":"I am always amased at these discussions about coagulation, since it clearly looks like no physicians ever read them. Had anybody heard about DIC syndrome and what goes on during it? A man subjected to severe torture for hours, being dehydrated and in schock will develop DIC in a couple of hours and there won’t be any need in aditional anticoagulation..","date":"2013-04-04","mins":"9:42 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29659","author":"jesterof","post":"Colinsberry : Just out of interest, who said that ‘hydroxiproline’ (sic) is absent in humans? I certainly did not. No? So whose words are these: “A tenet of the leech hypothesis is that hydroxyproline is not a regular constituent in human blood, that there is scarcely any worth speaking of.” It is a common constituent of human blood, especially under some circumstances, like exercise activity of the muscles or disruption of the connective tissue, which are certainly the components of the whole picture..","date":"2013-04-06","mins":"12:37 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29662","author":"jesterof","post":"“The only way that I could make sense of all of that was to assume that Rogers had indeed found a very strong HP signal in Shroud blood, far in excess of what one would expect in ordinary blood, fresh or certainly aged. So why was it there,” Because it was not an ordinary blood from a healthy individual reclining in a chair – it was the blood of the man who has been a subject to severe muscle exercise and a lot of disruption of collagen..","date":"2013-04-06","mins":"1:41 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29666","author":"jesterof","post":"Colinsberry : You cannot be serious. If connective tissue were as fragile as you suggest, needing constant re modelling, don’t you think we would have heard of it by now – in the form of sports injuries, lengthy recuperation periods? It seemed pretty tough stuff to me, years ago in zoology classes… That’s you, who can not be serious. Which is understandable, since you do not have even a trace of medical training. Did you at least read the first post of the topic? it is easy to translate it through google.","date":"2013-04-06","mins":"2:17 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29667","author":"jesterof","post":"HERE. I’ll repeat it. Elevated hydroxyproline levels are common findings not only in sports medicine but in a lot of connective tissue disorders, which might be very mild in manifestation clinically. Escipion : En el individuo normal, sano, la hidroxiprolina sólo se encuentra como trazas en el suero sanguíneo, y en poca mayor cantidad en la orina como hidroxiprolina libre y hidroxiprolina conjugada con péptidos. La hidroxiprolina AUMENTA de manera muy considerable en el suero sanguíneo y en la orina en los INTENSOS ESTIRAMIENTOS MUSCULARES MANTENIDOS, lo que es bien conocido por la MEDICINA DEL DEPORTE. Carlos Otal.","date":"2013-04-06","mins":"2:19 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29668","author":"jesterof","post":"In the normal individual, healthy, hydroxyproline is found only in trace quantities in the blood serum, and in little more hydroxyproline in urine as free and conjugated hydroxyproline peptides. The hydroxyproline increases very significantly in serum and urine in the intense muscle stretching HELD, which is well known to sports medicine..","date":"2013-04-06","mins":"2:20 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29669","author":"jesterof","post":"Http://books.google.com/books?id=Cp XV Awg Ov7s C&pg=PT248&lpg=PT248&dq=elevated+hydroxyproline+levels+as+a+marker+of+connective+tissue+disorder&source=bl&ots=r XYCB Ivi2q&sig=T4 O Ee Og X829iy M2wg DJT022 Sv Dk&hl=en&sa=X&ei=U Whg Uf Hl Noe49 QS1m I Go Ag&ved=0 CEQQ6 A Ew Ag HYDROXYLYSINE high plasma levels indicate connective tissue breakdown..","date":"2013-04-06","mins":"2:28 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29670","author":"jesterof","post":"Sorry, the last copy and paste is for hydroxyproline, not lysine.","date":"2013-04-06","mins":"2:29 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29671","author":"jesterof","post":"Kelly kearse : # 102 Those words are mine, but I did say “not a regular constituent of blood”, I thought the word “regular” qualified the meaning, as in not a major constituent as related to the components present in higher quantities, hemoglobin, albumin, etc., together with Colin’s previous assertion that ” there is scarcely any to speak of”. Perhaps the use of the word “regular” was not the best choice I did not intend it to imply that Colin suggested it was absent my apologies for any misunderstanding. The word “absent” was used in relation to hydroxyproline in comment # 97, but not by me there is scarcely any to speak of in a normal, healthy individual, I will add – in a resting state. Which not the case we are discussing..","date":"2013-04-06","mins":"2:32 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29674","author":"jesterof","post":"Colinsberry : Medicine has a role to play in Shroudology – but only if one is approaching from a 1st century perspective. Mine is 14th century, post radiocarbon dating, where medicine has NO role to play. Without the corroboration that comes from radiocarbon dating, medicine is not just irrelevant – it risks being seen as snake oil pseudoscience…. Well, at least it is honest. Mine is 1st century and medicine not only explains but strongly supports all the evidence of the Shroud so I do not see any reason for testing the very stretched concept of leeches..","date":"2013-04-06","mins":"3:24 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29675","author":"jesterof","post":"It is skewed C 14 which was refuted many times which is irrelevant, not medicine. Medicine is right in the very center of the problem.","date":"2013-04-06","mins":"3:25 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29692","author":"jesterof","post":"Kelly, it is NOT being bright red. In the past few hours I’ve searched the internet for all possible pictures – and those stains ARE NIT BRIGHT RED. You can see those by yourself – the pictures of Shroud are available and in all possible dimensions. They look as they are supposed to look and that was my initial impression while starting discussions on this thread – the whole claim of strange coloring of the stains is bogus, because they look absolutely as they are suppose to look..","date":"2013-04-06","mins":"7:15 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29694","author":"jesterof","post":"But I agree with you in general approach – the color appreciations is dependent on what you describe. I just plainly do not see any specific brightness. Maybe, the brightness is only in the eye of the leech beholder ;).","date":"2013-04-06","mins":"7:20 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29693","author":"jesterof","post":"They do not even differ too much from the other stains – same brownish reddish, terracotta colors as one would expect. All the talk about “crimson red” is only upon application of the special lights..","date":"2013-04-06","mins":"7:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29352","author":"jesterof","post":"Can somebody briefly explain what is the problem with blood coloration? Per photographs the stains look exactly as the blood stains supposed to look. Sorry for typos in my posts – I am using my phone and they happen.","date":"2013-04-04","mins":"2:05 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29363","author":"jesterof","post":"“Forgive, but it’s not that simple & obvious (at least to me not being medically trained,” yes it is simple for someone not only medically trained, but someone who has seen and treated DIC syndromes in dozens of patients. I have provided the link to medical review of pathogenesis of the DIC syndrome, and why the blood is simply sipping out without any coagulation is explained there. In brief – DIC at the stage of absence of coagulation factors because of their consumption at the initial stage resembles totally antigoagulated state. There are no factors in palsma and severe thrombocytopenia as well. The new factors are simply not yet synthetized by the body and if DIC is not treated the pt can simply die because f the hemorrhage – from every orifice of the body. The similar picture is observed with acute liver failure – liver is a synthetyc factory of the body and thee coagulation factors are synthetized there – if depleted and not repleted – hemorrhage occurs. “From the #9, follow up comment, I take it to mean that you are saying that, of course there would be elevated levels of hydroxyproline in the serum of someone that had undergone the events described in the gospel narratives, i.e. Jesus? Is that correct or did I misconstrue your meaning? Also, if the sample were from a bloodstain of a non tortured individual, would the baseline levels of hydroxyproline in the blood be sufficient to detect by such methods?” Yes, the hydroxiproline levels could be extensively elevated in a severely tortured individual. I do not understand what are you asking in the second portion of the question – elevated hydroxiproline levels in a non tortured individual are possible – in some medical conditions. The problems with interpretation of medical results by non medically trained public is that they tend to make them absolute. In the reality, medicine is not arythmetic and 2×2 is not always 4, but, depending on a very wiide spectrum of factors, it could be 5,7, 100 or 2..","date":"2013-04-04","mins":"3:06 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29790","author":"jesterof","post":"FYI venous blood has Hb O2 as well.","date":"2013-04-07","mins":"4:16 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29365","author":"jesterof","post":"#11, I will briefly explain, but it might be best to hear from others as well the point has been raised that the bloodstains look too much like fresh blood, they appear redder than what is typically observed for aged, dried blood that has undergone oxidation. This was one of the first issues that caused many to suspect they might have been painted on.” Oh, so these are also comments not by forensic pathologists, but by a lay public. Well, then I can assure you that they look absolutely like the old blood is supposed to look – at least on the photographs. “Finally, I am unclear as to what is meant by “My remarks are caused not only by this article, but the whole bunch of them and ridiculous comments on them.” What exactly is “the whole bunch?” Are the “ridiculous comments” all of them or just certain ones? Trying to understand exactly what you mean…” I read all the “blood articles” and the comments on them. Some snarky remarks by someone with a “40 years experience with rats” are the ones I am referring to..","date":"2013-04-04","mins":"3:11 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29809","author":"jesterof","post":"If one wants somebody to provide “the proof” by certain compounds one at least would have to set clear parameters by the waveform not “i think this is too bright”. What wave length should be “proved”? 620 nm, 670 or 595?.","date":"2013-04-07","mins":"8:07 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29818","author":"jesterof","post":"Kelly Kearse : # 159 Back to # 119 from yesterday, also look at #116, but I don’t think I used the word “bright”? Thibault, Do you have a reference for the Cameron & George article? Kelly, I am not smirking at YOU. I though it is clear whom my irony is directed at. At leech worshiper :).","date":"2013-04-07","mins":"9:34 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29379","author":"jesterof","post":"#13 Thank you for the additional info, a couple of quick follow ups: Regarding DIC and the bloodstains on the Shroud, would you conclude that the body was (significantly) washed before being wrapped in the cloth? Also, in your opinion, are the majority of Shroud bloodstains consistent with the transfer of moist blood clots? I did not do the extensive research on the Shroud’s blood stains – even by literature available, so I can not answer that particular question, It simply caught my eye that somebody was sniffing off the possibility of wet staining the cloth because the blood should have been dried. The person making those remarks clearly have nothing to do neither with research, nor with clinical medicine. Upon reading remarks and articles it became clear that people exchanging views really do not have critical care medicine background, otherwise those remarks would not be possible..","date":"2013-04-04","mins":"4:13 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29825","author":"jesterof","post":"Kelly Kearse : # 162 OK I thought you were telling me they weren’t bright red, as though I had said so BTW, have you looked the app? I did. Kelly Kearse : # 162 # 163 For me, the parameters are those listed above that’s where I’d like to start, let’s put methemoglobin up first # 164 Signing out for now, will check in tomorrow as I am able (packed day) My question is still there – what is the wavelength of the stain perceived to be “too red” on thee Shroud? Until this simple question there is no discussion, because we can not talk about other hemoglobins before we actually set up the parameters of it..","date":"2013-04-07","mins":"10:11 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29819","author":"jesterof","post":"Kelly Kearse : # 159 The parameters I am interested in are a basic walk through the spectra, x axis left to right through the wavelengths of the 1) reported spectra & 2) expected spectra. Colin, include a 3) expected leech spectra if you like, with 2) being a non leech spectra As Thibault notes in # 158, bilirubin & bile pigments are just part of it Step by step is great. Starting with acid methemoglobin is great it can be built one compound at a time or certain ranges in the wavelength at a time, either would be fine. I would just like to understand what is atypical (& typical) regarding the spectra. Thibault, Do you have a reference for the Cameron & George article? The parameters I am interested in are a basic walk through the spectra, x axis left to right through the wavelengths of the 1) reported spectra & 2) expected spectra. Colin, include a 3) expected leech spectra if you like, with 2) being a non leech spectra As Thibault notes in # 158, bilirubin & bile pigments are just part of it Step by step is great. Starting with acid methemoglobin is great it can be built one compound at a time or certain ranges in the wavelength at a time, either would be fine. I would just like to understand what is atypical (& typical) regarding the spectra. Thibault, Do you have a reference for the Cameron & George article? one has to set up parameters in order to have meaningful discussion – and one can set up those which are assumed are the parameters of the “too red” stains of the Shroud. What are they?.","date":"2013-04-07","mins":"9:37 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29826","author":"jesterof","post":"Kelly Kearse : # 164, 165 oops, got bumped, thought I was next in line I’m not exactly sure what you mean by a wavelength of the too red stain, we have spectra of the Shroud samples, I’d just like to go through it, piece piece we can put bilirubin aside for now, just stay with methemoglobin I mean exactly what I have said – what is the absorption wavelength of the stain described as “too red” – is it 670? 600? 597? at last the range ( but not like 600 750, as it is a wavelength of “red” altogether) Before this is set up there is no point in discussing the absorption wavelength of carboxyhemoglobin, methhemoglobin or bilirubin..","date":"2013-04-07","mins":"10:15 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29827","author":"jesterof","post":"OK, good night :) I will check out tomorrow, but not early.","date":"2013-04-07","mins":"10:16 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29381","author":"jesterof","post":"What I was asking here is, in a normal individual, is sufficient hydroxyproline present in blood serum to be detected even without using techniques with increased sensitivity such as a mass spec. I can understand, it becomes elevated under certain conditions, but I was referring to a normal baseline hope that is more clear. Of course. There are plenty of hydroxyproline assay kits available on a market – both for serum and urine measurement. Hydroxyproline is produced by hydroxylation of the amino acid proline by the enzyme prolyl hydroxylase following protein synthesis (as a post translational modification). Hydroxyproline is a major component of the protein collagen. Proline hydroxylation requires ascorbic acid (vitamin C). The most obvious, first effects (gingival and hair problems) of absence of ascorbic acid in humans come from the resulting defect in hydroxylation of proline residues of collagen, with reduced stability of the collagen molecule, causing scurvy. Increased serum and urine levels of hydroxyproline have also been demonstrated in Paget’s disease..","date":"2013-04-04","mins":"4:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29882","author":"jesterof","post":"So there is no wavelength of the absorbtion of the stains, only subjective waving in the air of the term “too red” or”looking(sic!!!) fresh”, am I correct?.","date":"2013-04-08","mins":"10:58 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29820","author":"jesterof","post":"Until we have a wavelength of the “too red” stain there is nothing to “prove” in terms of additive or not additive, bilirubin or methemoglobin addition..","date":"2013-04-07","mins":"9:41 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29884","author":"jesterof","post":"You are talking of Mc Crone personal. Endettas and botched C 14 tests, don’t you?.","date":"2013-04-08","mins":"11:06 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29382","author":"jesterof","post":"I believe that Drs. Bucklin & Zugibe would qualify here as experienced forensic professionals, and include other specialists as well I wouldn’t say that the comments originate from the lay public. Is it your own opinion then that nothing appears that unusual because they don’t appear (overly) red or that many older bloodstains also exhibit a reddish appearance, even with prolonged time? Did Dr. Bucklin and Zugibe question the looks of the blood stains? Blood stains color depends on a plethora of factors – including the material they stain, the conditions they have been through and the contaminations they have been subjected upon. The original state of the human body is the least important in appearance. Those are the basics of forensic pathology, but if you insist, I may dig into specific literature. I am just interested who and when posed the question of too red, or too dark, or whatever, considering the color. Blood stains could be from bright red to almost black, depending on the above mentioned factors. Clotted blood differs form hemolized blood and so on..","date":"2013-04-04","mins":"4:23 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29904","author":"jesterof","post":"Jesterof : You are talking of Mc Crone personal. Endettas and botched C 14 tests, don’t you? it was from the phone so typos made it all twisted. Should read: you are talking of Mc Crone personal vendettas and botched C 14 tests, don’t you?.","date":"2013-04-08","mins":"3:05 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29383","author":"jesterof","post":"Sounds as though you have a lot of experience which would be a great help to those interested in these and related questions Thank you for your input. Thank you. I am a physician and I have worked in critical care medicine a lot..","date":"2013-04-04","mins":"4:24 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29957","author":"jesterof","post":"Kelly Kearse : # 199 It’s not an inquisition, I’m just asking because I don’t hear any specifics it’s like trying to talk about constellations without ever going outside or looking through a telescope or comparing photographs. . The re won’t be ANY specifics. Nobody from the Shroud deniers want any specifics, just to talk in general or about personalities. I am trying for the second day to get an answer to the very simple question – WHAT IS THE WAVELENGTH of the absorption of the suspicious, too red or looking fresh blood stain on the stain – to no avail. Maybe because the answer will leave no room for speculation about the leeches and pyrroles?.","date":"2013-04-08","mins":"8:49 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29963","author":"jesterof","post":"Actually page 30 31 of Adler’s book in a chapter named Spectroscopic Tests gives a very clear explanation WHY our Shroud denier clearly does not want to provide the answer, especially taking into consideration comparative nature of the analysis..","date":"2013-04-08","mins":"9:44 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29309","author":"jesterof","post":"Http://www.uptodate.com/contents/pathogenesis and etiology of disseminated intravascular coagulation DIC results from a massive activation of the clotting cascade. The major initiating factors are the release or expression of tissue factor, usually involving entry of tissue thromboplastins into the circulation, extensive injury to vascular endothelium exposing tissue factor, or enhanced expression of tissue factor by monocytes in response to endotoxin and various cytokines [4 6] Tromboplastin release into circulation appears after disruption of endothelium, which in case of even minor trauma is massive..","date":"2013-04-04","mins":"9:48 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30080","author":"jesterof","post":"There is also a discussion etiquette – if one stubbornly avoids the answer to the very simple question, muddling it in porphyrins et al it is usually indicative that that pesson knows perfectly well, that the answer is not supporting his arguments, therefore he’d rather talk about personality traits, internet manners and leeches. Much the same was with hydroxyproline impossibility in the human body after strenous activity. You used questionable defence “I do not believe it all” since you did not have any arguments left, now you are trying to hide behind the etiquette mask. The reality is simple – you know that you do not have the arguments which will prove your point ( at lest in those two instances) and do not have the courage to admit that. Oh, and when one is typing from the phone, spelling mistakes happen easily(sic!!).","date":"2013-04-09","mins":"4:36 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30084","author":"jesterof","post":"Colinsberry :The reason there are “no specifics” on spectrophotometry in the visible range is there are no specifics, no diagnostic utility, no molecular fingerprinting possibilities, certainly not in crude unfractionated mixtures (like Shroud blood solubilised in hydrazine). P> This is simply not true. Not only ARE there spectroscopic specifics of the whole blood, not the fractions, but based on those specisfics there is a widely used everyday practical technology used in every hospital and not only there.and it is called pulse oximetry and uses exactly that – the spectroscopic variations in absorbance of the light waves of the whole blood, depending on the oxygen saturation. Oxygenated blood absorbs infrared light ( 950 nm) whereas deoxygenated blood will absor the red wavelength, which is 650 nm. Neither of th peaks or ranges of the light absorbance in the samples studied from the Shroud were even close to 650 nm – which is the charachteristic deoxygenated blood, which is visually VERY dark and is more of the dark garnet color, than red. The blood on the shroud is deoxygenated, obviously, so its charachteristics are in a totally expectable range of the wavelenghth ( I encountered 420 450, 560 and one peak for one sample 600 nm). So the whole concept of some samples appearing “too bright” or ” too fresh looking” is simply ridiculous, as by pure comparison of the wavelenghts, without even digging into components it is obvious, that thay are neither “too red” or “too bright”. Too bright or too re would have to be at least over 700 nm, which none of the samples absorbs..","date":"2013-04-09","mins":"5:05 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30110","author":"jesterof","post":"Kelly Kearse : #214 jesterof, Can you help me out just a little bit with understanding this, are these values (encountered ones, see quote below) in reference to the data on pg. 31 in the Adler book that you mentioned earlier #206? This is line B? The blood on the shroud is deoxygenated, obviously, so its charachteristics are in a totally expectable range of the wavelenghth ( I encountered 420 450, 560 and one peak for one sample 600 nm).” And also, to understand correctly, the main point you are making is that even from the spectral data, one can see that the color/wavelength does not even begin to approach where red, intense red color lies? yes, exactly. Red starts above 600, and it is very dark red. The fully oxygenated bright red arterial blood will be in the very high portion of thee scale. I encountered in descriptions of the Shroud’s blood samples the wavelength of 400 450 and somewhere else one sample was also described as ~ 600 ( maybe 620, can’t find it immediately) The wavelength and it’s correspondence to the colors is well known : http://science edu.larc.nasa.gov/EDDOCS/Wavelengths for Colors.html obviously there are combinations of colors – brown is not in the standard spectrum, but it is low on the wavelength.","date":"2013-04-09","mins":"9:48 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30203","author":"jesterof","post":"Because we are right and you are wrong. I suspect Anoxie works with practical application of the wavelength absorption of the whole blood as I do and if the TECHNOLOGY is based on the wavelength of 650 – 950 for specifically blood, you may post as much curves as you want, but RED whole blood starts to absorb RED light not earlier than 600 nm. It is a practical application of the light absorption not just tfeory on MONOCHROMIC plots. Blood is not monocgromic.","date":"2013-04-10","mins":"10:32 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30204","author":"jesterof","post":"Yes, it was Adler’s book with a name with manuscript ( or similar) can’t post a link now – I am posting from the phone. He was actually com Paring the stains from the Shroud to 1 year old stains of the whole blood of his assistants and the latter got 650 or so absorbtion wavelength..","date":"2013-04-10","mins":"10:45 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30230","author":"jesterof","post":"Http://books.google.com/books?id=J2j Bn DN3 Vx MC&pg=PA30&lpg=PA30&dq=spectral+data+of+the+Shroud+blood&source=bl&ots=zen Dj Ct69 &sig=Wm P Zi D Bpkx Qp61 Q Ssp Vy4 Zj Vddk&hl=en&sa=X&ei=F3dj Uc u O Ymi8g TL1o CI Bw&ved=0 C Ko BE Og BMA0#v=onepage&q=spectral%20data%20of%20the%20 Shroud%20blood&f=false.","date":"2013-04-10","mins":"2:45 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30207","author":"jesterof","post":"And you need to learn some elementary principals of application of physics which you obviously lack. I am not even labeling your trick of substituting dyes for whole blood and expecting nobody will see it.","date":"2013-04-10","mins":"11:01 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30231","author":"jesterof","post":"Colinsberry : But with Shroud blood, whether “as is” initially, or pre processed, as in a leech, we are not dealing with native oxygenated v de oxygenated. Blood as tested in hospitals. It does not matter, or you think that live blood can not contain methhemoglobin? colinsberry : All the blood will be in the aged oxidized methaemoglobin state (at least) with the iron in the +3 oxidation state. That would preclude the reversible binding of oxygen that occurs in non denatured blood. Anyone wishing to explore the colour differences between “ordinary” aged blood (brown or black) and anomalously red or red brown Shroud blood would be exceedingly unwise to confine their search to the red wavelengths at 600nm or higher., and be sadly misguided if relying on pulse oximeter theory or practice. The only folk likely to do that would be trainee technicians with a limited grasp of scientific principles. One can make allowances for technicians. However, I would not expect a physician with a proper and thorough preclinical training to make so elementary an error… (Yes, I was once a preclinical lecturer at a major London teaching hospital). You did say you were a physician, didn’t you? Or was it ‘medically trained’? the “anomality” of the redness of the Shroud’s blood is only in you wishful thinking. It is not anomalous at all – the range of the wave absorption is in 400 450 range with only one spike of one sample to about 600. And since you obviously have had no idea about the pulse oximetry technology and its practical application of the wavelength above 600 you might be parascientifically trained, don’t you?.","date":"2013-04-10","mins":"2:51 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30234","author":"jesterof","post":"Oh, and BTW, Colin, you have demonstrated this before – when you are upset, you tend to denigrate your opponents. Why are you, upset, Jupiter?.","date":"2013-04-10","mins":"3:07 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30238","author":"jesterof","post":"Colinsberry : I’ve said all I want to say regarding the science (maybe in the fullness of time we’ll have some 2nd or 3rd opinions that will show which of the two of us has the better grasp of scientific principles). As for your attempting to dismiss the Shroud blood colour anomaly, I can only repeat what I said earlier: no one on this site had any trouble with Adler pointing it out, not while there was an authenticity promoting narrative to account for it – that fanciful bilirubin story. It’s only when I come along, first pointing out (a year ago) that bilirubin could never have survived intact for centuries in Shroud bloodstains, and then, just a couple of days ago reported here a quotation from 1999 in which Adler himself had acknowledged as much, that all of a sudden there is no red anomaly, that it is all just a figment of our imaginations. If there were no spectral signature for that red anomaly, then how could Adler have claimed to have modelled it with combinations of methaemoglobin and bilirubin? Are you aware that it is not me you are contradicting, so much as Alan D.Adler? Speaking for myself, I have no objection to your doing that – but do make an effort to maintain a modicum of scientific and logical consistency. It does not matter WHOM I am contradicting, because as I have stated at the very beginning – the whole concept of too bright, too fresh or too red – is flawed, IMHO, as it is based on the subjective evaluation. If Adler picked up the battle – it is not my concern, but his own evaluations have shown the wavelengths of the samples way below the 600 nm of the live blood I was initially referring to. The wavelength absorption of the whole blood depends on it’s p H, the hemoglobin concentration and some other conditions, which are applicable to dried blood as well. Why did he picked up the battle with bilirubin ( which is not a stable compound, does not interfere with live blood spectrophotometry, at least the one used for pulse oximetry evaluation) I do not know. I am not defending him in particular, I am trying to find out what started this strange description “the blood on the Shroud looks too fresh” when the data does not support this assumption at all..","date":"2013-04-10","mins":"3:49 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30239","author":"jesterof","post":"One more to add – the wavelength absorption differs dramatically depending on the method used. So if this is taken into account, the spectrum of blood absorption ( talking about live blood) ranges from low 400s to infrared spectrum..","date":"2013-04-10","mins":"3:54 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30362","author":"jesterof","post":"2. The side wound in your view, would the fluid that appears to be mixed with the blood in this bloodstain represent released pleural fluid that has built up in the lungs or fluid from the piercing of the pericardial sac or both? Also, what is the main basis for this being classified as a post mortem wound from the appearance of the bloodstains alone is it the blood flow pattern or the fact that just not that much blood flows, indicating that the heart was not pumping at the time the wound was made? as I remember by the Scriptures the side wound was made after Jesus died – to confirm it. Obviously, the blood from that wound is not a whole blood, but an addition to interstitial fluid, probably pleural transsudate and quite possibly from pericardial sack. If it was deep enough then the heart wmight have been damaged as well – and from the heart the whole blood might have poured. Wholecould have al been flawing from the big vessels in the lungs. Distinction with a postmortem wound vs alive has to based on a different charachteristics – I do believe that those have been described before quite a bit. I am not a phorensic pathologist per se and ifyou want me to find the educational materials ton the subject, I certainly can do it, only it will require for me some time. .cl Related to the latter, if the wound had been made pre mortem, and then much of the blood wiped away after the person had died, and the blood that you see resulting from post mortem seepage from the wound, would you be able to distinguish this from a post mortem wound, with no wiping away of blood?.","date":"2013-04-11","mins":"12:43 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30361","author":"jesterof","post":"Kelly Kearse :Jesterof, Quick follow up to previous post on Sap treatment, didn’t mean to imply that the oxygen had to be remaining bound here (just relating that to typical association with color change), hemoglobin could be oxidized, but why the persistence of the red color relative to that which dries on untreated cloth (brown) can the conformation of the heme be stabilized/affected differentially as a bloodstain dries on certain textile materials as opposed to other surfaces? T Here is NO ersistent red color remaining There.","date":"2013-04-11","mins":"12:35 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30364","author":"jesterof","post":"At 600 nm hemoglobin is totally deoxygenated and it is a dark color blood. Very dark. I do not see it as red remaining, I see it a bit more reddish than the others, which are clearly BROWN, as they are supposed to be. With the reference to the stain color of experimental blood stain of 1 year old ( as described in that Adler’s experiment – I have no reason not to believe him) – that stain was absorbing 650 nm and he described it as GARNET colour, and garnet is very, very, very dark red, almost black. So why it is so persistently related at 600 nm as RED is beyond my understanding. Maybe it was washed out with something, maye it was washed by Saponaria and it had it’s own effect on it ( it looks somewhat washed, at least on the app) – it could have been washed by other fluids, the Ahroud has been through a lot during 2000 years. I simply can not understand WHY even the defenders of the original authenticity are describing something with the lower wavelength absorption spectrum than the one which is a very dark color of the experiment they conducted as “reatining red color”. I am sorry, but if a patient has a hemoglobin level of 10 – he is anemic, and you can not call him somewhat anemic, comparing him to somebody with hemoglobin level of 11 and calling that one severely anemic. It just does not make any sence to me – at all. All this bruha ha around one stain with one spike to the level which is not even abnormal, and the decades long battle around linguistics..","date":"2013-04-11","mins":"12:54 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30369","author":"jesterof","post":"Colinsberry :Take a look at the epsilon bloodstain on Shroud 2.0 App – Dan’s current posting – especially on the 1 over 3 crossover theads of the herringbone weave. They are faint pink, not the brown that one would expect of centuries old oxidized haemoglobin. This ain’t no normal blood we are looking at. It’s as if the haemoglobin has been cured and preserved, like the muscle myoglobin in ham or bacon. Methinks the chemistry might be the same, as I suggested earlier (nitrite ion and/or nitric oxide has bonded onto the oxidized Fe(III)iron centre of the haem. So there ; ) me thinks it was just washed out by hot water LOL.","date":"2013-04-11","mins":"1:10 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30367","author":"jesterof","post":"As to the changing of the color of a blood stain after you wash it with something – just from clearly practical point of view – if you have a blood stain which you want to wash out – one never uses hot water, because hot water will permanently stain the cloth, only with cold one. How it changes the color – needs to be observed experimentally, but from my practical remembrance ( washed blood stains from the white coat million times) it does lightens it. So just plain WATER, simly hot, not cold washed over the stain could permanently change it – and it could have been water, which was used while the fires were put down ( we know about the on big fire and even have the water stains as a proof, but there could have been MORE, or hot water was splashed on the Shroud by any other occasion). So even if just plain hot water can permanently change the blood stain, imagine when something is added to the water. Or water could have had a lot of the ions which will react with the stain – water splashed over the Shroud was not distilled or even clean – there are million possibilities..","date":"2013-04-11","mins":"1:05 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30370","author":"jesterof","post":"And if theat is PINK – you are clearly color blind, colin.","date":"2013-04-11","mins":"1:11 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30372","author":"jesterof","post":"Colinsberry :(nitrite ion and/or nitric oxide has bonded onto the oxidized Fe(III)iron centre of the haem. So there ; ) YESSSS!!! EXACTLY!!!! Thank you, Colin. Nitrites and nitrates are ABUNDANT in water – in ponds, in rivers, EVERYWHERE. They poured contaminated by nitrites and/or intrates water from the near by source when the fire was put down – because of the flames and temperature – water became hot ( it has to be just 40 C to permanentlystain) – and here you go – the stain is washed out and has that ONE SPIKE to 600 nma and some colorblind sceptics call that stain PINK ; ) P.S. I suppose, you do not think they used Aquafina for the fire : )))).","date":"2013-04-11","mins":"1:23 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30378","author":"jesterof","post":"Colinsberry : Ron :Colinberry; “This ain’t no normal blood we are looking at.” Finally, someone sees the light. This ain’t no normal blood is absolutely right, it is the blood of Christ….Mystery solved.R God must have a sense of humour then – in first sending STURP to suggest it was all to do with bilirubin… STURP do not differ from you at all – in terms of absolut disconnect of the “pure scientist” from the practical world as is so clearly demonstrated by the arguments from BOTH sides..","date":"2013-04-11","mins":"1:33 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-30389","author":"jesterof","post":"Colinsberry :Your own particular agenda, aka hang up, is becoming plainer by the minute…Reminder: scientists and technicians need each other… yes, because they are alike – operate in a very limited world.of protocols… at least some scientists, I won’t point fingers : ))) you are way too sensitive to the mocking (when it comes to you precious self) for a seasoned scientist ***rolling eyes smiley***.","date":"2013-04-11","mins":"2:36 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29402","author":"jesterof","post":"Kelly Kearse, what is the problem with reddish coloration of the stains? Blood stains have variations in color appearance, it has nothing to do with supernatural effects, more with the material where the stains are and the conditions they have been through, including temperature, humidity, sun exposure, heat exposure and so on and so on. Can you, please, provide the initial source of doubts of the coloring of the blood stains? Being bright red is not abnormal. It is one of the variations of the normal blood stains..","date":"2013-04-04","mins":"6:47 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29406","author":"jesterof","post":"Http://books.google.com/books?id=a M6h Ndj HR Sg C&pg=PA1&lpg=PA1&dq=evaluation+of+the+color+of+blood+stains+in+forensic+pathology&source=bl&ots=N Pz Qm98z RU&sig=Obf2y Im GKBP3grd XYTHQKJ2b C94&hl=en&sa=X&ei=Hw Re Uauk H5 O68w Ti5 Y Dg DA&ved=0 CJICE Og BM Bk#v=onepage&q=evaluation%20of%20the%20color%20of%20blood%20stains%20in%20forensic%20pathology&f=false that;s the whole textbook on forensic bloodstain pattern analysis. Enjoy.","date":"2013-04-04","mins":"6:55 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29407","author":"jesterof","post":"Kelly Kearse : Jesterof, hang in there, I am responding. Had to eat! But I am back! I can accept it nothing to do with supernatural effects, no problem at all there Trying to put together a few references for you… bon apetite I will return in an hour – now I have to go :).","date":"2013-04-04","mins":"6:57 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29414","author":"jesterof","post":"Thank you, Kelly for an extensive reply. The photographs I have seen of the Shroud and the stains do not look out of ordinary, at least not for somebody who works in the operating room and in the ICU and sees blood stains all the time – of all possible hues of red. Some of the blood , even dried is never black as in one of your quotes is suggested. Some dry on tissues and remain red, bright red. If there is addition of mucous material to the blood, it will never darken even to brown. In medical school I have also had a year of forensic pathology course ( I was very interested in that area at some point, but ended up treating alive people, not analyzing their remains) and from that course and later from experience and extensive exposure to all types of body fluids I can attest that blood stains are very different in their colors, blood stains are not always made by the whole blood as one imagines when they have the blood drawn for the blood samples. Diluted or hemolyzed blood, will stain in one color, severe bilubinemia might add additional hue, methemoglobinemia as carboxyhemoglobinemia are definetely different and so on. But the most important is the material stained, since the medium of the material might act as a stabilizer, fixator or reducer of a kind – chemical reactions of blood contents and contents of the stained material can also make the color different or more persistent. Since the Shroud has been under severe fire at least twice – the amount of CO potentially reacting with the stains or any other chemicals in fumes potentially can reduce already oxidized material of the heme and change the color. We can not compare the color from before the fire and after the first fire, but it is certainly possible with the 1997 fire. This is just my speculation from the top of my head. To put it simply – I find differences in colors of blood stains not to be of any particular interest, since variations are very wide and that could even be seen on the photos I’ve provided in my links..","date":"2013-04-04","mins":"8:31 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29419","author":"jesterof","post":"You are very welcome, Kelly here are some more pictures to show what I mean by the staining material and differences in color :http://shs.westport.k12.ct.us/forensics/08 blood/bloodstains.htm those flashcards are almost perfect in describing how and why color may differ: http://www.slideshare.net/rolfok/ageing bloodstains there are plenty of links on google if one types” color of blood stains in forensic analysis” or similar word combinations..","date":"2013-04-04","mins":"9:02 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29420","author":"jesterof","post":"Although not mentioned by Bollone, CO binding to the free heme group (separated from the hemoglobin polypeptide) has an affinity 20,000x greater than oxygen it is unknown by me (or several whom I have contacted) if this is superglued in or given in would exchange as well. I do not know, but believe it is not permanently affixed. It is. To displace it in a human body, one needs to put the patient which is poisoned by CO inhalation in a barometric chamber so the patient can breathe oxygen under increased pressure to displace CO Hb and for a prolonged period of time..","date":"2013-04-04","mins":"9:10 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29311","author":"jesterof","post":"Http://www.treat nmd.eu/downloads/file/sops/dmd/MDX/DMD M.1.2 006.pdf Now, about the hydroxiproline. It is NOT a rare compound in the body and in certain conditions is actually a marker of certain processes. Http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3093059/.","date":"2013-04-04","mins":"10:03 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29421","author":"jesterof","post":"The treatment is called hyper barometric oxygenation.","date":"2013-04-04","mins":"9:11 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29422","author":"jesterof","post":"Http://hbotnm.com/articles/CO Neurological Research.pdf.","date":"2013-04-04","mins":"9:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29498","author":"jesterof","post":"Hugh Farey : With the greatest respect for all you blood specialists, but don’t we need archaeological pathologists here? We’re not observing blood which is a few weeks or even a few years old, but (unless it has been touched up) some 700 or even 2000 years old. Has anybody reading this blog had access to bloodstains on battlefield relics (for example) of genuine antiquity? I’ve been trying to find out who first claimed that the stains were “too red” to be real blood – possibly Walter Mc Crone – without success, but several observers of the shroud itself, rather than photographs, describe them as looking “fresh” which would be unlikely for ancient blood, I think. I have never seen the shroud itself, but do think that almost every photo I have ever seen, including the excellent shroudscope, misrepresents both the colours and contrast of the actual material, so that perceptions of colour, however professional, from photos alone are likely to be unreliable. Those who have observed it sometimes remark how the bloodstains appear to change colour according to whether it is inside or outside, or lit by various different light sources. We do need a lot of different specialists because it is not a one plane issue. One must also take into account that in any amount of time any relic could be exposed to difference in maintenance, therefore what was subjectively observed ( referrence to the colors) 20 years ago might not be the same as 100, or 2000 years ago. And, BTW, maybe Walter Mc Crone is just a daltonist ?.","date":"2013-04-05","mins":"11:17 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29499","author":"jesterof","post":"All right, genteleman, it looks like the issue of “color too bright” is a totally subjective interpretation of ONE man under unknown physical conditions, but with a very well known psychological bias, so what are we all discussing?.","date":"2013-04-05","mins":"11:19 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29314","author":"jesterof","post":"Escipion :En el individuo normal, sano, la hidroxiprolina sólo se encuentra como trazas en el suero sanguíneo, y en poca mayor cantidad en la orina como hidroxiprolina libre y hidroxiprolina conjugada con péptidos. La hidroxiprolina AUMENTA de manera muy considerable en el suero sanguíneo y en la orina en los INTENSOS ESTIRAMIENTOS MUSCULARES MANTENIDOS, lo que es bien conocido por la MEDICINA DEL DEPORTE. Carlos Otal THIS : In the normal individual, healthy, hydroxyproline is found only in trace quantities in the blood serum, and in little more hydroxyproline in urine as free and conjugated hydroxyproline peptides. The hydroxyproline increases very significantly in serum and urine in the intense muscle stretching HELD, which is well known to sports medicine..","date":"2013-04-04","mins":"10:33 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29525","author":"jesterof","post":"And what the heck is that?.","date":"2013-04-05","mins":"2:38 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29526","author":"jesterof","post":"Which molecules are you discussing? Na Cl?.","date":"2013-04-05","mins":"2:42 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29538","author":"jesterof","post":"Bye bye.","date":"2013-04-05","mins":"4:55 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29541","author":"jesterof","post":"Hugh Farey : jesterhof, that red splodge of stuff was observed on one of the sticky tape samples taken off the shroud in 1978. I imagine Colin referenced it to give you an idea of quite how red the red stuff is. Of course, its a photo, with all the limitations referred to, and it might be iron oxide, or vermilion, or cochineal, or whatever, but it is clearly something. Do you still think it’s “normal” blood? the problem is – it is a PHOTOGRAPH with specific light on it. And it is actually a mirror image, so to say, not the original. There is nothing to discuss – for me those photos look like blood stains, for him they look suspicious. Both are totally EQUAL subjective OPINIONS. Neither of us here has seen the stains in a daylight on the original. So all we are discussing is subjective opinions. Those are very far away from any resemblance of scientific discussion..","date":"2013-04-05","mins":"5:18 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29543","author":"jesterof","post":"Yes, it is normal blood. One of the variations..","date":"2013-04-05","mins":"5:20 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29544","author":"jesterof","post":"And, btw, there is a very clear light interference on that photograph.","date":"2013-04-05","mins":"5:22 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29557","author":"jesterof","post":"Kelly Kearse : jesterof, would also be interested in your opinion, having examined numerous bloodstains, do you believe they could have been painted on, using human blood? are you asking in general or specifically about the Shroud? In general – anything is possible. With the Shroud – I don’t know..","date":"2013-04-05","mins":"6:46 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29558","author":"jesterof","post":"Kelly Kearse : #50 All right, genteleman, it looks like the issue of “color too bright” is a totally subjective interpretation of ONE man under unknown physical conditions, but with a very well known psychological bias, so what are we all discussing? This ONE man being Mc Crone? and is it really just one man? Did the idea really originate form Mc Crone? Mc Crone never examined the cloth in person; Baima Bollone preceded him, has examined the cloth in person and also noted the carmine color. Dr. Curto, Turin Museum of Egyptology I am not exactly sure of the timeline, but believed this may have been around the time of the 1976 Commission Report said “Darker, brownish marks on the body represent the trickle of blood or serum issuing from the wounds; we can also pick out two traces of crimson, simulating trickles of blood which, however, would have turned brown when dry [if they had been blood]. Therefore these marks must certainly have been added later and deliberately” this is from Mc Crone’s book, p. 15 So IT is Mc Crone. The one man. With personal vendetta against other members of his initial group. The color does not mean anything at all. First of all it is not carmine – there is all plethora of colors, if one will refer to the link posted here by colinberry. There are dark brown ones, lighter red and almost yellowish – and none are unusual. The stain like that could be produced from the blood, plasma, sweat, saliva, lymph, interstitial fluid combinations and stains from the tortured body will not be whole blood ONLY..","date":"2013-04-05","mins":"6:52 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29562","author":"jesterof","post":"From p. 85 of Ian Wilson’s book The Blood and the Shroud, as we have remarked earlier, the very colour of the bloodflows as they appear on the Shroud proper (as distinct from the negative, where they all appear white), raises some very justifiable suspicions. We all know that if we cut a finger and tie a handkerchief around it, the initial vivid red of the fresh blood will rapidly change to a dull brown, usually within a few hours. Yet at long ago as the early sixteenth century one Antoine de Lalaing deescribed the Shroud bloodstains as ‘clear as if they had been made today’. Vignon, viewing the Shroud the 1930s, described the colour as mauve carmine”. This is laughable. Those are real serious arguments of the people who are supposedly specialists on blood stains? or are they just simply lay people as are abundant here on the blog who have seen only blood brom the finger cut? This man did not have his finger cut. He has been first subjected to beating and ripping of his skin – which by results does not even resemble finger cut, his wounds were not clear cut knife single wound, those were blunt, cut, ripped and all combinations possible wounds. Then he was carrying a very heavy object a long way under scorching sun, which leads to dehydration, rhabdomyolysis and DIC. And severe traumatic shock because of the pain as well. Have you ever had a blister on a foot? such a bad blister, that it fills with blood tinged lymph? Guess what, the stain from that blister with the blood would not look like the stain from clear knife cut finger. And the stain from the blood tinged interstitial fluid from the lungs will also look different. Not to mention the stains from the sipping diluted blood from all orifices of the person who is suffering from DIC. And the bloody urine will stain even more differently. Bloody sputum, bloody saliva, bloody gastric contents wiill ALL look differently as stain. Khm. Mnestrrual blood stains also look differently Even blood stains from the initial cut during the start of the operation and the blood stains afterwards – stain differnetly..","date":"2013-04-05","mins":"7:03 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29573","author":"jesterof","post":"Kelly Kearse : # 66 The passage was from Mc Crone’s book, but he was quoting Dr. Curto’s earlier remarks I don’t know if one can definitively say this idea originated with him others would probably know better than me it was REPORTED by Mc Crone. If there is a reference to Dr. Curto’s direct speech outside Mc Crone’s book – then it is not just Mc Crone. I do not generally trust researchers who hold grudges against the conspiracy majority ( this is true in general, not particularly to this matter). Usually the most laughable conspiracy theories get their start with offended researchers ( to name HIV as the most exemplary one).","date":"2013-04-05","mins":"8:34 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29570","author":"jesterof","post":"Kelly Kearse : # 65 asking specifically about the Shroud some skeptics are adamant that it’s just applied pigment; some accept that it’s blood, but believe that it had to be painted on as the Shroud is bogus generally, the opinion is not voiced from skeptics that the bloodstains look phony, therefore the Shroud must be fake, but rather that the Shroud is fake, so the bloodstains must have been applied. Some that question the authenticity may believe that a dead body (of someone) was under the cloth and the wounds were inflicted to mimic the torture & crucifixion described in the Gospel narratives This is too specific a question. I can’t tell if the bloodstains are phony just from looking on the photos. But I can definitely tell that the arguments of skeptics that the stains can not be that color are phony – because those skeptics clearly have no idea what they are talking about..","date":"2013-04-05","mins":"8:30 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29576","author":"jesterof","post":"Kelly Kearse : #70 Okay What are your thoughts regarding the serum halos rings around the wounds, visible under uv light? you will have the same if the above mentioned blister stained a cloth. It just means that the stain is of a mixed origin – blood with interstitial fluid, for example. The stain from the WHOLE blood will happen if one has a clear surgical cut, as from the knife. Stains from blunt wounds, skin disruptions and other mutilations of the body are not goiing to be from the pure whole blood..","date":"2013-04-05","mins":"9:03 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29575","author":"jesterof","post":"Kelly Kearse : #66 Ian Wilson is not a blood specialist; de Lalaing, don’t know; Vignon, a biologist, but I don’t think he would be considered a blood specialist I believe these may have been more personal observations than intended as serious arguments as the question came up where the idea of red color originated, I am simply passing them along It is unfortunate they are laughable it is probably because many don’t have the experience as you, but there are those here who are sincerely interested in such things. Certainly there are probably many lay people here on the blog who have only seen blood from a finger cut there have also been the reports of those that have been medically trained that have commented on the red color of the blood on the Shroud #33. It is understandable, even by lay people, that “bloody sputum, bloody saliva, bloody gastric contents, [bloody urine], blood stains from the initial cut during the start of the operation and the blood stains afterwards will ALL look differently”, but are all of those types of stains represented on the Shroud, ventral & dorsal? Don’t get me wrong, I value your input and am surely trying your patience, but a couple of the issues I am unsure about are: To me (the untrained), many of the stains on the Shroud appear to have a similar color is this expected, or given the plethora of bloody origins, would more variation be more like it? Second, experience with bloodstains, etc. as some have also pointed out, does this fully apply to aged bloodstains? Maybe you are convinced it does I would like to understand as well. I’ve had lots of blisters on my feet, blood filled yes; bruises, cuts on my face, blood filled (pugilism), cuts on my fingers, yes, I can appreciate the variation. As mentioned above, for me, maybe for others, that’s some of the issue: are the bloodstains on the forehead, back of the head, wrists believed to have been elevated similar color as many others, more anatomically positioned to contain blood from sputum, gastric juices, saliva, interstitial fluid, blood urine, etc. Kelly, you are not trying my patience at all. I gladly can explain what I can, and the variance in bllod stains is one of my daily work ( not as a major, obviously, bot as a constant visible side effect). There is no reason to think that if a blood stain from venous hematoma differs from a blood stain of the blood stinged sputum, those same stains in 100, 25 or 1967 years later will look alike, provided, they all were subject to the SAME conditions. What I am trying to make you see is a picture as a whole, not just blood stains, which an ordinary person usually sees after an accidental cut or bruise ( but even those differ in appearance, healing and marking the environment) I am used to look at the patient as a whole, since it is critical care medicine. An orthopedist might see only broken bones and holes, a cardiologist might just refer to pulmonary edema as a result of the acute left ventricular failure, a wound specialist would probably mourn the skin lacerations and probability of generalized infections, but a critical care specialist will have to look at a patient as a whole – including his skin disruption which resembles burns, multiorgan failure, dehydration, DIC, rhabdomyolysis and severe trauma. In surgical and trauma ICU those combinations happen all the time and as a side effect to treating those patients one can appreciate a variety of esthetics which include not only the wide range of possible deformities, discolorations and exudate of the human body, but also their reflection on the tissues, commonly known as stains. Now the other part, which I have tried to express before – the coloring of the stains NOW, or in the previous century has nothing to do with the initial coloring caused by the bodily fluids or their combinations. First, the cloth could have been prepared – impregnated by specific means; second – the body could have been also coated by specific substances; third – during whatever period of time the cloth with originally colored stains might have been subjected to influence by the fluids, fumes, temperature changes and light influence, which could have changed the initial coloring, as, for example happens when some wants to remove stains from the caret, clothing, furniture – not that the staining was a subject of removal, but as a result of accidental or not accidental influence. Methods of conservation do matter as well – since we do not know what were the conditions for centuries, claiming that the color of the stains are the proof of their artificial origin is childish, to say the least. Since the whole arguments of the “color skeptics” are basically – ” that’s the way I see it” without even trying to look for the whole picture, one starts to think – are all other skeptical arguments of the same amateurish level?.","date":"2013-04-05","mins":"8:57 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29626","author":"jesterof","post":"Hugh Farey : I sense a tone of frustration in jesterhof, who apparently has considerable experience of a variety of blood spillage on a daily basis, but hasn’t seen the Shroud, as opposed to a number of people (albeit including biologists, doctors and a ‘porphyrin specialist’) who have seen the Shroud, but are not as familiar with bloodstains. However, I must return to my comment 45, regarding degradation over time and ask jesterhof: How old was the oldest actual bloodstain (rather than a photograph) you have ever seen? It seems that in your experience blood can appear quite red for some time, but can you quantify that? How familiar are you with 100 year old blood (from, say Museums of the First World War?), 200 year old blood (Napoleonic?), 500 year old blood (European wars?). My point is that an expertise of various traumas is only the beginning of an understanding of how medieval blood can be described, with or without any medical knowledge, as “fresh.” I already answered that question – if the appearance of blood stains INITIALLY is different there is no reason to think that in 10, 100. 500 or 1967 years they will start to look the same, no matter what the origin of the stain. If the other conditions are the same. If you stain one cloth with whole blood, the other same loth with bloody stinged lymph and the third – with bloody mucous – and place them in the same container with the same temperature and environmental exposure, they will still look differently in 10, 100 or 100 years, if they look differently initially. The amount of difference should be studied by experiment..","date":"2013-04-06","mins":"8:58 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29349","author":"jesterof","post":"DIC an enhanced anticoagulation( there is no coagulation at all – blood sips from any minor scratch) which is an simple and obvious explanation both to leakage from the body and wet staining the cloth. My remarks are caused not only by this article, but the whole bunch of them and ridiculous comments on them. My comment on hydroxiproline is in sync with the first one here( in Spanish) – to assume that human body does not have elevated levels after strenous muscle activity ( try to carry a heavy object in scorching sun, uphill and dehydrated and then talk about traces) is to purposefully omit the obvious pathology of the case. I would bet that rhabdomyolysis would be present as well, with all the biochemical markers present as well..","date":"2013-04-04","mins":"1:59 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29627","author":"jesterof","post":"Kelly kearse : An additional question before calling it a day in # 4, you commented on increased physiological levels of bilirubin thoughts on how this would influence the bloodstain appearance? they should make it brighter.","date":"2013-04-06","mins":"8:59 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29628","author":"jesterof","post":"Hugh Farey : I sense a tone of frustration in jesterhof, who apparently has considerable experience of a variety of blood spillage on a daily basis, but hasn’t seen the Shroud, as opposed to a number of people (albeit including biologists, doctors and a ‘porphyrin specialist’) who have seen the Shroud, but are not as familiar with bloodstains. ” I do not think that anybody here has seen the Shroud. And as Kelly mentioned above in some quote – the appearance and colors of the stains changed significantly when the lights were changed. In a bright daylight they might appear totally “normal” to an eye, but nobody from the living have seen the Shroud in the daylight. The frustration you are referring to is more of the amusement that adult people in all seriousness are discussing the possibility of blood staining only in one fashion, whereas everyday life shows them that it is not possible..","date":"2013-04-06","mins":"9:05 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29644","author":"jesterof","post":"Kelly Kearse : #75 I meant to include in original question, but was interested in your opinion if the presence of serum halo rings were diagnostic of a transfer stain (from a body) or would you expect the same thing if applied blood were used? If already answered in #70, okay, but wanted to see if the same thing applied to the serum halo rings. No, halo rings are just a marker of a stain of blood with interstitial fluid – like the one which will form on a cloth from somebody coughing out the pulmonary edema froth. Why do you always ask about applied blood? If one applies whole blood – the stains would be of one color, if one applies the mixture of blood and saliva, for instance – they will be different. The halo markings do not prove or disprove the transfer or application – they only prove that the stain is not the whole blood. Given the state of the body after torture I do not see any reasons to question that the stains are mostly not from the whole blood, so the halo marks will be abundant. From the practical point of view application of the whole blood is easier, obviously, so in some angle, halo markings are rather proof of transfer from the body than application, but only because of the practicality – it is more easy to obtain whole blood than diluted..","date":"2013-04-06","mins":"9:56 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29629","author":"jesterof","post":"He goes on to add, “Whatever interpretation one makes of them, I would readily endorse both of these descriptions. In the course of my own viewing of the Shroud in November 1973, I was present on occasions when the television lights were both on and off. When the lights were switched off and the room where the Shroud was displayed remained in what may be best described as subdued interior daylight conditions, colour wise the blood marks appeared much different than the body image. When they were switched on the bloodstains took on a very distinctive ‘clean’ mauve carmine color…” That is the quote I am referring to. So if one appreciates carmine coloring only under extensive TV lighting then it is not the original color to be blamed, or is it?.","date":"2013-04-06","mins":"9:08 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29646","author":"jesterof","post":"Hugh Farey : I’m sorry; I think our comments crossed in the ether. Quite apart from bright television lights, those who saw the shroud under sunlight also commented that the bloodstains looked unusual, and some of them were familiar with the stuff. So it is the original colour, not just TV lighting, that we are trying to explain. For somebody to declare bloody stains unusual one would have to describe how many and how often he/she have been exposed to blood stain before. For colinberry the stains on the link look unusual, for me – they do not. As I pointed before – we are discussing subjective opinions and those are not a scientific matters..","date":"2013-04-06","mins":"9:59 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29647","author":"jesterof","post":"Kelly Kearse : A general comment, for anyone, but if one accepts that the red color of ancient blood is in no way unusual, then what would be the molecular basis for a bloodstain to remain red? Many of the above comments would suggest that comparison with new > aged whole blood oversimplifies the issue. Does the red color of the blood result solely from the chemical signature of the porphyrin ring, or is it a mosaic, with the presence of other (bodily) components/fluids in the stain and the background of the cloth contributing as well? Is this the major disparity when only the porphyrin ring is considered as being solely responsible for the color? it may result from the chemical reaction with the material on the cloth or any material splashed, fumed or exposed to for centuries afterwards In my opinion you are making the fundamental mistake – you are taking as a given that nowadays look of the stains is actually the same look it has been after the burial. And that is a very brave assumption, given the centuries which have passed afterwards and conditions the cloth has been in..","date":"2013-04-06","mins":"10:03 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29648","author":"jesterof","post":"Hugh Farey : Adult people are wondering how centuries old blood stains can be described as looking “fresh” or “carmine”. You have not addressed that point. You seem to say that if the composition of two bloodstains looks different to start with, it will continue to look different after hundreds of years, but you do not explain why either of them should look “fresh.” Do you have any ideas about that? It may be that you think the photos you have seen do not look particularly fresh (in which case you would be in disagreement with many who have observed the shroud itself) or it may be that you have experience of old blood which does look fresh (in which case we would very much like to share your experience). Because they do not look fresh or carmine TO ME. And an eyewitness from the quote states clearly that they look carmine exclusively under the TV lights..","date":"2013-04-06","mins":"10:05 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29649","author":"jesterof","post":"3) Others have commented on the presence of hydroxyproline in serum Brother Hirudo has taken a vow of silence on this one, or is that an unfair assumption? A stalemate could be serum, could be medicinalis, or still must be medicinalis? Hydroxiproline in serum is NORMAL – I thought we resolved that question way above..","date":"2013-04-06","mins":"10:07 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29654","author":"jesterof","post":"Anoxie : jesterof : Hydroxiproline in serum is NORMAL – I thought we resolved that question way above. I thought the normal presence of hydroxyproline in serum was resolved in the very post of this thread. Kelly Kearse : Hydroxyproline can be detected in normal human blood serum using simple immunological techniques that do not approach the sensitivity of mass spectrometry (ELISA kits, see kamiyabiomedical.com and mybiosource.com for examples). Using HPLC (high pressure liquid chromatography) methods, serum levels of hydroxyproline may be evaluated in patients as a measure of liver and renal function (E. Kucharz, Rom J Intern Med Oct Dec; 32: 271, 1994; Inoue, et al. Analyst Apr. 120: 1141, 1995; Inoue, et al., Biol. Pharm. Bull. Feb 19: 153, 1996). The clinical significance of a hydroxyproline containing protein in human plasma was reported by Carwile Le Roy and Sjorerdsma as early as 1965 (J. Clin. Investigation 44: 914, 1965). It is not a given that the presence of hydroxyproline is indicative of contamination by animal protein, i.e. Leeches.I thought it was resolved by the very first one – in Spanish. Hydroxiproline is abundant in human body and under certain conditions it levels in the serum may increase significantly. The very notion that hydroxiproline is absent in humans is… khm, ..wrong :).","date":"2013-04-06","mins":"10:51 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-29656","author":"jesterof","post":"Kelly Kearse : #88 It’s not really always, it’s just a couple of times if the bloodstains did not originate from a body under the cloth, then someone must have added them. Just trying to be objective other physicians have noted the flow pattern and details of the bloodstains I thought that it was a reasonable to ask someone that has had a lot of experience with blood wounds on a daily basis, similar to asking a forensics expert about being able to distinguish real blood stains at a crime scene versus those that had been fabricated I didn’t know what the answer might be if anatomically speaking it would be ruled out right away as too much for someone to fake it I could see where an experienced detective might spot it right away at a crime scene because to the trained eye, the appearance is so different that’s all actually presence of plasma halo point more to the natural way of stain occurrence, in order to manipulate this artificially one has to be very creative and patient. But it is not impossible if one puts forgery as a goal Kelly Kearse : While I’m in the box here, I have wanted to ask your thoughts on an unrelated topic, Hematohidrosis I have read where in certain cases this could produce a yellow stain/different colored stains on the patient’s clothing. Would such a condition continue following the scene in the Garden of Gethsemane, or would it be heightened at initial times of stress, then wane? I’m not proposing that this is the basis for image formation just curious about the physiological ramifications of this condition. Apart from the relation to the Shroud, I have found the discussion on the physiological consequences of the events leading up to crucifixion interesting. In hematohidrosis blood is added material and sweat is the main one – the staining will have the characteristics of sweat more than blood, but the degree of blood expression vs sweat expression may vary Is it possible to continue after Gethsemane? during the torture and on the way to the Calvary? It certainly can, especially during the way uphill and on the cross – the condition is present when somebody is experiencing extreme stress, which is definitely the description of the Passion.","date":"2013-04-06","mins":"11:01 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-38825","author":"jesterof","post":"Typo – balmed, not blamed.","date":"2013-07-10","mins":"10:31 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-38824","author":"jesterof","post":"Maybe the explanation is that the body was not left as it was on the cross before wrapped in the Shroud? maybe it was washed and blamed ( the way the ancient burial customs required) and therefore the blood had different physical characteristics than the simple whole blood does ( did not stick to the cloth as it does to gauze) or the cloth itself was impregnated with substances which influenced the blood? Why is everybody always considering the abilities of the WHOLE blood in a normal situation to reflect those for a Man of the Shroud?.","date":"2013-07-10","mins":"10:30 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-38827","author":"jesterof","post":"On the other hand to expect that after 2000 years when the Shroud has been through so many different adventures that there still will be signs of “undisturbed” blood on the cloth as it will be on a gauze is ridiculous..","date":"2013-07-10","mins":"10:34 am","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-39036","author":"jesterof","post":"Daveb of wellington nz : The point being that neither the disciples, or first converts from Judaism, nor Paul’s gentiles, would have lived and died for such a religion, unless they believed that the Resurrection had a factual reality. They would not live and die for such, if it were only a vague psychological awareness, or if they saw it as a parable, or an illusion! exactly!.","date":"2013-07-15","mins":"5:11 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-38835","author":"jesterof","post":"Makes one wonder if the skeptics are from the outer world, or try to invent what else could try try to doubt against plain common sense?.","date":"2013-07-10","mins":"2:46 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-38849","author":"jesterof","post":"But the bigger point is why this should even be discussed as a possibility? after centuries of all the Shroud has been through ( it was even boiled in oil I once read) one would seriously expect the ORIGINAL signs to be still there? Not to even mention that the burial customs of putting the body to rest involving balms and spices definitely washed out the crust of blood which covered the body. Details could be provided by Max Patrick Hamon but reference to the practices are in the Scriptures..","date":"2013-07-10","mins":"5:50 pm","url":"https://shroudstory.com/2013/07/10/erase-the-fact-from-the-list-it-is-not-a-fact-it-never-will-be/","cat":"blood_studies","title":"Erase the fact from the list. It is not a fact. It never will be."},{"id":"comment-41851","author":"jesterof","post":"I guess I will have to get a dog first to see how he tore this waste to pieces : )))).","date":"2013-08-23","mins":"11:21 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-30487","author":"jesterof","post":"Max Patrick Hamon :Hugh, why don’t you try just to mix fresh human oxygenated/non oxygenated blood with an aqueous alkaline solution, moisten or soak a piece of linen in it and have the moistened/soaked cloth dry out via low temperature fumigation and see what happens? Exactly. Plus an addition of blood to other bodily fluid will stain and stay in a different way than whole human blood. The whole human blood staine when washed just with a plain, but hot water, will change the color of remains and actually permanently fix the cloth. If water has any contamination ( which any water except distilled will have) possible reactions between the contaminants and blood and plasma components are endless..","date":"2013-04-12","mins":"11:03 am","url":"https://shroudstory.com/2013/01/30/guest-posting-by-kelly-kearse-distinguishing-human-blood-from-that-of-other-species/","cat":"blood_studies","title":"Guest Posting by Kelly Kearse:  Distinguishing human blood from that of other species"},{"id":"comment-30488","author":"jesterof","post":"Jos Verhulst :What are we to think about the observation reported by Lucotte (“Vérités sur le Saint Suaire”, p.147 ff) on erythrocytes found on the Shroud (microscopic material collected by Giovanni Riggi di Numana) with diameters of 12.5 13 micrometer – much too large a value for human blood, according to this author. Http://www.jci.org/articles/view/100246/files/pdf could have been reticulocytes and there is also a wide variation in the size of erythrocytes as well – especially when the pt is anemic, which is quite a possibility, given the life style and diet..","date":"2013-04-12","mins":"11:11 am","url":"https://shroudstory.com/2013/01/30/guest-posting-by-kelly-kearse-distinguishing-human-blood-from-that-of-other-species/","cat":"blood_studies","title":"Guest Posting by Kelly Kearse:  Distinguishing human blood from that of other species"},{"id":"comment-39960","author":"jesterof","post":"Hugh Farey : I don’t think that’s fair to Lavoie. The paper you quote specifically excludes any reference to the scourge marks, stating “Other blood marks, such as the scourge marks and the blood flow on the dorsal image, fit into a different category regarding their formation and moisture content. Therefore, they should be evaluated separately; they go beyond the scope of this paper.” He clearly agrees with you! I read it under the influence by Yannick : ).","date":"2013-07-28","mins":"10:34 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40366","author":"jesterof","post":"Andy Weiss : I have two questions about the article’s refutation & Zugibe’s theory. 1) If the body wasn’t washed, I would expect just about the entire body would have been coated with blood. How is this explained? 2) Adler noted all the blood on the cloth came from exudates. A washing of the body explains this, otherwise we ought to at least see from blood marks from a living body on the Shroud. How is this understood correctly? 1) CORRECT 2) CORRECT.","date":"2013-08-03","mins":"4:28 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40385","author":"jesterof","post":"Let me decide, what I SHOULD : ).","date":"2013-08-03","mins":"7:27 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40367","author":"jesterof","post":"Yannick has a new fetish of ignorance – “infected” wounds LOL there was NO TIME for the infection to develop. The whole torture until death took about 12 hours – no time for infection to develop..","date":"2013-08-03","mins":"4:32 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40384","author":"jesterof","post":"Oh, pppplease, just don’t start with “what barbet thought”. It is not what Barbet thought, it is what YOU think that Barbet thought – those are absolutely different universes.","date":"2013-08-03","mins":"7:26 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40368","author":"jesterof","post":"Delay in wound clotting ( possible concept) is easily explained by DIC, syndrome, which is a very probable pathological process under the circumstances.","date":"2013-08-03","mins":"4:34 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40372","author":"jesterof","post":"Yannick Clément : Read again Zugibe’s paper (http://www.shroud.com/zugibe2.htm) and you’ll noticed that, right after the introduction, there is a section in which he address the particular question of the imprint of the scourge wounds on the Shroud and it’s pretty different than your own hypothesis. That’s why I prefer to consider yours (which I found much more plausible than Zugibe’s own hypothesis) as being a third hypothesis, after mine (which is based mainly on Barbet’s hypothesis) and Zugibe’s own hypothesis on the subject. His description is not clearly defined and is mostly concentrated on the washing of the body, which I agree with – no matter which type of transfer occurred – because they do not contradict each other. Most likely all were involved. Barbet description is not in conflict with Zygibe’s on the transfer at all. If one removes the clot from the wound – oozing of bloody content will occur. Some wounds have probably been oozing, some were still with clots ( which absolutely can stay and not needed to be removed by washing of the body ) some might have been intradermal hematomas and so on. The point is – it is all possible at the same time. And washing of the body does not remove the Barbet possibility as well..","date":"2013-08-03","mins":"4:56 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40383","author":"jesterof","post":"They do not have to be remoisten if they didn’t clot : ) don’t cling so desperately to one possible mechanism – there could be different ones as well.","date":"2013-08-03","mins":"7:25 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40387","author":"jesterof","post":"Jesterof : you are as closed minded as one can be, becaseu of your IGNORANCE “halos of serum” are not proving anything. Zilch. Nada. Zero. Plasma, or as you call it ,serum is an integral part of blood and it does not disappear magically upon death. It is present in ALL bloody fluids – the whole blood, the hemolized blood, the blood tinged sputum ( which is plasma too), the bloody lymph, the bloody exudates/transsudates of body cavities, the bloody urine, bloody pleyral effusion and so on. LEARN the BASICS FIRST if you want to be taken seriously. One can be mistakened ONCE, but you have been shown your ignorance so many times, yet you stubbornly persist on “your conception”. It is WRONG and it is wrong simply because you are totally ignorant on blood physiology. So, before you proceed in getting on that preacher stand of yours, do us all a favor – and study the basics..","date":"2013-08-03","mins":"7:33 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40386","author":"jesterof","post":"If I read one more time “washing of the body could not happen because it would remove all the clots and cause oozing of post mortem blood (and it could not occur because what Barbet said)” with attribution it to Zugibe ( which is a total LIE) I will puke. This phrase is a concentration of what you don’t understand and do not want to understand. It’s nonsense..","date":"2013-08-03","mins":"7:31 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-39974","author":"jesterof","post":"Ron : Why would one think the scourge wounds would be mostly ‘blunt’? From the descriptions I have read of the Flagrum, the balls were definitely not smooth “ball bearing” in their shape, but rough pitted and sharply edged metal balls or rough edged bone. These would have ripped at the skin and muscle underneath, in most cases, inflicting some major damage. I think many including our friend Yannick here have underestimated the damage inflicted by the Flagrum, most definately. R Not necessarily. The cloth imprints do not support this mechanism at all..","date":"2013-07-28","mins":"3:35 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-39973","author":"jesterof","post":"Hugh Farey : Ron, perhaps they were a mixture. Some marks on the shroud look like scratches, some like round bruises. A very few seem to have created open wounds. Of course, they were. That is the whole point. The injuries involved will ALL be a mixture of many types of wounds therefore many types of bloody material involved and many types of mechanics of imprints to be made. I have always been so amazed that some clinch to the specific type of “blood transfer” as the only one, unique possible and putting it in contrast to all others..","date":"2013-07-28","mins":"3:32 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-39988","author":"jesterof","post":"Yannick, you do not know what was in Zugibe’s mind. It is what you THINK based on YOUR understanding of what he writes that you attribute to “Zugibe’s mind”. And that is the whole problem here. It is not the first time this discussion arises. You stubborn perception that there is only ONE way the blood clots are formed, only ONE way the wounds are inflicted and only ONE way the imprints on the cloth could be made by the body is simply INCORRECT and it is not the perception of the researchers you are lining up as “on your side”. Neither of them ever stated that there is one way to all of this. In the last 4 5 months I, personally, repeated this and explained in details, at least 3 times. But few weeks passes and you return to the same wrong point of non start. There is no point in further discussion. You remind me Walter Mc Crone : ).","date":"2013-07-28","mins":"10:02 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-39953","author":"jesterof","post":"To “score again” one has to understand what he is talking about. This is not a basketball game, btw. Yannick is NOT. He stubbornly insists on the statements which he attributes to researchers who did not state that, He does not know either anatomy, nor physiology, nor hematology but still insists on his perception of them. Funny to observe this..","date":"2013-07-28","mins":"9:51 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40039","author":"jesterof","post":"Ron : In one of his papers, Zugibe states ‘clearly’ that corpse’s can still bleed, even many hours after death, as he witnessed this many times during his numerable autopsies. The trickle of blood on the lower back is interesting, consider the body already wrapped in the Shroud being shifted from side to side as it is now being ‘bound’, whilst a flow from that particular wound is present and being most likely a mixture of blood and pulmonary fluid, making it very viscous. Probable? I think so. The Shroud itself shows signs of this from other wounds, especially the feet. So not so hard to discern. R Post mortem blood is not the same as whole blood in alive person and it’s characteristics differ. In any textbook in forensic pathology the basics of blood patterns post mortem are described..","date":"2013-07-29","mins":"10:26 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40063","author":"jesterof","post":"Yannick, oozing of post mortem blood is ALWAYS liquid. But it has nothing to do with scourge marks imprints and Zugibe never referred to them. One can’t answer to the questions which are asked from a fault presumption. Why is it faulty I have answered at length previously – you may re read those threads. There are more than one methods of transfer of the blood form the body to the cloth, depending on the wound. The more or less exact markings of the scourge wounds on the back actually are the proof that the body was washed, otherwise the edges would be smeared..","date":"2013-07-29","mins":"5:13 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-29310","author":"jesterof","post":"The other part which is strange that anybody discussing the color of blood stains questions the amount of bilirubin in the blood stream. Clearly, the tortured man will have hemolysis in is blood stream and therefore bilirubin levels are going to be increased, the extent varies individually but it is not going to be traces. Besides, in a shock condition multiorgan failure, including live failure is also a question of when, not if and additional amount of bilirubin, now not from hemolized erythrocytes, but directly from the biliary tree.","date":"2013-04-04","mins":"9:55 am","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"},{"id":"comment-39954","author":"jesterof","post":"P.S. Zugibe IS right. And his conclusions in no way conflict with Barbet et al – only in somebody’s very closed mind as Yannicks, who, for some odd reason thinks it is “either – or”, whereas it is “this AND that”, which was obvious both for Zugibe and all others involved – as physicians, pathologists and other medically trained professionals. Blood imprints on the Shroud are not and can not be made by the same process as the nature of the wounds of the man of the Shroud are not the same and the mechanism and anatomy and physiology of those wound are DIFFERENT. But I guess I takes a medical school and a residency to complete to understand this simple concept..","date":"2013-07-28","mins":"9:57 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40140","author":"jesterof","post":"Yannick Clément : Last note to jesterof: I hope you can agree with me that the idea that the body would have been left alone without anyone touching it for several minutes after a potential washing is far from being probable in the context of the hasty burial of Jesus… That’s important because, if Zugibe was right, this is the only way the after washing oozing of post mortem blood he proposed could have produced a precise mirror imprint on the cloth. Effectively, it’s only if the body would have been left alone for a quite long time (left completely alone… not rub with burial products or any other action that would have produced some touching of the body) that the liquid oozing of blood could have clot enough to become enough “solid” to produce the kind of mirror imprints we see for the scourge marks. Again, such an idea, in the context of the Shroud man, is very improbable… And if we use Occam’s razor, we must conclude that the hypothesis proposed by me and Barbet is much more probable in such a context. No, I would not agree..","date":"2013-07-30","mins":"3:53 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40141","author":"jesterof","post":"“3 If Zugibe’s hypothesis is correct, how can you rationally explain the presence of distinct halos of serum around much of the scourge marks? I wish you could see Miller and Pellicori’s photos. There are NO “distinct haloes of serum” around the scourge marks. There are some indistinct fluorescent bordering areas, which are entirely consistent with some serum seeping out into the fibres by capillary action.” Why on earth SHOULD NOT there be a “serum halo”? plasma is integral part of any bloody material and postmortem blood contains it too. This one “objection” I had addressed already at least three times , but Yannick keeps repeating it again and again and again – clearly he does not know what he is talking about..","date":"2013-07-30","mins":"3:58 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40142","author":"jesterof","post":"“1 If Zugibe’s hypothesis is correct, how can you rationally explain the absence of any smudge on the Shroud, especially in the back region where there was obviously an intense body weight pressure that was active on the cloth? I don’t think pressure in itself will produce smudges” Pressure does not produce any smudges and Zugibe has never addressed the scourge marks and never said they were “oozing liquid blood”. Because they were not. They started oozing to the cloth only when the pressure was applied – in the tomb, after the body was already buried. Scourge marks are the blunt wounds, which means that they have mostly bruising , or hematomas inside the skin – the scratches and rips are there, too, but it is sub epidermal, sub dermal or intradermal hematomas which resemble the shape of the flagrum, not the rips or cuts. The rips and cuts are the outflow route for the hematomas to sip out when pressure is applied while laying the body. The more or less uniform shapes of the scourge marks are the exact proof of this, not the other mechanism. Plus this can happen only if the body is washed, otherwise there would not be any similar shapes but one bloody/dirty cloth..","date":"2013-07-30","mins":"4:08 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40144","author":"jesterof","post":"David Goulet : I think your reasoning is logical and has a good probability of being correct. However may I ask you, and everyone else here, to stop appealing to Occam’s Razor. There are too many unknowns and variables with the Shroud to apply Occam’s Razor. When both sides of an opposing argument can appeal to it it demonstrates its irrelevance to the discussion. Sorry, it’s a small pet peeve. Occam’s razor is absolutely inapplicable to this situation, since it is neither enigmatic, not contradictory, nor either or from one way or the other, and there are many other possibilities which do not contradict each other. Patterns of blood staining is one of the fields of forensics and forensic pathology. Why does Yannick fail to understand this and makes it a detective story ( which it is not) is hard to grasp. Because he is everything, but dumb : ).","date":"2013-07-30","mins":"4:16 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-39957","author":"jesterof","post":"Hugh Farey : Next, Yannick finds an irreconcilable difference between “Barbet, Adler, Lavoie and others” who think that the scourge marks were caused by a transfer of exudates from still moist or remoistened blod clots, and Zugibe, who thinks that the clots were dry and were re activated by washing. I don’t understand the difference. Because there is no difference. You can re moisten the clots by washing the body and if taken into consideration that the scourge wounds are mostly blunt wounds which cause supepidermal/intradermal/hematomas which are different from the clots formed by a clean cut or punch, then washing of the blood/sweat/dirt cover from the body is almost necessary to result in a relatively similar shaped scourge wound markings on the cloth..","date":"2013-07-28","mins":"10:26 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-39956","author":"jesterof","post":"Http://www.shroud.com/pdfs/ssi08part3.pdf the description by Lavoie of the experiment is based on the false premise – that the blood clots in the wounds after scourging are hematologically identical to the clots formed after WHOLE blood withdrawal from the vein by vaccutaine tubes. There is a fundamental difference between them, though. And the anatomy/pathology of the wounds are totally different – the clear cut wound or a punch wound of the experiments differs from the concussion/blunt trauma wound of the scourging. The clear markings of the scourging wounds actually prove that the body had to be washed in order for them not to have smeared edges..","date":"2013-07-28","mins":"10:15 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40287","author":"jesterof","post":"Yannick Clément : My answer: What you described is not at all related to the hypothesis developed by Zugibe. Let’s consider this as a third one ok? Here’s the sure proof of this: Zugibe state this in his paper: “However, if the body was washed, the DRIED BLOOD around the wounds would be removed causing an oozing of bloody material within the wounds resulting in the production of relatively good impressions of the wound.” That’s the heart of Zugibe’s hypothesis. This IS NOT at all the same scenario as the one you described because Zugibe is clear about the fact that he believed there was already DRIED BLOOD (blood clots in sum) on the skin of the Shroud man when his body was carried to the tomb. Barbet, Lavoie and Adler thought the same but had a completely different hypothesis for this transfer of blood material from the skin to the cloth… And it was also different than your own scenario that seem to involved a sort of superficial bleeding UNDER the skin without any cuts made by the metal balls or the skin bones at the end of the leather tongues of the flagrum. Question: If your hypothesis was right and a certain pressure would have been needed to produced the precise dumbbell shape marks on the cloth, then how can you explain those located in the frontal part of the body where there was most certainly no pressure whatsoever present on the cloth and on the wounds??? Why should it be related to Zugibe if he did not address the scourge marks at all?.","date":"2013-08-01","mins":"8:28 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40288","author":"jesterof","post":"” And it was also different than your own scenario that seem to involved a sort of superficial bleeding UNDER the skin without any cuts made by the metal balls or the skin bones at the end of the leather tongues of the flagrum.” AH! FINALLY! you get it : ) because those types of wounds which are called BLUNT do cause bleeding “under the skin” not outside – it is called HEMATOMA. Or bruise. Scratches over those bruises will exist – not uniform, not equal, some cuts, some lacerations, some without any visible disruption. I’ve repeated this for the last 4 months and finally you are paying attention ))))) On a side note – since you clearly do not listen to anybody, but yourself, and this last revelation proves it, I really am tired to continue this “discussion” which is more like you standing on a podium and having a speach – da capo al fine – and it is all the time the smae thesis on your part and you are wrong ; ).","date":"2013-08-01","mins":"8:35 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40370","author":"jesterof","post":"You are as closed minded as one can be, becaseu of your IGNORANCE “halos of serum” are not proving anything. Zilch. Nada. Zero. Plasma, or as you call it ,serum is an integral part of blood and it does not disappear magically upon death. It is present in ALL bloody fluids – the whole blood, the hemolized blood, the blood tinged sputum ( which is plasma too), the bloody lymph, the bloody exudates/transsudates of body cavities, the bloody urine, bloody pleyral effusion and so on. LEARN the BASICS FIRST if you want to be taken seriously. One can be mistakened ONCE, but you have been shown your ignorance so many times, yet you stubbornly persist on “your conception”. It is WRONG and it is wrong simply because you are totally ignorant on blood physiology. So, before you proceed in getting on that preacher stand of yours, do us all a favor – and study the basics..","date":"2013-08-03","mins":"4:44 pm","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-35633","author":"jesterof","post":"The “blood expert” can be referred only to forensic pathologist or archaelogic pathologist but not to a physician, since hematologist is usually not the person who knows how to distinguish blood from other fluids on the surfaces , but the one who is an expert in diagnosing and treating blood dyscrasias and blood oncology. The ability to recognize blood and it’s patterns of staining/drying in most operative room physicians and/or other medical specialists connected to body cutting is mostly empirical and should not be referred as “blood specialist” Blood as it’s functions/abilities is a part of anatomy/physiology/clinical medicine so some of it’s properties should and is known to all doctors – therefore it is virtually immediatelly obvious for somebody with medical degree that putting the conclusions of Adler vs Zugibbe and anybody else considering blood stains and the origins of them as contradictory ( serum from clots vs serum or plasma from blood) as artificial..","date":"2013-06-01","mins":"1:22 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35635","author":"jesterof","post":"Yannick Clement : I think this kind of transfer could have helped to “stabilise” the bilirubin (which is normally an unstable compound) inside the bloodstains. What particular transfer mechanism are you talking about? If there is an elevated level of bilirubin in the whole blood then plasma part ( or as you call it serum) will have bilirubin as well – people who have jaundice often have yellowish tears and saliva ( yeas, those bodily fluids are based on on the plasma composition).","date":"2013-06-01","mins":"1:33 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35787","author":"jesterof","post":"Maybe the body was not washed VIGOROUSLY….","date":"2013-06-02","mins":"6:55 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35785","author":"jesterof","post":"Yannick Clément : I think I was clear about that. The very particular transfer of the blood was first described by Barbet in his book and was independently confirmed by Adler later on and it is this one (which account for the vast majority of the bloodstains): A transfer of exudates of still moistened or, in other cases like the scourge marks, of re moistened blood clots and not a transfer coming from liquid blood (post or pre mortem), except probably for some stains in the feet area which came from a post mortem blood flow from the still opened holes of the feet (Barbet’s conclusion). I hope it is clear for you now. But the scourge wounds usually do not have clots – by the very nature of the wound. That’s why I’ve told you that you will have a clear clots from the thorn wounds and from the crucifixion sites – because blood clots usually form where the whole blood flows, it is not usually forming as a whole blood clot in the other types of wounds. Have you ever scratched your knees after a fall in the childhood? those surface scratch wounds would not produce a blood clot ( as you would get from the thin scratch by a knife) it would rather be a a yellowish scab( because it would be mostly plasma involved) – and the marks from those will be different if you transfer the to the cloth..","date":"2013-06-02","mins":"6:54 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35789","author":"jesterof","post":"Just ti add – the scourge wounds will have intradermal, subdermal hematomas and superficial scratching of the skin, some will have ripping of the skin all the way, some won’t – those vary in the traumatic effect they produce over the body and therefore the fluids coming from these wounds will be different combinations of blood and plasma..","date":"2013-06-02","mins":"7:01 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35802","author":"jesterof","post":"Yannick Clément : Because they were caused by metal balls (and based on my own experience of a wound caused by a tree branch that really looked like a scourge wound on the Shroud), there’s no reason for me to expect that most of these scourge wounds caused a important blood flow out of the wounds, except, as I said, for the leather tongues of the whip and it is truly possible that these blood flows were completely (or in good part) washed away later on when the Shroud man was on the cross, which would easily explain why only the blood that had filled the scourge wounds created by the metal balls stayed there and were able to eventually leave mirror imprints on the cloth… All this is truly rational to me and it follows closely what Barbet said in his book. Your own experience? have you been scourged or have you been scourging someone to observe the wounds? those were the blunt wounds with heavy object – those by definition produce very variable type of wounds and will have ripping of the skin, obviously to produce bleeding, by mostly hematomas and secondary whipping of the plasma, not whole blood..","date":"2013-06-02","mins":"7:44 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35790","author":"jesterof","post":"Kelly Kearse : Yannick Clément : It’s not because I don’t have all your diplomas that I’m dumb… And since I follow closely Adler and Barbet’s conclusions about the bloodstains, I think this comment of you (which is based on another comment of jesterof) can be seen as a critic against these 2 great researchers that are much greater and important than you will probably ever be my friend. Seriously, I don’t think that saying that most of the bloodstains come from exudates of blood clots, that the body wasn’t washed vigorously and that a very high level of bilirubin is most probably the best explanation for the reddish aspect of the color of the blood (all of these conclusions can be easily drawn from Barbet and Adler’s wrintings) can be seen as “not understanding the question” of the bloodstains that we see on the Shroud. Yannick, It’s not a matter of being dumb it’s just a matter of trying to understand exactly what you talking about. You throw something like this out there a mega block of quotes post I am not sure where you want to slice the cake there’s a lot that could be talked about and that has already been talked about If you going to invite someone by name to comment, tell them specifically which parts you want them comment on when you ask for my impressions, it is difficult to make a sweeping statement to cover specific points. A critic against these 2 researchers, really? Totally unsure how you connect the dots there. Much greater and important than I will probably ever be? My friend? This is warranted? Wow. This..","date":"2013-06-02","mins":"7:08 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35803","author":"jesterof","post":"Which as a result would not produce blood clots as seen with the wound with whole blood flow..","date":"2013-06-02","mins":"7:46 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35804","author":"jesterof","post":"OK, here you go http://www.ncbi.nlm.nih.gov/pubmed/21351412 just to look into what am I talking about ( the first link on the web by blunt trauma).","date":"2013-06-02","mins":"7:49 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35810","author":"jesterof","post":"Yannick Clément : My own experience proved that your skin can be scartched by some object, that the wound can be filled with blood and that, at the same time, there can be no blood flow at all. If the wound is only superficial (remember that the scourge wound were cause by metal BALLS, not metal claws like in the movie of Mel Gibson!), then it is truly possible that some blood could come to the surface without any blood flowing out of the wound. That’s what my own experience proved. LOL Yannick, scratching own skin is not the same as scourging. Read the ling I’ve provided. There other forensiic artiles on the web as well.","date":"2013-06-02","mins":"8:08 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35811","author":"jesterof","post":"I don’t why jesterof, you don’t believe that some blood could have been left inside these wounds to fill them, which could have lead to the formation of blood clots with a dumbell shape like the ones we see on the Shroud. To me, these particular wounds don’t present any problem at all when it comes to think of the way they were formed on the cloth… because blood filled wounds( hematomas) is NOT THE SAME as blood clots..","date":"2013-06-02","mins":"8:10 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35818","author":"jesterof","post":"Yannick Clément : Again, my experience PROVED (I saw it and believe me, this is not bullshit) that a superficial scratching of your skin can be filled with blood, that this blood can stayed there without causing any blood flows, that this can produce a blood clot and, later on, that such a blood clot can produce on a piece of fabric the kind of dumbell shape imprint we see on the Shroud. If that happened to me that way, I don’t know why this would be impossible that it could have happened the same way for the Shroud man after his scourging with metal balls (which could easily have produced the same kind of superficial scratching as the tree branch that caused my wound)! your experienc does not prove anything as scratching is not equal to a blunt wound of scorge device.","date":"2013-06-02","mins":"8:26 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35614","author":"jesterof","post":"What are your EXACT questions, Yannick? Can you formulate them 1) 2) 3)? It looks like ( for me) that you do not understand the question yourself or do not understand what others might be asking, because you keep repeating the same postulates you’ve mentione before and which have been answered already..","date":"2013-06-01","mins":"11:15 am","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-35981","author":"jesterof","post":"Yannick Clément : I think there are two very compelling pieces of evidence that exist on the cloth which strongly suggest that Barbet was correct about the fact that the scourge marks on the Shroud were all caused by exudates of humid blood clots. Here they are: 1 ALL the imprints show the SAME PRECISE SHAPE. 2 Almost every scourge wounds are SURROUNDED BY A HALO OF SERUM. He very issue that ALL of the imprints are THE SAME PRECISE SHAPE actually proves Zugibes’s theory of washing the body before the burial almost perfectly. I’ll let you figure it out – WHY. Hint: It does not conflict with the mechanism of transfer : ).","date":"2013-06-03","mins":"8:57 pm","url":"https://shroudstory.com/2013/06/01/the-orphaned-manuscript-and-the-color-of-blood/","cat":"blood_studies","title":"The Orphaned Manuscript and the Color of Blood"},{"id":"comment-29403","author":"jesterof","post":"Http://www.iabpa.org/uploads/files/iabpa%20publications/March%202010%20 News.pdf even by brief scrolling of the text it is clearly visible the difference in color of different stains – and ALL are blood.","date":"2013-04-04","mins":"6:50 pm","url":"https://shroudstory.com/2013/04/04/blood-clotting-and-the-strange-case-of-brother-hirudo/","cat":"blood_studies","title":"Blood Clotting and the Strange Case of Brother Hirudo"}]
