[{"id":"comment-33276","author":"jesterof","post":"Foodie, the besserwisser :LOL:.","date":"2013-05-08","mins":"5:48 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-34969","author":"jesterof","post":"Kelly Kearse : “The hypothesis by itself is valid. The problem is – I do not see those pictures as “too red” They are NORMAL. As they are supposed to be – to my eyes and I am used to all kinds of blood stains – from whole blood, from blood stinged bodily fluids and so on. To dried stains also. Obviously, not ages old, but if the stain form different body fluids with addition to blood do stain in different color when they are fresh or just have dried a day ago, I do not see any reason why should not they differ centuries later as well.” I don’t think you have to go to centuries later, but I think you have to consider things past just a few days. The general consensus of most forensic scientists is that as blood ages, over time, it becomes brownish to black in color. That is from being used to all kinds of blood stains in their line of work fresh, few days old, months old, years old, etc. I don’t want to speak in their place, but I believe they might consider that normal as it is supposed to be I do respect your opinion, but therein lies the dilemma the time component is viewed as an important one But it IS brown. When you look upon it on the photos, or in the building – it is normal brownish color and not “too red”. As old blood is supposed to be It changes color (brightens) only upon exposition to bright sunlight or UV light – which explains immediately why bilirubin was brought up at all – it is bilirubin which brightens it up, because it reacts with UV light. Thanks to Louis’s link I finally have had the answer to my question and I was right ( in terms that I do not see those stains “too red” at all, because they are not on the presented photos)..","date":"2013-05-26","mins":"9:23 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34973","author":"jesterof","post":"Thanks, Yannick, when I read about Barbet I recalled one of the threads you have been talking about him..","date":"2013-05-26","mins":"9:36 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34978","author":"jesterof","post":"And if he never mentioned color being “too red” and he is a physician, that means he did see those stains as normal stains and nothing more….","date":"2013-05-26","mins":"9:42 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34982","author":"jesterof","post":"Agreed. My hat is off to them..","date":"2013-05-26","mins":"9:53 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34984","author":"jesterof","post":"Would bilirubin be stable over this amount of time? Now, that is the question : ) well, if it was found in the stains – then it has stayed there. Why and how – I don’t know. Yhe treatment of ALIVE jaundiced newborns and fixed stains on the Shroud – is a totally different issue. You do not have to expose the babies to the UV light – bilirubin is cleared from the blood all the time by the very body – it is one of it’s functions. UV light just help to prevent the kernicterus by changing the bilirubin from it toxic form to non toxic ( to the brain) 2. If the Shroud was taken out and uv light was specifically, uniquely filtered out, you would observe a “shift” in appearance from red to brown? If the epsilon stain were examined as such, one side filtered, one side not, you would see a brown/red split? That I do not know – one has to read the description of the experiments for the details. Theoretically if one puts a shield unpermeable to the UV light and then one part is irradiated and observed and the other as well – there should be a split. I do not know how practically possible is it to accomplish this, though – the stains are not large.","date":"2013-05-26","mins":"10:02 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34981","author":"jesterof","post":"Yannick Clément : The main question that remains unanswered is this: Who started all this “blood is too red” issue? Since Barbet published his book around 1950 and never address that issue, I’m sure this so called “problem” (which is like a Pandora’s box) was published later on, probably before STURP went to Turin. Maybe that’s why some members of STURP had some preconcieved ideas about a potential problem with the color of the blood… That would explain many things. I really would like to know who started this whole issue. Well, by Louis’s link one can assume it was actually described after the Shroud being outside the Cathedral for Exposition in 1931 in a bright sunlight by many – some of the witnesses were able to see the Shroud later and were even surprised it is not that bright anymore ( the above mentioned Lagrand), but others did not and since most of the people are not medical doctors and often do not pay attention to such details, the legend of being “too red” rolled out into the masses : ) So you are right, some memebers of STURP team might have had the preconcieved ideas about the coloring. However, one has to read the exact words told by STURP members in order to judge, because I suppose they did know it is “too red” only under special conditions – as it was known to researchers before – the folks repeating the idea did not bother to remeber the difference and the words ( probable) ” it is very bright upon sun light exposure” changed just to “it’s too bright” – this is a standard psychological turn, since if most of the people won’t consider “sunlight ( or UV) exposure” to be the most pertinent part of the sentence. Just speculating : ).","date":"2013-05-26","mins":"9:52 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34986","author":"jesterof","post":"Likewise :) Good night, everybody. It was a great discussion..","date":"2013-05-26","mins":"10:07 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35018","author":"jesterof","post":"2 A. In the other link provided by Louis (Goldini article), the last part of the paper discusses a model in which the differential appearance of the blood color “observed under special circumstances” (sunlight, without protective glass) is a result of a molecular change in the blood, some type of previous “neutron upset” that facilitates subsequent penetration of UV rays. It’s been proposed by some investigators that the blood was affected during the process that created the image. The “upset” by neutrons is referred to an experiment conducted by Italian group of researchers. As I understand they do not used the Shroud samples, they irradiated blood samples with a high level of bilirubin by neitrons. After that they tested one sample in the oven heating and the other one by UV light ( both were irrdiated by neutrons first). The first did not change it color, the other did in 30 minutes to bright red. They conclude that irradiation “upset” the blood and that is why the color changed. One might agree with this or not, but the other experiments described above have shown that the blood sample with bilirubin changed the color upon UV irradiation without any “neutron upset”. Personally, I do not think any “neutroen upset” has anything to do with the blood color change..","date":"2013-05-27","mins":"11:48 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35019","author":"jesterof","post":"2 B. In Jackson’s 1991 paper (“An unconventional hypothesis to explain all image characteristics found on the Shroud image”), he proposes that “it is reasonable to ask if analogous chemical changes [concurrent with image formation] might also have been induced in the blood.” He notes that “the off elbow bloodstain is brown, whereas the blood flow to which it is connected on the forearm is red, suggesting a possible chemical difference between on and off image bloodstains” The idea is also discussed in the 2006 paper by Fanti (“RGB analysis of the blood color: on image and out of image”), where the conclusion is made that “the on image blood color is really different from that of the out of image blood”. Any comments/thoughts here? Do you see a relative difference in this area? If so, could this be explained by physical, natural effects, different area/background of cloth, etc.? Does it make sense that the proximity to the body could be an important factor relative to the color perception of the blood? This questions I am not able to answer, because I did not read the article you are referring to and can’t remember the photographs to prove the thesis of the color difference depending on stain placement relatively to the image. The difference in color might be so slight that it is visible only upon direct visualisation, and is lost through screens and photos..","date":"2013-05-27","mins":"11:52 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35020","author":"jesterof","post":"Figures 10 13, Table 1 discusses a bilirubin experiment & blood color. This was performed by dripping whole blood onto cloth. The comment is made that in this experiment, the bilirubin is mainly composed of conjugated bilirubin, whereas in Adler’s hypothesis most of the bilirubin would be in the free form. Adler is correct. In the hypothesis where bilirubin comes as a result of hemolysis indirect ( unconjugated) bilirubin is more abundant than conjugated ( direct). Bilirubin is conjugated to hialuronic acid in the liver..","date":"2013-05-27","mins":"11:55 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35023","author":"jesterof","post":"Thoughts on the results? Also, any affect, influence of differential fluorescent/absorbance of uv with conjugated & unconjugated bilirubin? Does conjugated bilirubin fluoresce more/less with uv relative to unconjugated bilirubin? Would this support the idea of uv influence on appearance of the Shroud bloodstain color? Physiologically, (for the Shroud man) we are dealing primarily/almost exclusively with free bilirubin? Since UV light is used in treatment the newborn jaundice, which nature is hemolysis and therefore an unconjugated bilirubin one may make a conclusion that it is this form of bilirubin more sensitive to the UV irradiation. Shroud man had bilirubin from hemolyzed erythrocytes as well, so it will confirm the changes of the color. In terms of the article by Swensson – he alos makes the fundamental mistake assuming the color of the stain is different observed upon normal conditions. But as we already know, it is brightening the color ONLY upon exposure to UV light, which Swennson did not conduct. Therefore his co clusions are irrelevant. The person in his experiment was a liver failure patient which is mostly conjugated bilirubin, but it doe not matter, since he omitted the crucial point in the experiment – irradiating the spots with UV light..","date":"2013-05-27","mins":"12:17 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35021","author":"jesterof","post":"Everything else – later. Have to run..","date":"2013-05-27","mins":"11:55 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35024","author":"jesterof","post":"4. A comment on the Rogers’ experiment of spotting blood onto untreated versus Saponin treated cloth in relation to blood color. Saponin treated samples showing persistence of red color, untreated samples don’t. The bilirubin content of the samples is presumably in the normal range and regardless, the blood samples are the same, simply divided in half. Why the difference? because of the chemical reaction with saponin ..","date":"2013-05-27","mins":"12:20 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35025","author":"jesterof","post":"I have always found these results interesting even though Saponin is hemolytic, and therefore is going to increase the amount of hemoglobin that’s released relative to the control group, eventually any released hemoglobin will oxidize to a brownish color; and the red blood cells in the control group will dehydrate and rupture and their contents will be released as well, essentially evening things out. Free hemoglobin from the hemolyzed erythrocytes will react with saponin residues, or other elements, as was proven by Dian Soran in 1977 ( described in the Swansson article). This chemical reaction will either slow or change the process of oxidation. Free hemoglobin oxidize to brownish color. Hemoglobin something else complex can oxidize to a different color..","date":"2013-05-27","mins":"12:25 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35026","author":"jesterof","post":"Everything is spilling out. Hemoglobin, bilirubin could hemoglobin, the porphyrin ring be split by detergent action to create biliverdin/bilirubin? No, I do not think so. First of all there was already bilirubin in the blood and hemolysis as well – because of the trauma and process called rhabsomyolysis – and therefore I would suspect there would be myoglobin in the blood stream as well – the way myoglobin interferes with the color and process of oxidation – I have no idea – that’s to be tested. So by the time the body was covered by the cloth – there was enough bilirubin in the blood and other products as well. Why I assume there would be rhabdomyolysis? well, the extreme torture of the man of the Shroud together with dehydration will certainly result in such a process. You have to realize, that all the described is not occurring instantaneously, including metabolizing of hemoglobin to bilirubin – and the amount and time and conditions are all dependet on individual characteristics – one person have the fulminant process, whereas the other one will have it much slower. One will have an extreme hemolysis, the other one might have the kidney failure due to dehydration more pronounced, the third might have heart insufficiency – and all three subjected to the same torture..","date":"2013-05-27","mins":"12:34 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35065","author":"jesterof","post":"What about them?.","date":"2013-05-27","mins":"8:45 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35027","author":"jesterof","post":"As a final remark – I do not think saponin was the cause of hemolysis, but it might have been the additional factor for the “fixing” the hemoglobin – in a chemical reaction with it and therefore impeding the oxidation process. It might have also had the effect on bilirubin stability – just a thought..","date":"2013-05-27","mins":"12:37 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35076","author":"jesterof","post":"Giorgio : Is this blood? Madder rose? red ochre? The yellow amorphous tubular flaked like material resin? 6 BF and 3 CB are both from the spear wound. Sorry, that question is very far from what I feel comfortable with. I am not a pathologist who views slides every day for a living. In this instance you may need a forensic pathologist.","date":"2013-05-27","mins":"9:37 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35132","author":"jesterof","post":"I really think this guess of mine of what have started the “blood is too red” (or too bright) issue has some good chances to be very close to the truth. Jesterof, what do you think? From the information we have and know ( which might not be the whole information) it does seem as a chain of events which happened..","date":"2013-05-28","mins":"4:08 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35142","author":"jesterof","post":"Yannick Clément : As I said, if this is correct, it’s very sad that Legrand never set the record straight about that… And here’s another question for you: In a previous comment (which gave me great lights about the whole issue), you mentioned this: “It (the blood on the Shroud) changes color (brightens) only upon exposition to bright sunlight or UV light – which explains immediately why bilirubin was brought up at all – it is bilirubin which brightens it up, because it reacts with UV light.” Taking that into account, here’s my personal opinion on the whole “blood is too red” issue: In the end, the reddish aspect considered too bright of the blood of the Shroud when it is exposed to sunlight (or another UV source) could be due to a level of bilirubin in the blood much higher than normal, just like it was described in Adler’s hypothesis. So, the question is: Do you think pretty much the same as me? Or did I miss something from all the numerous comments you wrote in the last days? YES. I think exactly the same way. I am a little puzzled that bilirubin which is generally not a stable compound is still there, but it might something to do with it being “fixed” by reaction with something – maybe with saponin ( this is pure speculation, though)..","date":"2013-05-28","mins":"6:07 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35145","author":"jesterof","post":"Http://www.acheiropoietos.info/proceedings/Svensson Web.pdf This is the link provided by Kelly Kearse and you can find the description of the experiment By Diane Soran who washed the cloth in Saponaria weed and tested the hemolytic effect on red blood cells – the stains remined red even after 26 years. If Saponaria has conservation abilities this might also be true for the biliribun – after all it is a hemoglobin metabolite..","date":"2013-05-28","mins":"6:16 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35162","author":"jesterof","post":"In the experiment by Svensson, “he omitted the crucial point in the experiment – irradiating the spots with UV light”. In the Soran experiment is interaction with Saponin substituting for UV irradation, here, or is it assumed that sufficient uv exposure was present when the experiments were performed? I am talking exclusively about Soran, Swennsonn’s missing the UV irradiation did not yeald any results. Soran did not irradiate her spots by UV light, her spots were the result of hemolyzed erythrocytes ( because of the saponin conservation). At least that is what one gets from the description in the article by your link.","date":"2013-05-28","mins":"10:11 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35164","author":"jesterof","post":"Finally, here’s a reference (non Shroud related) on Saponin treatment & effects on erythrocytes: http://www.sciencedirect.com/science/article/pii/S0065128104700136 OK, then it is proven independently that it does hemolyze erythrocytes by destroying their membranes ( duh, how would you otherwise hemolyze them? – sorry, couldn’t resist : ) The question is – does it also bind the hemoglobin and prevents oxidation as one would assume from the short paragraph on Soran.","date":"2013-05-28","mins":"10:14 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35166","author":"jesterof","post":"“Have Figures of the Soran results ever been published, or presented at a conference that was videotaped if so, does anyone have a reference? Not doubting the findings, have heard this referred to in the literature several times, have always been interested to see the actual results.” Couldn’t find anything on the web except referrals to her experiment. However, the Springer link is an independent proof of saponin hemolyzing abilities.Unfortunately, one can’t read the whole article – there could be further information which might answer at least partially the question of interest for us. “Regarding the conservation abilities of Saponin, is this in reference to an interaction with the bilirubin or bilirubin products directly, or the conservation properties of inhibiting bacterial, fungal growth, and thus, degradation, or both? ” Chemical stability only. Just postulating, since it looks like saponin stabilyzes hemoglobin, it also can react with bilirubin ( which is a hemoglobin metabolyte down the road, with a similar chemichal structure ).","date":"2013-05-28","mins":"10:32 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35168","author":"jesterof","post":"Kelly Kearse : jesterof : In the experiment by Svensson, “he omitted the crucial point in the experiment – irradiating the spots with UV light”. In the Soran experiment is interaction with Saponin substituting for UV irradation, here, or is it assumed that sufficient uv exposure was present when the experiments were performed? I am talking exclusively about Soran, Swennsonn’s missing the UV irradiation did not yeald any results. Soran did not irradiate her spots by UV light, her spots were the result of hemolyzed erythrocytes ( because of the saponin conservation). At least that is what one gets from the description in the article by your link So, uv is not absolutely necessary for the red color? Of course not. There could be different mechanisms – I am speaking in general here – not specifically about the Shroud. Specifically in the Shroud case it looks for me that it is bilirubin related since the initial reference to the “too red” was under UV exposure and then mentioned that the color darkened. There is also could be a combination of factors – we don’t know exactly by which mechanism ( chemical reaction) did the color reamined red in Soran’s case. Maybe it is slowing the oxidation process but not totally obliterating it – for hemoglobin and permanently stabilizing bilirubin – then ( I am grossly speculating here) for the Shroud situation it would have had double effect – stabilized bilirubin so it is still there in quantities enough to produce reaction under UV exposure and reaction with hemoglobin which might have faded with time, but changed the oxidation process.","date":"2013-05-28","mins":"10:38 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35301","author":"jesterof","post":"But I have to repeat my previous question to you jesterof: Don’t you think that some other substances that could have been present in the traumatic blood of the Shroud man at the time of his death could have played a role (maybe crucial) in helping the bilirubin to get preserved in the bloodstains until today? Is it possible that a high level of urea, of lactic acid or of some other substances like that (substances probably present in the blood in the context of a tortured body) could have been the main cause of the preservation of bilirubin until today? It IS possible. However I do not know about any experimental proof of that. The blood in normal conditions is full of interesting possibilities, not to even to mention a gazillion combinations of reactions in the blood of person under stress and upon death. But it has to be checked to verify..","date":"2013-05-29","mins":"6:37 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35261","author":"jesterof","post":"The trauma caused the bilirubin level to increase – we all have some normal level of it as erythrocytes are not immortal and hemoglobin from them has to be metabolyуzed. Iunder traumatic condition one has more erythrocytes to break down and release hemoglobin into the bloodstrem – therefore bilirubin levels rise ( it is hemoglobin metabolyte). So initial high level of bilirubin in the bloodstrem of the Shroud Man is due to trauma. But bilirubin is generally unstable compound so in order to stay it should somehow be preserved – maybe by saponin? I don’t know and I don’t think anybody researched the issue ( I looked into that).","date":"2013-05-29","mins":"1:19 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35302","author":"jesterof","post":"Yannick Clément : Oh by the way, I wonder if the fact that the bloodstains were made of exudates of blood clots instead of whole blood could not also be another possible explanation for the probable good preservation of the bilirubin in these bloodstains. What do you think jesterof? Is it possible that the very particular nature of these stains could have helped for the preservation of the bilirubin until today? of course there is – there is a lot of possible combinations – pleural fluid with addition of blood, lymph with blood, interstitial fluid with blood, urine with blood, gastric contents with blood, mucous with blood. I did write about it in the thread about br.hirudo. I order to find out one has to learn what stabilizes bilirubin in a blood stain..","date":"2013-05-29","mins":"6:41 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35389","author":"jesterof","post":"Yannick, I can guarantee you that lactic acid, urea and the whole bunch of other substances were there in the bloodstream, as all of those are present in the bloodstream under normal conditions as well. Some of them do increase, some decrease under specific conditions of various illnesses and situations, some are even used as markers of certain conditions. It does not to be tested to prove they were there – it’s an axiom, if the stains are blood. We don’t even know if simple drying of the blood does not serve as a preservation method. I tried to search the web to find out how do labs ( which offer the commercial kits) preserve bilirubin, but couldn’t find anything for longer than 2 3 weeks – if we d not know, it does not mean there is not known method or substance or else for bilirubin in the blood to stay stable. I do not think it is such an enigma, simply the issue is approached only from the Shroud point of view and it should be approached from lab technology point of view. Personally, I would like to find out WHY the blood stains on the saponaria treated cloth in the experiment stained in a bright red color and that stayed that way for 17 years. This question is not answered and one can not explain it just by bilirubin amount, because there is no time for the blood in the sample to metabolize the hemolyzed hemoglobin to it’s metabolites. But it does stay red, becasue of hemolysis – so is it enough? I mean do the broken erythrocyte membranes serve as a preservation material against oxidation? When I read the materials on the experiments described I am very often left with impression – why was only this question asked, why not the logical next one, or was it asked an not reported?.","date":"2013-05-30","mins":"5:15 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35303","author":"jesterof","post":"Yannick Clément : One last reply to jesterof: In the end, is it also possible that, even though bilirubin is pretty unstable, that it could be preserved NATURALLY (without the help of anything special) in certain circumstances, especially if the bloodstained cloth has always been carefully preserved over the centuries? Here, I think particularly about the very probable fact that the Shroud had been very rarely exposed to open air and, more importantly, to sunlight… In such a context of a cloth well preserved and almost always kept in the dark and in a container of some kind, don’t you think that this could have been enough good conditions to have naturally preserved the high level of bilirubin inside the bloodstains for all these years? Good question, don’t you think? Yes, it is a good question. I don’t see any reason why bilirubin should not be possibly preserved by allnatural means ( I actulally never even thought about anything suprnatural, since there are tons of possibilities). Absence of light will slow bilirubin breakdown, but we still have the issue of very long time… On the other hand, all references to bilirubin instability I know are to the bilirubin in liquid state, so, theoretically it is possible that simply drying will change it instability… But again – I don’t know from the experimental standpoint and I do not have possibilities to test it. I did not find any web references to bilirubin stability/instability upon different physical state – I checked it when I was participating in the thread about br. Hirudo.","date":"2013-05-29","mins":"6:46 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35390","author":"jesterof","post":"27 years.","date":"2013-05-30","mins":"5:16 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35489","author":"jesterof","post":"No, it can not help, because I know this and my question is not about how Saponaria works in hemolysis, but what makes hemolyzed blood stay bright. In other words – does hemolyzed blood stay brighter vs not hemolyzed? And if so, is it only the hemolyzed blood by Saponaria washout or any way of producing hemolysis will work the same way..","date":"2013-05-31","mins":"2:21 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-35510","author":"jesterof","post":"Yannick Clément : I guess this would need more testing right? of course. That’s my point.","date":"2013-05-31","mins":"4:07 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34824","author":"jesterof","post":"Louis : Giorgio, we have agreed about contamination. As for the colour of what is said to be blood stains, the Australian Dr.Loy is reported to have affirmed that the blood of people who die after a trauma is very red. Do you have a link? I have stated before and stay by that – the wild perception of “very red” is just subjective opinion, and the color of the blood STAINS could vary depending on the multiple factors..","date":"2013-05-25","mins":"9:46 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34832","author":"jesterof","post":"Louis : You’re welcome, Jesterof. It would be nice for you to share what more you can discover with us. A lot :) One question – from the “blood threads” I had the impression that the description of the “too red” is actually about one stain in the forehead. Now here I learn that it was Walter Mc Crone who actually first expressed the surprise, but if he was viewing particles of ferrous oxide and not blood, his description of color is irrelevant. Upon viewing the photographs of the Shroud I do not have the impression that any of the blood stains are “very red” and as is confirmed here by the response of Mr. Maloney the color obviously differs depending on the light source and that nobody have seen the Shroud in the bright sunlight. Can you clarify for me, please, which blood is deemed to be “too red” – one stain on the forehead or is it something else?.","date":"2013-05-25","mins":"10:13 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34829","author":"jesterof","post":"Louis : Jesterof, yes I have. It is the book “The Blood and the Shroud: New Evidence that the World’s Most Sacred Relic is Real”. Thank you, Louis, I’ve already deciphered what is meant by this in more common terminology for me : ).","date":"2013-05-25","mins":"9:59 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34828","author":"jesterof","post":"“Traumatized blood” is, probably, the term used by Mr. Maloney to describe blood hemolysis and yes, hemolysis can occur after trauma, or as a a part of rhabdomyolysis as well The result is very high levels of bilirubin ( as a metabolite of hemoglobin wich is now free in the bloodstream since the erythrocytes are broken ( hemolyzed).","date":"2013-05-25","mins":"9:58 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34871","author":"jesterof","post":"To clarify, do you believe that the color of the blood on the Shroud is not unusual, period, for any dried, aged blood, or that the color of the blood on the Shroud is not unusual for someone that had undergone such experiences of physiological & psychological stress? Yes. Fro the different photos I see over the web I do not see any unusual “too red” stains on the Shroud. There seems to be the idea that perception of the blood color can be highly influenced by the conditions in which one is viewing it, particularly when photographs are used. Yes, it is not only the perception from above it is reflected in the discussion iin books ( I can not tell you which ones, but while on that previous thread I was researching the issue and it appears that the light used is very important).","date":"2013-05-26","mins":"9:20 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34894","author":"jesterof","post":"Well, if somebody was an expert exactly on the discussed area then it won’t be prudent to intervene. I am not an expert on the ancient stains, but in the previous thread and again here I can also tell that I do not see any reason for the stains which are called “blood” but in reality not necessarily are the stains from the whole blood, should not differ in color – the components of the fluid staining the cloths vary, so will the color..","date":"2013-05-26","mins":"3:28 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34873","author":"jesterof","post":"Was wondering how a bilirubin level 500 times concentrated would compare relative to the levels observed in a patient suffering liver failure or jaundiced newborn? I realize that these are different scenarios that are apart from trauma & torture leading to death, but just looking for something to understand as a relative comparison. Also, in terms of laboratory experimentation to create a blood simulacra, are these the levels that are necessary? Adler remarked in one of his spectra descriptions using finger stick blood samples, that the amount of protein (albumin) they added was too high, so this would be in excess of that. Any numbers on bilirubin levels for normal versus elevated versus extreme traumatic death? the normal level of bilirubin depending on the system used is Direct bilirubin: 0.1 mg/ dl to 0.3 mg/ dl (1.7 mmol/ l to 5.1 mmol/ l) Indirect bilirubin: 0.2 mg/ dl to 0.8 mg/ dl (3.4 mmol/ l to 12.0 mmol/ l) Total bilirubin: 0.3 mg/ dl to 1.0 mg/ dl (5.1 mmol/ l to 17.0 mmol/ l) NIH.gov gives the upper limit of total level as 1.9 mg/dl Liver failure can be with both very high and very moderate bilirubin levels, level for one patient might be nit that toxic for the other and yellowness of the skin and mucosa differs as well. Bilirubin level 500 times higher the normal will take some time to accumulate, so that particular level is probably not a reference here ( if trauma patient is being treated than it might accumulate, but if one dies, probably not) I have to leave now and will be back in the evening and will answer the questions gladly. In general just as a remark – it is difficult to predict one’s body response to any one given factor to have a simulacra since as I have stated before – clinical picture and actual picture depends not on one factor of bilirubin, there are much more in the clinical picture we are discussing and all of them might have influence on the results. Therefore singling out bilirubin is a bit puzzling for me ( therefore the comment about screaming : )))).","date":"2013-05-26","mins":"9:30 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34904","author":"jesterof","post":"While discussing the color of blood stains and what can interfere with that I found Alan Adler book where the experiment of evaluating the old blood stains on the lien is described and compared to the Shroud in terms of the waveform absorption( the link below). I have to make a remark, however – while reading this and other materials I developed the impression that everybody is discussing the bloodstain on the Shroud as a bloodstains from the WHOLE blood ( if you cut yourself with a knife the blood coming from the wound will resemble the whole blood the most, but if you fell down and scratch your knee, the bloodyish fluid coming from the surface will not be the whole blood – and those will stain differently) when i reality the majority of stains on the Shroud are not the whole blood at all – and therefore the characteristics of those stains including their color can differ from the expected one from the whole blood. Http://books.google.com/books?id=J2j Bn DN3 Vx MC&pg=PA30&lpg=PA30&dq=spectral+data+of+the+Shroud+blood&source=bl&ots=zen Dj Ct69 &sig=Wm P Zi D Bpkx Qp61 Q Ssp Vy4 Zj Vddk&hl=en&sa=X&ei=F3dj Uc u O Ymi8g TL1o CI Bw&ved=0 C Ko BE Og BMA0#v=onepage&q=spectral%20data%20of%20the%20 Shroud%20blood&f=false.","date":"2013-05-26","mins":"5:03 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34895","author":"jesterof","post":"Louis I was just joking : ) it was mostly with reference to the very long thread on br. Hirudo, where the singled issue of bilirubin was discussed.","date":"2013-05-26","mins":"3:30 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34907","author":"jesterof","post":"Yannick Clément : Louis said : “As for the colour of what is said to be blood stains, the Australian Dr.Loy is reported to have affirmed that the blood of people who die after a trauma is very red.” My comment : Very interesting information Louis! This tend to confirm Al Adler’s hypothesis concerning the reddish aspect of the blood on the Shroud that would be due to a higher than normal level of bilirubin in the blood that would have been caused by the long and intense tortures suffered by the Shroud man. Personally, I still believe that Adler’s hypothesis is most rational and probable to explain the reddish aspect of the blood on the Shroud! Can I scream now? : ).","date":"2013-05-26","mins":"5:43 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34925","author":"jesterof","post":"Yannick Clément : Why would you? You missed all the fun )))).","date":"2013-05-26","mins":"7:13 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34935","author":"jesterof","post":"I was talking about a very long thread on br.hirudo where I expressed my surprise on the description of the color as “too red” and the hypothesis of bilirubin was discussed there (as was also a concept of blood stains being not from the whole blood only and how it influences the color). Personally, I am not sure bilirubin can be blamed – it is very unstable and to expect that it will last centuries just to make some stain look “too red” in a subjective evaluation is not very convincing to me. That’s why I joked that if I hear bilirubin and too rd one more time I’ll scream. You missed that thread so you did not understand the context..","date":"2013-05-26","mins":"7:54 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34926","author":"jesterof","post":"Kelly Kearse : Jesterof, Thanks very much for your previous answers So, does this mean you are somewhat revising your opinion regarding the red color of the Shroud bloodstains or am I off base here? I couldn’t really tell from reading this if that was partbof what you were saying Also, a quick follow up regarding the 500x bilirubin and the serum level values you gave. In whole blood, the concentrations are expressed relative to blood volume. How would such quantitation apply to dried bloodstains testing threads via microspotting techniques or spectroscopy? Again, many thanks for your time No, quite to the contrary – I stand by that the color of the blood stains is not “too red” it is actually what to be expected. And I am still surprised that the notion of “too red” which started by Mc Crone ( who was actually describing NOT blood and his description of color is irrelevant) was not scoffed off at the very beginning. However, I did not see the original live. But, the others did not see it in a sunlight either. Subjective description of “too red” is just subjective. A.Adler description of the experiment is not confirming the subjective vision ( I am talking about the absorption wavelenght).","date":"2013-05-26","mins":"7:18 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34937","author":"jesterof","post":"The link I provided is to the book by Alan Adler and the experiment where he stained an old linen with blood and then in a year they tested it spechtometrically and compared to the Shroud stains. He gives the wavelength of absorption both for the Shroud and the experimental cloth – that figures to not stand out. One has also to remember what light source is being used in the stain evaluation as it differs a lot on the resultant absorption wavelength described..","date":"2013-05-26","mins":"7:59 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34932","author":"jesterof","post":"Also, a quick follow up regarding the 500x bilirubin and the serum level values you gave. In whole blood, the concentrations are expressed relative to blood volume. How would such quantitation apply to dried bloodstains testing threads via microspotting techniques or spectroscopy? Again, many thanks for your time The concentration are still going to be in the same values, as will be the Hgb value. There should be a conversion method used, but those are the details of the technique. (Has anybody tested the Hgb concentration of the stains? It might answer the question what kind of bodily fluid stained it) here is a description of the patent which actually uses the spectrophotometry of a dried blood sample on a paper to detect hemoglobin concentration. I do not see any problems with analogue for detecting the bilirubin concentration of the dried stain http://www.google.com/patents/US20120257188.","date":"2013-05-26","mins":"7:34 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34933","author":"jesterof","post":"Jesterof and Yannick, between Adler and Mc Crone I would vote for the former. Jesterof, its too early to scream, let’s wait till Giorgio posts some of that correspondence on the HSG website. I would too, since he is the only one talking about blood. However, I think he might have been unconsciously pushed in that direction by Mc Crone who was not even talking of blood.","date":"2013-05-26","mins":"7:39 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34944","author":"jesterof","post":"Well, I have also seen the photos by my own eyes and I trust them more then the reports I have not read : ) Irony aside – is there an online link to any of those? Thanks.","date":"2013-05-26","mins":"8:20 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34940","author":"jesterof","post":"Kelly, I honestly do not understand your question. The units used are just the units used, it is an agreed method, the spectrophotometry uses the wavelength absorption and then they have to use some mathematical conversion tables. I am not the mathematician or statistician and those details are beyond my knowledge. I can dig on line to it, but I just do not see what is the confusion. If we calculate the concentration of the substance it does not matter what we will refer to – a stain or serum of the alive patient. You may calculate it by using the presented method by the dried sample on a paper ( and it will tell you how much of the substance is per volume unit of blood, or serum, since those are commonly agreed values of reference) or by measuring the whole amount in a sample of blood which will be exactly 100 ml – but the latter is just impractical. I believe it is an area of analytical chemistry which I’ve studied back in medical school, but forgive me, I have forgotten it long time ago : ) ” A thread that received more blood transferred relative to one that received less will appear to have a higher concentration of that protein per surface area, even though the overall levels in the original blood should be equivalent. ” No it would not. Because they do not calculate ABSOLUTE amount of any substance in that particular point, but adjust it accordingly to the unit of measurement..","date":"2013-05-26","mins":"8:09 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34943","author":"jesterof","post":"If you calculate how much does the stain weighs and then how much of that weight is hemoglobin ( as an example) an you get that it is half the weight of the whole stain you may refer to it as hemoglobin concentration is 50% of the stain which is also the unit measurement. How will you covert those practically absolute numbers to the relative numbers of units per volume one has to ask the mathematician.","date":"2013-05-26","mins":"8:15 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34945","author":"jesterof","post":"Yannick Clément : Thanks for the precision. But concerning Al Adler’s hypothesis, I learned from Mr. Kearse that he did some coloration test with different level of bilirubin and the one that came out closer to the color of the Shroud blood was the one with a very high level of bilirubin. I know that this doesn’t prove that the color would still be red 2000 years later, but don’t you think that this bilirubin hypothesis makes plenty of sense in the context of the Shroud on which we see the body image of a crucified victim who had been very badly tortured? In such context, everytime I will expect to see a level of bilirubin in the bloodstains much higher than normal! So, why this hypothesis proposed by Adler would not be the solution for the unusual aspect of the blood color? Sometimes, the most simple answers are the best. And this time, this simple answer of Adler fits perfectly well with the context of the burial cloth of a crucified victim. In my mind, this simple fact give Adler’s hypothesis some crédits. The hypothesis by itself is valid. The problem is – I do not see those pictures as “too red” They are NORMAL. As they are supposed to be – to my eyes and I am used to all kinds of blood stains – from whole blood, from blood stinged bodily fluids and so on. To dried stains also. Obviously, not ages old, but if the stain form different body fluids with addition to blood do stain in different color when they are fresh or just have dried a day ago, I do not see any reason why should not they differ centuries later as well. Then, somewhere I’ve read that “too red” is referred only to ONE stain as a spike of the absorption waveform to 650nm and all others are below 500nm. But below 500nm is totally where they are expected to be! So do you, personally, know which specific stains are refereed as “too red”, what absorption wavelength are they and what method was used to evaluate them?.","date":"2013-05-26","mins":"8:27 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34948","author":"jesterof","post":"Yannick Clément : After reading many comments here from Mr. Kearse and jesterof, I ended up with a very bad headache! I remember now why I never was interested to go into science at school… ; ) You may scream : ).","date":"2013-05-26","mins":"8:33 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34951","author":"jesterof","post":"The fact that they are budged doe not prove anything. Neither of them watched the Shroud in a sunlight. The source of light especially for the photos does change the color and one might not see the diference. People have individual color perception and it is subjective. That’s why I’ve asked – do you know about which particular stain they are talking about, what method of spechtrophotometry was used and what is the absorption wavelenght of the stain in question – everything else is just poetry. From the top of my head I do not recall the STURP membber being very much exposed to a lot of blood and it’s stains. With one exception Robert Bucklin might have seen those. Did HE also referred to the blood stains as “too red”. Not the physicists, not the photographers, not the chemists – this one person might have the right to determine what is “too red” in a blood stain as he has seen the others as well..","date":"2013-05-26","mins":"8:41 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34957","author":"jesterof","post":"Ha, that is what is needed. Thanks, Louis. Already the first link answered some questions – it is actually while exposed to bright UV light when the color of the stains starts to be different ( so my eyes are just fine )))) That is when UV shines directly, the color brightens – now, I have the answer to the bilirubin question – because it reacts to the UV light..","date":"2013-05-26","mins":"8:52 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34963","author":"jesterof","post":"I think we will need to find an analytical chemist here to explain, but I do not see the problem. If they know how to calculate this in forensic pathology ( and they do and use it because one can find tons of clues in one’s blood and a stain as a proxy) I would assume that is not as problem to do in respect to the Shroud as well..","date":"2013-05-26","mins":"9:00 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34959","author":"jesterof","post":"I did not talk about it reference to this one, just as an example that we are not using absolute amounts but units so one can measure the amounts by sampling of a smaller amount or by different methods, like using the angles of refraction depending on the amounts of refracting substances or wave absorption.","date":"2013-05-26","mins":"8:55 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34964","author":"jesterof","post":"I am a physician..","date":"2013-05-26","mins":"9:01 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34967","author":"jesterof","post":"There are plenty of compounds which will react with blood components and will change the color, or the p H, or the clotting time, or the fibrinolysis time.. Or else. Blood is a very complex matter and there are many factors which will interfere with it and will change it characteristics. But I finally have the answer to my question and am happy I am not color blind ( it is almost impossible anyway, but) – the unusual brightness is visible ONLY when exposed to the bright UV irradiation – as sunlight. It is not visible in house. So your statement ” on the color of the blood we can see today on the cloth” is wrong – as neither you, nor me can see it on the cloth – it can be seen only upon exposition to UV light. We have a witness to this – Antoine Legrand – who have seen the Shroud upon exposition in a bright sunlight in 1931 and then much later in the 60s – have noticed that the color is not bright carmine anymore – because he actually have seen the Shroud exposed to sunlight. This is all in Louis’s first link..","date":"2013-05-26","mins":"9:15 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-37602","author":"jesterof","post":"Max, don’t you thing that our buffoon foodie with “scientific” complexes does not deserve that much attention from you?.","date":"2013-06-21","mins":"10:16 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37603","author":"jesterof","post":"Dan, by designating a special blog to an individual with such visible complexes you are actually feeding this disorder. It might be viewed as empathy, but it is not really therapeutic. A guy is in his late 60s, probably, and craving for “wiki mentioning” LOL.","date":"2013-06-21","mins":"10:20 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-33833","author":"jesterof","post":"Andy Weiss : I submit while Colin may be a fine Scientist,. If one looks at his postings one would certainly doubt it. Especially if one knows the scientists and science not just from bragging in the internet :LOL: A man clearly has a psychosocial deficiency and compensates it by verbal pirouettes of strange resentment. Which causes are not that hard to decipher, though : ).","date":"2013-05-16","mins":"8:18 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might."},{"id":"comment-33882","author":"jesterof","post":"The self proclaimed scientific trolling himself is preying for the feed. Or attacking ad hominem the deceased scientists is not trolling? oh, I beg your pardon, it is “scientific discussion” :LOL:.","date":"2013-05-17","mins":"1:16 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might."},{"id":"comment-33410","author":"jesterof","post":"2 Matthias This is not a novel approach jys a resurrection of the old atheist’s myths circulating years ago. The problem with this approach is it a fairy tale which is not based on any facts( if we take the facts as a description of events in Gospels). This thesis of conscious creation of myth of resurrection is contradicted by behaviour of everybody who came to the tomb on Sunday morning and everybody, who encountered resurrected Jesus later – neither of the men and women expected to see Jesus, everybody was sure he is dead and were looking for the body. This obvious psychological conflict, described in all Gospels contradicts the atheist assumption of nice and fuzzy premeditated story inventing..","date":"2013-05-10","mins":"9:54 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"}]
