[{"id":"comment-36040","author":"jesterof","post":"Max, what did they do with the inner burial sheet after the fumigation was completed?.","date":"2013-06-04","mins":"8:51 am","url":"https://shroudstory.com/2013/06/03/a-completely-inappropriate-experiment-nice-white-lab-coats-anyway/","cat":"image_theory","title":"A completely inappropriate experiment. Nice white lab coats, anyway"},{"id":"comment-36056","author":"jesterof","post":"So, basically there should be TWO sets of sheets – the one wrapped tight closely over the body soaked with solutions and for fumigation and the other over it?.","date":"2013-06-04","mins":"10:30 am","url":"https://shroudstory.com/2013/06/03/a-completely-inappropriate-experiment-nice-white-lab-coats-anyway/","cat":"image_theory","title":"A completely inappropriate experiment. Nice white lab coats, anyway"},{"id":"comment-36083","author":"jesterof","post":"Max Patrick Hamon : Jesterof, not at all. Most likely, there was a set of pre burial pieces of linen (e.g. The Oviedo Sudarium) and a set of burial shrouds (at least one long inner burial sheet aka the Turin Shroud + a face cloth and a skull cap both used as outer NOT inner shrouds + an outer shorter burial sheet half the length of the TS + a couple of outer long linen strips) as far as the bloody body is concerned. So pre burial set actually served ( in a way) as a washing set, or, rather absorbing set and the ingredients used to soak those linens and the fumigants served as the mordants you were referring to earlier? Makes a lot of sense..","date":"2013-06-04","mins":"1:06 pm","url":"https://shroudstory.com/2013/06/03/a-completely-inappropriate-experiment-nice-white-lab-coats-anyway/","cat":"image_theory","title":"A completely inappropriate experiment. Nice white lab coats, anyway"},{"id":"comment-36457","author":"jesterof","post":"Max Patrick Hamon : Very last remarks: 1/Archaeologically speaking, can Mr Belz account for potassium giving only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) giving strong signal? I can in the light of my bloody body image formation process thesis. In the darkness of his oversimplistic “3 D projective geometry”, Mr Belz just cannot. Max, can you, please, answer the question – what is the perceived relationship between the hydroxiproline and potassium? because I can’t ether remember on physiologically or find anything for that matter. But you keep repeating that, so there should be some connection thanks.","date":"2013-06-08","mins":"2:37 pm","url":"https://shroudstory.com/2013/06/03/a-completely-inappropriate-experiment-nice-white-lab-coats-anyway/","cat":"image_theory","title":"A completely inappropriate experiment. Nice white lab coats, anyway"},{"id":"comment-32918","author":"jesterof","post":"“too perfect to be true” as an argument is usually a sign of incompetence on the subject….","date":"2013-05-04","mins":"8:24 pm","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-32983","author":"jesterof","post":"Colinsberry : Scientists – real ones – not the publicity hungry operators who dominate Shroudology with their pretentious pseudo scientific PD Fs and premature press releases – are every bit as entitled to be dogmatic about the methods of science as a trial judge is about the rules of evidence – deeming this or that testimony inadmissible. Do rigid methods lead to faulty outcomes? No, because reliable outcomes depend crucially on those rigid methods. It’s about self discipline (a shortage of which was painfully obvious in STURP’s final report – cue that absurd hypothesis re bilirubin and “permanently red blood” that Barrie Schwortz shamelessly continues to proselytize).. In my entire career I never once heard a fellow scientist protesting about the methods of science. It’s only on sites such as this one that the methods of science come in for a drubbing – for having the temerity to produce the “wrong” answer. Why wrong? Because it conflicts with preconceptions, wishful thinking, a yearning for ‘mystery’ and where ‘academic’ wow this is one bold and utterly unscientific statement from a self proclaimed life long scientist :LOL: life long scientist had never ever heard of research validity and realability directly connected to the methods used and about study designs, categories and levels of evidence? WOW http://www.cancer.gov/cancertopics/pdq/levels evidence supportive care/Health Professional/page2 http://www.theatlantic.com/magazine/archive/2010/11/lies damned lies and medical science/308269/.","date":"2013-05-05","mins":"6:03 pm","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-32988","author":"jesterof","post":"Colinsberry : I cannot comment on the latter half of your comment, because I don’t understand what you are saying or trying to say (inserting links to medical science articles on study design etc. That I may or may not get round to reading is in my opinion just plain laziness and/or second hand opinion touting). What I do object to is your label “self proclaimed life long scientist”. I am a retired scientist, or as I sometimes say, tongue in cheek, a retired science bod, What’s so special about that? Why use those words “self proclaimed life long scientist LOL”. Do you perceive a reference to one having previously worked as a scientist as in some way self aggrandizing, and if so why? A scientist is merely someone who adopts a certain systematic, well defined approach when reporting and attempting to understand poorly or incompletely understood phenomena – no more, no less – which just happens to be the current topic under discussion, or at any rate has turned into that. Again, I ask, what do you find so amiss or mirth provoking about someone describing themselves as a retired scientist? Would you rather I described myself as a retired non scientist? Why would I need or feel obliged to do that? self proclaimed life long scientist does not know that medicine is a part of scientific research as well? and so the methodology and rules of the scientific methods applies there as well? For anybody even vaguely related to the scientific research is obvious that this statement “Do rigid methods lead to faulty outcomes? No, because reliable outcomes depend crucially on those rigid methods. ” is an absolute nonsense. Why – i provided the links to explain. One of them is in a general magazine so anybody can understand the text..","date":"2013-05-05","mins":"9:08 pm","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-33070","author":"jesterof","post":"*** rolling eyes smiley*** if you do not understand that scientific methods are not an absolute and even rigorous methods applied may lead to invalid conclusions I can’t teach you that. Even the person vaguely connected to any area of science knows that to admit that “rigid methods never lead to invalid outcomes” is total nonsense. If you can’t – that is a proof of your validity and reliability as a scientist. Even on food : ).","date":"2013-05-06","mins":"1:02 pm","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-32989","author":"jesterof","post":"“Again, I ask, what do you find so amiss or mirth provoking about someone describing themselves as a retired scientist? Would you rather I described myself as a retired non scientist? Why would I need or feel obliged to do that? ” Maybe because you are calling for this type of sarcasm, using this type of language against the others: “Scientists – real ones – not the publicity hungry operators who dominate Shroudology with their pretentious pseudo scientific PD Fs and premature press releases” “preconceptions, wishful thinking, a yearning for ‘mystery’ and where ‘academic’ Shroudology is concerned with the highly coloured, subjective interpretations of Shroud ‘historians’ etc,”.","date":"2013-05-05","mins":"9:14 pm","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-33068","author":"jesterof","post":"Max Patrick Hamon : The truth remains CB is a former Head of Nutrition/Food Safety self claimed Turin Shroud specialist and has no lessons to teach as such. No wonder he does not understand that the principles of scientific methods do nod differ that much be it medicine or physics.: ).","date":"2013-05-06","mins":"12:55 pm","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-33080","author":"jesterof","post":"Bye, foodie. Rigorous methods CAN lead to invalid results, so you are wrong. AGAIN.","date":"2013-05-06","mins":"1:59 pm","url":"https://shroudstory.com/2013/05/04/a-mysterious-work-of-art/","cat":"image_theory","title":"A mysterious work of art?"},{"id":"comment-39424","author":"jesterof","post":"Ron : My apologies Daveb, but it just irks me whenever the Jospice mattress is even mentioned in context with the Shroud. People must not get the impression that ‘ANY’ object found to date has any similarities with the Shroud. The Shroud is in a league of it’s own. Agreed. Why Jospice mattress is brought at all is beyond me. Things like this happen, probaly, relatively often – body evaporation can react with plastic and mattress cover was plastic. I already posted once my own experience when a body of a two year old boy ( still alive, though) left an imprint on a plastic cover. The boy died of acute liver failure after severe intoxication by an antihelmint product..","date":"2013-07-21","mins":"3:58 pm","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-39434","author":"jesterof","post":"Hope everything is calm down there, Dave, and you are safe..","date":"2013-07-21","mins":"5:51 pm","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-39545","author":"jesterof","post":"Thanks, Dave for letting us know :) due to the new prince nothing was on the news the whole day – forget about the southern hemisphere, nothing even on local trayvon zummerman craze..","date":"2013-07-22","mins":"8:49 pm","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-33980","author":"jesterof","post":"I was a bit disappointed in the pig experiment. If Maillard is the cause of the image, then it seems to need very specific but as yet unknown environmental conditions, such as temperature, humidity, duration in contact with body, maybe tomb darkness, to work. Not only that, but even if some of the pig’s physiology is very close to human ( niot that close, but closer than other mammals) it is a pig, not a human – therefore the possibility of miscalculations in the experiment are huge..","date":"2013-05-18","mins":"6:16 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-33992","author":"jesterof","post":"Yes, Yannick, very valid point..","date":"2013-05-18","mins":"9:11 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34035","author":"jesterof","post":"You want PETA on your tail? ; ).","date":"2013-05-19","mins":"11:04 am","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34046","author":"jesterof","post":"Well, of course. It doesn’t seem that people have the tendency to agree even on the mutually viewed events unfolding, leave alone the connection between the Shroud and the Faith. I am more in the camp which tends to agree with this :For those who believe, no explanation is necessary. For those who do not believe, no explanation is will suffice. But that does not mean I do not want to find out from the scientific point of view all secrets of the Shroud..","date":"2013-05-19","mins":"2:11 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34042","author":"jesterof","post":"Louis : Christians will have a tougher time in post Christian Europe, and the trend is slowly spreading to the US… Isn’t that as it is supposed to be? as for the scientific proof of Resurrection. Even if it is possible to prove scientifically the Resurrection of the Man of the Shroud, it will still leave behind a lot of unbelievers – that is human nature…the resurrection of the Lazarus was viewed by crowds, yet there still were those who weren’t swayed….","date":"2013-05-19","mins":"1:47 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34055","author":"jesterof","post":"Rschneider42 : Of course the difference between resurrection and resuscitation is that the person resuscitated dies again. And who was resuscitated? btw, person resuscitated dies again, but not necessarily in short time after resuscitation.","date":"2013-05-19","mins":"3:10 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34067","author":"jesterof","post":"Yannick Clément : Quote : “and who was resuscitated?” Answer : Jairus daughter, the son of the widow of Nain and Lazarus, but I thought you already knew the answer… Lazarus was resurrected – he was DEAD for 4 days already. I do not remember how long were the other two, but the girl, as I recollect, might have been less than an hour – so the term resuscitated might be applied, with understanding that resuscitation as a term involves actually a lot of physical activity, but I will agree for the stretch : ) One can resuscitate only near death or in the time of clinical death – up to an hour after death. After that it is resurrection only. Speaking withing the medical therminology.","date":"2013-05-19","mins":"5:45 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34069","author":"jesterof","post":"Yannick Clément : Have you noticed that all three people “resuscitated” by Jesus (I prefer the term “re animated” by the way) were all human beings who died way “too soon”, at an early age? This fact has always struck me… I think it is another very good sign of the extreme compassion of God, who is always deeply touched by the injustice suffered by small and poor. God is love and nothing else my friends and he want to save every one of his beloved children. And don’t worry, he will succeed because God’s plan on creation is a plan of love and happiness and nothing else. And these three “resuscitations” are all great signs of this. Honestly I do not see it that way – Lazarus clearly was not young and was sick for quite a time, so even if for his sisters ( or any family) his death would be all too soon, but per Gospel description it was not. I can’t use the term resuscitate on somebody already decaying for 4 days… It is, probably, professional bias : ).","date":"2013-05-19","mins":"5:49 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34074","author":"jesterof","post":"Yannick Clément : Lazarus was most probably pretty much of the same age than Jesus… In the Jewish context of Jesus time, to die Young like that was almost considered as a curse of God. The miracle operated by Jesus on his friend was a way for him to set the record straight about who God really his (which is very far from any human projection). The impression I get he was much older, but it is not that important – the resurrection of Lazarus was the way to set the record straight..","date":"2013-05-19","mins":"6:57 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34256","author":"jesterof","post":"There is no medical sense in re animation. However it reminds me zombies : ) or whatever those creatures are – the walking dead which are supposedly re animated by shamans in Africa..","date":"2013-05-21","mins":"8:41 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-34257","author":"jesterof","post":"Irony aside, all resurrected three were fully functional alive people – until their second death, which does not happen with re animation ( per my understanding the term). Not only did Jesus return their soul back to the body, but he healed all the illnesses they had – and that is the difference between resuscitation ( which merely restores the heartbeat and blood pressure in physical meaning or returns the soul back to the body in spiritual)but it does not heals the pais and ills which the dead person had before death. In the case of all three cases of resurrection by Jesus Christ – everyone was healed. That is why it is not resuscitation or reanimation – it is resurrection..","date":"2013-05-21","mins":"8:46 pm","url":"https://shroudstory.com/2013/05/17/more-support-for-treasures-decoded-the-turin-shroud/","cat":"image_theory","title":"More support for Treasures Decoded: The Turin Shroud"},{"id":"comment-42513","author":"jesterof","post":"Last time I checked the Scripture Jesus Christ was not buried on Golgotha,.","date":"2013-08-31","mins":"3:51 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-42514","author":"jesterof","post":"What is the relevance of this? Golgtha was a place of death but not the place of burial..","date":"2013-08-31","mins":"3:53 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-42806","author":"jesterof","post":"Max Patrick Hamon : In Ukrania in winter maybe it was. With you “knowledge” what and were is winter I won’t be surprised. Upgrade your physical geography ASAP!.","date":"2013-09-03","mins":"5:53 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-34509","author":"jesterof","post":"May I ask an uneducated( from Shroudology point) question here? : ) Can anybody explain to me why are some substances singled out – lactate, or urea, or anything else. Human blood is full of carbohydrate complexes and it is also full of proteins, amino acids, fats and metabolites of all of those. It is a milieu of different substances and substrates which all can produce the reaction of caramelization or else. Given the stress the tortured Man of the Shroud was subjected to one can also assume that the level of plain glucose ( and fructose) in His blood was also very high. Plus the levels of hormones and their metabolites etc. The p H, the electrolyte content was also out of the wack and those factors also can contribute to the possibility of different types of reactions. So why are the researchers singling out ONE ( or two three) substances for their hypothesis? I’ve seen that already in the “blood threads” and it is continuing here as well..","date":"2013-05-23","mins":"5:01 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34457","author":"jesterof","post":"Not everybody who has faith even knows about the Shroud. I can understand that for some ” the proof” is necessary, but their existence does not preclude the existence of those, for whom it is not essential..","date":"2013-05-23","mins":"9:31 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34541","author":"jesterof","post":"Now, about that mattress from the hospice. It’s a plastic cover for the mattress, let us be clear, not a linen cloth. This is important because components from the plastic( especially dye) react with other chemical components more easy than linen would. I don’t know how was it produced and it is connected to death, but plastic can and will react with chemical substances.. I witnessed something resembling this myself. I used to work in the pediatric intensive care unit and we were treating kids a lot of kids with different poisonings. Well, there were some admitted with intoxication by antihelmintal products for the big animals and those were deadly – kids were dying from acute liver failure and nothing could be done ( no liver transplants existed). One of the patients (2 years old) was admitted and he needed the central line placement for fluid resuscitation. This was usually done in a separate room, since anesthesia needed to be provided and the procedure required sterile equipment. After the procedure, when the kid was taken to his bed from the OR table, the plastic blue cover of the OR table had bright discoloration in a form of contours of the child’s body as he was lying there…. He wasn’t dying at the moment, he passed away several days later, but the chemical reactions in his body and perspiration from the skin produced such a reaction on a plastic cover. He was not laying on the bare plastic, there was a thin cotton sheet, but the chemical reaction was so strong that it just went through the cotton. There were no visible manifestations then – it was basically upon admission, so the child was yet in very stable condition and even conscious..","date":"2013-05-23","mins":"8:57 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34552","author":"jesterof","post":"Looneytombs : Fascinating and tragic anecdote! Where did this occur and what large venomous animals were common there. It was ~ 15 years ago in Eastern Europe. Animals have nothing to do with this and they weren’t venomous at all, quite to the contrary – those were cows. But animals have parasites called helminths in their digestive tracts( people do, too). To kill those parasites the veterinary pharmacies were distributing some chemicals in the form of big tablets. Parents not being careful were leaving those tablets in the reach of children and those were often chewing them ( at least 1 2 kid per year for a ~ 3 million population)..","date":"2013-05-23","mins":"10:29 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34553","author":"jesterof","post":"Louis : #27 See the article entitled “Can the Jospice Mattress Imprint be compared to the Image on the Shroud?” on the HSG website, particularly the part where the image penetrated the pillow, with no plastic involved. I searched the web on the issue – the image was on a plastic(or nylon which is still not linen) mattress cover. So there was a synthetic cover involved. Yes, it did penetrate through the pillow. Http://www.shroud.com/pdfs/mattress.pdf.","date":"2013-05-23","mins":"10:34 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34555","author":"jesterof","post":"Just to add – the mattress cover IS NOT a sheet over the mattress – it is a special plastic or nylon or other synthetic shield to protect the mattress from bodily fluids. The sheet goes on top of the cover. It HAS to be plastic in order not to wet the mattresses..","date":"2013-05-23","mins":"10:38 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34366","author":"jesterof","post":"I thin you are mistaken. The reality of the Shroud has nothing to do with the faith..","date":"2013-05-22","mins":"4:45 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34621","author":"jesterof","post":"Thank you, Kelly. When a person is under the stress the release of epinephrine leads to subsequent breakdown of the glucose storage – the body uses glucose ( a carbohydrate which can be used in the Maillard reaction) as a fuel and upon stress will use everything availale. So just the high amount of glucose in the blood might serve as a substrate for the Maillard reaction, not necessarily lactate, which will be there, as a result of rhabdomyolysis and tissue hypoxia. Why does the discussion center only on volatile substances created after death is my main objection – all substances available should be taken into consideration, not just postmortem volatile ones.","date":"2013-05-24","mins":"10:00 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34628","author":"jesterof","post":"“The Maillard reaction, as I’m sure you know, occurs between an amine group and a reducing sugar (carbohydrate). Relative to the Shroud, the carbohydrates are believed to be present on the cloth, more specifically on the surface originating from starch residue or one of the glycosides (Saponin products). It sound as though you are suggesting that the carmelization reaction might be taking place within the blood (high glucose, fructose) and then diffusing out to be deposited on the Shroud? That it is independent of a direct reaction with the carbohydrates on the cloth?” caramelization reaction is not going in the blood, it is using the products from the blood, which soaked the cloth. As blood here I mean not only red thick fluid, because all the products will be in plasma, sweat, tears and other bodily fluids which were in excess on the body, so the cloth could have been soaked with them easily. There is no need to have saponaria at all..","date":"2013-05-24","mins":"10:50 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34635","author":"jesterof","post":"Louis, it does not matter was there a direct contact or not. The cover is plastic. In the case I’ve observed there were no direct conatact as well – there were sheets, some special bumping under the shoulders of the child ( not a pillow, more like a towe, bumping needed for the positioning for central line placementl) and still the contours were not interrupted, which means the vapors from the skin of the child were so strong, they penetrated the sheets and towel ( and a pillow in a jospice case) without a problem. You article does state that the mattress cover was nylon ( which is synthetic material) as well. If I hear “bilirubin” one more time – I’lll scream : ) What does bilirubin have to do here? Maybe it is amines evaporating through the skin, and reacting with the plastic causes the reaction? The point is – you can not compare linen cloth to the plastic, but plastic is a very good way to demonstrate that chemical reactions from the evaporating substances the body produces ( during life or postmortem) with the substances on the covers can produce an image.","date":"2013-05-24","mins":"11:08 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34641","author":"jesterof","post":"Louis : Jesterof, The discussion is going off the track again. You said that imprints can be formed on plastic because you saw such things in a hospital, so that is OK. My point is that the Jospice Mattress Imprint is not similar to what you have seen and in fact what has been stressed (in my article) is that which Father Francis O’Leary found difficult to explain and also what the BBC team neglected to take into account. And what is that? How was the the head image imprinted on the mattress by penetrating the pillow. The point is that plastic (brought into the discussion by you) and bilirubin (brought into the discussion by the author of the first article you read, and by two prominent bloggers here), have nothing to do with the imprint formation in this case, so if you want to scream, go ahead, but not at me — at them. There is an easy way to avoid screaming. As you are a newcomer on the scene, read the literature on the topic available on the Internet to be able able to understand what exactly the discussion is about and then come to your conclusions. OK? Louis, I think we are talking in parallel here. The possibility of the imprint on the plastic cover of the mattress might be connected to any of the compounds in the body, which the body can perspirate. Making it through the pillow does not seem anything special for me as I have seen the similar type of reaction and it is not impossible, neither has it to be connected to any supernatural phenomena. Singling out bilirubin is only because the same compound was previously singled out in connection with th Shroud( IMHO). Bilirubin is neither stable, nor is it very reactive with other media, so making it the main compound is not the best way to explain the imprints. But the body is producing not only bilirubin and in a failing state there are many more aggressive compounds found in the plasma as well. Maybe it was bilirubin, maybe it was not, but the possibility of chemical reaction and leaving traces on covers is not supernatural even if it is penetrating through the pillow or tightly rolled up towel and sheets. Oh, and one more thing – being here a long time does not make a blogger infallible in their opinion. Including bilirubin : ).","date":"2013-05-24","mins":"12:59 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34643","author":"jesterof","post":"Okay, I see, but I am unsure as to how the reaction would be so uniformly restricted to the very superficial, top portion of the microfibers if the cloth was soaked with them. That is totally the other question. And that is something which is unique to the Shroud and has nothing to do with the jospice cover0.","date":"2013-05-24","mins":"1:01 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34676","author":"jesterof","post":"Louis : Hullo Jesterof It was not me but Father O’Leary who appeared to be talking about supernatural phenomena and my approach had everything to do with the paranormal, as you should have gauged from the article I wrote. I understand. I read about the mattress cover a while ago and recalled the incident with the child while reading it. It might have been supernatural( I mean the mattress cover imprint). I simply think that before executing that argument one has to go through all other possibilities. I have more important things to do than writing a paper on a possibility of something happening more than 15 years ago. : ) We are just discussing the different phenomena and it is only natural that something seemingly supernatural to one person might seem totally normal to the other. On the issue of the image making it through the pillow – it is not the image which makes it through the pillow, but vapors. If you never have experienced anything pungent like formalin or ammonia, it will be difficult to explain that vaporized substances can penetrate a lot of covers. I mentioned those two because they are pungent and one can smell them even with a lot of covers over one’s face, but others can penetrate through different layers as well. That’s why I do not see anything unusual with the possibility of vaporized substances slowly penetrating through the pillow to chemically react with the mattress cover..","date":"2013-05-24","mins":"5:24 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34746","author":"jesterof","post":"2 Kelly Kearse The blood and plasma rich in glucose/fructose in high concentration will make the other bodily fluids contain them as well – one can assume that the body is basically wet with “sweet” fluids. If it was covered with the linen tightly first, it might have been soaked with high glucose concentration bodily fluids. This, however, does not explain uniformity of the image being only very superficial..","date":"2013-05-25","mins":"11:24 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34748","author":"jesterof","post":"The superficiality of the image (if it’s depth is the same all over the Shroud) makes naturalistic explanation extremely difficult.","date":"2013-05-25","mins":"11:27 am","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34784","author":"jesterof","post":"Yannick, that is not what I meant. If one considers cloth to have only superficial film of carbohydrate due to pretreatment of the cloth – the image formation on that superficial film might be explained ( plus minus) by chemical or waveform reactions – since the reagent is superficial the image can’t be deeper than that is spread of the reacting medium. But if the reacting carbohydrate would be from the body – there is no way it will soak the cloth uniformly everywhere – therefore I actually agreed with Kelly Kearse on his objection. But one has to take into consideration that the cloth was not around the body inflated like a balloon( or was it? ; ) ) with the even distance from the body parts and without any interruption of it’s surface when the reaction was evolving, it was wrapped and therefore creases, folds, bumps even of the uniformly impregnated cloth should have a difference of the depth of image formation due to the physical obstacles on the way of gases or other particles Unless as I said, the cloth formed a balloon around the body at the moment of image formation and then it HAS TO be connected to the Resurrection.","date":"2013-05-25","mins":"6:05 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34809","author":"jesterof","post":"Yannick Clement : Rogers was very specific when he reported the result that the nature of the coloration he obtained (this was a stain and nothing close to a body image) was very close to what he did see in the image area. That is THE MOST important part of the statement – this was a stain and nothing close to the body image! One can achieve stains in experiment but we have yet to see the uniform image not from the body – just from the angled object with the uniform depth of coloration not dependent on turns, angles and bumps of the object.","date":"2013-05-25","mins":"8:22 pm","url":"https://shroudstory.com/2013/05/22/struggling-with-naturalist-explanations/","cat":"image_theory","title":"Struggling with Naturalist Explanations"},{"id":"comment-34317","author":"jesterof","post":"Lactate will be abundant in the blood of the person tortured, beaten and under the stress condition described by the Gospels. Lactate level is a marker in certain conditions since it is a common substrate an product of metabolic reactions.","date":"2013-05-22","mins":"8:50 am","url":"https://shroudstory.com/2013/05/21/the-pig-experiment-was-not-barries-experiment/","cat":"image_theory","title":"The pig experiment was not Barrie’s experiment"},{"id":"comment-34454","author":"jesterof","post":"But it is independent from science. If it depends, it is not faith, it is reassurance. It does not mean one has to ignore scientific discoverhes. Still tgey will answer only the question “how” but not “why”.","date":"2013-05-23","mins":"9:19 am","url":"https://shroudstory.com/2013/05/23/resurrection-what-happens-with-quantum-entanglement/","cat":"science","title":"Resurrection:  What happens with quantum entanglement?"},{"id":"comment-35066","author":"jesterof","post":"Angel : Angel says: Perhaps Jesus utilized anti gravity at the resurrection. The US Military has a fleet anti gravity spaceships, disk shaped and cigar shaped. That disappear. These have been mistaken by the public as UF Os. Excerpt: “The Lockheed X 22 A is equipped with Neutral Particle Beam directed energy weapons, that it is capable of effecting optical as well as radar invisibility, and that it is deployable for worldwide military operations.” Best, Interesting hypothesis. Most of the accounts of UFO are accounts with military arsenal..","date":"2013-05-27","mins":"8:48 pm","url":"https://shroudstory.com/2013/05/23/resurrection-what-happens-with-quantum-entanglement/","cat":"science","title":"Resurrection:  What happens with quantum entanglement?"},{"id":"comment-30752","author":"jesterof","post":"Http://en.wikipedia.org/wiki/Micrometre micron, or a micrometer is 1×10 6 where a millimeter is 1×10 3.","date":"2013-04-14","mins":"9:34 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30753","author":"jesterof","post":"Micron is one thousandth of a millimeter, 0.001 mm, so 13 microns are in the few hundredths of a millimeter.","date":"2013-04-14","mins":"9:36 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30755","author":"jesterof","post":"0.013 mm to be precise.","date":"2013-04-14","mins":"9:37 am","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"},{"id":"comment-30791","author":"jesterof","post":"John Klotz : Dear all, Does a “few hundred’s of a millimeter cover .013mm. I wo9uld guess not quite. You are wrong – this is a precise description. If you round up 0.013 to 0.01 it will actually be one hundredth. Not few, but if you extend and round it up to 0.02, it will be 2 hundredths of a millimeter.","date":"2013-04-14","mins":"3:26 pm","url":"https://shroudstory.com/2013/04/14/the-making-of-the-hd-image-for-the-shroud-2-0-app/","cat":"news_&_views","title":"The Making of the HD Image for the Shroud 2.0 App"}]
