[{"id":"comment-13200","author":"steve","post":"“But why should anyone outside the Shroud world be interested? The letter/challenge seems to assume that the fact that the image on the Shroud is not understood makes it somehow unique. Yet there are hundreds of other scientific issues that we still don’t understand e.g. Why some people get cancer and others dont.” Menedemus, skeptics outside the “Shroud world” ARE INTERESTED, but they are generally interested in proclaiming the Shroud a fake. These skeptics, if they’re serious about science, should explain why their preferred conclusion is valid science in the face of all currently available evidence..","date":"2012-06-30","mins":"1:57 am","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"},{"id":"comment-13233","author":"steve","post":"Menedemus, you note, “Isn’t Dawkins a biologist – i can’t see why he might be interested” What you are arguing is it is naïve to expect Dawkins to extend himself beyond his area of expertise. Yet this very same Richard Dawkins, Dawkins the evolutionary scientist, evangelizes about how accepting the divinity of Christ is a “delusion” and he goes so far as to advise atheists (last March) to publically mock and ridicule his followers. I leave it to you to explain why this biology expert should be interested in advising atheists to ridicule Christians. The fact is, Dawkins tends to be keenly interested in expounding upon matters far beyond his own area of expertise. What intrigues me about Richard Dawkins mental habits and your explanation for his ostensive lack of interest in the Shroud is the how whimsically arbitrary both are. The Shroud is an artifact, not a religious creed, and yet it seems to suggest something ultimately religious in nature about Christianity’s founder, who happens to be a real person. Even without the connotations to Christianity’s founder, what should interest Dawkins about this artifact, as the Shroud should interest any thinking person, is that the Shroud almost perfectly encapsulates the frailties and pitfalls of empirical inquiry: the more we know empirically about the Shroud, the more new questions arise about it and about our scientific methods. Thomas Aquinas said we should affirm the goodness of empirical science even as we acknowledge this inherent problem with it. This is the real reason why Richard Dawkins doesn’t talk about the Shroud and this is also why he says he doesn’t have much use for Aquinas. Hearing selectively, he is a Pharisee for the contemporary age..","date":"2012-06-30","mins":"4:10 pm","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"},{"id":"comment-13460","author":"steve","post":"Resources shouldn’t be allocated to Shroud inquiries until urgent humanitarian concerns are thoroughly addressed? When a woman bought expensive oil and wiped Jesus’ feet with it, Judas advised that the woman wasted her money and she should have given it to the poor instead. How nearly right was he? You allocate your own mental resources to thinking about the Shroud. Perhaps you can explain why you’re still interested despite pressing humanitarian problems. We need to address your quandary: “I wish someone could explain why the issue of not knowing how the Shroud was created is such a big one.” It is not an especially big issue for everyone, although it clearly is a big issue for Richard Dawkins (and you, apparently). Dawkins does not want to think or talk about the Shroud precisely because he can’t explain it. Instead, he prefers to be lazy and say “science” has already refuted this artifact’s authenticity. The truth is, the more science is applied to the Shroud, the more difficult it becomes to explain it away. A less ham handed mind, a mind endowed with at least some humility, would acknowledge this simple fact. The fact that he does not should serve as a warning to his followers because being selective about the truth is a costly business. Incidentally, much bigger problems than the Shroud’s inexplicable reality are the clumsy application of words like “PROOF” and fundamentalist science. Science might provide illumination of certain circumstantial evidence lending to the inferential conclusion of the Shroud’s authenticity, but it is ridiculous to expect science to “prove” the Shroud belongs to Jesus of Nazareth, who rose from the dead. Fundamentalist science is the unexamined belief that anything not subject to science does not exist, and should therefore be dismissed and probably ridiculed in the name of science..","date":"2012-07-04","mins":"12:54 pm","url":"https://shroudstory.com/2012/06/29/three-months-today-the-dawkins-challenge/","cat":"image_theory","title":"Three Months Today: The Dawkins Challenge"}]
