[{"title":"The Eyes Have It?","post":"This post by Dan is an excellent source of information about the supposed coins in the eyes. You have two items that in my opinion are beyond doubt: blood stains and an image that in general support the Gospel accounts. That’s two points which make a straight line. There is no need of coins.\nOr perhaps it is not a straight line but an arrow pointed towards the Resurrection. I don’t know whether I am bemused or riled by people who claim there could be no physical proof of the Resurrection. What there is  physical proof is of is a bloodied body with the image of a crucified man created within three days of his death. There are accounts that he was resurrected. There are accounts of his appearance after the supposed resurrection but that his appearance had changed. \nThere is the account of Mary Magdalene being the first person he appeared to and his warning her not to touch him because he had not yet gone to the Father. There is an account of St. Paul that he appeared to him in a blinding light.\nHonestly, is there a simpler explanation for these accounts other than he in fact was resurrected?\nAlas, skeptics who can not accept the fact of resurrection must deny it and blind their eyes to the facts before them. Those who claim that science can NEVER “prove” the resurrection underestimate science because it is knocking on the door and that door is the quantum information of the universe (whatever that is).\nPerhaps, the issue will not be solved in our lifetime (or at least mine). It may be decades away.  But two days ago Pope Francis outlined the horrific future awaiting humanity if it does not repent its selfish abuse of the environment. There is one word he did not use: Apocalypse. I suggest that Apocalypse is an apt description of the future waiting humanity if we can not mend our ways. \nFour years ago when I first wrote my introduction to the book, I posed a question that was somewhat whimsical: Could this (scientific study of the Shroud) be the coming of a Quantum Christ?\nForget the whimsy. Reading “Laudto Si,” I have one prayer: “Hurry-up.”\n\n","date":"June 20, 2015 at 6:50 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202913","author":"John Klotz","site":"shroudstory"},{"title":"The Eyes Have It?","post":"Examining the original Enrie’s fiber base prints in my possession that Father Filas used, the lepton coin markings are nothing more than the actual thread’s weave. That’s it.  (I’m discussing only the markings pointed out by Filas). I’m sorry if I sound like Dr. McCrone and relying on my heuristic inference in film, but after 42 years in the industry and still counting, I’m confident in my statement.\n\n","date":"June 20, 2015 at 9:25 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202927","author":"Giorgio HSG","site":"shroudstory"},{"title":"The Eyes Have It?","post":"If I have volunteers in this group, I will be happy to provide my high resolution scans of the area of the coin from the positive and negative fiber base prints of Enrie that Father Filas used.  I would than conduct a survey tallying either nay or yea with two open ended questions. I would like to have at least 30 participants. Let me know if anyone is interested.\n\n","date":"June 20, 2015 at 9:44 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202928","author":"Giorgio HSG","site":"shroudstory"},{"title":"The Eyes Have It?","post":"Let me know if anyone is interested.\nAbout high resolution scans, yes there are interested. \nA survey? Mere exercise, giving no definite answer. There are more powerful scientific tools.\nMy opinion is that coin images are equivocal -you can fit several different coins to those dots on photographs.\nPlus the probability issue -I am thinking about making a Monte Carlo simulation, checking whether the alleged coin images may be real, or mere random noise. But  in far future. \nOne more thing Giorgio. Thanks for providing the 1977 conference proceedings. But that’s not what I am looking for. Wikipedia claims that there were several papers, for example J. J. Lorre – D. J. Lynn, “Digital enhancement of images of the Shroud of Turin”, in: Proceedings of the 1977 United States Conference of research on the Shroud of Turin, Albuquerque 1977, Holy Shroud Guild, New York 1977\nhttps://en.wikipedia.org/wiki/Shroud_of_Turin#cite_note-178\nThat’s what I am intersted. \nAny chance of finding that?\n\n","date":"June 20, 2015 at 10:36 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202933","author":"O.K.","site":"shroudstory"},{"title":"The Eyes Have It?","post":"I did come across Lynn’s paper I’ll keep you posted.\n\n","date":"June 20, 2015 at 11:21 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202942","author":"Giorgio/HSG","site":"shroudstory"},{"title":"The Eyes Have It?","post":"I did come across Lynn’s paper I’ll keep you posted.\n\n","date":"June 20, 2015 at 11:47 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202947","author":"Giorgio HSG","site":"shroudstory"},{"title":"The Eyes Have It?","post":"John,\nSince the very partial Pilate coin obverse blood decals (optical resolution limit 0.4-0.5 mm) could not only date the TS image but authenticate the linen cloh as a genuine Second Temple period burial cloth and even possibly too yield Yeshua’s “silent eulogy” (in terms of a coin rebus based on the Lezekher crypographic system), how do you mean “there is no need of coins”?  \nReminder zero: In the hypothesis the TS is Yeshua’s, in order to better adhere to the latter’s eyelids, the Pilate coins could have been  partially smeared with his own shed innocent blood \nReminder one: Hellenistic Judeans buried Yeshu’a. Joseph of Arimathea/Yossef Ha-Ramathaym (aka Joseph Barnabas/Yossef Bar Naba) and Nikodemos/Naqdimon most likely were hellenestic Judeans (see Acts + Talmud of Babylone) and  liberal Pharisees (with a Sadducean background?) from the Island of Cyprus  then known as Cryptos.\nReminder two: in the Second Temple period, no eulogy should be pronounced during burials occuring in the month of Nissan.\nReminder three; Experimentally, Moroni, Rodante and myself could record one Pilate coin, one ancient coin of Syracuse and one Euro cent coin tiny characters respectively on a 3/1 twill fabric in-soaked with a watery solution providing the coin was partially smearded with blood and pressed against the fabric. There was no need of the quantum physics here!\n\n","date":"June 20, 2015 at 10:37 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202934","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Eyes Have It?","post":"Typo: authentificate\n\n","date":"June 20, 2015 at 10:38 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202935","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Eyes Have It?","post":"Reminder four: Raking light can help to emphasize the texture of various impressions and reveal invisible and/or nearly invisible evidence to the naked eyes. Ideally, the suspected areas should be examined not only under raking light but UV light, alternative light and 3D laser scanning in conjunction with 1st, 2nd and 3rd generation photographs + 3D enhanced  images and digital squeezes (along with the use of false colours) + full Pilate coin obverse reconstructions from extant coins in light of the partial impressions .\n\n","date":"June 20, 2015 at 11:21 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202943","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Eyes Have It?","post":"To anyone who is an expert in this area of study (Sorry Max, I don’t know your background, I mean no offense if you are an expert): I would be very interested to read if there are papers that treat this subject.\n\n","date":"June 20, 2015 at 2:44 pm","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202960","author":"Dcn Andy","site":"shroudstory"},{"title":"The Eyes Have It?","post":"Research showed that Fr. Filas read a report from Jumper, Stevenson, and Jackson titled, “Image of coins on a burial cloth?”  Using the VP-8 image analyzer the report states, “revealed objects resting on the eyes, objects which resembled small disks or buttons”. They further investigated the customary of jewish burial customs and were told that it was customary to place objects over the eyes of the dead.\nThe report also stated, “With the photographic work, we hope to obtain very fine quality pictures which, among other things, can be used to take much of the noise out of the image, noise present, for example, from the weave pattern of the cloth”. \nBased on this report, Father Filas used it as a resource and conducted his own experiment after he believed that he too saw an object from an Enrie copy given to him by the Holy Shroud Guild.\nAndy I recommend you start with Haralick’s “Analysis of digital images of the Shroud of Turin”.\n The Spatial Data Analysis Laboratory was given an 8×10 copy negative produced at Gamma labs. and 5×7 prints from a 20×24 print that was manufactured from the 8×10 copy negative.\nFigure 8, from “Analysis of digital images of the Shroud of Turin”, shows a severally reduced gamut from the original fiber base print. At this point there is no longer a relation from the original photograph to this copy. Any further investigation now needs to evaluate the differentials of the characteristics of the original image to the copies; which would include, film curve characteristics, processing characteristics, lens and film dynamic range, optical resolution, film fog from bellows extension, reciprocity and so on. All of these effects were overlooked which, makes the Haralicks report, virtually useless. As we say in the industry, GIGO\n\n","date":"June 20, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202973","author":"Giorgio HSG","site":"shroudstory"},{"title":"The Eyes Have It?","post":"On October 15, 2014 at 12:20 pm, I wrote: \n“In a research paper, THE COINS FROM EL-KABRI, (‘Atiqot 51, 2006), Danny SYON wrote:\n“Charon’s obol, originally a classical Greek mythological theme, is referred to in ancient Greek and Latin literature as the payment required by the ferryman Charon to reach the mythological underworld. The latest mention of the custom is by the second-century CE Latin author Apuleius (Metamorphoses VI:18). In the classical theme, the obol, or a low value copper coin in general, should be placed in the mouth of the deceased immediately after death.The archaeological record provides us with a wealth of coins found in tombs but it would be incorrect to associate all of them with this custom. Indeed, at least in Greece, the custom of providing the dead with coins is older than the mythological tradition of Charon (Stevens 1991:227). It seems that the custom underwent considerable changes in the Roman and Byzantine periods.\nOriginally, Charon’s obol was placed in the mouth or clenched between the teeth; in later burials, we ﬁnd COINS PLACED ON THE EYES or in the hand (Stevens 1991:225).here were also changes as to when the coin was placed (at death or upon burial) and the number of coins. Charon did not exist in the Roman religious tradition.\n(…) coins cannot be deﬁnitively associated with the custom (Charon’s obol), even if found near the body, and are usually recorded as ‘grave offerings’ (…) coins were found in the mouth of the deceased at Gesher Ha-Ziv(Mazar 1994:78, eight examples) and Lohame Ha-Geta’ot (Peleg 1991:133, four examples); clenched between the teeth at Nahariyya (Barag 1986:399) and Mampsis (Negev 1971:119); PLACED ON THE EYES at Hurfeish (Shaked 2000) and ‘En Boqeq (Gichon 1970:139); or held in the hand, as at Lohame Ha-Geta’ot (Peleg1991:133).”\nActually, even Charon’s obol could be placed on the eyes (early in the second century CE). Most likely  hellenistic Judeans revisited the custom and adapt it to Judean burials to make “silent eulogies” as coin rebus (a kind of word puzzle that uses coin devices and legends –here Hebrew and Aramaicl wordplays from Greek– to represent words or parts of words or else trigger off a biblical verse or funerary formula in Hebrew. From the latin phrase nōn verbīs sed rébus, “not by words but by things”).\n\n","date":"June 20, 2015 at 6:57 pm","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202980","author":"Max patrick Hamon","site":"shroudstory"},{"title":"The Eyes Have It?","post":"I am providing a link of 4 images inside one document of the section of the eye where the lepton coin is present. The top row marked 1 & 2 are scanned from the gamma prints at 800 dpi. Image 1 contains the overlay for reference and image 2 does not.\nImage 3 and 4 are overlaid with the original scans from the Enrie photo at 800 dpi. Image 3 the image opacity was set at 50% and image 4 is set at 100%. ","date":"June 20, 2015 at 9:50 pm","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-202997","author":"Giorgio HSG","site":"shroudstory"},{"title":"The Eyes Have It?","post":"Reminder for Giorgio:\nhttps://shroudofturin.files.wordpress.com/2012/12/clip_image020_thumb.png?w=729&h=413\n\n","date":"June 21, 2015 at 6:30 am","url":"https://shroudstory.com/2015/06/20/the-eyes-have-it/","cat":"pareidolia","id":"comment-203051","author":"Max patrick Hamon","site":"shroudstory"}]
