[{"id":"comment-85294","author":"matthias","post":"Superb response Daveb. At this stage we can summarise possibilities assuming the “authentic” position as follows: 1. Cloth laid on top of head 2. Kippah or equivalent on top of head 3. Cloth as Jaw band brought around top of head and tied 4. Lack of imaging action through top of head I see 3 as most likely of these options, followed by 1 Further thought, how about crown of thorns? I’ve previously dismissed this…..but….. What if the thorns in the crown were impressed quite deeply into the head? This may have made removal (without serious messiness / bloodiness) difficult, and perhaps it was left, hence removing the shroud slightly from the head hence the lack of image?.","date":"2014-03-05","mins":"9:40 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85341","author":"matthias","post":"Mike M – I take your point on the mocking aspect, and that has been why I have considered it unlikely that the crown was left on Christ’s head. However, what do you think about the possibility the crown might have been quite embedded in Christ’s head and difficult to remove without great messiness? Most of us have probably experienced the way thorns can embed themselves in flesh quite deeply And especially as the process of washing and enshrouding Christ might by necessity have occurred in quite a rushed manner.","date":"2014-03-06","mins":"12:46 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85601","author":"matthias","post":"Good points, certainly feasible ideas. But again I want more evidence – this time for flowers being used in second temple burial practices. Max / anyone: any papers that might support this?.","date":"2014-03-06","mins":"4:01 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-85602","author":"matthias","post":"Yannick your last point is a good one. Re the idea of a small cloth on top of the head. I guess if the head was messy / gory due to the removal of the crown of thorns the idea of a small head covering cloth has merit. And maybe this could be the head cloth referred to by John?.","date":"2014-03-06","mins":"4:04 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-86066","author":"matthias","post":"I agree. Yannick’s dogmatic stubborness is most frustrating at times. I measured and agree with Hugh / Daveb.","date":"2014-03-07","mins":"11:17 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-87190","author":"matthias","post":"Any other thoughts from Hugh / Daveb? I’m always happy to be proven wrong, and I think I was and Yannick is right. Hugh, Dave: you still think he’s wrong?.","date":"2014-03-10","mins":"11:49 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-86385","author":"matthias","post":"Perhaps I have been too hasty in my judgement. Some thoughts from having a look on shroudscope… I think the top of the frontal image finishes quite high up above the forehead above the hairline. And on the backside of the head the image similarly seems to finish quite high up. I now think the distance between the head images might be 3 4 cms greater than it should be which could be explained by cloth lifted above some head top obhect or the slight looseness away fron full contact that Yannick suggests.","date":"2014-03-08","mins":"10:45 pm","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-87202","author":"matthias","post":"Well, I think he’s right now. Go to Shroud Scope. I think the image / blood stains on the back of the head extend towards the centre of the top of head (ie where a couple of blood stains overlap into the watermark area). Centre of the top of head to a point just above the hairline then only measures (at least on my head) about 12 13cm. Distance on the cloth measures about 17 18cm from my measurement. Hence discrepancy! disagree????.","date":"2014-03-11","mins":"12:46 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-87268","author":"matthias","post":"What a grumpy old man…so much for an open scientific mind…Very very disappointing as you are someone whose views I have respected in the past but no longer. So disappointing Matthias of Queenstown, formerly of Adelaide and originally from windy Wellington.","date":"2014-03-11","mins":"4:18 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-87269","author":"matthias","post":"Some of the older statesmen on this site really act like little children…some of you guys should really be ashamed.","date":"2014-03-11","mins":"4:20 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-41938","author":"matthias","post":"Just on this… Does anyone know anything about the text in the Hungarian Pray Manuscript? We all know the much analysed drawings, how about the text? Might the text provide some context o the pictures? Or are the pictures elements somehow isolated from the text? Would seem unliekly to me. Maybe the text refers to the shroud? Anyone out there can shed some light on this?.","date":"2013-08-25","mins":"4:44 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-86821","author":"matthias","post":"I’ve just had a good look on Shroudscope on a full screen rather than my mobile. I think image / blood stains on the back of the head are evident close to the middle of the top of the head. I think the lower blood stains on the back of the head are around the middle of the back of the head or probably a bit higher, which definitely places the stains overlapping the water mark close to the centre of the top of head. Hence I think again that Yannick might be right – the gap is larger than it should be, which could be explained by the shroud not being wrapped tightly over the top of the head, but rather some slackness leading to a gap and hence a lack of image..","date":"2014-03-10","mins":"2:19 am","url":"https://shroudstory.com/2014/03/05/concerning-the-absence-of-an-image-of-the-top-of-the-head-on-the-shroud-of-turin-and-the-possible-presence-of-blood-in-this-area/","cat":"blood_studies","title":"Concerning the absence of an image of the top of the head on the Shroud of Turin and the possible presence of blood in this area"},{"id":"comment-42029","author":"matthias","post":"Thanks Dave. Yes, perhaps the Mystery Play might be more fruitful..","date":"2013-08-25","mins":"11:31 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42055","author":"matthias","post":"Well there are plenty of ‘shroudies’ – like me – who do not accept uncritically everything Wilson has said on the shroud. In fact there are some things I outright disagree with. Notwithstanding this, he has made some great findings over the years which are credible..","date":"2013-08-26","mins":"7:52 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42058","author":"matthias","post":"I have to confess that I am fascinated by the codex. A thought that has occured to me today. Assuming the mandylion and the shroud were two different objects (not Wilson’s theory!), could the empty tomb scene be illustrating the shroud with the mandylion resting on top of it? With the mandylion, the face sized cloth symbolised by the alpha letter (or whatever it is) connecting with the face of Jesus next to Mary’s sleeve? And the Shroud the long rectangular object below it, symbolised by the diamond shape in its centre (with crosses inside) symbolising Christ’s image through the central part of the shroud, with the two red streaks just to the left of it symbolising the blood on the cloth, and the L shaped arrangement of 4 holes (which atheist De wesselow describes as not making any sense as an artistic feature due to its odd assymetry) just to the right. Assuming the mandylion and the shroud were separate objects and both in Constantinople, then it is quite possible that a holy man or party of holy men either travelled there and viewed them, or were told of the relics and their details. Remember Hugnary and Constantinople were very strongly connected in the 12th century. Thoughts?.","date":"2013-08-26","mins":"8:36 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42030","author":"matthias","post":"It’s hard to think the pictures have no association with text. But potentially they could sit in isolation as a pictorial account of the deposition, burial and resurrection. What would be “gold” is text along the following lines ” And Jesus was wrapped in the holy shroud which is now kept in Constantinople”. Probably unlikely. But it would be good to somehow get a translation of the Mystery Play to confirm / deny..","date":"2013-08-25","mins":"11:37 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42131","author":"matthias","post":"Hugh, that is an excellent text!!! I can see how some think that the rectangular object many shroudies claim represents the shroud is actually a sarcophagus lid, as there are many representations of sarcophagis and their lids in the history of art. I’m not entirely sure what to think. I think someone (maybe Max?) has previously argued that the object represents a lid AND the shroud. In many paintings the angel points to two linen objects. If the rectangular object is the shroud, and then sitting upon that is a further cloth, then the codex image is consistent with that. Note page 3 of chapter 3 of Brooks’ book says of representations of the time : “the open tomb. Angel clothed in white is seated on the lid; he holds a lance with one hand and with the other points to the shroud AND winding sheet in the bottom of the tomb” (my capitals) You can faintly make out in the codex image that the angel is sitting on a box like object (a stone?) rather than on the rectangular object. The 4 L shaped cricles are still curious to me. At one point I thought they may symbolise holes like in a ten pin bowling ball ie. Holes you could put your fingers into to lift a lid up. But I doubt it. I’ve seen no precedence of such for a sarcophagus lid. And the two red streaks make absolutely no sense other than representing Christ’s blood. Overall, I am more compelled than not that the object DOES represent the shroud, especially when coupled with the very shroud like image of Christ being anointed above it..","date":"2013-08-27","mins":"9:47 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42372","author":"matthias","post":"But Yannick the whole point re : the resurreciton is that it is an inexplicable supernatural phenomenon! By its very nature it contradicts the laws of nature! If you accept this, then there is every reason to believe that the image was created by a phenonemon that contradicts the laws of science. So it then becomes futile trying to explain the image creation via scientifically verifiable means, ie. Radiation etc. I agree that the dematerialisation of Christ’s body didn’t necessarily release radiation which created the image. My point is, because that dematerialisation is scientifically inexplicable, there is every chance that a scientifically inexplciable process caused by that dematerialisation created the image! Then, logically, if we accept that, then we will never be able to explain the image creation. Of course, the Shroud image could have been caused by natural gases etc.as you suggest. That is not intrinsically incompatible with the resurrection still occuring…BUT my point is, if you believe in a literal resurrection, then at the very least you should consider a supernatural, scientifically inexplicable image formation process at least a POSSIBILITY (even if a remote one) as the shroud covered the body that went through this supernatural process.","date":"2013-08-29","mins":"8:49 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42363","author":"matthias","post":"Yannick I find your resistance to any possiblity of a supernatural cause for the image formation curious. Do you believe the resurrection was metaphorical? Because as I said to Hugh, if the resurrection was a real, literal event, then there is nothing illogical in arguing that the shroud is a by product of that real, literal (albeit supernatural) event. I’m not saying categorically that the shroud image was created by the resurrection. But I am saying that if you are a Christian and belive in a literal rather than metaphorical resurrection, then it is at least a possibility that should not be rubbished..","date":"2013-08-29","mins":"6:51 pm","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-42384","author":"matthias","post":"OK thanks Yannick, good paper, and glad to see you acknowledge a supernatural cause as at least a possibility!.","date":"2013-08-30","mins":"2:30 am","url":"https://shroudstory.com/2013/08/22/google-mccrone-and-my-dog/","cat":"blood_studies","title":"Google, McCrone and my Dog"},{"id":"comment-40006","author":"matthias","post":"Well, another possibility is that the scourge marks are authentic and some or all of the other blood stains are later add ons. I’m not saying that is the answer, rather just a possiblity. Eg wouldn’t blood stains down the forearm more likely be a pre mortem feature (whilst Jesus is still alive on the cross) as opposed to post mortem phenomenon ie. The forearm flows.","date":"2013-07-29","mins":"3:53 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-40010","author":"matthias","post":"In the dorsal image, there is an absence of scourge marks around the region of the small of the back. I would suggest this is due to the fact that the small of the back region would not have pressed down onto the shroud unlike the central back region and buttocks, hence the scourge marks which would have also been on Jesus’s body on the lower back did not transfer onto the shroud. Now if the scourge marks on the small of the back did not transfer, because there was no contact between the small of the back and the shroud, then where does that leave the horizontal trickle of blood running along the lower back? This would mean that either this trickle somehow flowed down from the dead man’s ribs and dripped down and ran along the shroud AFTER he was placed in the shroud, or it is a later fabrication (it wouldn’t make sense that the body was washed first, except for a post mortem trickle of blood across the lower back, then the flow we see on the lower back region on the shroud was transferred by contact between body and shroud when the absence of scourge marks strongly indicate there was no contact – if you get my drift!). If it was the former, then that could explain why the trickle is so close in one or two spots to the scourge marks, getting around Yannick’s questions around the precision of the clean up. Think about it, only really (impossibly?) thick blood might run down the ribs of a horizontally laid out corpse and run all the way along the small of the back. More likely is the blood fell off the side of the body and trickled along the shroud, carried by the momentum and velocity of a flow across the ribs and the fall of the blood, and presumably more fluid blood (possibly with water?) I don’t know, there’s something odd about the lower back trickle relative to scourge marks. But question for people more biology literate than me… if Jesus was hours dead by the time he was placed in the shroud, what chance there might be of more trickling out of blood that far after the death event??? it seems quite unlikely that there would be post mortem blood flows maybe 2 3 hours after Jesus had died on the cross… Thoughts????.","date":"2013-07-29","mins":"4:33 am","url":"https://shroudstory.com/2013/07/28/guest-posting-challenging-frederick-zugibe-on-washing-of-the-body/","cat":"blood_studies","title":"Guest Posting: Challenging Frederick Zugibe on Washing of the Body"},{"id":"comment-47618","author":"matthias","post":"Excellent comments Dan. I agree with your conclusions. I especially like your ideas in the last paragraph. I think there is a good chance that the shroud will forever remain an unexplainable object. A mystery. Is that a bad thing?.","date":"2013-10-16","mins":"6:44 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-24947","author":"matthias","post":"Hugh, fair point I apologise. I read your post late at night here in Australia, and regrettably rushed the read and response! I am yet to experiment with tomato ketchup or whatever! Potentially I think if the body was in a stiffened post mortem body state (forgotten the tehcnical term) then the blood could trickle down from the underside of the forearms across the lower back. But only a theory! I agree there is no pooling of blood..","date":"2013-02-19","mins":"9:58 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-47625","author":"matthias","post":"‘The reason everyone, included some who believe in authenticity, are reluctant to state a conclusion, is because behind the issue of authenticity lurks the fundamental issue of our existence: the Resurrection.’ I disagree. Although I think on balance the shroud is quite likely to be authentic, I stop short of being certain in my conclusions. One of the main reasons for this is the carbon dating. Yes, I know it has its critics, and I am open minded enough to consider that it may be flawed. But until more carbon dating is done that refutes it, I think this is a barrier to a more conclusive view..","date":"2013-10-16","mins":"7:22 am","url":"https://shroudstory.com/2013/10/16/holding-the-shroud-to-an-impossible-standard/","cat":"blood_studies","title":"Holding the Shroud to an impossible standard?"},{"id":"comment-24948","author":"matthias","post":"Good points Hugh, there is not necessarily a black or white answer/s. Like you, I think there is the potential that the shroud is an authentic relic of Christs’s crucifixion, however this was modified over time by things like blood touch ups etc..","date":"2013-02-19","mins":"10:01 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-24972","author":"matthias","post":"Further thought. Why would a touch up with blood include the placement of a trail of blood across the lower back? It doesn’t make any sense, in terms of an attempt to try and “sell” the relic as the authentic burial cloth of Jesus. Side wound – yes. Wounds on head – yes. Wrist wound – no. Trickle of blood across small of back – no. Of course, there is always the possibility that some monk thought a trickle of blood across the back would be a nice addition. But I am not convinced. There is no biblical or artistic precedence for it..","date":"2013-02-20","mins":"2:08 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-25076","author":"matthias","post":"Ha ha yes my wife definitely thinks I am bonkers! Thanks. Yes the trails along the small of the back are very interesting and curious. If you can, I’d be interested in what you find from a self experiment!!!! Still lots of questions / issues with my theory…..","date":"2013-02-20","mins":"4:48 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-24984","author":"matthias","post":"Did a quick experiment with thick orange juice, lying down with my torso raised at about 20 30 degrees. Juice was poured back from just behind wrist position, its trail carried through my hip region, and extended some way through to my back. Repeated on the other side, and there were two trails nearly connecting, approaching something not too dissimilar to the trail on the shroud back image. I’m slightly stocky around the mid rift, a lean Jesus is somewhat different, this would no doubt have impact! (possibly would get more shroud like result with leaner body under experiment!) Not very scientific, I know, but I thought interesting at least.","date":"2013-02-20","mins":"4:21 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-38680","author":"matthias","post":"Interesting points. I am currently interested in the idea that some or all of the most prominent blood stains were a medieval ‘add on’. Under this theory the scourge marks might be authentic, as might the trickles of blood across the lower back, which I theorise were not produced by direct contact between body and cloth, but rather were the product of some post mortem blood flowing down fron the wrist wounds, running off rhe hups and hitting the cloth below, creating a small pool, then trickling back in towards the area of the cloth belo the middle of the lower back..","date":"2013-07-07","mins":"12:37 am","url":"https://shroudstory.com/2013/07/06/reader-has-jackson-come-to-realize-this/","cat":"blood_studies","title":"Reader: Has Jackson come to realize this?"},{"id":"comment-25131","author":"matthias","post":"I just redid my experiment, this time with coconut oil (after I bathed my five year old in the bath with touch of oil, helps her eczema). I assumed the shroud pose, and started on the left side. On the left side I took two tablespoons of oil and slowly fed it under my wrist, which was sitting over the left side of my lower waist.After a brief mini pooling around the wrist area, two thin trails of oil escaped down through my hips, running around my back, not quite to the mid point of my lower back. I repeated the same exercise on my right side, this time with one tablespoon of oil. Again I got a similar trail, but only one this time, probably a result of less oil volume. A question I have is this fine in theory, but how might it have happened in reality. Was Jesus wrapped in the shroud shortly after being brought down from the cross, and there was some immediate post mortem bleeding from the wrists which caused these trails of blood on his bac kto be transferred to the shroud? Thoughts? I’d be interested to hear if others get the same results from the same experiment…..","date":"2013-02-21","mins":"6:48 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-38681","author":"matthias","post":"Sorry smart phone typos, ‘rhe hups’ should read ‘the hips’.","date":"2013-07-07","mins":"12:39 am","url":"https://shroudstory.com/2013/07/06/reader-has-jackson-come-to-realize-this/","cat":"blood_studies","title":"Reader: Has Jackson come to realize this?"},{"id":"comment-13943","author":"matthias","post":"Get real Colin Berry? It’s you Shroudies who have to get real!!! I don’t have an answer as to how the shroud was created, but there are a number of facts that argue against authenticity: – The figure in the shroud is over 6 feet tall, he would have been a giant if he existed in Jesus’s time – The figure’s hair flows straight down, if it was a real man laid down then the hair would have fallen back – the arms are too long and the face is too long and narrow Flagellants were common throughout the 1300s, it’s likely this admittedly clever fake was influenced by the flagellants, and the image is consistent with the growing depiction from the 1300s of a suffering Christ Note: I am a Christian, but I don’t take the Shroud’s authenticity seriously.","date":"2012-07-18","mins":"6:04 am","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","title":"Reality: Get Real Colin Berry"},{"id":"comment-13997","author":"matthias","post":"Ron I would appreciate a more constructive apporach to enquiry and debate. I come to this forum as rather skeptical, but still open minded enough to consider alternative views, and even to re evaluate my skepticism….. Thank you for your response on the question of height. I would be most appreciative if you can provide references for your points 1 and 2 above. An average height of 5’11’ sounds very tall – that is roughly the modern day average of northern Europeans.","date":"2012-07-19","mins":"8:33 pm","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","title":"Reality: Get Real Colin Berry"},{"id":"comment-13964","author":"matthias","post":"Ron / daveb I would appreciate your views on why my points are not supported by evidence. You never know, compelling answers might change my mind…..","date":"2012-07-18","mins":"6:24 pm","url":"https://shroudstory.com/2012/07/17/reality-get-real-colin-berry/","cat":"blood_studies","title":"Reality: Get Real Colin Berry"},{"id":"comment-26559","author":"matthias","post":"Daveb – I tend to agree. If the shroud does date from the 1st century, I think its highly unlikely that it was not Jesus’s shroud In my view, there are two clear options: 1. The Shroud is Jesus’s burial cloth 2. Colin Berry is right Berry gets knocked here, but in my view his theory is perhaps the only credible anti authenticity argument going. Sure, there are some challengeable aspects to his theory, but so there are for the theory that the shroud is Jesus’s burial cloth.","date":"2013-03-05","mins":"8:20 pm","url":"https://shroudstory.com/2013/03/05/sturps-rudolf-dichtl-bloodstains-real-and-carbon-14-dating-has-to-be-redone/","cat":"blood_studies","title":"STURP’s Rudolf Dichtl:  Bloodstains Real and Carbon 14 Dating has to be Redone"},{"id":"comment-25785","author":"matthias","post":"Agree Yannick I would still view the process you propose as a ‘miracle’, just as the hard to believe radiation theory would be a ‘miracle’. Because it would obviously be a very rare and perhaps historically unique record of the wrapping of a dead corpse, which just happened to be that of Christ Not a miracle in terms of contradiction of laws of nature necessarily, but miracle in a different sense ie. A unique realisation as a historic record of Christ through the laws of nature.","date":"2013-02-26","mins":"9:36 pm","url":"https://shroudstory.com/2013/02/26/that-is-not-what-one-would-expect-to-see-if-the-blood-first-dogma-were-true/","cat":"blood_studies","title":"That is not what one would expect to see if the blood-first dogma were true."},{"id":"comment-46607","author":"matthias","post":"Gee, my 5 year old daughter is more mature (and intelligent) than some here…..","date":"2013-10-09","mins":"5:44 am","url":"https://shroudstory.com/2013/10/08/you-guys-are-brutal/","cat":"blood_studies","title":"You guys are brutal"}]
