[{"id":"comment-48347","author":"matthias","post":"So yes I definitely think Zugibe rather than Barbet is right..","date":"2013-10-22","mins":"4:18 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48346","author":"matthias","post":"I challenge everyone to measure on shroud scope the distance from the tip of the fingers to the wound mark. If I compare it with my own hand which seems to have similar dimensions to the shroud man hand, it comes out just slightly below mid palm. I’d be interested in others’ own measurements. I believe Barbet was wrong and the notion that the wounds on the shroud are on the wrists is one of a significant number of Shroudie myths that some pro authenticitists churn out ad nauseum!.","date":"2013-10-22","mins":"4:17 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48084","author":"matthias","post":"Interesting, but a long bow to directly connect this to the shroud..","date":"2013-10-20","mins":"6:17 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48196","author":"matthias","post":"Hugh is absolutely right.","date":"2013-10-21","mins":"5:25 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48194","author":"matthias","post":"‘No art historian am I, but I don’t see how any artists, medieval or otherwise, could have used the Shroud as a subject model to any great detail. For starters the image is so faint, able to be seen only at a distance in any detail, that I can’t imagine an artist getting much forensic detail from it.’ Hurrah! Great comment! It’s one of the reasons why the so called “Vignon markings” are nonsense. Some of them MIGHT make sense if ancient artists were privy to the modern photographic images, which of course they were not. The Pray manuscript images, on the other hand, could easily be conceived as being based on a viewing of the faint image, as there is enough in that faint image to indicate a nude Christ with hands folded etc. , plus the L shaped holes would have been VERY prominent at the time (ie. Predating later fire burn marks) and hence make great sense in depicting. The faint image is also consistent with Wilson’s Mandylion hypothesis, with historical references to faint images etc So, call me a skeptic of V Ignon etc, but a believer in the PM and the Mandylion hypothesis!.","date":"2013-10-21","mins":"4:41 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48204","author":"matthias","post":"Just checked de Wesselow’s book and he also says left over right.","date":"2013-10-21","mins":"6:36 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48206","author":"matthias","post":"I presume you mean ‘convince OK’ it’s left over right – Hugh already thinks it’s left over right as do I and the authorities quoted above. The sole of the right foot’s image is on the cloth, part of the heel of the left foot is visible.","date":"2013-10-21","mins":"6:40 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48208","author":"matthias","post":"OK…..no no no NO! Go to shroud scope, and the Durante horizontal image: http://www.sindonology.org/shroud Scope/shroud Scope.shtml now pretend you are facing the cloth, the frontal image…what appears to be his left foot is actually his right foot. Then you mentally fold the cloth over your head, what looks like the left foot on the dorsal image is actually the right foot. Sorry you are wrong, no more debate required or necessary!!!!!!!!.","date":"2013-10-21","mins":"6:52 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48216","author":"matthias","post":"I give up!!!!! Good night!.","date":"2013-10-21","mins":"7:26 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-46569","author":"matthias","post":"Hugh The top image of the shroud only need be longer than the bottom one if the legs were significantly bent, with the feet pulled up closer to the buttocks. A slight bending of the knees allows for minimal length difference, and also allows for contact between the calves and part of the underside of the thighs with the sheet.","date":"2013-10-08","mins":"9:28 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-48302","author":"matthias","post":"Yes a few weeks ago I did some measurements on shroud scope and my own hand too (at 6 feet 2 and 200 pounds I’m a very convincing Shroud man imitator!). By my reckoning the wound is slightly below the mid point of the palm, and NOT on the wrist..","date":"2013-10-21","mins":"5:25 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-50265","author":"matthias","post":"Sorry off topic… here in Aus, hot news on the ABC today was the fraudulent research of University of Queensland researchers re: Parkinson’s disease. Here is an older article, nothing newer I can find: http://www.abc.net.au/news/2013 09 03/uq investigates study that might never have happened/4932648 Just once again shows that academics are not necessarily saints, and that ‘research’ can of course be tainted by the almighty $$$ Note I am not implying that the radiocarbon work was fraudulent, but rather just aim to show that fraudulent research at credible academic institutions can and does occur.","date":"2013-11-07","mins":"3:59 am","url":"https://shroudstory.com/2013/11/06/blowing-the-antonacci-proposal-to-bits/","cat":"carbon_14_dating","title":"Blowing the Antonacci Proposal to bits"},{"id":"comment-50270","author":"matthias","post":"Let’s see what John Klotz or Joe Marin come up with…comments a few weeks ago imply fraud.","date":"2013-11-07","mins":"4:38 am","url":"https://shroudstory.com/2013/11/06/blowing-the-antonacci-proposal-to-bits/","cat":"carbon_14_dating","title":"Blowing the Antonacci Proposal to bits"},{"id":"comment-50278","author":"matthias","post":"Sorry again off topic. I’ve just viewed Barrie’s TED talk. Good presentation, he comes across very likeable. Interesting that he seems a big believer in Shroud authenticity, but has reaffirmed his Jewish faith. So, I can only guess he considers a naturalistic cause for the Shroud image (I’m assuming if he believed in miraculous creation he might have converted to Christianity?).","date":"2013-11-07","mins":"5:55 am","url":"https://shroudstory.com/2013/11/06/blowing-the-antonacci-proposal-to-bits/","cat":"carbon_14_dating","title":"Blowing the Antonacci Proposal to bits"},{"id":"comment-37805","author":"matthias","post":"David Goulet at 7.09 pm Yes, that interpretation is correct. The scenario I raised was that the body image was created from Christ’s body, there were no bloodstains (with Christ having been washed, and no post mortem blood flows leaving stains on the cloth), then later, perhaps in the middle ages, blood was applied onto the shroud, in an effort to elevate the shroud’s status as a holy relic. Some historic evidence provides some support for this idea. Robert de Clari’s account of 1203 refers to Christ’s figure, but not to a bloodied and crucified figure. The lack of reference to a “bloodied” figure does not of course mean the image he was referring to was NOT bloodied. In addition, Nicholas Mesarites in 1201 refers to the image as the “un outlined, dead, naked and embalmed body”. Again, no specific reference to bloodstains, but again does not preclude the possibility that the image WAS blood stained. The reference to the dead body might imply bloodstains, or it might not. Similarly, the Pray Manuscript shows Christ laid out, being prepared for burial, and about to be wrapped in a shroud. Again, this image does not show a bloodied Christ. Note, I am not saying this is what I think definitely happened. The point of this scenario was to counter Colin’s view that if the bloodstains were on top of the body image, then the case for authenticity would be destroyed. As I outline, the case would not be destroyed, although it probably would be weakened. There are some difficulties for this theory, chief amongst them in my mind: – If the blood was added in the middle ages, why the curious trickles of blood across the lower back. Whilst other blood wounds are conceivable as a middle age addition, these trickles of blood argue for the cloth having wrapped a real dead body – in my view the blood stains appear hyper real, such as the foot stains. Can we really think that these hyper real blood stains were added in the middle ages, when the depiction of Christ’s blood stains were typically very ‘unrealistic’ (a couple of small red dots on the hands and feet, a little gash and trickle of blood from the side wound). Or maybe the middle ages “blood adder” was really determined to do a really convincing ultra real addition?.","date":"2013-06-22","mins":"8:10 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-50277","author":"matthias","post":"Agreed. That’s why I keep an open mind until I see the evidence, rather than the implications :).","date":"2013-11-07","mins":"5:26 am","url":"https://shroudstory.com/2013/11/06/blowing-the-antonacci-proposal-to-bits/","cat":"carbon_14_dating","title":"Blowing the Antonacci Proposal to bits"},{"id":"comment-37808","author":"matthias","post":"In the excellent case that art historian Thomas de Wesselow puts forward in support of shroud authenticity, with regard to the bas relief theory he states with regard to the necessary 14 foot long bas relief: “The imagined sculpture would have been extraordinary: it would have been vast compared with any other bas relief of the time” and would have been created by “some eccentric genius” – a high bar. Clearly, the well credentialed art historian de Wesselow considers the idea that the image was created from a bas relief unlikely..","date":"2013-06-22","mins":"8:28 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37809","author":"matthias","post":"Actually upon reflection Mesarite’s reference to the “embalmed” body would probably argue for a non blooded image of Christ.","date":"2013-06-22","mins":"8:31 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37713","author":"matthias","post":"Actually, if the bloodstains came after the image then the shroud could still be authentic authenticity would not be ruled out by this fact, although the case would be weakened. A valid scenario could be that the image was created somehow from Christ’s body, and the blood was added later to reinforce the image. The trickles of blood along the lower back still seems to me an odd feature if the blood WAS added to the image – what purpose does that serve, beyond the obviously addition of blood to wrists/hands, head etc?.","date":"2013-06-22","mins":"5:30 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37717","author":"matthias","post":"Colin can you please explain why a medieval artist would create a bas relief that shows the hyper realistic, assymetrical foot positions that evidently created the image.Also why the gap between the head images rather than just having continuity in the heads on the bas relief? Also just doesn’t seem credible to me that someone creating an image of de Molay would feel the need to do the dorsal image with buttocks etc. I’m really struggling to find this theory credible at all..","date":"2013-06-22","mins":"5:41 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37739","author":"matthias","post":"Colin said: “Hardly your most constructive contribution to date, Matthias, at least not the first paragraph. In fact I’d describe it as somewhat perverse and unhelpful.” I disagree. A scientific mind would acknowledge the possibility, if not probability, that the image might have been transferred from Christ’s body, then blood later added. I wouldn’t say it was the most likely scenario nor one that I believe applies, however not necessarily any more fanciful than some other theories. Many would describe your own theory as perverse, ..","date":"2013-06-22","mins":"8:23 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37720","author":"matthias","post":"“You Hugh concur with my view, based in my case on close examination of areas where there appears to have been partial flaking of bloodstains, that the body image is not on top of the bloodstains, as we have been led to believe – a necessary prerequisite for authenticity – but that blood is on top of image” Colin could you please advise what your “close examination” entailed – presumably examination of Shroud Scope imagery? Was there evidence of image showing through the area where the flaking off is occurring?.","date":"2013-06-22","mins":"5:50 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37846","author":"matthias","post":"Strongly disagree. Hugh farey at least seems to understand my very understandable point – see below. If you are struggling with this then I don’t know what to say….","date":"2013-06-23","mins":"5:45 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-48582","author":"matthias","post":"Yeah, it would be nice to see an independent review from an expert in this field. The review would question whether there is sufficient evidence to suggest the tests MAY be flawed. If the review answers ‘yes’ to this question, then it could recommend to undertake further tests. Or if it answers ‘no’, let’s just accept that and think of ways in which the shroud may have been ingeniously created. At the moment there seem to be a lot of theories floating about around the flaws in the tests, yet those theories seem to be being promoted by non experts, noting that the ‘non experts’ may have valid concerns (which need to be proeprly tested by experts)..","date":"2013-10-24","mins":"3:57 am","url":"https://shroudstory.com/2013/10/23/jones-none-of-the-three-laboratories-dated-its-sample-to-between-1260-and-1390/","cat":"carbon_14_dating","title":"Jones:  “none of the three laboratories dated its sample to between 1260 and 1390”"},{"id":"comment-48736","author":"matthias","post":"I’m very interested in these words. Even if they date to 10th / 11th century, they strongly hint at referring to the shroud, which would add to quite an impressive array of historic literature that points to the shroud being of an age far older than the carbon dating suggests. I’d like to know more on this – Andrea when is your paper to be translated into English?.","date":"2013-10-26","mins":"3:14 am","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-76380","author":"matthias","post":"Legalese yawn yawn what a bore I’m glad I live in a country (back to NZ from Aus a couple of weeks ago) where society isn’t dominated by libel, sueing etc. It’s obscene.","date":"2014-02-04","mins":"3:53 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-48737","author":"matthias","post":"As usual David, spot on. There are several historic references to an image on a shroud – whether face, body or face and body – that strongly point to something different from a painting, and instead something akin to the rather ephemeral image that is the image of the shroud. Now, its hard to say that these references definitely refer to the shroud and its image, but its even harder to discount them. De wesselow makes some excellent comments on some of these historic references, and as a well qualified art historian I place some credibility on his views in this respect (but he’s not a theologian or a historian of religion and I dismiss his link between the shroud and the resurrection stories).","date":"2013-10-26","mins":"3:19 am","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-44811","author":"matthias","post":"I’d like to see some thorough evidence of the robustness of this approach by seeing it applied to a number of flax fiber objects whose date is known, so that the method’s credibility can be rigorously tested.","date":"2013-09-20","mins":"5:03 am","url":"https://shroudstory.com/2013/09/20/paper-chase-giulio-fantis-new-flax-fiber-dating-machine/","cat":"carbon_14_dating","title":"Paper Chase:  Giulio Fanti’s New Flax Fiber Dating Machine"},{"id":"comment-28909","author":"matthias","post":"Why don’t we settle this…Fanti et al get AUTHORISED threads, and apply the same methodology.","date":"2013-03-30","mins":"11:16 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","title":"Res ipsa loquitur:  The facts speak for themselves."},{"id":"comment-81479","author":"matthias","post":"This type of rubbish is so counterproductive for the authenticist side.","date":"2014-02-22","mins":"4:54 pm","url":"https://shroudstory.com/2014/02/22/part-3-is-up-did-stephen-jones-make-the-case/","cat":"carbon_14_dating","title":"Part 3  is up:  Did Stephen Jones make the case?"},{"id":"comment-24138","author":"matthias","post":"I thought this to be a compelling papaer. I found her comparison between the diamond shaped water stain pattern on the torso of Christ on the shroud and a similar pattern on torsoes of images of Christ dating from around 1300 AD very interesting. Looking at that epitaphios image from about 1300 AD, I have to say it almost certain that it was based on the shroud, therefore the notion that the shroud was man made in the 1300s somewhere in france or where ever is weakened. God bless..","date":"2013-02-13","mins":"8:24 am","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong"},{"id":"comment-24140","author":"matthias","post":"Also, although not a scientist, I thought this seemed a very compelling argument for contamination affecting the C14 dating. New Pope – please allow for new tests!!!!.","date":"2013-02-13","mins":"8:38 am","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong"},{"id":"comment-24142","author":"matthias","post":"Going back to those images, so we have an epitaphios from Serbia from circa 1300 AD VERY similar to the Shroud image, Serbia is adjacent to Hungary – with the similar Pray Manuscript depiction from about 1200 AD. Then I have seen another Greek epitaphios from the 1200s with remarkable similarity to the Shroud image – this is all looking to be convincing evidence that the Shroud was in existence at least as early as 1200 1300 in this South eastern part of Europe. I think it is very hard to reconcile this evidence with Colin Berry’s theory that the image was created through scorching in France in the 1300s.","date":"2013-02-13","mins":"8:52 am","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong"},{"id":"comment-144722","author":"matthias","post":"Mmmm interesting…but still curious don’t you think that none of the depictions from the 1500s – that I know of at least – show the “blood belt”? It’s such a conspicuous feature. Maybe they painted what they wanted to see – in accordance with tradition – rather than what they did see. After all most of the depictions show a loin cloth..","date":"2014-08-19","mins":"6:21 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-144705","author":"matthias","post":"Another curiosity is why depictions of the Shroud never showed it….","date":"2014-08-19","mins":"5:17 am","url":"https://shroudstory.com/2014/08/13/stephen-jones-wants-bsts-to-remove-hugh-farey-as-editor-of-the-newsletter/","cat":"carbon_14_dating","title":"Stephen Jones Wants BSTS to Remove Hugh Farey as Editor of the Newsletter"},{"id":"comment-33399","author":"matthias","post":"Slightly off topic but…. Had lunch with an atheist friend today, he put forward an interesting argument against the resurrection which I hadn’t heard before, thought it was one of the better atheistic explanations, it goes something like this… Jesus was a highly charismatic first century social / religious revolutionary. His message and the way he sold his message was highly compelling. Most of his audience were the downtrodden, who gained hope in his message given the power of the elite jews and the romans. When Jesus died, Jesus’s follower were deeply saddened, and they did experience a feeling that Jesus’s spirit lived on, as could his message. By perpetuating Jesus’s social messages, a new movement could rise up to help give the downtrodden hope and indeed better lives. To help build such an essentially political movement. The closest followers build myth around Jesus’s life and teachings, so the bible is 50% real, 50% myth. Most centrally, the myth of the resurrection was created to build belief and support in the movement amongst the masses of downtrodden. The myth building gained momentum after the destruction of the temple, and that’s why the gospels build mythology over and above Paul’s earlier writings. Jesus’s early followers were willing to risk their lives by mythologising Jesus’s message, because there was much to gain for the downtrodden in building this new movement. Jesus’s followers didn’t have to have witnessed a real, literal, bodily resurrection to risk their lives, rather the strength and hope of a new socio religious movement was enough for them to take the risk.","date":"2013-05-10","mins":"8:28 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-33495","author":"matthias","post":"“Nor would the leaders of the movement live, die, suffer torture and martyrdom for an invented story. I used to think this, now I am not 100% sure. Plenty of downtrodden individuals / groups have risked their lives over the centuries in the name of just social causes. I think it is conceivable that the early supporters might have risked their lives because they believed in Jesus and his movement and its cause, even if they knew that the story of his resurrection was metaphor. However, whether the supporters of Jesus were downtrodden enough to make this theory potentially compelling is a big question. If Jesus’s early supporters in the 30s and 40s came from extremely downtrodden backgrounds then this might be feasible, but my understanding is that they were not oppressed in an extreme sense, in a way that would be motivating to risk their lives for a revolutionary cause. So on balance, although interested in the “invented myth”, I am not compelled by it..","date":"2013-05-11","mins":"6:11 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"}]
