[{"id":"comment-50276","author":"matthias","post":"I disagree. I think the knuckles on the Enrie negative are quite a lot further back towards the wrist than what you suggest. I’m 6 feet 2 inches and 90 kgs, 200 lbs. So possibly quite a similar size to the Shroud man (maybe I’ve got a bit more beer belly). I measured the length of my longest middle finger to knuckle, about 10.5 cm. Maybe you have small hands. The SM fingers are not too long. They make pretty much perfect anatomical sense..","date":"2013-11-07","mins":"5:23 am","url":"https://shroudstory.com/2013/11/07/a-guest-posting-by-o-k-on-the-allegedly-too-long-fingers/","cat":"guest_posting","title":"A Guest Posting by O.K. on the Allegedly Too-Long Fingers"},{"id":"comment-50280","author":"matthias","post":"Hugh See this: http://www.dailymail.co.uk/health/article 1335155/What length index finger says you.html It’s not that rare for index fingers to be the longest. Mine is equal longest.","date":"2013-11-07","mins":"6:13 am","url":"https://shroudstory.com/2013/11/07/a-guest-posting-by-o-k-on-the-allegedly-too-long-fingers/","cat":"guest_posting","title":"A Guest Posting by O.K. on the Allegedly Too-Long Fingers"},{"id":"comment-50288","author":"matthias","post":"Colin, I know you are wedded to your scorch theory but….you are a scientist not me (I being a mere architect / urban planner), so you might be placed to answer this – could the pressure inflicted on the hands through the crucifixion and / or the action of removal of nails have torn flesh away from fingers?.","date":"2013-11-07","mins":"7:41 am","url":"https://shroudstory.com/2013/11/07/a-guest-posting-by-o-k-on-the-allegedly-too-long-fingers/","cat":"guest_posting","title":"A Guest Posting by O.K. on the Allegedly Too-Long Fingers"},{"id":"comment-50287","author":"matthias","post":"The hands are really interesting. The upper part of the hand wound measures about 15 cm to the tip of the longest finger. If I measure my hand, 15cm from the tip of the longest finger places the upper part of the hand wound fairly centrally on the hand which is where I view it on the photos, contrary to the conventional shroudie wisdom that its on the wrist, which I think is rubbish. Getting back to the long (in a relative sense) index finger. Although I said its not all that rare and I have this, its doesn’t seem all that common either, and overall the index finger usually seems somewhat shorter than the middle finger. If the shroud was based on a model, statue or bas relief one would probably expect that the model (including fingers) would be based on conventional anatomy, not a finger length that is not the norm (but is by no means exceptional).","date":"2013-11-07","mins":"7:38 am","url":"https://shroudstory.com/2013/11/07/a-guest-posting-by-o-k-on-the-allegedly-too-long-fingers/","cat":"guest_posting","title":"A Guest Posting by O.K. on the Allegedly Too-Long Fingers"},{"id":"comment-49171","author":"matthias","post":"Ok, I might be risking a hurricane but… Max you have some interesting and useful perspectives at times, but your mannerisms leave a lot to be desired, and frankly this so called epsilon connection thing is bonkers. It’s stuff like this that really gives shroudies a bad name. This is coming from me, someone who thinks on balance the shroud is probably authentic, and from me someone who thinks the Pray Manuscript is probably influenced by the shroud. So clearly I don’t have a closed mind to either authenticity nor historic art connections with the shroud predating the 1200s. You have brought our attention to an interesting historic fragment, but nothing more. Please can we move on now..","date":"2013-10-30","mins":"4:49 am","url":"https://shroudstory.com/2013/10/22/stephen-jones-on-the-stuttgart-psalter/","cat":"flagrum","title":"Stephen Jones on the Stuttgart Psalter"},{"id":"comment-49289","author":"matthias","post":"Wow, that was some hurricane..","date":"2013-10-31","mins":"3:12 am","url":"https://shroudstory.com/2013/10/22/stephen-jones-on-the-stuttgart-psalter/","cat":"flagrum","title":"Stephen Jones on the Stuttgart Psalter"}]
