[{"id":"comment-28557","author":"matthias","post":"Mesarites said in 1201: “In this chapel Christ rises again, and the sindon. . . Which wrapped the mysterious, naked body [of Jesus] after the Passion. . .” De Clari said in 1204: “there was another of the churches which they called My Lady St. Mary of Blachernae, where was kept the sydoine [French] in which Our Lord had been wrapped, which stood up straight every Friday so that the figure of Our Lord could be plainly seen there. . .” Whilst it cannot be proven that these references relate to the shroud, there must be a good chance that they do..","date":"2013-03-28","mins":"2:52 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City"},{"id":"comment-28558","author":"matthias","post":"Bela III (King of Hungary in late 1100s) spent a large amount of time in Constantinople, until 1172. He was close to marrying the Emperor’s daughter, and becoming heir to the throne. It’s quite logical to think, given the very strong ties between Constantinople and Hungary at the time, that the Pray Codex image was modeled on the Shroud.","date":"2013-03-28","mins":"3:31 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City"},{"id":"comment-28476","author":"matthias","post":"Hi Yannick Can you please provide a link / links to the historic personal accounts of the mandylion / shroud you refer to in your paper, dating from the late 1100s / early 1200s. Thanks Matthias.","date":"2013-03-27","mins":"6:01 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City"},{"id":"comment-28475","author":"matthias","post":"Great piece. Although I am a shroud agnostic, I find some of this historical case quite compelling..","date":"2013-03-27","mins":"5:53 am","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City"},{"id":"comment-28519","author":"matthias","post":"Thanks Yannick. So you would say Poulle was a credible historian?.","date":"2013-03-27","mins":"4:38 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City"},{"id":"comment-73287","author":"matthias","post":"Sorry OK I find this theory weak. Too much speculation is involved, a lot more than Wilson’s theory..","date":"2014-01-14","mins":"5:31 am","url":"https://shroudstory.com/2014/01/14/arculfus-shroud-a-guest-posting-by-o-k/","cat":"history","title":"Arculfus’ Shroud:  A Guest Posting by O.K."},{"id":"comment-73302","author":"matthias","post":"“I really appreciate the effort that has gone into this and other posts but I wonder if this issue of the Shroud’s early provenance will ever be resolved definitively. The question is: how much should this bother us? While it would be a lot easier if we had warehouse receipts and shipping labels, we are never going to have in my opinion, a definitive provenance of the Shroud from the tomb to Constantinople and I doubt we will ever have a definitive provenance from Constantinople to Lirey. ” Very well put John. What we really need is another carbon test. A further medieval date and I’d concede, and we would then still have a great mystery as to provenance to solve. A date around the time of Christ and it’s a different story..","date":"2014-01-14","mins":"8:44 am","url":"https://shroudstory.com/2014/01/14/arculfus-shroud-a-guest-posting-by-o-k/","cat":"history","title":"Arculfus’ Shroud:  A Guest Posting by O.K."},{"id":"comment-43446","author":"matthias","post":"Said like a good Wellingtonian! (From a fellow Wellingtonian now based in Australia).","date":"2013-09-09","mins":"6:54 am","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","title":"Articles on the Shroud’s History"},{"id":"comment-43447","author":"matthias","post":"Perhaps our problem is we are ‘poor colonials’ rather than European sophisticates!!!.","date":"2013-09-09","mins":"6:56 am","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","title":"Articles on the Shroud’s History"},{"id":"comment-43453","author":"matthias","post":"To those interested in free, open minded thought and speculation… I’ve been trying hard to find info about the first known epitaphios from Venice around 1200 AD, without luck. This object is referred to in brief in Schiller’s authoritative art history text..","date":"2013-09-09","mins":"7:06 am","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","title":"Articles on the Shroud’s History"},{"id":"comment-40337","author":"matthias","post":"10 TH CENTURY IMAGE OF SHROUD? Was reading a book on Medieval Art today and came across this image of Otto III’s enthronement around 1000 AD:: that is a very shroud like object being held by 4 symbols of the evangelists.","date":"2013-08-03","mins":"2:47 am","url":"https://shroudstory.com/2013/08/01/bible-archeology-the-mystery-continues/","cat":"history","title":"Bible Archeology: The mystery continues"},{"id":"comment-40728","author":"matthias","post":"Further to my earlier comment. Albert – Personally, I believe there are elements of the resurrection stories that are literal, and elements that are mythic. I have no doubt that Jesus’s followers experienced his resurrected presence, whatever that precisely was. The FACT is that we have Paul, someone who was a strong opponent of the Jesus movement, converting within just a few years of Jesus’s death. We know from Paul’s letters that he had a vision of Jesus. We also know that he attests to over 500 witnesses to Jesus’s resurrection. His account is not just based on a subjective vision that might have been a hallucination, but is also backed up by accounts of direct witnesses. Now, Paul was a pretty matter of fact guy, a pretty credible witness, and very intelligent. And he attests to those witnesses, ‘many of whom are still alive’ – in a very matter of fact way. This IS a historical account. We also know that Paul emphasized the spiritual, non material aspect of the resurrection, rather than a bodily resuscitation. You assume that Christianity is based on the revival of Jesus’s physical body. Now some Christians clearly believed that, and do today, but Paul didn’t, and neither do I! And what of the women witnesses. I know it is a cliche. But the fact remains that a made up story in first century Palestine would have hardly been likely to make up women witnesses to the resurrection. I have had a number of experiences in life that defy rational explanation. I am a Ph D with an IQ of over 150. I realise that these experiences, and my Christian belief, defy atheistic and rationalistic belief. But all I know and experience is all I know and experience. I live by that knowledge and experience, and am compelled by it..","date":"2013-08-08","mins":"7:17 am","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40729","author":"matthias","post":"Albert, one last thing. You said: “The real history is nothing like what Christians believe what happened. The modern story is a construct that has been embellished by supernatural and fantastical events through the millennia, by hundreds of believers who added them for their own purposes, never mind the translational mistakes that occurred..” Those are big statements, without much evidence, and are in fact wrong. Most of the recorded events of Jesus’s resurrection were recorded within 50 years of his death. Paul wrote some accounts within 20 25 years. Certainly, church traditions have evolved through the millennia. But the accounts in Paul’s letters, and the gospel accounts, which form the basis for the faith, were recorded in close temporal proximity to the events..","date":"2013-08-08","mins":"7:33 am","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40775","author":"matthias","post":"Great points Yannick. What do you think of Albert’s claim that Caiaphas took the body, and does my rebuttal satisfactorily refute it.","date":"2013-08-08","mins":"6:16 pm","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-40726","author":"matthias","post":"Albert said: “The story, in my and others view, is made up, by those who had an interest in maintaining calm and preventing political unrest after the execution of Jesus. Those would have been the Sanhedrin, specifically Caiaphas. They presumably did not want Jesus’s tomb to become a shrine, a place to rally and further the Jesus movement. A more plausible and more likely scenario could have involved two or more priest novices (who were traditionally dressed in white robes), sent by the Sanhedrin (Caiaphus), to remove the corpse during the night (who else could have gotten past the Roman soldiers guarding the tomb, and gotten help in removing the heavy stone in front of it). Then, they taking the corpse into the Negev desert, left it there to be devoured by wild dogs.(1) Doesn’t make sense I am afraid. Getting rid of the body and then making up a story about the resurrection would have had the effect of rallying Jesus’s followers, rather than disheartening them, especially as Jesus prophesized the resurrection, The best thing Caiaphas could do would have been to do nothing. If he did nothing, and the resurrection did not happen, then it is highly likely that the Jesus movement would have just passed. Followers will have become disheartened, and any thought of a rallying movement, however unlikely, could easily have been snuffed out..","date":"2013-08-08","mins":"6:41 am","url":"https://shroudstory.com/2013/08/07/comment-the-real-history-is-nothing-like-what-christians-believe/","cat":"history","title":"Comment:  The real history is nothing like what Christians believe . . ."},{"id":"comment-25335","author":"matthias","post":"Great analysis Yannick, I agree with it. However, whilst I think the Mandylion and Shroud are not the one and the same, I think there is the possibility that the Mandylion was based on the Shroud..","date":"2013-02-22","mins":"6:50 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-25337","author":"matthias","post":"Before I dismiss the theory that the Mandylion and Shroud are one and the same, some questions: – If the Shroud was folded and framed as the Mandylion, could it have had a glass cover to protect against dust etc. Was glass used in framing in say 400 600 AD? – If glass was not used, surely the Mandylion / shroud could have been covered most of the time, and only sporadically shown, perhaps for only a very short time (perhaps even minutes) to select audience, given its sacredness. Especially if the showings were usually in low light conditions, this might mitigate Yannick’s objections? What troubles me with the argument that the mandylion and shroud are not the same is this: if the Mandylion wasn’t the shroud, then what was it? Surely people would not have been ‘fooled’ by a painting for centuries. It is easy as modern people to dismiss the intelligence and integrity of the ancients, and claim their gullibility, but I don’t hold that view given much of the great wisdom and intelligence of antiquity. Surely, the poor uneducated masses of those days might have had those characteristics, but not the educated elite. There is a certain logic in thinking that the ghostly, un painterly like Shroud facial image COULD have presented as a mandylion that convincingly appeared as some mysterious / miraculous image of Christ’s face, rather than an obvious painting. Thoughts?.","date":"2013-02-22","mins":"7:11 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-65540","author":"matthias","post":"Just a thought I had this evening….Why would someone faking Jesus’s Shroud actually want to create a body image on it as we see on the SOT? After all, there is nothing in the Bible that says a burial cloth of Jesus was left behind with his image on it, nor anything in the bible that suggests Jesus resurrected as a radiant being that might have left a scorch on a cloth. Of course one could imagine such a scenario, and maybe that’s what a Shroud faker might have done…but art showing Christ as a radiant figure exuding light / energy does not appear until at least the 17th century Surely a cloth of ancient origin (1st century Palestine) – or at least made according to the techniques of this time in history – with bloody stains would have been the best case for a fake? eg. Something like the Sudarium of Ovieto? The traditions of the Mandylion etc speak of Cloths with a facial image either divinely transferred, or transferred via a sweat stain etc. There is simply no tradition, beyond the Shroud, of Christ’s full body having left an image – of whatever origin – on a cloth. So, following this line of thought, the SOT as a faked relic doesn’t really make any sense, nor does it seem consistent with any tradition or history.","date":"2013-12-23","mins":"8:04 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-67821","author":"matthias","post":"Hugh, interesting thoughts. Some thoughts in reply: Point 1: If one accepts the basis of your point 2 that a relic maker was trying to outdo others, why create a relic that is so obviously not typical of a shroud? Sub point (a) seems far fetched on the basis that such a determined relic maker would surely try better with the cloth given all the other efforts, sub point (b) is an interesting proposition….How long typically were altar tables? If one was 2 metres long and say 1 m high, then the 4m shroud would cover the table, and then fall down over each end of the table to the floor. If the frontal and dorsal heads were central on the altar table, then the space between the head images might have been where the bread and wine was placed….and then there would be a symbolic connection between the body and blood of Christ as seen on the Shroud, and the bread and wine….this is totally speculative but worth a shot! Point 2 I’ve always been a little bit unconvinced by the authenticist’s argument of “why go to so much effort to fake a relic when much more unconvincing fake relics were being flogged and traded”. Like any market, I’m sure more convincing fake relics could attract higher prices. So your subpoints a and b are good ones, although I think ultimately fall down for several reasons being the usual concerns around “how”. Re: your subpoint b, that’s an idea I’ve though of, but I’m just not convinced by it for several reasons, most particularly the ultra realistic body image of the dorsal (I’m convinced that no painter of that era would have depicted the body in that fashion – de Wesselow argues convincingly to that effect) Another thought…with the un shroud like dimensions of the SOT, can one contemplate Joseph of Arimathea desperately seeking SOME form of linen cloth to wrap Jesus, and being unable to obtain a typical shroud, making do with a cut from a merchant that would suffice? ..","date":"2013-12-25","mins":"7:54 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-66154","author":"matthias","post":"OK, that piece by Guscin on the Old Mozarabic Liturgy is fascinating, thank you. I’d never come across it When was it written, and where was it published? Merry Christmas!.","date":"2013-12-23","mins":"11:13 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-38692","author":"matthias","post":"Off topic, but I’m interested in challenging the so called conventional wisdom about the “wrist wound”. According to my measurements on Shroud scope, the placement of the wound would sit pretty much in the middle of the back of my hand, if I measure back from the finger tips, some 4 5cms above the wrist. So what is the basis for it being on the wrist? Now this doesn’t mean authenticity is dispelled, of course. Also, according to my measurement, the fingers on the Shroud man are NOT super long either, in fact they are very similar to my own.","date":"2013-07-07","mins":"7:40 am","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","title":"NBC News on the archaeology of Christianity"},{"id":"comment-42284","author":"matthias","post":"‘However, the Resurrection of Jesus is currently the best explanation as to how the image got on the Shroud.’ Here here.","date":"2013-08-29","mins":"4:05 am","url":"https://shroudstory.com/2013/08/28/not-proof-of-but-instead-best-explained-by/","cat":"history","title":"Not Proof Of But Instead Best Explained By"},{"id":"comment-39009","author":"matthias","post":"Sindonis is surely Sindon or shroud. Is Tars Sindonis latin? Or old French?.","date":"2013-07-15","mins":"5:06 am","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","title":"Paper Chase: The Shroud of Turin’s Missing Years"},{"id":"comment-38976","author":"matthias","post":"Interesting Yannick. What does “tars sindonis” translate as? Sainte Chappelle is truly beautiful!!!!.","date":"2013-07-13","mins":"10:26 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","title":"Paper Chase: The Shroud of Turin’s Missing Years"},{"id":"comment-39008","author":"matthias","post":"Yannick, note 11 to Crispino’s paper mentions: “The reliquary with the label still exists but the receptacle is empty.” I think this is quite important. So we need to find out what “tars sindonis” means. Does it mean “The Shroud”…???.","date":"2013-07-15","mins":"5:04 am","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","title":"Paper Chase: The Shroud of Turin’s Missing Years"},{"id":"comment-143376","author":"matthias","post":"Colin In terms of the Lier images on the web, I can’t find any that show scourge marks. Can you refer me to an image that allows closer inspection where they might be more readily seen? The depictions themselves could be a whole posting in itself. For example, as far as I can tell, Lier does not show streaks of blood down arms, and definitely does not show pool of blood across lower back. Why not? They are very prominent markings on the Shroud. Did the artist, for some reason, think them not significant? Or did they in fact not exist in the early 1500s, being later “add ons”? Also of interest – to me at least – is what looks like a chicken drumstick (!) on the frontal side of the Lier copy near the L shaped holes. Maybe a fish (symbolic)? Curious….","date":"2014-08-11","mins":"6:48 am","url":"https://shroudstory.com/2014/08/09/request-for-help-can-you-point-me-to-some-information-on-roman-scourging/","cat":"history","title":"Request for Help:  Can you point me to some information on Roman scourging?"},{"id":"comment-45022","author":"matthias","post":"Yes interesting,but speculative.further speculation the feet are cut off as per the shroud frontal image,the thighs seem unnaturally thick as per the shroud,the chest sits high on the torso as per the shroud..","date":"2013-09-21","mins":"8:36 pm","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-45018","author":"matthias","post":"Hugh,how about the 4 holes? even if you are right and thw patterned object is a lid,the holes,although not ON The piled up cloth,are close to it – associationby proximity.Similarly the red lines are not ON the cloth but adjacent to it.Similarly Jesus’s face next to Mary’s sleeve,connected to the cloth by the floating letter.Remember too that the arguments for the shroud connection extend beyond these elements inthe lower image.There is the very shroud like depiction of Jesus in the upper image,and the strong ties between Hungary and Constantinople of the time,which means the notion of a senior Hungarian monk travelling to Constantinopleto view the shroud is not at all fanciful..","date":"2013-09-21","mins":"8:25 pm","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-45055","author":"matthias","post":"Agree. Indeed, arguably none of the similarities in their own right can argue for the link in a compelling sense. It is the collective weight of the multiple similarities that presents a compelling case. I think a point I’ve made elsewhere is very relevant. In the 1100s, without the 1532 fire burn marks, the L shaped poker holes would have been conspicuous – and that provides a good reason why they would be shown in a depiction such as the Pray Manuscript – especially if they held some symbolic meaning, perhaps a meaning supporting the shroud’s holy status as a relic that can defy destruction. Since the fire in 1532, the L shaped holes, although clearly observable, became less conspicuous. So, in the first known painted copy of the Shroud from 1516, prior to the fire in 1532, the poker holes take a prominent place in the depiction. In later depictions the prominent fire burns from 1532 are depicted, but not the poker holes. This, I think, addresses the question from some skeptics as to why the Pray Manuscript artist would depict the L shaped holes, seemingly meaningless features. They were depicted because at the time the artist worked they were conspicuous features of the shroud and probably held some meaning..","date":"2013-09-22","mins":"4:42 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-45160","author":"matthias","post":"Yes the holes make no sense as random elements, nor as decorative elements ( they might if they were repeated). And I think they make no sense as apertures either. I acknowledge there could be an alternative explanation, but after much thought about this I am at pains to think what that could possibly be! Assuming the holes on the shroud were in existence in the 1100s and therefore highly visually prominent when the HPM artist viewed it, it is entirely logical that they would have assumed some symbolic significance to drive their artistic representation. This is especially so when there is already a symbolic aspect to the lower image, with the floating letter, and the head next to Mary’s sleeve. There might be symbolism in the HPM image along the lines of the shroud representing both the worldly and human aspect of Jesus and worldly objects(the holes and the blood streaks) and the otherworldly and divine (the crosses, the head of Jesus next to Mary’s sleeve representing an intermediary between death and resurrection state). I acknowledge this is pure speculation, but it’s fun!!!!.","date":"2013-09-23","mins":"4:11 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-45057","author":"matthias","post":"I’d love to see an image of the Shroud less the 1532 burn marks. But with the poker holes, are there any out there? I’m guessing it would show a pretty compelling case for my points made at Comment #13.","date":"2013-09-22","mins":"4:47 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-45072","author":"matthias","post":"Sorry Hugh, I meant a photographic image of the shroud with the 1532 burn marks digitally removed. It doesn’t take much imagination to picture it mind you, and the poker holes would have been prominent, as shown in the Lierre depiction. Hence my argument as to the logic in showing them in the Pray Manuscript image, if indeed the artist was depicting the shroud (which I think, on balance, he was).","date":"2013-09-22","mins":"7:13 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-45023","author":"matthias","post":"The folding is interesting.I Am not convinced this is a link,having said that the fold seems superfluous so naturally the question is why is it there as opposed to a flat shroud..","date":"2013-09-21","mins":"8:39 pm","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-45161","author":"matthias","post":"Re: the poker holes and HPM. Interestingly the Lirey badge does not seem to show the poker holes (unless they are very small and cannot be picked up without magnification). If they were in existence in the 1300s (as they would be if they were in existence on the shroud in the 1100s if it existed then), and very prominent, then one might think they would be depicted on the badge. Although there is every chance that the badge maker might have seen them as an unwanted distraction from the body image and potentially a ‘fiddly difficulty’ for a metal worker making a small object, as opposed to something symbolic..","date":"2013-09-23","mins":"4:43 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-45173","author":"matthias","post":"You are a hard man to convince Hugh! but I understand your skepticism. I’ve looked critically at the HPM from all sides and whilst it’s hard to say 100% it was based on the shroud I think the collective emphasis is quite compelling,and try as I might with an open mind I can’t find an alternative explanation for those darn holes and red streaks! To me the clincher is Hungary’s strong connectionto constantinople at the time..","date":"2013-09-23","mins":"6:13 am","url":"https://shroudstory.com/2013/09/21/so-is-that-the-shroud-of-turin-depicted-in-the-hungarian-pray-codex/","cat":"history","title":"So is that the Shroud of Turin depicted in the Hungarian Pray Codex?"},{"id":"comment-39112","author":"matthias","post":"I’ve developed a hunch recently that the scourge wounds and the trickle along the lower back might be authentic, whilst the blood on the hand, arms, head and side might be medieval “add ons”. There is something about these blood stains that looks a little bit “too good to be true” to me. But it’s only a hunch..","date":"2013-07-17","mins":"4:20 am","url":"https://shroudstory.com/2013/07/15/stephen-jones-newest-addition-to-his-shroud-of-turin-series/","cat":"history","title":"Stephen Jones’ Newest Addition to his Shroud of Turin Series"},{"id":"comment-16376","author":"matthias","post":"This looks desperate to me. I don’t know why anyone would have folded the shroud in the convoluted and unnatural manner proposed by jones to conform to his four doubling theory..","date":"2012-09-17","mins":"3:38 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16393","author":"matthias","post":"Translation?.","date":"2012-09-17","mins":"9:50 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-16387","author":"matthias","post":"I don’t really want to waste my time explaining why Mr Jones’ folding example is a joke. The original doubling of the shroud three times as shown in Dan’s images makes total sense, including keeping the face on top, even if it is 3 doublings rather than 4. Jones’ folding example just doesn’t look credible , in particular the “second doubling” which is not actually a doubling, it’s a kind of fold over back on itself. I of course did not imply that the dating would be done without all the necessary qualifications and assumptions.","date":"2012-09-17","mins":"6:23 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-27604","author":"matthias","post":"The only things I can think of: is it a stylised ‘a’ for ‘alpha’? – is it some kind of symbol connecting what might be the face cloth with the head of Jesus? Something I’ve asked before – does anyone know what the WOR Ds in the pray codex say? they are in Hungarian I presume. Usually you would expect pictures to complement words. Perhaps the words elaborate on the meaning of the pictures..","date":"2013-03-18","mins":"4:48 am","url":"https://shroudstory.com/2013/03/18/the-curious-a-in-the-hungarian-pray-manuscript/","cat":"history","title":"The Curious ‘a’ in the Hungarian Pray Manuscript"},{"id":"comment-16378","author":"matthias","post":"We need a carbon retesting rather than spurious and questionable historical quasi theories.","date":"2012-09-17","mins":"3:45 am","url":"https://shroudstory.com/2012/09/17/tetradiplon-so-how-is-the-shroud-of-turin-folded/","cat":"history","title":"Tetradiplon: So how is the Shroud of Turin folded?"},{"id":"comment-76649","author":"matthias","post":"Colin I agree with David that your ideas are worthy of consideration. However I have to disagree with your view that the figure on the badge is non Christ like. We have to consider the very small scale of the badge, the difficulty in realising features such as the “bearded Christ”, the “side wound etc. At such a small scale. What on the badge makes you think of suggestion of burning at the stake? If I recall you might have suggested the squiqgles on the badge near the feet might be flames? I wonder might they represent the blood flows on the feet, being difficult / impossible to convey actually ON the feet on the badge given the smallness of scale?.","date":"2014-02-05","mins":"1:18 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-28480","author":"matthias","post":"Hugh Like you (it seems) I am agnostic on the question of the authenticity of the shroud, although tending more towards authenticity. You say: “The nakedness – while it is true that only Michaelangelo shows genitalia, a large number of paintings show a naked Christ whose modesty is protected by something, maybe a wisp of very unrealistic cloth, or a raised leg. Remarkably, it is the icons made before 1300 that nearly always show a properly loin clothed Christ, while the paintings after 1300 more often show a naked body. If the relative proportion of naked to clothed images alone were a true reflection of the provenance of the shroud, one would have to say that it was more likely to have appeared in mediaeval times than in antiquity.” True, whilst many (I would disagree with you that ‘most’ do) paintings after 1300 do show Jesus naked with not necessary a full thick loin cloth like earlier depictions, but more like a wisp of much less substantial cloth, they still protect Christ’s modesty with very few exceptions. But to be frank, I don’t think this has any bearing whatsoever on the authenticity argument. The emergence of “Skimpier’ loin cloths may just reflect the fact that artistic depictions became more realistic, and also started to show Christ in more realistic agony and suffering. Less loin cloth protection could be considered part of this movement. Or maybe reflects the fact that the Shroud figure has no protection, which influenced the artistic evolution closer towards ‘nothing’. The undeniable fact remains that for the most part artists still sought to protect Christ’s modesty. Even several of the artistic copies of the Shroud from the 1500s – 1600s depict the shroud figure with a full loin cloth! Again, I don’t think the fact that most depictions of Christ before 1300 show him with a full loin cloth argues against authenticity either. The fact that several copies of the shroud from the 1500s and 1600s shows the shroud figure with a loin cloth indicates a long tradition of wanting to preserve Christ’s modesty with a loin cloth, regardless of the fact that the figure on the shroud IS NOT protected by a loin cloth..","date":"2013-03-27","mins":"8:15 am","url":"https://shroudstory.com/2013/03/22/three-new-shroud-of-turin-websites-to-watch/","cat":"history","title":"Three New Shroud of Turin Websites to Watch"},{"id":"comment-25395","author":"matthias","post":"Tend to agree there John, this posting from Colin seems obsessive and deluded. He’s reading all sorts of things into that badge – ironic given his claims that shroudies read all sorts of things into items such as the Hungarian Pray Manuscript. What he calls the ‘chain’ across the back and the flames at the feet are simply representations of the blood which obviously could not be represented with any clarity in a literal copy of the shroud on a medal of this small scale..","date":"2013-02-23","mins":"8:29 am","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","title":"To hide away and suppress the Cluny Medal"},{"id":"comment-25398","author":"matthias","post":"Further, the bulky shoulder blades etc which Colin refers to are NOT armour. They are merely the understandably clumsy portrayal of anatomy on a small piece of metal. It’s instructive to analyse the mold that was used to make other badges commemorating the shroud on the 14th century, the words on the mold say ‘Shroud of Christ”….The shroud was displayed as the Shroud of Christ and not an image of some dude being fried on a stake… One more thing on the suggested “chain”. If indeed there was chain imagery on the shroud, and this was ‘removed’ via intentional scorching and the painting of blood, then why the following: – What Colin perceives to be a chain on the medal extends well to the right and left of the dorsal image. The scorching and blood on the shroud does not extend far enough to the right or left. There is no evidence on the shroud to the right or left of the arm area of any chain imagery, nor of any potential chain imagery that was disguised / removed – The thin rivulets of blood on the small of the back are nothing like the thick chain that Colin ‘sees’ on the medal. Again the thick “chains” on medal are just the crude miniature portrayal of the shroud blood.","date":"2013-02-23","mins":"8:48 am","url":"https://shroudstory.com/2013/02/23/to-hide-away-and-suppress-the-cluny-medal/","cat":"history","title":"To hide away and suppress the Cluny Medal"},{"id":"comment-27894","author":"matthias","post":"So go to the link to the book where you will see an alternative (apparently authoritative) Jewish view that table cloths WERE in common use in the first century AD. I’m not convinced either that the shroud was the table cloth at the last supper, but neither am I prepared to totally write it off. After all the width and length of the shroud generally fits with the dimensions of a table cloth that would fit with a table of the right sort of dimensions to accommodate the last supper. Also, if you believe in Shroud authenticity, why else would the shroud have been selected, and where from? I would think there would be other more obvious types of wrapping cloths. The idea that the shroud was the last supper table cloth also kinda works symbolically, in terms of the meal symbolism of Christ and the Bible, the body as the bread and the blood as the wine etc. And some efforts might have gone towards securing the high quality table cloth – shroud – given the importance of the last supper. Anyhow, just a thought.","date":"2013-03-20","mins":"8:40 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","title":"Was the Shroud of Turin a Tablecloth?"},{"id":"comment-28032","author":"matthias","post":"Question – how would the shroud be worn as a garment? I can’t see it. Maybe if it was wrapped around and over some how?.","date":"2013-03-22","mins":"5:15 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","title":"Was the Shroud of Turin a Tablecloth?"},{"id":"comment-27952","author":"matthias","post":"Daveb – although Mark says Joseph ‘purchased’ a cloth, as we know there are many discrepancies between the gospels – maybe Mark was wrong on this point! I come back to the point, IF the shroud is authentic, then it doesn’t really make sense to me that it was purchased by Joseph to wrap Jesus’s body. Surely a wider, more encompassing cloth would have been purchased? The Shroud is hardly wide enough to properly wrap a body. Yet it is about the right width to have covered a table, and the right length to have extended along a long table that could accommodate Jesus and the disciples..","date":"2013-03-21","mins":"3:42 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","title":"Was the Shroud of Turin a Tablecloth?"},{"id":"comment-28031","author":"matthias","post":"Maybe ‘clean’ is relative? Maybe the shroud – as table cloth – if shaken free of bread crumbs etc was relatively ‘clean’. Alternatively, maybe the use of the word ‘clean’ was artistic, symbolic licence?.","date":"2013-03-22","mins":"5:13 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","title":"Was the Shroud of Turin a Tablecloth?"},{"id":"comment-27955","author":"matthias","post":"Ps Wellington is my hometown! (I now live in Australia).","date":"2013-03-21","mins":"4:29 am","url":"https://shroudstory.com/2013/03/20/was-the-shroud-of-turin-a-tablecloth/","cat":"history","title":"Was the Shroud of Turin a Tablecloth?"},{"id":"comment-72459","author":"matthias","post":"Faulty logic. As others have alluded to the letters may be fiction but based on some truths, such as the possibility that the Mandylion may have been in Edessa folded as a tetradiplon. I’m not claiming that this is a fact. It’s just a possibility which you have not acknowledged. The ancients often mixed fact and fiction. Personally, I see fact mixed with quite a lot of fiction (or what Borg calls “history metaphorised”) in the gospels. People get themselves in trouble when they view many of these ancient texts as either “fiction” of “literal truth” in a black and white sense, when they are often a combination..","date":"2014-01-07","mins":"2:42 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72479","author":"matthias","post":"The Bollandist Vita Alexius calls the Image of Edessa “sine humano opere imago Domini nostri Jesu Christi in sindone” , i.e. “an image of our Lord Jesus Christ made without human work on a sindone”; also the Latin Cod. Monac. Aug. S.Ulr. 111 says “Edisse [venit] in urbem, in qua sanguinea domini serva[ba]tur ymago non manibus facta”, i.e. “[he came] to the city of Edessa, in which there was preserved a blood stained image of the Lord not made by hands”..","date":"2014-01-07","mins":"7:47 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72387","author":"matthias","post":"“I have never believed the letters were real but thought it was reasonable that the shroud made its way to Edessa. That something was in Edessa that sounds like the shroud still seems like a real possibility.” Agree!.","date":"2014-01-06","mins":"6:03 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72531","author":"matthias","post":"Either 1 or 4. I think probably 4.","date":"2014-01-07","mins":"7:37 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72571","author":"matthias","post":"Great paper. A key point is the clues that developed over time suggesting the Mandylion was much larger than just a face towel.","date":"2014-01-08","mins":"4:50 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72547","author":"matthias","post":"I’m very interested in the Latin Cod. Monac. Aug. S.Ulr. 111 text I quote above. I have found a journal article from Linda Clark From “Modern Philology” from 1986, after the quote I’ve outlined above it refers to the face being decorated, which read as a whole might suggest knowledge of a blood stained whole body figure (hidden away), with the face framed “decorously”. The problem is Clark refers to a German text from the mid 1850s that translate this text. I’d like to know when the Latin Cod. Monac. Aug. S.Ulr. 111 was written.Especially whether it was written before or after the mid 1300s when the shroud started to be displayed..","date":"2014-01-07","mins":"10:02 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72397","author":"matthias","post":"Each to their own John. I’ve never found the Vignon markings compelling..","date":"2014-01-06","mins":"7:00 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72633","author":"matthias","post":"“So modest your expectations are? In fact it is quite possible, that ALL OF THOSE 5 objects were actually the Mandylion, each in its own sense. Because in my opinion, the Mandylion never existed as a single object. It was an idea, the real image of Jesus, not a single piece of cloth.” Very good point!.","date":"2014-01-08","mins":"7:59 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72549","author":"matthias","post":"Sorry that should read “Linda Cooper” not Clark.","date":"2014-01-07","mins":"10:09 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72818","author":"matthias","post":"OK I agree. De Wesselow has pretty credible art history credentials and agrees with Wilson. He also quotes some other credible art historians (can’t remember names) who also support this. Look, I would be the first to admit that the case is not bulletproof. But in my view it certainly has some quite compelling aspects to it..","date":"2014-01-09","mins":"8:47 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72854","author":"matthias","post":"“Because the majority of academe is more doctrinaire relying on the received wisdom of their esteemed predecessors, more so than any religious dogmatist could ever be!” Well put. I’m doing a Phd part time and it’s amazing how indoctrinated much of academia is, very much blinded by doctrine are many..","date":"2014-01-10","mins":"4:11 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73016","author":"matthias","post":"Yes, and its all too easy to assume that the ancients were gullible fools.","date":"2014-01-11","mins":"4:41 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72956","author":"matthias","post":"Yannick, re your comment at 4.49 pm, I might agree with you if it wasn’t for multiple references or allusions over centuries to the Mandylion’s image being faint or as if imprinted by sweat. Along with the “not made by human hands” references this is actually quite suggestive of a non painted image consistent with the faint and ephemeral image of the Shroud..","date":"2014-01-10","mins":"7:40 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73262","author":"matthias","post":"Bit of self promotion at 5.42 pm Yannick???.","date":"2014-01-13","mins":"9:45 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-73282","author":"matthias","post":"OK / Yannick The Arculfus Shroud does not sound like the Shroud of Turin: “Arculf saw also in that city of Jerusalem another linen cloth of larger size, which, as is said, St. Mary wove, and which, on that account, is held in great reverence in the Church and by all the people. In this linen cloth the forms of the twelve Apostles are woven, and the likeness of the Lord Himself is figured; one side of the linen cloth is of red colour, while the opposite side is green” http://faculty.colostate pueblo.edu/beatrice.spade/seminar97/arculf/arculfus.htm Clearly an artistic creation!.","date":"2014-01-14","mins":"4:12 am","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"}]
