[{"id":"comment-23283","author":"matthias","post":"The scorch theory might also account for the image intensity variation? if the cloth had been laid over a hot bas relief then the protruding elements like the nose could press more firmly into the cloth,compared to less protruding elements,therefore creating higher intensity image..","date":"2013-02-03","mins":"12:13 am","url":"https://shroudstory.com/2013/02/02/teaser-of-the-day-3-why-many-state-that-the-shroud-is-a-3d-image/","cat":"teaser_of_the_day","title":"Teaser of the Day (#3): Why many state that the Shroud is a 3D image"},{"id":"comment-39329","author":"matthias","post":"Supernatural or natural? I favor a supernatural explanation, but not radiation. I favor an explanation that is supernatural, beyond our conceptions of science. I have no idea what that supernatural process might have been. I believe that the total failure of modern science / art history etc. To provide an adequate explanation for the shroud is very telling. I realize that the lack of an adequate explanation does not automatically mean the image’s creation was supernatural. But I DO think it significantly increases the chances that it’s creation WAS by supernatural means..","date":"2013-07-20","mins":"8:38 am","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-39489","author":"matthias","post":"Yannick et al If one believes in the resurrection, it is no real leap of faith to believe that some unexplained aspect of the resurrection created the shroud image. Unless you are a “Christian” who believes the resurrection is entirely metaphor..","date":"2013-07-22","mins":"3:53 am","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-39555","author":"matthias","post":"“I’m pretty sure his glorious body in Heaven is pretty much of the same appearance than the body he had on Earth before his death” well, who knows! It’s a great mystery. My own “hunch” is that we won’t “see” people in heaven, that the experience of that reality will be completely different to our earthly perceptions. It might be more like we “feel” other souls and interact with them on some other level. But frankly, I have no idea!.","date":"2013-07-22","mins":"11:32 pm","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-39350","author":"matthias","post":"Hi Dave can you please advise what the 2 comparable images from dead bodies are,as I don’t know of any that share the characteristics of the shroud image. I will check out that radon gas material,sounds interesting..","date":"2013-07-20","mins":"8:26 pm","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-39365","author":"matthias","post":"Thanks Dave,but these images are not really comparable with the shroud image are they.I Know of the matress imprint,the only similarity with the shroud is the image was created from a dead man’s body.There the similarity ends!.","date":"2013-07-21","mins":"1:49 am","url":"https://shroudstory.com/2013/07/20/any-good-reasons-for-associating-anything-supernatural-with-the-shroud/","cat":"image_theory","title":"Any good reasons for associating anything supernatural with the shroud?"},{"id":"comment-23402","author":"matthias","post":"Well if we go beyond Colin’s rather childish behaviour, which doesn’t assist his credibility – he does make – I think – some good arguments re: the line across the chin.","date":"2013-02-04","mins":"7:32 am","url":"https://shroudstory.com/2013/02/03/be-sure-to-read-the-comment-by-thibault-heimburger/","cat":"image_theory","title":"Be sure to read the comment by Thibault Heimburger"},{"id":"comment-24640","author":"matthias","post":"Some questions re: the bloodstains (I’ve also offered my own preliminary answers where relevant): – why would a forger place blood trails down the arms? Surely a hand (wrist) wound would be sufficient in biblical terms? – The wounds on the buttocks seem to mirror each other???? – Why the pooling of blood at the bottom of the back? Maybe blood running down from the hands / forearms and pooling at the back?.","date":"2013-02-18","mins":"4:36 am","url":"https://shroudstory.com/2013/02/16/colin-berrys-big-day-tomorrow/","cat":"image_theory","title":"Colin Berry’s Big Day Tomorrow"},{"id":"comment-24661","author":"matthias","post":"Daveb thanks. You’ll see the blood across the lower back if you go to shroud scope. Its what Colin Berry calls the chain across the back on the Lirey badge…. I’ve just imitated the Shroud man’s pose (!!!) and I could see that blood from the hand / wrist wounds could flow down from the wrists down the hip / waist region and pool towards the lower back Thoughts???.","date":"2013-02-18","mins":"7:44 am","url":"https://shroudstory.com/2013/02/16/colin-berrys-big-day-tomorrow/","cat":"image_theory","title":"Colin Berry’s Big Day Tomorrow"},{"id":"comment-24663","author":"matthias","post":"Amazing timing! I just see that Stephen Jones has posted on bloodstains, and mentions those on the small of the back that I refer to…divine intervention??? I really interested in those small of the back bloodstains…their presence really leads to an air of authenticity Let me know your thoughts about my theory that the blood from the wrists flowed down through the waist to the lower back.","date":"2013-02-18","mins":"7:49 am","url":"https://shroudstory.com/2013/02/16/colin-berrys-big-day-tomorrow/","cat":"image_theory","title":"Colin Berry’s Big Day Tomorrow"},{"id":"comment-24807","author":"matthias","post":"Hugh – I’d like you to explain why you think there is no blood on the small of the back. To my eyes at least there is a thin horizontal trail that looks to be of similar colour to the other alleged blood stains on the shroud. If the other similar coloured stains are indeed blood (I’m assuming they are) then I can’t see why the trail on the small of the back might not be blood. Then to the left and right of this thin trail are bigger stains. Rather than Ron’s conclusion that this blood comes from the side wound, I think its highly likely that the stains to the right and left of the small back trail have come from the underside of the forearms. If you mimic the shroud figure’s pose like I did you will naturally see that blood would flow down the from the wrists on the underside of the forearms and collect around the hip area, possibly then trailing off across the small of the back. Hugh – I’d be interested in your thoughts and why do you conclude that this isn’t blood? Is this because you think the other apparent blood stains on the shroud are not in fact blood either? Or do you think the other stains are blood but these ones aren’t???? Again I don’t understand why a forger would / could have gone to this level of detail..","date":"2013-02-19","mins":"6:59 am","url":"https://shroudstory.com/2013/02/16/colin-berrys-big-day-tomorrow/","cat":"image_theory","title":"Colin Berry’s Big Day Tomorrow"},{"id":"comment-24638","author":"matthias","post":"Well, I appreciate Colin’s efforts and ideas, if not always his mannerisms. I am certainly not truly convinced of his scorch theory, but I always keep an open mind, as a shroud agnostic (but one who is 70% oriented towards authenticity)..","date":"2013-02-18","mins":"4:23 am","url":"https://shroudstory.com/2013/02/16/colin-berrys-big-day-tomorrow/","cat":"image_theory","title":"Colin Berry’s Big Day Tomorrow"},{"id":"comment-52445","author":"matthias","post":"Yes, David, the non authentic theory still seems far fetched, as you seem to be implying, for the reasons you outline and more.. If there is any potential in this scorch theory, I think it lies in the idea that a statue or bas relief was custom designed. I just don’t find the whole ‘reworking the arms’ theory compelling. Nor do I find the notion that the loin cloth was somehow worked out of the statue convincing either. I congratulate Colin on his theories, and for coming up arguably with the best non authentic arguments I have heard. The fact though that there are still a number of big questions about his theory though is telling. I still think we don’t need t be so black and white. I stand by my theory that the image and SOME of the blood stains are authentic, but SOME of the blood stains are medieval touch ups made with the motivation of making the relic appear ‘more authentic’..","date":"2013-11-22","mins":"6:15 pm","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-15870","author":"matthias","post":"And that open mind should include colin berry’s decent scorch theory.","date":"2012-09-05","mins":"5:55 am","url":"https://shroudstory.com/2012/09/04/corona-discharge-for-shroud-of-turin-to-be-presented-at-comsol-europe/","cat":"image_theory","title":"Corona Discharge for Shroud of Turin to be presented at COMSOL Europe"},{"id":"comment-52485","author":"matthias","post":"Anonymous Please advise why you think the “touch up” theory can be so easily dismissed? You have previously referred to lack of image under blood. Which blood mark/s was this established for? I would be surprised if it was more than one, in which case the lack of image under one blood mark doesn’t necessarily apply to all blood marks..","date":"2013-11-23","mins":"3:24 am","url":"https://shroudstory.com/2013/11/21/colins-scorch-under-a-microscope/","cat":"image_theory","title":"Colin’s Scorch Under a Microscope"},{"id":"comment-15875","author":"matthias","post":"Yes, I am certainly not convinced of Berry’s view, the theory is certainly interesting but as you say replication of the shroud is another story. He also proposes some rather weird theories at times too which IMHO undermines his credibility. Nevertheless the scorch theory has its place and I For one wouldn’t rule it out..","date":"2012-09-05","mins":"7:22 am","url":"https://shroudstory.com/2012/09/04/corona-discharge-for-shroud-of-turin-to-be-presented-at-comsol-europe/","cat":"image_theory","title":"Corona Discharge for Shroud of Turin to be presented at COMSOL Europe"},{"id":"comment-52644","author":"matthias","post":"Yep think you are right Hugh.","date":"2013-11-24","mins":"6:46 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","title":"First Annual Bertrand Russell Award in Sindonology"},{"id":"comment-52631","author":"matthias","post":"Colin, another interesting theory re: the butt marks, but on one of the butts the two circles seem rather too close to the edge of the butt to suggest they are the product of bolts (ie. One would expect them to be more centred).","date":"2013-11-24","mins":"5:20 am","url":"https://shroudstory.com/2013/11/22/first-annual-bertrand-russell-award-in-sindonology/","cat":"image_theory","title":"First Annual Bertrand Russell Award in Sindonology"},{"id":"comment-51713","author":"matthias","post":"Further to my point above… I guess a supernatural trigger could have led to image formation created by natural laws. I described the supernatural experience my wife and I had last week when dishes in one of the cupboards started shaking and rattling for 7 or 8 seconds, then we found out next day our close friend in NZ passed away about that time. Assuming that really was a supernatural event and my wife and I weren’t deluded (and we were 100% sober!), you could see that as a supernatural event triggering an event obeying natural laws ie. Dishes rattle, hitting each other and making noise – which we experience through our hearing. So pulling this back to the Shroud. As I say I don’t buy the radiation theories. But what if the pre resurrected physical body of Christ heated up as part of the process, to a level that could leave an image? This is where I need you Colin and / or the other scientists…could a very hot body potentially create the kind of image we see on the Shroud, or does it depend on the object being hot and hard (eg metallic)??? Put aside any aspersions to the supernatural just for a moment – thoughts?.","date":"2013-11-17","mins":"7:51 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51725","author":"matthias","post":"Adelaide. No matches. I looked at this data last week to consider rational explanations.","date":"2013-11-17","mins":"8:57 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51720","author":"matthias","post":"Re: blood, I don’t rule out the possibility that some stains are authentic, and some were added.The possibility that some of the blood stains may not be authentic (ie. They were added) hardly impacts on the case for authenticity.","date":"2013-11-17","mins":"8:25 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51851","author":"matthias","post":"Coming back to my hypothesis… I reckon some of the blood marks could be authentic eg. Scourge marks, maybe side wound – and some may be later ‘touch ups’ to try and build a ‘more convincing’ relic. For example, I’ve always thought the forearm and hair blood marks look possibly too good to be true. I think the feet wounds are quite convincing, and make little if any sense as an artistic intervention, where you wouldn’t expect the flow off to the side of the sole of the foot. As for that bloody marking across the lower back…to me that’s really mysterious. It’s not what you would expect from a ‘relic maker’ yet not readily explained in terms of the ‘authentic case’. I had hypothesized, based on putting myself in a lying position and trickling liquid substance down the underside of the forearms and obtaining subsequent flow across the lower back that it might come from forearm flows… but if the forearm blood flows are ‘additions’ then that theory flies out the door!.","date":"2013-11-18","mins":"3:45 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51681","author":"matthias","post":"You seem very certain on the answer. I think the jury is still out in a big way. My own belief is that the image was caused – somehow, and I’m not suggesting radiation – by the resurrection. I find it bizarre that Christians who believe in a supernatural event – the resurrection – cannot consider that this supernatural event might have caused the image we see on the shroud. I’ve never heard one good answer why belief in the resurrection and belief that the resurrection caused the image are incompatible, unless one was to argue that the carbon dating is right and the shroud was created in the 1300s. If one accepts the resurrection, as a supernatural event outside of human understanding, then I don’t understand why one cannot accept that that event created an image on the shroud outside of human understanding..","date":"2013-11-16","mins":"11:33 pm","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51698","author":"matthias","post":"David – I always respect your views. You say you favor a natural formation theory. Presumably you don’t favor a supernatural theory? Are you a Christian? I sensed you were. The reason is, if you are – and don’t favor a supernatural theory – why not?.","date":"2013-11-17","mins":"5:11 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-51709","author":"matthias","post":"Interesting list Colin. But not really relevant to my own point. My point is that the resurrection is beyond physical laws, therefore the image was created in ways beyond our understanding of natural laws. So taking my point a step further, this will mean that if the shroud image was created by the resurrection then we will never no how the image was created because we will never be able to rationalise what or how the resurrection occurred. My belief – and it is only a mere belief! – is that Jesus’s body dematerialized, before rematerializing in spiritual form before the witnesses – and this is the resurrection. Now in the act of dematerializing, an image was formed on the Shroud. According to my belief, we’ll never be able to explain how this occurred. I don’t buy into the ‘resurrecton radiation” theory for example – it’s an example of trying to apply physical laws to a supernatural event. I realize scientists will find this all most unsatisfactory. And I am more than happy for a naturalistic theory to disprove what I’ve outlined above. It wouldn’t affect my faith..","date":"2013-11-17","mins":"7:31 am","url":"https://shroudstory.com/2013/11/15/its-a-negative-its-3d-yes-maybe-sort-of/","cat":"image_theory","title":"It’s a negative. It’s 3D. Yes? Maybe? Sort Of?"},{"id":"comment-42053","author":"matthias","post":"Wow,great work. This image is much more powerful than the contrast enhanced versions.","date":"2013-08-26","mins":"7:26 am","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"id":"comment-42217","author":"matthias","post":"Supernatural or natural that is the question!.","date":"2013-08-28","mins":"8:33 am","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"id":"comment-42125","author":"matthias","post":"Hugh You are not willing to consider a miraculous unexplainable cause?.","date":"2013-08-27","mins":"9:02 am","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"id":"comment-42258","author":"matthias","post":"Hugh The Pray manuscript image is certainly fascinating. Something I have never been convinced by is the explanantion that the rectilinear pattern represents the herringbone weave. I would have thought the herringbone weave pattern is only observale under microscope, not by the naked eye, in which case a 12th century monk wouldn’t have seen and depicted the pattern. Any thoughts?.","date":"2013-08-28","mins":"7:47 pm","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"id":"comment-42298","author":"matthias","post":"Well, I storngly disagree. If you are a practising Catholic who believes in the resurrection, which you admit may be an inexplicable phenomenon, then why is it a jump to consider that the shroud is a by product of the inexplicable resurrection, and an explanation of its image formation is also inexplicable because it was caused by an inexplicable event? It is not a logical inconsitency at all!.","date":"2013-08-29","mins":"6:43 am","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"id":"comment-42059","author":"matthias","post":"Just to confirm Hugh….you now consider the Shroud image is NOT a scorch????? (in earlier discussions with Colin B you seemed to be showing some sympathy with the scorch theory).","date":"2013-08-26","mins":"8:43 am","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"id":"comment-42260","author":"matthias","post":"Hugh I am not sure what your religious beliefs are – atheist, agnostic, Christian etc. As a Christian, I believe in the resurrection. Not the physical resuscitation of Christ’s body, but a materialisation as a spiritual body as described by Paul. In my view, science will never explain this, unless one favours some kind of naturalistic explanation (eg. Hallucinations etc) Although I search for an explanation of the Shroud image’s formation, I also acknowledge that if it was a product of Christ’s resurrection then our chances of explaining it in scientific terms is probably zilch. Despite much brain power over the years, no single theory convincingly explains the image. Of course there might still be a valid scientific explanation! But I think the fact that there isn’t, despite all the analysis over the years, is suggestive of a reasonable likelihood of a miraculous creation. My own view is that Christ’s body dematerialised, and the image is somehow a byproduct of that. He then rematerialised in a spiritual form that somehow had quasi physical characteristics eg. Three dimensionality etc – that took his appearance beyond a “ghost” and that is the resurrection..","date":"2013-08-28","mins":"8:07 pm","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"id":"comment-42361","author":"matthias","post":"Some things in life are inexplicable, and always wil be in my view. I’m happy to leave some mystery in life. There is a degree of human arrogance in our belief that we can explain everything ,predict everything etc. Despite the advances in science, we are still SO ignorant of so many things, and keep getting so many things wrong. Look, if a convincing comprehensive scientific explanation came out tomorrow for the image, I’d be happy to change my view. It’s just I think that’s unlikely.","date":"2013-08-29","mins":"6:46 pm","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"id":"comment-42064","author":"matthias","post":"Wow. I really respect your views on matters scientific (me being an arts / humanities graduate) so to me that is significant, as I saw the scorch theory as being the only potentially credible ‘forgery’ explanation. To me, if its not a scorch then that significantly increases the likelihood of authenticity. What’s your current view of most likely candidate given you have discarded the scorch theory?.","date":"2013-08-26","mins":"9:22 am","url":"https://shroudstory.com/2013/08/26/nicely-done-you-must-download-this/","cat":"image_theory","title":"Nicely Done: You must download this"},{"id":"comment-42485","author":"matthias","post":"The images were created under very controlled circumstances, and Jerusalem does not have ferromagnetic geology. So…. Look, I agree that the image might have been caused by explainable natural phenomenon, and that such serendipitious factors working together could potentially constitute a miracle…or not. But I do find the reluctance of Christians to consider a miraculous resurrection as the cause of the image odd to say the least! I could perfectly understand it if it came from atheists or agnostics! ‘A major criticism against the Resurrection causing the image, (often mentioned by Yannick) is that the image is that of a very dead corpse apparently in a type of rigor mortis, NOT that of a risen glorified Christ, and NOT even in transition towards Resurrection!’ Yeah, but if we start from the point that the resurrection is a miraculous event that contradicts the laws of nature, then anything is possible, including methods of image creation well beyond our human imaginations. That’s why I find attempted scientific explanations of a resurrection generated image such as bursts of radiation pointless, because radiation is a natural phenomenon and the resurrection isn’t! Maybe the image does capture Christ just in the moment to transforming between dead corpse and resurrected spiritual body? There is a serenity in the face that to me speaks of something different to a pained, tortured person. I’ve seen tortured dead bodies and I’ve never seen a serene face on any of them like the face of the shroud..","date":"2013-08-31","mins":"8:01 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-42486","author":"matthias","post":"Dave, it is a THEORY with regard to explaining the Shroud image..","date":"2013-08-31","mins":"8:20 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-42475","author":"matthias","post":"It’s a nice, interesting theory but far from convincing. I favour the resurrection..","date":"2013-08-31","mins":"6:26 am","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-42435","author":"matthias","post":"Showing that I too keep an open mind… Has anyone ever looked at alchemy? Could a medieval alchemist have poured some kind of solution over a dead body, and the solution transfered an image to the cloth? Just putting it out there.","date":"2013-08-30","mins":"7:24 pm","url":"https://shroudstory.com/2013/08/30/of-inexplicable-explanations/","cat":"image_theory","title":"Of inexplicable explanations"},{"id":"comment-24664","author":"matthias","post":"Nice piece…I too am theologically liberal (Catholic), but traditional too. For example, I don’t believe in the ‘physical’ body resurrection, but in the ‘spiritual’ body resurrection. Actually I don’t think this is actually that liberal as St Paul talked about the spiritual body, and before I converted to Catholicism I asked three priests if my non belief in a physical body resurrection was problematic in becoming Catholic and they all said “no”.","date":"2013-02-18","mins":"7:56 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper"},{"id":"comment-24667","author":"matthias","post":"I would add too that my cousin is a nuclear physicist and Catholic too.. Who said science and Faith are not reconcilable???!!!.","date":"2013-02-18","mins":"7:57 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper"},{"id":"comment-38090","author":"matthias","post":"I have previously theorised that the blood trickles acorss the small of the back may have been created by post mortem blood flows, originating from the hand/wrist nail wounds, flowing down the underside of the forearms, through the hip area near where the elbows would be, and around the lower back. This would be quite possible with thicker, more coagulated blood (thin blood would “fall off” the body at the hip region prior to running around the lower back area).","date":"2013-06-26","mins":"4:22 am","url":"https://shroudstory.com/2013/06/23/paper-chase-computerized-anthropometric-analysis-of-the-image/","cat":"image_theory","title":"Paper Chase:  Computerized Anthropometric Analysis of the Image"},{"id":"comment-37908","author":"matthias","post":"Read de wesselow’s book. He argues against bent legs. The imprint of the feet was created by the linen being wrapped up against and over the vertical feet position.","date":"2013-06-24","mins":"6:20 am","url":"https://shroudstory.com/2013/06/23/paper-chase-computerized-anthropometric-analysis-of-the-image/","cat":"image_theory","title":"Paper Chase:  Computerized Anthropometric Analysis of the Image"},{"id":"comment-37912","author":"matthias","post":"Do all the gospels use the word ‘entulisso’? My reading of the gospels is that Mark and Luke imply a temporary (possibly loose) wrapping, as the following day people come to anoint him (and then presumably tightly wrap).","date":"2013-06-24","mins":"7:10 am","url":"https://shroudstory.com/2013/06/23/paper-chase-computerized-anthropometric-analysis-of-the-image/","cat":"image_theory","title":"Paper Chase:  Computerized Anthropometric Analysis of the Image"},{"id":"comment-75145","author":"matthias","post":"Hugh, I was going to mention that too (that there was no black and white dismissal by STURP on scorching) Yannick, your rebuttal?.","date":"2014-01-30","mins":"4:10 am","url":"https://shroudstory.com/2014/01/24/radiation-man-a-new-bsts-article/","cat":"image_theory","title":"Radiation Man:  A New BSTS Article"},{"id":"comment-52746","author":"matthias","post":"Yep I still say none of the above too…I think there is every possibility that we will never know, that the Shroud is a miraculous by product of the resurrection, inexplicable to the human mind…but it’s fun theorising!!!.","date":"2013-11-25","mins":"7:01 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-52806","author":"matthias","post":"Re: hot statue – QUESTION Surely if a hot statue was used we would see image on the top of the head? Colin? I’m stuck on the idea of dematerialization of Christ’s body for now ,as the basis for image creation. And no I am not proposing radiation. I am theorising that the instant act of dematerialization created some biological process that created the image. I don’t know if we can ever create a model for that process, given (ordinarily) bodies do not instantly dematerialize..","date":"2013-11-26","mins":"8:06 am","url":"https://shroudstory.com/2013/11/25/running-out-of-options/","cat":"image_theory","title":"Running out of options?"},{"id":"comment-44410","author":"matthias","post":"Off topic but can someone more scientifically minded than I assist. It’s spring here now in Australia. My wife and I got the summer bed linens out. One of the white sheets had a blood mark from when our son had a bleeding nose last summer. It’s still bright red. Why?.","date":"2013-09-16","mins":"7:23 am","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-44520","author":"matthias","post":"Cotton.","date":"2013-09-17","mins":"7:38 am","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-44650","author":"matthias","post":"Mark said: “Furthermore, only one scientific test result among thousands is inconsistent with the Shroud’s authenticity as Jesus’ burial garment.” Thousands? Really? Is that a rhetorical exaggeration?.","date":"2013-09-18","mins":"7:29 pm","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-44497","author":"matthias","post":"Interesting. My only guess is that it might have something to do with the washing agent my wife used. All I am certain of is that the mark is still clearly bright red after one year..","date":"2013-09-17","mins":"3:10 am","url":"https://shroudstory.com/2013/09/16/speaking-of-more-scientific-testing-of-the-shroud/","cat":"image_theory","title":"Speaking of more scientific testing of the shroud"},{"id":"comment-18089","author":"matthias","post":"An excellent, compelling paper. I’d like to see a response from Colin. And one that is as detailed and robust as Thibault’s, not a rushed 5 10 paragraph write up., As someone said above, the ball is back in Colin’s court to refute this..","date":"2012-10-23","mins":"6:37 am","url":"https://shroudstory.com/2012/10/21/thibault-heimburger-now-i-know-for-sure-that-the-ts-body-image-is-not-a-scorch/","cat":"image_theory","title":"Thibault Heimburger: Now, I know for sure that the TS body image is not a scorch"},{"id":"comment-42872","author":"matthias","post":"‘Resurrection of Jesus and the creation of the image could take place even without the flash … but also in a miraculous way!’ Exactly. If the resurrection was outside the laws of nature then it was not necessarily a radioactive type of event with a flash that caused the image. Again, I am comfortable with an unfathomable supernatural explanation..","date":"2013-09-04","mins":"7:37 am","url":"https://shroudstory.com/2013/09/04/thoughts-on-the-newly-published-paper-by-ray-rogers/","cat":"image_theory","title":"Thoughts on the newly published paper by Ray Rogers (REVISED)"},{"id":"comment-73394","author":"matthias","post":"I agree with others that there is a watermark between the frontal and dorsal images of the head. I measure about 15cm between them. A cap like crown of thornes removing contact between cloth and top of head might explain.","date":"2014-01-15","mins":"6:11 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73405","author":"matthias","post":"Hugh – well put, I totally agree. Does this not create difficulties for the “faked” scenario? It certainly does not bode well for scorch theories, I would have thought..","date":"2014-01-15","mins":"10:54 pm","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73412","author":"matthias","post":"“If there is no image on the Cap, and only an indistinct image on the Shroud, this might reinforce the thought that the imaging action was essentially vertical. ” It might also reflect differences in the materials and their ability to facilitate image – cap vs cloth how credible is the evidence around the Jews in 1st century palestine using such caps for the dead?.","date":"2014-01-16","mins":"1:44 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73416","author":"matthias","post":"“I would also add that the lack of side images do not need a complex explanation. It is the consequence of the distance of the cloth to the sides of the body.” I agree. “This does not preclude the possible existence of a cap (Cahors?) to be on the head, but that would not be needed to explain the lack of image coming from the top of the head.” I disagree. I think the cap – or cap of thorns – is necessary to explain the lack of image. If there was no such cap, then the top of the head would have been in contact with the cloth, and we should expect an image, as per the image generated from the hair on the face image. Now…an important question remains as to whether the type of cap referred to above really was commonly used by Jews in the burial of the dead in 1st century Palestine. If it wasn’t we can dismiss this notion..","date":"2014-01-16","mins":"2:49 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73435","author":"matthias","post":"You beat me to it Hugh.","date":"2014-01-16","mins":"7:06 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73441","author":"matthias","post":"Great discussion. And it has raised, in my opinion, big questions for the anti authentic position. Most particularly, why would we see this gap if the image was created from a hot statue, or bas relief. If the former, presumably we would also see an image from the top of the head, as the linen contacted the hot top of the head as well as the rest of the body. As several of us have stated, the measurements between the 2 head images (frontal and dorsal) are pretty much spot on in terms of anatomical distance. Compelling….","date":"2014-01-16","mins":"8:37 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73513","author":"matthias","post":"I guess the following is possible….our “mystery man” does a first attempt at scorching an image from a hot statue, but gets the top of head image which appears rather odd as an oval shape connecting the nicely formed frontal and dorsal head images….so he tries again with something covering the top of the head and preventing the top of head scorching… far fetched – I think – but possible?.","date":"2014-01-17","mins":"5:23 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73582","author":"matthias","post":"I’m still waiting for some advice on 1st century Jewish burial practice vis a vis head dress… Presumably no one knows? It’s a very important question WRT the lack of “top of head” image….","date":"2014-01-18","mins":"4:17 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73586","author":"matthias","post":"How did they bind the jaw? How about the cap of cahors? Is that a fabrication?.","date":"2014-01-18","mins":"5:23 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-73675","author":"matthias","post":"RE: the binding of the jaw, presumably it was in the form of a cloth that went up the side of the head and over the top of the head. Wouldn’t that have impact on the hair image we see on the frontal image?.","date":"2014-01-19","mins":"8:02 am","url":"https://shroudstory.com/2014/01/15/top-of-head-puzzle/","cat":"image_theory","title":"Top of Head Puzzle"},{"id":"comment-83627","author":"matthias","post":"But why just a small cloth covering top of head?.","date":"2014-02-28","mins":"11:00 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-83626","author":"matthias","post":"The gap is more important, I think, than has been acknowledged. It has been proposed that a band held the jaw closed and this band went around the sides of the head and across the top of the head. This lifted the shroud away from the top of the head hence the lack of image. Another theory is that a cap like crown of thorns had the same effect, however I can’t see why Christ’s supporters would have left such a mocking prop on him.","date":"2014-02-28","mins":"10:59 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-83880","author":"matthias","post":"I think this top of the head thing poses very interesting questions for the question of authenticity. The authenticists need to provide a compelling reason for the lack of image.I am not convinced by some of the cloth / cap theories put forward. For me this is a problem that lends some support to a man made image. The image would look somewhat odd with the top of head shown hence the artist did not show it..","date":"2014-03-01","mins":"4:30 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-83894","author":"matthias","post":"So the artist didn’t. ..an artist would not want to depict the top of the head only the front and back. Hence an argument in favour of the man made. I realise there are theories around head caps, bands etc but I am yet to see a compelling comprehensive case. If someone can point me in the direction of such a case….","date":"2014-03-01","mins":"5:30 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-83922","author":"matthias","post":"I want more. The so called chin band has flimsy evidence. I think this major issue is being conveniently ignored. There is no image on the top of the head. A barrier is necessary to explain this if indeed the image is authentic. I have heard bands were used by Jews in burial but I have never seen any compelling evidence backing this claim. The head image would have looked strange if an artist conveyed the top of head hence why I think there is a question mark here.","date":"2014-03-01","mins":"8:36 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-83924","author":"matthias","post":"Good points. The very precisely accurate distances would be very impressive for an artist of that time.We still need more though on why the lack of top of head image.","date":"2014-03-01","mins":"8:41 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-83925","author":"matthias","post":"But what kind of head covering? To explain the fact that there is a face image but no top of head image we need an object that sat on top of head. I would have thought a face cloth would cover whole of head therefore preventing face and back of head image as well as top of head.","date":"2014-03-01","mins":"8:44 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-84391","author":"matthias","post":"Where is the evidence about Jewish custom using chin bands? Where is the evidence that the chin band wrapped up and over the top if the head preventing contact between top of head and cloth? References please and more credible evidence please.","date":"2014-03-03","mins":"5:08 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-84544","author":"matthias","post":"I’m waiting. ..as mentioned earlier this is important.","date":"2014-03-03","mins":"3:29 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-84654","author":"matthias","post":"Louis – great, thanks. My next question is how the jaw was bound. I imagine a band or cloth that goes under the chin up the sides of the head and over the top of the head makes sense? but would this not impact on the facial image?.","date":"2014-03-03","mins":"10:15 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-84683","author":"matthias","post":"“I think it can be only be explained by some form of cloth underneath the band covering the head completely” But such a cloth would not only prevent top of head image but also front and back of head image.","date":"2014-03-03","mins":"11:57 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-84740","author":"matthias","post":"Dave any evidence kippahs are put on the dead in burial?.","date":"2014-03-04","mins":"3:41 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-84761","author":"matthias","post":"Hugh that was the kind of thing I was thinking. Dave – my opinion I don’t think it was a kippah I can see no evidence at all that it would be used in burial. To be frank I even think the band seems unlikely and this whole discussion has changed my view towards favouring a medieval man made origin. I maintain the top of head puzzle is really important.","date":"2014-03-04","mins":"5:35 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-84986","author":"matthias","post":"David Goulet – flowers on top of head? What’s the rationale for that please?.","date":"2014-03-04","mins":"8:04 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-84988","author":"matthias","post":"OK, Max has provided some good explanation….","date":"2014-03-04","mins":"8:05 pm","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-85052","author":"matthias","post":"But why flowers on the head? I think the pro authenticity argument goes along the lines that Christ’s body was taken down from the cross and temporarily placed in the tomb within the shroud…as an interim measure before the full and final burial rites were to be undertaken (which never happened as Christ was resurrected before this occurred). This is consistent with the gospel of Mark, Luke and Matthew. John obviously differs, but I view John more skeptically from a strict historical account perspective (but obviously see a lot of metaphorical power in John). Sorry not convinced by the flower argument. I think the band (along the line’s of Hugh’s suggestion) is more likely. But still plenty of question marks here I think ..","date":"2014-03-05","mins":"1:27 am","url":"https://shroudstory.com/2014/02/28/top-of-the-head-puzzle-redux/","cat":"image_theory","title":"Top of the Head Puzzle Redux"},{"id":"comment-586","author":"matthias","post":"Fair enough. Here’s another question – why would the creators of the shroud image create an image that is so faint, indeed difficult to discern to the naked eye of a real life observer, when they could create a scorched image that is stronger, if they were indeed creating a memorial to a respected leader? That doesn’t sound credible to me. I know you are interested in the science more so that history and psychology, but credible theories on the shroud require both science AND history Again I’m not a scientist so would be interested in your answer as a science bod. Might the image have been stronger at first but then faded over time? Is that a credible possibility? Look forward to your reply.","date":"2012-09-03","mins":"8:07 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/26/is-the-man-on-the-turin-shroud-a-pseudo-negative-imprint-from-a-death-mask-could-that-be-why-the-modern-day-photographic-negative-looks-so-much-better-than-the-original/","cat":"corona_discharge","title":"Is the Man on the Turin Shroud a pseudo-negative imprint from a DEATH MASK?  (Could that be why the modern-day photographic negative looks so much better than the original?)."},{"id":"comment-582","author":"matthias","post":"Well, Colin, that’s a bit disappointing for a Shroud agnostic like me. I am compelled by much of your theory, but the fluorescence is an outstanding question. I am not a scientist and have no connection to scientists. As I said, I do not expect the pro authenticity crowd to test the theory, as an answer consistent with your theory would obviously undermine their case (conversely, of course, an answer hostile to your theory would do them great good!). You have an opportunity here to really underline the strength of your argument, and perhaps get close to putting the final nail in the coffin of the pro authenticity crowd’s argument. I think the question of fluorescence is an important one – for me the answer would probably get me off the fence either to the pro or anti authenticity camp. Perhaps you could “name a name” in terms of someone who has access to a UV excimer laser. By your cryptic message I am assuming someone like Fanti who is a scientist within the pro authenticity camp? Well, I might even email Fanti or someone of his ilk..","date":"2012-09-02","mins":"12:10 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/26/is-the-man-on-the-turin-shroud-a-pseudo-negative-imprint-from-a-death-mask-could-that-be-why-the-modern-day-photographic-negative-looks-so-much-better-than-the-original/","cat":"corona_discharge","title":"Is the Man on the Turin Shroud a pseudo-negative imprint from a DEATH MASK?  (Could that be why the modern-day photographic negative looks so much better than the original?)."},{"id":"comment-580","author":"matthias","post":"Thanks Colin. It still seems a rather odd tribute to me. Why not a painting, or a statue. Yes I know he was burnt at the stake, hence maybe giving someone the idea of scorching his image onto a cloth. I’m just finding it hard to reconcile what is a good theory of yours with the actual reason why it would be done. It really would be good if someone could do further research on the fluorescence issue. You couldn’t pursue this further? I think your theory really needs to be tested further. If lighter scorches don’t fluoresce then we can truly say your theory stacks up very favourably. If they do, then it might be time to move on from your scorch theory. Is there not a scientist’s arm you could pull? As I doubt pro authenticists will be rushing to test this, as the current argument suits them just fine. Matthias.","date":"2012-09-02","mins":"8:47 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/26/is-the-man-on-the-turin-shroud-a-pseudo-negative-imprint-from-a-death-mask-could-that-be-why-the-modern-day-photographic-negative-looks-so-much-better-than-the-original/","cat":"corona_discharge","title":"Is the Man on the Turin Shroud a pseudo-negative imprint from a DEATH MASK?  (Could that be why the modern-day photographic negative looks so much better than the original?)."},{"id":"comment-570","author":"matthias","post":"Colin Historic precedent for death masks in the 1200s/ 1300s? Matthias.","date":"2012-08-31","mins":"11:38 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/26/is-the-man-on-the-turin-shroud-a-pseudo-negative-imprint-from-a-death-mask-could-that-be-why-the-modern-day-photographic-negative-looks-so-much-better-than-the-original/","cat":"corona_discharge","title":"Is the Man on the Turin Shroud a pseudo-negative imprint from a DEATH MASK?  (Could that be why the modern-day photographic negative looks so much better than the original?)."}]
