[{"id":"comment-46766","author":"matthias","post":"Off topic, back to one of my favourites, the Pray Manuscript. Whilst in the University library today, I made the very short stroll from the architecture section to the art history section. I found a fascinating book ‘Signs and Symbols in Christian Art’ by George Ferguson, written way back in 1966 (when England last won the football world cup ;) In the book Ferguson states that the number five is symbolic of the wounds of Christ (pg 154), whilst red symbolises blood (quite obviously). Referring back to the lower image, might the 5 holes on the red cross covered object reinforce the symbolism that the object represents Christ’s blood stained shroud? Or just another coincidence? Maybe???…… He doesn’t explain why 5 is symbolic of Christ’s wounds. Presumably the 5 wounds comprising two palms, two feet, and side wound?.","date":"2013-10-10","mins":"4:35 am","url":"https://shroudstory.com/2013/10/09/a-picture-worth-a-thousand-words-a-shroud-2000-years-later/","cat":"news_&_views","title":"A Picture Worth a Thousand Words:  A Shroud 2000 Years Later"},{"id":"comment-40013","author":"matthias","post":"Ok almost simultaneous assistance there from Dan via Google translation! Any further thoughts?.","date":"2013-07-29","mins":"4:40 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-40024","author":"matthias","post":"Your point Charles? That the shroud was a medieval tablecloth?.","date":"2013-07-29","mins":"6:58 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-40012","author":"matthias","post":"“And the problem is that such a loom is known in Mediterranean area just after the 4th Century when it came from China. About this Fulbright says nothing.” No one other than David has really touched on this problem. Can someone verify that the shroud would have had to have been made with a loom of 4 pedals? And if so, can someone verify that 4 pedal looms did not appear in the mediterranean til after the 4th century, coming via China? If this is correct, then it places great doubt on authenticity, as it is highly unlikely that the shroud would have been obtained from China in 1st century palestine..","date":"2013-07-29","mins":"4:39 am","url":"https://shroudstory.com/2013/07/27/and-the-problem-is-a-four-pedal-loom/","cat":"news_&_views","title":"And the problem is a four-pedal loom?"},{"id":"comment-26967","author":"matthias","post":"I agree re: abortion Yannick. I understand the logic in supporting same sex marriage, I really do, but the traditionalist in me really struggles with it..","date":"2013-03-10","mins":"5:59 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","title":"But they didn’t ask about the Shroud of Turin"},{"id":"comment-27041","author":"matthias","post":"Yannick What are your views on assisted suicide as a fellow Catholic? I watched a very good BBC documentary on it last night, its a difficult, complex moral issue but I found myself walking away thinking there ARE Christian compassionate grounds for it, for some terminal conditions. I guess introducing it in some scenarios can become a slippery moral slope..","date":"2013-03-10","mins":"9:47 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","title":"But they didn’t ask about the Shroud of Turin"},{"id":"comment-26943","author":"matthias","post":"Yannick, I consider myself fairly liberal too – I don’t have a problem with homosexuality, I am not against abortion, I don’t like abortion but acknowledge and accept its legality etc. But I am firmly against same sex marriage.","date":"2013-03-09","mins":"10:20 pm","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","title":"But they didn’t ask about the Shroud of Turin"},{"id":"comment-38605","author":"matthias","post":"Although I favour authenticity, I did not find this presentation compelling..","date":"2013-07-04","mins":"7:20 am","url":"https://shroudstory.com/2013/07/04/gary-habermas-on-the-shroud-of-turin/","cat":"humor","title":"Gary Habermas on the Shroud of Turin"},{"id":"comment-70067","author":"matthias","post":"Well, this just sums up the poverty of much atheistic thought. It’s an incredibly ignorant and simplistic piece which could easily be challenged on multiple fronts, however I for one have better things to do! It just reminds me so much of some militant socialistic atheists I knew back in my university days, who thought they were oh so clever (but in fact were far less intelligent than they thought)..","date":"2013-12-30","mins":"7:25 am","url":"https://shroudstory.com/2013/12/30/ignorant-indoctrinated-and-improperly-educated-theists/","cat":"news_&_views","title":"Ignorant indoctrinated and improperly educated theists"},{"id":"comment-52978","author":"matthias","post":"“Matthias: “There is just no issue there. I struggle to see anatomical abnormalities.” Apparently, so does John, but you are in a minority. Shroud/body configuration theories abound in order to correct percieved abnormalities. ” There’s a difference between true anatomical abnormalities, and what appear to be abnormailties. In my view the latter may be the case with the shroud, but not the former.","date":"2013-11-27","mins":"5:20 pm","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-52980","author":"matthias","post":"Hugh – yes I can replicate that position, comfortably. No issue. I am quite long limbed, but not abnormally so. Perhaps when I get some time I can get myself photographed in this position and submit to this website..","date":"2013-11-27","mins":"5:23 pm","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-52982","author":"matthias","post":"Ps with clothes on….","date":"2013-11-27","mins":"5:28 pm","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-52981","author":"matthias","post":"No serious! But I did chuckle when I wrote it!.","date":"2013-11-27","mins":"5:25 pm","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-52914","author":"matthias","post":"“Some people think that the shoulders look dislocated, to account for the fact that the hands can hide the genitals, while others think that the shoulders were slightly raised to account for this.” I don’t get this Hugh. My hands can cover my genitals (mind you, only just) even lying dead flat. I certainly don’t have abnormally long arms. There is just no issue there. I struggle to see anatomical abnormalities. I’ve proven a number of things to myself by measuring on Shroudscope and corroborating against my own body. A classic example is the myth that the hand wound is on the wrist. It’s not. Its close to the middle of the hand. Another myth, this time from the anti authenticists, is that the fingers are too long. They are not, they measure similar to my own..","date":"2013-11-27","mins":"6:52 am","url":"https://shroudstory.com/2013/11/26/imagine/","cat":"uncategorized","title":"Imagine"},{"id":"comment-56898","author":"matthias","post":"Dan – you like Gary. I don’t know him personally, but I know I generally don’t like his extreme pro Shroud views. Like Stephen Jones, he is incredibly uncritical in his acceptance of certain Shroud “truths”. Such fundamentalism does not help the pro Shroud case..","date":"2013-12-06","mins":"4:29 am","url":"https://shroudstory.com/2013/12/05/it-is-too-bad-that-this-one-minute-apologist-interview-ran-for-two-minutes/","cat":"news_&_views","title":"It is Too Bad That This One Minute Apologist Interview Ran for Two Minutes"},{"id":"comment-38463","author":"matthias","post":"I have to concur that many of the skeptical atheists come across as dumb and narrow minded as some Christian fundamentalists. In my experience many atheists are not in fact as smart as they think they are..","date":"2013-07-01","mins":"9:23 am","url":"https://shroudstory.com/2013/07/01/jref-catholics-answers-and-the-like/","cat":"news_&_views","title":"JREF, Catholics Answers and the like"},{"id":"comment-72718","author":"matthias","post":"Interesting. Perhaps a fertile area of research for anyone who can read and understand old French texts (not I!).","date":"2014-01-09","mins":"7:54 am","url":"https://shroudstory.com/2014/01/07/keep-it-simple-can-anyone-help/","cat":"news_&_views","title":"Keep it Simple: Can Anyone Help?"},{"id":"comment-26231","author":"matthias","post":"Interesting piece. I was protestant but converted to Catholicism about 2 years ago. The tradition and sacraments greatly appealed / appeal. Also, for me the protestant churches have become too wishy washy “everything goes”. The centralism of the Vatican and its dogma appealed. Yet…..there are still aspects of doctrine and the vatican’s authority that I am not 100% comfortable with, and I certainly do not believe in papal infallibility. But I am certainly very comfortable overall in my conversion, and see some of the issues as matters of human frailty and fallibility rather than anything rotten at the heart of Catholicism. Hopefully the new Pope will get on top of some of these issues..","date":"2013-03-03","mins":"5:53 am","url":"https://shroudstory.com/2013/03/03/lisa-miller-on-american-catholics/","cat":"news_&_views","title":"Lisa Miller on American Catholics"},{"id":"comment-44609","author":"matthias","post":"I think Josie raises some valid points. If one accepts the resurrection as a miraculous inexplicable event then it is entirely logical to conclude that the image on the shroud that covered Jesus is similarly inexplicable, being created by an inexplicable event! If you can accept that science will never explain the resurrection, then it is then logical to assume that science will never explain the by product of that inexplicable event. I am more than happy for people to speculate on the causation of the shroud image, and indeed find it quite interesting, However ultimately I believe that speculation will prove futile, as it has proven for the past 40 years..","date":"2013-09-18","mins":"7:40 am","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"id":"comment-44656","author":"matthias","post":"“Matthias: I would be prepared to allow that the Shroud image may have been some kind of by product of the Resurrection process, whatever that might have been. However I see a strong objection to that hypothesis in that the image is that of a corpse. ” Fair point. However, this is my way around that problem… Perhaps the image on the shroud was recorded from the first moments of the resurrection process, perhaps just as the body was commencing dematerialisation. Somehow – I don’t know how, and I am not concerned with that absence of knowledge given the unknowable mystery of the miraculous resurrection – the image is recorded, then the body dematerialises. The shroud is left behind, with its image which I might add in my very subjective view is serene in expression rather than tortured, almost expressing a knowing expression of His coming glorified transformation. Jesus then rematerialises in a spiritual bodily form, and that is his resurrection. So in this way of thinking, the shroud image is a last snapshot of Christ’s mortal body immediately prior to his dematerialisation and then rematerialisation (ie. Resurrection). It is the physical record of Christ’s human mortality, which complements the historic record (the bible) and the spiritual record (his immortal presence) of his glorified resurrection So we have been left with physical, intellectual (the written word) and spiritual confirmation of his status. ;.","date":"2013-09-18","mins":"9:25 pm","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"id":"comment-44682","author":"matthias","post":"Indeed. I did not assert it, merely proposed it, as suggested by the “perhaps…. I still wouldn’t dismiss a 14th century origin either (after all the carbon dating shows that, even if there are question marks), nor do I outrightly dismiss a naturalistic.explanation. It’s just on balance I think the most likely scenario is a first century origin of supernatural genesis. What I find frustrating is those who outright dismiss THE POSSIBILITY of a supernatural origin, especially when they are Christians who believe in the resurrection, not as a metaphor, but a literal historical event!.","date":"2013-09-19","mins":"4:26 am","url":"https://shroudstory.com/2013/09/15/more-scientific-research-on-the-shroud-of-turin-why/","cat":"uncategorized","title":"More scientific research on the Shroud of Turin? Why?"},{"id":"comment-52007","author":"matthias","post":"Colin, I’m not sure if I buy the idea that the shroud may have been created from an existing statue….let me start with one major problem:we would expect to see the modesty protecting cloth on the shroud image, which is nearly universally depicted in paintings and as far as I am aware universallly depicted in statues.","date":"2013-11-19","mins":"10:04 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-52110","author":"matthias","post":"Well in a recent trip to Spain I probably saw more than 50 statues of Christ from the 1300s – 1500s, and every one had a loin cloth. And in pouring through numerous texts on Christian art history I’ve never seen a statue without loin cloth. Yes, I’ve seen a few (a lot? that is an exaggeration) baptism pictures of a naked Christ, partly disguised as you say, but that is beside the point. I reiterate my point that the lack of loin cloth on the Shroud image suggest that it is unlikely that the image was created from an existing statue. Maybe a remote chance it was created from a custom made one..","date":"2013-11-20","mins":"7:37 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-52111","author":"matthias","post":"But the pray codex was not an object for public display. The image is buried in a clerical text, so its a different context.","date":"2013-11-20","mins":"7:40 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-52114","author":"matthias","post":"Colin I still have a number of “problems” with the non authentic arguments…here’s one top of mind – the blood stains on the feet, particularly the right foot with the stain appearing to trickle or smudge well off to the side of the foot: makes little sense to me as a non authentic man made creation Thoughts? PS can’t wait for the Ashes.","date":"2013-11-20","mins":"8:09 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-52366","author":"matthias","post":"Colin / others – any further thoughts on those feet wounds ?.","date":"2013-11-22","mins":"5:59 am","url":"https://shroudstory.com/2013/11/18/must-see-the-informative-mark-evans-photomicrographs/","cat":"how_do_we_know","title":"Must See:  The Informative Mark Evans Photomicrographs"},{"id":"comment-73793","author":"matthias","post":"I’m sure Mr Nickell is a smart man – he has a Ph D – but his list of work experiences is an oddball mash up of things, what can he claim his real expertise is in, in evaluating the Shroud?.","date":"2014-01-20","mins":"7:30 am","url":"https://shroudstory.com/2014/01/20/oh-no-a-mean-and-nasty-smokescreener-and-clever-rationalizationer/","cat":"news_&_views","title":"Oh no, a mean and nasty smokescreener and clever rationalizationer"},{"id":"comment-73799","author":"matthias","post":"Fair enough, sounds a bit “mickey mouse’ to me….then again, I’m necessarily a fan of so called “specialists” either, so maybe I should open my mind..","date":"2014-01-20","mins":"7:59 am","url":"https://shroudstory.com/2014/01/20/oh-no-a-mean-and-nasty-smokescreener-and-clever-rationalizationer/","cat":"news_&_views","title":"Oh no, a mean and nasty smokescreener and clever rationalizationer"},{"id":"comment-38161","author":"matthias","post":"Good to see, and as David said Colin isn’t the only culprit. Let’s all act with respect and like adults rather than kindergarten children.","date":"2013-06-27","mins":"4:06 am","url":"https://shroudstory.com/2013/06/26/personal-attacks-on-others/","cat":"news_&_views","title":"Personal Attacks on Others"},{"id":"comment-36425","author":"matthias","post":"Re: Wrist / Hand wounds. I’m fascinated by this aspect of the shroud. To me this aspect speaks of thermal effect, whether scorch etc. But if it’s scorch, then it is scorch off a real human body. Bas relief / statue wouldn’t show the finger bones, as statues / bas reliefs don’t show finger bones. BTW, I measured length from tip of finger to wrist / palm wound on Shroudscope, and with several attempts consistently hit around 12 13 cms. If I look to my hand, which is I guess average size (I’m 188cm / 90kg but my hands aren’t big), that puts the wound in the middle of the hand, NOT at the wrist, as is frequently argued. I’d be interested in people’s views..","date":"2013-06-08","mins":"5:53 am","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","title":"R.I.P. Ben Wiech"},{"id":"comment-36497","author":"matthias","post":"WRIST / HAND WOUN Ds I’m interested in exploring this further if people have the inclination. Above, I assumed that the obvious image of the finer bones argues for a thermally generated image. However, having thought deeper, could the crucifixion have torn flesh from the hand, thus exposing the bones, which could hence have left the image via Maillard reaction? thoughts?.","date":"2013-06-09","mins":"12:15 am","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","title":"R.I.P. Ben Wiech"},{"id":"comment-36584","author":"matthias","post":"Anoxie – good argument except the ‘fingers’ are too long. That’s why I wondered if flesh could have been torn away from hands,revealing bones,and then imprintment via maillard?.","date":"2013-06-09","mins":"8:18 pm","url":"https://shroudstory.com/2013/06/05/r-i-p-ben-wiech/","cat":"news_&_views","title":"R.I.P. Ben Wiech"},{"id":"comment-81939","author":"matthias","post":"I don’t think supernatural causes should be ruled out. I don’t buy radiation theories. But I do think a supernatural dematerialisation could have left an image by some unknown means – maybe an intense release of body gases, an accelerated and intensified version of the vapor causation theory you support Yannick.","date":"2014-02-24","mins":"5:12 am","url":"https://shroudstory.com/2014/02/23/should-ssg-get-involved/","cat":"news_&_views","title":"Should SSG Get Involved?"},{"id":"comment-82063","author":"matthias","post":"So Yannick you do not believe in any supernatural reality? You do not believe a supernatural event can leave a physical legacy? For you the resurrection is metaphorical? If not and you believe it was a supernatural event why is it beyond the realms of possibility that a supernatural event left behind a physical legacy?.","date":"2014-02-24","mins":"3:00 pm","url":"https://shroudstory.com/2014/02/23/should-ssg-get-involved/","cat":"news_&_views","title":"Should SSG Get Involved?"},{"id":"comment-82274","author":"matthias","post":"I like your last point.","date":"2014-02-25","mins":"6:21 am","url":"https://shroudstory.com/2014/02/23/should-ssg-get-involved/","cat":"news_&_views","title":"Should SSG Get Involved?"},{"id":"comment-23482","author":"matthias","post":"What’s your current preferred theory Hugh? Is it the scorch theory? although I see some good points in Colin’s ideas, there are a few things that still trouble me about the scorch theory, including: – the general anatomical correctness of the image: statues of the 1300s were still struggling with anatomy – certain characteristics of the image – eg. The rear foot sole imprints – very much appear as genuine organic images from a real body, rather than images generated from a bas relief template or equivalent – the “wrist problem” – why the blood on the wrist when this was basically unknown in artistic depictions. Surely the wound would have been placed on the hand – the general appearance of wounds across the body appear quite authentic to my eyes, rather than something ‘faked’ – why the absence of loin cloth, again a historical norm. A fake created by scorching on a bas relief could have built in a loin cloth into the relief. Again why the big departure from the cultural norms of the time?.","date":"2013-02-05","mins":"4:34 am","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","title":"Teaser of the Day (#4): Body image in noncontact zones?"},{"id":"comment-23560","author":"matthias","post":"So Hugh I am right to assume you are agnostic with regard to the question of the Shroud’s authenticity (as the burial shroud of Jesus) I’m agnostic tending towards believer (I’m a believer though in the Catholic faith!).","date":"2013-02-06","mins":"2:54 am","url":"https://shroudstory.com/2013/02/04/teaser-of-the-day-4-body-image-in-noncontact-zones/","cat":"teaser_of_the_day","title":"Teaser of the Day (#4): Body image in noncontact zones?"},{"id":"comment-73369","author":"matthias","post":"Great, a Hungarian! Tamas: can you shed any light on whether there is any text in the Hungarian Pray Codex that sheds any light on the (in) famous images of Christ’s anointing and the empty tomb? I’ve often wondered if the text does provide some explanation, as opposed to the images being totally independent of the text.","date":"2014-01-15","mins":"7:43 am","url":"https://shroudstory.com/2014/01/13/when-is-a-relic-not-a-relic/","cat":"news_&_views","title":"When is a relic not a relic?"},{"id":"comment-73348","author":"matthias","post":"Me too. Is that the head image on the back of the cloth, or merely the blood? There is some darker shading around the face area but hard to make out without zooming in whether there is image there versus just a darker coloration band. I always assumed that the blood was quite superficial but this image implies it soaked the whole way through the cloth. Does this not imply prolonged contact (and soaking through) rather than a quick superficial painting application? I guess the latter might do the same thing if there was enough blood applied via brush or whatever instrument?.","date":"2014-01-14","mins":"11:44 pm","url":"https://shroudstory.com/2014/01/14/the-questionable-restoration-of-the-shroud-of-turin/","cat":"news_&_views","title":"The Questionable Restoration of the Shroud of Turin"}]
