[{"id":"comment-565","author":"matthias","post":"Also Colin when will you be testing the fluorescence matter – I think this is critical. There must be skeptical scientists out there with the required equipment who would be more than happy to test this if asked???? I don’t think you’ve fully failed Porter’s bet unless you can put this issue to bed.","date":"2012-08-30","mins":"11:20 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…"},{"id":"comment-564","author":"matthias","post":"Colin Good thoughts. Being agnostic on the shroud, I keep an open mind either way. However, whilst you might be getting there in terms of the science, there are a number of historical oddities that are not so easily explained away: – If the Shroud is not indeed the Shroud that wrapped Jesus’s dead body, why would its creator create an image that did not protect Jesus’s modesty, when almost exclusively in the history of art Jesus is shown with at least a loin cloth, and certainly buttocks are not displayed? – Similarly, why would its creator have shown the would in one wrist (As opposed to two palms, which is the historical artistic norm?) Surely the creator, if he was wishing to profiteer from public display and / or sale of the creation, would have met the artistic norms / expectations of Jesus of the time and indeed through history? – How about the existence of epitaphios from Greece circa 1200 – 1300 AD that show Jesus’s body, complete with body wide wounds similar to those on the shroud, lying on a herringbone weave shroud (and the art of the time universally otherwise shows Jesus with only modest wounds in the palms, on the side of the torso) Also, with regard to the science, do you have any plans to test your scorching theory on a full size statue? One could argue that theorising as you have done is one thing, but to reproduce the full body characteristics of the shroud convincingly is another. Also, how do you explain the flagrum marks etc. Matthias.","date":"2012-08-30","mins":"11:09 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…"},{"id":"comment-567","author":"matthias","post":"Questions, Colin: – doesn’t the rear image of the shroud display braided hair characteristic of Jews of Jesus’s time? – scorching the image on to a cloth seems a somewhat odd tribute to martyrs. I’m not saying its impossible, as odd things have happened over history. But it seems the whole process is a big one for a tribute – Isn’t there evidence that the templars started ceremonies in the late 1200s venerating a cloth with Jesus’s image on it? – Thoughts on your theories versus the existence of Greek epitaphios circa 1200 / 1300 AD with Jesus laid on a herringbone weave cloth, with body wide wounds generally consistent with those on the shroud? – was not the Lirey public display done in the context of the shroud being the Shroud of Jesus? Matthias –.","date":"2012-08-31","mins":"7:29 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/08/21/dan-porter-and-his-2002-long-bet10-years-on-was-he-right-i-say-no-time-has-proved-him-spectacularly-wrong/","cat":"criteria","title":"Dan Porter and his 2002 Long Bet,10 years on. Was he right? I say NO.Time has proved him spectacularly WRONG…"},{"id":"comment-77559","author":"matthias","post":"“Looking at our reactions to each other on this blog at times, I think we’re not being honest with ourselves.” Great point. Many here DO seem to be clinging to Shroud authenticity to support their faith, despite what they say..","date":"2014-02-08","mins":"5:42 pm","url":"https://shroudstory.com/2014/02/08/dear-colin-if-you-change-your-mind-you-are-welcome-back/","cat":"other_blogs","title":"Dear Colin:  If you change your mind you are welcome back."},{"id":"comment-57735","author":"matthias","post":"Thanks Chris, that’s pretty consistent with my finding However I measure about 100mm on the lower hand. But it could be more. It’s hard to get 100% accuracy on shroud scope. Others? I think the “wrist wound’ myth needs dispelling..","date":"2013-12-10","mins":"4:54 pm","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","title":"Barbet vs Zugibe"},{"id":"comment-828","author":"matthias","post":"Colin Interested in your view, given your scorch theory, as to why there is no scorch image on the top of the head on the shroud. Might this be because the scorch image involved downward pressure into the cloth? Or do you think it more likely two base relief scorches neatly aligned in a mirror like manner, thus explaining the lack of top of head image? Matthias.","date":"2012-09-26","mins":"10:26 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/22/needed-urgently-scorch-scanner-gd-wkg-cond/","cat":"horse_brass","title":"Needed urgently – scorch scanner (gd wkg cond)"},{"id":"comment-57569","author":"matthias","post":"Dave B I’ve gone to the Enrie negative again, I measured the length from the tip of the middle finger to just above the knuckles at 95mm – which is almost identical to my own hand. If I then measure from the knuckle area to the upper edge of the hand wound, I measure about 50mm, which places the wound around the middle of the back of the hand. Looking at the Enrie negative up close, I also think – at least to my eye it looks like the back of the hand – not the wrist. I’ve done this a few times now and come to the same conclusion – the wound is clearly in the middle of the hand, not the wrist as per the conventional wisdom. Since Dave B and I clearly differ in opinion, it would be very good to hear other opinions..","date":"2013-12-10","mins":"2:58 am","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","title":"Barbet vs Zugibe"},{"id":"comment-57297","author":"matthias","post":"Well, I’ve said it before and I’ll say it again – according to my measurements on shroudscope and corroborating back to my own hand, the wound is just below the mid point of the hand, NOT through the wrist.","date":"2013-12-08","mins":"4:44 pm","url":"https://shroudstory.com/2013/12/08/barbet-vs-zugibe/","cat":"other_blogs","title":"Barbet vs Zugibe"},{"id":"comment-59631","author":"matthias","post":"Disagree. 99% it is hand. Several other people did the measurement and came to circa 45 50mm finding. Also it’s pretty obvious if you look to the edge of the hand and the hand shape that its in the middle of the hand. Too much cognitive dissonance..","date":"2013-12-14","mins":"8:59 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-59594","author":"matthias","post":"Daveb with all due respect let’s try and put the cognitive dissonance aside. Go to Shroud scope. The middle of the circular blob on the hand measures no more than 45 48mm from the knuckle area. This places it just about middle of the hand. Unless you think the circular blob is not where the nail was? Whatever theory is proposed, I can’t ignore the direct evidence discernible from measuring shroud scope that places the nail wound middle of the hand. Whether a wound in the middle of the hand is consistent with a man hanging on a cross, I don’t know. Again, I’m not averse to the theory of some “wounds” having been added to the shroud, which does not discount authenticity as a whole in my opinion at least..","date":"2013-12-14","mins":"7:52 pm","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-60077","author":"matthias","post":"Who says the ‘nail’ isn’t between your two points, which measures around 48mm. Even your second point at a distance of 56mm is at the bottom of the hand more than the wrist. You said: “The error is that you try to measure the distance from the knuckles to the edge of the bloodstain, while in fact, the nail was placed in its middle, probably close to that dark spot.” Who says the nail was right in the middle? If this is an authentic wound stain, then I think it’s more likely the nail was closer to the knuckles, and that the blood then collected then split into “two streams” down towards the wrist. In my opinion the jury is very much out on the so called ‘truth’ of the wrist wound. Doesn’t mean the shroud isn’t authentic. I maintain a hunch that the hand wound, the trickles on the forearms, the marks on the head were medieval additions. I think the scourge wounds are authentic, I’m not sure about the side wound..","date":"2013-12-16","mins":"2:16 am","url":"https://shroudstory.com/2013/12/13/was-zugibe-deliberately-and-dishonestly-trying-to-mislead-his-readers/","cat":"other_blogs","title":"Was Zugibe deliberately and dishonestly trying to mislead his readers?"},{"id":"comment-1001","author":"matthias","post":"Thanks Hugh, will be interested hearing further of your experiments. Re: 2 – we would only need to think of of 700 odd years with regard to medieval forgery hypothesis. If we could prove that burns 700 years of age can not lose fluorescence, then that would go some way to dispelling the medieval forgery by scorch hypothesis. In that respect, is not Adrie’s comment below pertinent in terms of scorches from presumably the 1500s coming up with green fluorescence have not lost their fluorescence with time (some 500 years of it).","date":"2012-10-25","mins":"7:37 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-987","author":"matthias","post":"Re: Hugh’s no. 5 – so you couldn’t avoid fluorescence. Is this not a problem for the scorch theory, given that the Shroud image, from what I understand, does not fluoresce under UV? Sorry, unlike you both I am not a scientist, so you will have to excuse my scientific limits!.","date":"2012-10-24","mins":"11:09 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/23/thibaults-principle-true-for-a-stepped-template-maybe-but-not-an-artistic-bas-relief-with-rounded-contours-and-gentler-relief/","cat":"medieval_forgery","title":"Thibault’s Principle: true for a stepped template, maybe – but not an artistic bas relief with rounded contours and gentler relief"},{"id":"comment-36585","author":"matthias","post":"I have the book and at the very least it is a great resource. I agree the author presents a compelling case for authenticity but a less than compeling case that the Shroud inspired the resurrection story. However,I Do think the shroud could have lended great support to and essentially corroborated the resurrection experiences..","date":"2013-06-09","mins":"8:25 pm","url":"https://shroudstory.com/2013/06/09/in-case-anyone-thinks-thomas-de-wesselow-isnt-important/","cat":"books","title":"In case anyone thinks Thomas de Wesselow isn’t important"},{"id":"comment-27888","author":"matthias","post":"Well, we know its not a painting, that’s a no brainer. But possibly a scorch???.","date":"2013-03-20","mins":"7:42 am","url":"https://shroudstory.com/2013/03/20/de-wesselow-story-spreads-the-mainstream-mother-nature-network/","cat":"history","title":"De Wesselow’ Story Spreads to the Mainstream Mother Nature Network"}]
