[{"id":"comment-170266","author":"matthias","post":"There’s a place for vulgar language…..well moderately vulgar and blanked out…Charles is taking the……..mickey. The references he lists ARE NOT references to an image that is much stronger than now!.","date":"2014-11-10","mins":"12:13 am","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-79966","author":"matthias","post":"Could we carbon date Joel’s hair, it looks circa 1992..","date":"2014-02-17","mins":"3:34 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism"},{"id":"comment-38556","author":"matthias","post":"Interesting to see that a couple of the most vocal current shroud skeptics are stage magicians…. Whoop di do.","date":"2013-07-03","mins":"6:47 am","url":"https://shroudstory.com/2013/07/03/a-book-review-of-joe-nickells-the-science-of-miracles/","cat":"books","title":"A Book Review of Joe Nickell’s The Science of Miracles"},{"id":"comment-38559","author":"matthias","post":"Had a few too many amazing south australian shirazs tonight, so what should I do? Go to the bathroom, assume shroud man position over old cloth, trickle said shiraz under left wrist, said shiraz trickles down hip region, falls off body, drops on cloth below elbow creating a small poll, and then a thin trickle funs back towards middle of back… not at all dissimilar to shroud.","date":"2013-07-03","mins":"7:30 am","url":"https://shroudstory.com/2013/07/03/a-book-review-of-joe-nickells-the-science-of-miracles/","cat":"books","title":"A Book Review of Joe Nickell’s The Science of Miracles"},{"id":"comment-38560","author":"matthias","post":"Wine plus typing on smart phone equals typos… ‘poll’ should read ‘pool’, ‘funs’ should read ‘runs’.","date":"2013-07-03","mins":"7:33 am","url":"https://shroudstory.com/2013/07/03/a-book-review-of-joe-nickells-the-science-of-miracles/","cat":"books","title":"A Book Review of Joe Nickell’s The Science of Miracles"},{"id":"comment-19433","author":"matthias","post":"Yes I thought his analysis was excellent – very logical, coherent, compelling. I do not agree with his theory however that the shroud was the basis for the belief in the resurrection and the basis of Christianity, although if the Shroud is authentic then it might have had a role in strengthening the base of Christianity.","date":"2012-11-24","mins":"4:32 am","url":"https://shroudstory.com/2012/11/23/christopher-howse-for-important-read-stupid/","cat":"books","title":"Christopher Howse: For important read stupid"},{"id":"comment-82994","author":"matthias","post":"Well that’s a bit dismissive! Please elaborate on what is illogical about my idea. Note: only an idea…..","date":"2014-02-27","mins":"5:37 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-83011","author":"matthias","post":"I am second guessing but maybe yoh consider it illogical if you dogmatically believe that Christ’s body was transformed and was resurrected through the shroud. ..therefore you would say the image of the risen body should be seen. What I am proposing – just as an idea with no substantial confidence – is that Christ’s body dematerialised in the tomb, and somehow the act if dematerialisation left the image of the dead and mortal human Christ.He then materialised in his risen spiritual form.","date":"2014-02-27","mins":"6:11 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-82974","author":"matthias","post":"Dave why is the tortured image problematic. If the body dematerialized in its tortured state then it is logical that the image that was left was a last snaphot of Christ’s mortal body…he was then raised (ie materialized) in his glorious risen body.","date":"2014-02-27","mins":"4:04 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-83267","author":"matthias","post":"Ok if we want to be pedantic about semantics, how about: “If the body dematerialized in its tortured state then it is possible that an image might have been made by some unknown process through the act of dematerialization as a snapshot of Christ’s mortal body” Howz that?.","date":"2014-02-28","mins":"12:18 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-83275","author":"matthias","post":"Well put.","date":"2014-02-28","mins":"12:30 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-83271","author":"matthias","post":"I’m not really enamoured to the radiation theory. How about this: upon instant dematerialisation some kind of biochemical process was enacted that created the image. Who knows what that could be. As bodies just don’t dematerialize instantly in the normal course of events then it may be scientifically impossible to take this idea any further, unless someone is able to deduce theoretically what sort of biochemical process might be enacted by such a miraculous occurrence.","date":"2014-02-28","mins":"12:22 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-83273","author":"matthias","post":"“I also mentioned that it is not unreasonable to assume the image is miraculous because of its association with Jesus.” Exactly. I can not understand why some of the Christians on this blog do not get this point. If you believe Jesus did miracles, if you believe he was transformed through a miraculous event (the resurrection) then it is entirely logical to consider the possibility that the shroud that covered His body as he was resurrected might bear the supernaturally created image of Him. Of course, if you are an atheist – or a “Christian” who considers the resurrection metaphor – then of course it is entirely logical to dismiss any potential supernatural image creation theory..","date":"2014-02-28","mins":"12:29 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-83278","author":"matthias","post":"“Matthias, I don’t think he needed to dematerialize and materialize again. I believe the switch was from a dead body to a glorified body. That glorified body could go through matter (linen cloth), as seen when Jesus entered the room when all the doors were locked.” but then you have the problem raised by Dave B as to why the image would be of the tortured and mortal body rather than the risen and glorious body, unless he rose through the linen in his dead and tortured state and then transformed after that…possible, I guess.","date":"2014-02-28","mins":"12:34 am","url":"https://shroudstory.com/2014/02/26/giulio-fantis-book-launched/","cat":"books","title":"Giulio Fanti’s Book Launched"},{"id":"comment-75193","author":"matthias","post":"Food for thought! I find 2 and 3 unlikely, given the image’s nudity…of course the man’s frontal modesty is protected by the hands, but his backside is on full display! Re: 1, I’ve sometimes wondered if the Shroud might have covered a flagellant from the 1200s / 1300s…that might explain the flagellant like wounds, and then as you suggest this provided the template for Christ like wound touch ups.","date":"2014-01-30","mins":"4:29 pm","url":"https://shroudstory.com/2014/01/28/moving-the-exclamation-point/","cat":"books","title":"Moving the Exclamation Point"},{"id":"comment-45167","author":"matthias","post":"Wow conspiracy theory alert!.","date":"2013-09-23","mins":"5:57 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45506","author":"matthias","post":"I would think Marino’s statements are bordering on defamatory.IF He and Klotz are going to make these claims then let’s see the comprehensive and substantiated evidence,not snippets of seemingly anecdotal information..","date":"2013-09-26","mins":"7:08 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45189","author":"matthias","post":"Yes I was being sarcastic. Most – maybe not all – conspiracy theories are bonkers. He makes a number of big claims. Maybe they are well founded. I’d like to see more substantiation to the claims before I consider the remote possibility of conspiracy. And no, that doesn’t mean I have unlimited faith in science nor necessarily the accuracy of the carbon testing (in fact if you’ve read my comments you will know on balance I think it more likely than not that the Shroud is the authentic burial shroud of Christ). But it is one thing to question the accuracy of the carbon testing for a variety of methodological or scientific reasons and another to suggest sinister plots and ulterior motives. Let’s start with the donation from the “anonymous businessman”. Show me the evidence for this claim. What’s to say it just wasn’t some eccentric atheist with possibly unpleasant memories of a Christian upbringing. Rich people do nutty things at times!.","date":"2013-09-23","mins":"7:46 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45192","author":"matthias","post":"I have visions of a book…a film….???? But seriously these are serious claims..","date":"2013-09-23","mins":"8:10 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45203","author":"matthias","post":"Look forward to reading more.","date":"2013-09-23","mins":"11:37 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-36748","author":"matthias","post":"Interesting, but I am not convinced … Yes Dave two of the four show the pattern as gamma. Also I agree that if it was meant an intentional marking of Gamma then it could represent the trinity – gamma has the numerical value of 3 in the Greek numericla system I offer some thoughts / questions: – If the holes represent an intentional representation of the L for Gamma, then why does it appear that there are a number of other much smaller burn holes? When viewed collectively do not the bigger and smaller holes argue for dropped hot liquid? Unless in the act of forming the L with whatever implement there was some secondary small droplet leakage from the implement? – Why burn the L Shape on, and risk the damage to a sacred object? Why not write it / paint it?.","date":"2013-06-11","mins":"10:51 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?"},{"id":"comment-36757","author":"matthias","post":"In looking at Shroud Scope at the poker holes, it reminded me that I remain fascinated by the horizontal trickle of blood along the lower back area. I can’t see any logical reason at all why a ‘forger’ would impose this. I proposed some months ago that the trickle came from blood flowing down the underside of the forearm, over the hip region, and down the small of the back, as Jesus was laid down following the descent from the cross.","date":"2013-06-12","mins":"2:12 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?"},{"id":"comment-36760","author":"matthias","post":"Thanks Dave. I liked Pam’s analysis on the L holes. Given how the shroud would have been folded, into a 2.2m x 0.55m dimension, it seems quite logical that it could have been draped over an altar, and then incense dropped on it. But I have to admit I found her theory re the Madrid Skylitzes and the Shroud unconvincing!.","date":"2013-06-12","mins":"2:57 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?"},{"id":"comment-36862","author":"matthias","post":"Yes, although the burn holes might have been an ‘accident’ it might have been a divinely inspired one, just as the shroud image may have been generated by a divinely inspired naturalistic event..","date":"2013-06-13","mins":"9:54 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?"},{"id":"comment-70108","author":"matthias","post":"De Wesselow’s theory is an interesting one. I find it more plausible than some atheist’s fanciful explaining away of the resurrection. But I still don’t buy it..","date":"2013-12-30","mins":"8:55 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-70109","author":"matthias","post":"Actually, I think De Wesselow calls himself an “agnostic” although the points of view offered in his book certainly read more like an atheist..","date":"2013-12-30","mins":"8:56 am","url":"https://shroudstory.com/2013/12/29/new-video-discovering-jesus-in-his-holy-shroud/","cat":"video","title":"New Video: Discovering Jesus in His Holy Shroud"},{"id":"comment-51255","author":"matthias","post":"Colin – I admire your inquiring mind. I am not a scientist, so I cannot comment on that realm with any authority. But as an architect, I think I have a fair understanding of images, representations, artistry etc. I have a major question about your scorching theory. To me, it beggars belief that a statue, bas relief or whatever would have been created that would match the very lifelike and non statue like characteristics of the dorsal image, especially the leg / feet positions and angles etc. If a bas relief / statue had been created to make the shroud via scorching, do you not agree that we would likely have seen a far less natural image (dorsal in particular). More along the lines of backs of legs flat against the cloth as in a usual lying position. I just find it very hard to think an artist would have created a bas relief with those leg / feet positions. The art historian de Wesselow has said similar things. To illustrate my point, I went to Christ Church (magnificent) in Oxford earlier this year. I saw the statue seen as the fourth image down on this link. Http://kdscout.blogspot.com.au/2012 12 01 archive.html The underside of the knight’s legs are pretty much lying flush with the base, and if such an obvious depiction is flipped then naturally the backside of the legs will be shown as fairly level rather than bent – and then one would expect a consistent scorch image across the whole back of the legs, rather than the image which seems to imply knees were bent to some extent Your theories may be scientifically feasible, but they seem to stretch artistic credibility in my view. Unless of course the creator of this enigma was a very very clever man artistically and scientifically????.","date":"2013-11-14","mins":"8:05 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"},{"id":"comment-51249","author":"matthias","post":"Why not a miracle? My wife and I were doing the dishes on Monday night at a late hour (11pm), a very odd rattling of the dishes in the cupboard occurred (for about 7 or 8 seconds). Now there’s hardly any earthquakes here in Adelaide, and one wasn’t recorded that night. We looked in the cupboard and there were no rats etc. Indeed there’s no way they could get into that cupboard. The next day we found out that the woman my wife cared for in New Zealand passed away just before that weird event. My wife and her were very emotionally / spiritually close. I have no doubt that the events were linked, of course skeptics will try and rationalise this experience as some sort of delusion. But I don’t give a toss if they do. Miracles / spiritual events beyond the material DO occur. I’m not saying a miracle created the shroud, I’m just saying it might have. In fact I BELIEVE it did. And I am not subscribing to any radiation type effect. The supernatural by its very definition is beyond materialistic explanation, so I believe some effect beyond our knowledge limits (including radiation) created the shroud image. But that’s just my belief, and I could well be wrong..","date":"2013-11-14","mins":"7:44 am","url":"https://shroudstory.com/2013/11/09/video-barrie-schwortz-at-the-pikes-peak-prophesy-summit/","cat":"video","title":"Video:  Barrie Schwortz at the Pikes Peak Prophesy Summit"}]
