[{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Fig 7 in that link is interesting, Hugh. it’s x2000 magnification. It shows 3 levels of organization if I’m not mistaken. Overall it’s a fibre, inside of which are at least half a dozen or so fibrils, two of which are broken off and shorter than the rest, and finally one can see that the fibrils are in turn collections of exceedingly fine microfibrils. The authors themselves make the distinction between fibrils and microfibrils in their text and captions.\nComparing that Fig 7 (an SEM picture so presumably somewhat shrunken due to dehydration) with your Fig 5,  and taking your word that yours definitely is x1000, which i have never doubted, I still think you are seeing fibrils. I can understand Thibault thinking otherwise – it is a spectacular picture of fractured fibrils given it’s light microscopy with an improvised  cross-polaroid feature, the like of which I have not seen before. \nI’ve  used it in my current post – the last for a while – suspecting it has immense significance where the reported brittleness of Shroud image fibres is concerned.  It places a huge question mark over the dogma that a scorch has to be highly superficial – restricted to the PCW – to be of relevance to the Shroud. In the light of that picture, I’d say that all bets are off…\n","date":"January 16, 2013 at 12:00 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1738","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"I have replied to Thibault be email, so that I could include more photos, but the essence is:\nYes, Photo 5 is at X1000.\nBut, I now think the plank-like blocks are actually groups of hundreds of microfibrils, possibly called mesofibrils, as illustrated in a SEM photo of a flax fibre fracture at http://www.sciencedirect.com/science/article/pii/S1359835X02000404.\nI am puzzled that my photos and the SEM photo show no sign of primary cell walls, and do not look that very fortuitous photo of a torn ‘sheathed cable’ appearance illustrated by Fanti. It’s almost as if I am using a different kind of fibre altogether – although it is certainly linen. Very curious.\n","date":"January 15, 2013 at 11:36 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1737","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Dear Hugh,\nYour photo above  :”5) End of a single scorched fibre showing broken microfibrils – X1000″\nis very amazing.\nI don’t understand.\nIt can’t be microfibrils.\nIt looks like a “technical fiber”, i.e a bundle of some individual fibers that are often found in any kind of linen textile.\nAre you sure that the magnification is x1000 ?\nIt seems to me impossible.\nThibault.\n","date":"January 15, 2013 at 9:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1734","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"You might be interested in this paper from the Journal of Materials Science(1999), Hugh, if you have not seen it already.  Only the abstract is available, The abstract alone, and selected free pages (well spotted Hugh!)is interesting, at least to those of us who are intrigued by the report that  TS image fibres are fragile and prone to fracture (hardly likely if the imaging process were confined purely to the PCW or an impurity layer).\nAbstract:\nThe deformation behaviour of single elementary flax fibres was investigated in an ESEM, using a modified loop test. Plastic deformation starts on the compressive side of the loop, whereas fibre failure occurs on the tensile side of the loop. The primary and the secondary cell wall show a different deformation behaviour. The primary cell wall breaks in a brittle manner, whereas in the secondary cell wall, due to its fibrillar nature, a coarse crack grows, bridged by fibrils. The secondary cell wall was found to split relatively easily along the length direction, indicating that the lateral strength of the fibre is lower than its tensile strength, which also accounts for the lower compressive strength of the fibre compared to its tensile strength.\nBos and Donald\nhttp://link.springer.com/article/10.1023%2FA%3A1004650126890?LI=true\nThis paper refers to flax, not linen fibres, and says the fibrils tend only to separate along the length axis, it being the PCW that snaps across its width. But we are dealing with linen post-retting that has lost its pectin cement between the fibrils.  That might explain that very pretty photograph of yours (No. 5 in the series) with scorched cellulose (micro?) fibrils that have snapped across their diameter. If enough fibrils break, that would be catastrophic where the integrity of the whole fibre was concerned, would it not? Brittle is the word that springs to mind. \nMethinks there may still be quite a bit more mileage in the “scorch hypothesis” – if only for generating new approaches for looking at Shroud image v non-image fibres. Maybe Turin’s  shadowy Prof Gonella has a few more stray Shroud fibres ‘in safe keeping’ in a bottom drawer he could spare, assuming he did not give his last one to Ray Rogers for the latter’s one “spliced” fibre demolition job on the radiocarbon dating…\nPS: have just discovered that Luigi Gonella is sadly no longer with us (died 2007). This pdf describing his involvement with the TS, especially Rogers. makes interesting reading:\nhttp://www.shroud.com/pdfs/n67part8.pdf\n","date":"January 15, 2013 at 10:31 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1727","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"And their diagram bundles the microfibrils into mesofibrils, and then the mesofibrils into elementary fibrils. Confusing…\n","date":"January 15, 2013 at 10:54 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1728","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"I have this paper.\nThibault.\n","date":"January 15, 2013 at 8:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1733","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Thanks for the link, Adrie. However (and I’m aware I’m going out on a limb here: my knowledge of the microstructure of linen is entirely superficial…) I’m not sure Fanti et al have interpreted their pictures in exactly the same way as I do, although the effect is perhaps the same.\nMy understanding, based on the agrofibrecomposites site which I have mentioned above, is that the structure of a fibre is more complex than a simple ‘PCW – SCW – Lumen’ model, in that the “inner cellulosic material” of the SCW is not amorphous, but itself divided into ‘microfibrils,’ which are the things which have broken up into the rectangular sections we see on Fanti’s photo. I don’t know if each of the microfibrils has a PCW of its own (but presumably they have some kind of structure), and I don’t know if the whole fibre is sheathed in its own cell wall of some kind. It seems to break up quite readily when heated.\nSo where Fanti sees a single thin PCW layer coating a thick amorphous SCW with a hole in it, I see a bundle of a dozen or fewer microbrils. Where his PCW is torn away like peeling paint to reveal uncoloured SCW, I see fragments of microfibrils broken away to reveal other microfibrils, which are uncoloured. I don’t think the overall effect of the image, or the mechanism of its appearance, would be very different in either case.\nHaving said that, one of Fanti’s threads (Photo 9 and particularly 10 in your link) looks so exactly like a torn PCW sheath around an amorphous core that I am given pause, as they say! I will have to start stressing some more fibres to see if I can achieve the same result, coloured or uncoloured.\n","date":"January 15, 2013 at 10:06 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1726","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Prompted by Thibault’s reply on the Other Site, I searched the Superficiality paper, now online for free. Figures 9B and C and 10-2 (p. 8) show that the color really is superficial: the uncolored substrate still connects the two parts of the broken image fiber.\n","date":"January 15, 2013 at 9:04 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1725","author":"Adrie","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Superb comment if you don’t mind me saying Hugh. Not just a breath of fresh air – more like having the windows flung open in a room with a stagnant stuffy atmosphere.\n","date":"January 15, 2013 at 7:58 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1723","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"The ‘locally degraded image layer’ photos in Adrie’s first reference, from a shroud image fibre, are quite consistent with a light scorch. The fibre has been broken into those plank-like fragments of microfibril illustrated in my own photo above, some of which have broken completely away, to leave that gap. The reason the gap is not coloured is not, of course, anything to do with the lumen. It’s an empty space, and empty spaces can’t be coloured. No, the reason the gap is not coloured is because either the microfibrils underneath it are uncoloured (and I find with light scorches that there is no need for them to be), or there are no microfibrils there; after all, this fibre was presumably torn off the shroud, and the tape need not have removed the fibre in its entirety. We are told how easily these tapes came away; this was because the image fibres were sufficiently degraded to break away rather than having to be pulled out like the non-image fibres.\nThe picture of the fibre degraded by coronal discharge was formed, we are told, by ironing the cloth. That’s what I call a scorch. I can understand that it may be that a CD predisposes cloth to scorch at a lower temperature than usual, as may coatings of sugar or starch, but to my mind, brown marks made by ironing = scorches.\nAs for the ghosts – Is that rather grey, rather grainy photo of two smooth trenches in the sellotape glue the only photo we have of them? I know how different a photo can be from what is actually observed through the eye-piece, and don’t deny Rogers’s or Adler’s observations, but if that is all the evidence we now have – well it’s not much to go on, is it?\n","date":"January 14, 2013 at 11:28 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1722","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Hello Thibault. Greetings. I’m not sure what I have to say to you right now regarding the science. It’s your prerogative to dismiss scorching at each and every opportunity, but what do you have to put in its place? Sorry to be so blunt, but I don’t believe in beating about the bush. Scorching ticks a lot of boxes for me –  see the banner at the top of my posts – so I don’t know how you can be so categorical that scorching played no part in the making  of the TS, whether it was a 1st century or 13th century event (I prefer the latter, needless to say, feeling that the radiocarbon dating could not have got it so wrong as to confuse those two). \nAgain, I ask, what is your preferred model, assuming that you have one?\n","date":"January 14, 2013 at 10:34 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1721","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Hello Colin,\nWhat are you speaking about ?\nI do not understand some typical English sentences like ” I don’t believe in beating about the bush”.\nWould you be kind enough to use basic English with me please ?\nI have absolutely no preferred model.\nBut I have seen myself that scorching does not work in the REAL world.\nIn any case, I try to follow the discussion both on your site and the other site.\nThibault.\n","date":"January 15, 2013 at 8:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1732","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"In the REAL world of scientific research,Thibault, it is better to have a hypothesis than no hypothesis. In the absence of a hypothesis, any hypothesis,  there tends to be stagnation and failure to pursue new experimental directions . It is through the cycle of hypothesis and experimentation that we gain new and original insights, occasionally breakthroughs if one gets lucky. That’s true whether the initial hypothesis gains traction or has subsequently to be modified or abandoned.\nWorking in an area of research for months or years without ever framing an hypothesis with which to plan new experiments, interpret and rationalise findings, counts as failure in my book. Failure is not an option for a professional scientist whose job is to make new discoveries.  You chose to treat patients, I chose to make new discoveries and advance new hypotheses and theories. Be as sniffy as you like about scorching, but it’s a hypothesis, which is one more than you presently possess.  \n“Beat about the bush”: ne pas y aller par quatre chemins…   😉\n","date":"January 15, 2013 at 9:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1735","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Drat. You give in too quickly. Now we’ll have to find something else to disagree about. Liked your comment however about the medullas on T’Other Site, and had drafted something rather similar for tomorrow’s post. Ray Rogers, gifted chemist though he could be when properly tuned in, was a great one for setting up diversions and road blocks that take hours to make sense of. In fact, I suspect your misunderstanding re bast and elementary fibres could have been due to that Cardamone diagram he inserted into his FAQs. It had me confused for a long time too…\n","date":"January 14, 2013 at 7:10 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1716","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Thanks profusely Adrie – I had seen that posting of Dan’s, but had failed to make a proper mental note of that crucial detail re a transverse section, probably due to all the other distractions  and wrangles (Valencia,  Dawkins challenge, what Rogers had really meant but didn’t quite say etc etc). The question I ask myself is whether the interior of the fibre really was devoid of colour, or only seemed that way, relative to an intense coloration on the surface. A faint colour in the interior could/might still account for a lot of total light absorption, at least by transmitted back-light across the entire diameter of the fibre, on account of the relative dimensions of SCW and any sub-microscopic surface layer (PCW or acquired coating) as proposed in my posting.\nRe your second para, I am deeply curious to know how one could detect ghosts in adhesive from non-image fibres if they are : (a) below the resolution of light microscopy and (b) uncoloured.  Maybe you can illuminate (no pun intended) or help me visualize (pun intended)  😉\n","date":"January 14, 2013 at 11:17 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1709","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"For the color difference between ghost and substrate, see the photomicrographs of a locally abraded image layer in three different views (one of them also in Fanti’s fig. 17 p. 13, where the caption says the dark lines in the colored area are cracks in the surface). \nRe the ghosts of non-image fibers: they were colored too, says evidence A3, in which “Zugibe and Rogers 1978” = “collection of 86 photomicrographs, archived by Barrie Schwortz 1978, 1985” (p. 19). Adler called the color of the background “fibrils” “pale yellow”, while he called the color of the image fibrils “yellow” and that of the 1534 AD backing cloth’s fibrils “very pale” (not yellow) (Heller&Adler, A Chemical Investigation, table 2, reproduced in Heimburger, A detailed critical review, p. 12). Elsewhere Adler called the color of the image fibers “straw yellow” (The Nature of the Body Images, p. 2).\nOf a “yellow patina on one surface of many Roman-period papyri from Tebtunis” it is said that it is “possible that the basic overall yellow shade is due to the natural ageing of a layer of paste on the surface”, viz. “the light paste wash mentioned by Pliny”\n (Ancient Egyptian Materials and Technology, p. 238).\nAlas, no visualisation by photomicrographs, perhaps Barrie can  help …  Sorry about the starch …\n","date":"January 14, 2013 at 8:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1717","author":"Adrie","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Drat, another wrong link. Here’s the right one: The Nature of the Body Images, p. 2.\n","date":"January 14, 2013 at 8:32 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1718","author":"Adrie","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Wow. You really know your stuff Adrie. Now it means yet more reading. If I don’t crack this Shroud thingy soon, I shall have employ a research assistant…\n","date":"January 14, 2013 at 8:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1719","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Nomenclature can be a bit of a problem. I’m using the word thread to mean the product of spinning flax fibres together, the thing with the Z-twist in it. Threads very rarely get pulled off cloth samples by sticky tape unless they are very short (from a cut sample) or very damaged. Fibres are what the threads are made of, and appear to be the product of whatever treatment flax plants are given to turn them into something spinnable. They can be of different thicknesses. Photo 5 is the end of one of these fibres. Fibres, according to http://www.agrofibrecomposites.com/process.htm, are made of ‘elementary fibres,’ which in turn are made of microfibrils.\nAdrie: thanks for that. I’ve been trying to get hold of a copy of the Orphaned Manuscript but so far without success. Italy is a bit slow in postal delivery! Do you happen to know if the ‘ghosts’ were examined between crossed polarisers? That would establish whether they were bits of degraded flax, or an added coating.\n","date":"January 14, 2013 at 11:05 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1708","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"So if I understand you correctly, Hugh, your photo 5 is of a highly magnified (x1000) fibre, aka elementary fibre, just one of scores in a thread. What one sees inside are not fibres, but fragmented cellulose fibrils, those break points not to be confused with the nodes/dislocations of linen/flax elementary fibres.  Have I got that right?\n","date":"January 14, 2013 at 11:25 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1710","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"No, I think photo 5 is an ‘unqualified’ fibre, and the broken plank-like thingies are bits of ‘elementary fibre.’ I think you’d have to go to SEM for microfibrils. I think fibres, elementary fibres and microfibrils all break just anywhere if sufficiently degraded, which these are.\nYou’ll have seen my response to Adrie on shroudstory. I’ll send Dan a couple of blow-ups of Rogers’s photos, and maybe a couple of my own for comparison.\n","date":"January 14, 2013 at 5:30 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1713","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"It’s my understanding Hugh (correct me if I’ve misunderstood) that if you take a thread from linen, and tease it apart, you will see scores of individual fibres that are easily visible with the unaided eye, but which need a microscope to see internal structure. It is these fibres that are described as “elementary fibres” in the literature. That may be in order to distinguish them from bast (stem) fibres in unretted flax stems that are bundles of those same elementary fibres but cemented together with pectin etc. Retting rots away the latter, releasing the elementary fibres that are spun into multi-fibre threads for weaving\nNow then,  when you look at a linen elementary fibre under a microscope, low power, maybe with polaroids, in addition to the nodes aka dislocations,  then you may, if you’re lucky and focus carefully, be able to see the microscopic strand-like structures within the elementary fibres that are cellulose fibrils. So one does not need SEM  merely to detect the presence of  cellulose fibrils – only to see their fine structure. I’ve seen references to microfibrils and even nanofibrils. Maybe it’s those you are thinking of, and maybe equating “elementary fibre” with fibril or microfibril? An elementary fibre is one or more elongated nucleated cells, fused together. A fibril is at the subcellular level.\nSo, to summarise: given the high magnification of your photo 5,  I don’t think it’s a thread you see there with its elementary fibres. I think it’s an elementary fibre, showing internal, closely packed cellulose fibrils. First, compare with your x400 pictures which you agree show single (elementary) fibres – NOT whole spun threads comprising scores of fibres. Secondly, your picture 5 shows  bundles of our contentious ‘wotsits’  that are SHEATHED. There is no sheath on a thread, but the fibrils of an individual elementary fibre ARE within some kind of sheath,  presumably  the primary cell wall, and the bundle of cellulose fibrils collectively comprise  the secondary cell wall.. \nWhat do Adrie (and Thibault if he’s around) have to say I wonder? One thing’s for certain. It’s important we get the nomenclature right, if we  are not to talk at cross-purposes.\nPS I think you mean response to “Andy”, not Adrie. I’m planning a post for tomorrow to counter his weaponised Rogers – which he deploys in a trademark atttempt to shut down off-message debate (his message, needless to say)…\n","date":"January 14, 2013 at 6:19 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1714","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Aaaaaah! (Sound of penny dropping). So I thought the things people spun with were “bast fibre bundles,” but actually they had been separated in the retting process and are in fact individual or ‘elementary’ fibres. Got it at last. Revised caption to photo 5…\n5) End of a single scorched fibre showing broken microfibrils – X1000\n","date":"January 14, 2013 at 6:50 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1715","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Yes, I am here.\nToo much to say right now !\nBut in any case, very interesting.\nFor the time being, I am looking to Hugh’s beautiful photos and comments.\nI have posted on “the other site” my answers to some questions of Hugh.\nMy comments/answers, peer-reviewed papers on the PCW and photos later.\nBest regards.\nThibault.\n","date":"January 14, 2013 at 9:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1720","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Hello Colin,\nTo answer your question: “Al Adler mounted image fibers in plastic and cut sections normal to the length of the fibers. He did not see any color in the cellulose.” (Dan in his posting of May 7, 2012; see also my comment). It was the second of “Adler’s observations” (plural) mentioned by Rogers in FAQ 12, p. 11, of which he only described the first one (the ‘diimide observation’). I haven’t found the ‘cross section observation’ in the compilation of Adler’s articles in The Orphaned Manuscript.\nBTW, ‘ghosts’ were also pulled from non-image fibers of the Shroud: “Phase-contrast photomicrographs show that there is a very thin coating on the outside of all superficial linen fibers on Shroud samples named “Ghost”; “Ghosts” are colored (carbohydrate) impurity layers pulled from a linen fiber by the adhesive of the sampling tape and they were found on background, light-scorch and image sticky tapes (Zugibe and Rogers 1978, Rogers 2002).” (Evidence A3, p. 4 of Evidences for testing hypotheses).\n","date":"January 14, 2013 at 10:51 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1707","author":"Adrie","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"PS: might not 5 be described as a thread, or rather part of a thread, in other words a skinny fibre-depleted thread, given the relative paucity of elementary fibres?   I’m assuming it is not an elementary fibre showing cellulose fibrils. Or is it – given the very high (x1000) magnification?\n","date":"January 14, 2013 at 10:08 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1705","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Thanks Hugh – have now added them.\n","date":"January 14, 2013 at 9:50 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1704","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"1) Sticky tape sample of scorched linen between crossed polarisers – X40\n2) Sticky tape sample of fresh linen between crossed polarisers – X40\n3a) Scorched part of single fibre – X400\n3b) Unscorched part of the same fibre – X400\n4) Sticky tape sample of scorched linen (as photo 1) in transmitted light – X40\n5) End of a single scorched fibre showing broken ‘elementary fibres’ – X1000\n","date":"January 14, 2013 at 9:39 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1703","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"Thanks Hugh. Any chance you could supply captions to accompany each of your pictures?\nI’ve just added this to the end of the posting:\n“PS:  Hugh’s observations above are based on some highly adept and resourceful handling of his sticky tape, crossed polaroids etc. There’s some fascinating detail packed into those summaries, and he may well have hit on a method for distinguishing between an image on the surface as against one that is more integral with the fibre (some convergence there?). Since my head is buzzing right now with embryonic new interpretations based on my own “impure SCW cellulose” model above,  and on Hugh’s, placing a question mark against exclusive PCW imaging, I’ll  hold off saying any more about Hugh’s findings right now, allowing time for thoughts to gel. \nSorry about the wordiness – but there are some tricky issues here . Oh how I wish we had cross-sections to examine, as mentioned earlier. Does anyone know if any of the STURP investigators (Adler? Heller? McCrone?) ever sectioned and examined cross-sections of, say, wax- embedded threads and/or elementary fibres?\n","date":"January 14, 2013 at 12:01 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1702","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"I neglected to mention that the fourth picture (fibre bashed to bits) is at 1000X. It is those little broken plank-like pieces that come off and stick to the sellotape making the little patches of brown lines in the previous 40X picture.\n","date":"January 13, 2013 at 8:43 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1701","author":"Hugh Farey","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"🙂  You did say that school of yours was for boarders, didn’t you Hugh? Methinks one of your charges must have slipped something into the staff sugar bowl…\n","date":"January 13, 2013 at 10:05 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1697","author":"colinsberry","site":"colinberry"},{"title":"Time maybe for a radical re-jigging of the scorch model – and of the alleged superficiality of the Shroud image too?","post":"My microscope doesn’t have polarised filters either but I happened to have a couple of squares  which I simply piled above and below a slide. What I can’t easily do is rotate them. You can get them from sciencestore.co.uk for £6 or so, but to my surprise, as we started the Lent term several children returned with what looked to me like comic plastic spectacles. They were from 3D cinemas, and as the children had no use for the lenses, they had just pulled them out and threw them away! Luckily I managed to retrieve a few.\nJust as a control, yesterday I smeared some gravy browning (sorry, ‘ammonia caramel’) onto some linen, let it dry and stuck sellotape on it. Sure enough the colour came away, but the little patches do not shine in crossed polarisers.\nFinally, the papers last week were full of a new portrait of Kate, Duchess of Cambridge, full face, with a very dark background. By superimposing it, with a bit of stretching, onto the Enrie negative, it is easy to prove conclusively that she is a direct descendant of Jesus and probably has a glass of wine from the holy grail every evening with Leonardo da Vinci. Remember you saw it here first…\n","date":"January 13, 2013 at 9:57 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2013/01/13/time-maybe-for-a-radical-re-jigging-of-the-scorch-model-and-of-the-alleged-superficiality-of-the-shroud-image-too/","cat":"hugh_farey","id":"comment-1696","author":"Hugh Farey","site":"colinberry"}]
