[{"id":"comment-168083","author":"solomon_golden","post":"Would you believe me if I told you that I had a vision of Christ and his mother Mary both immersed in white light similar to the white light described in the account given by : (Matthew 17 The Transfiguration ) …After six days Jesus took with him Peter, James and John the brother of James, and led them up a high mountain by themselves. There he was transfigured before them. His face shone like the sun, and his clothes became as white as the light….) No I’m not lying – This happened in 1981 when I was 19 years of age working as a construction winch operator in Florida. I’m not a scientist nor am I a historian and obviously am not an apostle of Jesus. All I can say is that I literally saw each totally immersed in white light – first Jesus and immediately thereafter Mary his mother. No words were exchanged just a vision. The whole experience lasted less than 1 minute. Immediately thereafter I felt warmth and joy – an indescribable kind of joy. All I desired at that specific moment was to help others. I recently began studying the shroud and have come to the conclusion that the same light in the bible account and the light I saw with my own eyes emanating from Jesus and Mary’s silhouette is the light that radiated from Jesus’s body and left his image on the shroud during his resurrection. Don’t ask me what is that divine light composed of – all I know the light I saw was white and extremely bright like the sun. I wish you could experience it for your self/s – then you would understand. Furthermore – Jesus’ transfiguration in white light appearing to Peter James and John holds a deeper meaning than just a mere vision. The mystery involves the Past, Present and Future. Jesus was in fact revealing to his apostles what his body was going to look like and more importantly represent after resurrection ( totally glorified ) the past had to do with Moses and Elijah talking amongst themselves ( The Law ) and the present was non other than what the disciples were witnessing at that distinct moment. The transfiguration/miracle involved the suspension of the laws of time. Literally past – present and future were happening all at once! Some days pass after this mysterious event and Jesus is crucified by the romans. On the third ( 3rd ) day after the crucifixion Jesus’ resurrection takes place just as he had promised. But here is the important point that links the white light to the shroud – When visiting the tomb on the third day John 20:4 8 says .. John saw and believed …… What did he see you ask me? ANSWER: He approached the linen shroud and saw it gleaming with white light just as he had seen it days before during MATHEW 17. Account. John’s jaw probably dropped as his mind wandered back when he witnessed Jesus’ clothes radiating bright light. I hope this makes sense to all of you scholars and laymen. I hope I have not offended anyone as all Im trying to do is to tell my story as it happened and make some sense of the mystery of the image of the shroud. All be well..","date":"2014-11-03","mins":"1:08 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168040","author":"solomon_golden","post":"Mr Freeman –please read these links – and once in for all convince yourself. By the way thank MR Mike M for them. November 2, 2014 at 4:59 pm Sorry Charles, you are not an authority on this subject, I can’t take your work seriously. I advise any interested reader to look further into the works of Dr. Piere Barbet ( chief surgeon at Saint Joseph’s Hospital in Paris.) http://en.m.wikipedia.org/wiki/Pierre Barbet (physician) Dr. Robert bucklin (M.D., J.D. Las Vegas, Nevada) https://www.shroud.com/bucklin.htm Dr. Frederick T. Zugibe (M.D., Ph.D.Adjunct Associate Professor of Pathology, Columbia University, College of Physicians & Surgeons, N.Y. Chief Medical Examiner, Rockland County, N.Y.) https://www.shroud.com/zugibe2.htm Dr. Gilbert R.Lavoie (M.D.) http://shroudofjesus.com/page8.html Dr. William D. Edwards M.D. Et al. Http://www.godonthe.net/evidence/on the physical death of jesus JAMA.pdf Dr. Pierluigi Baima Bollone, (a professor of forensic medicine in Turin) https://shroudofturin.files.wordpress.com/2013/12/bbk 7.pdf Dr. Niels Svensson (M.D.) http://www.catholic.com/profiles/dr niels svensson God Bless,.","date":"2014-11-02","mins":"11:18 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"}]
