[{"id":"comment-95518","author":"egm","post":"Wow! So Ramsey puts out what looks like disinfo on a crucial question regarding how/if the numbers could have been fudged in the C14 tests (whether intentionally or it was just a ‘senior moment’ you can decide) — thus appearing to discredit himself — yet Stephen Jones is the one looked askance at and receiving cheap pot shots for pointing it out and daring to pursue the important questions! I guess the saying is true about knowing you’re over the target when you’re getting lots of flak! “Whoever misleads the upright into an evil way will fall into his own pit, but the blameless will have a goodly inheritance.” Proverbs 28.10 *** Matthew 17:1 2 And after six days Jesus taketh with him Peter, and James, and John his brother, and bringeth them up into a high mountain apart: and he was transfigured before them; and his face did shine as the sun, and his garments became white as the light. Mark 9:2 3 And after six days Jesus taketh with him Peter, and James, and John, and bringeth them up into a high mountain apart by themselves: and he was transfigured before them; and his garments became glistering, exceeding white, so as no fuller on earth can whiten them. Luke 9:29 And as he was praying, the fashion of his countenance was altered, and his raiment [became] white [and] dazzling. Luke 24:3 4 And they entered in, and found not the body of the Lord Jesus. And it came to pass, as they were much perplexed thereabout, behold, two men stood by them in shining garments Matthew 28:1 4 In the end of the sabbath, as it began to dawn toward the first day of the week, came Mary Magdalene and the other Mary to see the sepulchre. And, behold, there was a great earthquake: for the angel of the Lord descended from heaven, and came and rolled back the stone from the door, and sat upon it. His countenance was like lightning, and his raiment white as snow: And for fear of him the keepers did shake, and became as dead men. Revelation 21:23 And the city had no need of the sun, neither of the moon, to shine in it: for the glory of God did lighten it, and the Lamb is the light thereof. Ephesians 5:14 Wherefore he saith, Awake thou that sleepest, and arise from the dead, and Christ shall give thee light. Psalm 17:15 As for me, I will behold thy face in righteousness: I shall be satisfied, when I awake, with thy likeness. Malachi 4:2 But unto you that fear my name shall the Sun of righteousness arise with healing in his wings; and ye shall go forth, and grow up as calves of the stall. Daniel 10:5 6 Then I lifted up mine eyes, and looked, and behold a certain man clothed in linen, whose loins were girded with fine gold of Uphaz: His body also was like the beryl, and his face as the appearance of lightning, and his eyes as lamps of fire, and his arms and his feet like in colour to polished brass, and the voice of his words like the voice of a multitude Revelation 1:14 16 His head and his hairs were white like wool, as white as snow; and his eyes were as a flame of fire; And his feet like unto fine brass, as if they burned in a furnace; and his voice as the sound of many waters. And he had in his right hand seven stars: and out of his mouth went a sharp twoedged sword: and his countenance was as the sun shineth in his strength. Exodus 34:29 35 And it came to pass, when Moses came down from mount Sinai with the two tables of testimony in Moses’ hand, when he came down from the mount, that Moses wist not that the skin of his face shone while he talked with him. 30 And when Aaron and all the children of Israel saw Moses, behold, the skin of his face shone; and they were afraid to come nigh him. […] And till Moses had done speaking with them, he put a vail on his face. 34 But when Moses went in before the LORD to speak with him, he took the vail off, until he came out. And he came out, and spake unto the children of Israel that which he was commanded. 35 And the children of Israel saw the face of Moses, that the skin of Moses’ face shone: and Moses put the vail upon his face again, until he went in to speak with him. Numbers 6:24 27 The LORD bless thee, and keep thee: The LORD make his face shine upon thee, and be gracious unto thee: The LORD lift up his countenance upon thee, and give thee peace. And they shall put my name upon the children of Israel; and I will bless them. Daniel 12:2 4 And many of them that sleep in the dust of the earth shall awake, some to everlasting life, and some to shame and everlasting contempt. 3 And they that be wise shall shine as the brightness of the firmament; and they that turn many to righteousness as the stars for ever and ever. 4 But thou, O Daniel, shut up the words, and seal the book, even to the time of the end: many shall run to and fro, and knowledge shall be increased..","date":"2014-04-01","mins":"11:13 am","url":"https://shroudstory.com/2014/04/01/developing-a-hacking-theory/","cat":"hacking","title":"Developing a Hacking Theory"},{"id":"comment-87258","author":"egm","post":"“That’s backward science” Jones can speak for himself of course, but it’s not backward if say for instance you originally start with honest skepticism then investigate the Shroud and discover it’s authenticity is backed up in spades save an anomalous C14 test that, upon investigating beyond the compliant mainstream news with headlines plastering the world over yearly, points to sabotage from the inside to discredit the Shroud. Then you can move to the next level after arriving at the Shroud’s authenticity and attempt to explore how widespread the fraud really is which some don’t want to be discussed it seems. It’s naturally going to lead into colluding elements if that’s what really happened, possibly strange bed fellows as well, that’s human nature I’m afraid, you don’t get to claim it debunked just because it sounds strange, absurd, ridiculous, etc to your (hopefully not closed) mind. Reality is absurd and ridiculous and over the top sometimes. If hacking the labs is really so off base as some would like to paint it, then it should easily be debunked with verified facts and the world will continue. So far there seems to be only more questions raised and clarifications needed from the responses from representatives of two of the three labs involved in the 1988 C14 tests..","date":"2014-03-11","mins":"3:46 am","url":"https://shroudstory.com/2014/03/09/comment-promoted-on-the-hacking-hypothesis/","cat":"carbon_14_dating","title":"Comment Promoted:  On the Hacking Hypothesis"}]
