[{"id":"comment-34559","author":"egm","post":"There are layers of meaning in Paul’s use of a veil in 2 Cor 3.18, the most obvious reference perhaps being the glory of Moses’ face from being in the presence of the glory of God’s face (from glory to glory): Exodus 34:29 35 (NAS) “It came about when Moses was coming down from Mount Sinai (and the two tablets of the testimony were in Moses’ hand as he was coming down from the mountain), that Moses did not know that the skin of his face shone because of his speaking with Him. So when Aaron and all the sons of Israel saw Moses, behold, the skin of his face shone, and they were afraid to come near him. Then Moses called to them, and Aaron and all the rulers in the congregation returned to him; and Moses spoke to them. Afterward all the sons of Israel came near, and he commanded them to do everything that the LORD had spoken to him on Mount Sinai. When Moses had finished speaking with them, he put a veil over his face. But whenever Moses went in before the LORD to speak with Him, he would take off the veil until he came out; and whenever he came out and spoke to the sons of Israel what he had been commanded, the sons of Israel would see the face of Moses, that the skin of Moses’ face shone. So Moses would replace the veil over his face until he went in to speak with Him.” There’s also the veil the bride wears over her face until she becomes the wife. The wife of Christ does not wear a veil and is exposed to the glory of God. (“Did I not say to you that if you believe, you will see the glory of God?” John 11.40) The veil can also be referencing the Sudarium (or a darkness) placed over the face of the dead, to be removed in the resurrection, when they are to put on the glory of God. (“Beloved, now we are children of God, and it has not appeared as yet what we will be. We know that when He appears, we will be like Him, because we will see Him just as He is.” 1 John 3.2) (Wherefore he saith, Awake thou that sleepest, and arise from the dead, and Christ shall give thee light. Ephesians 5.14) (As for me, I will behold thy face in righteousness: I shall be satisfied, when I awake, with thy likeness. Psalm 17.15) The veil of the most holy place also applies. The image in the most holy place was the covering cherubim on opposite ends of the mercy seat representing where God’s glory resided on earth, just as the image of the shroud represents Christ’s glory and the tomb where it was found had two angels on opposite ends of where he was laid. (“and she saw two angels in white sitting, one at the head and one at the feet, where the body of Jesus had been lying.” John 20.12) Paul was a top tier proto rabbi (Pharisee of the Hillel school) and was well aware of all these interconnections and multidimensional streams of thought and more which we (I) entrained to the western mode of thinking can barely scratch the surface of, except by the Spirit. It’s a shame his Hebrew poetic genius isn’t clear in the Greek translations as shown in the Aramaic..","date":"2013-05-23","mins":"11:15 pm","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"},{"id":"comment-34451","author":"egm","post":"As important as the shroud would be, or seem to be, would we not expect it to be alluded to in some fashion in the old testament as were other significant events surrounding Yeshua and the Passion narrative? Behold: “When Elisha came into the house, behold the lad was dead and laid on his bed. So he entered and shut the door behind them both and prayed to the LORD. And he went up and lay on the child, and put his mouth on his mouth and his eyes on his eyes and his hands on his hands, and he stretched himself on him; and the flesh of the child became warm. Then he returned and walked in the house once back and forth, and went up and stretched himself on him; and the lad sneezed seven times and the lad opened his eyes. He called Gehazi and said, “Call this Shunammite.” So he called her. And when she came in to him, he said, “Take up your son.” –2 Kings 4.32 36 (NAS) Mouth to mouth, eyes to eyes, hands to hands: analogous to a mirror image and associated with a death and resurrection. Is not the shroud as a mirror image associated with a death and resurrection? “But we all, with unveiled face, beholding as in a mirror the glory of the Lord, are being transformed into the same image from glory to glory, just as from the Lord, the Spirit. […] And even if our gospel is veiled, it is veiled to those who are perishing, in whose case the god of this world has blinded the minds of the unbelieving so that they might not see the light of the gospel of the glory of Christ, who is the image of God. […] For God, who said, “Light shall shine out of darkness,” is the One who has shone in our hearts to give the Light of the knowledge of the glory of God in the face of Christ. But we have this treasure in earthen vessels [“a fragile vase of clay” per Weymouth; “a vase of earth” per Etheridge; “an earthen vessel” per Murdock], so that the surpassing greatness of the power will be of God and not from ourselves” –2 Corinthians 3.18; 4.3 4, 6 7 (NAS).","date":"2013-05-23","mins":"8:49 am","url":"https://shroudstory.com/2013/05/23/a-kind-of-witness/","cat":"event","title":"A kind of witness?"}]
