[{"id":"comment-17303","author":"egm","post":"It’s the Berrys of the world that have tarnished the respect the title Ph D may have once demanded in my eyes. His habitually biased and obnoxious approach in shroud studies are enough to defrock him of any objective scientific ‘credentials’ he is ever so keen to remind you of at every passing chance; frankly, it’s childish. He appears to be little more than a shill for the typical shallow minded hypercritics and militant atheists to thoughtlessly lap up and regurgitate on message boards across the web when confronted with the hard facts and serious scientists like Rogers. He seems to generate noise designed to drown out the good information and slow the progression of knowledge. In short, he’s a career troll. I for one will ignore this nuisance from now on..","date":"2012-10-07","mins":"4:44 pm","url":"https://shroudstory.com/2012/10/07/shame-on-you-dr-colin-berry-phd-or-ray-rogers-consummate-researcher-excellent-scientist/","cat":"other_blogs","title":"Shame on you, Dr. Colin Berry, PhD or Ray Rogers, Consummate Researcher, Excellent Scientist"},{"id":"comment-86287","author":"egm","post":"Actually this sounds like a valid hypothesis overall, the details might not be there yet but the means and motives definitely are. It’s likely the test was rigged from multiple angles in case any one should fail, from the shady sample selection to the backdoors in the system. The shroud is so important we cannot dismiss the depths enemies of Christ will stoop to discredit him and his witnesses (material witness in this case). Just read the Gospels and Acts to see the conspiracy against Christ, the Apostles, and subsequent disciples down the ages. Do you think it ever ended? Christ is a huge headache for the world powers, religious and political, not least of all Atheist world Socialism. Don’t be surprised if enemies of Christ are willing to portray themselves as Shroud supporters complete with Shroud blogs, only to shoot down any real progress in Shroud studies with cheap buzzwords for weak minds like ‘tinfoil hat’ or ‘conspiracy theory’ in order to manage the discussion. These Judas goat actors are to be expected “And no wonder, for even Satan disguises himself as an angel of light. So it is no surprise if his servants, also, disguise themselves as servants of righteousness. Their end will correspond to their deeds.” 2 Cor 11.14 5 While I might not agree with everything said I do appreciate the persistence of Stephen Jones — keep at it!.","date":"2014-03-08","mins":"3:13 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-86291","author":"egm","post":"Just want to add that the means definitely existed at the time but was it in place? I would think it highly likely to be, but this is important to verify. The motive however has always been there, whether it be a KGB agent or otherwise as pointed out already..","date":"2014-03-08","mins":"3:38 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-87177","author":"egm","post":"Re: #7 Mike, I was under the impression that the results were not produced simultaneously – not an major issue anyway. Really though, it’s a bit naive to think conspiracies are not at work to undermine Christ and his servants when it’s been recorded this way since the beginning of the Gospels not to mention the reason Christ was crucified to begin with. Conspiracies abound in just about every sphere of humanity. Just hang around a criminal courtroom for a some time if you lived a sheltered life. “I don’t discount fraud up to the sampling stage,” so you don’t discount the sampling was fraudulent – that’s a start. All it takes is more than one person involved to make it a conspiracy, nothing too outlandish. Careful you don’t slip up and admit conspiracies are possible, what would the good and most noble members of the Order of the Shroud Blog think of you? I’m sure we can find something in the DSM to diagnose you with. That’s ok, I suppose I should take your word at face value about how the lab systems worked back then and how all airtight it was because you worked at all three labs (simultaneously) and they ran the same C14 tests run in pharm labs and it’s absurd to think otherwise, etc etc. That might all be true for all I know, I hope it’s that simple. For the record I don’t know Jull and have never met and got to know the man and can’t vouch for his character, I guess you have and therefore can. What I do find absurd was the push against a perfectly valid line of inquiry about the security details surrounding perhaps the most important C14 test in history. Why the heck wouldn’t we want to know more about it?? All of a sudden we have you as an expert to pop up and explain it all away with a wave of the hand? The group response against it seemed unnatural and a bit overdone, even.. Dare I say it.. Suspicious? (Maybe you can insert a tin foil hat comment here) I felt compelled to add some balance to the discussion, but I never said I believed it happened as described, I only made it clear I believed it could very well have happened, especially in light of the criminal sample process and suspicious date. There should be a full on investigation of the whole situation start to finish with full cooperation from everyone involved. That will never happen of course. The next best thing is what Mr. Jones is doing and what does he get in return? A slap down by people supposedly most interested in learning about it. One small request Mike M, please don’t accuse me of branding someone a satan when I didn’t (Satan is referred to as the Accuser btw). The quote I gave also refers to servants of Satan (Adversary) who pose and act like believers of Christ to undermine their faithfulness. Of course quoting the bible to such won’t make much difference since they’ll just tell you Paul didn’t write 2 Corinthians (a pious fraud perhaps) or Christ may have misspoke here or there, etc etc. Hope that clears things up. Btw, I’d just like to point out that those who think the Shroud a fraud are conspiracy theorists. They would typically push the narrative that the cloth image is man made and peddled by members of the church (hierarchy) to attract a large patronage with hopefully larger pockets, or at least some variation of this plan which would require more than one person involved in the fraud..","date":"2014-03-10","mins":"10:55 pm","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-87243","author":"egm","post":"Re: #9 Mike, I don’t think I was upset, why would you think that? I might have poked fun at the stereotypes projected on those of us who study history and understand conspiracies are a huge part of life where power and wealth reside. Maybe you don’t believe me, that’s ok I’m cool with that. I wonder why you twisted my words when you misquoted me “Lived a sheltered life” editing out “in case you..” Typical tactic when you can’t address what was actually said just edit it how you like. As you said, I don’t know you and didn’t assume you were “street wise,” know what I mean? So no ad hominem there I’m afraid. ““Noble members of the blog”…. Again very typical…generalize without countering the actual arguments just bundle everyone else together and brand them.” It’s easier than actually listening to what they are saying.” Now you’re accusing me of not listening. No, I didn’t “bundle everyone together” either because not everyone plays the ‘conspiracy theory’ or ‘tin hatter’ card to stifle the discussion, just the ones who know who they are. And if I respond to an issue raised here, yes I do my best to read what others before me have said and then respond. The typical response was to hit the ‘conspiracy theory’ button way too fast to what Jones was proposing as if just invoking the words wins the argument. That’s kinda why I started my original post with “actually this sounds like a valid hypothesis..” and laid out my train of thought and tried to address issues with the reception of said proposal (ie, the conspiratorial nature of it, and the poor response it received; this is a pattern I’ve seen for some time btw, and not just on this blog). So why assume I didn’t listen? Do you have any evidence I didn’t or are you making another dig at me because you yourself can’t address the points? ““find something in DSM to diagnose you with” dude…what are you talking about.” This was a small joke, sorry you missed it. Some background: People will often stereotype those who bring up conspiracies as having mental issues without hearing them out, and the DSM is the bible of Psychiatry used to diagnose mental disorders. Interestingly, one of the signs used to diagnose some form of schizophrenia I believe was if the patient held the belief that the government wiretaps the phones! So there you have it, Edward Snowden is a headcase and should be extraordinary renditioned to the nearest re education camp for processing immediately! The NSA’s good name has now been cleared! You have to have humor on this board sometimes. ““Can’t vouch for Jull’s character”….neither can I, but why assume the worst in people. If you don’t know the guy why assume he is part of a conspiracy? Just because you don’t agree with him?” Now you’re accusing me of assuming the worst in people and Jull is part of the conspiracy?? Sounds to me like you’re the one assuming the worst in people — me. No, I was being completely neutral about Jull which I think is the smart approach in this delicate subject. If this were a criminal investigation (which it probably should be) and I was a detective, people in his position would definitely be a suspect — I do NOT assume his guilt, nor his innocence. You on the other hand admit you don’t know him but take him at his word anyways. Fine with me, I’m just trying to be a bit more cautious and circumspect in my approach and putting your voice in context when you support him. ““Have you as an expert”…… I never said I was.” Good I wanted to get that out in the clear because some may have been mislead by your, what may have appeared to be, seeming authority on the subject discussed. So, it’s not that I don’t want to believe you when you pipe up to assure everyone that everything ran perfect and no shenanigans were afoot (nevermind that their were shenanigans afoot during the thoughtfully screwed up sample process which should immediately cast the whole dark operation in a suspect light), it’s just that you might not exactly be qualified to say so one way or the other, nor am I, only I don’t assume to do so as you did while attempting to insult and accuse others (me) who think it wise to investigate carefully the security detail surround what I believe to be the most important C14 test in history and get real facts, referring to when you said: “resorting to conspiracy theories and branding other believers as Satans… Conspiracy theories won’t get us anywhere.” “Why are you angry? May be because you have nothing to back up your claims with?” Not sure why you have to focus on accusing me of being angry. I admit, I don’t like being BS’d though and give short shrift to those who engage in it — not saying you’re doing that, but constantly accusing people of things they’re not doing really isn’t.. Cool dude. It kinda makes you look bad and discredits you. Not sure I’ll respond to you if you keep doing it. Also, exactly what claims am I making without back up?? Please back this accusation up. ““Quoting the bible to such wont make much difference” …..Neither to you my friend, so I won’t even bother.” And can you provide some proof for your opinion as I did mine, friend? It’s duly noted how you responded to my request to not accuse me with many more accusations. I’m beginning to think you really like the Accuser title, like a son proudly bearing the family mark of his father perhaps..","date":"2014-03-11","mins":"3:14 am","url":"https://shroudstory.com/2014/03/08/stephen-jones-persists-with-the-hacker-theory/","cat":"other_blogs","title":"Stephen Jones Persists with the Hacker Theory"},{"id":"comment-15338","author":"egm","post":"The Peshitta is the Aramaic bible and it includes the OT and NT. It’s popular dogma among Westerners to say it’s based on Greek manuscripts, but the Church of the East has always maintained it comes directly from the apostles in their original language, and they have been rooted in the region where the disciples were first called “Christians” and Thaddeus met King Abgar. I’m not an expert, but there are compelling arguments internal to the texts favoring Aramaic primacy (such as Hebraisms that are lost in translation), at least for the majority of the books (I don’t believe Luke originally wrote the gospel and Acts in Aramaic to Theophilus), nevermind historical. It also beautifully resolves the longstanding problem regarding Yeshua’s genealogy that plagues the Greek Matthew which has led to every kind of tortured logic to explain by apologists (it’s never good to kick off the NT canon with a glaring mistake). Search ‘Response to anti Peshitta Primacy arguments’ for details. The manuscript tradition and integrity of the Peshitta is also superior to the problematic Greek families, something that is widely ignored among Western scholars or dismissed out or hand. Since the days of Jerome, there has been a strong bias to ‘Westernize’ the church in Europe, even to the point of rearranging the order of the NT canon thus obscuring it’s underlying symmetrical design reflecting the 7 branched menorah (see the late Ernest L. Martin’s (who did not argue for Aramaic primacy) ‘Restoring the Original Bible,’ Chapter 1, free to read online http://www.askelm.com/restoring/index.asp). The Church of the East however does not consider 2 Peter, 2 John, 3 John, Jude, and Revelation canonical as they likely were not written when the Aramaic NT was first canonized — evidence of the canonization process is in the NT itself but partially concealed by the Greek translation, go figure), which also destroys the symmetry. A blindness in part on both sides it would seem, but there you have it. Paul Younan’s website Peshitta.org is a wonderful resource with interlinear translations, articles, and forums for more info..","date":"2012-08-21","mins":"10:09 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"},{"id":"comment-15380","author":"egm","post":"I have serious reservations about relying on Wikipedia particularly on controversial subjects (I’ll spare you the personal confrontations with some “admins” there)! Like I indicated, there are rampant biases in this area and it’s easy to pick up on them, but if you persevere and do serious studies with an open mind you’ll find they don’t really hold water. You could liken it to how biased the mainstream media and academic “authorities” are on (mis)reporting the facts on the Shroud with appeals to popular ignorance and oceans of disinformation to wade through. This isn’t the place to address all your misgivings, that’s why I gave out Younan’s website for those who want to investigate deeper and find answers to these things. Martin left the Church of God several decades before his death as he grew in faith and knowledge. His research stands up on it’s own as it’s documented to the hilt vis a vis Western biases reflected in the theology/bible of the West. I don’t agree with Barrie Schwortz’s views regarding Christ, yet I’m able to objectively value in his research on the Shroud of Christ because it stands up on its own..","date":"2012-08-22","mins":"1:07 pm","url":"https://shroudstory.com/2012/08/21/another-review-of-thomas-de-wesselows-the-sign/","cat":"books","title":"Another Review of Thomas de Wesselow’s “The Sign”"}]
