[{"id":"comment-36844","author":"egm","post":"Daveb of wellington nz : The Greeks picked up the Hebrew habit of gematria (Gk “esopsephia”) during New Testament times (e.g. Rev use of the numer 666 for antichrist). Just as a side note, the OT adds clarity to the interpretation of the 666 reference in Rev 13 in the book of Ezra. There we see the use of the ‘number of men’ phrase referring to the number of children called by a family name in the census taken of those coming out of Babylon to rebuild Jerusalem: “the *number of the men* of the people of Israel” Ezra 2.2. The skip some short verses down and we read: “The children of Adonikam, six hundred sixty and six (666)” Ezra 2.13. Adonikam = “my lord arose,” of the tribe of Dan from my research. The bit about causing all to receive a mark (name) in the forehead or right hand is a pledge of loyalty to a global political super star (antichrist), a sort of spiritual marriage between the beast and whore of Babylon as a name is traditionally taken in marriage by the wife, and in Hebrew understanding name (shem) = essence; shem is the root of neshama (soul), and what it the essence of a man but his soul?: “upon her forehead a name is written, Mystery, Babylon the Great, Mother of Harlots, Abomination of the Earth” vs the marriage of the Lamb to the faithful bride, New Jerusalem, the number of his name, 144,000 “having his Father’s name written in their foreheads” Rev14.1, cf Eze 9.4. The High Priest, foreshadowing Yeshua as Melchizedek, had the Name fixed on his forehead, Exo 28.36 8. Just as the registration/enrollment (not a tax as widely assumed; compare Luke 2.1 with Heb 12.23, same roots in Aramaic and Greek) decreed by Augustus Caesar as Pontifex Maximus would’ve included a pledge of loyalty soon before Christ came the first time around it will be with the second. The Roman elite, like the Jews and Samaritans, were aware of the Babylonian prophecies/Jewish oracles (ie, the head magi Daniel’s, Isaiah’s, even Balaam’s star prophecy, etc) of a world leader — the Seed of the Woman (cf Spica/Zera in Virgo/Bethulah) — who was to come on the scene in their time. The Roman ruling elite however hijacked the prophecies and applied them to Caesar to usher in a Golden Age, novus ordo seclorum if you like (see Virgil’s commissioned work, Eclogues IV, circa 37 BCE). Some of Nero’s astrologers were even convinced he was to rule from Jerusalem. Basically the Roman puppet Herod was following a legal precedence causing him to eliminate any competition to the fulfillment of this prophecy outside the line of Caesar which is why the good news from the Magi of the signal of the King’s (Melech’s) star (Zedek=”Righteousness”/Jupiter) was considered bad news: “When Herod the king heard this, he was troubled, and all Jerusalem with him” Matt 2.3. His second coming will be bad news to the world political power structure again which still seeks to bump him from his rightful place on the throne as king of kings and rob him of his glory — quite literally as in the cause of the shroud image you might say. But anyways.. How ’bout those poker holes!.","date":"2013-06-13","mins":"6:02 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?"}]
