[{"id":"comment-3807","author":"timothy_p_p_roberts","post":"Let’s agree: If the Shroud of Turin never existed the vast majority of the readers of this blog would still believe that a first century Nazarene named Jesus was Christ – the messiah. The existence or non existence of relics imparts no influence on the fundamental foundation of Christianity – namely “faith” in the premise of a messiah. Therefore, the scientific principle of observation, hypothesis, and testing toward repeatable results simply has no place in this blog. The premise that Jesus of Nazareth was the messiah is untestable. The premise that Jesus rose from the dead is untestable. The premise that Jesus did is untestable. The messiah’s existence is purely a function of faith. Only YOU know the depth of your beliefs and the best examinations of OTHER people cannot prove whether YOU believe in a god. Your faith has no manifestation that produces repeatable results in the physical realm…and shouldn’t. Some friends recently asked me to explain String Theory – the model used to explain many of the behaviors presented in the science of phenomenology and partical physics. After a short discussion one of the listeners interrupted me to say they had seen an episode of “Nova” that made String Theory seem very different from my perspective. I pointed out that “Nova” is designed to entertian the laymen and anyone who knows anything about any topic will always see the flaws in newspapers articles on that topic. Entertainment and scientific rigor are orthogonal in their goals. I suggested that two hours of entertaining public televison was not enough training to truly grasp the details and problems in String Theory – a topic is so obtuse that I can count on two hands the number of people for which it is understandable. None of them would claim String Theory is intuitive. The above tale is a long path to this statement: I have never read anything like this blog. It is very entertaining. Unfortunately, that which entertains me is the consistent misrepresentation of peer reviewed scientific publications. I give credit to Dan Porter for being driven and faithful to his search for a relic which proves the existence of the Christ. But I know bad science when I smell it and this place fairly reeks. The scientific principle is best guided by one goal: Do not strive to win the argument through rhetoric – work to bury one question in a mountain of irrefutable results. A pile of unrelated tidbits proves nothing but may have the appearence of winning the rhetorical argument. You have faith in Jesus. Leave it there. Why soil your very real and personal faith with an unprovable premise that the shroud represents Jesus’s image? Even If you were able to scientifically prove to me that this artifact was made Easter day I would still argue that it was more likely to belong to someone long forgotten who died the same day..","date":"2011-09-08","mins":"2:23 am","url":"https://shroudstory.com/2011/09/06/mixing-up-faith-and-science-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Mixing Up Faith and Science on the Carbon Dating of the Shroud of Turin"}]
