[{"id":"comment-19055","author":"domenico","post":"Mr Freeman you write in one of your articles that AB ” is the newest blood group in evolutionary terms and results from the mingling of Caucasian blood group A and Mongoloid blood group B. At first such a mutation would have been very rare and is virtually unknown before AD 900″. As you are an historian and not an expert scientist anthropologist or evolutionary biologist, could you give me your source for this statements? where have you read that there was a ‘mutation’ around AD 900 and that AB group resulted from the mingling of Caucasian and Mongoloid?.","date":"2012-11-15","mins":"4:51 am","url":"https://shroudstory.com/2012/11/14/early-evidence-of-ab-blood/","cat":"blood_studies","title":"Early Evidence of AB Blood"},{"author":"domenico","post":"As often D'Adamo's theory is quoted in order to criticize the authenticity of the Shroud (if AB blood is recent the Shroud or the blood can not be 2000 years old)I would point out that Dr. D'Adamo is not a scientist. Dr. D'Adamo has no scientific publications and his theory about recent AB blood is published in a diet book!Prof. Gregory Thiemann from York University published an article criticizing this theory.\"Evolution, blood types, and weight loss: A critical examination of a popular diet\", Proceedings of the Nova Scotian Institute of Science 43.\"While it seems odd that Type AB didn't emerge until very recently despite the coexistence of Types A and B for at least 10000 years, D'Adamo & Whitney base their timelime on the fact that \"prehistoric graves in Hungary show a distint lack of this blood groop\".It would be interesting to know precisely how many graves were examinated considering that blood group AB is quite rare in the modern human population\". (p.61)\"the various blood types therefore evolved before humans, chimpes or gorillas\".. \"It is clear that blood groups pre date the exsistence of Homo spp.\" (p.63)http://fatlab.biology.dal.ca/docs/data/thiemann NSIS 2005.pdf.","date":"2011-08-02","mins":"3:08 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"}]
