[{"id":"comment-4552","author":"domenico","post":"Well, contrary to those who are writing these comments, Giulio Fanti has personally examined many fibers and threads coming from the TS. He Also Studied fibers from C14 area in proximity of the “reserve” sample. Do not you think that if he had found something to support Rogers or Benford Marino’s theory he would be the first to be happy?.","date":"2011-11-04","mins":"6:41 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-2266","author":"domenico","post":"The handwriting is by Dr.Colntet who corrected the data given by Donahue. At the top of the letter I can guess to read: “Claude a M.. Le total de 52.36 etait faux; c’est moi qui à rectifiè sur cette copie; j’ai d’autres lettres manuscrites de Donahue. Amitiès, Claude” “Claude to M. The total of 52.36 was false: I made the changes on this copy; I have other handwritten letters from Donahue”. The change was 14.27 to 14.72 according with Dr. Van Haelst’s paper and Prof. Jull’s letter to Prof. Fanti..","date":"2011-01-23","mins":"9:32 am","url":"https://shroudstory.com/2011/01/23/arizona-radiocarbon-dating-samples-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Arizona Radiocarbon Dating Samples of the Shroud of Turin"},{"id":"comment-2155","author":"domenico","post":"I know that the two sides of the Shroud are very different; unfortunatly I can not find a close up photo of the backside from another source. A question for Jull: how could his laboratory preserve a piece of the Shroud if they did not know wich sample was the original Shroud?.","date":"2011-01-07","mins":"8:09 am","url":"https://shroudstory.com/2011/01/06/is-this-the-other-side-of-the-same-fragment/","cat":"carbon_14_dating","title":"Is this the other side of the same fragment?"},{"id":"comment-2165","author":"domenico","post":"The image from Zurich sample is very interesting: it shows the differences between the two sides of the Shroud (Z1.1.1 is from the top, the others photos seems from the backside). The photo shows also a reweaving. Halfsample Z1.1 (25.9 mg.) was divided in three subsamples (4.8+7.2+11.2): is there something wrong? are 2.7 mg missing?.","date":"2011-01-08","mins":"8:48 am","url":"https://shroudstory.com/2011/01/06/is-this-the-other-side-of-the-same-fragment/","cat":"carbon_14_dating","title":"Is this the other side of the same fragment?"},{"id":"comment-2166","author":"domenico","post":"We know that Zurich laboratory made 5 datations; in the photo we see three subsamples; where are from the other two subsamples dated? Have they divided Z1.2 in two? but a ca. 13 mg. Sample is a waste of material if they have dated a 4.8 mg sample. So it’s very likely that also Zurich laboratory retained a Shroud sample..","date":"2011-01-08","mins":"9:06 am","url":"https://shroudstory.com/2011/01/06/is-this-the-other-side-of-the-same-fragment/","cat":"carbon_14_dating","title":"Is this the other side of the same fragment?"},{"id":"comment-2179","author":"domenico","post":"According to Dr. Remi Van Haelst in the Arizona laboratory: “The sample was cut in four pieces, who were weighted after chemical cleaning, by Dr. Toolin : 13.86, 12.39, 11.83 and 14.72. Mg”. Http://www.shroud.com/vanhels5.pdf Who gave this information to Dr. Van Haelst? I think that an information so precise could came only from the laboratory itself. But is the 12.39 mg. Sample weighed by Toolin the same that now Jull have analyzed (Jull’s sample has the same weight)? This is very important because this information says us that this sample was chemical cleaned! In the Tucson laboratory there is much confusion..","date":"2011-01-10","mins":"5:16 am","url":"https://shroudstory.com/2011/01/06/is-this-the-other-side-of-the-same-fragment/","cat":"carbon_14_dating","title":"Is this the other side of the same fragment?"},{"id":"comment-2263","author":"domenico","post":"Look at this technical book about French reweaving : http://shrouduniversity.com/frenchreweavinginstructionbook.pdf.","date":"2011-01-23","mins":"6:30 am","url":"https://shroudstory.com/2011/01/21/link-to-tyrers-significant-paper/","cat":"carbon_14_dating","title":"Link to Tyrer’s Significant Paper"},{"id":"comment-2264","author":"domenico","post":"Arizona laboratory had four pieces wich weighed: 12.39, 14.72, 11.83 and 13.86. Let’s remember that Donahue writing to Fr. Bonnet Eymard gave the weight of 14.27 instead of 14.72. Http://www.crc internet.org/shroud3.htm This is important because it shows that the weights provided by Prof. Van Haelst on page 5 of the paper “RADIOCARBON DATING THE SHROUD OF TURIN THE NATURE REPORT” (http://www.shroud.com/vanhels5.pdf) were the right ones and they came directly from the Laboratory.. But Prof. Van Haelst writes also that those weights were taken after the cleaning procedure by Dr. Toolin. Is this information also from the Laboratory? is it correct? or this is one of the many inaccuracies given by the Laboratory?.","date":"2011-01-23","mins":"7:33 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","title":"Mark Oxley’s Paper is a Must Read"},{"id":"comment-2008","author":"domenico","post":"According to the Nature’s article: “All laboratories examined the textile samples microscopically to identify and REMOVE any foreign material….. AFTER these initial cleaning procedures, each laboratory split the samples for further treatment. The Arizona group split each sample into four subsamples…”. Jull in his recent paper states that he found cotton fibers in his sample. But that’s impossible if Nature tell us the truth! from Nature’s: “The Arizona group split each sample into four subsamples. One pair of subsamples from each textile was treated with dilute HCL, dilute Na OH and again in acid, with rinsing in between (method a). The second pair of subsamples was treated with a commercial detergent (1.5% SDS), distilled water, 0.1% HCL and another detergent (1.5% triton X 100)…”. Again: How could prof. Jull have found in his sample wax, spores, iron oxide if the 4 subsamples were treated?.","date":"2010-12-24","mins":"9:30 am","url":"https://shroudstory.com/2010/12/24/more-about-julls-paper-in-radiocarbon-journal/","cat":"carbon_14_dating","title":"More About Jull’s Paper in Radiocarbon Journal"},{"id":"comment-2028","author":"domenico","post":"Ann Hedlund, the textile expert consulted by Jull, established that the warp fabric count is 30 yarns per cm (76 per inch) and the weft is 40 yarns per cm (102 inch). That is very strange since other experts counted differently: Timossi: warp/40 weft/27 Raes: warp/38,6 weft/25,7 Vial: Warp/37,6 weft/25,8 Vercelli: warp/36 weft/24 Hedlund/Jull: warp/30 weft/40.","date":"2010-12-27","mins":"7:47 am","url":"https://shroudstory.com/2010/12/24/more-about-julls-paper-in-radiocarbon-journal/","cat":"carbon_14_dating","title":"More About Jull’s Paper in Radiocarbon Journal"},{"id":"comment-2251","author":"domenico","post":"It’s amusing to recall that Jull writes in his recent paper: “an excellent objective technical description of the shroud, its possible origins and weaving technologies, is given by Tyrer (1981).”.","date":"2011-01-20","mins":"12:06 pm","url":"https://shroudstory.com/2011/01/20/more-stll-on-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"More Still on Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-2252","author":"domenico","post":"The link for Tyrer’s article: http://www.sindone.info/TYRER1.PDF.","date":"2011-01-20","mins":"12:14 pm","url":"https://shroudstory.com/2011/01/20/more-stll-on-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"More Still on Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-2064","author":"domenico","post":"It’s a bit unbelievable that Jull and Freer Waters are working on this small sample since the 2008 (http://uanews.org/node/22384) and after two years have produced a paper so poor: only microscopical analysis at max 320x (Rogers observations were at max 800x); no chemical analysis (Rogers made many chemical analysis); fiber unidentified! and they can not tel us if the cotton is on or in the threads!.","date":"2011-01-01","mins":"8:57 am","url":"https://shroudstory.com/2011/01/01/the-danger-in-abstracts-of-scientific-papers/","cat":"carbon_14_dating","title":"The Danger in Abstracts of Scientific Papers"},{"id":"comment-2449","author":"domenico","post":"Raes examined the so called “Raes Corner”; as the name suggests it’s a piece of textile even more external that this of the carbon dating; So when Raes writes “main cloth” he means the border, an area that could have easily been manipulated. Only in this area we have a verified presence of cotton inside the linen threads. Http://www.ohioshroudconference.com/a17.htm Rogers writes: “Cotton fibers are easy to find mixed intimately with the linen fibers of Part I Raes threads….I do not attempt to make a quantitative cotton comparison between Raes and radiocarbon threads and Shroud tapes, because there was too little cotton of any kind on Shroud samples. We had been puzzled by the Raes report at the time of the 1978 STURP observations in Turin. We could not find more than traces of cotton on the Shroud. The cloth appeared to be pure linen.” (Rogers, “A Chemist’s Perspective On The Shroud of Turin”, p.66).","date":"2011-02-12","mins":"2:41 am","url":"https://shroudstory.com/2011/02/11/the-question-of-cotton-in-the-shroud-of-turins-yarn/","cat":"carbon_14_dating","title":"The Question of Cotton in the Shroud of Turin’s Yarn"},{"id":"comment-2141","author":"domenico","post":"1) I think this is the reverse of the sample. 2) We know that also Zurich laboratory preserved a piece of the sample. 3) I would remember a previous observation I made about Jull’s sample: Ann Hedlund, the textile expert, established that the warp fabric count is 30 yarns per cm and the weft is 40 yarns per cm. But other experts who studied the textile of the Shroud counted differently: Timossi: warp/40 weft/27 Raes: warp/38,6 weft/25,7 Vial: Warp/37,6 weft/25,8 Vercelli: warp/36 weft/24 Hedlund/Jull: warp/30 weft/40 Vercelli’s count is very important because was made on a c14 sample..","date":"2011-01-06","mins":"6:48 am","url":"https://shroudstory.com/2011/01/05/was-the-sample-used-in-the-jull-paper-not-from-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Was the sample used in the Jull paper NOT from the Shroud of Turin?"},{"id":"comment-2154","author":"domenico","post":"A moment: the threads count was made by Freer Waters or by textile expert Ann Edlund? or by both? Gian Marco Rinaldi is a mathematician but he seems to know the textile topic better. Anyway: and the peer review process?.","date":"2011-01-07","mins":"7:54 am","url":"https://shroudstory.com/2011/01/06/what-is-going-on-at-the-ams-laboratory-at-the-university-of-arizona/","cat":"carbon_14_dating","title":"What is going on at the AMS Laboratory at the University of Arizona?"}]
