[{"id":"comment-12996","author":"domenico","post":"And what is Freeman’s interpretation or explanation of ‘tetradiplon’?.","date":"2012-06-25","mins":"3:11 am","url":"https://shroudstory.com/2012/06/23/davor-aslanovski-on-the-edessa-image-and-the-shroud-of-turin/","cat":"history","title":"Davor Aslanovski on the Edessa Image and the Shroud of Turin"},{"id":"comment-2415","author":"domenico","post":"And do not forget: 1) Jesus’burial was not a completed burial; 2) it was the burial of a man who died violently and was covered with blood. I quote from Ian Wilson: “As any true expert in Jewish burial tradition will point out, the particular deceased person whom we see on the Shroud will have needed some very different funerary arrangments, because he self evidently died a violent death – i.e. Crucifixion – during wich his body became extensively stained with his life blood. […] As explained by Victor Tunkel [Faculty of Laws, Queen Mary College, University of London], in the case of a heavily bloodstained corpse the ritual required as much avoidance as possible of any disturbing of the blood… The sovev [the shroud/sheet] therefore had to be an all enveloping cloth that is a single sheet used to go right round the entire body.” (Ian Wilson, The Blood and the Shroud, p. 64 65) Archaeologically speacking, we don’t have any incomplet first burial or a first burial of a man violently deceased..","date":"2011-02-08","mins":"3:47 am","url":"https://shroudstory.com/2011/02/07/paper-chase-a-clean-cloth-by-diana-fulbright/","cat":"history","title":"Paper Chase: A Clean Cloth by Diana Fulbright"},{"id":"comment-2230","author":"domenico","post":"Who is interested can find the article about the radiocarbon dating at this link (p.303): http://onlinelibrary.wiley.com/doi/10.1111/j.1475 4754.1987.tb00421.x/pdf.","date":"2011-01-18","mins":"10:03 am","url":"https://shroudstory.com/2011/01/18/templecombe-and-the-shroud-of-turin-continued/","cat":"history","title":"Templecombe and the Shroud of Turin (Continued)"}]
