[{"id":"comment-2050","author":"domenico","post":"I would point out that the threads of the sample from the C14 area were given to Rogers by prof. Gonella (the Archbishop of Turin’s scientific adviser); Gonella died in 2007, two years after Rogers’ paper, and he has never denied the Rogers’ version: Gonella excised the threads from the centre of the radiocarbon sample A. For Episcopalian: please note that Jull in his paper writes “radiocarbon samples” in inverted commas; Nickell in the article linked by william does the same: coincidence?.","date":"2010-12-31","mins":"6:06 am","url":"https://shroudstory.com/2010/12/30/outstanding-response-to-recent-carbon-dating-paper/","cat":"books","title":"Outstanding Response to Recent Carbon Dating Paper"},{"id":"comment-3440","author":"domenico","post":"Nickell is a real hypocrite. Frei “made a fool of himself authenticating the notorious Hitler Diaries.”? Nickell never remember when speaks or writes about the Shroud that to authenticate the diaries was also Ordway Hilton who was according NYT “One of the nation’s foremost authorities on detecting forged documents”. Http://www.nytimes.com/1998/05/10/us/ordway hilton 84 authority who detected forged papers.htmll Let’s read as NYT justify Hilton’s mistake: “Given what he was told were photostatic copies of pages from the diaries and examples of Hitler’s writing, Mr. Hilton said that both sets of documents had been produced by the same hand. Indeed, they had, though the common hand turned out not to have been Hitler’s but the forger’s.”. It is evident that the same justification should be given to Frei if someone is honest! But there is other. Nickell is very very hypocrite because in his book “Detecting forgery: forensic investigation of documents” writes; “in 1983 three examiners declared the diaries genuine. Unforunatley they had allowed Stern magazine, who commissioned them, to supply the alleged standards; it turned out that some of those were also Kujau forgeries”. So Nickell knows the thruth but when he needs to attack Max Frei forget it! And Ordway Hilton is one of the handwriting expert most quoted in Nickell’s books about forensic science!.","date":"2011-07-27","mins":"3:41 am","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."}]
