[{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"So what percentage of the total of the radiocarbon samples did Rogers believe to be cotton and is there any independent support for whatever figure he came up with?\n\n","date":"August 7, 2014 at 2:24 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142834","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"what importance ?\nwho said reweaving was done exclusively with cotton ?\n\n","date":"August 7, 2014 at 2:41 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142836","author":"anoxie","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"No one is saying that but was reweaving done in both linen AND cotton?\n\n","date":"August 7, 2014 at 2:49 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142837","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"It’s an option.\n\n","date":"August 7, 2014 at 2:52 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142839","author":"anoxie","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"I am just looking for clarification of what the argument is. Why deliberately use cotton as only part of a reweave  ?\n\n","date":"August 7, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142855","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Anoxie: “who said reweaving was done exclusively with cotton ?”\nCharles: “No one is saying that but was reweaving done in both linen AND cotton?”\nYes Charles.\nWhat is your problem ? I do not understand.\n\n","date":"August 7, 2014 at 4:59 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142856","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Thibault. Please give me your estimate of the proportion of the total sample submitted to the labs that was cotton. Your own estimates suggest it was very small and not enough to sway the date significantly.\nBut if there was also linen in the reweave, then why did there need to be cotton as well?\nI have never bought the Rogers thesis because it does not make sense to me but perhaps you can enlighten me.\nSo that is my problem and any clear answers would be much appreciated!\n\n","date":"August 7, 2014 at 5:41 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142860","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Charles, it is my understanding that cotton was interwoven with the linen because it accepts the dyes more readily than linen, which needs to first be treated with a mordant (made of aluminum hydroxide I believe).\n\n","date":"August 7, 2014 at 10:34 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142894","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Barrie, thanks. You are certainly right that they did interweave the two – Mazzaoui has a section on this- so you just need to confirm that this is true of the Shroud in the samples dated.\n\n","date":"August 8, 2014 at 1:15 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142920","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Villarreal: See: http://www.ohioshroudconference.com/\n\n","date":"August 8, 2014 at 2:57 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142930","author":"David Mo","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"The problem is that no one has yet found that cotton THREAD was interwoven with linen in the specific samples used by the radiocarbon labs. I have not seen as yet a piece of weave from the Shroud with the cotton threads shown interwoven with the linen. What Raes found was cotton fibres that he though had drifted in from a previous weave.\n\n","date":"August 8, 2014 at 3:52 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142935","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"So we send Moulherat (and at least two other ancient textile experts) to Turin with a microscope. They know what to look for. Non intrusive/destructive procedure. Could be done in an afternoon. (sigh)\n\n","date":"August 7, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142847","author":"David Goulet","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Why the need to test warp and weft threads separately? The last time I looked, fabric was an obligatory mix of the two.\nIf anything should be tested separately, it should be image-bearing regions. That way, the “invisible reweave” card cannot be played a second time.\nWhere to harvest image-bearing regions? Time as I say to grasp the nettle. The TS does not belong 100% to either religion or science, not does it belong 0% to either. So why not a 50/50 split? Turin can keep the more photogenic half.\n\n","date":"August 7, 2014 at 4:23 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142851","author":"Colin Berry","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Why don’t we just cast lots for it? Let’s go all in on the symbolism.\n\n","date":"August 7, 2014 at 5:01 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142857","author":"David Goulet","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"The only kind of symbolism I can see at the moment is that which would have  the “poor, the sick, the disabled etc etc” flocking to Turn for the 2015 exposition where an image and blood on linen will be  identified with that of a particular victim of Roman crucifixion.  That’s despite Turin and the Vatican having commissioned a radiocarbon dating and having failed to obtain the hoped- for answer. Yet we now learn that Turin is working to recruit some 4000 purple-shirt volunteers for yet another of its medieval circuses based entirely on the Shroud and its assumed authenticity.\nYes, 1300 have signed up, and 3 times that figure is hoped for (see recent posting this site). Why so many you may ask? Check the Turin site and click on the tabs for earlier  expositions, notably 2010, and there you will find the deployment of hundreds of volunteer doctors, nurses, ambulances etc etc. \nhttp://www.sindone.org/the_holy_shroud__english_/news_and_info/00045909_Message_from_the_Custodian_of_the_Shroud.html\nTurin presumably intends to become, yet again,  a rival to Lourdes on the strength of its “holy Linen” which folk will come and “worship” (its words, not mine) and no doubt we’ll be reading of miracle cures.\nI say it’s better to divide the TS in two right now and complete the authenticity-testing by whatever means are necessary, which regrettably will be destructive in most cases, than witness yet again this abomination of  Roman Catholicism treating science findings like a smorgasbord, picking out the comfort foods they like that can be cited in support of authenticity, while vehemently rejecting the ones they don’t. It’s time the Shroud custodians were made to cease this cynical mixing and matching of science and pseudoscience.\n\n","date":"August 7, 2014 at 6:23 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142865","author":"Colin Berry","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"I, again, agree with your sentiment. I’d love for Turin to allow a STURP 2.0. As I’ve read on this site a new direct examination would go a long way toward answering many of the questions that have arisen since Sturp 1.0  With the right experts, advanced instrumentation and protocols a non-destructive examination may find the smoking gun both sides of the debate are looking for. There is no need to rip the icon in half — unless in so doing we can end world hunger and create lasting peace. Then count me in.\n\n","date":"August 8, 2014 at 9:36 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142967","author":"David Goulet","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Thanks Dan\nMore tomorrow.\n\n","date":"August 7, 2014 at 4:52 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142854","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"“G. Vial and F. Testore are/were beyond any doubt competent textile experts but the conditions of the C14 sampling were far from those necessary to detect a repair.” (Heimburger).\nNote that Vial, Testore and Flury-Lemberg used microscopical equipments.\n\n","date":"August 8, 2014 at 3:03 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142931","author":"David Mo","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"The cotton question is a bit of a stumbling block. I do not think it is clear whether the main shroud contains flecks of cotton or not, and it is certainly not clear whether any confidence can be placed in the “cotton enrichment” hypotheses, when those who have studied threads microscopically have come up with so many different conclusions. If the the shroud is substantially 1st century with medieval interpolations, were those interpolations a) all cotton (Villarreal), b) a deliberate 20/80 mixture of cotton and linen, c) linen, but with a few cotton flecks from the spinning  or weaving room blended in fortuitously, d) some other suggestion. None of the Rogers/Heimburger/Fanti school of thought seem in agreement about this,\n\n","date":"August 8, 2014 at 5:21 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142945","author":"Hugh Farey","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"It might be not so surprising that there is a variety of interpretations on the question of cotton.  It may even be that repairs were carried out in different parts of the cloth, by different persons and at different times.  \nThe 2005 Benford-Marino paper may illuminate this.  The authors mention their interview with Mr Michael Ehrlich of the firm “Without A Trace” in Chicago.  Ehrlich confirmed that the modern time-saving method of “Inweaving” would be invisible from the front, but easily recognisable from the back as claimed by Flury-Lemburg.  This seems to be the reason why she dismissed the possibility of “Invisible weaving”.  Frau F-L is one of the few persons who have inspected the back of the cloth, and of course there is no sign of the “Inweaving” which she would assert would be visible there.  This would seem to be the principle reason why she is so frequently quoted as claiming that there is no invisible weaving. \nThe B-M paper continues:  “However, the technique used in 16th Century Europe, called “French Weaving,” is an altogether different technique from Inweaving.”  It results in both front and back side “invisibility.” but nowadays is only done on small-scale repairs because of time and cost.  “According to Mr. Ehrlich, French Weaving involves a tedious thread-by -thread restoration that is undetectable.”  The paper gives arguments why it seems very likely that French Weaving was the method used.  \nBut that is not all!  The authors provide a reference by Professor Piero Savarino, later scientific advisor to Cardinal Poletto:  In his 1998 booklet, he stated that the 1988 C-14 testing might have been erroneous due to “extraneous thread left over from ‘invisible mending’ routinely carried out in the past on parts of the cloth in poor repair”.  Thus it seems likely that “invisible mending” was regarded as maintenance work routinely carried out!  Hence this raises the likelihood that there are other parts of the cloth which may well have cotton contamination, along with the mordants, dyes and other substances used in such work.  In other words, just not the area from the Raes sample.    \nConsidering the difficulties there have been in discerning the contamination in the Raes area, and its implications for the 1988  testing, this raises the possibility that any such future testing would require intense scrutiny of the samples to ensure that they also were not from areas subject to such repairs.  This might well prove extremely difficult, as it seems to be only discernible by teasing the threads apart.  \nAs to who carried out such work Benford and Marino believe it was done under Savoy Duchess Margaret of Austria in the 16th century.  But it might well be that similar work was also carried out by Sebastian Valfre in 1694, and also by Princess Clotilde in 1868-69.  \nOther possible sources of minor cotton contamination could include loom remnants from a previous weave, apparently postulated by Raes, and also from the variety of cotton gloves used by the STURP team in 1978.  It is known that the STURP team did examine various areas of the cloth under the microscope in attempts to discern cotton, but apparently found none.  However in view of Mr Ehrlich’s comments that the work was invisible from the surface, this may not signify a great deal.  It appears necessary to tease the threads apart in order to discern it.\n\n","date":"August 8, 2014 at 7:20 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142958","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Daveb is not the first both to acknowledge Flury-Lemburg as a world expert on textiles and one of the very few people to have studied the shroud at close range intensely, and at the same time to assume that she failed to distinguish between inweaving, which a kind of patching, and French weaving, which is more like darning. Both kinds are, of course, readily visible under a microscope, as they involve the interpolated threads running alongside their original counterparts for some distance on either side of the missing section. I’ll happily agree that to the naked eye they are practically invisible, but on enlargements such as the Evans micrographs or Barrie Schwortz’s photos of the retained Tucson portion, they would be very visible. Shroud 2.0 makes an interesting study, as it shows the Shroud simply riddled with inconsistencies, which may indeed be due to repair. They are certainly not invisible, but not quite clear enough to follow with certainty.\nWithout A Trace has a prominent website and good demonstrations of the success of French weaving, but Michael Ehrlich seems unwilling to re-enter the discussion. There are a number of other websites which illustrate the technique clearly.\n\n","date":"August 8, 2014 at 10:25 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142973","author":"Hugh Farey","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Dave wrote: “As to who carried out such work Benford and Marino believe it was done under Savoy Duchess Margaret of Austria in the 16th century. But it might well be that similar work was also carried out by Sebastian Valfre in 1694, and also by Princess Clotilde in 1868-69.”\nThe true fact is Sebastian Valfré’s black silk lining was grossly executed as he was far from being an expert in sewing. The latter just could not have made invisible micro-reconstructions if any. Actually, micro-reconstructions by princess Clothilde of Savoy-Bonaparte in 1863/8 (with or without the help of the Master of upholstery in the Royal court of Savoy) are most likely.\n\n","date":"August 8, 2014 at 10:29 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-142975","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Thanks Max.  I was aware that Valfre had sewn the black silk lining, but had not looked into his abilities.  If one can take the inference from the Piero Savarino ref, and the plenitude of weavers skilled in the art who were available during the period 16th – 19th centuries, there might well be more areas of the cloth which were so repaired by various others.  \nRegarding Hugh’s comment that such repairs are readily visible under the microscope and that (weaving) inconsistencies frequently appear on the cloth, my understanding is that STURP searched for cotton in other areas by microscope, but were unable to identify any at that time.  So it seems to be yet another enigmatic aspect of the cloth.  It seems that nothing should be assumed if whenever any further samples might be taken for testing.\n\n","date":"August 8, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143012","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Charles and all, sorry for the delay.\nCharles you wrote: “Thibault. Please give me your estimate of the proportion of the total sample submitted to the labs that was cotton. Your own estimates suggest it was very small and not enough to sway the date significantly.\nBut if there was also linen in the reweave, then why did there need to be cotton as well?\nI have never bought the Rogers thesis because it does not make sense to me but perhaps you can enlighten me.\nSo that is my problem and any clear answers would be much appreciated!”\nBarrie has already answered: cotton is known to retain the dye much more than linen.\nThe presence of the dye in this area is an indisputable fact. So the presence of cotton makes sense.\nIf there is a repair, we are necessarily speaking of threads. The new pieces of threads were SPUN  with a mixture of linen and cotton so that they looked like the threads of the Shroud (thickness, Z twist etc..). The only thing the weaver could not imitate was the sepia color of the surrounding fabric. This might explain the dye and consequently the cotton.\nRegarding the proportion of “new threads” versus “old threads” I can not answer since I do not know when the repair had been performed. If, as Sue Benford (RIP) and Joe Marino suggested the repair was made during the 16th century the proportion of “new threads” is about 66%. If the repair was made in the 19th century (see Max post) the proportion of “new threads” is of course much lower.\nYou wrote: “The problem is that no one has yet found that cotton THREAD was interwoven with linen in the specific samples used by the radiocarbon labs. I have not seen as yet a piece of weave from the Shroud with the cotton threads shown interwoven with the linen. What Raes found was cotton fibres that he though had drifted in from a previous weave.”\nWhat do you mean exactly by “interwoven”?There is NO cotton THREAD either in the main part of the Shroud or in the C14/Raes area. But there are at least several threads in the C14/Raes area which have an abnormal high cotton content and the cotton fibers are also found in the CORE of those threads.\nIt means that the cotton found in those threads is likely not a contamination as described by Raes but more likely the result of a voluntary action: some of the Raes/C14 threads are “new threads” with both “new” linen and cotton fibers spun together.\nGilbert Raes found some cotton fibers in his Piece 1 (from the main part of the Shroud) but no cotton in Piece 2 (from the side strip).\nWe know that the side strip (Raes Piece 2) was woven at the same time as the main part of the Shroud and that it was actually a part of the Shroud fabric.\nMore later..\n\n","date":"August 8, 2014 at 3:56 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143010","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"As Hugh has suggested there are various possible ways of explaining the presence of cotton. However I am surprised that no one examining the actual weave has noted these mixed threads in the proportion they would need to be to sway the date.\n‘Abnormal high cotton content.’ Just how high ?\nThe problem remains of how this mix was actually made up. You suggest a cotton and linen mix which was then dyed – it would be worth experimenting to see if this worked. Not difficult as both cotton and linen are easy to come by!\nMazzaoui says that cotton and linen were never spun together in a single thread but both were woven as alternate threads in a weave.\nStill lots to sort out here.\n\n","date":"August 8, 2014 at 4:24 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143014","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Hypothesis : flax( linen) and cotton fibres were spun together to make threads that were then dyed  and made up the whole or part of a reweave of the Shroud in the sixteenth or nineteenth century. The reweave made up part of or the whole of the samples used by the laboratories in the radio carbon tests.\nAt this clarifies one explanation for the presence of cotton. What evidence is there is favour or against this hypothesis?\n\n","date":"August 9, 2014 at 3:36 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143067","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"So …\nWe have to check what was the right age about three different epochs :\n1a- 16th century (Duchess Margaret of Austria)\n1b- 1694 Sebastian Valfré\n2- 1864/68 Princess Clothild\nIs it possible to believe in a simple solution for that (little) enigma ?\nThe answer (IMO) is :\nYes for 1 and 2, because (using the adequate advanced tools\n[= with nanomechanical or/and nanochemistry controls]) we can try to test\nthese samples.\nInstead there is too little difference about 1a and 1b…\n— —\nIn any case I am curious about the results\nfrom the control on that “probable”  (= are most likely).\n“micro-reconstructions by princess Clothilde of\nSavoy-Bonaparte in 1863/8” …\n— —\nB.T.W. :\nWho was the “Master of upholstery in Royal court” ?\n(Reference : the same message by Max P.Hamon, dated\nAug 8, 20014 at 10:29)\n\n","date":"August 9, 2014 at 9:45 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143094","author":"piero","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Piero,\nFirstly, I don’t avocate a simple solution.\nOn May 20, 2014 at 1:37 pm, I wrote:\n” (Given that splicing, glueing and dying are part and parcel of invisible micro-reconstructions, in 2007), I advocate(d) a modern (not a medieval) contamination (in the 1860s CE) through spliced “reweaving thread by thread” as variant to mere Medieval French reweaving  + a first century CE contamination due to a purifying ritual (alkali solution in-soaked linen wrapping the deceased followed by ritual fumigation to dry it out).”\nAnd on May 21, 2014 at 2:39 pm I also wrote:\nRe fingers clutching the main body of the shroud  four inches away from the seam during bishops’ and canons’ displays with bare hands as the seam beaded side strip was used for a better handling of the cloth. Here is an excerpt from my 2007 paper:\n“Il faut, en effet, savoir que, lors des ostensions et afin de garantir aux observateurs présents la vision la plus parfaite et la plus logique de la double empreinte du Crucifié, la relique était déployée entièrement à l’horizontale. Une bande de couture bourrelée courant sur toute sa longueur avait été confectionnée permettant une meilleure préhension du drap. L’échantillon parent, extrait d’un seul tenant entre 8 à 10 cm du bord supérieur du coin gauche et le long de la couture de repli du tissu sur lui-même, se superposait donc presque parfaitement à la zone où – depuis au moins le XIVe siècle et jusqu’au XIXe siècle – la grande étoffe de lin avait été tenue en tenaille entre le creux de la paume et trois ou quatre des doigts de la main droite de plusieurs générations de dignitaires ecclésiastiques officiant à mains nues.\nAinsi, à cet endroit très précis du drap, la toile, tantôt soumise à de fortes tensions, a des replis et à des pressions répétées d’extrémités onglées plus ou moins coupantes, tantôt exposée aux griffures du chaton des bagues d’évêques et d’archevêques, avait-elle fini, un jour, par être abrasée, accrochée, cisaillée et/ou trouée et faire l’objet d’une (voire même de plus d’une) micro-reconstruction(s) fil à fil invisible(s) à l’œil nu hors examen ad hoc.”\nIn other words, one shall take into account the impact of repeated fingernail (whether sharp or not) pressures on the sharply bent linen outermost edge through at least one hundred public private & expositions of the Lirey-Nice-Chambery-Turin Shroud from 1355 to the 1860s, which is a fair estimate.\nSecondly and historically speaking (prior to the official radiocarbon dating), we only know for sure four Clare nuns (in 1534), Sebastian Valfré (in 1694) and Clothilde of Savoy-Bonaparte (in the 1860s) did intervene on the Shroud. \nNow as a reminder, according to King Umberto II, “(…) at ONE POINT IN THE PAST (uppercases mine), the edges of the Lenzuoli (Sheet) had become so tattered as to cause embarrassment or criticism of the Custodians (most likely in the XIXth c. CE i.e. after at least one hundred bare-handed expositions; comment mine), and those areas were repaired and rewoven using identical techniques, but obviously with similar, yet newer, materials containing dyes and other medieval manufacturing ingredients, in an attempt to better blend the new sections in, as best possible, with the original fabric.”\nRe the TWO different types of micro-reconstructions that could mainly account for the linen to appear medieval, on June 22, 2013 at 5:00 pm I posted an excerpt from my 2007 paper on the TS 1988 C14 dating fiasco (in French):\n“Non-détection d’une zone (sinon deux) ayant subi des réparations invisibles à l’œil nu :\nTout cet ensemble d’éléments directs et indirects constitue un faisceau d’indices concordants : il tend à témoigner, dans ladite zone plus raide et plus sombre, d’une intervention selon une technique bien particulière inspirée de la technique du « retissage à la française » (bien connue des maîtres-tapissiers ainsi que des experts en histoire de la tapisserie) ; technique qu’il ne faut cependant pas confondre avec celle d’un simple « entissage » d’un patch médiéval, repérable, quant à lui, à l’œil nu et à la lumière naturelle du jour par un spécialiste.\nLa technique dont il s’agit ici s’avère plus précisément celle d’un « retissage par épissures », sans coutures ni nœuds, effectuée, semble-t-il, sous un éclairage rasant et sous une loupe à fort grossissement. Elle demande beaucoup de patience et une grande dextérité des doigts. Elle consiste à mettre, tout d’abord, en place les fondations de base et la chaîne. Pour ce faire, soit le tisserand commence par identifier la matière des fibres constituant les fils de chaîne puis se les procure soit il utilise systématiquement des fibres de coton. Ensuite ces fibres sont filées afin d’obtenir l’épaisseur des fils originels puis entortillées avec précaution sur elles-mêmes et sur place aux fibres des fils de chaîne extraites de la partie cachée du tissu à réparer. Des fils de remplacement de la trame sont alors placés par-dessus et par-dessous les fils de chaîne reconstitués puis les fibres sont entortillées sur elles-mêmes, là encore avec précaution, aux fibres des fils de trame originels de façon à reproduire très exactement la texture ou le motif du tissu et refermer ainsi, sans faire de nœuds, le trou ou la zone sévèrement cisaillée.\nPour finir de rendre cette restauration fil à fil tout à fait invisible et consolider les épissures, une teinture à base de gomme résineuse est appliquée localement sur la trame ainsi reconstruite pour que celle-ci, d’où provient l’effet de texture ou de motif, se fonde dans l’original (en l’occurrence la toile jaunie par la patine ivoire des siècles). Cette intervention sous un éclairage rasant et sous une loupe, si elle est bien réalisée et bien dissimulée, peut réellement être invisible sur les deux faces d’une pièce d’étoffe au point d’échapper parfois même à la main et à l’œil exercés d’une personne du métier qui, à l’œil nu et sous une lumière inadéquate, a tendance à confondre ces reconstructions avec des irrégularités apparues au cours du tissage. De fait, la structure artisanale du lin originel du Linceul, son calibre assez fort ainsi que son tissage serré en chevron sont de nature à parfaitement intégrer ce type d’intervention.\nQuant à l’échantillon de Zurich (et partant « l’échantillon 1 d’Arizona ») tiré de la partie claire de la bande C14 officielle du Linceul, celui-ci bien que ne présentant apparemment pas ou très peu de trace de contamination par une quelconque teinture14, n’en devait pas moins être recouvert d’une patine de microorganismes. De par l’aspect anormale de la zone où il fut prélevé, il suggère fortement, en tout cas, un second type d’intervention indétectable à l’œil nu car effectuée, elle aussi semble-t-il, sous un éclairage rasant et sous une loupe à fort grossissement : « un raccommodage à perte ». Cette technique consiste très précisément à insérer, entre les fils de trame et de chaîne, des fils (ici de coton) qui, à chaque fois, sont coupés à leurs deux extrémités sans faire de nœuds, les laissant ainsi littéralement se perdre dans le tissu de lin existant.\nCes deux types spécifiques d’intervention (l’une dans le sens d’un remplacement de matière carbonée, l’autre dans celui à la fois d’un remplacement et d’un léger apport) permettraient de rendre compte de la grande dispersion des résultats observée (1238-1407) sur une si petite distance (à peine quatre centimètres de tissu).\nL’enduit de gomme arabique étant soluble dans l’eau et présent dans cette zone du coin supérieur gauche, il ne pouvait avoir été appliqué sur les fils superficiels des échantillons Raës et C14 qu’après l’incendie de la Sainte Chapelle de Chambéry de 1532. La teinture l’eût-elle été avant, celle-ci n’aurait pas dissimulé l’extrémité du bord supérieur de la grande auréole dentelée car l’eau de l’incendie eût entraîné les produits de la pyrolyse locale au cœur des fils. Ce revêtement coloré ajouté tardivement explique l’absence de fluorescence aux UV observée dans cette aire particulière du drap.\nL’histoire de la conservation du Linceul après 1532 permet donc de dater, d’une manière très précise, au moins une sinon les deux interventions. Seules, en effet, les quatre sœurs clarisses, en 1534, et la princesse Clothilde de Savoie-Bonaparte, en 1863/8, qui intervinrent de façon étendue sur la relique, auraient pu effectuer ce type de réparations invisibles de mains aussi expertes. Les sœurs clarisses s’étant vues confiée la tache bien spécifique de réparer et de consolider la pièce d’étoffe endommagée lors de l’incendie de 1532, la princesse de Savoie-Bonaparte s’avère donc être, pour ces travaux délicats de restauration, la candidate la plus hautement probable (aidée ou non en cela du maître tapissier de la cour royale d’alors). Ce d’autant qu’en 1863, cela faisait déjà plus de cinq siècles qu’à chaque ostension à mains nues, la relique se retrouvait être tendue à l’horizontale.\nTout ceci explique (ou expliquerait) pourquoi, lors de la découpe de l’échantillon et faute d’un éclairage adéquat (en lumière UV ou rasante), ces deux variantes locales passèrent totalement inaperçues aux yeux des experts textiles chargés de superviser le prélèvement pour la datation officielle de 1988. Toute leur attention était alors absorbée soit par l’étude technique du drap (qu’ils voyaient pour la toute première fois) soit par la présence gênante des fils de la couture épaisse qui liaient un résidu de la partie supérieure du Linceul au tissu à découper. Ainsi en oublièrent-ils de procéder à un examen minutieux du cœur même du site textile à prélever. L’eurent-ils examiné, ils n’auraient pu manquer, en effet, d’y repérer la petite reconstruction de forme serpentine, la teinture dissimulant l’extrémité du bord supérieur de la grande auréole d’eau dentelée ainsi que le caractère plus raide et plus sombre de la zone.\nEn principe, une restauration « invisible » ne saurait échapper au compte-fil et a fortiori à la binoculaire lorsque l’œil derrière est compétent. Les photos qui montrent les Prs Francesco Testoré et Gabriel Vial († 2005) s’affairant avec divers instruments sont, cependant, on ne peu plus trompeuses en ce qu’elles laissent croire que lesdits experts étaient occupés à des vérifications préliminaires de l’intégrité de ladite zone quand, de fait, leurs vérifications ne furent pas étendues au cœur de l’échantillon mais se bornèrent à la seule lisière du drap. Ainsi croyant avoir libéré l’échantillon aux bords effilochés de tout fil étranger, laissèrent-ils à l’opérateur, Giovanni Riggi di Numana († 2008), « le soin » de réduire à une bande rectangulaire un peu plus régulière le rectangle grossier que celui-ci, à l’aide de ciseaux de chirurgien, venait d’extraire sans gants protecteurs et plus ou moins malhabilement à la pièce principale.\nDe toute évidence, ce technicien (à qui échut la responsabilité et du choix de l’emplacement et de la prise d’échantillon !) n’était pas expert textile pas plus qu’il n’était carbonologue ou bien archéologue15. Il semblait en effet ignorer à quel point, en matière de radiodatation, la haute technologie de l’Accélérateur Spectromètre de Masse (adaptée pour les mesures sur des microéchantillons) s’avère être sensible aux contaminations y compris à celle du sébum humain. Ce choix d’une zone qui avait fait l’objet, au cours des siècles, de nombreuses manipulations à mains nues lors des ostensions, était donc déjà, de ce seul point de vue, tout sauf judicieux.”\nRe Mme Metchild Flury-Lemberg’s opinion, I commented in a note:\n” 10. – Lorsque l’on sait que de petites reconstructions invisibles à l’œil nu et à la lumière naturelle du jour pouvaient se trouver très circonscrites au cœur même du site de l’échantillon carbone 14 daté, on est pour le moins étonné qu’une experte textile de la valeur de Mme Metchild Flury-Lemberg, sans même avoir jamais examiné de visu ledit cœur de l’échantillon in situ textilis ni avoir pris connaissance de la photographie précise et contrastée d’Enrié, puisse affirmer sans ambages que la texture dudit échantillon était uniforme et intacte. \nPartant du principe qu’un expert textile se devait d’être très attentif à l’origine (et à la représentativité) des fils qu’il observe, de toute évidence, il demeure difficile pour Mme Metchild Flury-Lemberg d’accepter un seul instant l’idée que des confrères aient pu, juste avant la découpe de l’échantillon brut, ne pas procéder, à l’aide de loupes, compte-fils et binoculaires, à l’examen des fils de chaîne et de trame au cœur même du site de prélèvement.”\n\n","date":"August 9, 2014 at 11:17 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143108","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"MORE ABOUT COTTON\nHere is a quote of Prof Raes written in 13/11/89\n“It is true that in my report of 1973 I mentioned that I found traces of cotton fibers only in the main body of the Shroud. I must however add that even for the main body I did not find traces of cotton in all microscopical preparations. On the other hand I had only a very small part of the strip added to the main body and I could only make a few microscopical preparations of the fibers on the strip”.  \nThis was in response to Prof. Vial suggesting at the Paris synopsis  that the cotton fiber mentioned in Raes’ report could be superficial fibers presented on the surface of the shroud and not part of the original Shourd’s yarn.  Raes insist that the cotton is not superficial and traces of the cotton was confirmed by the Oxford finding (C-14). Raes also cites that Prof Hall and I quote”found some foreign fibers in his sample identified by a laboratory was not able to identify the variety of the cotton fibers by testing the number of (reversals?) as I did in my research of 1973″. \nNot sure if this helps in your discussion, but I figured to share it anyway.\nGio\n\n","date":"August 9, 2014 at 1:30 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143119","author":"Giorgio / HSG","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Thanks Giorgio.\nSo Raes found “traces of cotton” in some threads of his piece 1 (main part of the Shroud) but no cotton in some other threads coming from the same piece 1.\nThe cotton is “not superficial” and Raes was sure that those cotton fibers were not a surface contamination but were part of the original Shroud yarns.\nThis is consistent with Rogers findings and also with my own findings (Raes#7) except for one thing: the term “traces of cotton”.\nRogers wrote (A chemist’s perspective on the Shroud of Turin, p.66): “I did not attempt to make a quantitative cotton comparison between Raes and radiocarbon threads and Shroud tapes, because there was too little cotton of any kind on Shroud samples (..) We could not find more than traces of cotton on the Shroud. The cloth appeared to be pure linen”.\nI can not add anything to my own study of Raes#7\n   http://www.shroud.com/pdfs/thibaultr7part1.pdf\nIt is clear (at least to me) that in the same small area (Raes), there are threads with many cotton fibers (probably “new” threads) and threads without cotton fibers  (probably genuine Shroud threads).\n\n","date":"August 9, 2014 at 3:26 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143132","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"I guess it depends on one’s perspective.   To me it’s all convoluted and I don’t know where to begin.\n\n","date":"August 9, 2014 at 3:55 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143140","author":"Giorgio / HSG","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Giorgio, in what format is the quote from Raes?  Was there some sort of French only written Proceedings from the 1989 Paris conference?\n\n","date":"August 9, 2014 at 2:59 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143127","author":"Joe Marino","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"He was responding to Father Kim. Raes uses the term “In his contribution of Paris”\nRaes also states in his letter to Fr. Kim That “I could not agree with him and that in my opinion the cotton fibers were not superficial fibers”. \nThere are hundreds of letters that are marked confidential that talks about the transfer of threads in Albuquerque (possibly the infamous) and threads from  the cope of St. Louis of Anjou.\nI’m thinking of translating all of these letters in spanish and talking to Telemondo to create a Novella. LOL\n\n","date":"August 9, 2014 at 3:48 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143137","author":"Giorgio / HSG","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"“in my opinion the cotton fibers were not superficial fibre” I think this is a very significant statement from a textile expert like professor Raes. Thanks for sharing.\n\n","date":"August 9, 2014 at 6:50 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143151","author":"Mike M","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"I agree with Mike M . This suggests that spinning took place in a room where cotton fibres were floating around and got integrated.(as Raes suggested). Of course as there were different hanks of yarn in a cloth as big as the Shroud ( shown in the bandings) , some hanks may have more cotton fibres than others, depending on the atmosphere in which the spinning took place.\nStill nothing like enough cotton fibres to significantly affect the date.\nI believe Mazzaoui when she says that cotton and flax were never spun together but the separate threads of each were used in various combinations.\n\n","date":"August 10, 2014 at 3:17 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143195","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"P.S. There is no reason to believe that hanks of yarn with cotton fibre were woven at a different time period from those without much or any fibres. Surely it would depend on what cotton was lying about, being disturbed , being spun alongside the linen ,etc. This would surely vary within a single room within a single day, let alone between different work spaces and account for fibres being found on some of the hanks and not on others. After all we are dealing with tiny amounts of cotton fibres.\nIt is pure imagination to claim that there is a valid distinction between old and new threads on the basis of whether they have cotton fibres within them or not!\n\n","date":"August 10, 2014 at 3:29 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143197","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"David Goulet says: “With the right experts, advanced instrumentation and protocols a non-destructive examination may find the smoking gun both sides of the debate are looking for.”\nAngel says: Question:   Has the Shroud been subjected to this method of microscopy?  \n4D multiple-cathode ultrafast electron microscopy\nBest,\n\n","date":"August 9, 2014 at 6:57 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143152","author":"Angel","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"After the statements of Flury-Lemberg, vague opinions about the “invisible mending” are useless. We need only precisions about some points: \n1. Is the “invisible mending” visible with a microscope handled by experts. Flury-Lemberg said yes.\n2. Is it possible to do on light fabrics as linen? Flury-Lemberg said it is not.\n3. Is it possible to do in big holes (more than 1cm)? Flury-Lemberg said it is not.\n4. It is possible to do with a different fabric than the original? Mr. Ehrlich said it is not.\n5. We can see an example of this “invisible mending”? Mr. Campbell was not able to present anyone.\n6. There is bibliography about absolute “invisible mending? I don’t know. I have asked for several times but without success.\nNote: I have simplified with “Flury-Lemberg” and “Ehrlich”. I know other coincident opinions. \nWithout a convincing answer to these questions the “invisible mending” that escapes to checking of experts with microscopes, cover a hole of 1×7 cm, uses threads of  different cloths, etc. is an entelechy. \nPS: Given the testimonies of  Ehrlich on this forum, Flury-Lemberg, etc. I like to know when Mr. Marino will rectify his precedent articles about the “invisible mending”. A good deal of its “evidences” are untenable.\n\n","date":"August 10, 2014 at 3:00 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143193","author":"David Mo","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"David Mo, you stated, ” Is the “invisible mending” visible with a microscope handled by experts.  Flury-Lemberg said yes.”\nAngel says:  My point is why not use the new 4D multiple-cathode ultrafast electron microscope to scan the entire Shroud?  This is a non-destructive technique that would not damage the Shroud.\nIf this procedure were followed, researchers would be able to see the “clean” areas of the cloth and would be able to take a small sample from one of those uncontaminated sections for C-14 dating.  Of course, that is under the assumption the linen is Thymol free.\nBest,\n\n","date":"August 10, 2014 at 5:29 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143270","author":"Angel","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"You should ask about this to the experts and the Catholic Church. I am neither expert nor Catholic. Some non destructive methods are now available that could resolve the nature of the bloodstains, the amount of painted particles, etc.\nThe owner of the Shroud spoke about a new set of checkings when the 2002 restauration. But these good intentions were gone with the wind. Everybody can ask why and answer himself.\n\n","date":"August 11, 2014 at 3:19 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143343","author":"David Mo","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Giorgio HSG “I’m thinking of translating all of these letters in spanish”.\nIt would be very interesting! Meanwhile I will be grateful if someone can say where we can consult the Raes’ writings.\n\n","date":"August 11, 2014 at 3:08 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143340","author":"David Mo","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"My kids always say I need new materials because my jokes are always horrible. I guess that goes for my novella joke as well.\nDavid, as far as “writings” Raes in particular, try contacting Remi Van Haelst, he may have had direct correspondence with Raes.  My collection mostly consist of HSG correspondences.  However, many of the researchers and various groups felt obligated to CC most correspondences to Farther Otterbein, who was the President of HSG.  Father Kim was one such person. Keep in mind, it was important to keep the Guild informed in all studies and formal conversation because The Guild had the best connections with the Turin’s Shroud authority to establish future testings and fundings. \nEventually, when I am done with studies,  I will be revamping the HSG site next year to include many of these correspondences. Some are marked strictly confidential which I must respect however, I maybe able to redact some of these “writings” and upload them to a site that will be password protected.\n\n","date":"August 11, 2014 at 8:31 am","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-143390","author":"Gio/HSG","site":"shroudstory"},{"title":"Comment Promoted:  Thibault Heimburger on Rogers’ Discoveries","post":"Reblogged this on Best of Shroud Story.\n\n","date":"July 11, 2015 at 6:22 pm","url":"https://shroudstory.com/2014/08/07/comment-promoted-thibault-heimburger-on-rogers-discoveries/","cat":"comments_promoted","id":"comment-205313","author":"Dan","site":"shroudstory"}]
