[{"title":"Nul points, Dr.Thibault Heimburger. You have arrived at an over-hasty, ill-judged diagnosis… The patient is NOT dead…","post":"I’ll give your idea a try, Hugh. But it’s essentially Garlaschelli’s methodology, n’est ce pas, and while that gave a respectable image at the gross level, it would not (presumably) have produced a highly superficial image confined (mainly) to the ribs of the herring bone weave (or cross-over crown threads at the next level of magnification). I know or no mechanism of imprinting that comes anywhere close to explaining the superficiality, except contact-scorching off a hot template.\nYup, I came across your “metal-protection” effect a few weeks ago, when I placed a horse brass on linen and baked in the oven. There was an unscorched facsimile under the brass. But that image is the opposite of the conventional one that leaves a scorched “pseudo-negative” which then reverses to a positive as per Secondo Pia. The white facsimile is already a “positive”, viewed in photographic terms, so gives a negative if/when one tries to invert it.\nI’ll think about that third idea. “There are more things in heaven and earth, Horatio, than are dreamt of in your philosophy …”.\nI hope the onslaught of the new half-term won’t mean you disappearing completely from sight Hugh. Your approach as a fellow-experimentalist has been good for my morale, good for science,  to say nothing of this site’s visitor count.  😉\nAre your pupils aware of your sideline?\n","date":"October 27, 2012 at 1:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/26/nul-points-dr-thibault-heimburger-you-have-arrived-at-an-over-hasty-ill-judged-diagnosis/","cat":"medieval_forgery","id":"comment-1022","author":"colinsberry","site":"colinberry"},{"title":"Nul points, Dr.Thibault Heimburger. You have arrived at an over-hasty, ill-judged diagnosis… The patient is NOT dead…","post":"Lemon Juice…\nIn the kitchen this morning I dropped some lemon juice on a bit of cloth and put it under the grill (not near my Bunsen burner, you see). Sure enough, the lemony areas darkened much more quickly than the rest. However, sudden inspiration! So far, we have been placing irregular heat onto regular cloth (hot bas reliefs on linen), whereas what I was doing in the kitchen was placing regular heat on irregular cloth (grill on lemon drops). As my half-term is drawing to a close, I must get back to earning a living, but with your trusty African mask and pencil-shapener, why not mix up a paste involving lemon juice (or milk or some other invisible ink) and something to make it pasty, rub it on your artefacts, dab them, just as you did when then they were hot, successively onto your cloth, and when they’re dry, put the whole thing in the oven. \nConductivity…\nI also noticed that the cloth, lying on the metal bars of the grill, didn’t char at all where it was in contact with the metal bars, which were presumably conducting the heat away so fast (as in your boiling water in a paper bag experiment) that the cloth didn’t get hot enough. So I placed a horse brass on the grill, and put some cloth on top. Brilliant. A lovely negative of the brass, with everything scorched except the shape underneath. I’ve no idea whether this has any implications for the shroud, but it was quite interesting anyway.\nFinally…\nTime for a blockbuster, mind-shattering bestseller of an idea, if it hasn’t been thought of before.\nGiven, for the sake of argument, the following:\n1) the C14 dating is genuine (which lots of people dispute)\n2) technically the shroud is impossible to fake (which has yet to be determined)\n3) the shroud is a representation of Jesus (which most people accept)\n4) the blood marks were added later (which nearly everybody disputes)\n5) that there was at least one and probably a handful of full length images of Christ knocking around in France in the 14th century (accepted by some, who explain their provenance as being copies of ‘our’ shroud, but if the few images of the Besancon shroud I’ve seen are anything to go by, not so impossible as 14th century creations).\nMy hypothesis is that ‘our’ shroud was in fact the backing sheet of one of the others. They may have been to our eyes obvious fakes, but if whatever they were painted with (the medium rather than the pigment) transferred onto the backing sheet, it may well only have stained the topmost fibres of the backing (my dabbing with ink, or lemon juice idea). In a subsequent hot incident, the painting became sufficiently discoloured, or brittle, to have to be thrown away, leaving a most surprising, and in fact much better replacement.\nIf only I was an author. Trouble is, I don’t know to what extent I accept any of my initial assumptions. However, if there’s anybody out there who does (and the idea hasn’t already been thought of and rejected) then can I have a percentage of the royalties?\n","date":"October 27, 2012 at 1:09 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/10/26/nul-points-dr-thibault-heimburger-you-have-arrived-at-an-over-hasty-ill-judged-diagnosis/","cat":"medieval_forgery","id":"comment-1021","author":"Hugh Farey","site":"colinberry"}]
