[{"title":"And More Still on the Roman Flagellum and Flagrum","post":"Old news. See my “May 27, 2014 at 1:30 pm” in response to exactly the same link. The handle of twisted, metal chains and metal bell-shapes (not dumb-bells) does not look to me like a good copy of an actual archaeological find. Imagine yourself holding the handle, and then try to visualise the size of the “bells.” If anything was actually found at all, and it is interesting that the museums denied knowledge of the alleged discoveries, I wonder if this illustration is based on a miniature or model.\n\n","date":"May 29, 2014 at 7:13 am","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","id":"comment-125462","author":"Hugh Farey","site":"shroudstory"},{"title":"And More Still on the Roman Flagellum and Flagrum","post":"Hugh, the handle of twisted, metal chains and metal bell-shapes of this very old dictionary is not a flagrum and it is not copied from a real, original object. It was copied from another book of the XVIII century, that made confusions between flagra and Italic decorations for people or horses. Old news, indeed. About it, and in general about flagra, I will write extensively in a chapter of a new book.\n\n","date":"May 29, 2014 at 7:25 am","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","id":"comment-125464","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"And More Still on the Roman Flagellum and Flagrum","post":"Hi Andrea, see the latest posting about your upcoming book.\n\n","date":"May 29, 2014 at 7:40 am","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","id":"comment-125469","author":"Dan","site":"shroudstory"},{"title":"And More Still on the Roman Flagellum and Flagrum","post":"Thank you, Dan. But the chapter about the flagra is not in that book.\n\n","date":"May 29, 2014 at 8:01 am","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","id":"comment-125475","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"And More Still on the Roman Flagellum and Flagrum","post":"Wading deeper, by trying “flagrum” and “site:archive.org” on Google.\nThe same illustration as appears in Anthony Rich’s “Antiquities” also appears in “A History of Rome and the Roman People, from its Origin to the Invasion to the Invasion of the Barbarians”, by Victor Duruy (1883), where it is described as “The Whip of the Lorarius. From a model discovered at Herculaneum.” \nThen there’s “The Archaeological Journal” Volume XXVIII, page 196, where there is illustrated a sort of branched tree of chains ending is six strands, with no handle but a wire loop at one end, which is captioned: “Bronze scourge or flagrum, from a Roman vila at Chesterford.” The accompanying description is less positive: “It is not easy to assign a purpose to this chain.” It more likely to be the hanging arrangement for a ceiling lamp.\nI knew you’d all be fascinated…\n\n","date":"May 29, 2014 at 11:42 am","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","id":"comment-125504","author":"Hugh Farey","site":"shroudstory"},{"title":"And More Still on the Roman Flagellum and Flagrum","post":"I consider all this argument about what a flagrum looked like and what it didn’t look like, is all so much hot air.  Any handyman today could make a quite effective flagrum using only the ordinary simple tools readily available in Roman times and still available today.  What it would like, would only be constrained by his imagination, what materials were available to him, and its intended purpose.  It would not be at all necessary for a rigorous compliance with detailed standing instructions and specifications of Quartermaster-General’s Sargent, Roman Legion, stationed in Jerusalem, first century AD, to win inspection for purchase or acceptance, or for that matter general use by any Roman soldier or other person so delegated for the job.   Note that it would not be necessary for actual dumb-bells to be used to inflict dumb-bell shaped wounds.  Barbet never said the thongs terminated in dumb-bells; Only that the wounds had a dumb-bell shape to them.  He envisaged two sheep tali (knuckle-bones) or lead pellets separated by about 3cm, tied to each thong at some distance from its end,  Such a weapon as may have been used to inflict the scourging wounds displayed on the Shroud image is readily identifiable as a type of Roman flagrum, as asserted.\n\n","date":"May 29, 2014 at 4:13 pm","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","id":"comment-125562","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And More Still on the Roman Flagellum and Flagrum","post":"The whole problem with flagrum shape argument is that it determines nothing -similar whip could be produced either in Roman or medieval times -so it is itself neither argument for, nor against authenticity. Which has been always my position.\n\n","date":"May 29, 2014 at 4:21 pm","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","id":"comment-125564","author":"O.K.","site":"shroudstory"},{"title":"And More Still on the Roman Flagellum and Flagrum","post":"The very least that can be said is: 1) The gospel accounts of both Matthew and Mark both record that Jesus was scourged, apparently the usual prelude to a crucifixion;  2) There are scourge marks on the image of the TSM, about 100 to 120 marks, arranged in pairs, suggesting a scourging of some 50 or so lashes by two different executioners, each using a whip of two thongs each thong fitted with two pellets, perhaps knots, more likely bone or metal objects (possibly lead);  3) The two pellets were separated by a distance of 3cm, and were some distance from the end of each thong as there are instances of thong marks reaching beyond the pellet marks; 4) Such an instrument is entirely consistent with what is known of the Roman flagrum, of which it seems likely there were varieties in specific design, according to the personal preferences of the executioners; 5) Any suggestion as to some other cause is pure speculation unless it can be supported by a reasonably similar weight of evidence.\n\n","date":"May 29, 2014 at 9:21 pm","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","id":"comment-125611","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And More Still on the Roman Flagellum and Flagrum","post":"Makes a forgery hard to contemplate.\nI stilll favour miraculous creation.\nHence the dating problem.\nThe reweaving theory is not credible.\n\n","date":"May 30, 2014 at 5:21 am","url":"https://shroudstory.com/2014/05/29/and-more-still-on-the-roman-flagellum-and-flagrum/","cat":"flagrum","id":"comment-125674","author":"Thomas","site":"shroudstory"}]
