[{"title":"Goodness me, look what I’ve found","post":"Nice find, but just because we don’t have an exact surviving scourge that would match the injuries suffered by the man on the shroud doesn’t take anything from the authenticity case. The historic record indicate that the Romans were very creative in inventing different torturing methods. I think it’s fascinating that the shroud shows injuries that was not seen in conventional artwork, were very realistic (fanning from both sides, different marks in different areas, curve with the body in 3D), forensically accurate (serum retraction rings) and consistent with what historians described as a roman flagrum (multiple thongs with bits and knots at the end) how many thongs and how many bits or what their shape was, who knows. These soldiers had many options to choose from or even create themselves(crown of thorns)\n\n","date":"May 28, 2014 at 10:15 am","url":"https://shroudstory.com/2014/05/28/goodness-me-look-what-ive-found/","cat":"flagrum","id":"comment-125261","author":"Mike M","site":"shroudstory"},{"title":"Goodness me, look what I’ve found","post":"I agree with you 100%.  And the bottom line is this:  if the Shroud is the product of a forgery, it cannot be anything else than a forgery made with the use of a real scourged and crucified corpse who present many signs of having been tortured with Roman methods.  Because of this, I don’t see anyone in Europe during the 14th Century who could have done this or just even imagine to realize such a gruesome plan simply to create a false relic of Jesus burial cloth…  As I said before, the only rational possibility that still exist (even if it’s very slim) is to think someone did this in the Middle East around the time of Constantine’s conversion (beginning of the 4th Century) and before he prohibited for good the use of this form of capital punishment…\n\n","date":"May 28, 2014 at 10:56 am","url":"https://shroudstory.com/2014/05/28/goodness-me-look-what-ive-found/","cat":"flagrum","id":"comment-125267","author":"Yannick Clément","site":"shroudstory"}]
