[{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"I would like to add an argument about my response to Ron.  I really don’t think the vast majority of the blood on the Shroud came from blood who was still in a liquid state.  In fact, I believe it was a rarity.  Personally, I assume that the scourge marks were done by a transfer from clotted blood who were becoming humid again.  This is an hypothesis that was first develop by a French doctor named Pierre Barbet and much later, the chemical and microscopic analysis done by Alan Adler seemed to prove that Barbet was right on this particular subject.  So, assuming that it is the case, we have to think this process of transfer took some time to operate, especially for wounds who were not bleeding anymore at the time of death.  This process doesn’t happen instantaneously and it is logic to think it happen much more easily on wounds that were still bleeding at the time of death ! \nSo, it is very normal to assume that the scourge wounds didn’t leave a big quantity of blood materials on the Shroud because they are wounds who were clotted long before Jesus died on the cross.  It’s easy to think those wounds were not bleeding anymore at the moment of death.  So, from my point of view, it is really normal to assume that those blood stains are very superficial and didn’t penetrate the cloth that much because the transfer process had surely a hard time to humidify them enough to permit a transfer on the cloth.  In fact, I really believe we are lucky that there was even a transfer !  Other wounds like the wrist or the feet or the crown of thorns were still bleeding at the time of death.  After death, when the body was laid in the Shroud, those wounds were surely clotted but I presume it didn’t take long for those wounds to start to be humid again and transfer on the cloth.  And because these wounds were bigger and were more easy to transfer, it is normal to assume that those are the ones who penetrate the cloth all the way to the other side.  \nBut, for the scourge marks particularly, it wasn’t that easy to transfer !  So, in my mind, it’s normal that these wounds are really tiny on the Shroud and it is also normal to believe the blood from those wounds didn’t penetrate that much into the cloth.  \nAnd, from all this argumentation I’ve made, I can postulate that the different shapes of the scourges wounds we see on the Shroud came probably from slight differences in the quality of the transfer of the clotted blood…  Now, I think you got the whole picture of what I believe about the scourge marks, after reading a bunch of scientific articles and books on the subject.\nAnd I must admit that this particular subject is important because he can give us many clues on different aspects of Christ Passion, death and emtombment…\n\n","date":"July 27, 2011 at 4:36 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3448","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Yannick have you happened to read Dr Zugibe’s hypothesis on the body being washed in all your readings? This topic is highly contested, but to me makes alot of sense and can explain much of what you have talked about.I’m not contesting the humidity hypothesis with this statement but just adding an alternate cause for the blood or more precisely ‘most’ blood to show or be transferred to the shroud.I think it’s safe to assume that by the time they had reached the tomb, the body would have been covered in dirt or dust, with dirt encrusted on many, if not most of the wounds…Jesus did hang on the cross for atleast an hour after death and again laid in front of the cross for the same amount of time, this info (hypothesis) taken from my studies on the Sudarium of Oviedo.Anyways this could explain possible reopening of wounds and the ‘easy’ transfer of blood to the shroud.Much better then the humidity hypothesis, IMHO…As for your statement made in the earlier comment about the ‘Strips’, all I can say is, there have never been any other stips of cloth found to date and I would assume the deciples would have carried those off also.So it is a huge assumption, whereas with the shroud, the sewn strip and the sudarium we have tangible evidence to speak of.\nRon.\n\n","date":"July 27, 2011 at 11:17 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3450","author":"Ron","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Also forgot to mention another thing; To earlier comments made by you Yannick on the discussions of multiple types of whips used or not.You couldn’t see the logic in the Romans using more then one type of whip.Here’s my thoughts to that and a possible answer; It is quite possible and logical a second type of instrument was used to flog Jesus as he was carrying his cross to Golgotha, maybe explaining why the alternate type of whip marks are basically found on the lower legs.It’s highly doubtful they would have used the Flagrum at that time.\nThanks,\nRon\n\n","date":"July 28, 2011 at 4:06 am","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3453","author":"Ron","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Hello Ron !  Excellent remarks my friend !  You make me think and it’s a good thing !  I don’t have much time right now for a big reply but I’ll take some time tonight to write you an appropriate comment and post it tomorrow on this page.\nRight now, I can make a short reply to your last comment about the hypothesis of many weapon used to scourge Jesus.  First, I must admit that I didn’t thought about this possibility.  It’s an interesting one…  Bravo !  But I’m a bit perplex about it.  If we take the Gospel account of the Passion for granted, then there’s some chances that Jesus was wearing his tunic on the way to Calvary while carrying his cross.  The relic of the Holy Tunic of Argenteuil in France, with all the blood found on the back (same AB blood type than the Sudarium and the Shroud) could be a confirmation of that, but it’s controversial because the C14 dating about this tunic gave a 7th century date.  It’s funny because it’s the same thing about the Shroud and the Sudarium !  Anyway, if Jesus really was wearing a tunic during his way to Calvary, I don’t think we should expect the addition of serious injuries on the skin from some whipping.\nAnother good argument against this possibility is the fact that Jesus was so exhausted that he wasn’t even able to carry his own cross all the way.  So, taking this fact into account, it is highly doubtful that the Romans would have whipped him a lot and with enough violence to add more injuries on his way to Calvary.  The Romans surely didn’t wanted Jesus to die before being crucified !  That’s why they requested Simon to help him carrying the cross…\nWhat do you think of those 2 arguments ???  I think it’s fair to assume that all the scourges marks were done prior to the carrying of the cross.\nTo finish this comment, can I ask you a question ?  Are you a scientist or someone who is an expert of the Shroud ?  You seem very well inform on the subject !!!\n\n","date":"July 28, 2011 at 10:46 am","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3458","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Hi\nIt’s always a pleasure to read such interesting remarks about the Shroud made by well informed Shroud researchers. I agree that not all roman flagrums have the same size dumbells but there’s no doubt scourge stains are blood marks dumbell shaped with a halo of serum.\nAs far as I remember Professor Alan Adler stated that they are not whole blood but a blood clot exsudate produced by direct contact with the cloth.\nNevertheless if we examine the Image of the Shroud surely there are image areas of the body that were not in contact with the fabric but appear on the cloth because image was not produced by a contact mechanism but by a kind of collimated raditional mechanism as Dr Alan Adler stated.\nProfessor Fanti and Professor Mario Latendresse presented interesting papers concluding that the Man of the Shroud’s kind of wrapping was not too tigh the Shroud simply beeing draped over the body just like sixteenth century Della Rovere’s beautiful picture depicted.\nHolograms of the Man of the Shroud produced by Dr. Petrus Soons and his team showed that scourge marks followed anatomical body segments shape for example concerning thighs or legs they curve in cilindrical way even where there was no contact with the cloth.\nMy doubt is apparently we’re left with a paradoxical situation because we see on the cloth scourge marks that had to be imprinted on the cloth by contact but paradoxically they are in non contact image areas e.g. inferior thigh areas and superior leg in dorsal body image.\nHad the body first been tightly wwrapped Dr John Jackson’s way and blood clot exsudate stained the cloth, and afterwards someone released the strips so the Shroud was just covering the body in the tomb when image was produced?\nIt seems to me we’re left with a conundrum.\nIf Yannick , Ron or someone else can help me to solve this  I’d appreciate.\n                               best regards\n                               Maria da Glória\n                    Centro Português de Sindonologia\n\n","date":"July 29, 2011 at 8:12 am","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3469","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Hi Maria,\nNice to see you posting here, I have read many of your posts on other sites and commend you on your knowledge  and your defence of the Shroud…I couldn’t presume to be able to help you out, but I am as you perplexed on what would cause these anomolies.I can only hypothesize that the Shroud was tied as Dr Jackson proposes, but that it may have been tied not so tight and only in a fashion so to wrap the body and not necessarily to hold the body in a position.Plus the body was in extreme rigor and strongly in the position of the cricifixion, except for the arms obviously as they would have to been forced into their crossed hand position.This loose wrapping would leave the shroud basically draped, and in parts hanging loosely for the most part.Hense we get contact images on some areas and non-contact images on others of the scourges.As my deductions are different from Yannick’s as I believe not all scourge marks are from contact.\nRon\n\n","date":"July 29, 2011 at 1:18 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3475","author":"Ron","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Hello again Ron !\nIf there’s scourges who are not made from direct contact, then what ?  You think some of them are part of the image and some are made of blood ?  I have some difficulty to follow your reasoning here.  In my mind, it’s all made of blood or all made of image coloration, not both…  And what do you do of the fact that the UV photos paper published by STURP mentionned that, for most of the scourges, we clearly see a serum ring around them ?  This is a clear indication that those scourges are made of blood material…  Maybe I don’t understand well your idea ?  I think you will have to explain more in details what you mean by some scourges made of direct contact and some others made from non-contact.\n\n","date":"July 29, 2011 at 3:34 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3478","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Hi Maria !\nJust a little word to invite you to read the message that I wrote in this same page especially for you.  Here’s the details about the message to make sure you don’t miss it : July 29, 2011 at 10:57 am \nPresently, I think it is message #10 of this page.\n\n","date":"July 29, 2011 at 3:39 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3479","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Hello Ron (and everyone else) !\nAs I said yesterday, here’s my response to your message about Zugibe’s hypothesis.  First, I want to say that, when I wrote the first message that is on top of this page about the fact that blood in a liquid state was probably a rarity on the Shroud, I was really expecting someone to bring forward the washing hypothesis of Zugibe !  I didn’t expect necessarily that it would be you.  I think it’s another good comment from you !\nAs you point out, this hypothesis is highly contested by others doctors who studied the Shroud, starting by Barbet in the 30s.  And I should say that it is not an easy subject regarding the Shroud mainly because of the scourge marks.  Effectively, we could expect to see more blood on the Shroud, especially on the back and the hypothesis of Zugibe seem to answer the problem.  But, if the hypothesis of the clotted blood becoming more humid is correct, I think it’s normal to see only the blood directly on and around the scourge wounds were there would necessarily be more blood crust (and more thick).  I think it’s fair to think this crust could have become humid enough to stain the cloth.  Also, I think it’s possible, as you point out, that many of those scourge wounds would have re-opened before the corpse was put in the Shroud, or, at least, some oozing would have occurred in the wounds areas (Barbet talk precisely about that in his wonderful book).  On the contrary, the blood that would have come down from the scourge wounds (it would be logic to assume there was some) was surely clotted since a very long time and wouldn’t be very thick.  So, it’s pretty logic to think that this blood didn’t became humid enough to leave a stain on the cloth.  I think the humidity hypothesis can explain why there’s not so much blood on the Shroud, especially in the scourge areas.  Sure enough, we can assume that the body was covered with much more blood than we see on the Shroud but we can think that some crust of clotted blood was there for too long and/or was too thin so they didn’t became humid enough to stain the cloth.  I honestly think it’s the best explanation to understand the blood stains on the Shroud.  Of course it’s not a proven fact but it’s a pretty good answer to the problem, don’t you think ?\nComing back on the Zugibe’s hypothesis, I want to say that I’ve seen an interview of Gilbert Lavoie on Shrouduniversity.com recently and he mentioned that, from the researches he made in the Mishna and the Talmud, he found out that, when someone died while bleeding, this blood couldn’t be washed at all.  Another important point is this : if there was both blood shed in life and shed after death, all the blood couldn’t be washed because it was considered mingled blood and should be buried in the tomb with the corpse.  In fact, from what I know, the Jews believed the soul of someone was carried in the blood and that can explain why, if there was blood shed after death, the body shouldn’t be washed.  Even the blood who dropped on the ground could be taken to the tomb !  So, to me, the opinion of Lavoie on this particular subject is consistent with what we know of the way the Jews from this time looked at the blood.  That can also explain why the Sudarium was left in the tomb because it was covered with blood.\nOn the contrary, Zugibe said that, from his point of view, only the blood shed after death shouldn’t be washed.  Who can we trust then ?  Zugibe, to support his hypothesis, also report a comment from a Jewish rabbi who state that the normal burial procedure was to wash the body and anoint it even on the Sabbath.  Personally, I would say that the fact that the women had to come back to the tomb early Sunday morning to anoint the body contradict directly this affirmation !  Also, this claim seems to talk about a normal death.  It doesn’t tell if it was a normal procedure to wash a criminal who died on the cross and shed blood after death. \nHere, I want to point out some problems I have with this hypothesis (if you can answer them people, thank you !) :\n1-I have a great difficulty to believe that the persons who buried Jesus would take fine precautions to wash ONLY the blood shed in life while trying hard to avoid touching the blood shed after death.  It is more logic to think it was all of one or all of the other.  They washed the body or they didn’t washed it…  Obviously, if the body of Jesus was washed, it wasn’t washed completely !  Why ?\n2-It’s a fact, the blood on the arms, on the head and on the hair that we see on the Shroud is consistent with someone who’s in a upright position.  For me it is obvious this bleeding was done while Jesus was on the cross !  From the stand point of Zugibe’s hypothesis, since it is mostly blood shed in life, it should have been washed.  So, why this particular blood, obviously, wasn’t washed ?  Don’t make any sense to me.\n3-If the body was washed, why aragonite dirt was found on the heels ?  And if the body was washed, why dirt was found on the left knee and on the nose area ?  Don’t make any sense to me.  Ron, you said that the body should have been covered with dirt because he was laid down on the ground at the foot of the cross.  It is logic to think that way.  But, since dirt was only found in the areas that I mentioned, we have to think of a logical explanation.  The best I can found is to assume that the body was laid down on some rocky ground at Calvary and not on a soft ground made of dirt.  In fact, from archaeology, we know that the all the region of Calvary (outside the walls of Jerusalem) was an ancient stone CARRIÈRE and that the Golgotha was a rock.  So, I assume that the dirt who was found on the Shroud was stocked to the body on the way to Calvary.  If I’m wrong, then I don’t understand why they found dirt only in some precise areas like the nose, the knee and the heels…  I wouldn’t be logic.\n4-Almost EVERY blood stains (including the scourge marks) are surrounded by a ring made of serum that came from the retraction of the blood during the clotting process.  For Adler, it is obvious that it is a good clue that the blood stains came from decals of clotted blood as firstly proposed by Barbet in the 30s.  I’m not a specialist but I have great difficulty to believe that serum rings like we found everywhere on the Shroud could originate from an oozing of liquid blood coming out of the wounds after the washing of the body (as postulate by Zugibe).  And if someone can answered this question, I would really appreciate :  Do you know if blood in a liquid state can produce serum ring like we see on the Shroud, AFTER being transferred to the cloth ?\n5-Even if we think the washing should have been done (with the researches done by Lavoie, it’s not obvious), we know from the Gospels that the Sabbath was approaching and it was a Grand Sabbath because of the Passover feast.  It is obvious that the time factor should be considered while analysing this question.  It’s logic to think they didn’t had a great length of time to do the entombment.  And a good clue that they didn’t had any time left for an hypothetical washing is the fact that the women had to come back early Sunday morning to anoint the body, a procedure who should have been done, along with the washing, on Friday.  In my mind, if the washing was on their to-do list, along with the procedure to anoint the body, why they did only part of the whole procedure ?  It’s not very logic.  I admit that the time factor isn’t the biggest fact against this washing hypothesis because, as claimed by Zugibe, the washing could have been done very fast.  Even this last statement is not evident from my point of view because, if we follow Zugibe’s idea, determining which blood have to be wash and which blood have to be left on the body is a process that must take some time !  But, anyway, when we look at the whole picture (stains of blood consistent with someone who was crucified, presence of dirt on many parts of the body, presence of serum stains around almost every blood stains that is consistent with clotted blood), it is not obvious at all that the body was washed…  Personally, I don’t buy it.\nThat’s it for all the problems I have with Zugibe’s hypothesis of a washing of the body.  I think there are enough problems here to reject this hypothesis.  But, sure I’m not a specialist, so I can be wrong.  So, if someone can resolve all the problems I just mentioned, I’ll be the first to believe Zugibe was right !  On the other hand, many medical specialists seem to have the same opinion that me on this question, so, I don’t think I’m so off target here !\nAnd Ron, when you said that no linen were found until this day and is a clue for you that there wasn’t any linen strips used in the tomb, I can reply this to you :  Where are the other cloths used to wash the corpse ?  They surely haven’t done this washing bare hand !  So, why these other cloths (containing the blood of Christ !) haven’t been kept like the Shroud and the Sudarium ???  Good question don’t you think ?  In my mind, between linen strips and cloths full covered with the blood of Christ, I think the disciples would have kept the cloths that were used for the washing.  What do you think of that ?  But, more seriously, the fact that we don’t have with us today those possible linen strips or the possible cloths used for the washing, I don’t think it’s a very strong argument against the possibility that they really have been used in the tomb.  And I think I have strong arguments to show that linen strips were used to tied up the Shroud against the body in the tomb (at least for a time).  Since this questions need a long development from me, I’ll post another comment about this tomorrow…\nGetting back to Zugibe, right or wrong, the biggest thing to notice with his washing hypothesis is that, he too, like Barbet, Lavoie, Adler, Bucklin and others specialists, believe that the scourge marks were made of blood who was transferred by direct contact to the cloth.  That’s the most important thing in my mind.  Zugibe is another medical specialist who supports the idea that the scourges are not part of the body image.  It’s evident for him that they are made of blood, just like every other blood stains found on the cloth.  That’s what’s important to keep in mind here.  \nAlso, the fact you mentioned the Sudarium researches is a good thing.  I also believe this relic is directly related to the Shroud.  And I think the researches done on this cloth are great to understand better what happen to Jesus.  Effectively, these studies state that the body was left about an hour on the cross after death and then, was put down at the feet of the cross for another hour.  So, imagine the dead body lying there on the sun for at least 2 hours before being put in the Shroud.  I think this can explain better why so much blood stains (especially the scourge marks) did become humid enough to stain the cloth.  Again, I’m not an expert but it’s logic to think that the heat of the sun and the humidity (contributing to keep the dead body real warm) plus the fact that the skin was surely covered with sweat at the time of death could have humidified again many clotted wounds (even some who were clotted since a long time).  I’ve read many contradictions about the transfer of blood on the cloth but I’ve came to the conclusion that, whatever exactly was the process, it involved mostly clotted wounds who became humid enough to stain the cloth.  Now, did the clotted blood became humid again after the body was put in the Shroud (as Barbet’s thought) or was most of it was humid enough before the enshrouding, I’m not sure, even if right now, because of the possible factors I’ve just mentioned, I think it would be logic to think that most of the clotted blood was already humid (at least to some point) when the body as put in the cloth.  So, I think it’s fair to assume that most of the blood transfer must have started really soon after the enshrouding and I still think this transfer process from clotted blood was the same for the scourge wounds.\n\n","date":"July 29, 2011 at 8:34 am","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3470","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Here’s a message specially for Maria from the Portugese center of Sindonology.  First, I have to thank you for your kind words and your interesting comment.  The question you ask at the end is a very good one and recently, I’ve came up with the same explanation than you !!!  Exactly what you said.  The only way, in my mind, we can explain that there’s scourge marks in places where there’s no body imprint (like the back of the knees), is to think the Shroud was first tied up with linen strips (this configuration can explain very well the scourge marks) and then, after a time that must have been short(and before the image formation process begin), the linen strips were removed (for an unknown reason) and the Shroud was left loose over the body.\nTo me, that’s the only scientific and logic way to explain both the blood stains (with scourge marks) and the body image…  Some other explanation (like the body was floating in air in a levitation state) is pure non sense from a scientific point of view.  And a supernatural proposition like that doesn’t even fit with all the scientific data we possess about the Shroud !\nSo, from my perspective, I think your hypothesis on the question is really the best.\n\n","date":"July 29, 2011 at 10:57 am","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3472","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Holy cow Yannick you got to learn to compress your thoughts/writings a little lol.I’m going to have to read your comments carefully and get back to you when I have more time.But I will attempt to answer your first argument presently on the scourging;\n1.~I don’t see it being too hard to accept that even if Jesus was wearing a Tunic, a whip would not still leave whelts on the body, especially since the material of a tunic would be quite thin.There is the possibility of the tunic raising leaving the bottom most part of the legs bare(Especially during the times the lord fell).Seeing also that there were very few 3rd type whip wounds; (30) I believe, to me strengthens my argument in that it would mean very few lashes, 30 wounds with the 3rd type whip would calculate to specutively 10 or less lashes….What would be the reason for so few lashes if it was done at the same time of the scourging? It makes more sense to me that so few lashes would have occurred at a different time.But that is just my conjecture, nothing more.\n2.~Seeing that the Romans didn’t care much about the Jews and especially one that was marked as a ‘criminal’, I have no problem in accepting the possibility the Romans whipped him during his ascent to Golgotha.(It is known, that many ‘victims’ of crucifixion never made it passed the brutal scourging).So to answer your second argument; No, I don’t think it’s far fetched to propose he was whipped on his way to Calvery.\nRead; New Image Processing of the Turin Shroud Scourge Marks (Faccini, Fanti), if you haven’t already~\n~To the article by Faccini, Fanti.I’m not in total acceptence as I believe they ‘may’ have made a fatal flaw and it has to do with the type1 and 2 scourge marks, as I do not believe there was a type 2 scourge, but that these marks were left by the type 1 alone (The Flagrum).Reasoning; I read that the actual thongs of the flagrum (an actual sample of a flagrum found by archaeologists) were made of unequal lengths and the replica they used did not have this feature.(Their replica the thongs were of equal lengths).The reasoning for the uneven thong sizes apparently was so that the thongs or more precisely the dumbells would not tangle (Those romans could be maticulous).This feature would also cause one or two of the thongs (themselfs) to make direct contact on each blow, possibly leaving the welt type marks Faccini and Fanti are taking for a second type of whip.\nThanks for reading,\nRon\n\n","date":"July 29, 2011 at 12:53 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3473","author":"Ron","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Hello Ron !  Thanks again for your comment.  It’s hard for me to compress my argumentation since english is not my native language (I speak french).  But, I’ll try !\nThe question we have to ask ourselves for this topic is this :  Since it is proven that there is many types of shapes in the scourge wounds, does it necessarily means that there was many types of weapons used ?  The answer is no.  I won’t redo all my argumentation about it but I think, if you’re honest (and I know you are) you can agree with my answer to this question.  I think claiming that many weapons were used is not the simplest answer to this question.  I think the answer I’ve proposed (some slight differences in the transfer process for some wounds associate with some slight differences in the hits given during the scourge) is far more simple.  If we take the Occam razor rule for this, I think my explanation is the best because it’s more simple.  I don’t say that because I believe I’m better than anyone else.  I just say that I honestly believe that, from all the knowledge we have about the Shroud, we don’t need a complicated explanation like the different weapons hypothesis (associate or not with many scourgings) to explain the different shapes of scourges we see on the Shroud.  \nOf course, sometimes the simplest answer isn’t necessarily true but, in this case, with all the data we possess, I firmly believe it’s the most logical answer.\n\n","date":"July 29, 2011 at 1:11 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3474","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Little additional argumentation :  I also think the explanation I’ve proposed is the most logical in regard of the knowledge we have about the transfer process of those scourge marks on the cloth.  If we agree that those marks are made of blood material transferred from clotted blood, I honestly believe my explanation fits well with the scientific facts.  Also, it’s probably the simplest…\n\n","date":"July 29, 2011 at 1:52 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3476","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Hey no problem Yannick, considering your native language is French you are doing an excellent job communicating here, probably better then I, LOL.Anyways I am not against any of your propositions here, I’m on the fence on alot of things about the Shroud (details and understanding the mechanism) not in it’s authenticy ofcourse.I’ve breezed quickly over your comments about the humidity vs.washing debate and although I’m not convinced on it, you have pointed out some very telling points and have made me rehash and re-think alot.Which just means I’ll have to do some more reading and contemplating before I can debate this topic any further.As for your very last comment when it comes to the details of this amazing Shroud, nothing seems to be ‘simple’.I think we can agree on that.\nOh almost forgot, several topics back you asked me about my credentials, and to answer; No I am not a scholar or a prof, I am a simple tradesman and hold cards in two different fields, but since an early age I have been interested in many fields including history, science, art and in particular since about the mid 80s the Shroud, when after I first saw it.Which I must say has taken much of my free reading time.\nRon.\n\n","date":"July 29, 2011 at 4:09 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3480","author":"Ron","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Hello Ron (and anyone else) !\nI can see by your answer that we’re exactly the same !  Like you, I’m no expert in sindonology but I’m very passionate by the subject and spend many hours reading many things about it and reflect a lot about this great mystery.  I think it’s not because we’re no expert that we cannot think and make up our mind on the subject !  So, I hope we’ll continue to exchange our ideas on this blog and I’m sure that’ll lead more people to do the same thing, which is a very good thing…  Sharing our ideas and hypotheses, along with a good argumentation based on hard scientific facts, observations and probabilities, could only be a good thing for everyone.  And let’s hope that we’ll stay open minded enough to accept to ear ideas that are not the same than ours !  I surely did that in the past because, as time goes by, I’ve changed my mind on a lot of things about the Shroud.  But one particular thing that I never changed since the beginning is the belief (it’s a belief, not a scientific certitude) that I have that this is indeed the Shroud in which the dead body of Jesus was put into the tomb on Good Friday…\n\n","date":"July 31, 2011 at 7:45 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3500","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"This blog is doing a fantastic job of discussion. I wish more of the SSG folks would enter discussions here.\n\n","date":"July 29, 2011 at 4:33 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3481","author":"impman","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Me and my big mouth… :-)\n\n","date":"July 29, 2011 at 4:40 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3482","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Hello Ron !\nLike I said yesterday, I came back to you about the specific question of the linen strips (and some other interesting topics).  \nFirst, I want to emphasise again this important fact :  It’s not because we don’t have any linen strips today associate with the Shroud that they never existed before !  So, I don’t think this argument you put forward is very strong to deny the possibility that the Shroud was tied up around the body, at least for some time in the tomb.  That’s my personal feeling and you’re free to think differently.\nI also want to state this :  The possibility that the Shroud was, for a time, tied up is not some dream I have about this.  It’s not a personal concept that I put forward without any facts.  It’s not a personal conception of what the configuration of the Shroud versus the body must have been.  If I believe the Shroud, at least for a time, was tied up around the body, it is because some important OBSERVATIONS were made by the STURP team that lead me to conclude that.  I also took another interesting observation from a good documentary on the Shroud.  And there are also some historical clues that support this conclusion of mine.\nTaking the historical clues, one of them is that there are some lists of relics from Constantinople that mentioned not just the Shroud of the Lord but many cloths that were found in the tomb.  Here’s a list of the historical references that I know :\n1- At the end of the 11th century, Alexis Comnène the emperor of Constantinople wrote a letter in which we found a description of relics.  Here’s an extract : “the CLOTHS found in Christ sepulchre after the resurrection.”\n2- Around 1190, an anonymous description of the relics of Constantinople report this : “part of the CLOTHS that Joseph of Arimathea had the honour to envelop the crucified body of Christ.”\n3- 1200 :  Nicolas Mesarites, the keeper of the relics in Constantinople, did a description of the relics.  Here’s part of his description : “The funeral CLOTHS of Christ.  They are in linen…  because they enveloped, after the Passion, the incomprehensible dead coated with myhrre.”\n4- In 1247, Saint Louis, King of France, bought many relics from the Constantinople emperor.  In 1248, these relics were kept at the Sainte Chapelle of Paris until the French revolution in 1789.  In 1534, there was a big inventory made and in this document, we found the mention “A part of the Shroud of Christ”.  Today, the catalogue of the Sainte Chapelle associates this partial relic with LINEN STRIPS.  Historically, we don’t know if it was really linen strips or just another cloth, but it’s interesting.  Unfortunately, this particular relic, along with many others, was lost during the French revolution.    \nSo, that’s it for the historical references that I’ve found about MANY cloths that had been found in the tomb on Easter morning.  So, historically, we can’t rule out the possibility that linen strips could have been used with the Shroud and kept as relics.  The fact is that we don’t have them today but that doesn’t mean they never existed.  And there’s a possible explanation for this disappearance : They could have been easily get lost during the sack of Constantinople or during the French revolution.\nNow, before analysing some observations that give us good clues about the use of linen strips to tied up the Shroud, we have to keep in mind that the blood stains and the scourge marks, without serious doubts (at least, from my perspective), were made by direct contacts.  On the contrary, a vertical projection process account for the image coloration.  Science tell us that we have 2 different processes for the Shroud…  I don’t see any good arguments that can contradict that claim.\nHere, along with all the others observations that I’ve put forward during the last few days, I want to share with you 2 VERY interesting observations made by Miller and Pellicori that tend to prove that the scourge marks are made of blood and are not part of the image coloration.  On the dorsal part, here’s what they saw : “Scourges are apparent through the scorched shoulder areas above the patches.”  And on the frontal part, here’s another observation : “Through the scorches of the upper left arm, can be seen blood or scourges.”  Because we know that the scorches are about the same color than the body image, if the scourge marks would have been part of the image coloration, it’s almost certain that we wouldn’t see them at all in the scorches areas.  A proof of that can be found in the STURP paper “A Comprehensive examination of the Various Stains and Image on the Shroud of Turin” (Jumper, Adler, Jackson, Pellicori, Heller and Druzik).  In this paper, the authors wrote this : “The chemistry of the lightly scorched fibrils is very similar to the chemistry and appearance of the body-only image fibrils.”  On the contrary, the blood, which possesses a different color than the scorches, can be seen in these areas.\nFor me, when I look at the whole picture (and not just one isolated element), I have no doubt at all that the scourge marks are made of blood material coming from clotted wounds and are not part of the image coloration.  I think I’ve showed you enough facts and observations to fully support that claim !\nKeeping that in mind, it’s time for 2 important observations that gave us clues about the fact that the Shroud was probably tied up around the body for some time in the tomb.  Here it is :\n1- In their paper about the UV fluorescence photos, STURP members Miller and Pellicori noted this observation from the dorsal part of the Shroud :  “Notice at the expected knee joint that there is no body image and LIMITED SCOURGING.  Ron, you point out the fact that the body was in evident rigor mortis in the Shroud.  The best clue to confirm this is precisely the knees that are bent like they probably were while Jesus was on the cross.  It’s a clue that tells us the rigor mortis came rapidly while the dead body was still nailed to the cross.  So, if the knees were still bent because of the rigor mortis, who can some scourge marks could have transferred on the cloth if the Shroud wasn’t tied up with strips of linen in this particular area ?  If the Shroud was draped loosely all the time, from the moment the body was put in the cloth, sure enough, we wouldn’t see any marks at all along with no body image.  So, if there’s some limited scourging in this particular area that WAS NOT IN CONTACT with the stone, the Shroud must have been tied up at the knees, for a time, to permit a direct contact between the cloth and the back of the knees.  Notice that I say “for a time” because, from a logical standpoint, if the Shroud would have been tied up all the time, then the image process would have surely caused some coloration in this zone of probable direct contact and we would see an image of the back of the knees.  It’s not the case !  To me, this is THE biggest clue that the Shroud was tied up with linen strips for a short time (long enough to permit the transfer of some “limited” scourge marks), and then, for whatever reason, he was untied and let loose over the body.  After he was let loose, we can easily imagine the cloth falling down at the back of the knees until he (almost or completely) rest on the stone.  Only after that, the image formation process began and, because the cloth was now away from the back of the knees, there was no formation of an image in this particular region.  That’s the most logical hypothesis to explain this particular observation made by Miller and Pellicori.  In fact, to me, this is the ONLY viable explanation from a scientific and logical standpoint.  If anyone have a better explanation, I want to ear you !  Important note :  I want to ear you only if your explanation is compatible with the known laws of physics !  Things like levitation are not acceptable from a scientific standpoint.\n2- In an excellent documentary made in England some years ago and entitled “The wonder of the Shroud”, Father Martin Haigh, O.S.B., made a fine observation about the blood flow that we can see outside the body image of the right heel.  By the way, I truly recommend this documentary to all of you.  Along with the more recent “Unwrapping the Shroud : New Evidence” documentary, it’s the best documentary on the Shroud that I have ever seen.  For a Catholic like me, this program was a real blessing !  It talks about the Shroud from a really nice Christian faith perspective.  You can order the DVD of this documentary here :  http://www.shroudvideo.com/.  Getting back to the observation, Father Haigh point out the fact that the blood flow outside the right heel formed a mirror image.  If you look at a negative picture of the Shroud, you can easily see what he means.  Barbet state that the blood flows we see in the feet area (including the blood flow outside the heel) are a clear indication to him that they were formed by blood in a liquid state that came out of the feet after the body was laid on the back for the entombment.  And, to him, it was surely one of the only places where we find blood stains coming from liquid blood on the Shroud.  As Father Haigh point out, the blood dropped down from the feet to the heels and formed a pool there and some of this liquid blood went outside the right heel.  Now, to explain why we see a double flow outside the heel with the form of a mirror image, Father Haigh explained this with the probable used of a linen strip that tied up the feet and caused the forming of a crease in the linen cloth that lead to the formation of a double stain of blood in this region (with a mirror effect).  I really think it’s the best (only ?) way to explain this double flow that form a mirror image.  And, as Father Haigh mentioned, small details like that are the best arguments we have in favour of the authenticity of the Shroud as a genuine Shroud of someone who’ve been tortured and died like Christ !  Those little details really help to deny any forgery theory.  How in the world a forger could have thought to create small details like that, that are anatomically correct ???  Good question, don’t you think ? :-)  \nNow, you have 2 important observations that gave us very good clues that, at least for a time, linen strips were used with the Shroud to tie it up around the body.  I didn’t invent these observations !  I just found them while reading a scientific paper published by STURP and while watching a very good documentary about the Shroud.  And these observations stocked in my mind when it came to analysing and understand the blood stains and the scourge marks we see on the Shroud.  I firmly believe that we cannot understand properly the blood stains on the Shroud if we don’t assume that, for a time, there were linen strips that were used to tie it up around the body.\nI also want to state again that, if my transfer hypothesis is right for the scourge marks, it can well be another good clue that the Shroud is a genuine Shroud of someone who died exactly like Christ.  Effectively, the fact that this direct contact transfer wasn’t perfect so that we see some slight differences in the shape of the scourges, this, to me, is a clear indication that it was a natural transfer process that came from real scourge wounds of a real tortured man.  We can assume that it wouldn’t have been normal to see all these clotted wounds being transferred perfectly everywhere on the cloth while leaving a stain exactly of the same shape !  The contrary would have been strange enough to the point we could think of a forger’s work !  Be, fortunately, it’s not the case on the Shroud.  All the scourges have not been perfectly transferred to the cloth.  Some are more evident to see than others…  And some are MUCH more evident to see than others !\nThis lead me to point out another interesting observation made by Miller and Pellicori in their STURP paper about the UV photos.  It’s an observation that applies to another aspect of the question we discuss recently.  They notice that, on the frontal and on the dorsal part, there is some scourge marks that are not visible in normal light but only visible in UV light.  It’s pretty much like some tiny blood stains can only be detected with UV lights on a crime scene.  I think it’s a very good confirmation of what I said previously about the probable superficiality of the scourge marks on the cloth.  To me, that’s why we can’t see these marks on the backlight photos.  This observation fits very well with the idea that the scourges are mainly a superficial transfer of clotted blood on the cloth surface, unlike most of the other blood stains who were more fresh and/or more important in size so they could go way deeper into the cloth (many of them goes all the way to the other side of the Shroud).  And this observation proves that the transfer of clotted blood from these scourge marks wasn’t done at the same exact intensity and there is some scourges who are more perfectly shaped and much more evident than others.  This tends to prove that we are in presence of a NATURAL transfer phenomenon from clotted blood and not an artistic forgery done with real human blood or with red ochre and vermilion.  In a forgery, we would expect to see scourge marks about the same intensity everywhere and, consequently, we would expect to see all of them very easily.  It’s NOT the case on the Shroud !  Joe Nickell, Dr. Karl and all the other sceptics will have to explain this to me ! :-)\nAgain, I have to say that I’m sorry for the length of this message but I had too much info and arguments to share with all of you !!!  I hope you people (and particularly you Ron) will find this message interesting and helpful for your reflexion !!!\nP.S. :  At the very beginning of the documentary, Father Haigh mentioned something VERY IMPORTANT that we, who are passionate about the Shroud, should ALWAYS REMEMBER.  Here’s what he said : “I think there is a danger that, during the last 30 years or so, or attention was being focussed far more on the historical and scientific aspects of the Shroud at the expense of a close examination of exactly what is ON the Shroud, the image that is on the Shroud.  That’s fundamental because that’s where the main argument is in favour of the authenticity of the Shroud !”  I think the double blood flow off the right heel is a perfect example of that.  We don’t have to be an historian or a physicist to see a sign there for the authenticity of the Shroud.  I think everyone here should never forget this comment.  So write down this comment on paper and put it on our fridge !!!  And I really hope some of you will bought this wonderful documentary !  It’s really worth the price !\n\n","date":"July 30, 2011 at 5:05 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3492","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Yesterday, I’ve forgot to write this :  Along with the Shroud, the Sudarium and the possible linen strips, there is a very good possibility that at least one more cloth full of blood would have been present inside the tomb on Good Friday.  This possibility of another cloth come from the many blood flows that we see on the lower part of the back.  As Pierre Barbet point out, those blood flows (that goes from the right side of the back all the way to the other side) is surely due to the use of another cloth for the transportation of the corpse from the Calvary to the tomb.  This cloth should have been twisted to serve as a SANGLE and facilitated the transportation of the corpse without having to touch this bloody part of the body.  This twisting of this cloth (now lost) would have caused the blood from the side wound to soak into the creases and left some blood on the skin of the lower back.  For Barbet, it is this blood that has left some imprints on the Shroud in this area.  For him, this blood was not necessarily in a liquid state but instead, just like the blood flow from the side wound, he was at the beginning of the clotted process when the imprints were made.  In my opinion, this explanation of the many blow flows that we see on the lower back of the Shroud is the most logical.  \nIf we take this explanation from Barbet for granted, then that means 2 important things :  1- The body wasn’t put in the Shroud at Calvary but only when he reached the tomb. 2- This other cloth used for the transportation was surely left inside the tomb (because he was full of blood) along with the Shroud, the Sudarium and the possible linen strips…  As I point out, some relics lists from Constantinople mentioned many cloths that were found inside the tomb.  It is possible that this twisted cloth full of blood that was used for the transportation would have been part of the relics ?  I think it’s surely possible !\n\n","date":"July 31, 2011 at 7:47 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3501","author":"Yannick Clément","site":"shroudstory"},{"title":"More on Flagrum Proportions and Measurements and Now the Side Strip","post":"Now, I want to talk again about the Zugibe’s hypothesis of the washing of the corpse.  I don’t know if it was part of Zugibe’s thinking or if it was even the starting point of his hypothesis but I know that some people believe in this hypothesis (not the majority of the medical experts) because they presume that we should see more blood stains on the Shroud than we actually see.  Those people think that, after all, the man present so much wounds (particularly scourge wounds) that it would be normal to see more blood stains.  \nI think this way of thinking would be accurate if the blood on Shroud came mainly from blood in a liquid state.  It is not the case at all !  Most medical experts concluded that the majority of the blood on the Shroud came from clotted blood that had flowed down and clotted scourge wounds made on blood.  The only places where the majority of the expert think there was a transfer of liquid blood are the feet, the lance wounds on the side and the blood flow we see in the lower part of the back.\nSo, for me, it’s absolutely normal that we don’t see on the Shroud all the blood that was left on the dead body of Jesus (note : I often say Jesus because I believe it’s him.  To be more scientific, I should say the man on the Shroud.  Pardon me this wrongdoing).  Since the majority of this blood had clotted since a long time (many hours), for me, it’s normal to assume that a good portion of it never get humid enough to be able to transfer to the cloth.  So, the fact that the Shroud look “too clean” versus the possible amount of blood that should have been present on the scourged and crucified body isn’t a valid clue for me in favour of the washing of the body, because of what we know about the probable transfer process from clotted blood.\nAnother clue that lead Zugibe to think that the body was washed is the fact that we actually see a body imprint of the back.  In his thinking, if the blood stains on the Shroud could have prevent the formation of an image, then why wouldn’t be the same for the possible clotted blood that was surely (in his opinion) present everywhere on the back.  Here, I will not comment on this particular (and interesting !) question because it would need a very long development.  Maybe it could be another interesting topic to discuss in the future ?  What do you think Dan ? :-)\n\n","date":"July 31, 2011 at 7:53 pm","url":"https://shroudstory.com/2011/07/27/more-on-flagrum-proportions-and-measurements-and-now-the-side-strip/","cat":"flagrum","id":"comment-3502","author":"Yannick Clément","site":"shroudstory"}]
