[{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"I don’t understand what the argument here is? It’s obviously to me the flagrum shown in the video by Fr.Ricci, was created with dimensions (dumbell spacing) used from what they found on the shroud.I doubt very much he ever meant to say the marks on the shroud were ‘identical in measurement’ but I took it has in ‘design’ of the particular instrument.No one could possibly make that precise a statement and I think that should be understood…or maybe by using common sense?.Anyways, I have found thru much reading on the topic of the scourging that it is now believed that more then one type of whip was used, that it has been studied and shown quite reasonably that there were approx 40 lashes from the flagrum (3 prongs), leaving approx 120 marks.Other types of scourge marks were found along the legs that do not have the dumbell contusions and approx 30 of these have been found, if my memory serves me correct.Obviously this is not exact as it would be quite difficult to measure any over-lapping strokes and because of the lack of clarity of the image.Also many types of actual Roman whips have been found and apparently the exact type as shown by Fr.Ricci (The Flagrum), is one of them and in a museum somewhere.My point is I see nothing wrong in the representation by Fr.Ricci in this clip.\nRon\n\n","date":"July 21, 2011 at 5:35 am","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3367","author":"Ron","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"The important thing about the scourge marks on the Shroud is this :  The dumbell shape marks are more consistent with a normal Roman flagrum than a normal medieval whip…  But there one thing I would love to see :  an artifact of a real Roman flagrum.  I think I’ve just seen reproductions so far…  If someone have an image of a real artifact, please share it with me (with us) !  Thanks !\n\n","date":"July 21, 2011 at 3:58 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3372","author":"Yannick Clément","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"Ron is right, there are at least two different scourge marks, or three, not due only to flagrum. See\nhttp://www.acheiropoietos.info/proceedings/FacciniWeb.pdf\nwhere Clement may also find artifacts of Roman stripes used for torture of the Man if the Shroud\n\n","date":"July 21, 2011 at 4:17 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3373","author":"Paolo Di lazzaro","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"Thanks M. Di Lazzaro.  I was aware of this study but, personnaly, different types of marking from the scourging didn’t necessarily mean that different instruments were used…  I think it has more to do with the way those scourge marks were transfered to the cloth, probably by direct contact from clothed wounds like every other blood stains.  In my mind, many could have transfered perfectly (dumbell shape marks) and some others may have transfered less perfectly (other types of marks like the scratch marks).  I think we must be really prudent when it comes to analysing those blood images on the Shroud.  And I really think it’s scientifically logical that not every scourge wounds have been transfered to the cloth in the same exact way even if they came from the same flagrum.  I think it’s logic to think that some wounds were more humid than others and then, their tranfer to the cloth was better…  And for me, the idea that every scourge wounds didn’t transfered exactly the same way (some more perfect than others) is another good clue that this Shroud is an authentic shroud of someone who’ve been scourge and crucified just like Jesus-Christ !\n\n","date":"July 22, 2011 at 8:36 am","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3379","author":"Yannick Clément","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"Dear Mr Clement, as for most Shroud characteristics, here we are in the realm of hypotheses, so everyone can express his/her own view and speculation, having a probability different of zero to be right.\nBe careful when you write about “blood stains” connected to scourge marks.  Prof. Baima Bollone, (who had direct access to the Shroud and made the most reliable analyses of the blood on the Shroud) claims the scourge marks are not blood stains. They just reproduce a sort of imaging of bruises.\nI am not competent to judge he is right or not, but I tend to consider more reliable the observations of (the few) people who had direct access to the Shroud, rather than the opinions of Scholars (like me) that never had a chance to touch and see closely the Shroud.\n\n","date":"July 22, 2011 at 11:34 am","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3383","author":"Paolo Di Lazzaro","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"Hello M. Di Lazarro.  Thanks for your comment !  \nI agree that, when it comes to specific details about the Shroud, there’s always many hypothesis out there.  But, the question is :  which one is the best ?  Personally, I’ve always opted for the most logical and simple explanation when it comes to judge between 2 hypothesis.  Always trying to keep in mind the historical context of the first century Palestine is one good way for this.  Also, always keep in mind all the facts that came out of direct examination of the cloth (mainly the work done by STURP because it was published in peer-reviewed journals) is another good way for this.  \nFirst of all, to have a good judgement about the scourge marks, first, we have to determine the correct nature of these marks.  I know that some medical specialists don’t agree on this particular subject.  Some say it is blood marks (I think we can fairly say that it is the majority of them) and some others say it is part of the body image.  \nI think I have a VERY good argument to claim that these scourge marks are probably made of bloody materials from clotted scourge wounds that were transferred to the cloth by direct contact, just like the vast majority of the blood stains on the cloth.  The transfer took place because these clotted wounds had become humid enough to permit it (by a process called “fibrinolysis” or simply because of the aqueous atmosphere of the corpse trapped into the shroud).  \nHere’s my main argument :  Recently, I’ve read the STURP paper “Ultraviolet Fluorescence Photography of the Shroud of Turin” written by Vern Miller and Sam Pellicori and published in 1981 in the Journal of Biological Photography (peer-reviewed journal).  In it, my attention was caught by the observations made about the scourge wounds.  First important finding :  This UV study clearly show that there is some differences in the types of scourge marks on the cloth.   And here’s another important findings from this UV study :  There is the presence of a fluorescent ring buffer around almost every scourge wounds under UV light !  It had been showed (by Alan Adler in particular) that those fluorescent rings around the blood marks are serum stains coming from the retraction of clotted blood.  A ring buffer like that is clearly a scientific sign of the presence of blood and serum.  \nSo, even if I’m not a medical expert, the presence of these serum stains around almost every scourge marks (thanks to the UV photos from STURP, it’s a proven fact) are a clear indication that those marks are really what they appear to be :  blood stains !  When it comes to analysed the nature of the images on the Shroud, little details like the fluorescent rings around the wounds are really important ! \nAnother really interesting observation made by Miller and Pellicori is that the scourge marks were generally a little more detailed on the dorsal image than on the frontal image.  \nWith these 2 FACTS in mind, we are in a better position to judge the hypothesis proposed regarding the fact that there are different types of scourge marks on the Shroud.  There’s 2 main hypothesis on this subject :  Some explain it by saying that there was many weapons used and some explain it by saying that it is due to the fact that some scourge wounds were better transferred to the cloth than others.  \nI prefer the second because, to me, it is a more logic and simple explanation than the first one.  I think it’s more easy to think that some scourge marks are different than others simply because the transfer process of the blood clots on the cloth was better for some wounds than others.  I think it’s logic to assume that some scourge marks were more pressed on the cloth than others (the better quality of the marks on the dorsal image under UV light seem to prove this point) and I also think it’s logic to assume that some scourge marks were more humid than others.  These arguments provide an excellent and simple explanation for answering why there are different types of scourge wounds on the Shroud.  Another important thing :  These arguments are consistent with the observations taken from the STURP paper written by Miller and Pellicori. Then, it’s logic to think that the transfer process was probably better for some wounds than others.  \nTo finish with this hypothesis, I have to mention another possible explanation that can be added.  We can assume that the same scourging instrument could have produced different types of wounds depending on the way it was used (depending on the force of the hit, then angle of the hit, the position of the soldier who hit, the distance of the soldier versus the scourge man, etc.).  I think it is also fair to assume that, because there was 2 or 3 leather tongues on a typical Roman flagrum, each tongue could also produce some slight differences regarding the types of wounds.  Then, we can assume that some scourge wounds were more superficial than others and also, some slight differences could be seen regarding the shape of the wounds.  I think these last arguments can complement the hypothesis of the blood transfer from the scourge wounds.\nThe first hypothesis is less logic in the sense that we have to assume that every scourge marks were transferred at the same intensity level, no matter where they were on the body and how hard they were pressed on the cloth.  Logic tell us that the scourge marks on the back have more chance to be better transferred to the cloth and that’s exactly what came out of the UV photos study made by Miller and Pellicori !  But I have to say that the authors also state that theses differences in the precision of the wounds are less important than what they expected at the beginning (but still, the wounds of the back are a little more detailed those on the front).  Another problem for me with the first hypothesis is the lack of explanation for the changing of instrument during the scourging process.  Why the torturers would have needed to change their weapons during the course of the scourging ?  I don’t think it exist any historical references about the use of different weapons during a typical Roman scourging.  Lastly, we have also to assume that each ones of the scourge wounds had the same humidity degree to be transferred perfectly so we can see the difference of the markings done by different types of weapons…  \nFor me, there’s too much problems to solve here.  The other explanation is much more simple and logic.\n\n","date":"July 22, 2011 at 3:42 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3386","author":"Yannick Clément","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"Dear Mr Clément, I am confident you will forgive me if I give more relevance to the opinion of a worldwide recognized expert of forensic medicine that gave a close look to the Shroud  rather than to your opinion, based only on indirect information and probably without a specific professional skill in medicine.  Professor Baima Bollone is a physician specialized in forensic medicine and in his career he analyzed more than one thousand corpses, and I am sure he can recognize if a stain is from blood or not. \nConcerning the paper of Miller ad Pellicori, you should know that every fluid secretion by our body is fluorescent under UV light illumination. As a consequence, the fluorescent rings observed by Miller may be due to exudate from the wounds, and not necessarily from serum in the blood.\nSo, you may recognize that your “very good argument” and “facts” maybe not so good at a closer examination.\nThe main point is that the Shroud was studied by hundreds of highly skilled experts in many different fields, and despite this, after more one hundred years we are still without a definitive explanation or conclusion.  This means Shroud is a very difficult topic, and the only hope is to continue to study by using the most advanced instruments and technology.\nAgain, I repeat we are in the realm of hypotheses, and among them “the best ones” are usually those formulated by skilled experts, scientists, historians and medicians (as far as I know not by bloggers, sorry).\nWarm regards\n\n","date":"July 23, 2011 at 10:28 am","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3388","author":"Paolo Di Lazzaro","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"I have to say that I found your message really bitchy and I don’t appreciate that.  Sorry if I offend you.  I hope you can admit that you’re not more an expert on this field than I.  So, can we share ideas without bitter comments ?  I don’t think my message was bitchy regarding you (and sure it wasn’t a personal attack), so I expect the same from you…  OK ?\nFirst of all, my opinion wasn’t based on indirect observations.  I have the paper of Miller and Pellicori at home and I’ve read it CAREFULLY.  You ?  I’ve also bought and read carefully the book from Alan Adler and the one from Ray Rogers.  I’ve also read many other papers published by STURP and, maybe you’ll be surprised, but I’ve also read the paper you published with Giulio Fanti about your UV lasers experiments !\nIt’s not because I’m not an expert in medical field that I’m a twit !  I still have a brain and he works pretty good.  I have all the right to make a judgement (as you can too) that is based on facts reported in a peer-reviewed journal by an expert in his field.  Vern Miller was a real expert to analysed UV photos.  He reported fluorescent halos around almost every blood stains AND almost every scourge marks.  This is not a joke or something due to hasard.  And sorry to contradict you but the serum halos surrounding the blood stains were confirmed by a chemical study by Alan Adler.  By the way, I recommand you to read the great book from Adler (The Orphaned Manuscript) that was published soon after his death.  You can find it here : http://holyshroudguild.org/orphaned-manuscript.html  \nYou’ll see some articles by Adler where he confirm the nature of the fluorescent halos around the blood and scourge marks.  It is a confirm FACT that those fluorescent halos were composed of serum coming from the retraction of clotted blood.  And I have to add that Ray Rogers, in his own book, made things clear about the fact that, after chemical tests, there wasn’t any other body liquid found on the cloth other than blood and serum (he didn’t even found traces of sweat). This is another observation of great value. \nYou talk about Baima Bollone’s opinion.  I can talk about Pierre Barbet, Robert Bucklin, Alan Adler or Gilbert Lavoie’s opinion too who think that the scourge marks are made of blood material !!!  But, to judge of the quality of an hypothesis versus another one, beside these contradictory opinions from doctors, I mainly based my judgement on pure hard scientific facts and observations.  It’s a proven fact that there is serum halos surrounding almost every scourge marks because chemical tests by Adler proves that these halos were composed of serum comming from clotted blood.  \nAs Rogers said it well in his book, we can take an observation or a fact for granted only if we have an independent confirmation.  In regard of those fluorescent halos around the scourge marks, that’s exactly what we have !  Adler confirmed the fact that these are serum stains and Miller and Pellicori showed that these stains where present around almost every scourge marks.  Since we are pretty sure of the presence of halos of serum around the scourge marks, it is natural to think that the nature of those marks are the same than the other blood stains.\nSo, it look like the scourge marks are really made of a transfer from clotted blood just like almost every other blood stains.  What’s wrong with that ???  Why should Baima-Bollone should be right on this particular point ?  He’s a human being and his judgement can be incorrect.  Barbet, Adler, Bucklin, Lavoie, etc.  They all think the scourge marks are made of clotted blood and they’re not of the same nature than the body image…  And STURP studies seem to confirm their ideas on this question.  What’s wrong with that ???  This fact suggest to me that the different scourge marks on the cloth are mainly due to slight differences regarding the quality of the transfer process from clotted blood to the cloth.  What’s wrong with that ???  I think the hypothesis of many weapons is incorrect in regard of the FACTS we know.  What’s wrong with that ?  After all, this paper published last year in Frascati is only an hypothesis and it’s not an accepted theory !!!  I think I have the right of my opinion on this topic and I think I’ve based my judgement on real scientific facts and not on my imagination or on my personal conception of Roman scourging…  Again, what’s wrong with that ??? \nTo conclude, you wrote “This means Shroud is a very difficult topic, and the only hope is to continue to study by using the most advanced instruments and technology.”  I TOTALLY AGREE WITH YOU ON THIS POINT !  In my mind, the biggest contribution that would be made from a new serie of direct researches on the cloth (let’s call this STURP 2 !) is that we could confirm or invalidate all the conclusions made by STURP some 30 years ago.  \nAnd you know what I think ?  Most of STURP conclusions would then be confirmed…  I’m pretty confident in saying this…  But, like every other message I wrote here, it’s just my personal opinion !\nThank you to open your mind enough to accept the fact that, here, I can freely express my opinion, even if I’m just a geographer with a bachelor’s degree and my name isn’t Einstein…  And I want to add  that we can disagree on many things regarding the Shroud but that doesn’t mean we are ennemies !!!  On the contrary, I think it’s really positive to share our different opinions on this mysterious relic…  Don’t you think ???\n\n","date":"July 23, 2011 at 6:27 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3391","author":"Yannick Clément","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"What the! \nPaolo you wrote, “I am confident you will forgive me if I give more relevance to the opinion of a worldwide recognized expert of forensic medicine that gave a close look to the Shroud rather than to your opinion, based only on indirect information and probably without a specific professional skill in medicine. Professor Baima Bollone is a physician specialized in forensic medicine and in his career he analyzed more than one thousand corpses, and I am sure he can recognize if a stain is from blood or not.”\nI embarrassed that those words were written by a fellow member of the Shroud of Turin Science Group (SSG). I was even more embarrassed when you wrote, “Again, I repeat we are in the realm of hypotheses, and among them “the best ones” are usually those formulated by skilled experts, scientists, historians and medicians (as far as I know not by bloggers, sorry).”\nHere is an opinion formulated by a world renowned expert.  “Everything I have read or heard from Ian Wilson, Max Frei, John Jackson, William Meacham, Alan Adler, Baima Bollone, Alan Whanger, Leoncio Garza-Valdez, et al., is contradicted by my findings. How can I explain how only I could be right and dozens of other “scientists” be wrong? Very simply, none of them are chemical microscopists, small particle microanalysts, nor have they studied the Shroud tapes against a background of familiarity with pigments, media and artist’s paintings. If I am right, then all of their ideas are wrong and I am right.”\nThe expert was microscopist Walter McCrone. Should we agree with him because he is a world renowned expert?\nAppeal to authority (Baima Bollone in this case) does not make for good science or good argument. Not in the blog and not in the all too secretive SSG chat rooms. Praise the bloggers, they know better. Praise the bloggers for are discussing the shroud in public where it should be discussed. It is bloggers and other non-experts that are challenging the experts and raising legitimate questions. And Yannick is told by you that the good answers come from “skilled experts” and “not bloggers.” What crap! \nDanin is an expert. He is highly respected, and deserves to be. I think he is wrong about plant images. Many bloggers think so too.   Jackson is an expert. Perhaps no one has contributed more to shroud science. I think he is great and quite right on many things. I think he is wrong on some things. Many bloggers think so too.   Rogers was an expert chemist. The world of shroud science owes so much to him. He was right on many things. I think he was wrong on some things. Many bloggers think so too.   Flury-Lemberg is a textile expert. I can’t tell you how much I admire her work on the shroud. She is right on many things. I think she is wrong on some things, particularly the reweaving. Many bloggers think so too.\nOver at SSG, it has been particularly nasty lately. One member was driven off by the kind of crap we just saw here in the blog. In every case it has to do with arguments about unsubstantiated claims by single experts. Maybe that is what happened here. SSG nastiness spilled over. \nIn fact I think that is what is wrong with shroud science today. Too many experts with their own opinions and not enough science and discussion.  SSG members need to stop talking among themselves and come out and blog without being “bitchy.” Maybe WE should stop being so secretive and make out deliberations public like bloggers do. BTW, IMHO, I think Yannick is right. But then, I’m not an expert.\n\n","date":"July 24, 2011 at 3:26 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3395","author":"impman","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"Hello M. Di Lazzaro !\nI’ve found another important piece of evidence that help to confirm the fact that the scourge marks are really made of blood material, just like any other blood stains.\nIt came from the great article of STURP entitled “A comprehensive examination of the various stains and images on the Shroud of Turin”.  This article was written by Eric Jumper, Alan Adler, John Jackson, Sam Pellicori, John Heller and James Druzik.\nIn it, on page 460, there’s a little section who describe the scourge marks and here’s what we can read : “Under UV fluorescence, they appear to be DARKER THAN THE IMAGE and, also, to be much more sharply defined than they appear in visible light, AS WOULD BE EXPECTED ON THE BASIS OF THE KNOWN SPECTRAL CHARACTERISTICS OF IRON PORPHYRIN COMPOUNDS.”  \nSince iron porphyrin is a component normally found in blood, I think this observation is really important to confirm the fact that the scourge marks are made of blood materials coming from clotted wounds.  And if the scourge marks were part of the body image, why they would appear darker than the image, like the rest of the blood stains, under UV light ?  These observations plus the observation of a fluorescent halo around almost every scourge marks in UV light should be enough to affirm, without any serious doubts, that the scourge marks are made of blood material and are not part of the body image.\nIn this same section of the article from STURP, it’s written that the scourge marks appear to be somewhat different from the other blood image in the sense that they are more sharply defined.  I think it’s this observation who contribute to create an ambiguity around those marks and lead some people, like Baima-Bollone, to think they were part of the body image.  But all the other observations that I just reported tend to confirm the fact that they are really made of blood and they are not part of the image.  It’s just that their shape is more precise and defined than other blood stains.  Finally, I think the possibility that these scourge marks are composed of both blood materials and image coloration is pretty low on the probabilistic scale.\nI don’t know for you, but when I read these facts (reported in peer-reviewed journals), my reaction is this one :  For the moment, I consider the scourge marks to be made of blood materials coming from clotted wounds and, until another direct analysis of the Shroud can be made that would invalidate these observations, I rule out the possibility that the scourge marks can be part of the body image.  Thinking that way is not so dumb because I base my judgement on published scientific FACTS…\nI hope you, and everyone who read this, will find these observations useful to make up your mind on this particular subject.  And I really suggest anyone who’s interested in the science of the Shroud to find the articles published by STURP and to read them carefully.  There’s a lot of clues in there that can really help to understand better this relic.\nP.S. :  By the way, I must admit that I fully agree with the comment posted by Impman !!! :-)\n\n","date":"July 24, 2011 at 5:52 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3397","author":"Yannick Clément","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"I have a problem with the theory that the scourge marks were blood contact images; For one, there are many scourge marks showing where there was no contact expected i.e; calfs, lower back, right adjacent to the hands on the upper thighs, you must take into consideration the body was in extreme rigor and not flat and tenting of the fabric over parts of the body, such as the hands.Two; In back light photos taken of the shroud the blood on the arms, head, feet and side show quite well but no scourge marks are present…Just my observations and 2 cents worth.\nRon\n\n","date":"July 26, 2011 at 8:35 am","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3420","author":"Ron","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"Taking the backlight of the Shroud, it’s an interesting point you made.  But, I think it can be due only to the fact that those marks are really thin.  And, we must always consider the hard scientific facts contains in the STURP papers that really point toward a bloody nature for those marks.  That the main argument for me to believe they are made of blood.  \nNow, for the expected places where we can think there was a contact between the Shroud and the body, it is really hard to say for sure because nobody was there in the tomb !  All we have his hypotheses that can come up close to what was the real configuration in the tomb but I don’t think any honest scientist can claim that he has found FOR SURE AND WITHOUT ANY DOUBTS the exact position of the Shroud versus the body.  \nAlso, if we take the scourge marks as made of blood and we consider the fact that blood on the cloth come from a direct transfer, that’s a very good indicator of the fact that the cloth must have been in really close proximity with the body almost everywhere from head to toe (at least for some time).  I think those scourge marks are somewhat of a good clue to think the cloth was, at least for some time, tied up to the body with linen strips.  That can explain why we can see scourge marks almost everywhere in the body image.  Here, it’s only my personal interpretation of what the scourge marks can tell us.\nAnd since I’m no more an expert than you, here’s another personal argument in favor of the bloody nature of the scourge marks (2 cents worth) :  In the nefative photos of the Shroud, EVERY scourge marks came out white, just like any other blood stains on the cloth and just like any blood stain would came out today in a normal negative photo !\n\n","date":"July 26, 2011 at 10:51 am","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3424","author":"Yannick Clément","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"Just another quick word to make things more clear.  The first sentence from the conclusion of the UV photo study made by Miller and Pellicori from STURP in 1981 state this : “The sharp deatils revealed for the first time, particularly in the scourges, suggest that intimate cloth-body contact occured.”  This conclusion seem to suggest 2 things :  The scourge marks were transfered by direct contact to the cloth and not by a projection (just like every other blood stains), and also, the cloth must have been draped very tight around the body (at least for some time) to permit the transfer of as many scourge marks as we see everywhere on the Shroud.\n\n","date":"July 26, 2011 at 1:03 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3425","author":"Yannick Clément","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"Oups… Little error :  You should read “Sharp DETAILS”.\n\n","date":"July 26, 2011 at 1:04 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3426","author":"Yannick Clément","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"I guess if we go by Dr Jackson’s hypothesis of the body being securred using the re-sewn strip along the side of the Shroud, then it would be possible that contact was made on all areas where scourge marks are shown, but there are problems, although minor, with his hypothesis.One being there should be blood on the side strip, or atleast traces of blood you would think (Which to this day no one can confirm, and I’ve asked).I contemplated the negative images and how the blood shows white also, and also how the scourge marks show the same, BUT as we do not understand the image mechanism, we can not simply assume that they had to have contact to give out a white appearance.The ‘backlight image’ is very telling in many ways and even if the scourge marks were very thin or sharp details, imho, just the multitude of all marks along with the dumbell marks bunched together should have shown up (as in blocking the light), it’s pretty clear.But it’s fruitless discussing these things, as we do not have access to high quality images or the expertise.It would be nice to have access to the recently taken High Definition photos though wouldn’t it?\nRon\n\n","date":"July 26, 2011 at 11:01 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3435","author":"Ron","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"Hello Ron !  Your last comment is very interesting.\nI think your totally right about the Jackson hypothesis of the side strip !  I’ve made the same reflexion that you :  If the side strip would have been used to tied up the Shroud around the body, it is almost sure that we would see blood marks on this side strip.  Excellent remark.  But don’t forget one important thing :  It is not because the hypothesis from Jackson is wrong that there were not some others linen strips used to tied up the Shroud around the body (at least for some time) and so, to permit the transfer of all those scourge marks we see almost everywhere on the Shroud.  I think the probability for this kind of use during the burial is high.\nConcerning your point about the image formation mechanism versus the scourge marks, I would say this :  If we assume those are made of blood materials coming from clotted blood (I think I’ve supply enough pieces of evidences from the STURP papers to support this idea), then we must assume that those marks were made from direct contacts between the body and the cloth.  Every honest scientist who had studied the Shroud has come to the conclusion that the blood stains were made from direct contact. \nOf course, there’s still your point about the backlight photo of the Shroud that seem to support at first Baima Bollone hypothesis that the scourge marks are of the same nature than the body image, but I think this fact alone is not enough to really support this idea when you compare it to all the scientific data that exist and who point toward a blood nature for the scourge marks. \nIt’s funny because right now, I’m reading a book that can help to explain this phenomenon while still thinking the scourges are made of blood.  The book I am reading was written by Baima Bollone in 2000 and the title is “101 questions about the Shroud of Turin”.  In it, the author indicate that, during the examination of the cloth in 1978, he noticed that some blood stains had penetrated all the thickness of the cloth and reach the other side while some others blood stains did not penetrate the cloth at all and therefore, were very superficial (he didn’t mention any particular area where it happen).  \nBut, with this information in mind, I think there’s a fair possibility that the scourge marks could fit this last description.  Regarding their very sharp aspect and the fact that they are not big stains, it think those marks could well be pretty superficial, that is to say that the blood material who probably compose them didn’t penetrate the cloth that much.  I think it is logic to think that.  In my mind, this could be the best explanation why we don’t see them on the backlight photos.  At least, because of the fact that some blood stains are very superficial on the cloth, the observation that the scourge marks are not visible on backlight photos cannot rule out the possibility (very high in my mind) that they are made of blood materials.\nOne thing’s for sure, to make up our mind on this particular topic, we must look at the whole picture and not just one particular detail.  Regarding all the facts and observations reported by STURP or Baima Bollone himself, I think the best explanation for the scourge marks is that they are pretty superficial and made of blood material coming from clotted blood.  In the present state of our knowledge about the Shroud, I honestly think it’s the best answer.  Of course, the analysis of those high definition photos could be a very good thing to support or discredit my conclusion, but I think another series of direct testing (with chemical analysis of fibres taken directly from those scourge marks) would be the best way to know the truth once and for all and finally end this debate !\n\n","date":"July 27, 2011 at 12:01 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-3445","author":"Yannick Clément","site":"shroudstory"},{"title":"Not True: The Shroud of Turin and Flagrum Proportions and Measurements Are Identical","post":"It’s amazing how much time people will spend analyzing a Medieval fraud. The Shroud of Turin is an obvious fake and you can tell just by looking at it. The head is abnormally small and one of the arms is abnormally short. The figure is also significantly taller than the general population of Jerusalem during that time period. If you saw this guy coming down the street you’d see these things immediately and wonder why this guy was so deformed.\nAnd then there’s the fact that an actual burial shroud was found in Jerusalem in the late nineties – did everyone here miss that? Completely different weave and composition.\nSo you got nothing – it showed up in the 1400s and was carbon dated to the 1400s. People were gullible back then and apparently… they still are.\n\n","date":"February 12, 2014 at 4:35 pm","url":"https://shroudstory.com/2011/07/21/not-true-the-shroud-of-turin-and-flagrum-proportions-and-measurements-are-identical/","cat":"flagrum","id":"comment-78769","author":"William Lakeman","site":"shroudstory"}]
