[{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"Hey there thanks for the write up. Cool blog by the way. Take care now.\n\n","date":"August 22, 2011 at 11:28 am","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-3651","author":"razorswift","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"Do you mind if I quote your correction on the silver issue? I would like to make the update to be more accurate. It makes me wonder why Schwortz said what he did (I am no photography expert) that you need silver -a certain form- to make a photographic image. Any thoughts? BTW, did you listen to the interview? I should post the latest documentary that his team was in also. Fascinating.\n\n","date":"August 22, 2011 at 11:37 am","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-3652","author":"razorswift","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"Quote away. Barrie is a good friend and it is fun to catch him. He catches me enough.\n\n","date":"August 22, 2011 at 1:28 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-3653","author":"episcopalian","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"It is written : “The guest (Barrie M. Schwortz) who is an Orthodox Jew, believes that the image on the shroud really is Jesus!”\nBarrie is a personal friend of mine and I just want to correct something here :  Barrie is not an Orthodox Jew at all.  He is a Jew who believe in God but who doesn’t participate in the cult of the Sabbath at the synagogue.  We can say that he’s a believer but doesn’t practise his religion like many Christians !  The rest of the sentence is completely true; Barrie believe that the Shroud is the genuine Shroud of Jesus of Nazareth.  Now, for the question of Jesus being the Messiah, Barrie is not there yet !!! :-)\n\n","date":"August 22, 2011 at 3:22 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-3657","author":"Yannick Clément","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"My busy schedule makes it difficult for me to keep up with all the Shroud blogs out there, but this particular posting called for a response.\nThere is no way to coat a porous linen surface like the Shroud with any light sensitive elements in liquid form without some traces of those elements soaking in and remaining in the cloth, even hundreds of years later.  The pyrolysis mass spectrometry used on the Shroud would have detected as little as one part per billion of those elements if they were there.\nBlueprints, platinum chloride platinotype prints and gum bichromate or chromium prints are all products of the late 19th or early 20th century so they could not have been used in medieval times to create the Shroud.  J.H. Schulze is credited as the first man to discover the fact that silver salts exposed to light turned black.  He made this discovery in 1727.  In the same year he discovered that silver chloride turned black under light. In 1737 he used silver nitrate in the same manner.  He used cut stencils to expose his silver salts.\nThomas Wedgewood and Humphrey Davy repeated Schulze’s experiments some years later by printing leaves instead of stencils. They tried to make a permanent emulsion but did not succeed.\nIt was not until 1818 that Joseph Niepce produced the first photographic negative, which I believe still exists.\nSince silver, platinum and chromium were NOT found on the Shroud, those processes must be eliminated as possibilities.\nOf course, the Shroud’s image properties themselves are the best evidence that it was NOT created photographically (even though its lights and darks are reversed, like a photo negative). You might wish to read the article I wrote in 2000 titled “Is the Shroud of Turin a Medieval Photograph” (http://www.shroud.com/pdfs/orvieto.pdf) that addressed Nicholas Allen’s camera obscura experiments in which Allen produced an excellent photographic image using silver salts and other medieval raw materials. However, that process resulted in an image dramatically different than the image on the Shroud.\nOne of my college professors used to say that “common sense is the least common of all the senses!” If we are going to make outrageous claims that modern processes were used hundreds of years prior to their actual invention, then we should start searching ancient ruins for medieval digital cameras (Ye Olde I-pod)!\n\n","date":"August 22, 2011 at 4:19 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-3658","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"Now, I agree completely with Barrie. And I yield to his professional knowledge. I am a novice. My only point was that silver was not the only metal that could be used to make photographs. And by all means, read Barrie’s paper. \nDan Porter\n\n","date":"August 22, 2011 at 6:01 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-3659","author":"episcopalian","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"“He is a Jew who believe in God but who doesn’t participate in the cult of the Sabbath at the synagogue.”\n>>>\nThank you for the heads up. I’ll make the correction.\n\n","date":"August 22, 2011 at 7:02 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-3660","author":"razorswift","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"I totally agree with Barrie’s statements, I am no expert myself but have conversed with pro photographer friends and they have stated in their judgement, there is no possible way the Shroud is a photograph and a simple look at the image tells you that…Just look at the lighting! …There is alot of talk about emulsions, and it is plausible that a medieval guru could have made an emulsion that could have dissipated over time, but highly unlikely.One important ‘technical’ ‘ingredient for the ‘photograph theory’ has been left out of the conversation here and it is the ‘LENS’, lens technology in the time mentioned for the possible creation of the Shroud was in it’s infancy.It is very unlikely to nearly impossible, to believe an artist of that era had access to a highly focused type lens, that would be needed to create the very fine detail we see on the image of the Shroud.\n\n","date":"August 24, 2011 at 12:55 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-3684","author":"Ron","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"And the persons who analysed forgery hypothesis tend to always forget one particular and very important argument that goes against every forgery hypothesis :  The question of the blood on the Shroud !  I’m sorry for the Joe Nickell of this world, but there is no way a forger could artificially create those blood marks that came mainly from clotted blood.  NO WAY !  PERIOD !  I even doubt that a team of medical specialist could even create those stains today as perfectly as we see them on the Shroud !  And when you add the FACT that those blood stains were on the cloth first and then, the image formation process begin, it’s even more illogical to believe a forger (from any period of time) could have create this.  The only thing left as a weak possible explanation (beside the idea that the Shroud is an authentic burial cloth of someone who suffer the same torture than Christ) would be to think that someone else was really crucified and that his body was put into a shroud.  But, here again, there’s a problem :  How can you explain the fact that the body disappeared from the cloth before the first signs of putrefaction (40 hours roughly) and without disturbing the blood stains ?  Good question, don’t you think ???\n\n","date":"August 24, 2011 at 1:06 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-3685","author":"Yannick Clément","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"And so, that’s it? that’s all the Son of God left us? A shroud? Not a recipe for end end to hunger or war? A shroud?\nOne morning, I rather suspect, you will wake up and see what a waste of time your short life on this planet has been.\n\n","date":"December 20, 2011 at 6:54 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-5806","author":"Jesus","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"Don’t forget eternal life that he left us with…\n\n","date":"March 15, 2012 at 7:10 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-9352","author":"razorswift","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"I am no scientist, but I live life with healthy objectivity.  My humble conclusion?  The Son of The Almighty God was here, thus validating the New Testament….and Old.  I feel priveledged.  I know much, (through researching REAL scientist’s findings…and non-findings), about the most important THING on the planet.  The longer I live, the more I understand I am sharing this wonderful planet with the 99% who are galactically ignorant, gullible, and mis-informed.\n   I believe it was a vanishing event which “crossed” the physical matter into other dimensions.  New Testament has the risen Christ transfiguring his physical appearance as well as moving into locked rooms, and disappearing again.  Citizens of Earth, please examine the evidence and conclude that the long haired, bearded guy, from WAY before the 14th century, is the prophesied Messiah.  True scientists of the world, thank-you.  Please continue deeper into the cosmos, and into the realms of the tiniest particulate matter…and anti-matter(?)  Archeologists, keep digging and getting those fingernails dirty!  You are all hero’s to me.  He encourages us to “seek me as you would a treasure”.   Einstein admitted that the universe is not only more incredible than we can imagine, but more incredible than we could EVER imagine.\n     Christianity, to myself, is no longer a “religion”.  I find that word belittles the Faith.  Christianity is the following of a real and living entity….the following of my Brother whom I look up to and want proud of me…similarly, as the Father is proud of Him.  Make no mistake, citizens.  Our lives are scrutinized every day.  (It’s in the text which goes with the “picture”).\n\n","date":"February 8, 2012 at 12:58 am","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-8040","author":"Scotty","site":"shroudstory"},{"title":"Razor Swift: The Shroud Of Turin Is Real!","post":"What’s your thoughts on the info that “debunks the shroud” on this site?\nhttp://www.sillybeliefs.com/shroud.html\n\n","date":"September 29, 2012 at 8:55 pm","url":"https://shroudstory.com/2011/08/22/razor-swift-the-shroud-of-turin-is-real/","cat":"flagrum","id":"comment-17069","author":"Razor Swift","site":"shroudstory"}]
