[{"id":"comment-150913","author":"eric","post":"It is relevant to note that Barrie Schwortz once noted that the reaction itself was only half of the puzzle: “Ray Rogers told me personally that he believed, “Something else was at work with the Maillard reaction,” but he didn’t know what that was and didn’t live long enough to explore it.” Since that comment was posted here (https://shroudstory.com/2013/05/21/the pig experiment was not barries experiment/) and Yannick is well aware of that, it may be negligent to only partially portray Rogers’ position on the matter..","date":"2014-09-14","mins":"7:46 am","url":"https://shroudstory.com/2014/09/14/a-defense-of-ray-rogers-on-the-image-at-the-thread-and-fiber-level/","cat":"guest_posting","title":"A Defense of Ray Rogers on the Image at the Thread and Fiber Level"},{"id":"comment-172676","author":"eric","post":"To be fair, I did place you on a category of your own. As far as the distinction between religious people, paranormal aficionados and skeptics, I was merely following YC’s lead..","date":"2014-11-23","mins":"9:29 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-172524","author":"eric","post":"Are you serious? If I wanted to sell something as real, the first thing that would be mimicked was something that reflected all of the iconography in a very simple manner. And in Christianity, the theme of sacrifice trough death as important as the resurrection itself. There is a reason why the crucifix is the main symbol. An “unexplained” image that correlates with the injuries of the Gospels would have been more valuable than a similar image of Jesus alive… It is the stigmata that serves as “proof” that it is that particular individual and thus, what would have raised the value of the item considerably. You should be able to easily know that, but perhaps your interest in throwing random attacks has clouded your judgement….","date":"2014-11-22","mins":"9:00 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-172526","author":"eric","post":"Heck, even *today* the selling point for the authenticity of the shroud is the fact that what is depicted mirrors the Gospels. A fact that virtually all pro authenticity papers state..","date":"2014-11-22","mins":"9:04 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-157959","author":"eric","post":"Wouldn’t the relative uniformity of the image represent a challenge to the possibility that the image was created by any sweat by product? The density of sweat glands is hardly uniform, even if the subject was sweating so profusely that he was literally covered from head to toes in sweat that hypothesis would still face the same issues of the MR and other “natural reaction” theories. You can’t disregard the fact that the back was supposed to be lying directly on a flat surface and the distribution of liquid/gases/et al. Would not be uniform..","date":"2014-09-30","mins":"7:25 am","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","title":"Secret Image Made With Invisible Ink"},{"id":"comment-172530","author":"eric","post":"On that same line, the answer to YC’s question can be found in the same iconography. The correlations are so precise that Occam’s razor (I know..) leaves Jesus as the most likely subject. Thus, religious people/supernatural aficionados see it as a sign from God or some sort of physical reminder. And skeptics see that portraying him was the easiest way to flim flam people in an age where the Church was extremely powerful. That is, unless you take positions like those of Hugh of Charles, who provide their own explanations of why they believe that is the subject..","date":"2014-11-22","mins":"9:17 am","url":"https://shroudstory.com/2014/11/22/image-of-the-resurrection/","cat":"image_theory","title":"Image of the Resurrection?"},{"id":"comment-157961","author":"eric","post":"I should have used “fluids” instead of “liquids”, but you get the idea..","date":"2014-09-30","mins":"7:29 am","url":"https://shroudstory.com/2014/09/29/secret-image-made-with-invisible-ink/","cat":"image_theory","title":"Secret Image Made With Invisible Ink"},{"id":"comment-158178","author":"eric","post":"Why would the “degraded collagen” remain only on the very strategic locations (and patterns) of the stains? It makes no sense..","date":"2014-09-30","mins":"8:33 pm","url":"https://shroudstory.com/2014/09/24/so-maybe-it-is-a-painting-after-all/","cat":"image_theory","title":"So Maybe it is a Painting After All"},{"id":"comment-158900","author":"eric","post":"My first query would be concerning the size of the image and how an artist would keep track of the areas that were previously worked while dealing with an acidic liquid that would leave a very faint stain before being heated. The shroud does not appear to have any pre image outlines. I am assuming that the “heating” would be done at once. Otherwise I would expect to see some sort of systemic transition between “sections”..","date":"2014-10-03","mins":"11:40 am","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"},{"id":"comment-158906","author":"eric","post":"Note that I use the term “stain” loosely, since AA is a bleaching agent..","date":"2014-10-03","mins":"12:03 pm","url":"https://shroudstory.com/2014/10/03/the-devolution-and-evolution-of-a-maillard-reaction-image-hypothesis/","cat":"image_theory","title":"The Devolution and Evolution of a Maillard Reaction Image Hypothesis"}]
