[{"id":"comment-159921","author":"eric","post":"Their response: “Some say John the Baptist; others say Elijah; and still others, Jeremiah or one of the prophets.” Suggests that at least the common folk believed in the possibility of reincarnation to some degree. Elijah was taken and John the Baptist was a case of mistaken identities… But what about Jeremiah? Some sources have him dying at Tahpanhes, others elsewhere, but none have him being taken away by a flaming chariot..","date":"2014-10-06","mins":"5:03 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-159927","author":"eric","post":"Also, the flaming chariot was a rare occurrence, excluding Enoch and Elijah, any other prophet would be considered “dead” by the layperson..","date":"2014-10-06","mins":"5:26 pm","url":"https://shroudstory.com/2014/10/06/a-different-perspective-on-the-shroud/","cat":"news_&_views","title":"A Different Perspective on the Shroud"},{"id":"comment-165077","author":"eric","post":"The entire thread that is discussing Charles’ article has turned into a mud slinging competition. I decided to withdraw from it, which is a shame, since there are arguments on both sides that I believe deserve careful analysis. For example, Thibault’s reply is well thought and yet it is barely discernible in that avalanche..","date":"2014-10-24","mins":"1:51 am","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"id":"comment-165081","author":"eric","post":"* well thought out.","date":"2014-10-24","mins":"2:05 am","url":"https://shroudstory.com/2014/10/23/accusations-of-intellectual-dishonesty/","cat":"news_&_views","title":"Accusations of Intellectual Dishonesty"},{"id":"comment-172213","author":"eric","post":"On the right side, which has most of the upcoming events I see: Turin, LA, M.DF, Rome, São Paulo, Atlanta, Prague, Madrid, Dallas & Lima..","date":"2014-11-20","mins":"8:34 am","url":"https://shroudstory.com/2014/11/20/how-many-cities-can-you-identify-on-the-back/","cat":"other_sites","title":"How many cities can you identify on the back?"},{"id":"comment-163869","author":"eric","post":"Spoken like a true follower of Jerry Coyne. And just like Jerry, you fail by generalizing and clumping every shoroudie scientist in the fringe..","date":"2014-10-19","mins":"7:51 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-163871","author":"eric","post":"* shroudie.","date":"2014-10-19","mins":"7:53 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-167024","author":"eric","post":"Oh Al, you commit the same sin that you condemn. You came here parroting the skeptic crowd without cutting the shroudies any slack. I will let the ones posting in here do introductions and list their credentials… But before that happens, know that this is not a cheerleading site. However, I will grant that most of the information and so called “theories” reported by the media are pretty fantastic and fringe. Also, not every one of those that publicly state their belief have any sort of religious motive. Barrie is probably the best example to prove otherwise and if you actually bother to reach him, just as you used his website, I am sure that he will have an interesting take on what does and does not fall into the fringe in his view. And don’t get me wrong, I have criticized several instances of pseudo science, if you go back a few weeks back you will find my opinion about the “irradiation” hypothesis and more recently, I was forced into a week long argument regarding this very odd case of a pseudo medical claim. With that said, claiming that *all* science dealing with the shroud is pseudo science is ridiculous, we have people here that are actually testing the different ideas that emerge, others examining the properties of the cloth… Not every one of the shroudies is “out there” in the fringe and by minimizing those that are not, you are also mocking the work of the skeptics that post here. Since it is so “obvious”, then they are surely wasting their time, right? And boy, are they mediocre if they can copy something that is so *obviously* a fake! No, it may very well be fake, but it is one interesting and rather complex fake. Trying to understand its properties is not any more pseudo scientific that studying the subtleties of a lost artist by studying his work. In other words, try to avoid the Coyne mistake of being ever so pretentious and at least try to test the waters first..","date":"2014-10-30","mins":"10:10 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-167025","author":"eric","post":"* if they CAN’T copy.","date":"2014-10-30","mins":"10:12 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-167775","author":"eric","post":"There we go. Exactly which branch of I may b so bold to ask? BTW, I was not trying to criticize your belief in the C14 testing, just your assumptions. Everybody in here has a different opinion, I am mostly interested in the formation processes and the possibility that medical knowledge was more advanced at least by the 1300s than we think. If you want to support that, go ahead, but try to ‘shroud’ your bias a little. By avoiding the pretentiousness and accusations in your first post, at least you would avoid being treated like an ordinary troll..","date":"2014-11-01","mins":"8:45 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-167035","author":"eric","post":"Oh, by the way, I believe that the last time that I saw Piczek mentioned here was in late 2013. At least, most of the shroudies rarely quote her, in the same way that few skeptics still quote Mc Crone (albeit Charles is trying a comeback). Still, at least her wild claims had the weight of having earned a degree. Which is why it was at least fairly evaluated, before falling into obscurity. Yours (admittedly) was in what, Google searching? If you fail to establish that you even have the educational baggage, then you surely can’t expect to be taken seriously when you come in guns blazing and trying to put labels… Because even those loonies have an expertise that outranks yours..","date":"2014-10-30","mins":"10:30 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-167782","author":"eric","post":"@Hugh In art history AFAIR (don’t ask me how that evolves into “P Ps”). Is it really relevant to her extrambotic hypothesis? No. But by at least knowing that she had a degree, people discussed her work. Why? Because she was introduced properly and took the time to make an attempt at a paper that backs up her claims. She did not come out of the blue and posted some bold assertions in a forum. Which was my point. The fact that she was completely out of her element did not prevent her work from being discussed (Charles is way out of his by placing all of his work on top of the “gesso” argument. His conclusion was reached without any scientist’s help, and he is as bold as to claim that this work overcomes real scientists based on logic… Yet it is still being seriously discussed) while other works such as the “lirey toga” fiasco of last week passed pretty much undiscussed. The degree, as unrelated as it is, allows some people to gravitate towards her and support her work… And the other camp to respond. And thus, the discussion follows. Not that I find the logic of your question, since she is not really a key component of any serious debate and I sure wasn’t defending her. PD Scratch the several months of not being mentioned, as Mike just quoted her paper >.<.","date":"2014-11-01","mins":"9:23 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-167784","author":"eric","post":"* “Exactly which branch of psychics, if I may be so bold.”.","date":"2014-11-01","mins":"9:28 pm","url":"https://shroudstory.com/2014/10/18/quote-for-today-on-carbon-dating-of-the-shroud/","cat":"quotations","title":"Quote for Today on Carbon Dating of the Shroud"},{"id":"comment-174346","author":"eric","post":"The congruence reported in the location of calcium deposits found in the sudarium of Oviedo and the shroud seems, to me, more interesting than the neutron madness. Particularly when noting the gap between the reported C14 dates (8th vs. 14th centuries)..","date":"2014-12-02","mins":"5:43 pm","url":"https://shroudstory.com/2014/12/02/the-neutron-conference/","cat":"news_&_views","title":"The Neutron Conference"}]
