[{"id":"comment-163227","author":"eric","post":"I would like to read Charles’ answer to this. Why would an artist spend so much time constructing such a detailed ‘buttocks’ just to (at least partially) cover it with a loincloth? The placing of the hands is deliberately trying to cover the genitalia, thus suggesting nudity..","date":"2014-10-17","mins":"5:25 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-168663","author":"eric","post":"Can we get a thread to discuss the flagellation tangeant that is building parallel to the main discussion?.","date":"2014-11-04","mins":"1:51 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","title":"A Couple of Terrific Comments About Charles Freeman’s Article"},{"id":"comment-163254","author":"eric","post":"I wi take the time to read the original article later. At the time of asking the question I had only read the paragraph quoted due to a parallel conversation with Max in another topic. However, that still leaves the question of “why?” open… If an artist was trying to sell a painted shroud as a legit relic, painting it in line with the established depictions from the beginning would have secured an easier sell or, in the case that it was painted for a Church, would have avoided the possibility of it being rejected. Also, if the shroud was regarded as authentic… Would painting over it not be considered desecration? I believe that your hypothesis depends on the idea that the owner of the shroud at the time of adding the loincloth was aware that it was a painting. Is this right?.","date":"2014-10-17","mins":"6:27 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163259","author":"eric","post":"In case that the last paragraph is a bit ambiguous. My point is that regardless of the power of the ecumenical council (the Council of Trent as mentioned), I am hesitant to believe that anyone would dare to touch the shroud if there was at least a possibility that it is a legit relic. To paint over the original, the owner should have been absolutely certain that it was a forgery… At the same time that it was being displayed publicly. There are deeper implications to this argument..","date":"2014-10-17","mins":"6:42 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163255","author":"eric","post":"* will.","date":"2014-10-17","mins":"6:29 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-163663","author":"eric","post":"Regarding the shoulders, I don’t think that the dislocations, inflammation, etc. That would follow crucifixion are being taken under consideration in the “floor” test. PD That is just an observation, I’m not trying to take sides..","date":"2014-10-19","mins":"2:32 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","title":"A Significant Article by Charles Freeman in History Today"},{"id":"comment-165922","author":"eric","post":"Not “good”. Max has a gift to annoy other users, especially when he tries to prove that he can outmaneuver somebody in his own field, but he can actually bring some nice arguments when debating something that he actually knows. And for whatever reason, MPH’s stingy remarks and his persistence to keep the arguments going on have produced some pretty good rebuffs, at least during the few years that I have read this blog..","date":"2014-10-27","mins":"9:25 am","url":"https://shroudstory.com/2014/10/27/more-on-charles-freemans-article/","cat":"article","title":"More on Charles Freeman’s Article"},{"id":"comment-168439","author":"eric","post":"* photos of victims.","date":"2014-11-03","mins":"10:04 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-170188","author":"eric","post":"I am actually starting to agree. Not because of the lack of a scientific base, but more because of Charles continuous disregard of people that are trying to engage him. The “I am now working with *real* academics” reply is getting old… Fast..","date":"2014-11-09","mins":"7:04 pm","url":"https://shroudstory.com/2014/11/09/dear-charles-freeman-re-the-famous-arnolfini-portrait-by-van-eyck/","cat":"article","title":"Dear Charles Freeman, re the Famous Arnolfini Portrait by Van Eyck"},{"id":"comment-168379","author":"eric","post":"This is tought provoking. However, the use of wound depictions within the Holkham bible seems selective. While I can see where the flagellation argument could be employed, there is also the fact that the same source has depictions that contradict the shroud. For example, the crucifixion is early depicted with the nails going trough the palm: Obviously, I am not assuming that this would be the same artist, but the wounds in the hand are a key component of the entire depiction of this scene and it seems contradictive that the shroud would depict those in a manner that contradicts the conventional wisdom… Especially if it was going to be used as a prop in an official Church activity. Thus, I ask Charles to provide some contemporary examples where the wounds go trough the wrists for contrast. PD Then again, an unrelated key question is “does the image exist under the back stains”?.","date":"2014-11-03","mins":"5:32 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168432","author":"eric","post":"David cited “15 years of experience in a NGO human rights organization” and having seen victims of flagellation victims as his rationale. I don’t think that “proves” the point, but that’s just me. And my main issue with it is that of all the victims that David may have seen, chances are that none were actually assaulted with something resembling the alleged flagrum of the shroud. Perhaps one of the regulars could replicate one and do some research in fresh pig carcasses? The skin of pigs, while not identical to humans, may be a decent facsimile..","date":"2014-11-03","mins":"9:41 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168380","author":"eric","post":"* The crucifixion is *clearly* depicted Sorry for the typos, but I can barely type in these smartphone keyboards.","date":"2014-11-03","mins":"5:35 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168659","author":"eric","post":"Not really my point, I already noted that the artist was most likely not the same (I assume it was not). What was requested are other contemporary depictions where the “hand” wounds go trough the wrist. For something that was going to be used oficially by the Church, it would be really odd to wander away from the conventional wisdom in such a key element of the gospels..","date":"2014-11-04","mins":"1:42 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-168712","author":"eric","post":"If that is the case, surely there are other examples. Can you provide them?.","date":"2014-11-04","mins":"5:53 pm","url":"https://shroudstory.com/2014/11/03/the-holkham-bible-recently-much-mentioned/","cat":"books","title":"The Holkham Bible Recently Much Mentioned"},{"id":"comment-163724","author":"eric","post":"So… The remaining letters are “H”x2. HH = His Holiness… The Pope! Who clearly knew of this code and the true identity of The Holy Grail. It all makes sense now!.","date":"2014-10-19","mins":"6:00 am","url":"https://shroudstory.com/2014/10/19/new-paper-the-lirey-toga/","cat":"paper_chase","title":"New Paper:  The Lirey Toga"},{"id":"comment-163755","author":"eric","post":"And THAT early in the morning to boost..","date":"2014-10-19","mins":"9:11 am","url":"https://shroudstory.com/2014/10/19/new-paper-the-lirey-toga/","cat":"paper_chase","title":"New Paper:  The Lirey Toga"},{"id":"comment-170871","author":"eric","post":"Jacobovici with another dubious “Biblical” find… He sure is becoming a poor man’s Ron Wyatt..","date":"2014-11-12","mins":"2:03 pm","url":"https://shroudstory.com/2014/11/12/utter-hogwash/","cat":"books","title":"Utter hogwash"},{"id":"comment-163846","author":"eric","post":"Fair enough..","date":"2014-10-19","mins":"5:25 pm","url":"https://shroudstory.com/2014/10/19/new-paper-the-lirey-toga/","cat":"paper_chase","title":"New Paper:  The Lirey Toga"},{"id":"comment-164169","author":"eric","post":"It seems that we can agree after all..","date":"2014-10-20","mins":"8:36 pm","url":"https://shroudstory.com/2014/10/19/new-paper-the-lirey-toga/","cat":"paper_chase","title":"New Paper:  The Lirey Toga"}]
