[{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"It saddens me how most people look for the “reasons” behind Akianes and Coltons visions/truths. Instead of trying to ‘make sense’ of it and bring it into black and white for our own worldly minds, try asking Him to show you Himself and make sure your heart is open. Jesus doesn’t want to be kept a secret from you. He also doesn’t want, or is able, to bring confusion. I think the deeper issue here is not what Jesus looks like in the flesh, but what He looks like in your heart. We’ll all know soon enough if these children of God were right. I personally believe them, but if I had never seen a picture of Jesus, I would know He looks like love.\n\n","date":"April 13, 2011 at 10:22 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-2884","author":"Stephanie","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"I agree with you completely! I just finished reading Heaven is for Real, and it has solidified my faith even more. We will eventually see Jesus, God and heaven for ourselves. Until then, we must keep our hearts open to Him!\n\n","date":"May 10, 2011 at 8:50 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-3109","author":"kelly","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"I think the negative comments come because of fear and disbelief, it messes with what they believe or not believe. Why is it so difficult to think of the Lord with an updated haircut, lol, Heaven is the most updated place in this world. Why do we keep Jesus’ image way back to 2000 years ago. Makes me smile that we think Heaven is an old place, to me HEAVEN  will be the most amazing updated place to be one day, for those who believe in the Lord Jesus, the Son of God.. hey smile God loves you!!!\n\n","date":"November 2, 2011 at 8:39 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-4516","author":"Brenda K Detwiler Worgul","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"Beautifully said. Amen ! ! ! ! ! ! !  1 Corinthians 13:1-13\n\n","date":"August 2, 2012 at 10:57 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-14433","author":"Trish","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"Nicely said.\n\n","date":"April 16, 2011 at 10:13 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-2909","author":"Tammy Bond","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"Maybe that is how Jesus has always looked in Heaven and had different hair here because of the times and culture He lived in on earth.\n\n","date":"April 30, 2012 at 1:06 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-10983","author":"Teriann","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"That makes sense, Jesus’ hair length on earth was according to the culture of the time.\nMore books about heaven:\n My Time In Heaven, by Richard Sigmund, and   Six Big,Big, Big Angels, by Mary Jo Pennington.\n\n","date":"April 30, 2012 at 8:44 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-10992","author":"Cathy B.","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"HA!  There ya GO Teriann!  Someone thinking outside the box good job!  \nI have no trouble believing in Christ, God the Father, Son & Holy Spirit (the Trinity) Heaven, Hell & “you know who”, the Bible being the perfect complete Living Word of God, any of it, & I owe that FIRST to God’s Grace, & also to the fact God placed me into a Christian family where I was Baptized & raised as a Missouri Synod Lutheran (not to brag but just to be factual here) & that one day when I was 8 & while under extreme distress, had an out of body experience which I didn’t fully understand until I grew up.  I had not told anyone about it because of the continued stress I had lived with for years, but God set me free from all that as an adult & then I was able to speak of it… I never forgot about it, I just didn’t talk to anyone about it.  Back then there wasn’t any talk about that sort of thing, certainly not in MY home & not on any TV shows at that time.  What I experienced had no references I could even relate it to, nothing until I became an adult & could find the words to fully explain it.  NOW when I hear about people’s out of body experiences I feel SOOOO fantastic & happy & it makes me cry, so many emotions because finally what I went through has a name & a reasoning to it.. MAN you have no idea how GOOD it feels to know it wasn’t some crazy imagined moment even though all your life you can recount it like it was yesterday & KNOW in your flesh and your heart that, without any doubt, it was REAL.\nWhen your soul leaves your body YOU KNOW IT & it’s the return to your body that REALLY makes it clear you’ve left in the first place… so when someone speaks about the afterlife, or an out of body experience I KNOW what they are talking about and am so happy to know they have been given a rare and gracious gift!  I’ve been on the other side (of my body only) before & I thank God for that.  In trying to understand why God let my soul leave my body, I thought, maybe, although God knew I would be raised in a Christian home with a Christian education, maybe something would have threatened my belief down the road & so God gave me that experience to reassure me during the bad times, or maybe He was just allowing me that experience to protect me from the extreme pain of the attack I was going through, I don’t know right now, but one day I will have complete understanding & if that’s after I die, fine.  I don’t NEED to know the reasons why. I feel God’s LOVE every time I think of it and I know He took good care of me during the most traumatic time in my young life.  I can hardly wait to run up to Him in Heaven, fall at His feet & praise Him eternally for His Gracious LOVE & mercy!  NEVER DOUBT that God is Real and He LOVES us and cares about YOU.  NEVER never doubt it.  If you don’t know God just ask Him to open your heart, tell him you’re sorry for your sins, He will forgive anything a sincere and contrite heart confesses!  He KNOWS your heart and every fear and burden you suffer with.  God will bless you.  God loves you, Jesus loves you and I do too.  And you know what else?  You have thousands of souls just out of your human vision who love you too and only want you to receive all the heavenly gifts of the faithful and blessed who have already crossed over.  You are never alone.  And yes, that’s a good thing<3<3<3\nAnd that is why I am so glad to have an artist's rendering from someone who probably has SEEN Jesus \"face to face\".  It is truly beautiful and gives me so much comfort to see it.  I use to feel so bummed over God not speaking from the burning bush like back in the day, but now, we here in these times have other opportunities to \"see the face of God\", just don't write them off as fantasy or some malfunction of the human brain during some physical/medical event.  God is right behind you dear and IS invested in all the petty and little things in your life, so don't tell yourself otherwise… why would you want to? \nSorry I took up so much space, I felt overwhelmed.. never posted anything about this issue before (afraid to) and I'm getting too old to die without sharing the truth with others… maybe I'm suppose to?  God Bless you dear brothers and sisters<3<3<3\n\n","date":"October 19, 2012 at 12:59 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-17847","author":"Kandy J","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"Akiane didn’t have a vision of Jesus Christ. According to her, she’d been looking for a model for the face of Jesus for about a year until she finally locked herself in a room and prayed to God to reavel to her what he looks like. Next morning a guy kocked her door and said “someone” had told him she was looking for a model.\nShe either totally making this up or it’s the truth…\n\n","date":"April 18, 2011 at 9:53 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-2938","author":"César","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"to Cesar: Akiane did not pray to God to show her what Jesus looked like. She had already seen Jesus many times. Akiane prayed to God for a model that matched the real Jesus that she saw while in Heaven. She stood on street corners, searched in malls, etc, for a long time, then gave up because none of them was the same. When the family finally prayed and asked God to send them the right model, he showed up the next day at their door. No one had told him she was looking for a model. He was looking for work, and was a carpenter.\n\n","date":"November 3, 2011 at 9:20 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-4545","author":"Cathy","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"Where can I get an 8×10 print of the picture of Jesus in the Heaven is for Real book that was painted by Akiane?\n\n","date":"May 30, 2011 at 1:17 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-3206","author":"Karaline Madigan","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"I would love to buy a print….several….for Christmas presents.  I gave the book last year as a gift, but I really want the picture.\n\n","date":"December 11, 2011 at 1:47 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-5438","author":"Barb Burlingame","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"from Art & SoulWorks – http://www.Art-SoulWorks.com\n\n","date":"August 24, 2012 at 3:45 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-15420","author":"Carol","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"Remeber akiane grew up in a house where there was no t.v., a house where everyone was athiest, so nothing of jesus had ever been heard much less a picture of him. Also akiane didn’t attend a school of any sorts. This insight offers an interesting view that may shed the light on the truthfulness of the painting and akiane’s visions… all of these can be found in Heaven is for real by Todd Burpo on page 143, chapter 27. Akiane’s mother is now a christian.\n\n","date":"June 3, 2011 at 2:35 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-3216","author":"arney","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"As someone with an artist’s eye, I think there’s a very strong resemblance between Akiane’s Jesus and the one by Ariel Aggemian.  I think the facial structure is VERY similar, it’s only the hair, beard and eyebrows that are different  – and hair is changeable of course. \nI like Akiane’s heavy brows, it gives Jesus more of a rugged look. Akiane’s nose is straighter but it’s also not very realistic, I’ve thought for awhile that the nose is the only thing in the picture that’s not quite perfect, and if the nose was perfect too I wouldn’t believe that an 8 year old did it because the painting is just too sophisticated for such a young girl. When I looked at other pictures Akiane did when she was eight, none of them were up to this level, which makes me believe there is more of “inspiration” in that particular painting.  \nAriel Aggemian’s Jesus has the better nose. Akiane got the proportions right but not quite the shape of it. Akiane’s bold modern colors and modern haircut make Jesus look more handsome, but Ariel Aggemian’s Jesus would look just as good if he went to the barber first. :)\n\n","date":"June 24, 2011 at 12:01 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-3262","author":"AnnieCee","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"i just finished the book heaven is for real, i loved it, i have always believed myself to be christian but fell i may have been wrong. one of the things colton drives his parents nuts with is “jesus loves the childern”, i want to do more for the childern in my commuity but dont know what, i must not be listening\ni am beyond happy to hear i will see my parents again when i go to heaven as they are both really sick and it clams me to know i will see them again\n\n","date":"July 4, 2011 at 3:20 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-3314","author":"julie","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"The book was awesome.  I am not a big reader, yet I could not put the book down.  Being a Catholic who was married to a Baptist, I could relate to the views of a Baptist, as well as the views of a Catholic.  I believe that Colton actually did see heaven and his comments were as the bible explains.  I think God allows such miracles to give the world proof that heaven is for real and who better to reveal heaven to than a child whose innocence makes it even more of a miracle; if told by a preacher it would not be as miraculous because he knows the bible an innocent child speaks only of what he experienced as seen through a child’s eyes.  In a world  who is in war, drugs surrounding our youth and unemployment at an all time high, I think the world could use a miracle, many miracles especially from the innocence of a child.  And the bible truly says we must become like children to enter the gates of heaven.\n\n","date":"July 8, 2011 at 7:03 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-3328","author":"Sandra Morbit","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"Heaven is for real is a very inspiational book I lost my niece 10 months ago and it ment a lot to me to re-affirm what I always believed.\n\n","date":"July 10, 2011 at 1:50 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-3336","author":"cecy","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"Heaven is for real is absolutely wonderful!  I finished it in less than a day and I’m not that big of a reader.  I have always been a Christian with my faith and beliefs and reading this book makes me all the more sure of my faith.  It’s a wonderful book and I feel everyone should read it and I thank the Burpos for sharing their story!  God Bless!\n\n","date":"August 7, 2011 at 5:21 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-3531","author":"stephanie","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"I recently finished the book Heaven is for real,and its amazing! I love this book and im recommending it to my friends. This book strenghened my faith. When i finished the book I looked up Akiane’s picture and its wonderful!\n\n","date":"September 1, 2011 at 5:20 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-3761","author":"Sarah","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"These children are the messengers of God the Father. The messages are to give strength, hope and power to fight the evil that will rise up and try to take us into the dark fold. This is a message to be brave and BELIEVE. God is the winner\n\n","date":"September 17, 2011 at 7:21 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-3927","author":"Barbara B. Zagona","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"jesus loves the little children!!!!!\n\n","date":"September 19, 2011 at 10:13 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-3945","author":"Beverly Rose","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"The Bible says:  In the mouth of two or three witnesses the truth shall be established, well so far I would say we have Akaine (1) Colton (2) and Likeness to Shroud of Turin (3). The Truth is established, and Jesus is The Way the Truth and The Life – no man comes to the but through Jesus – remember Colton’s horrific outburst at his first funeral after vsisiting heaven?   Asking loudly, passionately wondering whether or not the deceased had Jesus in his heart?  He had to have Jesus in his heart Colton kept exclaiming in order to enter in to heaven.\n\n","date":"October 9, 2011 at 3:44 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-4148","author":"AndyDoc","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"In John 14:6 Jesus said to Thomas: “I am The Way, TheTruth, and The Life, No one comes to the Father except through Me.”\n\n","date":"October 9, 2011 at 3:54 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-4149","author":"AndyDoc","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"I, too, just finished reading this wonderful book.  It made me feel even more anxious to go to heaven.  I’ve had a couple of life-threatening health emergencies  in the last 4 years during which I was afraid to die – first a stroke, then where I was short of breath and diagnosed with COPD, but now, thanks to Colton, I won’t fear it when the time really does come.\nI also miscarried a couple of babies, and I’m delighted to think that I may know them in heaven.  I’ve never even known their gender.   I only birthed one child, a son after the miscarriages, and he has also always wondered about the siblings he might have had.\n\n","date":"October 10, 2011 at 6:55 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-4166","author":"Sandy Medlock","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"I believe that Akiane really did have a vision of Jesus.  This picture witness in my heart that this is what Jesus looks like. I don’t see any resembles in the other pictures looking like what she painted.  The other pictures paint Jesus as a very gloomy person when He was a man of life and joy. I would never had picture Him to look like this.  It just looks like someone I would wait on at Walmart and I believe that Jesus look just like the normal guy walking the streets which shows how much He loved us to be come one of us.  He didn’t come into this world to be handsome, rich and famous but to be an average, normal guy to relate to us common folks and to me this is handsome.  People like to explain miracles away because they just have a hard time believing in the supernatural. This modern world is full of doubting Thomas who can’t believe on less they see it too but Jesus said it is more bless to believe then to see.  What is so sad is even in this modern world people wouldn’t believe even if Jesus did appear to them because their minds are so blind. The modern world has made make believe to be so real that if a real T-Rex came a live people would even explain it away as just being a robot running down the street.  Holly Wood can just make about any thing look real on the screen why should we believe our eyes.  It takes the Holy Spirit living in side someone to discern the real from the fake.\n\n","date":"October 19, 2011 at 10:24 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-4227","author":"Pamela Susette","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"I just read ” Heaven is Real”, the first book I have read in many years. I did not want to stop when it was time to go to bed. I finished it the next day, reading instead of watching my favorite past time, “Football”. The book was fabulous, Colton had to have seen what he said he saw to be so emphatic about Jesus loving the little children. I have always tried to be a Christian but failed to meet the test several times. This book is strong evidence that Heaven,  God and Jesus does exist.\n\n","date":"October 30, 2011 at 7:36 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-4452","author":"A. E. Claar","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"I have just finished reading this book and I agree with many of you that it has strengthen my faith and what I have always thought about heaven. I lost a son when he was 10 and I know he is one of the angles. i just hope that more people will read this and just maybe become believers!  C Tosch\n\n","date":"December 30, 2011 at 12:16 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-6276","author":"Cheryl Tosch","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"I just finished reading Heaven is for real I would recomment this book to anyone, but especially those who is in doubt that there is a heaven.\n\n","date":"February 11, 2012 at 5:34 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-8150","author":"Cindy","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"I myself have just finished the book “Heaven is for Real” and I loved it. I have been talking about it all week. I’m excited to share it with friends and family. My Faith is strengthning. thank u Jesus for loving us I give u praise. We love u Father God.\n\n","date":"March 14, 2012 at 9:26 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-9330","author":"yvette smith","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"I read Heaven is for Real a few months ago and then watched The Real Face of Jesus on the History channel. I wanted to compare the two images and found this article very interesting!\n\n","date":"April 6, 2012 at 11:26 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-10038","author":"Jaclyn Nowlin-Goode","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"i also read heaven is for real book and it was very intersting..i can now picture out the glimpse of heaven in my imagination..\n\n","date":"September 25, 2012 at 9:29 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-16917","author":"jhonslee","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"Where can I get a print ofAkiane’s Prince of\nPeace?\n\n","date":"February 9, 2013 at 3:30 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-23884","author":"Paul Finan","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"i truely believe that heaven is for real. i believe i believe i believe\n\n","date":"February 28, 2013 at 4:22 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-25967","author":"peggy herrera","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"Oh well, human been are at fully maturity around 25 years old, Akiane’s vision of Jesus is around that age, relieved not crossed. That’s to say, surrender to a rinse for a relief.\nMaturity  means “fruit”. Just “simply” take it. Don’t you?\n\n","date":"March 19, 2013 at 10:30 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-27791","author":"Jerry Yen","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"She is truly a gift from god!\n\n","date":"September 17, 2013 at 11:26 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-44575","author":"anthony w miller-hill","site":"shroudstory"},{"title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud","post":"It amazes me as believers we read what happened in the bible yet doubt god being able to still do miracles today, yes we are to test (try) the spirits but isn’t he still the same today, thank you lord for my healing physically and more important spiritually\n\n","date":"March 26, 2014 at 11:32 am","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","id":"comment-93498","author":"Jeff hair","site":"shroudstory"}]
