[{"title":"Near Death Experiences and the Shroud of Turin?","post":"I hate to keep citing the same video clip but I think Hameroff’s discourse on the quantum processes that constitute our consciousness and their potential relationship to Near Death Experiences (NDE) is instructive and I expect for many (like me) a break through in understanding. http://vimeo.com/39982578.\nMy only addition (and I have discovered not necessarily original) is that love is in the nature of a quantum entanglement between two conscious entities.\nNow for the real speculation, not entirely out of thin air. Christ is in fact the mediator between our consciousness and the primordial consciousness from which our existence sprung. All who truly love entangle themselves with the creator.\nI caution those who rely too heavily on theology divorced from science. The original scientists were the ancient priests and ancient societies were in many ways ruled by their “priests.” I might suggest the Maya, the Egyptians and stone age culture that survive today where the witchcraft and the shaman are the ultimate authority.\nI believe in my first year of catechism lessons, it might have even been the first one (I was seven) I was instructed that God exists eternally in place separate from our existence that we can never really understand Him. Having taught me at age seven that the divine is inscrutable, the Church has spent my last 69 years explaining God to me. I have a problem with that I guess.\nIn a previous post I referred to the quantum as the “fingerprint” of God. That was written in haste. What I believe is that the quantum is the “interface” with the primordial consciousness we call God. The Shroud is His fingerprint.\n\n","date":"July 26, 2013 at 6:55 am","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39775","author":"John Klotz","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"All I can say about that is what I said recently in another post : I talk recently about that with a very spiritual cistercian monk and he said that, in his mind, these experiences were still very far from the reality we will experiment in God’s Kingdom and he had a pretty good argument to say this: If these experiences were exactly like the reality we will experiment in the Kingdom of Love, these people would never come back to Earth! In other word, for Father Yves Girard, these near death experiences are something like visiting the vestibule of eternity; a place which is still far from God’s Kingdom. I agree with him.\n\n","date":"July 26, 2013 at 8:28 am","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39779","author":"Yannick Clément","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"So, in the eyes of Father Yves Girard in Québec (and in my eyes too), what people see in a near death experience, even though it is very often fabulous, is still very far away from what we will experiment when we will enter into God’s Kingdom!\n\n","date":"July 26, 2013 at 8:29 am","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39780","author":"Yannick Clément","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"Yannick wrote:\n“In other word, for Father Yves Girard, these near death experiences are something like visiting the vestibule of eternity; a place which is still far from God’s Kingdom.” \nI agree. That’s a good way of putting it.\n\n","date":"July 26, 2013 at 6:31 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39804","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"I truly believe Father Yves’ vision concerning NDEs is the best way to look at these post-mortem events.  His argument concerning the fact that these persons would never come back on Earth if they had entered into God’s Kingdom is hard to dismiss.\n\n","date":"July 27, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39871","author":"Yannick Clément","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"Esquire magazine recently ran a story that’s critical of some of Eben Alexander’s claims about his alleged near-death experience. See here for a summary.\n\n","date":"July 26, 2013 at 5:52 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39799","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"I think that the people who return back to their body after their NDE have no choice, they are told that their mission has not been completed and they have more work to do , many of them have really fought and complained that they did not want to return, but it was not their decision to make God made it for them!\n\n","date":"January 17, 2014 at 4:36 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-73560","author":"Rod walton","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"well, I would not take Esquire article as a highest authority as I would not a personal opinion of any particular priest. Thee have been a lot of studies done on the issue and the real experiences ( neurosurgeon’s do not fit) – when the person is in clinical death stage – have demosbtrated some very interesting details.\n\n","date":"July 26, 2013 at 6:06 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39800","author":"jesterof","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"jesterof,\nI agree that the Esquire article isn’t enough of a basis for dismissing NDEs in general. My only intention was to address Eben Alexander’s case in particular.\n\n","date":"July 26, 2013 at 6:27 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39803","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"The best resource I’m aware of on near-death experiences (NDEs) is The Handbook Of Near-Death Experiences (Santa Barbara, California: Praeger Publishers, 2009). It’s edited and authored by Bruce Greyson, Janice Holden, and some of the other foremost near-death researchers in the world. It goes into a lot of depth and approaches the subject from many angles.\nMy view is that NDEs are something like supernatural dreams. Other people compare them to virtual reality. What’s important to understand is that there’s both an objective and a subjective factor to them that needs to be explained simultaneously. If anybody is interested, here’s a series of articles I’ve written on the subject over the last few years. \nKeep in mind that not all NDEs are positive (heavenly). Nancy Evans Bush, probably the leading researcher in the world today on negative (hellish) NDEs, places the portion of reported NDEs that are negative at seventeen percent. Given how reluctant people often are to talk about negative NDEs, the actual percentage is likely significantly higher. \nIn addition to heavenly and hellish NDEs, there are some that have elements of each. An NDE starts out negative in some manner, then becomes positive. Or the reverse happens. Or a negative element interrupts an otherwise positive experience. Sometimes one individual will have multiple NDEs, and there will be a combination of positive and negative experiences. And some could be called neutral in the sense that they don’t involve an arrival at anything like Heaven or Hell.\nThere are shared death experiences (SDEs) as well. Multiple people share an experience.\nNDEs (and SDEs) widely contradict each other. They don’t just differ in religious content, but also in other ways. For example, they differ in whether there’s a judgment (or life review, etc.) and the nature of the judgment if there is one. A recent study of the deathbed experiences of felons (unrepentant murderers, rapists, etc.) found all of them having positive experiences. By contrast, people who are good by common human standards often have negative NDEs. It’s important to realize that, despite common perceptions to the contrary, the nature of NDEs does not correspond with the character of the people who experience them. If you think everybody or almost everybody goes to Heaven, or that you just need to meet some common standard of goodness to get there, NDEs do not confirm such a view.\nThe best source for information on the afterlife remains the Bible. We can gain some information from NDEs. They are supernatural, and they do serve as evidence of an afterlife. But they’re also highly subjective and inconsistent. Again, I think it’s helpful to look at them as something like a supernatural dream or supernatural virtual reality.\n\n","date":"July 26, 2013 at 6:24 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39802","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"I want to correct something I remembered wrongly. In the study of the death experiences of felons, there was one who had a negative experience. You can read an article about the study here.\n\n","date":"July 26, 2013 at 6:48 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39806","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"I apologize, but I need to correct something else. The right link for my series of articles on NDEs is here.\n\n","date":"July 26, 2013 at 6:59 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39807","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"\nJason Engwer :\nI want to correct something I remembered wrongly. In the study of the death experiences of felons, there was one who had a negative experience. You can read an article\nabout the study here.\n\nExcept that these inmate studies were NOT standard NDEs – when a person experiences DEATH and then is being resuscitated and is “coming back” .Neither of the felons “came back” – they ALL died and the experiences described can not be compared to the NDEs per se – since they were alive and able to communicate with their caregivers.what and whom they see BEFORE death.\nSo we actually do not know what kind of experience they have had – negative or positive, because they were at the gate, not pass it.\n============\nThanks, Jason, for the links.\n\n","date":"July 26, 2013 at 8:18 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39811","author":"jesterof","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"jesterof wrote:\n“Except that these inmate studies were NOT standard NDEs” \nAnd I didn’t call them NDEs. But they’re closely related.\nYou refer to “when a person experiences DEATH”. But the definition of death is disputed, and NDEs occur under a wide variety of circumstances. For example, they sometimes occur when death is being anticipated, but prior to the event that’s expected to cause it (e.g. a falling person leaving his body and seeing it fall before it hits the ground). Or they occur during the normal course of surgery, when the body is shut down in some way, but the person is expected to survive. To cite one study mentioned in the book by Greyson, et al. that I referenced above, “Whereas 82.5 percent of persons having the NDE believed they had been near death, medical records confirmed their claims in only 45 percent of cases.” (27-28) And having been “near death” isn’t the same as having died.\nThe study of felons that I cited is noteworthy because of the involvement of felons. They’re a class of people who tend to have low moral character. But the same type of result (the nature of the experience not corresponding with the moral character of the experiencer) has been demonstrated in NDEs as well. Even if we were to set aside the felons study for the sake of argument, the same conclusion would remain. You can be a good person by common human standards, yet have a negative NDE. You can be a bad person by common standards, yet have a positive NDE. It happens frequently. And some of the NDEs are mixed (partly good and partly bad) or neutral in some significant way.\n\n","date":"July 26, 2013 at 10:57 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39818","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"\nJason Engwer :\njesterof wrote:\n“Except that these inmate studies were NOT standard NDEs” \nAnd I didn’t call them NDEs. But they’re closely related.\nYou refer to “when a person experiences DEATH”. But the definition of death is disputed, and NDEs occur under a wide variety of circumstances. For example, they sometimes occur when death is being anticipated, but prior to the event that’s expected to cause it (e.g. a falling person leaving his body and seeing it fall before it hits the ground). Or they occur during the normal course of surgery, when the body is shut down in some way, but the person is expected to survive. To cite one study mentioned in the book by Greyson, et al. that I referenced above, “Whereas 82.5 percent of persons having the NDE believed they had been near death, medical records confirmed their claims in only 45 percent of cases.” (27-28) And having been “near death” isn’t the same as having died.\nThe study of felons that I cited is noteworthy because of the involvement of felons. They’re a class of people who tend to have low moral character. But the same type of result (the nature of the experience not corresponding with the moral character of the experiencer) has been demonstrated in NDEs as well. Even if we were to set aside the felons study for the sake of argument, the same conclusion would remain. You can be a good person by common human standards, yet have a negative NDE. You can be a bad person by common standards, yet have a positive NDE. It happens frequently. And some of the NDEs are mixed (partly good and partly bad) or neutral in some significant way.\n\nIf the person is not in clinical death stage I find it hard to relate his/her experience as connected to death – deep coma but with heart beating and perfusing is physiologically totally different state than clinical death( that is why I do not include Dr.Alexander’s experience as the most valid of NDEs). The European studies on NDEs excluded the experiences of other situations, except the valid clinical death – to cut off possible accusations of possible confounding bias – and rightfully so,\nDeath visions BEFORE actual death are not even close to described NDEs – at least not those in the link to the study you have provided – in terms of actual basic conditions they have to meet.\nSeeing relatives and experiencing calm is a common note, but it is not the same as the core elements of the classic features of NDEs – leaving one’s body, going through a tunnel, floating and so on.\nDeathbed visions do not have the experience of LEAVING THE BODY – and that is a fundamental difference, in my opinion.\n\n","date":"July 27, 2013 at 10:42 am","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39855","author":"jesterof","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"jesterof wrote:\n“Death visions BEFORE actual death are not even close to described NDEs – at least not those in the link to the study you have provided – in terms of actual basic conditions they have to meet.” \nI cited a book by some of the foremost near-death researchers in the world, which discusses many cases that are inconsistent with your standards. I also linked an article by Nancy Evans Bush, a prominent researcher in the field. In that article, she makes the same sort of comment I’ve made about similarities between deathbed visions and NDEs:\n“So far as anyone knows, deathbed visions differ from near-death experiences only in the fact that their experiencers don’t come back afterwards. Otherwise, the descriptions are virtually identical.”\nIf you read the book by Greyson, et al. that I cited earlier, you’ll see that NDEs occur under a wide variety of circumstances. And their contents differ widely. For example, tunnels (one of the features you mentioned) are common in NDEs in some parts of the world and among some groups, but not elsewhere. Researchers don’t exclude an experience just because it doesn’t have a tunnel or some of the other features you mentioned. You may disagree with the NDE standards that are commonly accepted in the field, but those are the standards.\nRemember, the definition of death is itself a disputed issue. For that and other reasons, it makes sense for researchers (and the rest of us) to define NDEs broadly. For example, if a person describes events that occurred far away from his body, events he shouldn’t have known about through his normal bodily senses, then objecting that the person didn’t experience “clinical death” is an insufficient response. In other words, evidence of the paranormal can be present without death having occurred. Even if we limit ourselves to a consideration of the afterlife (not something like the paranormal or religious miracles more broadly), which Dan didn’t do in his original post, there can be implications for the afterlife in NDEs that don’t meet your standard. An NDE can serve as evidence for the existence of the soul, evidence for how a soul would operate outside of a body, etc. without having the criteria you’ve laid out.\nAnd it’s not as though we should expect God to decide what to do in people’s lives based on whether a human definition of clinical death has been met. If God knows that the person will ultimately return to normal human life, then he may withhold any experience of the afterlife from that person. In that sense, there aren’t any NDEs that qualify as experiences of the afterlife. Everybody involved comes back. The clinical death criterion that you’re focusing on has some value, but it has to be qualified by factors like what I’ve outlined above. And NDEs that don’t meet the clinical death criterion still have some significance.\n\n","date":"July 27, 2013 at 1:49 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39861","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"those are THEIR personal IMHOs, nothing more. Not all the reasearchers define NDEs broadly – and some define them ONLY as experienced during clinical death stage.\nI agree with exactly this definition – NDEs are NDEs if they are experienced after clinicla death only.\nThe link to Ms. Bush I have read. And the felon study is described there.\nIt has nothing to do with NDE – neither of the felons experienced NDE, but a near-death visions and obviously, those can have some resembling features, but they can not be equated to NDEs as they are a different category whatsoever.\nThe importance of this understanding this distinction is necessary to not be tempted to base the conclusion made earlier, that negativity of the NDEs is not connected to the person experiencing it.\nFelon study about deathbed visions absolutely can not be considered as a proof of this assumption since deathbed vision in no way are equal to NDEs.\nThe basic difference between NDEs and deathbed visions is the crossing line – ones are BEFORE it and the others – AFTER it.\nApples and oranges.\nDefinition of death is not a disputed issue. TIMELINE is.\n\n","date":"July 27, 2013 at 2:26 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39862","author":"jesterof","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"The reason I am against lumping together into NDEs group everything, without clear-cut distinctions is the necessity to exclude the confounding bias in explanations of the possibility of those phenomena.\nIf one wants to cut off all the possible dismissal from the skeptics on a base of hallucinations of the oxygen-depraved brain, or any other interference from a severely impaired physiology, one has to delineate the parameters as uniform, as possible.\nTherefore the absence of perfusable heart rhythm, absence of blood pressure and therefore clinical death and total cessation of blood supply to the brain is the most narrow and possibly pure ( from the unbiased point of view of the researcher) as possible.\nEven CPR performed at this particular time kind of clouds it, but if that won’t be performed, we won’t hear about experience :-)\nThe best example of real NDE during the real death picture ( and no CPR) is described by the case of Pam Reynolds\nhttp://www.salon.com/2012/04/21/near_death_explained/singleton/\n\n","date":"July 27, 2013 at 2:41 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39863","author":"jesterof","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"jesterof,\nYou’re referring to “some” researchers you don’t name. By contrast, I’ve cited one of the standard books in the field, to which some of the leading researchers contributed. Similarly, see the broad definition of NDEs found at the IANDS web site here.\nI didn’t “equate” deathbed visions and NDEs. I said they’re closely related.\nYou tell us, “Definition of death is not a disputed issue. TIMELINE is.” The timeline is part of the definition.\nYou say that you’re “against lumping together into NDEs group everything, without clear-cut distinctions”. I haven’t suggested that we shouldn’t make clear distinctions. But there’s no reason for you to expect me and other people to single out the one category of NDEs that you’ve singled out and only discuss that category.\nYou tell us what we should do “If one wants to cut off all the possible dismissal from the skeptics”. We don’t need clinical death in order to demonstrate that skeptical explanations are unlikely. I’ve already explained some of the reasons why. Paranormal phenomena can be present without clinical death having occurred. We don’t need clinical death in order to judge that a skeptical scenario is improbable. For example, if a person’s brain is operating at a low level, yet a person had a high level of perception during his NDE, the fact that the person wasn’t clinically dead doesn’t explain why he had such a high level of perception during the NDE. The skeptic still has some explaining to do.\nYou go on to refer to “pure” standards and how CPR “kind of clouds” our judgment. You seem to be setting the bar too high. All we need is a probability. Even if it’s just a slight probability, that’s enough. We’d prefer to have a higher level of probability, but a preference isn’t equivalent to a necessity. If there seems to be a probability that an NDE is paranormal, but a skeptic isn’t convinced by it, then so much the worse for the skeptic. He’s not our measuring stick.\nI agree that the Pam Reynolds case is significant. For those who don’t know much about NDEs, that case is a good one to start with. A lot of the popular ones are of a much less evidential nature.\n\n","date":"July 27, 2013 at 7:20 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39879","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"To me the importance of NDE is elemental and simple: the human consciousness (I’ll call it the soul) has the capability to operate independent of the normal constraints of space and time. Hameroff defined it in terms of “uploading” consciousness to the quantum information which pervades existence and upon recovery, the consciousness being retrieved (downloaded) Kind of like cloud computing.\nThose are very rough analogies and extraordinary speculations. But the NDE experiences lend to support. I really hope that “People of Faith” don’t get too hung-up demanding that the reality MUST correspond to their faith and reject the intrusion of science into areas they have reserved for the faith.\nThere was priest who has since passed away who was close to our family. In discussing he evolution-creationist struggle, I remarked to him that the creationist who dismiss evolution unless it is consciously directed deny the primordial consciousness (God) the great glory that is his due. He agreed. We function according to laws that we hardly understand. The increasingly accelerated advance of science into the “quantum enigmas” does not make God its adversary. Instead, it is a Te Deum of intricate beauty and complexity.\n\n","date":"July 27, 2013 at 4:07 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39866","author":"John Klotz","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"\nJason Engwer :\njesterof,\nYou’re referring to “some” researchers you don’t name.\n\nI named her – it was YOUR link on Ms. Bush.\nThe other one is Pim van Lommel  who, as far as I’ve read was the only one who conducted the real prospective study with statistical analysis, not just a questionnaire.And his was the one which included after-clinical death experiences only.\nStudies differ on their design and, therefore, VALIDITY.\nIt is difficult to conduct and experiment-based study on such matters, so the studies on NDEs are by definition are going to be observational, which also differ in their validity.\nNarrowing the criteria of the samples observes elevates the validity of the study, therefore lumping deathbed experiences of those who did not yet die( but later did and never returned) and those who experienced NDE during variety of clinical scenarios ( already a huge obstacle to the validity component) and the returned is a highly questionable approach from a scientific point of view.\n\n","date":"July 27, 2013 at 10:00 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39888","author":"jesterof","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"jesterof wrote:\n“I named her – it was YOUR link on Ms. Bush.\nThe other one is Pim van Lommel” \nEven if we assumed that both of those researchers were following the standards you’re suggesting, they’d still be far outnumbered by the other researchers I cited.\nBut nothing in the article by Nancy Evans Bush, which I linked above, suggests that she disagrees with what I said. She was a contributor to the book I cited by Greyson, et al. She served as president of IANDS in the past, the organization whose web site I linked above. And I quoted her comments on the relationship between NDEs and deathbed visions. She cited the felon study and related it to NDEs.\nAnd you can’t conclude that because Pim van Lommel conducted a study in a particular way, then he must deny that any experience that occurs under other circumstances is an NDE. Nor can you conclude that he’d deny that other NDEs have any relevance to a discussion like the one that’s occurring in this thread. If you want to cite van Lommel in support of your position, you’ll need more than what you’ve asserted above, and you’ll need to provide documentation for it.\nHere’s part of what van Lommel and his colleagues say about NDEs in their study results published in 2001:\n“NDE are reported in many circumstances: cardiac arrest in myocardial infarction (clinical death), shock in postpartum loss of blood or in perioperative complications, septic or anaphylactic shock, electrocution, coma resulting from traumatic brain damage, intracerebral haemorrhage or cerebral infarction, attempted suicide, near-drowning or asphyxia, and apnoea. Such experiences are also reported by patients with serious but not immediately life-threatening diseases, in those with serious depression, or without clear cause in fully conscious people. Similar experiences to near-death ones can occur during the terminal phase of illness, and are called deathbed visions. Identical experiences to NDE, so-called fear-death experiences, are mainly reported after situations in which death seemed unavoidable: serious traffic accidents, mountaineering accidents, or isolation such as with shipwreck.”\nNotice that they not only disagree with you about the definition of NDEs, but also make comments about deathbed visions similar to my comments and those of Nancy Evans Bush. They applied narrower standards to the study they were conducting, but it doesn’t follow that they held the same view you do of any experience that doesn’t fall within those narrower standards. For example, if a researcher wanted to focus on NDEs among children, and thus only included children in a study he conducted, it wouldn’t’ follow that he thinks an experience involving an adult doesn’t qualify as an NDE.\n\n","date":"July 28, 2013 at 5:16 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39978","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"“And you can’t conclude that because Pim van Lommel conducted a study in a particular way, then he must deny that any experience that occurs under other circumstances is an NDE. Nor can you conclude that he’d deny that other NDEs have any relevance to a discussion like the one that’s occurring in this thread. If you want to cite van Lommel in support of your position, you’ll need more than what you’ve asserted above, and you’ll need to provide documentation for it.”\nGosh, I have not said I, personally, do not consider any other clinical situations to be causing NDEs, I have only said, that for the  discussion purposes with skeptics, it is better to have clear-cut parameters and clinical death would be better than the wide variety of scenarios.\nNeither did I make any assumptions what Pim van Lommel or others THINK on the matter.\nI am not Yannick, I do not need the researchers to THINK as I suppose :-)\nI am totally content with the data they present – it is enough for me.\n\n","date":"July 28, 2013 at 10:31 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39991","author":"jesterof","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"jesterof,\nYour first post in this thread refers to “the real experiences ( neurosurgeon’s do not fit) – when the person is in clinical death stage”. In later posts, you disputed my definition of NDEs and dismissed the sources I cited in support of it. You cited Evans Bush and van Lommel as examples of “some” researchers who define NDEs differently. Now that I’ve shown that those two researchers seem to have defined NDEs more broadly than you suggested, you’re acting as if you didn’t dispute the point. If you weren’t disputing the point, then you repeatedly miscommunicated your view in previous posts.\nYou then go on to distinguish between what researchers “think” and “the data they present”. Since I’ve cited comments they and their colleagues have written, I’m not just appealing to what they think, in the sense of what thoughts are in their minds. Rather, I’ve been citing the definitions they’ve put forth in published works.\n\n","date":"July 29, 2013 at 5:04 am","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-40016","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"Jason, I generally agree with most of your points.\nI do object, however, to the statement ( probably not yours, personally), that negative “hellish” experiences do not correlate with the nature of the person and for a proof of that statement  to provide the felon study of Ms. Bush – and that study is based exclusively on deathbed experiences of the felons in a maximum security prison.\nThis type of “proof” is false on many levels. First – those experiences are NOT the NDEs, I would rather call them Pre-death experiences, which obviously, ,involve supernatural phenomena but could not give us any valuable insight into the nature of post-death road for the people involved.\nAnother aspect in all of this ( in a perspective of absence of “hellish” experiences) – nobody actually researched the issue how many of the felons were actually real criminals, not a mistake of judicial system – and that might be a huge confounding bias if one wants to make an absence of negativity in pre-death experience by convicted felons as a proof of non-discerning nature of NDEs\n\n","date":"July 27, 2013 at 10:17 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39890","author":"jesterof","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"jesterof,\nAs I said earlier, Dan Porter’s original post in this thread doesn’t limit itself to people who were clinically dead, who went through a tunnel, and met all of the other criteria you’ve been suggesting. You keep expecting me to address a narrower topic than Dan suggested in his original post, a narrower topic I never claimed to be addressing.\nYour suggestion that the felons in the study cited by Evans Bush might have been falsely imprisoned is a weak objection. The vast majority of the felons had positive deathbed experiences. Are you going to suggest that there’s a 50/50 chance or a probability that all of them were innocent of the crimes they were imprisoned for? If so, why should we believe that? If not, then what are you suggesting? That perhaps most of them were falsely imprisoned? Again, why should we believe that? And if only most were falsely imprisoned, how do you explain the positive experiences among those who weren’t imprisoned falsely?\nYou object that the experiences are pre-death, but I’ve explained why NDEs that occur after clinical death are problematic as well. The experiencers haven’t died in the ultimate sense. If the afterlife is governed by God, he’d know who will return to life on earth and who won’t. He wouldn’t be dependent on a human definition of clinical death. Just as deathbed visions may not represent what happens after death in the ultimate sense of the term, the same may be true of NDEs (and I would argue that it is, indeed, true of NDEs).\nYour position on the relationship between the character of people who have NDEs and the nature of their experiences is ambiguous to me. I don’t know whether you’re only disputing the felon study I cited or you’re disputing my broader conclusion as well. Do you deny that NDEs sometimes don’t correspond to the character of the experiencer? If so, see pages 124-125 in the book by Greyson, et al. cited above. For example, there’s discussion of “a physically abusive prostitution solicitor (‘pimp’) who had a pleasurable NDE – and was subsequently reformed” and “an NDE that included the distressing element of an encounter with the devil – in a five-year-old boy with no atypical history of antisocial acts”. The authors of the chapter (Janice Holden, Jeffrey Long, B. Jason MacLurg) say that further research into this topic is needed, but conclude that “It appears not to be the case that ‘good’ people have pleasurable NDEs and ‘bad’ people have distressing NDEs.” Nancy Evans Bush has reached the same type of conclusion, as I’ve documented. And she had a negative NDE herself. From what I can tell, she wasn’t an unusually bad person at the time. I would say he same of other people whose negative NDE accounts I’ve read. Then there are the cases where an experiencer has multiple NDEs, both heavenly and hellish, without any corresponding change in character (ibid., 76). Or a person will have an NDE that starts negative, then becomes positive or vice versa (ibid.). For other examples of negative NDEs among children, including young ones, see pages 89 and 246.\n\n","date":"July 28, 2013 at 6:21 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39980","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"I am disputing only the assumptionthat the negative character( “hellish”) of the NDEs is not connected to the nature of the person experiencing it and the proof of this thesis to be a felon study.\nPre-death experience in no way can be a proof ( or rebuttal) for anything connected to NDEs – those are totally different experiences by clinical parameters, even if they have similar elements of perception or similar  paranormal occurrences.\nI do not dispute that there is no clear connection between the nature of the person and the character of their NDEs – but that has nothing to do with pre-death experiences in felon study by Evans Bush.\nIf I have misunderstood you ( and you did not make that statement and connection) – my apologies.Maybe I have misread you.\n Logically speaking one would assume that people with bad life history would experience hellish NDEs, and good ones – nice ones. But I do not know if that was in any manner addressed statistically.\n\n","date":"July 28, 2013 at 10:25 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39990","author":"jesterof","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"jesterof,\nI’ve demonstrated that many NDEs don’t involve clinical death, according to common definitions used by researchers in the field. Therefore, it’s insufficient for you to object to the citation of deathbed visions on the basis that they’re pre-death.\nYou write:\n“Logically speaking one would assume that people with bad life history would experience hellish NDEs, and good ones – nice ones.” \nWhether we’d expect such a correspondence depends on the nature of the experiences. For reasons I’ve explained, I consider NDEs roughly analogous to dreams or virtual reality. Under my view, I wouldn’t expect what you’re saying we should logically assume. Just as a good person can have nightmares, a good person can have a negative NDE. Just as a bad person can have a pleasant dream, a bad person can have a pleasant NDE.\nMaybe this issue is part of what’s motivating your disagreement with me. Do you consider NDEs to be a highly objective experience of the afterlife or some sort of highly objective foretaste of it?\n\n","date":"July 29, 2013 at 5:23 am","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-40018","author":"Jason Engwer","site":"shroudstory"},{"title":"Near Death Experiences and the Shroud of Turin?","post":"\nJason Engwer :\nYou go on to refer to “pure” standards and how CPR “kind of clouds” our judgment. You seem to be setting the bar too high. All we need is a probability. Even if it’s just a slight probability, that’s enough. We’d prefer to have a higher level of probability, but a preference isn’t equivalent to a necessity. If there seems to be a probability that an NDE is paranormal, but a skeptic isn’t convinced by it, then so much the worse for the skeptic. He’s not our measuring stick.\n\nYou do not need to convince ME. I agree.\nBut I always like to have facts ready against a skeptical opponent and cut off the weakest arguments in advance :-) \nPeace.\n\n","date":"July 27, 2013 at 10:19 pm","url":"https://shroudstory.com/2013/07/26/near-death-experiences-and-the-shroud-of-turin/","cat":"science_and_religion","id":"comment-39891","author":"jesterof","site":"shroudstory"}]
