[{"title":"RIP Christopher Hitchens","post":"An avowed atheist… that hurts, doesn’t it. Unbelievers don’t know the frustration that Christians feel, knowing how different it could have been. \nThe Bible says, “Precious in the sight of the Lord is the death of His saints.”  This verse makes me think that God Himself is on the other side of the chasm, waiting and anticipating each precious soul when it’s their time to die. He wants to see this transition for Himself, and be the first to welcome His spiritual children. People who have had near-death experiences often say that Jesus is there to meet them. What a relief to know this!\nBut… what if God wasn’t waiting for me? In fact, what if nobody was there. They say that hell is the absence of God. What if I died and I found myself unbelievably ALONE. And none of the comforts that God has so lavishly provided on this earth to provide for every need? \nI don’t  know if the typical description of hell is accurate. Some people say that the demons will torment us. How can that be right, when the demons will share in the same punishment that we do?  I wonder if each will suffer in torment alone, and without comfort, until the spiritual light goes out. \nJesus said, “Do not be afraid of those who kill the body but cannot kill the soul. Rather, be afraid of the One who can destroy both soul and body in hell.”  Spiritual death must be a far worse process than the kind of death we experience in our own flesh. \nAtheists want to believe that death is merely sleep and annihilation, but the Bible makes it clear that it’s not that easy. Not by any means. \nI do hope and pray that Mr. Hitchens made his peace with God in the past year.\n\n","date":"December 16, 2011 at 9:34 am","url":"https://shroudstory.com/2011/12/16/rip-christopher-hitchens/","cat":"news_&_views","id":"comment-5614","author":"AnnieCee","site":"shroudstory"},{"title":"RIP Christopher Hitchens","post":"Wikipedia already has his date of death and past tense phrasing. Amazing. Wikipedia has this to say about Christopher Hitchens: \nIdentified as a champion of the “New Atheism” movement, Hitchens described himself as an antitheist and a believer in the philosophical values of the Enlightenment. Hitchens said that a person “could be an atheist and wish that belief in god were correct,” but that “an antitheist, a term I’m trying to get into circulation, is someone who is relieved that there’s no evidence for such an assertion.”[17] He argued that the concept of god or a supreme being is a totalitarian belief that destroys individual freedom, and that free expression and scientific discovery should replace religion as a means of teaching ethics and defining human civilization. He wrote at length on atheism and the nature of religion in his 2007 book God Is Not Great.\n— I can’t help but wonder if Mr. Hitchens would like to add another chapter to his book, now.\n\n","date":"December 16, 2011 at 10:02 am","url":"https://shroudstory.com/2011/12/16/rip-christopher-hitchens/","cat":"news_&_views","id":"comment-5617","author":"AnnieCee","site":"shroudstory"},{"title":"RIP Christopher Hitchens","post":"Annie, I am unable to reconcile belief in a completely loving God with the belief that we must have been baptized, have confessed to some latest sin or accepted some formulaic belief to attain salvation. I think God knows the heart and mind and everyone. \n“Father, forgive them,” says the agonizing Christ, “for they know not what they do.” Those words resonate with my beliefs. This is where I think the church and especially my church, the Anglican Communion, doesn’t have it quite right. Oh, well, they have only had 2000 years to work on it. \nI didn’t like Hitchens’ highly aggressive antitheism. But he did argue for it out of what he believed was best for the world. I think he was wrong. But despite his insulting manner, I don’t think he wished or sought to do harm as he promulgated his worldview. I like to think he can still make peace with God and even if it is a struggle, he is hopefully with God — if indeed his heart was in the right place. I even sometimes think I like the Roman Catholic notion of purgatory for people like Hitchens. Should I light a candle for him?\nDan\n\n","date":"December 16, 2011 at 11:23 am","url":"https://shroudstory.com/2011/12/16/rip-christopher-hitchens/","cat":"news_&_views","id":"comment-5620","author":"episcopalian","site":"shroudstory"},{"title":"RIP Christopher Hitchens","post":"Better light 3 candles Dan! …I can just picture Hitchens debating ernestly with the Lord, on why he should allow him into heaven ;-)\nR\n\n","date":"December 17, 2011 at 3:33 am","url":"https://shroudstory.com/2011/12/16/rip-christopher-hitchens/","cat":"news_&_views","id":"comment-5639","author":"Ron","site":"shroudstory"},{"title":"RIP Christopher Hitchens","post":"“There are only two kinds of people in the end: those who say to God, ‘Thy will be done,’ and those to whom God says, in the end, ‘Thy will be done.'” – C.S. Lewis.\n\n","date":"January 12, 2012 at 6:18 pm","url":"https://shroudstory.com/2011/12/16/rip-christopher-hitchens/","cat":"news_&_views","id":"comment-6880","author":"Chris","site":"shroudstory"}]
