[{"id":"comment-74301","author":"annette_cloutiér","post":"Wow Colins… just have to say I don’t understand your logic let alone your “science”. Joe Nickels tried to reproduce the Image on linen.. He got the shadowy results somewhat like the TS’s Image, but no 3 D information!… You say you reproduced an Image on linen with 3 D information? Why wasn’t it published? Did you also produce the same 120 marks of scourges, the wounds on the head, side, feet, wrists so we can clearly see this and say Wow: this must be the Jesus of the Gospels… until you can be so creative, I really must say that I can’t get into your science or logic about the Shroud..","date":"2014-01-23","mins":"6:58 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74306","author":"annette_cloutiér","post":"Colin… just wanted to add that I’ve followed your web page and you’re very colorful but while you can refute the date with the 1988 C14 testing of the fabric… still, I remain unsure about the medieval theory with the unique and enigmatic formation of the Image that wreaks of a 1st century Roman crucifixion..","date":"2014-01-23","mins":"7:12 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74310","author":"annette_cloutiér","post":"Thanks Colin… quick reply and explains your position succinctly. Just wondering about further testing… with the thymol used to preserve the TS instead of argon do you really think that the absence or presence of bilirubin and/or protoporphrin IX could be determined? I understood that the thymol alters the chemistry extensively..","date":"2014-01-23","mins":"7:35 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74318","author":"annette_cloutiér","post":"Thanks Colin… hope you get your opportunity sooner than later to do that most needed ultimate test!.","date":"2014-01-23","mins":"8:31 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74335","author":"annette_cloutiér","post":"David, I wouldn’t pray too hard for this request… the Shroud will always mean something different no matter what for each individual: every pope, religious, scientist, businessperson, historian, artist, writer, et al because of its unique mystery. It’s good we can debate it. It’s good there is this forum. It’s good we can share information about it all so freely without having to rupture our purses..","date":"2014-01-24","mins":"12:08 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74458","author":"annette_cloutiér","post":"I wonder what blood solvents Tryon and Mattingly used in 1993 when they confirmed Adler’s find of AB+ male DNA..","date":"2014-01-24","mins":"5:34 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74397","author":"annette_cloutiér","post":"Hugh, I can’t agree with this hypothesis… (1) a scorch with iron would produce a smooth surface of the fabric scorched… flattening the fibrils of the linen… the fibrils of the Shroud are neither flattened nor refined to a smoothed shiny surface as an iron would do. (2) Others notably John Jackson, Joe Nickel, et al tested this scorching hypothesis many times… and could not reproduce the 3 D information nor the X ray of the (teeth, hands, etc ) information. 3) No bodily decomposition was found on the Shroud… 4) the prominent wounds on the Shroud cannot be reproduced by painting nor drawn in by any genius artist to match in 3 D information and negative quality. If you think for a second that Geoffroi de Charney could have reproduced his uncle’s imagine to look like his Lord Jesus Christ… such a feat of photography should be able to be done today. But it cannot be replicated now, and common sense would say that it wasn’t done in the 13th, or 14th centuries!.","date":"2014-01-24","mins":"11:19 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74398","author":"annette_cloutiér","post":"Colin… I can’t believe your still using the old: But Bishop Pierre d’Arcis excuse that the Shroud was a painting and he knew the painter! Everyone knows or should know by now that the Shroud had it’s substitute shrouds… (notably at St. Etienne’s in Besancon (cf. Dan Scavone Daniel Scavone, Shroud the Missing Years, Ohio Conference 2007, and Shroud.com/scavone.htm)… D’Arcis was concerned that Lirey was getting a good influx of cash whilst his diocese was suffering from all the fervor created by the exposition of the Lirey Shroud. He may have known the painter of the substitute Shroud at St. Etienne’s but he surely didn’t know the artist of the Shroud at Lirey..","date":"2014-01-24","mins":"11:35 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74462","author":"annette_cloutiér","post":"Hugh, right, the De Charnay/ De Molay roasted Templar hypothesis is Colin’s… but please explain your reply: The wounds on the Shroud can easily be reproduced by painting, do not necessarily reflect 1st century Roman crucifixion practices accurately, and have no 3 D information or interesting negative quality. Why should they have 3 D information or negative quality information… The wounds are there… what an artist to show such accuracy on legs, and torso back and front! Those scourging’s are there and most sindonologists agree it was inflicted by a Roman flagrum… I don’t know that an artist could have painted them in… we’ve ruled out painting when it comes to the Image. I’m wondering how you can be so attentive to this blog. It’s mind boggling how well you respond to everyone… I am grateful. I’m wondering too if there’s a chance we could have the luxury of meeting you in St. Louis at the October 2014 Shroud Convention..","date":"2014-01-24","mins":"5:58 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74547","author":"annette_cloutiér","post":"Right, most of us are familiar and easily understand Benford & Marino’s 2000 Orvieto hypothesis, and the 2005 reinforcement given by Ray Rogers. When Hugh writes about Adler’s study of the C14 testing area being like the rest of the Shroud… I (and I dare say most of us) become lost once again in this “on the fence” posture..","date":"2014-01-25","mins":"11:08 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74571","author":"annette_cloutiér","post":"Charles what about Raes’ 1973 study of the corner mostly cotton… did he have a percentage? What about Flury Lemberg saying that the seam was that of the Herodian Jews of Masada (1st century Jews). So wouldn’t the seam be contrary to the 13th century hypothesis and the 1988 C14 dates?.","date":"2014-01-25","mins":"3:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74573","author":"annette_cloutiér","post":"Hugh Farey : Ooh, flattery will get you anything. Still, When I say the wounds can be reproduced by painting, I mean they are fairly easy to simulate using paint, blood or a mixture, although until what they were actually made of is established, it will be impossible to replicate their chemistry. It was their shapes I was thinking of. Much to most people’s surprise, we have very little idea of what a Roman flagrum (or flagellum) looked like. None have ever been found, and there are a few illustrations on coins and the like, all different. It was obviously some kind of thonged whip, but how many thongs or tips, and what the tips might have been made of, is anyone’s guess (see Mel Gibson’s Passion film). It may be that the marks on the shroud exactly match a Roman flagrum, or it may be that a painter just came up with a good idea. The two designs of Roman flagrum that copies have often been made of and photographed were based specifically on measurements made of the Shroud itself, and do not even resemble the ancient illustrations. Much to most people’s surprise, we have no idea whether people were nailed through the palms, hands or lower arms. Although elaborate demonstrations with real corpses have shown how a hanging body would be too heavy for a dead weight on the arms, many Roman descriptions mention a sedile or seat, sometimes described as a horn sticking out, on which the victim sat, removing all the weight from his arms altogether. It may be that the nails through the wrists thing exactly match a Roman crucifixion, or it may be that a painter just thought it might be a good idea (perhaps he experimented on corpses too!). Much to people’s surprise, blood does not trickle down the outside of hair. It oozes out from the scalp and mats it into a bloody mass. Google news pictures of terrorists bombs for confirmation. To be fair, some people have supposed that the blood flows down the side of the face were imprinted on the shroud from the cheeks, whereafter the shroud realigned itself horizontally to receive the image of the hair, which was thus out of register with the blood flows. However this does not account for the trickles which appear at the back of the head. Much to people’s surprise, blood does not zigzag out of a stab wound to the chest, it flows straight down. To be fair, some people have surmised that the bloodflow from the chest occurred after the body had been taken down from the cross and the original blood had been washed off, and stained the cloth as the body was wrapped or draped with it. This is quite a reasonable scenario. You mentioned earlier that the wounds could not be “drawn in by any genius artist to match in 3 D information and negative quality.” All the blood flows are now fairly uniform pinkish stains, and do not display any particularly interesting features in terms of any relationship between their colour intensity and distance, which is the basis of the 3 D effect, or in terms of their negativity (they just turn green). Delighted to be of assistance! You’re right! I was much surprised! What’s the 10% your giving to the Image having been formed to? (Something like an alien communication from a parallel Universe? Something which may have formed the Image on Guadalupe or Manoppello?).","date":"2014-01-25","mins":"3:54 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74713","author":"annette_cloutiér","post":"Does anyone know what ever became of the cutaway seam in the C14 area taken by Riggi in 1988? Was his private study ever made public?.","date":"2014-01-26","mins":"5:04 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74097","author":"annette_cloutiér","post":"Thanks Barrie! This really set the Rogers’ story straight… right from the horses’ mouth (as in work horse)!.","date":"2014-01-22","mins":"12:00 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74047","author":"annette_cloutiér","post":"Hey Hugh… thought this site might be necessary for you and yours to review!.","date":"2014-01-22","mins":"12:20 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74098","author":"annette_cloutiér","post":"John, I’m so with you here! The mouse that roared going on for the most part with this can’t see the forest for the trees anti Shroudies! BTW… did you ever see the 1983 interview of John Heller by Merv Griffin? It was a You Tube video that lasted about 6 months about two years ago and then was pulled. It was a very insightful video to Heller’s Book Report on the Shroud with some timeless in depth questioning by Merv Griffin..","date":"2014-01-22","mins":"12:05 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74418","author":"annette_cloutiér","post":"I wonder if John Jackson & Flury Lemberg put their high powered microscopes (as did Ray Rogers in 2005) to the area of the 1973 Raes Corner / 1988 C14 testing area would they be so resolute in their assertion that there is no reweaving in this area..","date":"2014-01-24","mins":"2:10 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74099","author":"annette_cloutiér","post":"Hugh, now wait a minute here… you’re refuting Rogers completely! While I respect your independent scrutiny of Barrie’s Quad Mosaics, Barrie will have to weigh in on your observation that they are not even of the Radio Carbon (Cotton rewoven) corner. And as far as French reweaving, I had my St. John Knits from Sax Fifth Avenue French rewoven in the 1980’s. I never could tell where those former holes were in my suits. I admit, the suits were woolen not cotton or linen but with a French reweave someone in 1988 like textile expert Flury Lemberg or C14 specialist Mike Tite could easily have been deceived and hid their embarrassment..","date":"2014-01-22","mins":"12:19 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74128","author":"annette_cloutiér","post":"I’ve looked at Barrie’s Quads many times, always believing the greenish area was of the Raes Corner. So are you the only researcher saying that this greenish area is from under the buttocks… far removed from the Raes Corner and on the opposite (dorsal) side? Thanks Hugh; you are truly giving a teachable moment here, but there are so many contradictions rather than bona fide clarifications..","date":"2014-01-22","mins":"3:57 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74139","author":"annette_cloutiér","post":"If you weren’t so British and so polite.. I’d think you were daft! I’ve looked at these quads over and over and I do not see the greenish dark area any where’s near the buttocks or head area. I see light blue bands, oranges and pinks… but at that infamous Raes Corner on the ventral lower leg area I clearly see a dark greenish patch… what is this patch Hugh? Why is it so abnormally different from the rest of the Shroud?.","date":"2014-01-22","mins":"5:17 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74164","author":"annette_cloutiér","post":"No Hugh, you can’t make it clearer… but where you see green patches in other frames after 8:40, I see only a blur of green in the charred patched holes. I don’t see what you seem to see so readily: “The green patch appears in the same place on every photo.” I only hear Rogers upset that the 1988 C 14 labs didn’t first check with the tests (viz. Barrie’s photographs/Quad Mosaics) and an overwhelmingly prominent green patch unlike any other on the Shroud in that one Cotton Pickn Corner! But thanks. I am grateful for your insights. I just wish others would reference your insights directly, rather than referring us to more written “scientific” findings, or dance around what you are saying..","date":"2014-01-22","mins":"8:29 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74180","author":"annette_cloutiér","post":"Very nice… Hugh, very clear… I’ll have to think about this more and read Morgan’s paper recommended by Joe Marino. (Something that I was hoping I wouldn’t have to do tonight). Do you think you could email John Morgan with your concerns Hugh? Thanks for all your help. I think I’m turning pretty green now..","date":"2014-01-22","mins":"11:11 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74225","author":"annette_cloutiér","post":"This makes terrific logical sense dave… good summation. Thank you..","date":"2014-01-23","mins":"8:36 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-76102","author":"annette_cloutiér","post":"Annette Cloutier : John Klotz : Annette, I don’t know how long you have been contributing to the blog, but the last few months they have caught my eye. Like Paulette, you are short and to the point. I am trying to put to bed a somewhat complex part of my manuscript which is an analogy between the La Bella Principessa and the Shroud. It covers the functions of science and skepticism when the issue is disputed provenance. I glad there are individuals like yourself keeping “an eye on the store.” </blockquote. Merci pour le compliment! So John, who is this beautiful princess you are writing about… Is it Marguerite de Savoy, or Princess Clotlide or is there another? Can you give us a thread? John, thank you for this succinct explanation as well as the one on 20th January pertaining to Leonardo’s lost portrait of La Principessa (Bianca Sforza). I glazed over the January 20th blog because anytime I see Leonardo da Vinci in the same paragraph as the Shroud, I fade away…the whole Prince & Picknett mire we were all subjected to 5 years ago. I’ve been redirected to give you a standing O for this insight!.","date":"2014-02-02","mins":"11:07 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"id":"comment-75806","author":"annette_cloutiér","post":"Joe, I would be more than infuriated with the direct hit to sabotage the truth you and Sue worked so tirelessly to reveal..","date":"2014-02-01","mins":"6:34 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"id":"comment-75943","author":"annette_cloutiér","post":"Interesting, I wonder if it could still be reviewed today by a textile journal? I bet there would be many textile specialists ready to give Joe Marino credibility..","date":"2014-02-02","mins":"8:23 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"id":"comment-76039","author":"annette_cloutiér","post":"John Klotz : Annette, I don’t know how long you have been contributing to the blog, but the last few months they have caught my eye. Like Paulette, you are short and to the point. I am trying to put to bed a somewhat complex part of my manuscript which is an analogy between the La Bella Principessa and the Shroud. It covers the functions of science and skepticism when the issue is disputed provenance. I glad there are individuals like yourself keeping “an eye on the store.” </blockquote. Merci pour le compliment! So John, who is this beautiful princess you are writing about… Is it Marguerite de Savoy, or Princess Clotlide or is there another? Can you give us a thread?.","date":"2014-02-02","mins":"5:14 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?"},{"id":"comment-122075","author":"annette_cloutiér","post":"What a truly great statement of fact and history regarding the TS! Of course the relic craze of Medieval Europe was rampant! And, of course everyone who thought of themselves as royal wanted a piece from the King of Relics– the “Holy Shroud!” This would mean, however, that another Carbon 14 test would have to go deep into the Image itself where there was no invasive relic mining. It would be quiet a 21st Century dare! Joe Marino & his wife Sue were the first to recognize the patchwork for relic craze viz. Done in 1520 by Marguerite of Austria’s staff of French reweavers. Now, how many other patchwork stints surround the Image of the Shroud?.","date":"2014-05-20","mins":"12:20 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"}]
