[{"id":"comment-83738","author":"annette_cloutiér","post":"“John” (aka the “Beloved Disciple”) and Peter finding the burial cloths together without the body is “Story”, Yannick, written nearly a full half century after the undocumented life and times of Jesus… almost like you as the Beloved Disciple and the Church rediscovering the burial cloths (aka the Shroud and the Sudarium) today. I can, however, document that I went to Woodstock with my younger sister and our guitar teacher in 1969..","date":"2014-03-01","mins":"6:32 am","url":"https://shroudstory.com/2014/03/01/25000-comments-and-counting/","cat":"news_&_views","title":"25,000 Comments and Counting"},{"id":"comment-81940","author":"annette_cloutiér","post":"Too funny!… in retrospect… moving to a 2020 vision definition: Shroud of Turin was thought to have been proved inauthentic by radiocarbon dating,,, but now we know its authentic!.","date":"2014-02-24","mins":"5:16 am","url":"https://shroudstory.com/2014/02/24/definition-of-inauthentic-in-oxford-dictionary/","cat":"news_&_views","title":"Definition of Inauthentic in Oxford Dictionary"},{"id":"comment-78997","author":"annette_cloutiér","post":"Where’s the insight with this post? Sounds like more ignorant atheistic blather..","date":"2014-02-13","mins":"9:11 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79195","author":"annette_cloutiér","post":"Lovely, this should never be unwitnessed or kept as secret cultic information. Pictures and documentations by loving persons wishing to impart this energy to the rest of the world should be allowed to operate without impediment.","date":"2014-02-13","mins":"10:15 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79325","author":"annette_cloutiér","post":"Mike M : Annette, Most these Monks have little contact with civilization. Within the community of monks they usually act stupid/mentally retarded or dumb to avoid glorification by other monks. They are extremely humble and wear dirty rags. They are usually discovered by accident ( bright light coming out of their dwellings at night, sounds of people praying together where there is only one person in a room, situations where someone showed up in a place far away from where he lives with no explanation how he got there etc.) these people intentionally avoid detection so I think it’s almost impossible to get evidence for this. They get the energy from the word of God. The father of Monasticism “Abba Antonious” was a very rich man and he heard the bible read in church, the verse where Jesus told the rich man “if you want to be perfect sell what you have and give the money to the poor, and you will have treasure in heaven. Then come, follow me.” He took that verse personally and followed the commandment and started Monasticism in the whole world. So the energy is in the word of God, but how many people are willing to follow through? Hi Mike… Speaking of Anthony the Great… the rich young man who started desert monasticism ca 285, I read somewhere he wasn’t as saintly as you make him out to be… he had a pedophiliac relationship with Athanasius of Alexandria (the monk who authorized the canonization of the NT). Athanasius was no prize either… he had a wicked temper. So I don’t know about relying on past information. How can we be sure of anything really… we can’t test it empirically. But today, in our Information Age, we ought to be able to take pictures, videos, and create documentaries of these phenomenon. Just like we do of deep sea creatures of the ocean which are seldom seen (e.g., giant squid), we should be able to make a documentary of the Rainbow Body Phenomenon..","date":"2014-02-14","mins":"8:24 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79341","author":"annette_cloutiér","post":"Right Hugh, I’ve seen on the Discovery Channel the filming of Tibetan Monks in the frigid cold wearing only a wet towel across their backs while in group meditation…one by one the towels on their backs would become steamy hot… I’ve looked for that on the Net (You Tube, Discovery Channel, etc.) and couldn’t find it. But I found other research such as http://www.youtube.com/watch?v=fl Jnl B4 Tgu0 and http://www.discovery.com/tv shows/discovery presents/videos/the supernaturalist levitation.htm. I think dispelling the authenticity of this type of phenomenon would be akin to dispelling the authenticity of the Shroud… while not quite associated to a Medieval Merlin work, there is something almost unrelatable to be said for those who dedicate their lives totally in the deepest wells of E=MC2. I would like to see more authentication of this type of spiritual field. For example, Padre Pio types today would have to consent to undergo video taping of not only their stigmata, but reported acts of levitation and bilocation before getting 170 million hits on You Tube..","date":"2014-02-14","mins":"9:22 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79431","author":"annette_cloutiér","post":"Right… I’m not home right now, but when I return I’ll go through my library. It was from a faint memory. I felt rather uncomfortable blogging about it. I quickly checked Wikipedia on the life of Athanasius. This is what I found: Sozomen speaks of his “fitness for the priesthood”, and calls attention to the significant circumstance that he was “from his tenderest years practically self taught”. “Not long after this,” adds the same authority, Bishop Alexander “invited Athanasius to be his commensal and secretary. He had been well educated, and was versed in grammar and rhetoric, and had already, while still a young man, and before reaching the episcopate, given proof to those who dwelt with him of his wisdom and acumen” (Soz., II, xvii). That “wisdom and acumen” manifested themselves in a varied environment. While still a deacon under Alexander’s care, he seems to have been brought for a while into close relations with some of the solitaries of the Egyptian desert, and in particular with the Anthony the Great, whose life he is said to have written. So now I’m unsure as to weather it was Bishop Alexander or Anthony the Great who toyed with Athanasius. But I remember doing research on this nearly 10 years ago… so I will have to retrace my steps further..","date":"2014-02-14","mins":"4:36 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79563","author":"annette_cloutiér","post":"Mike, this is precisely my point. Whose to say one way or the other that these men were holy except people with an agenda. The Church has its agenda. The anti ecclesiastical have there agenda. Whose to say, except for us in the here and now to prove what can or cannot be proven… honestly..","date":"2014-02-15","mins":"8:54 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79580","author":"annette_cloutiér","post":"Annette Cloutier : Mike, this is precisely my point. Who’s to say one way or the other that these men were holy except people with an agenda. The Church has its agenda. The anti Church have their agenda. Who’s to say, except for us in the here and now to prove what can or cannot be proven… honestly..","date":"2014-02-15","mins":"10:35 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79680","author":"annette_cloutiér","post":"Hey Mike, I’m not disputing the holiness of anyone past or present. I’m just saying that there are certain things that we can not know for sure. The Shroud, being in our time and space right now, should be something that the Church should not leave as mystery because we can study it here and now. It should be universally studied for the betterment of science, religion, or whatever it is that moves us to a greater good. It’s lovely thinking that Anthony the Great and the Desert Fathers were “holy”. It’s good for the mind, I’m sure, to contemplate the sacrifice of the smaller self, but for God’s sake we need to see and appreciate to the fullest the sacrifice others are making towards the study of the reality of Christ… Those dedicated now to the Shroud should be given more universal support. The Shroud after all is the indelible and long lasting sign of his Energy, his Mass, his Light. Whether it’s through the study of the Shroud itself, or the study of other spiritual phenomenon… such as Rainbow Bodies, the good that can result is a greater reality and idea of The Holy..","date":"2014-02-15","mins":"8:52 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79012","author":"annette_cloutiér","post":"Tom, this was extremely helpful. I can almost understand how this rainbow body phenomenon remains under wraps. I wish it was revealed to me more in my youth… I could have better understood what was gnawing at me… deeply grateful. Can’t wait to meet you in St. Louis! So sorry for my knee jerk comment..","date":"2014-02-13","mins":"10:24 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79723","author":"annette_cloutiér","post":"Precisely, Mike. I would hope in the next scientific scrutiny of the Shroud that it is approached in an open democratic way not excluding the input of previous scientific groups such as STURP but rather will have learned to approach its findings openly and comprehensively with no pretention to transparency and inclusiveness..","date":"2014-02-16","mins":"1:10 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79686","author":"annette_cloutiér","post":"Thanks Louis… well then forget Rainbow Bodies, and compare the Shroud to other spiritual phenomenon that begs to be examined such as the Guadeloupe Tilma, the Veil of Manoppello, the incorruptible bodies of Bernadette Soubirous, Catherine of Laboure, to name a few… dedicated to promoting the concept of the Greater Good via the Immaculate Conception..","date":"2014-02-15","mins":"9:19 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79696","author":"annette_cloutiér","post":"Right Louis… I’ve relegated the Rainbow Bodies to Finian..","date":"2014-02-15","mins":"10:03 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-80357","author":"annette_cloutiér","post":"Louis, would you be willing to point me to a link for the canonization process? Thanks….","date":"2014-02-18","mins":"11:42 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-80384","author":"annette_cloutiér","post":"Thank you Louis, this was very helpful..","date":"2014-02-18","mins":"1:17 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-80421","author":"annette_cloutiér","post":"Uh oh, now you’ve got me studying…Ludwig Wittgenstein! Nonetheless, I was happy to see the Church would canonize someone like Josephine Bakhita. Gives one hope for canonization for people like you and me!.","date":"2014-02-18","mins":"4:59 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"}]
