[{"id":"comment-120337","author":"annette_cloutiér","post":"Charles Markos took the words right out of my mouth…perfectly stated! Thanks Dan, for the post; thanks Joe for the find!.","date":"2014-05-16","mins":"4:19 am","url":"https://shroudstory.com/2014/05/16/a-reality-that-cannot-be-ignored/","cat":"press_coverage","title":"A reality that cannot be ignored"},{"id":"comment-120558","author":"annette_cloutiér","post":"Louis, I didn’t read Markos this way. I really think Markos’ point suggests that the TS forges ahead from the old mythologies of Religion including the Judeo Christian mythologies which do not serve us so well today and noting the TS there is a whole field of Science and a whole new field of Religion that we’ve yet to tap into… that’s all..","date":"2014-05-16","mins":"5:20 pm","url":"https://shroudstory.com/2014/05/16/a-reality-that-cannot-be-ignored/","cat":"press_coverage","title":"A reality that cannot be ignored"},{"id":"comment-109837","author":"annette_cloutiér","post":"Didn’t Jerome Corsi try a novel on this level? Isn’t there agreement that the Blood from the Shroud (and perhaps the Blood from the Sudarium of Oviedo) is too degraded to produce the chromosomal DNA codes for replication into an evacuated egg cell? The microscopic bone fragments from the Jesus Family Tomb would not provide a better cloning specimen… it too has DNA structure which is too far degraded to be used for cloning. So… what would have been interesting is if Piatt wrote about the DNA connection between the Shroud, Sudarium, and Jesus Family Tomb and expressed a more modern scientific view of Resurrection likelihood..","date":"2014-05-03","mins":"11:01 am","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","title":"New Fictional Book: Blood Doctrine"},{"id":"comment-109907","author":"annette_cloutiér","post":"Thanks Louis, brilliant research. Thank you. I only wished that Amos Kloner hadn’t given the construction crew the okay to plow that tomb asunder the next day after his three day investigation. There should have been an international investigation of biblical scholars and archaeologists allowed to study it before completely demolishing such a tomb with the name Jesus son of Joseph and two Mary ossuaries (Maria and Mariamne e mara)..","date":"2014-05-03","mins":"12:51 pm","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","title":"New Fictional Book: Blood Doctrine"},{"id":"comment-101606","author":"annette_cloutiér","post":"Russ is always educational! So glad to have listened to this on before Easter…by 10:40 am Holy Saturday over and out … ready for Resurrection!.","date":"2014-04-20","mins":"5:33 am","url":"https://shroudstory.com/2014/04/19/russ-breault-was-on-the-hagmann-hagmann-report-on-yesterday/","cat":"radio_and_podcasts","title":"Russ Breault was on The Hagmann & Hagmann Report on Yesterday"},{"id":"comment-126454","author":"annette_cloutiér","post":"Dan, this was video short and sweet. Thanks. In reflection, I think it so demanding of centuries of time and attention that the Shroud remains like the Universe only guess work as to how it came into being. Would that we knew it was actually from the Divine Light or the Demonic Darkness… from the Being of Life in Progress or the Being of Life in Regression. Many of the Gnostic Gospels favored a lesser God (e.g.Yaldabaoth) that created a world of duality and “evil”. While I wonder at times about the raes… the true nature of things and life… the Shroud certainly gives me a greater sense of pause..","date":"2014-06-03","mins":"6:52 am","url":"https://shroudstory.com/2014/06/03/and-speaking-of-secondo-pia/","cat":"video","title":"And speaking of Secondo Pia"},{"id":"comment-79016","author":"annette_cloutiér","post":"Dan can this video be fixed for viewing?.","date":"2014-02-13","mins":"10:50 am","url":"https://shroudstory.com/2014/02/13/does-it-really-matter-what-journalists-write-about-the-shroud/","cat":"video","title":"Does it really matter what journalists write about the shroud?"},{"id":"comment-80051","author":"annette_cloutiér","post":"Too Hollywood, too commonplace, lacking in real insight… but just right for folks over 75 and young ones just learning their “catechism”..","date":"2014-02-17","mins":"11:30 am","url":"https://shroudstory.com/2014/02/17/son-of-god-in-theaters-february-28/","cat":"movie","title":"Son of God in Theaters February 28"}]
