[{"title":"Humorous Comment of the Day on Quantum Entanglement","post":"De La Warr, Abrams, Drown and other researchers in radionics found that a blood sample from an individual is in permanent contact with every part of that person’s body even though he may be miles away. In one case, the lifelike image of a foetus was developed from a blood sample of a mother (during pregnancy) who was about 54 miles away ! Such ‘action-at-a-distance’ and non-local interactions have now been scientifically proved and explained by the discovery of ‘quantum entanglement’. Deplorably, when De La Warr told these things half-a century ago, he was brought before the court of law on charges of cheating (though he won the case finally)!\n\n","date":"January 23, 2011 at 12:40 pm","url":"https://shroudstory.com/2011/01/23/humorous-comment-of-the-day-on-quantum-entanglement/","cat":"news_&_views","id":"comment-2269","author":"Chidambaram Ramesh","site":"shroudstory"},{"title":"Humorous Comment of the Day on Quantum Entanglement","post":"Can you provide any credence for “radionics” in a peer-reviewed scientific journal that I might find in the library of a major university? I don’t believe it and I don’t know how quantum entanglement has anything to do with radionics. Here is a description from Wikipedia:\nRadionics devices contradict principles of biology and physics, and no scientifically plausible mechanism of function is posited. In this sense, they can be described as magical in operation. No plausible biophysical basis for the “putative energy fields” has been proposed, and neither the fields themselves nor their purported therapeutic effects have been convincingly demonstrated.[7]\nNo radionic device has been found efficacious in the diagnosis or treatment of any disease, and the U.S. Food and Drug Administration does not recognize any legitimate medical uses of any such device.[2] According to David Helwig in The Gale Encyclopedia of Alternative Medicine, “most physicians dismiss radionics as quackery.”[3]\n\n","date":"January 23, 2011 at 11:48 pm","url":"https://shroudstory.com/2011/01/23/humorous-comment-of-the-day-on-quantum-entanglement/","cat":"news_&_views","id":"comment-2271","author":"Episcopalian","site":"shroudstory"},{"title":"Humorous Comment of the Day on Quantum Entanglement","post":"I can cite an article entitled “Empirical Evidence Supporting Macro-Scale Quantum Holography in Non-Local Effects” written by Sue Benfore  and published in  a non-profitable scientific peer-reviewed journal ‘ Journal of Theoretics ‘ (ISSN: 1529-3548). The article can be read at:\nhttp://www.journaloftheoretics.com/Articles/2-5/Benford.htm\nIt will be interesting to note that Benford who wrote this remarkable article is none other than who (along with her spouse Mr.Marino) discovered the ‘French weave’ in the Shroud and that the C-14 sample was not a true representative of the shroud cloth.\nAgain, Finnish theoretical physicist Dr.Matti Pitkanen, in his paper entitled “TGD Universe as a conscious hologram” has written about “Dela warr camera and field representation of genetic information” and another chapter on the experimental work of William Tiller about intentional imprinting of electronic devices, which is also noteworthy for the current discussion of quantum entanglement.\nIt will be of great interest and importance to compare these with the latest findings of science in bio-holography. Dr.Marina Shaduri and her colleague George T.Shitshinadze (Gogi) have experimentally demonstrated that it is possible to study shapes and structural details of most affected organs or tissues of organisms using only some distal parts of a living body as the source of information. They found, when fingertips are placed in the electromagnetic field of high frequency, their radiation displays exact images (holograms) of the body’s pathological structures.\nBased on experimental and clinical data, they suggest that physical waves of different types (mechanical, electromagnetic, magnetic etc) comprise dynamic web-like structure, which is organized like a multilevel (multiplex) holographic grating with bounded space of a living body.  Such a fragile and highly sensitive fluctuating (“flowing”) medium is capable of altering its whole organization according to the structure of its misbalanced parts. Thus, previously unknown functional mechanism, which has been defined as “Holo-Informational System” serves not only as a system-integrating factor, but also as a functional system that might affect some particle-associated process within the entire body. Details of their work can be found at http://www.holoimaging.org/\n\n","date":"January 24, 2011 at 11:07 am","url":"https://shroudstory.com/2011/01/23/humorous-comment-of-the-day-on-quantum-entanglement/","cat":"news_&_views","id":"comment-2273","author":"Chidambaram Ramesh","site":"shroudstory"},{"title":"Humorous Comment of the Day on Quantum Entanglement","post":"Look, I knew Sue Benford. I know Joe, her husband of many years. He is a personal friend. What they achieved in the carbon dating arena is tremendous and wonderful. But it doesn’t follow, therefore that Sue was right about “Empirical Evidence Supporting Macro-Scale Quantum Holography in Non-Local Effects.” I talked with her about it in Dallas in 2005. I didn’t accept it then and I don’t accept it now. I don’t really believe that the Journal of Theoretics is truly a scientific journal. (It has suspended publication). \nI have here on my bookcase books with proofs that Jesus survived crucifixion and went on the live in India, that Jesus moved to France, that Jesus didn’t exist, that the Loch Ness monster lives (wow is he getting old, St. Columba saw him some fifteen hundred years ago, UFOs have landed, etc. All come with glowing testaments and so-called proofs and names of “experts” and so forth. \nThe Shroud of Turin would be like these things were it not for some real, solid science published in real scientific journals. With all do respect, I don’t buy it.\n\n","date":"January 24, 2011 at 11:36 am","url":"https://shroudstory.com/2011/01/23/humorous-comment-of-the-day-on-quantum-entanglement/","cat":"news_&_views","id":"comment-2274","author":"Episcopalian","site":"shroudstory"}]
