[{"title":"What’s the Story:  Fanti’s Book or the Holy Saturday TV Exhibition?","post":"First, congratulations to Russ for a great job.  I think the main take-away message(s) the average viewer will most likely have is “they’re now saying it might be real” and “it’s going to be shown on tv, for the first time in 40 years.” I wonder how many might flip through the cable channels looking for it this weekend, not realizing it is primarily accessible through weblinks; the report did say Italian tv, but I think you had to listen pretty closely to catch it.  I am still somewhat disappointed that EWTN (as of last week) is not planning to carry the broadcast-for those interested, it can be found easily enough by searching around on the web, but I would have liked to have seen it rate a higher priority on a Catholic channel, thought it might have been given a boost with Pope Francis giving the intro.  Looking forward to checking out the app.  Overall, I’d vote good publicity, I think the news story is it might be worth another look to those who may have previously dismissed it.\n\n","date":"March 29, 2013 at 10:24 am","url":"https://shroudstory.com/2013/03/29/whats-the-story-fantis-book-or-the-holy-saturday-tv-exhibition/","cat":"books","id":"comment-28714","author":"Kelly Kearse","site":"shroudstory"},{"title":"What’s the Story:  Fanti’s Book or the Holy Saturday TV Exhibition?","post":"Great Job Russ. I believe the Shroud image seen in this telecast  was a duratran print fabricated at Eastman Kodak using back then the state of the art Kodak’s Premier System. Photo by Vern Miller.\n\n","date":"March 29, 2013 at 7:59 pm","url":"https://shroudstory.com/2013/03/29/whats-the-story-fantis-book-or-the-holy-saturday-tv-exhibition/","cat":"books","id":"comment-28766","author":"Giorgio","site":"shroudstory"},{"title":"What’s the Story:  Fanti’s Book or the Holy Saturday TV Exhibition?","post":"Agreed,  Barrie Schwortz.  Can they be replicated using the same conditions as the scientific method will validate or reject. Funny this has been hyped around Good Friday. Also funny is\nthat all previous research and carbon testing is suddenly wrong. This was done by very respected institutions. Also, Fanti’s claims sound bogus. Time will tell, not the snap conclusions of some in the news media.\n\n","date":"March 31, 2013 at 7:32 pm","url":"https://shroudstory.com/2013/03/29/whats-the-story-fantis-book-or-the-holy-saturday-tv-exhibition/","cat":"books","id":"comment-28977","author":"Richard Polich","site":"shroudstory"}]
