[{"title":"Yikes! Another Book from Left Field","post":"The lunatic fringe is no longer a fringe. Shroud science is out of control. The lunatics have taken over the asylum.\n\n","date":"February 17, 2011 at 3:00 pm","url":"https://shroudstory.com/2011/02/17/yikes-another-book-from-left-field/","cat":"books","id":"comment-2498","author":"B&B","site":"shroudstory"},{"title":"Yikes! Another Book from Left Field","post":"Any gods able to manipulate genes can certainly manipulate evidence, whether fossil record, historical record, or shroud.\n\n","date":"February 17, 2011 at 3:57 pm","url":"https://shroudstory.com/2011/02/17/yikes-another-book-from-left-field/","cat":"books","id":"comment-2499","author":"hiscity","site":"shroudstory"},{"title":"Yikes! Another Book from Left Field","post":"Exactly so. And thus one can never, ever prove of disprove the existence of God, the divinity of Christ or the nature of the shroud’s images.\n\n","date":"February 17, 2011 at 4:09 pm","url":"https://shroudstory.com/2011/02/17/yikes-another-book-from-left-field/","cat":"books","id":"comment-2501","author":"episcopalian","site":"shroudstory"},{"title":"Yikes! Another Book from Left Field","post":"The Shroud Science Group is the problem. Like a group of medieval monks sworn to silence, it remains a cloistered group debating how many angels can dance on the head of a pin. No, B&B is wrong. The lunatics are outside of the asylum, publishing sensational garbage. The monks are inside of the asylum and nobody knows about their real scientific endeavors until something gets published in a journal that few people read. SSG should be debating in public. Even the most ludicrous things they say in their secret forum (they say some really ludicrous things) is a thousand times less ludicrous then the junk being published about space aliens running around harvesting souls or creating humans as slave to mine for gold while other humans are forming green and red and violet races of men and women. \nPublic perceptions about the shroud are doomed unless SSG changes its ways (I am not a member of the group but I do see digests of some of their emails).\n\n","date":"February 17, 2011 at 4:53 pm","url":"https://shroudstory.com/2011/02/17/yikes-another-book-from-left-field/","cat":"books","id":"comment-2503","author":"Dapper Dan","site":"shroudstory"}]
