[{"title":"Political Pistachio: Some Scientists Claim Shroud of Turin is Authentic","post":"It is also amazing that people can read those passages and get the ‘notion’ that the Shroud cannot agree with the description of what was found in the tomb???\nThis one rediculous ‘notion’ has been beaten to death, and maybe in a sense proves ‘some’ may be blinded to the truth, as also mentioned in scripture.\nR\n\n","date":"December 30, 2011 at 2:51 pm","url":"https://shroudstory.com/2011/12/29/political-pistachio-some-scientists-claim-shroud-of-turin-is-authentic/","cat":"books","id":"comment-6307","author":"Ron","site":"shroudstory"},{"title":"Political Pistachio: Some Scientists Claim Shroud of Turin is Authentic","post":"Ridiculous argument !  And what about Luke 23:53 : “Then he took it down, wrapped it in linen cloth and placed it in a tomb cut in the rock, one in which no one had yet been laid.”  Same thing for Matthew 27:59 or Mark 15:46.\nThose phrases refers directly to a linen burial Shroud.  There’s absolutely nothing against the possibility that Jesus body was put into a linen Shroud after his death.  PERIOD.\n\n","date":"December 30, 2011 at 9:29 pm","url":"https://shroudstory.com/2011/12/29/political-pistachio-some-scientists-claim-shroud-of-turin-is-authentic/","cat":"books","id":"comment-6351","author":"Yannick Clément","site":"shroudstory"},{"title":"Political Pistachio: Some Scientists Claim Shroud of Turin is Authentic","post":"If you had actually read the bible and understood it in the jackfruit of those days you wouldn’t be making such an incredibly ignorant claim.\nWhat the bible is referring to is the sweat cloth that was wrapped around Our lords head when he was still on the cross, and this is why Peter saw the sweat cloth by itself away from the shroud. \nBy the way that separate head cloth is called the sudarium of Oviedo and it is in a church in Spain. The blood stains match perfectly with the blood stains on the head image of the shroud, and the pollen found on both the sudarium and the head image of the shroud and both come from a thorny bush that is only found in the Jerusalem area.\nI would expect this kind of ignorance from an atheist but not from a fellow Christian.\nPlease study the peer reviewed articles fro\n The top scientists on the sterp team and also the great ancient Hebrew burial information given from Debbie Jackson , the wife of NASA scientist John Jackson, who converted to Christianity from Judaism because of the shroud and sudarium.\nGod bless\n\n","date":"January 13, 2012 at 3:06 am","url":"https://shroudstory.com/2011/12/29/political-pistachio-some-scientists-claim-shroud-of-turin-is-authentic/","cat":"books","id":"comment-6890","author":"Bob smith","site":"shroudstory"}]
