[{"title":"Quoting John Jackson Chapter 21 Verses 24 and 25","post":"Brackets are a ubiquitous writing convention. The “[Jackson]” bracket is an obvious error of attribution.  [I hope]\nThat being obvious, there is no question that Jackson has made enormous historical contributions to the study of the Shroud primarily in his initial conception of STURP which he and Eric Jumper so brilliantly executed with the help of two score [40 or more] colleagues.\nHowever, he came a little late into the game to have written the gospel of John [].\n\n","date":"July 1, 2015 at 5:30 am","url":"https://shroudstory.com/2015/07/01/quoting-john-jackson-chapter-21-verses-24-and-25/","cat":"books","id":"comment-204242","author":"John Klotz","site":"shroudstory"},{"title":"Quoting John Jackson Chapter 21 Verses 24 and 25","post":"Personally I have found very interesting the solution against\nthe old carbon dating for the Shroud (the results of 1988,\ncoming from  the 14C test) = the numismatic dating of the Shroud!\nNo one had ever written in such detail on the question of\nprobability calculus based on careful observations of\nByzantine coins, etc. and then I think this is certainly\na great merit of Professor Giulio Fanti …\nSo, our friend Charles Freeman has to work in order to show\nwhere is the error … because this numismatic dating is also\nagainst the strange ideas shown by Charles Freeman.\nI have also found a bit strange that Dr. John Jackson (…or Dr. Whanger …)\nhas never published something of strictly similar about\nthe interesting numismatic dating of the Shroud.\nAttention, please: here I was not talking about the controversial\nissue of the alleged coins on the eyes of the Man of the Shroud,\ninstead I was talking of facial features found in Byzantine coins\nand inherent numismatic dating (for the Shroud of Turin)…\n\n","date":"July 1, 2015 at 11:40 am","url":"https://shroudstory.com/2015/07/01/quoting-john-jackson-chapter-21-verses-24-and-25/","cat":"books","id":"comment-204253","author":"piero","site":"shroudstory"}]
