[{"title":"Rest in Peace Ian Barbour","post":"Ian Barbour was a good scholar and did much to further the science-theology dialogue. However, there was one drawback, not limited to him and seen in the works of other scholars in the field. They keep an eye on new discoveries in science, which often involves discarding one theory in favour of a new one, and when that cannot be housed in theology they turn to philosophy. The result is process theology and other attempts to explain away differences between science and theology and the question which raises its head, which they themselves ask, is Who and What is God? This is nothing more than a dead end, leaving the faithful dumbfounded and more empty pews in churches.\nWe also have Msgr. John P. Meier, who comes with an imaginary round table with Catholics, Protestants, Jews and Agnostics locked up in a library to thrash out differences. He admits he is writing only what all of them can accept without hesitation, and that is exactly his big mistake. He should write what he, as an historian, feels is acceptable, not to please others. As an extremely erudite Bible scholar, does he not know that Jesus during his earthly life would only admit a Yes or No, one could say “a take it or leave it” approach? Writing to please academics is not correct, it can mislead the faithful. \nAfter Meier finishes writing his last two volumes you can bet there will be more tons of books “about Jesus” because he has not filled the blanks, blanks that have to be filled for a complete picture to be obtained. The more daring Biblical scholars, not writing to please anyone, are slowly filling these blanks, and that will eventually clear many doubts, those that Barbour, and now Meier, failed to remove. Till then we will continue to see less baptisms, more empty churches, rising numbers of atheists, agnostics, those sitting over the wall, and former fundamentalists like Gerd Lüdemann and others praying to the universe!\n\n","date":"January 4, 2014 at 8:39 am","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72091","author":"Louis","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"As yet I know nothing of Ian Barbour beyond what appears above. I intend to find out more abut him, as attempts at synthesising religion and science have always attracted me. \nI do not share Louis’ criticisms about Meier at all. His is only one scholarly voice, but the programme Meier set himself was long overdue and necessary. There are others who will attempt the task that Louis espouses. Nor do I agree that Meier’s work will be the cause of Christians falling away from their faith, quite the reverse. \nThe modern quest for the historical Jesus had its beginnings with the publication of the work of Schweitzer (1906-10) and Bultmann (1934). There followed an outpouring of other works by various scholars, which was given added impetus by the development of multi-disciplinary methods of modern criticism applied to ancient literature, and in particular to biblical literature.  \nWhile many attempts had scholarly value, the efforts of some authors were highly speculative sometimes even degenerating almost to the form of a novel, while yet others verged to the opposite extreme of reductionism and scepticism and a general rejection of the Jesus of traditional Faith, almost on principle.  Towards the end of the 20th century, the promoters of the “Jesus Seminar” for instance, adopted a kind of committee approach to validating the various sayings, yielding a reductionist approach biased towards general scepticism.   \nThe various Christian churches reacted to this “historical quest” in various ways; ranging from the fundamentalist literal approach of interpreting the scriptures and rejection of such novelties, to others with a more readily liberal acceptance of some of the assertions made.  \nMeier’s conclave, or imaginary round table, of a Catholic, a Protestant, a Jew and an agnostic – all honest historians cognizant of first-century religious movements – brought a much-needed discipline into this quest for the “Historical Jesus”, that other such attempts had failed to do. Those scholars who follow Meier now have a sound basis on which they may build. \nThat many in the Western World are falling away, can be attributed to a variety of causes: the unduly loud voice of secularism, and indifferentism, the cult of the individual, a post-modernist philosophy, and a selfish hedonism, to name a few of the army of Legion.  It cannot be attributed to the scholarly work of such as John P Meier. \nElsewhere, others are heeding the call of the gospel. It is evident even in the pews of my own parish church, which once was more vanilla flavoured than it is now.  We see immigrants from the Philippines, Samoa, India, Africa and South East Asia, all reflecting the healthy state of the Church in their own home countries.\n\n","date":"January 4, 2014 at 3:33 pm","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72211","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"I would advise David, who takes exception to most of what was written above, to read what Barbour wrote or, better, to go beyond and browse something penned, let us say, by Arthur Peacocke or John Polkinghorne, the latter better than the former but still wide off the mark, as well as other theologians who write on the same topic, and let us know where exactly he found that they had cleared the doubts in the minds of those who have discarded Christianity or even God.\nWhen it comes to John P. Meier he says that he does not agree that “Meier’s work will be the cause of Christians falling from their faith, quite the reverse.” That was not exactly what was commented by me, for Meier maybe just one who can mislead the faithful. Why do I say that? I do not see how he considers the Resurrection, a less historical event if one reads the New Testament, the central belief of Christianity, to be beyond the scope of his work. Or is it beyond the scope of his work because he has to please the Catholics, Protestants, Jews and Agnostics sitting at the imaginary round table he has convened? “Quite the reverse”? It does not seem so. There is talk about a Fourth Quest now, Meier has not filled all the blanks, and there is a liberal Protestant scholar (and pastor) who wisely says that the quest can be laid to rest. Till when only God knows. Everyone, Strauss, Reimarus, Baur, Schweitzer, Bultmann, Meier has failed.  Anyone interested in learning more about this can read the interview-article “What do we know about the Bible: An interview with Joseph A. Fitzmyer, SJ” on the Internet.\nIf the Resurrection is not judged to be at least a less historical event, what was it: a psychic event? If that is accepted then one might as well stop reading Meier, with those countless footnotes, and other scholars writing to please others, unlike Pope Benedict XVI — writing as Joseph Ratzinger — who gave a more convincing explanation to a hardened atheist and communist like Peter Seewald, former editor of “Der Spiegel” and brought him back to the Catholic faith he had lost. So what can be read, if the central belief of Christianity was nothing more than some sort of psychic event, a collective hallucination, an image on a burial shroud and more? Suggestions? Frederick Myers, Sir Arthur Conan Doyle (minus Sherlock Holmes), Allan Kardec with his “Gospel according to Spiritualism”… Whether all that is convincing is another story….\nJust because the faithful from countries in Asia and Africa fill the pews of a parish in NZ, taking away most of the “vanilla flavour” in the process, does not mean that the Church will continue to be healthy in their native countries. The “wave” has not reached these countries so far. It arrived in Europe a long time ago, and is slowly making its way all along the US. When the faithful in these countries, often struggling to make ends meet, manage to fill their pockets considerably, able to buy books about science and theology that do not really remove the doubts, only adding to the confusion, they will forget about going to church.\nBy then John P. Meier will have finished the last two volumes, with no mention of the Resurrection, pleased to have satisfied the demands of those who shared the round table with him. That perhaps may contribute to the doubting, but richer, faithful to buy less books because the whole story can be found in a few volumes, a nutshell. More time and money will be available to spend on material interests, but not in any parish.\n\n","date":"January 4, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72216","author":"Louis","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"Louis and I appear to be a cross-purposes concerning Mgr John P Meier.  I get the impression that because Meier is a Catholic priest, Louis seems to consider that Meier should confine his activities to preaching the fulness of the gospel with all that entails, and refrain from such excursions as expending his historical expertise on such scholarly pursuits as the challenge of the movement to examine the “Historical Jesus”, even though this movement is multi-voiced and and has headed off into all kinds of speculative directions. \nI dare say that Mgr Meier does devote some time to preaching the fulness of the gospel, when he is not pursuing more scholarly work. “A Marginal Jew” is not the only work he has written, but it is probably his most significant. He is William K. Warren Professor of Theology at the University of Notre Dame. His fields include biblical studies and Christianity and Judaism in antiquity. Before coming to Notre Dame, he was professor of New Testament at The Catholic University of America. \nMeier makes careful distinctions between the “The Real Jesus”, the “Biblical Jesus” and the “Historical Jesus”, and we might also add the “Jesus of Faith”. It is to the “Historical Jesus” that Meier turns his attention in “A Marginal Jew”.  \nCertainly there are limits to what the historical method can achieve, and in order to discover the “Jesus of Faith” we must look elsewhere, such as to Benedict’s “Jesus of Nazareth”.  However in a rational age, this “Jesus of Faith” must surely need to correspond to the “historical Jesus” rather than some idealised pietistic fantasy.  That Meier has accomplished the task he has set himself, is evidenced by the enthusiastic reception from highly placed scholars of assorted persuasions.\n\n","date":"January 5, 2014 at 12:41 am","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72250","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"David seems to be trying to indulge in psychoanalysis, and has got it all wrong. I know that Monsignor John P. Meier says mass in a parish church and think he should use his enormous erudition when it comes to biblical studies to tell the whole story as a historian, even if he rejects the Resurrection event as something that should be taken literally. It would be better than writing that it is beyond the scope of his study and thus avoid the possibility of the round table ending as a fiasco.\nThere is another priest, considered to have been the “scholar’s scholar”  — both by Catholic and Protestant scholars in the US — before his retirement, more liberal than conservative, a thousand times more qualified than Meier, who also devoted a lot of time to “scholarly pursuits’ and also says mass. He did not hesitate in explaining the Resurrection, central in Christian belief, to believers and non-believers alike in his books and understood, like Helmut Koester, the difficulties in grasping the Jesus of history:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ   \nI do not believe that Monsignor Meier denies the Resurrection, only that he had to please those sharing the round table with him.Of course, there are others, as Dennett seems to imply in a recent book, who are caught in a pulpit, but he seems to have forgotten that there are also those caught in a pew. Not because of any retirement benefits, but due to the fact that the church can also be a nice place for a social gathering.\nDavid provides us with some lines from Meier’s CV, for which reason I will cite something about Father Fitzmyer’s qualifications:\n— Obtained his PhD under the guidance of Professor Wiilliam F. Albright, at Johns Hopkins\n— Worked with Father Roland de Vaux, OP, archaeologist who excavated Qumran\n     and editor-in-chief of the Dead Sea Scrolls, at the scrollery in Jerusalem in 1956\n     and was thus one of the first scholars to handle these precious documents\n— Was on the Pontifical Biblical Commission\n— Professor of Hebrew and Aramaic at the University of Chicago, for a while\n— Professor of Biblical Studies at Oxford University, for around two years\n— Fifteen honorary doctorates\n— A gold medal (excellence in Biblical Studies) from the British Academy\n— Translated Hebrew, Aramaic, Coptic, Greek and Latin\n— Co-editor of the Jerome Biblical Commentary, together with Fathers\n     Raymond E. Brown and Roland E. Murphy\n— Author of more than thirty books in the field of Biblical Studies, many of\n     them so important that they appear in the bibliographies of books published\n     by other renowned Biblical scholars  \n— Was the expert consulted to identify the Aramaic inscription on the so-called\n     James ossuary\n— Edited and translated the (Aramaic) Tobit texts of the Dead Sea Scrolls, found in\n     Qumran, cave 4 \n— Wrote what scholars consider to be the best guides on the Dead Sea Scrolls\n— Was was the key figure in the Catholic-Lutheran dialogue, resulting in the agreement\n     signed in Augsburg, Germany, an important step in Christian unity\nThere are many more qualifications, relating to the SBL,CBQ etc. but those given above should suffice.\nLast, but not the least, David insinuates that Pope Benedict XVI— whose book on Jesus of Nazareth is consulted even by Protestant scholars — ,the former head of the Church to which he belongs, has been indulging in “pietistic fantasy”. I have never seen anyone chained to a pew in the church, the door is always open for anyone to leave. Why waste time in such a Church? Perhaps that faith which is missing can be found in a round table, where sceptical scholars are unwilling to entertain any talk about the central belief in Christianity.\n\n","date":"January 5, 2014 at 1:39 pm","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72301","author":"Louis","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"1) I was not indulgng in psychanalysis, I was merely reporting facts easily ascertained.\n2) L: “I know that Monsignor John P. Meier says mass in a parish church and think he should use his enormous erudition when it comes to biblical studies to tell the whole story as a historian, even if he rejects the Resurrection event as something that should be taken literally.”  “I do not believe that Monsignor Meier denies the Resurrection, only that he had to please those sharing the round table with him” Ergo, contradiction! \n3) L: “Last, but not the least, David insinuates that Pope Benedict XVI— whose book on Jesus of Nazareth is consulted even by Protestant scholars — ,the former head of the Church to which he belongs, has been indulging in “pietistic fantasy”.”  That is a nonsense! \n4) I am impressed with the list of Fr Fitzmyer’s credentials. \nI do not intend to continue this discussion further. I am a little disappointed that Louis has adopted the stratagem of twisting my words.\n\n","date":"January 5, 2014 at 2:40 pm","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72315","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"Have you read what you posted in #4 and my reply in #5? If not, do read them, and after some thinking, not guided by emotion.\nWhy do you not intend to continue the discussion? Is it because you have lost? Can you show us where is the contradiction in 2)? Meier rejects the Resurrection to suit the beliefs of those at the round table, but surely not as a priest when he says mass. He became a monsignor after, repeat, after, he began writing the series.3) my insinuation is nonsense? You are saying that Joseph Ratzinger’s “Jesus of faith” must correspond to Meier’s “historical Jesus”. Please read what you commented, and don’t forget where there is another contradiction: writing for a parish magazine and also posting it on a Shroud website — while insulting the Pope.\nSo I have adopted the strategem of twisting your words? Can you show us where exactly they were twisted? Where is the stratagem?\nThere is a reference to Davor Aslanovski in another thread today, so I take the opportunity to remind you that you were one of those instrumental in getting him out of this blog. Did you read the last message he left for you on the blog?\nI regret having to post these comments, but you left me with no choice. My approach has always been to come with constructive criticism, open to other points of view as long as something adhering to the truth is offered, not guided by the desire to impress anyone, much less flatter anyone.\n\n","date":"January 5, 2014 at 3:41 pm","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72320","author":"Louis","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"Louis, did you just post something that vanished? It read, “At the rate things are changing . . . ” and then it vanished as I was attempting a reply. I can’t find a copy. Do you have a copy?\n\n","date":"January 5, 2014 at 6:44 pm","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72333","author":"Dan","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"Whether one is a Pope, a university academic or just a fisherman out in his boat thinking about the God of creation…in the end each can say he ‘understands’ God as much as the others. Jesus asks each of us that which he asked his apostles, “Who do you say that I am?” I believe as a long as we seek to answer that query honestly and humbly – that is what truly matters. Our desire to get the answer right is more important than getting it right.\n\n","date":"January 5, 2014 at 10:41 am","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72293","author":"David Goulet","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"– I discontinued the discussion above with Louis, as despite my best attempts at marshalling arguments I considered to be rational, he was not amenable to them. There was no common meeting of the minds, the discussion was going nowhere, and I have more fruitful pursuits to turn my attention to. \n– The objective reality of the Resurrection is a matter on which there has been considerable debate, informed and otherwise. Arguments may be marshalled in its favour and sources cited. But essentially it comes down to a matter of Faith. It is certainly beyond normal human experience. I may claim that it was an actual event and is an essential ingredient of Christian Faith, but I can hardly claim it as an event accepted by a consensus of historians as an historic event. In his highly disciplined historic approach, Meier quite properly rejects drawing on the Resurrection as part of the discipline he has chosen. That prevents no-one from affirming it as an actual event in conscientious belief. \n– I have the greatest respect for all of the recent popes, commencing with Leo XIII. I am unaware of having insulted any. Anythng written by me in a printed publication, was only published on a web-site consequential to a personal invitation to do so. \n– I am aware that one Davor Aslanovski permeated his web-site with several personal insults against me, despite our not being personally acquainted. I have given them scant attention. They appear to have been in reprisal for my accusations of his torturing the English language while holding other sincere scholarly writers not of his own mind in contempt. As such, I find myself in good company.\n\n","date":"January 5, 2014 at 11:52 pm","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72366","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"I invite readers interested in reading the above exchange to judge what is the exact reason why David is not interested in discussion anymore, while continuing to justify his stand in a manner that is not all convincing. Max ( much more qualified to write on the Shroud because of his on-site research and the detailed studies he has at his disposal, but who no longer comments on this blog) was right about the blind spots he detected, and here we go:\nOf course the Resurrection is something beyond human experience, it was an unique event. One must read all the literature that appeared in the region during the period to understand it all. \nQuote: “In his highly disciplined historic approach, Meier quite properly rejects drawing on the Resurrection as part of the discipline he has chosen.”\nReply: There is absolutely no reason to state that J.P. Meier “properly rejects drawing on the Resurrection as part of the discipline he has chosen.” Not even the highly learned monsignor said this! The discipline he has chosen is history and it depended on him to choose whether to include the Resurrection or not in his series. The “quite properly rejects” can only apply to the people who sat at the imaginary round table with him, not to the field of history. Does it have to be repeated over and over again that he was writing to conform to the expectations of these people? As such, he was obliged to omit one part of the history, however that does not justify saying that he “properly rejected” the Resurrection as part of the discipline.  \nQuote:- “I have the greatest respect for all of the recent popes, commencing with Leo XIII. I am unaware of having insulted any”\nReply See #4, where it is stated, “Certainly there are limits to what the historical method can achieve, and in order to discover the “Jesus of Faith” we must look elsewhere, such as to Benedict’s “Jesus of Nazareth”. However in a rational age, this “Jesus of Faith” must surely need to correspond to the “historical Jesus” rather than some idealised pietistic fantasy”\nDoes one have to consult Freud’s works to comprehend what he meant by Free Association or is there no need for this because the association is evident here? \nQuote; “Anythng written by me in a printed publication, was only published on a web-site consequential to a personal invitation to do so.”\nReply: The question of personal invitation does not arise here, it is irrelevant, and again it is going off the point. The problem is explaining how one who claims to be Catholic, wrote a Shroud article for a parish magazine, which was also posted on a Shroud website,admits the fact that he doubts the Resurrection and associates Pope Benedict’s “Jesus of faith”\nwith “pietistic fantasy.”   \nDavor Aslanovski is an Oxford scholar and stated on this very blog that he only exchanges\ncomments with people who identify themselves fully on a blog. He was driven out of this blog unjustly, and apparently not the kind of person to use “I” this and “I” that all the time like a self-appointed judge, he said what he had to say bluntly, not bothered about trying to impress or flatter anyone. He stopped commenting on the blog, left it in disgust, but not before speaking his mind to the persons who forced him out.\n\n","date":"January 6, 2014 at 8:06 pm","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72442","author":"Louis","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"It is quite evident for reasons best known only to himself, that Louis is determined to pick a quarrel, and to exploit any opportunity to misconstrue my comments whenever he can. Although endeavouring to take more than reasonable care in setting out my ideas, I do not expect to have to meet the high standards of scholarly exactitude in the informal exchanges of a blog site. \nLet it be well known that I hold no doubts concerning the Resurrection of Our Lord and Saviour Jesus Christ. Nor despite the incidental, even unfortunate, juxtaposition of ideas, do I associate Pope Benedict’s “Jesus of Faith” with “pietistic fantasy”. I am also aware that Pope Benedict thought sufficiently highly of John P Meier’s “A Marginal Jew” to cite this work in his own “Jesus of Nazareth”. \nAn Oxford scholar may have his own preferences on whom he will exchange comments. That does not make him immune from those he would provoke. \nI regret that Louis will have to continue his self-chosen quarrel without further response.\n\n","date":"January 7, 2014 at 4:14 am","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72464","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Rest in Peace Ian Barbour","post":"With reference to David’s comment above, anyone who is bothered to read this exchange will notice that the quarrel began with David contradicting what I had initially posted. He had to get even because a comment posted by me another thread about carbon dating the pollen grains did not defend the position he had assumed. For those who care to wonder what exactly is going on — and I am accused of using strategems! — he left another comment on the Abgar letter thread making  a nasty insinuation in response to what I had written. Who, exactly, is looking for a quarrel? One should be careful when underestimating someone else’s intelligence. What also comes to mind is the blind spots and the hypocrisy Max detected. \nThis is therefore not a self-chosen quarrel, it is a response to provocations, and if the strategem continues, it will be met with further adequate response, particularly because it is incorrect to hit below the belly, to respond with comments that go off the point and to deny having made comments or adopting attitudes after having announced them with pomp and circumstance on this very thread. There seems to be no room for prima donnas here, and I am sure everyone welcomes team work where constructive criticism can be seen. \nPope Benedict XVI did cite J.P. Meier’s works,but he was referring to the volumes that were published till some time ago. It is highly doubtful that he would endorse the monsignor’s reluctance to deal with the Resurrection, because he describes the exact meaning of the event in his own work . But being a very intelligent scholar he surely understands that Meier is writing for those sharing the round table with him, not for the faithful. If those who think they are part of the flock and use “A Marginal Jew” as a yardstick to judge what can or cannot be believed they are on the wrong track. Benedict also did not cite Meier in his talk at Regensburg, he referred to Father Rudolf Schnackenburg. \nDavor Aslanovski has been studying Byzantine and art history and had every right to express his opinions as a qualified scholar, in fact there are people in this blog who are saying roughly the same things he wrote about. He was driven away by personal attacks. \nI regret having to post some of the above comments, but there has been no choice.\n\n","date":"January 7, 2014 at 1:28 pm","url":"https://shroudstory.com/2014/01/03/rest-in-peace-ian-barbour/","cat":"books","id":"comment-72491","author":"Louis","site":"shroudstory"}]
