[{"title":"\nRobert K. Wilcox's new book: \"The Truth About the Shroud of Turin\"\n","post":"\n\nYou might want to read my book, The Peril of the Sinister Scientist. It's a middle-grade novel about a kid who thought he was cloned from the blood on the Shroud of Turin. Yes, it's fiction for kids, but it presents an interesting arguement.\n\n","author":"Janet Ann Collins","date":"March 16, 2010 at 7:49 AM","url":"http://theshroudofturin.blogspot.com/2010/03/robert-k-wilcoxs-new-book-truth-about.html","site":"moore"},{"title":"\nRobert K. Wilcox's new book: \"The Truth About the Shroud of Turin\"\n","post":"\n\nJanet>You might want to read my book, The Peril of the Sinister Scientist. It's a middle-grade novel about a kid who thought he was cloned from the blood on the Shroud of Turin.Thanks but I'm not into novels. However, I have provided a link to your book at Amazon.com so that readers can check it out.You might want to also make a similar comment on Dan Porter's Shroud of Turin Blog under \"Likely Shroud of Turin Bestseller\" where he brings his readers attention to another fiction book about the Shroud, Jerome R. Corsi's \"The Shroud Codex.\"I know your book is fiction, but as a science teacher, I hope it makes it clear to your children readers that it would be impossible to clone the man on the Shroud (i.e. Jesus) from the extremely degraded and fragmentary DNA in the Shroud's bloodstains. I completed a Biology degree in 2004, in which I did a major assignment on cloning, and contrary to Jurassic Park-based popular opinion, I found that it probably is impossible to clone a human being even from a full set of DNA. Reasons include: 1) cloning requires manipulation of DNA which damages it; and 2) there are cell cycle timing issues that appear to make it effectively impossible to clone humans. Also 3) most (if not all) governments have banned human cloning. Stephen\n\n","author":"Stephen E Jones","date":"March 17, 2010 at 5:36 AM","url":"http://theshroudofturin.blogspot.com/2010/03/robert-k-wilcoxs-new-book-truth-about.html","site":"moore"}]
