[{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Wow conspiracy theory alert!\n\n","date":"September 23, 2013 at 5:57 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45167","author":"matthias","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I don’t know whether you were being sarcastic or not, but conspiracies exist. Every day in the United States, someone is charged by a prosecutor with a criminal conspiracy. The jails that the conspirators serve in are very real and sometimes the time served is very hard. Do you think that Bernie Madoff was a l”one nut”?\nDo you not believe here was a “conspiracy” to capture and execute Christ? What was Judas, if not a co-conspirator? Four people were hung for conspiracy to assassinate Lincoln. \nMaybe your faith in academia is unalloyed. My goodness, would those upright, incorruptible Dons and PHDs conspire to do anything, ahem, improper.\nThe fact is that deriding conspiracy theories is one way the power elites and the mainstream media seek to control debate. Of course there is not one overriding conspiracy to control the world, nor is there a conspirator hiding under every bed. But there were literally not millions but billions riding on the legitimatizing of ASM carbon dating. In part the carbon dating was funded by United States tax dollars.\nWas there a conspiracy involved in the carbon dating? If the price is right and the flesh is weak, you betcha!\n\n","date":"September 23, 2013 at 7:29 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45187","author":"John Klotz","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"yes I was being sarcastic. Most – maybe not all – conspiracy theories are bonkers.\nHe makes a number of big claims. Maybe they are well founded. I’d like to see more substantiation to the claims before I consider the remote possibility of conspiracy.\nAnd no, that doesn’t mean I have unlimited faith in science nor necessarily the accuracy of the carbon testing (in fact if you’ve read my comments you will know on balance I think it more likely than not that the Shroud is the authentic burial shroud of Christ). But it is one thing to question the accuracy of the carbon testing for a variety of methodological or scientific reasons and another to suggest sinister plots and ulterior motives.\nLet’s start with the donation from the “anonymous businessman”. Show me the evidence for this claim. What’s to say it just wasn’t some eccentric atheist with possibly unpleasant memories of a Christian upbringing. Rich people do nutty things at times!\n\n","date":"September 23, 2013 at 7:46 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45189","author":"Matthias","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Michael Tite of the British Museum was supposed to be the impartial authority to insure that the protocols for the C-14 testing were followed. At the same time he was “insuring” the integrity of the process, he  already had the inside track to be the new head of the Oxford Carbon lab. Gove in his book was livid when he heard of the arrangement and thus not surprised when a Good Friday, five months after the carbon results were announced, Tite got the job. It was announced in the same release which revealed the million pound donation to Oxford.\nThe circumstantial evidence rule that sends thousands of conspirators and other criminals to jail requires that once a certain threshold is meant the burden shifts to those challenging the evidence to come up with at least some proof of an alternate theory. Your speculation is not some proof of an alternate theory, but unsupported speculation. It doesn’t pass muster.\nTite had a fiduciary duty to insure that the proper procedures were followed. At the same time, he had the inside track to be the new head of the Oxford laboratory. That’s what  we would call on this side of the pond a gross conflict of interest and it was concealed. Gove only found about it (a year before it came to fruition) when a colleague of his shared dinner, and I assume some wine with  Hall of Oxford.\n\n","date":"September 23, 2013 at 8:03 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45190","author":"John Klotz","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"From British Society for the Turin Shroud Newsletter No.22, May 1989:\nDr. TITE TO SUCCEED PROFESSOR HALL AT OXFORD\nOne ironical twist to the carbon dating story is that according to a report in\nThe Times on 25March, the Oxford carbon dating laboratory’s future has been secured by Professor Hall having recently raised £1 million in donations from 45 businessmen and “rich friends”.  Professor Hall, who has his own private income, has been unpaid since he became founding director of the laboratory in 1954. But on his retirement this year his successor has to be paid,and since Oxford University’s already over-stretched finances are unable to provide this, Hall raised independent finance to fund a perpetual Professorship. According to\nThe Times”Professor Hall said he did not think publicity arising from his research into the authenticity of the Turin Shroud had anything to do with his success in raising the money.” But the even more ironical twist is that Professor Hall’s successor is to be … Dr. Michael Tite\n\n","date":"September 23, 2013 at 8:09 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45191","author":"Joe Marino","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I have visions of a book…a film….????\nBut seriously these are serious claims.\n\n","date":"September 23, 2013 at 8:10 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45192","author":"Matthias","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"The reason that I am able to cite sources for this is that I am working on a manuscript.\n\n","date":"September 23, 2013 at 10:55 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45201","author":"JOHN kLOTZ","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"look forward to reading more\n\n","date":"September 23, 2013 at 11:37 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45203","author":"matthias","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Whenever the stakes are high you will have people crossing lines to ensure they come out on the right side of the result. Academics are no different than big business — the egos are the same.\nThe temptation to manipulate people and processes — for whatever motivation — is as old as humanity.\nJoe’s claims surprise me not at all.\n\n","date":"September 23, 2013 at 10:16 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45196","author":"David Goulet","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"In the interview he granted to a Carmelite magazine shortly before he died Cardinal Anastasio Ballestrero, O.C.D. said he had been manipulated. If he had only realised that something was wrong before the C-14 dating a lot of trouble and controversy would have been avoided.\n\n","date":"September 23, 2013 at 11:56 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45204","author":"Louis","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Could you give a source for that interview, please?\n\n","date":"September 28, 2013 at 5:47 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45706","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"It was published in a Carmelite magazine in Italy many years ago and I will try to locate the source for you.\n\n","date":"September 29, 2013 at 1:45 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45836","author":"Louis","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"“I received a letter dated 1 June 1988 from Monsignor Giovanni Tonnucci, Charge d’Affaires at the Apostolic Nunciate to the USA in Washington as follows: \nDear Professor Gove … \nFor your information, I am also enclosing a copy of the statement which appeared in the 2 May 1988 issue of the English-language weekly edition of L’Osservatore Romano.\nWith every good wish, I remain sincerely yours.’ The article was titled ‘Samples of Shroud of Turin taken for scientific dating’. It stated that three samples of cloth from the main body of the Shroud were removed on 21 April 1988. The total weight was approximately 150 milligrams comprising a strip measuring about 1 cm by 7 cm. It stressed the procedures followed to ensure blindness and described the three control samples. \nThe ones supplied by the British Museum were stated to be a fabric of the first century AD and the other of the eleventh century AD while a fourth sample, the source of which was not given, was said to be dated about 1300 AD. It gave the names of the two textile experts who were present, Professor Franco A Testore of the Polytechnic of Turin assisted by M. Gabriel Vial of the Historical Museum of Fabrics of Lyon, and said the entire operation was videotaped and documented photographically. What really surprised me was the fact that the ages of the control samples were given in this news report and they actually corresponded to the results on the three control samples later obtained by the three laboratories. \nThe article appeared even before Arizona carried out their measurements, although I am sure Damon and Donahue were notaware of it (the first Arizona measurement, at which I was present, was carried out six days after the article appeared). However, both Zurich and Oxford made their measurements considerably later and people in those two labs might have been aware of L’Osservatore Romano article.” \n” Relic, Icon or Hoax”  Harry Gove, 1996, pp.269-270\nCarlos\n\n","date":"September 23, 2013 at 5:09 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45217","author":"carlos","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"The two posts above make serious unsubstantiated statements that appear to stem from a complete misunderstanding of Ray Rogers’s numerous papers and evolving views on the Shroud, as well as a profound ignorance of the chemical reactions he discussed. I think the statements that “he lied profoundly to God, and to himself, and to the public, knowing full well that he was lying – all along!” and he “simply refused to accept the evidence plainly evident to his senses” are as unChristian as they are preposterous, and say a lot more about the person who makes them than the person he is making them about.\n\n","date":"September 24, 2013 at 5:32 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45290","author":"Hugh Farey","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Agreed and according to the rule of this blog of not allowing unsubstantiated accusations of intellectual dishonesty I believe the post should be removed. Unless that is Francis has PROOF Rogers was deliberately lying.\n\n","date":"September 24, 2013 at 7:57 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45294","author":"David Goulet","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Goodness me. How did my (and David’s below) comment above turn up here? Since all evidence of the complaints they make has disappeared, I don’t mind if mine goes too!\n\n","date":"September 29, 2013 at 1:19 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45832","author":"Hugh Farey","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Hugh and David, I completely agree. Three comments by Francis have been removed.\n\n","date":"September 24, 2013 at 8:38 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45298","author":"Dan","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Francis, take it easy, have a glass of cold water and relax, you know you are not alone. You have prominent Shroudies as friends and some doors are open to you, so why don’t you write a Shroud article with their help, expressing your views in a convincing manner, and post it on some website? It is better than blowing your top on a blog.\n\n","date":"September 24, 2013 at 9:55 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45303","author":"Louis","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Mr. Marino makes two serious charges in his comment (among others). \n“I think this is interesting in light of the later discovery that “anonymous businessmen” made a 1 million pound donation to Oxford for ostensibly having proven the Shroud to be a forgery”. \nI’ve been looking for a proof or an indication that this famous million was a reward for “having proven the Shroud to be a forgery” and I have found nothing. I have read several Mr. Marino’s pronouncements in this sense and I have not found anything similar to proof or indication. To blame someone without any proof is a very nasty thing.\n “And, of course, we know that the British Museum’s Dr. Michael Tite, who was billed as the independent overseer of the 1988 C-14 dating, left the museum and took the place of the late Dr. Edward (Teddy) Hall, when he resigned shortly after the dating and after the lab had received the donation.”\nMr. Tite was keeper of the British Museum Research Laboratory. He was perfectly qualified to hold any academic position. His task in Radiocarbon dating of Turin Shroud was just supervision. He did not take any disposition without Holy See’s approval (Card. Ballestrero and advisors). The letter he sends to Card. Ballestrero about the true meaning of the dating (no proof or fake) is an exquisite sample of neutrality. His alleged lack of objectivity is just a presumption without any solid basis. To blame someone without any proof is a very nasty thing. \nMr. Marino’s position about alleged complot in radiocarbon dating, specifically rejected by more serious sindonoligsts as Ian Wilson, Raymond Rogers or John Jackson, don’t surprise me, for I have read fom Mr. Marino some paragraphs as this one: \n“The age of the Shroud given by the labs was 663 +/-25 years, which includes 666.”\n(“The Disciples On The Road To Turin”. Paper presented by Joseph Marino at Holy Shroud Guild Retreat/Conference–August 23-25, 1996)\nNo comment.\n\n","date":"September 26, 2013 at 2:39 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45484","author":"David Mo","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I would think Marino’s statements are bordering on defamatory.IF He and Klotz are going to make these claims then let’s see the comprehensive and  substantiated evidence,not snippets of seemingly anecdotal information.\n\n","date":"September 26, 2013 at 7:08 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45506","author":"matthias","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"A fair request.\n\n","date":"September 26, 2013 at 9:43 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45518","author":"David Goulet","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Thanks for your comments, Dave Mo.\nIt’ll be interesting to see how mr Marino defends those charges!\n\n","date":"September 28, 2013 at 5:51 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45708","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I don’t have time to respond at the moment but will later tonight.\n\n","date":"September 26, 2013 at 7:24 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45508","author":"Joe Marino","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"There are indeed subtleties and tell-tale signs involved, but it is better to wait for further comments…\n\n","date":"September 26, 2013 at 9:10 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45556","author":"Louis","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I respond to some of the comments by David Mo and Matthias.\nDavid wrote:\n<>  “The age of the Shroud given by the labs was 663 +/-25 years, which includes 666.”\nI had forgotten I had written that.  The theme of the paper was parallels between biblical history and Shroud history.  If I were writing that article today, I would definitely leave that out.\nDavid wrote:\n<>\nIn the June 1989 issue of Catholic Counter Reformation in the XXth century, No. 220, pg. 25, it states, “Quoting the Daily Telegraph for Holy Saturday, 25 March, Brother Bruno revealed that forty five business-men and “rich friends” (sic) gave Professor Hall, who will reach retiring age next year, 1 million (pounds) for his services and notably for having ‘determined last year that the shroud of Turin was a medieval fake.’  The money was handed over on Good Friday, 24 March.”\nDavid wrote:\n<>\nFrom:  http://www.shroud.com/pdfs/marinelliv.pdf\nHall wants to ensure the survival of his chair after his retirement and hopes a Sunday\nnewspaper will pay a large sum for the rights to the story of the Shroud dating. He receives\none hundred thousand pounds from ITV, the independent television, BBC’s rival, and a\nmillion pounds from 45 businessmen and “rich friends”. The chair is to be filled by Tite.\nGonella emphasizes: “Since the beginning, this story of dating the Shroud has been vitiated by\npublicistic aspects, to which 14C laboratories showed to be even too much sensitive”.\nThe Cardinal’s consultant, exasperated, expresses a heavy judgment: “The custodians of the\ncathedral of Turin behaved more seriously, kept silent about the sampling of seven centimeters\nof the sheet, than a group of scientists, who took the liberty of violating the secret and of\nannouncing to scandal-seeking tabloids that the Shroud is a medieval fake. In my opinion\nthere is an anti-Catholic conspiracy of specific milieus”. Which milieus? In a later\ninterview, Cardinal Ballestrero will be asked this question: “In this whole affair could the\nFreemasonry have had a hand? And external pressures?” Cardinal Ballestrero answered: “I\nthink it’s indisputable!”\nMatthias wrote:\n<>\nI am providing some documentation in this posting.  Regarding Klotz’s claims, he stated he’s writing a book.  One can’t expect to see chapters of a book when’s he’s making a post.  I’ve read some of his chapters.  He provides footnotes.  We will have to wait until the book is published before we see everything.\n     The only information I provided in my original email that was anecdotal was my statement:  ” I believe was even allowed to observe the actual testing at Zurich.”  I checked Sox’s book The Shroud Unmasked:  Uncovering the Greatest Forgery of All Time and he, in fact, states that he did observe the testing in Zurich.  (See pp. 136-140 of the paperback, Hampshire:  Lamp Press.\nEverything else I stated was a fact:\n*Sox’s book was printed before the official announcement:\nFrom:  http://www.shroud.com/pdfs/n20part4.pdf\nThe book, which was already printed, but not yet released, more than two weeks before the\nofficial announcement of the carbon dating results, makes clear that Sox authoritatively knew\nthe carbon dating result well in advance. Inevitably, therefore, someone leaked their result to\nSox, and he in turn was responsible directly or indirectly for at least two of the highly\npublicised leaks from within the U.K., those immediately in the wake of his Timewatch\nprogramme, and the Sunday Times premature announcement (headlined an “official” result)\nof 18 September, which the Sunday Times admitted derived from an advance copy of Sox’s\nbook.\n*The documentary was complete before the official announcement, as indicated by the information in the documentary itself and alluded to in the statement by Ian Wilson above regarding Sox’s book\n*A million pound donation was given to Oxford “notably for having ‘determined last year that the shroud of Turin was a medieval fake'” per the Daily Telegraph article of March 25, 1989.\nPlease note that at the end of the posting I wrote:\n*Were there any connections/associations between the publisher of Sox’s book, BBC/Timewatch, which put out the documentary, and the “anonymous businessmen” that donated the million pounds to Oxford?\n*We may never know the answers, but I have a feeling that if we did, there would be some shocking revelations.\nI didn’t categorically state there were connections between the publisher, BBC/Timewatch and the donors–I just asked the question.  There’s a difference between making charges and raising questions/suspicions.  I concluded we don’t have all the answers; it’s hard to make conclusions without all the facts.  But am I suspicious?  You bet I am!\nI’d like to highly recommend Emmanuela Marinelli’s article “The Setting of the Radiocarbon Dating of the Shroud” at http://www.shroud.com/pdfs/marinelliv.pdf and William Meacham’s book The Rape of the Shroud, available at http://www.amazon.com/Rape-Turin-Shroud-William-Meacham/dp/1411657691/ref=sr_1_1?s=books&ie=UTF8&qid=1380245688&sr=1-1&keywords=rape+of+the+shroud.  No one can read these and not come away knowing the dating of the Shroud was a fiasco.\n\n","date":"September 26, 2013 at 9:41 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45559","author":"Joe Marino","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I don’t know how you are quoting me. I had not written all the paragraphs under my name. \nI think you must revise the entire article you wrote in 1996 because it is full of similar things to that I quoted. \nYou don’t provide us any proof or relevant indication of any conspiracy. And you match dissimilar events. For instance: \nA leak of information is not a conspiracy to fake. \nOpinions are not evidences. Card. Ballestrero could have ridiculous suspicions about the Freemasonry’s hidden powers (we are in the 21th Century, please). But this is not a relevant indication of nothing.\nFray Bonnet-Eymard is the basis for Marinelli’s speculations. He is the leader of Counter-Catholic Reformation, a religious-political fundamentalist movement. His charges against almost all participants in the 1988 dating match his peculiar beliefs. \nI can have unfounded suspicions about sexual life of Pope Francesco. It would be a funny matter to cheat with friends in front a cup of wine or two. If I publish my unfounded suspicions the things are not funny at all. \nYou the “conspirationalists” don’t realize that if you invalidate the 1988 dating because alleged (non evident) sceptical or freemasons (?) beliefs of some participants, you must invalidate all the sindonologists’ work (your own work also) because your opposite beliefs. Warning to extreme arguments because they can become double-edged swords!\n\n","date":"September 27, 2013 at 2:42 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45584","author":"David Mo","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I read your reply and was astonished to see you\n“highly recommend Emmanuela Marinelli’s article “The Setting of the Radiocarbon Dating of the Shroud” at http://www.shroud.com/pdfs/marinelliv.pdf”\nWhat is it in Marinelli’s article you find convincing?\n\n","date":"September 28, 2013 at 5:56 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45710","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"With my problems with copying and pasting, I’m trying replying to the email in my in box rather than starting in the comments section.  Since I don’t know if doing this will post Pakeha’s comment that I’m replying to, I’m going to reproduce it again here.  \nPakeha wrote, <>\nIt’s scholarly with numerous footnotes and references, extremely detailed and dispassionate.  Marinelli has been a sindonologist for decades and is renowned for her research.  I’m astonished that you’re astonished that I recommended it.  What is it in Marinelli’s article you question?\n\n","date":"September 28, 2013 at 9:14 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45720","author":"Joe Marino","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Freemasonry?\nDo you agree with this?\n\n","date":"September 29, 2013 at 8:38 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45799","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I copied and pasted my posting, which I wrote offline.  It looks like several things you had that I was trying to quote were somehow left out.  When I get time, I will repost those sections.\n\n","date":"September 27, 2013 at 6:06 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45602","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Why is there no mention about what Father Werner Bulst told German TV?\n\n","date":"September 27, 2013 at 9:36 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45614","author":"Louis","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Below is the correction of 2 of David’s original quotes and my responses that somehow had turned out wrong when I copied and pasted material.\nDavid wrote:\n<<Mr. Marino’s position about alleged complot in radiocarbon dating, specifically rejected by more serious sindonoligsts as Ian Wilson, Raymond Rogers or John Jackson, don’t surprise me, for I have read fom Mr. Marino some paragraphs as this one:  “The age of the Shroud given by the labs was 663 +/-25 years, which includes 666.”\nI had forgotten I had written that. The theme of the paper was parallels between biblical history and Shroud history. If I were writing that article today, I would definitely leave that out.\nDavid wrote:\n<<Mr. Tite was keeper of the British Museum Research Laboratory. He was perfectly qualified to hold any academic position. His task in Radiocarbon dating of Turin Shroud was just supervision. He did not take any disposition without Holy See’s approval (Card. Ballestrero and advisors). The letter he sends to Card. Ballestrero about the true meaning of the dating (no proof or fake) is an exquisite sample of neutrality. His alleged lack of objectivity is just a presumption without any solid basis. To blame someone without any proof is a very nasty thing.\nFrom: http://www.shroud.com/pdfs/marinelliv.pdf\nHall wants to ensure the survival of his chair after his retirement and hopes a Sunday\nnewspaper will pay a large sum for the rights to the story of the Shroud dating. He receives\none hundred thousand pounds from ITV, the independent television, BBC’s rival, and a\nmillion pounds from 45 businessmen and “rich friends”. The chair is to be filled by Tite.\nGonella emphasizes: “Since the beginning, this story of dating the Shroud has been vitiated by\npublicistic aspects, to which 14C laboratories showed to be even too much sensitive”.\nThe Cardinal’s consultant, exasperated, expresses a heavy judgment: “The custodians of the\ncathedral of Turin behaved more seriously, kept silent about the sampling of seven centimeters\nof the sheet, than a group of scientists, who took the liberty of violating the secret and of\nannouncing to scandal-seeking tabloids that the Shroud is a medieval fake. In my opinion\nthere is an anti-Catholic conspiracy of specific milieus”. Which milieus? In a later\ninterview, Cardinal Ballestrero will be asked this question: “In this whole affair could the\nFreemasonry have had a hand? And external pressures?” Cardinal Ballestrero answered: “I\nthink it’s indisputable!”\nAddendum:  In my original email I stated,\n\"In the June 1989 issue of Catholic Counter Reformation in the XXth century, No. 220, pg. 25, it states, “Quoting the Daily Telegraph for Holy Saturday, 25 March, Brother Bruno revealed that forty five business-men and 'rich friends' (sic) gave Professor Hall, who will reach retiring age next year, 1 million (pounds) for his services and notably for having ‘determined last year that the shroud of Turin was a medieval fake.’ The money was handed over on Good Friday, 24 March.”\nAfter I posted that someone sent me an original copy of the Daily Telegraph article.  It turns out the writer and/or editor of the quote from Catholic Counter Reformation in the XXth century twisted some quotes from the Daily Telegraph to be able to come up with the statement they did.  Here is the pertinent passage from the Telegraph article:\n\"The Oxford archaeological detective who determined last year that the Shroud of Turin was a medieval fake, has raised 1 million pounds to ensure his department remains in existence when he retires next year.  The money had been donated by 45 businessmen and 'rich friends' to create a new Chair of Archaeological Sciences at Oxford, said Prof Edward Hall, 64.\"\nClearly CCR connects the 2 parts in a way not conveyed by the original article.  That's a good lesson to check the original source instead of relying on a secondary citation.  I will remember that in the future.  But I still maintain that the timing and circumstances of the donation and the taking over of Hall's position by Tite is extremely suspicious.\nNow on to David's most recent post:\nDavid wrote:\n<<I think you must revise the entire article you wrote in 1996 because it is full of similar things to that I quoted.\nI have no plans at the moment to rewrite a 17 year old article.  If Shroud authors rewrote old articles that others thought should be redone, nothing new would ever get written.\nDavid wrote:\n<<You don’t provide us any proof or relevant indication of any conspiracy.\nI'm not trying to prove anything.  I expressed some questions/suspicions in a blog posting.  I didn't expect everyone to agree with me.  It's not an article for publication or a conference presentation.\nDavid wrote:\n<<A leak of information is not a conspiracy to fake.\nAgreed, but if the labs are untrustworthy in not keeping the pledge not to divulge, they open themselves up to other suspicions.\nDavid wrote:\n<< Fray Bonnet-Eymard is the basis for Marinelli’s speculations. He is the leader of Counter-Catholic Reformation, a religious-political fundamentalist movement.\nThat's simply not true and Marinelli's statements are more than speculations.  In the passage from the Marinelli article that I had quoted, here are footnotes, and not one of is from Bro. Bruno's group:\n114 N. SCHOON, Analysing the strands of time, in The Independent, April 25, 1988, p. 17.\n115 G. SERVADIO, La Sindone ammalia gli inglesi, in La Stampa, August 8, 1988, p. 15.\n116 A. BERRY, Turin Shroud professor raises £1m for Oxford post, in The Daily Telegraph, March 25, 1989, p. 7.\n117 L. GONELLA, E ora il mistero si infittisce, in Avvenire, October 14, 1988, p. 6.\n118 R. PATRUNO, “Un complotto anticattolico contro la sacra Sindone”, in La Repubblica, September 29, 1988,\np. 18.\n119 P. G. CAVIGLIA, La Santa Sindone. Un enigma appassionante, in Il Messaggero del S. Bambino Gesù di\nPraga 7 (1997), pp. 18-23, on p. 20.\nMarinelli's article was 30 pages, had 256 footnotes and 50 sources in her references.  She did her homework.\nSomeone else posted today asking why the learned late Fr. Werner Bulst, S.J. was not mentioned.  He believed there was a conspiracy related to the C-14 dating.  And let's not forget the Italian documentary \"Night of the Shroud,\" which addresses the behind the scenes intrigue related to the Shroud.  The documentary even recently won Best Documentary, Best Director, and Best Visual Effects at the Los Angeles Movie Awards.\nClearly there is evidence that various people believe and have believed that the 1988 C-14 dating was an extremely questionable affair\n\n","date":"September 27, 2013 at 9:57 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45672","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"If you believe something underhand went on, then where does this leave the patch/reweave theory? Do you still believe the C14 samples dated were a patch/reweave or that they weren’t from the Shroud at all?\n\n","date":"September 28, 2013 at 10:34 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45724","author":"ChrisB","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I just glanced at the posting and once again my copy and paste did not transfer correctly.  There must be something in the website that’s causing this.  Don’t think I have enough energy tonight to fix.  Will try tomorrow.\n\n","date":"September 27, 2013 at 10:00 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45673","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Joe, paste into Word and send it to me. Let me take a look at it.\n\n","date":"September 28, 2013 at 5:44 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45705","author":"Dan","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"An important tell-tale sign has not been noticed since 1988 and was casually mentioned by me in a Shroud article published more than ten years ago. There is a lot more evil in the world than most people imagine and, unlike the serpent described in Genesis, it can be silent. Cardinal Ballestrero was a good man, therefore he became a victim of this evil, and only later, just before his death, did he talk about “manipulations”, in the interview he gave to the Carmelite weekly. The independent confirmation I received leaves no room for doubt.\n\n","date":"September 27, 2013 at 11:17 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45685","author":"Louis","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I sent my posting from last night in a Word Doc to Dan last night and it appears he has now made some corrections.  It’s still not 100% perfect:  in my original version, the end of David’s quote ended with “>>” and then there was a line space before my reply.  That didn’t happen in the latter 4 instances.  But I’m not going to repost.since it’s still fairly clear where his comment ended and mine begins.\n\n","date":"September 28, 2013 at 10:49 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45725","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"ChrisB wrote:  <>\nExcellent point.  I still believe the C-14 samples were a reweave because of the strong scientific evidence.  I do also believe there were concurrently suspicious things going on behind the scenes related to the dating.  If certain factions were actually intent on falsifying the dates of the samples, I simply don’t know how they had intended to accomplish this.  I don’t buy into the sample-switching hypothesis put forth by some.  Since the conspiratorial aspect is plagued by unanswered questions and speculations, I put stock in the reweave theory because of the scientific evidence but will continue to probe the Machiavellian backdrop to the dating because that’s still important.  After all, if additional testing is ever done on the Shroud, we want to make sure previous mistakes are not repeated.\n\n","date":"September 28, 2013 at 11:06 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45727","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I do not understand anything. If laboratories dated a patch that mixed tissues from different periods their work was well done but on a wrong sample. So, why the hell they needed any “machiavelianism”? You are mixing theories mutually exclusive. Nobody can serve two masters at once.\nI recommend focusing on explaining how you can maintain a theory based on an informant (Mr. Ehrlich) that has discredited it. I mean the French Weaving that can only be done with the same base fabric in less than 1cm holes, and always in thick tissues. Try to explain these loopholes of “invisible mending” theory and forget satanic or Machiavellian interventions, please.\n\n","date":"September 29, 2013 at 2:35 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45774","author":"David Mo","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"David wrote, “If laboratories dated a patch that mixed tissues from different periods their work was well done but on a wrong sample. So, why the hell they needed any “machiavelianism”?”\nThe 1988 testing was less than rigorous.  Statistician Philippe Bourcier de Carbon presented 15 problems with the testing:\n1. Absence of a formal report of the sampling;\n2. Absence of a video archive on the final steps of the samples packaging;\n3. In the official reports, contradictions about the cutting and the weight of the samples by people in charge of sampling;\n4. Breaches of the protocols initially planned for the operation of dating;\n5. Rejection of the usual procedure of double-blind test;\n6. Refusal of the interdisciplinary documentation, which is usual in the procedures for radiocarbon dating;\n7. Exclusion of acknowledged specialists in the Shroud, particularly American scientists who participated in previous works of STURP;\n8. Communication to the laboratories, most unusual, of the dates of the control samples prior to testing;\n9. Intercommunication of results among the three laboratories during the job;\n10. Disclosure to the media of the first results before the delivering of the findings;\n11. Refusal to publish raw results of the measurements (requested also with insistence in its official statement by the Scientific Committee which prepared the Symposium in Paris in 1989);\n12. Non-explanation of the unique isolation of the confidence interval of the measures performed by the Oxford laboratory compared to those made by other laboratories;\n13. Unacceptable value of 6.4 published in the journal Nature for the chi-squared statistical test on the results of the radiocarbon dosage on the Shroud;\n14. Rejection of any cross-debate on the statistical measures performed\n15. Rejection, absolutely uncommon, of the publication of the statistical expertise of this operation, officially entrusted to professor Bray of “G. Colonnetti” Institute of Turin (requested also with insistence in its official statement by the Scientific Committee which prepared the Symposium in Paris in 1989). Bourcier de Carbon concludes: “Such a remark of deficiencies remains completely unusual in the context of a truly scientific debate, and one can only deplore this exception to the usual ethics.”\nGiven those points it would be mind-boggling to believe that there was nothing Machiavellian going on.\nRegarding Mr. Erlich’s comment, it’s easy to find experts to say that certain things are impossible.  Certain scientists said that it would be impossible for heavier-than-air machines to fly but they did.  Cotton has been found in the Shroud, despite the fact that certain person say they didn’t see it or there’s no technique to put it there.  From my book, quoting Paul Maloney’s presentation at the 2008 Ohio Shroud conference:\nIt is now clear that the presence of cotton spun inside [bolding in original] linen yarns in the Raes’ Corner [i.e., the C-14 sample area] is supported by the findings of five separate and independent investigators:\n*Gilbert Raes, (1973-1974);\n*STURP’s own early analyses reported by STURP spokeswoman, Joan Janney, (1981);\n*Investigators at Precision Processes (Textile lab) Ltd. in England, 1988; \n*Ray Rogers’ 2004 investigations; \n*John Brown at Georgia Tech (2004). \nAt that same conference chemist Robert Villarreal also presented a paper indicating that a 9 person team at Los Alamos National Laboratories also found cotton.\nThe late Fr. Francis Filas, S.J. used to say, “Against the fact there is no argument,” but we all know there will be.\n\n","date":"September 29, 2013 at 5:34 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45855","author":"Joe Marino","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Flury-Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?\nThanks!\n\n","date":"September 29, 2013 at 4:58 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45780","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"pakeha wrote:  “Flury-Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?”\nPlease see the end portion of my reply to David in #37.\n\n","date":"September 29, 2013 at 5:36 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45856","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Still having problems with the copying/pasting.  In my last posting (#41), please refer to ChrisB’s original posting #36.\n\n","date":"September 28, 2013 at 11:08 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45728","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\njmarino240 :\nStill having problems with the copying/pasting.  In my last posting (#41), please refer to ChrisB’s original posting #36.\n\nIt seems that text bracketed by two ‘less than’ symbols and two ‘greater than’ symbols wipes out the text in between. Text with just two ‘less than’ (pointing left and to the left of the text) works just fine. .\n\n","date":"September 28, 2013 at 12:25 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45741","author":"Dan","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Dan, sorry to take this discussion for a while, but I have off-topic question. I sent some questions that I asked you to post on this blog. Did you receive my e-mail?\n\n","date":"September 28, 2013 at 2:44 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45748","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"OK. I don’t recall anything. Please send it again. I have been receiving 100s of unwanted email from one person who is upset because I have blocked him from the blog. I’ll watch carefully.\n\n","date":"September 28, 2013 at 3:33 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45749","author":"Dan","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Sent.\n\n","date":"September 28, 2013 at 4:00 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45752","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Done.\n\n","date":"September 29, 2013 at 5:19 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45783","author":"Dan","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nJoe Marino :\nWith my problems with copying and pasting, I’m trying replying to the email in my in box rather than starting in the comments section.  Since I don’t know if doing this will post Pakeha’s comment that I’m replying to, I’m going to reproduce it again here.\nPakeha wrote, <>\nIt’s scholarly with numerous footnotes and references, extremely detailed and dispassionate.  Marinelli has been a sindonologist for decades and is renowned for her research.  I’m astonished that you’re astonished that I recommended it.  What is it in Marinelli’s article you question?\n\nWhat I’ve read by Marinelli hasn’t impressed me at all. Still, in the hopes of getting a more detailed reply from you, I’ll detail the flaws in this presentation of hers.\n\n","date":"September 29, 2013 at 5:02 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45781","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Just for starters, Marinelli says in her introduction “The Shroud is an extraordinary relic because, in addition to its being stained with blood 1.,bears the imprinted image of the corpse that was wrapped in it.”\nShe used the Heller-Adler paper as her source material.\nAt the very least, that paper has been disputed repeatedly.\nSo right from the start, from the very first foot note, Marinelli, seems to be on dodgy ground.\nIn the very same sentence, Marinelli states the cloth ” bears the imprinted image of the corpse that was wrapped in it.”\nIf there’s anything thing we can say about the image on the cloth, it wasn’t the product of being wrapped around a head, let alone a corpse. I think we’re all familiar with the Mercator Projection?\nMy point is that in one sentence and with the very first footnote, Marinelli’s 2012 presentation in Valencia shows reason to doubt her seriousness . It’s why I asked  why jmarino claims this is valuable reading.\n\n","date":"September 29, 2013 at 5:32 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45786","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"“If there’s anything thing we can say about the image on the cloth, it wasn’t the product of being wrapped around a head, let alone a corpse. I think we’re all familiar with the Mercator Projection?”\nSo what’s your explanation? Orthogonal projection?\n\n","date":"September 29, 2013 at 12:06 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45828","author":"ChrisB","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Marinelli introduces her discussion of the carbon dating fiasco with pro-authenticity generalisations which do not bear a great deal of scrutiny, but that’s not her point. There is no doubt, from her article, Harry Gove’s book and various contradictory contemporary documents on the internet, that the processes leading up to, during and subsequent to the taking of the sample are open to criticisms of irregularity, to say the least. As a firm devotee of the cock-up, rather than the conspiracy, I don’t think anything nefarious was involved, but it was undeniably a bit of a mess.\n\n","date":"September 29, 2013 at 1:26 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45833","author":"Hugh Farey","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Pakeha: “If there’s anything thing we can say about the image on the cloth, it wasn’t the product of being wrapped around a head, let alone a corpse. I think we’re all familiar with the Mercator Projection?”\nRead this:http://www.sindonology.org/papers/latendresse2005a.pdf\n\n","date":"September 29, 2013 at 1:27 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45834","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"OK’s reference agrees with Pakeha and disagrees with Marinelli. This one (http://www.shroudofjesus.com/page6.html) says pretty well the opposite. There is almost as little consensus among pro-authenticitists as there is among the antis regarding the exact mechanism of production.\n\n","date":"September 29, 2013 at 1:43 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45835","author":"Hugh Farey","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"In response to pakeha’s #45 posting, Marinelli’s 1st sentence also footnotes 2 other medical doctors.  The Heller-Adler paper was in a scientific peer-review journal.  You say it’s been disputed repeatedly but give no names.  Skeptics may dispute it repeatedly but that carries no weight.  Practically any Shroud paper by proponent or skeptic alike is disputed repeatedly.  I’m not familiar with the Mercator Projection.  For Marinelli to state that the Shroud “bears the imprinted image of the corpse that was wrapped in it,” which has been a traditional observation by many for numerous years, is hardly a reason, in part or in full, to doubt her seriousness.  I believe the scholarly nature of the paper is evident\n\n","date":"September 29, 2013 at 4:31 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45845","author":"Joe Marino","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Ok´s reference contradicts pakeha when he claims categorically “image on the cloth … wasn ´t the product of being weapped around a head”\n\n","date":"September 30, 2013 at 1:47 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45883","author":"anoxie","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Let’s not use any “greater than” or “less than” signs at all!\n\n","date":"September 29, 2013 at 5:22 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45784","author":"Hugh Farey","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Embarrassingly enough, from page 16 onward, Marinelli actually refers to Kouznetzov’s infamous ‘findings’. And sources the fellow in footnotes!\nIs Marinelli the last person in the world to learn Kouznetzov was a fraudulent conman and that his findings were a blatant hoax?\nAgain I ask jmarino, why should we take Marinelli’s presentation seriously?\n\n","date":"September 29, 2013 at 5:42 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45787","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Marinelli responds to your comments:\n“My paper is an history of the facts around Shroud carbon dating and Kouznetsov is part of that history. If I am an historian and I write about the Second World War, I must mention Hitler. And mentioning Hitler, am I a nazist? A Hitler follower? \nIn my article I don’t say that the Kouznetsov’s research is valid. But Kouznetsov participated in conferences and published in peer review magazines, as Journal of Archaeological Science, and I cannot ignore him in a chronicle of the events. I mentioned also the criticism against his work.”\n\n","date":"September 29, 2013 at 5:02 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45849","author":"Joe Marino","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Sorry, no prize.\nMarinelli failed to mention the fellow is  a recognised con artist.\nThis only encouraged readers to give some sort of credence to a notorious hoax.\nThere was no need to mention the fellow without explaining he’s a scammer, unless Marinelli was taken in by the scam or is supporting it.\nDo you see any other option, jmarino?\n\n","date":"September 29, 2013 at 5:23 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45851","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"The call for ego bashing in the realm of Shroud studies is not new, it is needed for objectivity. Many questions remain unanswered.\n\n","date":"September 29, 2013 at 9:59 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45809","author":"Louis","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nHugh Farey :\nOK’s reference agrees with Pakeha and disagrees with Marinelli. This one (http://www.shroudofjesus.com/page6.html) says pretty well the opposite. There is almost as little consensus among pro-authenticitists as there is among the antis regarding the exact mechanism of production.\n\nGuys and girls, the problem with Marinelli’s paper is that it is actually a reprint of her 1990 book “The Enigma of the Shroud”, written together with Orazio Petrosillo, so some of the Marinelli’s arguments are outdated. The book was a harsh criticism of 1988 C14 test, basing on what was known at that time.\n\n","date":"September 29, 2013 at 1:49 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45837","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"O.K. says in #54 that Marinelli’s paper is a reprint of her 1990 book.  First of all, her book is over 250 pages and covers other aspects of the Shroud besides C-14.  Her paper is only 35 pages.  Secondly, in her article, she has many footnotes and references to materials published after 1990.\n\n","date":"September 29, 2013 at 4:39 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45846","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Jmarino: Maybe not a reprint in technical sense, however many arguments are literally copied from that book with little update. I have read “The Enigma of the Shroud”, and see that some paragraphs look like copy/paste without taking much isight into them.\n\n","date":"September 29, 2013 at 4:46 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45847","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Which, of course, does not mean that Marinelli’s paper is invalid. But simply must be taken with some caution.\n\n","date":"September 29, 2013 at 5:03 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45850","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\njmarino240 :\nO.K. says in #54 that Marinelli’s paper is a reprint of her 1990 book.  First of all, her book is over 250 pages and covers other aspects of the Shroud besides C-14.  Her paper is only 35 pages.  Secondly, in her article, she has many footnotes and references to materials published after 1990.\n\nI can see your point, jmarino, of course.\nHowever, leaving in the Kouznetsov hoax was a serious blunder, as it only served to perpetrate the fellow’s scam.\n\n","date":"September 29, 2013 at 5:49 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45862","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Further to #33, it was not only Cardinal Ballestrero who was the victim of machinations. The other one was Pope Paul VI, prompting the African Cardinal Bernardin Gantin (from Benin, but holding a Vatican post at the time) to say something about the “mysterium iniquitatis”, the mystery of evil. More recently, it reached Pope Benedict XVI. It appears that the Italian prelate retraced his steps, only to realise that he had made a mistake in leaving decisions to others, however it was too late and the damage had been done. The decisions were taken by people in the Church and those outside it.\n\n","date":"September 29, 2013 at 2:11 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45839","author":"Louis","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nHugh Farey :\nOK’s reference agrees with Pakeha and disagrees with Marinelli. This one (http://www.shroudofjesus.com/page6.html) says pretty well the opposite. There is almost as little consensus among pro-authenticitists as there is among the antis regarding the exact mechanism of production.\n\nhugh, are you saying the Mercater Projection doesn’t apply to the TS?\n\n","date":"September 29, 2013 at 5:26 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45852","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nJoe Marino :\nIn response to pakeha’s #45 posting, Marinelli’s 1st sentence also footnotes 2 other medical doctors.  The Heller-Adler paper was in a scientific peer-review journal.  You say it’s been disputed repeatedly but give no names.  Skeptics may dispute it repeatedly but that carries no weight.  Practically any Shroud paper by proponent or skeptic alike is disputed repeatedly.  I’m not familiar with the Mercator Projection.  For Marinelli to state that the Shroud “bears the imprinted image of the corpse that was wrapped in it,” which has been a traditional observation by many for numerous years, is hardly a reason, in part or in full, to doubt her seriousness.  I believe the scholarly nature of the paper is evident\n\nSeriously, jmarino, you didn’t take the trouble to find out what the Mercater Projection is?\nHere’s a good place to start\nhttp://en.wikipedia.org/wiki/Mercator_projection\nWhether it’s traditional or not, Marinelli’s observation a cloth wrapped around a three dimensional object would produce anything like what we observe in the TS is foolish.\nI invite you, jmarino, to try for yourself just what impression is left on a cloth which is wrapped around a three dimensional object.\n\n","date":"September 29, 2013 at 5:32 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45854","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"The problem of having the image appear on the Shroud the way it does   despite the normal outcome of imprints being wrapped around a 3 dimensional   object has been addressed by certain scientists, some of whom believe the   image-formation is in the realm of unknown science.  Obviously, the   image-formation process is one of the main questions about the Shroud and one  that will  engender many hypotheses.\n\n","date":"September 29, 2013 at 5:43 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45859","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Pakeha: No, the imprint on the Shroud is not Mercator projection. Actually, Mario Latendresse has shown that contrary to previous beliefs (which claimed that the Shroud must have been completely flat), it is possible for the body to leave projection without creating major distortions. They would appear ONLY if the image had been a contact image, of which the Shroud is not the case. However there are some minor distortions, which is totally consistent with Shroud enveloping the real human body, contrary to what Joe Nickell and Stevven Schafersmann claim.\nI have dealed with one sceptic who claimed the same. See my article: http://ok.apologetyka.info/racjonalista/caun-turynski-faszerstwo-niedokonane-cz-1,558.htm It is in polish, but Google can translate it.\n\n","date":"September 29, 2013 at 5:54 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45863","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nJoe Marino :\nIn response to pakeha’s #45 posting, Marinelli’s 1st sentence also footnotes 2 other medical doctors.  The Heller-Adler paper was in a scientific peer-review journal.  You say it’s been disputed repeatedly but give no names.  Skeptics may dispute it repeatedly but that carries no weight.  Practically any Shroud paper by proponent or skeptic alike is disputed repeatedly.  I’m not familiar with the Mercator Projection.  For Marinelli to state that the Shroud “bears the imprinted image of the corpse that was wrapped in it,” which has been a traditional observation by many for numerous years, is hardly a reason, in part or in full, to doubt her seriousness.  I believe the scholarly nature of the paper is evident\n\nI don’t think anything approaching a scholarly nature is shown in that paper.\nAnyone who would perpetrate Kouznetsov’s con game cannot be considered a scholar.\nCorrect me if I’m wrong, but the fellow was exposed for a hoaxer on a number of pro-authenticity sites.\nI’ll get back to you sources which rebutt the Heller-Adler paper, jmarino.\nSorry not to have included them earlier!\nIn any case, could you explain why Flury-Lemburg’s evaluation of the possibility of reweaving is untenable?\nThanks.\n\n","date":"September 29, 2013 at 5:38 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45857","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I can’t speak for Marinelli–I’ve posted a response from her in one   posting–but I don’t disagree that she should have mentioned Kouznetsov’s   credibility issues as part of the background and data.\n\n","date":"September 29, 2013 at 5:47 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45861","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nChrisB :\n“If there’s anything thing we can say about the image on the cloth, it wasn’t the product of being wrapped around a head, let alone a corpse. I think we’re all familiar with the Mercator Projection?”\nSo what’s your explanation? Orthogonal projection?\n\nA 14th century icon.\nWhat’s your explanation?\n\n","date":"September 29, 2013 at 5:40 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45858","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"“A 14th century icon.”\nThat’s not an explanation of the image, is it?\n\n","date":"September 30, 2013 at 3:33 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45890","author":"ChrisB","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"No it isn’t indeed.\nIt’s simply a description of what the cloth is, based on the evidence we have to date.\n\n","date":"September 30, 2013 at 4:46 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45957","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nO.K. :\n\nHugh Farey :\nOK’s reference agrees with Pakeha and disagrees with Marinelli. This one (http://www.shroudofjesus.com/page6.html) says pretty well the opposite. There is almost as little consensus among pro-authenticitists as there is among the antis regarding the exact mechanism of production.\n\nGuys and girls, the problem with Marinelli’s paper is that it is actually a reprint of her 1990 book “The Enigma of the Shroud”, written together with Orazio Petrosillo, so some of the Marinelli’s arguments are outdated. The book was a harsh criticism of 1988 C14 test, basing on what was known at that time.\n\nThanks for that information, OK.\nYou have to wonder why a scholar would, in 2012,  present a paper which is over 20 years old and without bothering to update it.\nThe Kouznetsov scam really sticks out like a sore thumb, doesn’t it.\nI daresay that also explains why the results of the Oxford lab’s testing of Jackson’s idea isn’t mentioned, either.\n\n","date":"September 29, 2013 at 5:45 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45860","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\njmarino240 :\npakeha wrote:  “Flury-Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?”\nPlease see the end portion of my reply to David in #37.\n\nRemember there is some conflict of interest (and responsibility!) here. Flury-Lemberg has been hired by the Archidiocese of Turin. And they don’t want to admit that the samples they cut from the Shroud and gave to the laboratories were actually flawed.\n\n","date":"September 29, 2013 at 5:59 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45864","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nO.K. :\n\njmarino240 :\npakeha wrote:  “Flury-Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?”\nPlease see the end portion of my reply to David in #37.\n\nRemember there is some conflict of interest (and responsibility!) here. Flury-Lemberg has been hired by the Archidiocese of Turin. And they don’t want to admit that the samples they cut from the Shroud and gave to the laboratories were actually flawed.\n\nWhy ever not?\nKeep in mind that Flury-Lemburg, while rebutting the patching idea, believes the 14th century datingto be flawed.\n\n","date":"September 29, 2013 at 6:04 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45866","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\njmarino240 :\nI can’t speak for Marinelli–I’ve posted a response from her in one   posting–but I don’t disagree that she should have mentioned Kouznetsov’s   credibility issues as part of the background and data.\n\nI’m glad you see that, jmarino, because I believe what has to be a priority in any discussion of the TS is an earnest desire to establish the truth.\nHere are several links on the subject of Kouznetsov’s credibility issues\nhttp://greatshroudofturinfaq.com/Science/Dating/Kouznetsov2.html\nhttp://www.shroud.com/bsts4312.htm\nhttp://www.csicop.org/si/show/case_of_the_holy_fraudster/\nhttp://www.thefreelibrary.com/The+amazing+Dr+Kouznetsov.-a0169923805\nIt’s an unsavoury subject, yes, but better to know the truth of the matter.\n\n","date":"September 29, 2013 at 6:02 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45865","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I have translated into English my 2002 inquest on Kuznetsov, originally in Italian (a biography of Kuznetsov up to 2001 and an analysis of his papers from 1989 to 2000). Moreover I have published an account of my recent inquest on papers he published after 2002 (the latter do not concern the Shroud). Here is the link:\nhttp://sindone.weebly.com/kuznetsov-special.html\n\n","date":"September 30, 2013 at 4:01 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45893","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Thank you very much for posting up those links. They were new to me and I was glad to read them.\n\n","date":"September 30, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45956","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nO.K. :\nPakeha: No, the imprint on the Shroud is not Mercator projection. Actually, Mario Latendresse has shown that contrary to previous beliefs (which claimed that the Shroud must have been completely flat), it is possible for the body to leave projection without creating major distortions. They would appear ONLY if the image had been a contact image, of which the Shroud is not the case. However there are some minor distortions, which is totally consistent with Shroud enveloping the real human body, contrary to what Joe Nickell and Stevven Schafersmann claim.\nI have dealed with one sceptic who claimed the same. See my article: http://ok.apologetyka.info/racjonalista/caun-turynski-faszerstwo-niedokonane-cz-1,558.htm It is in polish, but Google can translate it.\n\nThanks for the link.\nI’ll read it and get back to you.\n\n","date":"September 29, 2013 at 6:06 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45867","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"O.K., I’m finding the Google translate very confusing and I’m sure it doesn’t do justice to your work. Is there any chance you could get that properly translated for your blog?\n\n","date":"September 30, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45958","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Pakeha:\nGenerally I saw that google translated some previous articles well, but unfortunately not in this case. In fact those articles were written for Poles, and I don’t bother translating them into English -too much work. The main point: the Shroud didn’t lay flat, neither it was in strict contact with the body. The situation was something between the two, and Mario Latendresse showed in his paper, that it doesn’t create any major distortions which were argued before, both by sceptics and Shroud proponents.\n\n","date":"September 30, 2013 at 6:22 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45960","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\npakeha :\nWhy ever not?\nKeep in mind that Flury-Lemburg, while rebutting the patching idea, believes the 14th century datingto be flawed.\n\nYes, but then this is the laboratories’ guilt. Had samples been bad, reweaved or something, then the Archidiocese (which organized the sampling) is guilty.\n\n","date":"September 29, 2013 at 6:17 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45868","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"But we know the samples weren’t bad. Flury-Lemburg is most steadfast in explaining why that is so. Remember, Flury-Lemburg headed the team of the 2002 restoration. Is there anyone alive who is more familiar the that linen fabric?\nIn any case, because of the observable ‘banding’ of the weave of the cloth, we know there’s no  sign of patching or reweaving in the area.\n\n","date":"September 30, 2013 at 4:40 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45955","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\npakeha :\nBut we know the samples weren’t bad. Flury-Lemburg is most steadfast in explaining why that is so. Remember, Flury-Lemburg headed the team of the 2002 restoration. Is there anyone alive who is more familiar the that linen fabric?\nIn any case, because of the observable ‘banding’ of the weave of the cloth, we know there’s no  sign of patching or reweaving in the area.\n\nFrom this: http://www.shroud.com/pdfs/whanger.pdf \n“There is significant variability in the\nradiodensity of both warp and weft threads in this area. Some of the threads angulate, and the\ncontinuity of a few seems to be broken.\nThis area is denser and the 3:1 herringbone weave\npattern is much less obvious than in the nearby body of the Shroud fabric.Our conclusion is that the radiographs are strongly suggestive of significant alterations in the\nthreads and weave of the Shroud fabric in the area from which the C14 specimen was taken, thus casting major doubts on the validity of the radiocarbon dating.”\nI know that Flury-Lemberg is currently the most being-in-touch with the Shroud person in the world and I don’t disregard her opinion. But she is not the single textile expert in the world, and I feel she is trying to defend both Archidiocese, and her colleagues Vial and Testore. However, basing on what Joe wrote in his paper http://www.shroud.com/pdfs/chronology.pdf\n“Entry:#7\nDate:1988\nData Category:Evidence of anomalous nature of C-14cornerEvidence:\nEdward Hall,head of the Oxford lab,noted odd fibers in the C-14 sample.\nHall enlisted the opinion of Peter South of Derbyshire lab,who concluded,―the roguefibers were fine dark yellow strand\ncotton …and may have been used for repairs in the past”\nFlury-Lemberg’s assertions sound simply ridiculous.\nBut for sceptics they are, of course, the Holy Truth. Likewise the carbon-dating labs are sacred cows.\n\n","date":"September 30, 2013 at 6:40 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45962","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I’m dealing with a sick dog.  Will get back when I’m able.\n\n","date":"September 30, 2013 at 7:12 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45963","author":"Joe Marino","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I have also examined these radiographs and do not agree with the Whangers. The two photos directly referred to in the quotation above (Figures 17 and 18 of Radiological Aspects of the Shroud of Turin) actually show at least three layers of cloth, where the Holland backing appears to have been folded back over the foot of the shroud, including all the area from which the Raes sample was taken. Strange that they don’t mention that. No wonder the “herringbone weave pattern is much less obvious than in the nearby body of the Shroud fabric.”\n\n","date":"September 30, 2013 at 7:59 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45965","author":"Hugh Farey","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Mr. Marino.\nWho is M. Bourcier de Carbon?\nWe can’t discuss their points one by one. Some of these points aren’t imputable to labs, others are neither accurate nor demonstrable and others simply irrelevant or false. You can see a review of them on Rinaldi’s website: http://sindone.weebly.com/uploads/1/2/2/0/1220953/c14_unpublished_data.pdf (more in Italian hiere: http://sindone.weebly.com/articoli.html ).  But I repeat my point: “invisible mending” theory implies that the labs picked up a patch without realizing it wasn’t from the original fabric. This patch had a mixture of threads from the first and 16th Centuries. So, the final outcome was 14th Century. Labs published this date and I don’t see any “machiavelianism”. You may blame specially the textile experts (Testore, Vial and lastly Flury-Lemberg) of astonishing incompetence and labs of arrogant contempt for their refusal to discuss with STURP. No more.\n\n","date":"September 30, 2013 at 3:02 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45888","author":"David Mo","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Yes Hugh. A bit of a mess. At what points?\n1. No homogeneity of methods (statistical specially) in the final report (Nature)\n2. Unnecessary test. (Chi^2).\n2. Lack of precision in measurements. Note sign ~ in Nature. Only Testore did informal accurate precisions.\n3. Refusal to discuss. This nowadays continues: see the last controversy surrounding Jull&Free-Waters’ paper. \nThings could be better but experts in radiocarbon dating thinks results are reliable… if nothing new is discovered. (See Ramsey, Evin, Gove, Currie and others and hypothesis of monoxides by Jackson). \nI think all this is not “Machiavellianism” but lack of strictness in publishing, different methodologies not well homogenized (who was the final responsible?) and too heated atmosphere.\n\n","date":"September 30, 2013 at 3:35 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45891","author":"David Mo","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"“The two posts above make serious unsubstantiated…”, this not refer to mine, I suppose. I don’t know why my two posts (sept. 30) are placed above HUgh Farey’s comment (Sept. 26).\nTechnologycal mysteries. Or black magic.\n\n","date":"September 30, 2013 at 2:34 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45943","author":"David Mo","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"Sorry, David; they were replies to some posts which have now been removed, and are now drifting around this thread like orphans. Dan – can you put them out of their misery!\n\n","date":"September 30, 2013 at 3:06 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45949","author":"Hugh Farey","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nJoe Marino :\nIn response to pakeha’s #45 posting, Marinelli’s 1st sentence also footnotes 2 other medical doctors.  The Heller-Adler paper was in a scientific peer-review journal.  You say it’s been disputed repeatedly but give no names.  Skeptics may dispute it repeatedly but that carries no weight.  Practically any Shroud paper by proponent or skeptic alike is disputed repeatedly.  I’m not familiar with the Mercator Projection.  For Marinelli to state that the Shroud “bears the imprinted image of the corpse that was wrapped in it,” which has been a traditional observation by many for numerous years, is hardly a reason, in part or in full, to doubt her seriousness.  I believe the scholarly nature of the paper is evident\n\nHi, jmarino.\nSorry to have taken so long in providing links to arguments against the Heller/Adler conclusions.\nThey’re written by hugh farey and I found them to be most interesting.\nhttp://forums.randi.org/showthread.php?p=9387545&highlight=Adler+blood#post9387545\nhttp://forums.randi.org/showpost.php?p=9394626&postcount=8900\nhttp://forums.randi.org/showthread.php?p=9386857&highlight=Adler+blood#post9386857\nhttp://forums.randi.org/showpost.php?p=9386813&postcount=8803\n\n","date":"September 30, 2013 at 4:29 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45954","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\njmarino240 :\npakeha wrote:  “Flury-Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?”\nPlease see the end portion of my reply to David in #37.\n\nHang on.\nAre you saying Flury Lemburg was incompetant to find cotton fibres in the area?\nAnd seriously, do you understand the amount of extraneous fibre need to have skewed the dating.\nAre you claiming Fleury-Lemburg wouldn’t notice there was over 50% cotton in that area?\nOr is she part of the conspiracy?\n\n","date":"October 1, 2013 at 2:39 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45971","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\npakeha :\n\njmarino240 :\npakeha wrote:  “Flury-Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?”\nPlease see the end portion of my reply to David in #37.\n\nHang on.\nAre you saying Flury Lemburg was incompetant to find cotton fibres in the area?\nAnd seriously, do you understand the amount of extraneous fibre need to have skewed the dating.\nAre you claiming Fleury-Lemburg wouldn’t notice there was over 50% cotton in that area?\nOr is she part of the conspiracy?\n\nHe understands. About 75 % of material must be new to skew the dating from the 1st to 14th century.\nContrary to what one documentary says, the pach consist mainly of linen with only some additions of cotton.\nIs she part of the conspiracy? I wouldn’t say in that way. Just I as I mentioned she only wants to defend Archidiocese, which organized sampling, and her colleagues Vial and Testore who participated in it. The real scandal was that actualy everyone probably knew that something wrong was with the sample, nevertheless they decided to keep going with the datings. The results were as they were. The responsibility is shared by both the laboratories and Archidiocese. However the bad will of the latter is obvious to me. I don’t believe the datings were faked, the samples switched or something, but most probably the raw data were manipulated to obtain the most desired (and self-consistent) dates.\nPakeha: You still have to learn much about the Shroud. Try to read my article describing 1988 carbon-dating: http://ok.apologetyka.info/racjonalista/dzieje-caunu-turynskiego-wedug-leszka-zuka-z-racjonalisty-cz-2,629.htm ,of course if google translates it well enough to be understandable.\n\n","date":"October 1, 2013 at 5:34 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45978","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"“The responsibility is shared by both the laboratories and Archidiocese. However the bad will of the latter is obvious to me”\nSorry it had to be the bad will of the laboratories. But the Archidiocese also screwed the sampling maximally as it was only possible. They all share the blame. The Archidiocese decided to play wit the devil, and thus there were results…\nOne interesting thing, the dates 1260-1390 were announced on press release on 13th October 1988, however, “Nature” received paper ON 5 DECEMBER. With unacceptable Chi^2 value of 6.4, which meant that the RESULTS ARE INCONCLUSIVE and should be rejected. The true date of the Shroud was thus UNKNOWN (the 1260-1390 was just onlyaverage of the Shroud and possible alien contaminants). However on 13th October it was PUBLICALLY announced that the Shroud was a FORGERY, and all who thought otherwise were idiots, while MAINTAINING SILENCE on unacceptable Chi^2 value. This is nothing but MANIPULATION. Only after such sensational announcement the results were sent to “Nature”, which in turn, COULDN’T simply reject the paper.\nIn my opinion, the place for Tite, Sox, Hall, Hedges, was definetly in prison. Even despite the mesurements themselves were properly done.\n\n","date":"October 1, 2013 at 8:02 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45980","author":"O.K.","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nHugh Farey :\nI have also examined these radiographs and do not agree with the Whangers. The two photos directly referred to in the quotation above (Figures 17 and 18 of Radiological Aspects of the Shroud of Turin) actually show at least three layers of cloth, where the Holland backing appears to have been folded back over the foot of the shroud, including all the area from which the Raes sample was taken. Strange that they don’t mention that. No wonder the “herringbone weave pattern is much less obvious than in the nearby body of the Shroud fabric.”\n\nThat’s very interesting, hugh.\n\n","date":"October 1, 2013 at 2:41 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45972","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"As an expert in textiles Mme. Mechthild Flury-Lemberg was only defending her point of view, against other hypotheses, not covering up the mistake made by the archdiocese. Cardinal Ballestrero left decisions to Professor Luigi Gonella, who was present when Prof. Giovanni Riggi cut the sample. If both Professors Gonella and Riggi made a mistake by ignoring the protocols prepared by Professor Carlos Chagas, of the Pontifical Academy of Sciences, and took the sample from the dirtiest site of the Shroud it was their error.Those who are familiar with Shroud studies should also know, for instance, that the archdiocese rejected a peer-review paper presented by a Shroud scientist and this was not prompted by any error made by clerics there.\n\n","date":"October 1, 2013 at 8:30 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-45987","author":"Louis","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I’ve been mostly out of commission for a few days dealing with a sick dog.  I had almost completed a single posting consisting of various responses originally posed in the “Shreds of Evidence” posting from 9/23, which I was just going to post here since this current thread overlaps, when I somehow managed to make the posting disappear.  I will have to reconstruct the whole thing.  I’m not in the mood to do that tonight.  I’m going to be out of town this weekend but maybe I can start doing it again tomorrow night and finish early next week.  I absolutely hate it when I lose things on computers.\n\n","date":"October 3, 2013 at 9:29 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-46102","author":"Joe Marino","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"It’s just gotten worse.  I meant to post #98 to the “And then, too, we have two comments from Daveb of Wellington” posting” and posted it here instead.\n\n","date":"October 3, 2013 at 9:32 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-46103","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nO.K. :\nPakeha:\nGenerally I saw that google translated some previous articles well, but unfortunately not in this case. In fact those articles were written for Poles, and I don’t bother translating them into English -too much work. The main point: the Shroud didn’t lay flat, neither it was in strict contact with the body. The situation was something between the two, and Mario Latendresse showed in his paper, that it doesn’t create any major distortions which were argued before, both by sceptics and Shroud proponents.\n\nThanks for the heads up on the Mario Latendresse article.\nI’ll hunt it out and read it and let you know what I think of it.\n\n","date":"October 4, 2013 at 8:18 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-46136","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"\nJoe Marino :\nI’m dealing with a sick dog.  Will get back when I’m able.\n\nAll the best with the dog. These faithful friends deserve all attention and care we can give them.\n\n","date":"October 4, 2013 at 8:20 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-46137","author":"pakeha","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"I’m trying to catch up after having the sick dog and also a weekend trip out of town.\nPakeha wrote, “could you explain why Flury-Lemburg’s evaluation of the possibility of reweaving is untenable?” and “Are you saying Flury Lemburg was incompetant to find cotton fibres in the area?\nAnd seriously, do you understand the amount of extraneous fibre need to have skewed the dating.\nAre you claiming Fleury-Lemburg wouldn’t notice there was over 50% cotton in that area?\nOr is she part of the conspiracy?\nFlury-Lemburg may be a textile expert and although she says an invisible reweave is impossible, 6 independent sources as cited in posting #37 show there was cotton in the C-14 sample area.  Let’s not forget that Professor Piero Savarino, co-authored a booklet on the Shroud before he was appointed advisor to Cardinal Poletto of Turin. In the 1998 booklet, he stated that the 1988 C-14 testing might have been erroneous due to “extraneous thread left over from ‘invisible mending’ routinely carried out in the past on parts of the cloth in poor repair.” Savarino went on to emphasize: “…if the sample taken had been the subject of ‘invisible mending’ the carbon-dating results would not be reliable. What is more, the site from which the samples actually were taken does not preclude this hypothesis”  (cited in http://www.shroud.com/pdfs/benfordmarino.pdf)\nDavid Mo wrote, “Who is M. Bourcier de Carbon?”\nAll I know is that he was a French statistician who presented a paper at a 1993 Shroud conference in Rome.  Do any other readers have any details to contribute?\nPakeha wrote:  “Sorry to have taken so long in providing links to arguments against the Heller/Adler conclusions.\nThey’re written by hugh farey and I found them to be most interesting.\nhttp://forums.randi.org/showthread.php?p=9387545&highlight=Adler+blood#post9387545\nhttp://forums.randi.org/showpost.php?p=9394626&postcount=8900\nhttp://forums.randi.org/showthread.php?p=9386857&highlight=Adler+blood#post9386857\nhttp://forums.randi.org/showpost.php?p=9386813&postcount=8803”\nThose are all from the Committee for Skeptical Inquiry group, formerly known by CSICOP, which has always been anti-Shroud.  It’s not surprising they contest it.  And it’s not something from a peer-reviewed scientific journal.\n\n","date":"October 7, 2013 at 10:09 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-46425","author":"Joe Marino","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"David Mo wrote, “Mr. Tite was keeper of the British Museum Research Laboratory. He was perfectly qualified to hold any academic position. His task in Radiocarbon dating of Turin Shroud was just supervision. He did not take any disposition without Holy See’s approval (Card. Ballestrero and advisors). The letter he sends to Card. Ballestrero about the true meaning of the dating (no proof or fake) is an exquisite sample of neutrality. His alleged lack of objectivity is just a presumption without any solid basis.”\nHarry Gove, never confused for being pro-Shroud, wrote a letter to David Wilson of the British Museum as the dating process was unfolding saying that it was “a shoddy enterprise” (cited in Meacham’s Rape of the Shroud.)\n\n","date":"October 7, 2013 at 10:22 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-46429","author":"jmarino240","site":"shroudstory"},{"title":"Shreds of Evidence: A Guest Posting by Joe Marino","post":"The dog is on the mend so I’m now to catch up from that and also a weekend trip to Indiana.  This is the 2nd time I’ve tried to post this tonight.  For some reason, the 1st try apparently failed\nPakeha wrote, “could you explain why Flury-Lemburg’s evaluation of the possibility of reweaving is untenable?” and “Are you saying Flury Lemburg was incompetant to find cotton fibres in the area?\nAnd seriously, do you understand the amount of extraneous fibre need to have skewed the dating.\nAre you claiming Fleury-Lemburg wouldn’t notice there was over 50% cotton in that area?\nOr is she part of the conspiracy?\nFlury-Lemburg may be a textile expert and although she says an invisible reweave is impossible, 6 independent sources as cited in posting #37 show there was cotton in the C-14 sample area.  Let’s not forget that Professor Piero Savarino, co-authored a booklet on the Shroud before he was appointed advisor to Cardinal Poletto of Turin. In the 1998 booklet, he stated that the 1988 C-14 testing might have been erroneous due to “extraneous thread left over from ‘invisible mending’ routinely carried out in the past on parts of the cloth in poor repair.” Savarino went on to emphasize: “…if the sample taken had been the subject of ‘invisible mending’ the carbon-dating results would not be reliable. What is more, the site from which the samples actually were taken does not preclude this hypothesis”\nDavid Mo wrote, “Who is M. Bourcier de Carbon?”\nAll I know is that he was a French statistician who presented a paper at a 1993 Shroud conference in Rome.  Do any other readers have any details to contribute?\nPakeha wrote:  “Sorry to have taken so long in providing links to arguments against the Heller/Adler conclusions.\nThey’re written by hugh farey and I found them to be most interesting.\nhttp://forums.randi.org/showthread.php?p=9387545&highlight=Adler+blood#post9387545\nhttp://forums.randi.org/showpost.php?p=9394626&postcount=8900\nhttp://forums.randi.org/showthread.php?p=9386857&highlight=Adler+blood#post9386857\nhttp://forums.randi.org/showpost.php?p=9386813&postcount=8803”\nThose are all from the Committee for Skeptical Inquiry group, formerly known by CSICOP, which has always been anti-Shroud.  It’s not surprising they contest it.  And it’s not something from a peer-reviewed scientific journal.\n\n","date":"October 7, 2013 at 10:26 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","id":"comment-46430","author":"jmarino240","site":"shroudstory"}]
