[{"title":"Six major artifacts, including the Shroud of Turin, the True Cross, and John the Baptist?","post":"The True Cross programme was the one I was consulted on and I gave them all the articles I had on the early legends of the Cross by the acknowledged academic experts. (Of course, there is no question of being paid a consultancy fee however much one helps!) When I suggested that it was unlikely that any relics of the Cross were authentic they told me that they were radiocarbon dating one that they thought might be. I told them to get in touch if they came up with a first century date as I would have to rewrite the first chapters of my Holy Bones. I have heard nothing more.\nI did get the idea that they really did believe that some of the relics were authentic and that the programmes would be slanted that way. They certainly did not want to hear further from me or the experts on these legends who think that they are legends and nothing more. They did not even acknowledge some other  references I sent them later. But if you start with an agenda and neglect specialist  opinion ( I do not mean myself but people who are specialists in these early Christian texts on relics) then what do you expect.\n\n","date":"January 10, 2015 at 6:24 am","url":"https://shroudstory.com/2015/01/10/six-major-artifacts-including-the-shroud-of-turin-the-true-cross-and-john-the-baptist/","cat":"books","id":"comment-182353","author":"Charles Freeman","site":"shroudstory"},{"title":"Six major artifacts, including the Shroud of Turin, the True Cross, and John the Baptist?","post":"The authors are probably Catholics and may have some interesting things to say in the book. In an increasingly sceptical Western world it may serve as a prop for faith. So far so good, the problem arises when just relics are used to sustain this faith. The parables of Jesus have a lot more to teach Christians and it is exactly in his words that deep faith should lie.\nThe other problem relates to academics, particularly when what they write is taken as gospel truth. They are human, just as the authors of popular books are, and, talking from experience, that is, after interviews, reviews and other material, one can sometimes easily detect prejudices, distortions and even hatred in what they write.\nSome genuine artefacts have been found in Israel.Two of these are from the Second Temple period: one is an inscription indicating the way to the place of trumpeting and the other is an ossuary probably belonging to Nicanor, the Alexandrian, who built the “beautiful gate” mentioned in the New Testament (Acts) and also in the Talmud:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nSome people have questioned the existence of the Jerusalem Temple, both for religious and political reasons, and these artefacts constitute just one reason to show why they are wrong.\nAnother problem is forgeries, used by agenda-driven documentary producers and some others. The James ossuary, with its partially forged inscription, is just one of them. In this case we do not need it to prove the existence of Jesus and James the Just, the “brother of the Lord”, the first of the twelve Jewish-Christian bishops of Jerusalem. Josephus mentions both Jesus and James in “Antiquities”.\n\n","date":"January 10, 2015 at 7:31 am","url":"https://shroudstory.com/2015/01/10/six-major-artifacts-including-the-shroud-of-turin-the-true-cross-and-john-the-baptist/","cat":"books","id":"comment-182362","author":"Louis","site":"shroudstory"},{"title":"Six major artifacts, including the Shroud of Turin, the True Cross, and John the Baptist?","post":"hmm..Catholics…prop for faith?…not sure the Catholc Church has stated these “relics” are real…as far as I know, they have the same position on them as the shroud…..we don’t need props….when I was in Rome, I remember the Vatican guide stated that they doubted it was a piece of  the true cross… nice shot though!\nIf this is the official position the the Church please send me a link….as far as a know…it is not\n\n","date":"January 10, 2015 at 7:27 pm","url":"https://shroudstory.com/2015/01/10/six-major-artifacts-including-the-shroud-of-turin-the-true-cross-and-john-the-baptist/","cat":"books","id":"comment-182453","author":"rick","site":"shroudstory"},{"title":"Six major artifacts, including the Shroud of Turin, the True Cross, and John the Baptist?","post":"Actually there has been quite a lot of testing, official and unofficial, of relics in Italy. One of my guides was up to date on them- they had found that one reason for the good state of preservation of the body of Santa Zita in Lucca for instance, were the large quantities of lead in her body from her long life as a servant in the kitchens with lead pipes.\nIt  does not seem to be a big issue whether a relic is genuine or not. The people of Lucca love their Volto Santo but they simply say the original, authentic, relic is no longer there because pilgrims took pieces off it in the Middle Ages but the present, medieval one is a good substitute! Never forget that many of these so-called relics are objects of veneration, not authentic, but venerated because there are miracles associated with them. A miracle can always give a sacred object that may not be original at all special status.\nMy own feeling is that Italians live emotionally with relics but disregard the science. They are simply part of the fabric of life associated with communal festivals going back, usually, into the Middle Ages and that keeps it all going.\nSo far as I can see the booking for the Shroud visits is not being organised by the Church  but the local tourist authority. That says a lot but there are indeed wonderful things to see and do in Turin and the surrounding countryside so I wish the Piedmont Tourist Board  luck in spreading their message outside the cathedral as well.\n\n","date":"January 11, 2015 at 3:43 am","url":"https://shroudstory.com/2015/01/10/six-major-artifacts-including-the-shroud-of-turin-the-true-cross-and-john-the-baptist/","cat":"books","id":"comment-182511","author":"Charles Freeman","site":"shroudstory"},{"title":"Six major artifacts, including the Shroud of Turin, the True Cross, and John the Baptist?","post":"Charles…not sure I understands what you mean by “Italians live emotionally with relics but disregard the science”\nAs an Italian I can assure you that many Catholic scientists…….many who join the festivals and participate because of faith……\nAs far as preservation and lead pipes…think that’s kinda  a stretch….must have a lot of examples of this then……lead pipes have been around for years..\n\n","date":"January 11, 2015 at 6:38 pm","url":"https://shroudstory.com/2015/01/10/six-major-artifacts-including-the-shroud-of-turin-the-true-cross-and-john-the-baptist/","cat":"books","id":"comment-182653","author":"rick","site":"shroudstory"},{"title":"Six major artifacts, including the Shroud of Turin, the True Cross, and John the Baptist?","post":"To all who are reading this thread:\nHas anyone read any comment I made above saying that the book is the official position of the Catholic Church?\nCulture has a heavy influence when it come to relics. I have not seen the same devotion to the remains of the martyr Saint John Southworth at Westminster Cathedral, only much reverence at the tomb of Saint Edward the Confessor at the (Church of England’s!) Westminster Abbey.\nMy wish is that clerics in Rome read Ian Wilson’s “Holy Faces, Secret Places” dedicated to Pope John Paul II, where he asks for “glasnost” in Rome. They should forget about the cultural divide, with an Englishman asking mostly Italian clerics to throw the door open for research.\n\n","date":"January 11, 2015 at 1:21 pm","url":"https://shroudstory.com/2015/01/10/six-major-artifacts-including-the-shroud-of-turin-the-true-cross-and-john-the-baptist/","cat":"books","id":"comment-182594","author":"Louis","site":"shroudstory"},{"title":"Six major artifacts, including the Shroud of Turin, the True Cross, and John the Baptist?","post":"no….but comments like: “authors, probably Catholic” and “serve a prop”  think may insult Catholics even if it does not imply (and I think it does) that the Church is somehow involved.(we after, have the “relic” on Vatican grounds)…I felt the need to clarify that point..\n\n","date":"January 11, 2015 at 6:23 pm","url":"https://shroudstory.com/2015/01/10/six-major-artifacts-including-the-shroud-of-turin-the-true-cross-and-john-the-baptist/","cat":"books","id":"comment-182650","author":"rick","site":"shroudstory"}]
