[{"title":"Skunks at the Garden Party","post":"” In the end, Walter McCrone was able to show that the reddish stains on the linen were red ochre paint, not blood, and that the linen itself dated from the fourteenth century.  Case closed.”\nBook closed.\n\n","date":"July 12, 2014 at 5:33 am","url":"https://shroudstory.com/2014/07/12/skunks-at-the-garden-party/","cat":"books","id":"comment-137316","author":"anoxie","site":"shroudstory"},{"title":"Skunks at the Garden Party","post":"The Wikipedia article has very much more on the Vinland map than is posted above.  It is an incredible record of scientific contradictions, false inductions, wrong inferences made from inadequate investigations, and the question of authenticity seems to remain quite inconclusive.  It seems that C14 testing dated the parchment to 1423-45; there was a subsequent discovery that modern nuclear fall-out had skewed these results.  There was the McCrone-Cahill controversy over the presence of titanium in the ink.  Subsequent tests brought more uncertainties to light.  It seems almost as if whatever comprised the original artifact, which conceivably could have been quite genuine, has subsequently been massaged by an enterprising forger, to make the artifact more of a curiosity than it actually was.  Despite all the work done on it to date, the matter would seem quite unresolved, until further more conclusive investigations can be implemented.\nhttp://en.wikipedia.org/wiki/Vinland_map \nThe assertion that McCrone was able to show that the reddish stains on the TS linen were red ochre paint seem to be quite false.  McCrone seems to have made this assertion based purely on his visual microscope observation, with nothing better to offer than standing on his dignity.  When challenged as to what tests he carried out, he merely claimed to be able to recognise it.  I am unaware if any other investigator has concurred with his claims, or has reviewed his work.  A variety of chemical tests carried out on the red stains by various other investigators have all confirmed that the stains comprise primate blood.   So much for dabblers in forensic science.\n\n","date":"July 12, 2014 at 7:40 am","url":"https://shroudstory.com/2014/07/12/skunks-at-the-garden-party/","cat":"books","id":"comment-137331","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Skunks at the Garden Party","post":"This shows that even if the shroud was carbon dated to the first century skeptics will still disbelieve.\n\n","date":"July 12, 2014 at 8:55 am","url":"https://shroudstory.com/2014/07/12/skunks-at-the-garden-party/","cat":"books","id":"comment-137341","author":"Mike M","site":"shroudstory"}]
