[{"title":"New Publication on Manoppello Veil","post":"Quote: “It is an interesting study of visual properties of the Veil when photographed during different lighting conditions,as well as of influence of the Veil on Byzantine, medieval, and renaissance art.”\nComment: I don’t think there’s any solid pieces of evidence for the presence of that vail before the 16th Century in Italy…  In that context, how can someone publish a serious study of the influence of that relic on Byzantine art?  All this will always remains pure speculation.\nOn the contrary, we know for a fact that the Mandylion was in Edessa since at least the middle of the 6th Century and came to Constantinople with great attention in 944.  That’s the kind of image of Christ that truly can had a great influence on Byzantine art.  It’s pretty logical to assume this since this image was publicly known and even publicly displayed during the Byzantine era. But when it comes to the Mannoppello Vail, that’s another story…\n\n","date":"November 1, 2014 at 4:30 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-167731","author":"Yannick Clément","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"On the contrary, we know for a fact that the Mandylion was in Edessa since at least the middle of the 6th Century and came to Constantinople with great attention in 944.\nYannick, the basic question:\nWhat was the Mandylion?\n\n","date":"November 1, 2014 at 4:36 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-167732","author":"O.K.","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"What it is reported to be: most certainly an image of the face of the living Christ with big wide open eyes and no bruises or bloodstains on it.  Among other pieces of evidences, there are a wide bunch of ancient sources (artistic and literrary sources) that talks about it in these terms (or show it that way) and many of the ancient literrary sources (starting with the Acts of Thaddeus) have made a clear distinction between this image and the burial cloth (or cloths) of Jesus.  In all logic, the Mandylion was not a burial cloth, just like, in all logic, the Shroud is not an artwork forgery…\n\n","date":"November 1, 2014 at 5:52 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-167751","author":"Yannick Clément","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"Some extracts from a Manoppello web-site, for what they may be worth:\n“Manoppello: the Volto Santo (Holy Face)\nWhere does this mysterious relic come from? According to the tradition based on a historic account written by Father Donato from Bomba in 1640, it arrived in Manoppello on an unknown day in the year 1506, when the physicist and astrologer Giacomo Antonio Leonelli, while was talking with some people, met a foreign man. He was invited to follow him into the Church. He received a mysterious wrapped veil. … While Father Donato was unrolling the veil, thus discovering the image of Christ, the foreign man disappeared.”\n“The veil stayed at the Leonelli family for almost one hundred years; but in 1608 the several heirs started to contend for it. … (etc)”\n“Father Heinrich Pfeiffer, Jesuit and Professor of Iconology and History of Christian Art at the Gregorian University of Rome, thinks the veil of Manoppello is the Roman Veronica. According to the historic reconstruction, Veronica, called “acheiropoietos”, reached Constantinople in VI century (coming from Jerusalem and then from Camelia, in Cappadocia). It stayed there until 705, when it disappeared mysteriously, perhaps to save it from the iconoclastic movements of the time. It was in Rome under Pope Gregorio; after several vicissitudes, it was carried into St Peter’s Cathedral, becoming an important destination for thousands pilgrims. After the demolition of the chapel where Veronica was held, in 1608, no trace of the veil was found. The veil appeared in Manoppello is thought to be the historic and legendary Veronica.”\n“In 1978 Sister Blandina Paschalis Schloemer, a clever iconographer, said on account of some researches and investigations that the sacred face in Manoppello and the sacred face of the Sacra Sindone (the Holy Shroud) in Turin are exactly superimposable.  (And so on …)” \nClearly, author Falcinelli was of the opinion that Manoppello was the Veronica lost from Rome and apparently uplifted by the mysterious stranger who gave it to Giacomo Leonelli in 1506. \nO.K.: “What was the Mandylion?”\nYou’ve probably seen Wilson’s 2012 Valencia slide-show, innumerable representations of the Mandylion, many classified according to types of their presentation:\nIan Wilson – Discovering more of Shroud’s Early history, Valencia Conference 2012; Paper and slide show:\nhttp://www.shroud.com/pdfs/wilsonvppt.pdf\n\n","date":"November 1, 2014 at 5:50 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-167750","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"Clearly, author Falcinelli was of the opinion that Manoppello was the Veronica lost from Rome and apparently uplifted by the mysterious stranger who gave it to Giacomo Leonelli in 1506. \nFalcinelli? Not -his opinion on the Manoppello was completely different http://www.shroud.com/pdfs/roberto.pdf\nO.K.: “What was the Mandylion?”\nYou’ve probably seen Wilson’s 2012 Valencia slide-show, innumerable representations of the Mandylion, many classified according to types of their presentation:\nYes, of course. But the matter is not that simple. While I agree that the mandylion brought to the Constantinople in 944 was the Shroud (of Turin), but the history of the Mandylion seems to be more complex than standard Wilson theory. I ask: what was the original King Abgar’s Mandylion?\nWhat it is reported to be: most certainly an image of the face of the living Christ with big wide open eyes and no bruises or bloodstains on it.\nSo what Image fits this description?\n\n","date":"November 1, 2014 at 6:09 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-167755","author":"O.K.","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"O.K:  “While I agree that the mandylion brought to the Constantinople in 944 was the Shroud (of Turin), but the history of the Mandylion seems to be more complex than standard Wilson theory. ” \nI suggest you suspend judgment until you have an opportunity to read paper on Markwardt’s Saint Louis conference presentation.  He is now of the view that Mandylion & Shroud were two different objects, but Scavone seems still to reserve the view they were the same.  Markwardt’s paper due out about Christmas.  Markwardt still holds the view that Bishop Avercius used the Shroud as visual aid for conversion of Abgar VIII court, reflected in Bardesanic Hymn of Pearl, then returned it to Antioch, event recorded as allegory relating to Abgar V, because of Emperor Severus.  With impending destruction of Antioch, it was sent to Cappadocia, subsequently at some time to Constantinople.\n\n","date":"November 1, 2014 at 10:22 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-167790","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"I recommand O.K. and you Daveb to also take notice of the paper presented in St Louis by Sébastien Cataldo (for which I’ve made a lot of researches and contributions).  In it, we show quite clearly how the evolution of the Abgar legend was determined by the proclaiming of Christian dogmas (such as the one of the two natures of Christ) and the numerous battles done by the Orthodox Church of Edessa (not always done honestly, I should add) against various heretical groups of Christians that were present in that region of the Middle East…  Understanding this important historical context is crucial to understand the appearance of the Image of Edessa in the Abgar legend (first as a painted portrait done by the archivist of the king) and its succesive transformations (most probably done to confort the orthodox views of the Edessa Church against these heretical groups).\n\n","date":"November 2, 2014 at 6:02 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-167970","author":"Yannick Clément","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"Markwardt’s contention that the Shroud was used in the conversion of court of Abgar VIII was not derived from the Abgar legend, but from the epitaph inscription of Bishop Avercius (or Abercius), particularly in relation to being accompanied by a fish of large size which a holy virgin drew from a fountain, which Markwardt asserts is a reference to the Shroud image using the language of disciplina arcana,  also by the contemporary Bardesanic Hymn of the Pearl.  He sees the origin of the Abgar legend as the archival record of the conversion set in allegorical terms to the predecessor Abgar V because of the anti-christian policies of the new emperor Severus, and the already precarious position of Abgar VIII in the imperial court because of his previous pro-Parthian policy.  Whether or not theological implications of the heretical groups is included in the legend is a side issue.  Markwardt does not subscribe to the Wilson Mandylion = Shroud hypothesis.  I suggest a reading of the Markwardt 2008 Ohio paper makes it clear enough.  The Saint Louis paper expected by Christmas will expand on this further.\n\n","date":"November 2, 2014 at 6:35 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-167976","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"Quote: ” Whether or not theological implications of the heretical groups is included in the legend is a side issue.”\n[edited by moderator] In the historical context of the time (not in the imagination of someone like Markwardt), the war of the Edessa Church against the heretics and its will to stay “orthodox” in face of the new dogmas proclaimed by the official councils done by the Church of these days are most probably THE MAIN REASONS for why the Edessa Church invented the Image of Edessa and included it Inside the Abgar legend!  But of course, you’re free to believe otherwise.\n\n","date":"November 2, 2014 at 6:50 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-167979","author":"Yannick Clément","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"The comment was edited.\n\n","date":"November 2, 2014 at 7:00 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-167983","author":"Dan","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"Daveb is quite correct. Nobody invented anything, the disciplina arcana, things stated in couched language, was part of the show, the times dictated that kind of approach.\n\n","date":"November 2, 2014 at 7:14 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-167985","author":"Louis","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"What about what was written in the book “The Face of God”, by Paul Badde. He seems to make a very good case for the Manoppello image.\n\n","date":"January 16, 2015 at 11:57 am","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-183749","author":"Maggie","site":"shroudstory"},{"title":"New Publication on Manoppello Veil","post":"Hello Maggie.\n“The Face of God” is a must read in the topic of Manoppello. Although written in reportage convention, and more heart-moving tale, than mere concise factual report (and slightly exaggerating at times) it nevertheless needs to be read, as it contains a lot of information. But they cannot be taken uncritically.\n\n","date":"January 16, 2015 at 6:04 pm","url":"https://shroudstory.com/2014/11/01/new-publication-on-manoppello-veil/","cat":"books","id":"comment-183816","author":"O.K.","site":"shroudstory"}]
