[{"title":"New Book: The Templar Mandylion","post":"Old material again. François has done some good work, but it looks like he has changed  direction (?), making a connection with the “Jesus was alive when the Shroud image was produced” story, coming from Germany, known in the realm of Shroud studies.\n\n","date":"April 15, 2014 at 8:29 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-99697","author":"Louis","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Louis, I have not changed direction !,… I have only, with Mary Gazay, just translated into French the book of Helmut Felzmann “New Light on Jesus” (in German: “Neues Licht auf Jesus”). The French title of this translated book is “Nouvelle Lumière sur Jésus”.\n\n","date":"April 27, 2014 at 12:38 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-104433","author":"FRANCOIS GAZAY","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"François, thanks for the correction. So it seems you have not changed direction, only translated a book by Felzmann. Why don’t you offer to translate other Shroud books in German? I am sure many French Shroudies would be interested in reading a translation of “Das Turiner Grabtuch und der Christusbild” by Fathers Pfeiffer and Bulst. It would also help English-speaking Shroudies who can read French but not German.\n\n","date":"April 27, 2014 at 5:35 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-104481","author":"Louis","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"If that stone statue really has the sigma blood stain on the forehead then this definite proof that the Mandylion is the Shroud folded in 8.\n\n","date":"April 15, 2014 at 11:44 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-99765","author":"Mike M","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Sadly for me, as I fail to see it. I’m also not aware of a single Shroud scholar that had that same perception. \nHow was that conclusion come to?\n\n","date":"April 16, 2014 at 12:02 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-99774","author":"David Bowman","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"“How was that conclusion come to?”\nPlease see the first image in page 6 of this report;\nhttp://www.cirac.org/Mandylion.pdf\n\n","date":"April 16, 2014 at 6:45 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-99876","author":"Mike M","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"The reversed “3” sign on the forehead is more properly described as an “epsilon” not a ‘sigma’.  It is interesting that the stone head has a landscape framework similar to some mandylion representations, and it may be that there is a barely discernible epsilon on the forehead. The statue would seem to post-date 1204 when it may be assumed that the full image of the Shroud would then be known. If the epsilon is indeed present, it would seem that for some reason the sculptor has associated the Shroud face with the Mandylion image.  I know of no other mandylion with the epsilon sign. I think it may be presumptuous to attempt to read what may have been in the sculptor’s mind by this association. By no means can it be asserted as proof that they were one and the same object, but it may be thought highly suggestive. \nThe involvement of the templars as custodians of the Shroud post-1204 is contentious.  Daniel Scavone downplays the likelihood.  He notes that only relatively junior templars confessed to worshipping a head, and then only under torture, and they would not have been privy to the innermost secrets of the order. Scavone claims that the same accusation was levelled against the Cathars, and it was only at the suggestion of the inquisitors that the confessions of worshipping a head were obtained. \nAs the templars were in Constantinople during the fourth crusade, many of them would have heard the legends of the mandylion, a few may have seen it, and Robert de Clari claimed to have seen the Shroud image exhibited at Blachernae.  So they knew of both, but that does not necessarily imply that they ever had custody of either. But it’s sufficient to explain the Calvary as a templar construction. There is also the well-known templar mandylion representation at Templecombe. The Master of Normandy burnt at the stake with Jaques de Molay in 1314 was an earlier namesake of Geoffrey de Charnay. I don’t see any of this as making such a strong case that the templars were ever the custodians. \nLouis seems to be an advocate of the templar involvement in the custody of the Shroud. But I have yet to read any strong arguments he can present to support the hypothesis, apart from a few obscure inferences.  Perhaps he has secret information he is not at liberty to reveal.\n\n","date":"April 16, 2014 at 1:41 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-99797","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"One has to be patient, Daveb, my way of doing research is to have as much certainty as possible and then present some viable hypothesis. As you know, some nonsense has appeared in the realm of Shroud studies, which I successfully refuted. It is incorrect to clutch at straws or appeal to bizarre theories to authenticate the TS.\nIn a few days time I will have some information in my hands, where fact will have to be separated from fiction, as this is a field where agenda-driven distortions can be detected.\nDaniel Scavone does not believe that the Mandylion/Shroud was stolen in 1204 and I do not believe it was given away as a present. That several relics were indeed stolen is fact, so much so that Pope John Paul II returned some items to Ecumenical Partriarch Bartholomew I. What we need to do now is to fill the gaps.\nThe Templars did not take part in the Fourth Crusade, financed by the Doge of Venice, and French and mostly Venetian mercenaries did the looting. The knights probably had spies there to see what was going on.\n\n","date":"April 16, 2014 at 9:07 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-99919","author":"Louis","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Louis: “Daniel Scavone does not believe that the Mandylion/Shroud was stolen in 1204 and I do not believe it was given away as a present.” \nQuoting from Scavone’s paper “BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400” Ohio 2008: \n“Othon (de la Roche) was a Burgundian nobleman who emerged as a leading figure of the Fourth Crusade, was awarded the fief of Athens, and somehow acquired the Shroud of Jesus along with other relics in Constantinople in 1204. / So our first task is to get the Shroud from Constantinople to Othon in Athens. In 1983 Pasquale Rinaldi discovered in Naples a 13th c. copy of a\nletter asserting that the Shroud of Jesus from the relic collection in Constantinople was in Athens. Othon had been the Seigneur of Athens since late in 1204. / The letter is dated August 1, 1205. Theodore Angelos, brother of Michael, Despot of Epirus, wrote to Pope Innocent III, complaining that the\nShroud of Jesus had been taken to Athens.” [p.4 of paper]\nhttp://ohioshroudconference.com/papers.htm \nHas Daniel Scavone chaned his mind since he wrote this passage in 2008? If so, why?\n\n","date":"April 17, 2014 at 7:40 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-100271","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Daveb: Scavone quote “somehow acquired the Shroud of Jesus along with other relics in Constantinople in 1204”\nAsk him..\n\n","date":"April 17, 2014 at 9:44 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-100313","author":"Louis","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"You made a statement: “Daniel Scavone does not believe that the Mandylion/Shroud was stolen in 1204 …” I quoted from a 2008 paper by Scavone which apparently refutes that. What is your reason for the statement?\n\n","date":"April 17, 2014 at 4:04 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-100397","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Re relations of a Breton Calvary with the Shroud and the Templar Knights, on February 24, 2013 I wrote:\n| #22 Reply | “The only snag is the Breton calvary of the “Park ar Groaz ru” is JUST supposed to be of templar origin. The two stone-sculpted inscriptions on the pedestal read: 1600 CE (on the West face/no photograph provided) and “LANVOXO” (1515 CE) on the North face NOT AT ALL “MCCCIVOXb” (1304 CE + sculptor’s initials (sic!)) as François Gazais most misleadingly claimed (misreading).”\n“Besides the Capital writing style of both inscriptions just cannot be early 1300 CE style. The same goes for the general aspect of the Christ face bas relief in granite. However the latter’s most original/intriguing features (Christ head with no nimbus and epsilon letter-like shape mark, right in centre of stone sculpted and landscape frame 2X1) could indicate this is a stone copy of a much older stone template dating back to the Knights Templar. If so, how much is it faithful to the original? This is yet another speculation.”\n| #23-25; 41-42 Replies | “E.g. compare the Breton calvary head bas relief in granite with Albrecht Dürer’s The Vernicle Held By Two Angels (1513 CE). The single little winged angel holding the frame with both hands, his head right above that of Christ, could be also regarded as an additional departure from the 15-16th CE iconography of the Veronica Veil (if the stone-sculpted face were to be identified with the famous Roman relic). See also Rome, flag with Veronica of the Swiss Guard dating from 1512, the Veronica depicted in a manuscript of the Divine Comedy, Venice, 1390, the Opusculum of Grimaldi of 1618 showing the face of Jesus on the Veil of Veronica with his eyes open, the Veronica by a 15th Flemish master and the limestone head of Christ, late 15th–early 16th century Netherlands, North Brabant. See also the Lateran palace image (thought to have been painted in Rome between the 5th and 6th century CE). Originally, the image was that of an enthroned Yeshua with a crossed halo, featured as the Teacher holding the scroll of the Law in his left hand while his right is raised in benediction. The face completely changed when Pope Alexander III (1159–1181) had the present one, painted on silk, placed over the original with the head sole appearing as if in LANDSCAPED FRAME (2×1) the rest of the icon being covered with an embossed silver plate and precious stones.”\n| #30-32 Replies | “Now the Holy Face on the Templecombe panel does also look like a mix of BOTH the Holy Face of the Veronica Veil and that of the Holy Shroud. What now if the original Edessan Image was actually a mix of the Holy Face of the Holy Mandylion and that of the Holy Shroud as the two could have been kept in the same reliquary, the veil face overlaying that of the shroud … and separated sometimes between the early 7th and the mid-10th CE?”\n| #44 Reply | “Most likely the Breton calvary of the “Park ar Groaz ru” stone-sculpted face is second mid 15th c. CE and a mix of the Holy Shroud face, the Holy Face of the Veronica II and the Uronica/Acheropita (Veronica I) in terms of landscaped frame 2×1 in conjunction with little winged angel head.” \n(End Note: the Veronicas I & II shall not be confused with the Veronica III NOW kept in Rome).\n\n","date":"April 16, 2014 at 4:35 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-99837","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Daveb, re. 9. If it is that easy,then the link between the Image of Edessa/Turin Shroud has been established, carbon dating becomes redundant, the mystery is solved. The Vatican would love to see it, so there would be no more need to check the provenance.\n\n","date":"April 17, 2014 at 8:43 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-100481","author":"Louis","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"I did not say that Scavone was correct in his assertions that it was taken in 1204, only that he had made the assertion. You seemed to think he no longer believed what he had previously written.  I thought you might have a reason for saying so.\n\n","date":"April 18, 2014 at 1:23 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-100577","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"I did not think anything of the sort, but to say “somehow acquired the shroud”, as Scavone did, can also mean that it was stolen. It is likely that de la Roche handed over the relic to the Knights Templar for safekeeping after he left Athens for France, where the situation was unstable. The knights had impregnable monastery-fortresses and kept their mouths shut and did not say anything to Pope Innocent III because of the threat of excommunication, and so did the Italian royal family later.\nSee question no. 2 in the interview “Was there a link between the Knights Templar and the Turin Shroud?” on the Holy Shroud Guild.\nHappy Easter!\n\n","date":"April 18, 2014 at 3:12 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-100868","author":"Louis","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Thank you for the explanation. You had stated: “Daniel Scavone does not believe that the Mandylion/Shroud was stolen in 1204 …” I had reasonably assumed that implied the Shroud remained in Constantinople after 1204, to be taken at some later date. The Shroud was clearly stolen in 1204 by Crusaders from its Byzantine owners, if Robert de Clari’s statement means anything. \nI do not share the same confidence in Barbara Frale’s credibility that you seem prepared to do, in your write-up of your interview, but that is a matter of personal judgment. In particular I wonder at her claims that the TS was kept in Qumran for some 1000 years. I await the outcome of your further investigations on the claims that the Shroud came into the possession of the Templars. \nI wish you all the blessings of the Easter message. My own activities so far have included delivering the narrations of the Passion readings on Palm Sunday and Good Friday, I discover somthing new in the gospel texts each time I read them. Dan’s blog has served the purpose of always heightening my awareness of details I had previously missed. This evening (Holy Saturday here) I shall deliver the Exodus reading, with Pharaoh’s chariot wheels getting bogged down in the Sea of Reeds.\n\n","date":"April 18, 2014 at 5:00 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-100910","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"It seems that de Clari’s statement, found in the manuscript preserved in Copenhagen, is an important link in Shroud studies and also the reason why Ian Wilson never fails to mention it.\nQumran does not seem to have been a place where the Shroud could have been stored. According to Qumran excavator Father Roland de Vaux, who was also the first editor-in-chief of the Dead Sea Scrolls, the settlement/monastery was razed by the “Decima Legio Fretensis”, the Tenth Roman Legion commanded by Vespasian (at that time) on the way to besiege Jerusalem in AD 70. There were no Jewish or Jewish Christian communities in the region after that, the latter group having fled to Pella.\nFrale’s claim was probably based on the theory that the Shroud was stored in a jar like the ones found in the Qumran caves. I took a photograph of one of these jars many years ago,and there seems to be no reason why such jars were not used in Jerusalem and elsewhere in ancient Palestine. It is of course possible that the Shroud was stored in such a jar, but not necessarily in Qumran. There were Essenes living in Jerusalem, who, in my view, may have traded jars made in Qumran for clothing and footwear, for instance.\nSome of the material I have cannot be revealed and one person in the field of Shroud studies with whom I shared it also preferred to keep quiet. It is a “hint”, but not an essential link in establishing a link with the knights. If you have read what had been going on in Shroud research around a decade ago and the recent e-mail from the highly qualified Bishop Marcelo Sánchez Sorondo on possibilities of fresh carbon dating, a stretch of which was posted on this blog about two weeks ago, the picture becomes crystal clear. I hope to work on another lead in the Templar connection shortly, but it will depend on what material will be available for my research. \nI see you have become an “Elder” of the community, and that is good for you. We always have something important to transmit to the next generation. The awareness you talk about is a consequence of the readings. Sometimes such an awareness arises spontaneously and instantaneously, as if by accident, but that I think is a special gift from God.\nHappy Easter to all!\n\n","date":"April 18, 2014 at 7:31 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-100961","author":"Louis","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"@Louis, thanks for your idea about translation of Shroud Books from German or English into French. All the Shroudies interested by these projects of translations can contact me on the email: fgazay@cirac.org. I am also available to convert the translations into eBook and publish them on Amazon.\n\n","date":"April 28, 2014 at 12:58 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-105011","author":"Francois","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"@all: Sorry but I could not discuss earlier your different remarks on the Mandylion stone that I discovered on a crucifix in Brittany. Here are my answers:\n@Mike M: The stone Mandylion of the Breton calvary has really the epsilon blood stain on the forehead as we can see on the Turin Shroud. Yes, it is a  highly suggestive proof that the Mandylion could be the Shroud folded in 8.\n@David Bowman:  Nowadays, the mark epsilon (E) is practically indiscernible on the stone Mandylion. I have underscored it by transfering to a tracing paper. Please see the result on the first image in page 6 of my report: http://www.cirac.org/Mandylion.pdf\n@daveb of wellington: The “3” sign on the forehead is the result of the TS photography. An “epsilon” -and not a “3” sign- is present on the stone Mandylion of the Breton Calvary. Consequently we can assert the sculptor has really seen a Shroud face with this typical sign when he has sculpted this stone Mandylion. He has sculpted this Shroud face in a landscaped frame probably because his model was presented in an unusual « landscaped » portrait surrounded by a thick and solid framework similar to the « Face of Edessa » or Mandylion.\n@Max Patrick Hamon: The Breton calvary in the Red-Cross Field (“Park ar Groaz ru”) is supposed to be of templar origin because first there is a part of a templar building (Chamber of Red Monks) closely near the calvary and secondly because the date of erection found on the calvary pedestal seems to be 1304 as explained on my report. This date was deciphered by photography and mainly by transfer to a tracing paper (copy available on demand). But, as you say, we can also supposed that it is a stone copy of a much older stone template dating back to the Knights !Templar ! In fact we have no formal proof.\n\n","date":"September 18, 2014 at 12:24 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-152253","author":"FRANCOIS GAZAY","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"The fact is the calvary in the Red-Cross Field (“Park ar Groaz ru”)underwent restaurations at two points in time at least (in the early and late 16th c. CE). Most likely/At best the “16th c. CE Mandylion/Uronica/Veronica” is nothing but a stone copy of the 1304 CE original one.\n\n","date":"September 18, 2014 at 1:33 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-152274","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Re François Gaszay’s misreading (1304 for 1515): #22 Reply | “The only snag is the Breton calvary of the “Park ar Groaz ru” is JUST supposed to be of templar origin. The two stone-sculpted inscriptions on the pedestal read: 1600 CE (on the West face/no photograph provided) and “LANVOXO” (1515 CE) on the North face NOT AT ALL “MCCCIVOXb” (1304 CE + sculptor’s initials) (sic!).”\n\n","date":"September 18, 2014 at 1:41 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-152275","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Please note my name is François Gazay and not your miswriting François Gaszay.\n\n","date":"September 20, 2014 at 8:35 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-152677","author":"FRANCOIS GAZAY","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Typo: Re François Gazay’s misreading 1515 for 1304:\n\n","date":"September 18, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-152277","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Have you visited this calvary? Have you tried to decipher this date by transfer to a tracing paper as I did and wrote in my report in 2005?\n\n","date":"September 20, 2014 at 9:23 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-152688","author":"FRANCOIS GAZAY","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"Addition: (As reading key to the inscription on the North face of the calvary)LANVOXO shall be read LANMOXO as most likely the V sign is either an half erased or(deliberately?) faulty M letter. LANMOXO or L’AN MOXO is French for “the year 1515”.\nMost likely 1515 (on the North face) and 1600 (on the West face) are the dates of its construction and restoration.\nStylistically spaking, the stone “Madylion/Uronica/Veronica” is not/cannot be 14th c. CE but only late 15th C. CE or 16th c. CE.\n\n","date":"September 19, 2014 at 2:12 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-152406","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"LANMOXO or (L’AN MOXO)is MIDDLE French for “l’an 1515”.\n\n","date":"September 19, 2014 at 4:44 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-152431","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"New Book: The Templar Mandylion","post":"As I previously said the date of erection found on the calvary base ‘seems’ to be 1304. I deciphered this date mainly by transfer to a tracing paper (copy available on demand). I don’t understand your surprise concerning the date + sculptor’s initials ‘oXb’. This kind of combined inscriptions is often present on ancient monuments such as old calvaries, graves, etc.\n\n","date":"September 20, 2014 at 9:30 am","url":"https://shroudstory.com/2014/04/15/new-book-the-tem-plar-mandylion/","cat":"books","id":"comment-152691","author":"FRANCOIS GAZAY","site":"shroudstory"}]
