[{"title":"The Central Driving Force of Early Christianity","post":"The faith in the resurrection of Jesus-Christ is the corner stone of the Christian faith.  Like Paul said in one of his letters, if Christ has not rise from the dead, vain his your faith !  He also said that if the resurrection isn’t true, then we Christians are the worst off.\nTalking about the historic reality of the resurrection of Christ, Benedict 16, in his new book about Jesus, said this very interesting remark : “If we consider, from the story of the creation (from Genesis) and from the Decalogue, what is the importance of the Sabbath in the old Testament tradition, then it is evident that only a stong and deeply moving event could have lead to the reject of the Sabbath practice (by the first christians) and his replacement by the first day of the week.  Only an event that would have been printed in the souls with extraordinary force could have lead to a change so central in the religious culture of the week.  Theological speculations alone would have not been sufficient for this change.  The celebration of the Lord’s Day, who, from the beginning, had distinguish the Christian community (from the Jewish community), is for me one of the strongest proof of the fact that, on this first day of the week, something amazing happened :  the finding of the empty tomb and the encounter with the Risen Lord.”\nI fully agree with this reflection by the pope and I found this piece of evidence very interesting.  Historically, there must have been a very extraordinary event to push the Christian to adopt another day of celebration than the Sabbath day.  When you know the importance of this day for the Jews of this time, you understand that, indeed, something remarkable happened.  And only an important event like the resurrection of Christ could have force the apostles to get out (at the risk of their lives) and proclaim the good news.  Christian faith is not based on some ideas or concepts but on a real historical event.  There’s no way to explain the emergence of Christianity other than to accept the fact that there was some people (the disciples) who were convince to have seen Jesus alive after his crucifixion and his entombment…  And the reality of the empty tomb (and the empty shroud !!!) was important as a sign of this event.  Now, the only question left to us is this :  Do you believe in their testimony or not ?\n\n","date":"May 17, 2011 at 10:27 am","url":"https://shroudstory.com/2011/05/16/the-central-driving-force-of-early-christianity/","cat":"books","id":"comment-3152","author":"Yannick Clément","site":"shroudstory"}]
