[{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"Stevenson & Habermas (“The Shroud and the Controversy,” 1990, p.113) give three reasons (all from Dr. Frank Dr. Zugibe’s, “The Cross and the Shroud,” 1982, p.165) why the Shroud proves that Jesus was dead.\nFirst the body image exhibits signs of rigor mortis (incidentally a problem for the forgery theory-even if the forger knew about signs of rigor mortis, why bother depicting it?):\n“Rigor mortis is observable on the Shroud in several places. The head was bent forward, the feet were somewhat drawn up, and the left leg in particular had moved back toward its position on the cross. Especially visible in the three-dimensional image analysis of the Shroud are the retracted thumbs and the `frozen’ posture of the chest and abdomen. As was also noted by Bucklin [Medical Examiner, Los Angeles], the entire body was quite rigid and stiff, occupying some of the positions it did on the cross.”\nSecond, some of the bloodflows are post-mortem (another problem for the forgery theory as the distinction between pre- and post-mortem bloodflow was unknown in the 14th century):\n“The second evidence of death in the man of the Shroud is the post-mortem blood flow, especially from the chest wound. If the heart had been beating after burial, the blood literally would have been shot out onto the cloth. But the blood oozed out instead. Also, a comparatively small quantity of blood flowed, and there was no swelling around the wound. Finally, the blood from the chest, left wrist, and feet separated into clots and serum and was much thicker and of much deeper color than it would have been prior to death.”\nThird (my favourite), if Jesus’ chest cavity was pierced with a Roman lance (as the Shroud attests), and if by some miracle he was still alive after it, there would be “a loud sucking sound” coming from the spear wound as he inhaled:\n“Zugibe [Chief Medical Examiner, Rockland County, New York] also mentioned a third piece of evidence based on his medical experience. If Jesus had been alive after the spear wound, the soldiers and others at the site would have heard a loud sucking sound caused by breath being inhaled past the chest wound. Zugibe related that when answering a distress call after a man had been stabbed in the chest, he heard the loud inhaling of the unconscious man all the way across the room. He saw this phenomenon as `a direct refutation of the theory that Christ was alive after being taken down from the cross.'” \nBut then why let the facts get in the way of a good story!\nStephen E. Jones\n\n","date":"February 14, 2013 at 4:30 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24196","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"I checked out the article, and noted that after speculating on which of the Tibetan monks won the prize for fertilizing Mary’s eggs, five egg recipes were recommended, as was a visit to Burger King, and for entertainment I could ogle several media celebrities in various states of undress, such is the scholarly authority of the food pages of the Examiner.  \nHolger Kersten is not being at all original in his speculation about the so-called missing years being spent in India.  Louis Jacolliot, had a seemingly identical theory way back in 1869.  There are several other alternative locations, the poem by William Blake of course suggests Britain.  But this is not the end of it.  For a compendium of alternative venues, generally in tandem with the “swoon hyppothesis” (refuted by Stephen’s notes above) and further authoritative comment, check out: http://en.wikipedia.org/wiki/Unknown_years_of_Jesus . \nIt comes down to this – “What can be gratuitously asserted, can be gratuitously denied!”  \nAs for the so-called missing years, Mark 6:3 perhaps gives the best explanation: “Is this not Jesus the woodworker?” would even suggest a rather unremarkable fellow in his youth, carving bits of wood in Galilee!\n\n","date":"February 14, 2013 at 5:31 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24199","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"I too find this INCREDIBLE book TRULY INCREDIBLE!!!\nNow,,, what does incredible mean?…\nOh, yes…\nIncredible indeed…\nNow I must look up what ‘evidence’ means…\n\n","date":"February 14, 2013 at 6:40 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24204","author":"Hugh Farey","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"Dave you wrote: “As for the so-called missing years, Mark 6:3 perhaps gives the best explanation: “Is this not Jesus the woodworker?” would even suggest a rather unremarkable fellow in his youth, carving bits of wood in Galilee!”\nThe true fact is Yeshu’a was a tekton, Greek for the Aramaic nagar that is  “a builder” meaning his profession was “carpenter AND stone cutter” (see the way he used building-related metaphors in the Gospels).\n\n","date":"February 14, 2013 at 8:24 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24212","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"Thanks, Max.  I was relying on John P Meier’s rendering of the passage in “A Marginal Jew” (also incidently occurring in the reprise of Tim Rice’s reprise lyric J.C. Superstar)  JPM: “For example the astonished Jews of Nazareth, disconcerted at the hometown boy who presumes to teach them in their own synagogue pose the question “Is this fellow not the woodworker (tekton)?” (Mk 6:3a).  Matthew changes the jibing question to “Is this fellow not the son of the woodworker?” (Mt 13:55) whereas Luke even modifies it further to “Is this fellow not the son of Joseph?” (Lk 4:22) omitting any mention of Jesus’ trade entirely.     .  ”  Either way, he seems to have been well enough known in his hope-town, as a hitherto unremarkable fellow, without excursions abroad.\n\n","date":"February 14, 2013 at 3:05 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24269","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"Correction due to temporary editing difficulty in WordPress: Either way, he seems to have been well enough known in his home-town, as a hitherto unremarkable fellow, without the need for speculative theories in excursions abroad.\n\n","date":"February 14, 2013 at 3:09 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24270","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"Dave, regarding this point, in the book Eastwards to Tartaria, Robert Kaplan points out that Nazaret was only five km from Nazareth southwards. Seforis was completely destroyed in year 4 BC by Varo, the Roman legate. More or less, the same year Jesus was born. In the following years Seforis was rebuilt. Probably, a tekton in the area had the opportunity to work in the reconstruction of Seforis.\nThe point is that Seforis became one of the few places where tolerance between jews and pagans bloomed and the city authorities decided not to join the revolts of years 66-70 or the later one of Bar khova.\nRobert Kaplan mentions that to which extent the atmosphere of tolerance that a young tekton might have found while working in Seforis, could have had an impact in Jesus’s teachings of love is still a matter of discussion among scholars.\nUnfortunately, I have never found any work on Jesus early days from this angle, beyond this quote by Kaplan.\n\n","date":"February 14, 2013 at 5:16 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24285","author":"Gabriel","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"Typo error:Seforis was only 5 km from Nazareth southwards\n\n","date":"February 14, 2013 at 5:18 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24286","author":"Gabriel","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"Gabriel: The common westernised spelling of the city is Sepphoris, which may help in any further search.  Meier happens to mention speculations about the possibility of Sepphoris being an influence in Jesus’ life.  But Meier’s approach seeks to be essentially historic and he is only interested in such speculations only to dismiss them as not being based on any factual evidence, and providing no real information for a proper historical approach.   \nI personally find it intriguing that it was at Sepphoris, as you say only 5km from Nazareth, that the True Cross (Vera Crux) eventually disappeared when the Crusaders were defeated by Saladin who captured it as a war trophy during the battle of Hattin.  I liked the romantic idea that it was as if the wooden cross had returned to the home town of Jesus, where he himself had worked in wood, and had included it in a romantic little essay I published in my parish magazine.  \nSepphoris had been rebuilt by Herod Antipas, tetrarch of Galilee until he was banished in 39 AD.  \nEncyclopedia Britannica mentions several works on Sepphoris, but I doubt that they would shed any light on Jesus’ activities there.  They include: A.H.M. Jones, The Greek City from Alexander to Justinian (1940, reissued 1979), is a good introduction to ancient cities like Tiberias and Sepphoris. Zeev Weiss, “Sepphoris,” in Ephraim Stern, Ayelet Lewinson-Gilboa, and Joseph Aviram (eds.), The New Encyclopedia of Archaeological Excavations in the Holy Land, 4 vol. (1993; originally published in Hebrew, 1992), pp. 1324–28; Yizhar Hirschfeld, Gideon Foerster, and Fanny Vitto, “Tiberias,” in Ephraim Stern, Ayelet Lewinson-Gilboa, and Joseph Aviram, The New Encyclopedia of Archaeological Excavations in the Holy Land, 4 vol. (1993; originally published in Hebrew, 1992), pp. 1464–73, are good, short introductions to the cities that take into account the ongoing archaeological work at the sites. Rebecca Martin Nagy et al. (eds.), Sepphoris in Galilee: Crosscurrents of Culture (1996), is a well-illustrated, general introduction to the history and culture of the city.\n\n","date":"February 14, 2013 at 9:44 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24310","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"I am strongly offended that anyone would summarily and insultingly dismiss another person’s ideas, calling them “goof-ball”,  in face of a large body of supporting evidence. It makes me wonder who is the real “goof ball” in the dialogue.  \n I don’t know, nor does anyone know with certainty,  where Jesus is buried… if He is buried at all. The connection between East and Christianity is a lot stronger than most people realize.  In the East’s ancient structures we find an abundance of Greco-Roman architecture.   There are lot of people in the East who believe Jesus’ tomb is in Kashmir and have located and revere it.   Murree beer in Pakistan is  named after Mary. According to the Pakistanis her grave is located in their country.  The names Abraham and Sara are curiously similar to the names of the Hindu God Brahma and his wife Sarasvati.  Hebrews eat beef but do not worship cows.  Hindu’s worship cows but do not eat beef.  After all, the Messiah’s job description included the duties of gathering in the lost tribes and a trip to the East would be of necessity. The 4,000 mile Silk Road from China to Alexandria was an active avenue that blossomed with trade and cultural exchange.   That is what traders do when the merchant deal is completed; they celebrate over a beer or two and exchange ideas.  You know, Abraham did dispatch some of his sons to the East.  St. John Chrysostom in his  Homily 26 from The Homily of Hebrews tells us the bones of Moses were laid in a strange [East] land. The seraph used by Moses for healing (Numbers 221:8) is taken straight from the ancient Buddhist-Hindu practice of Kundalini Yoga.\nWhat is “goof-ball” is to believe that an unbelievably  talented thirteen year old kid could stand toe to toe with Temple scholars debating scripture and then spend the next seventeen years of His life in the boon-docks of Nazareth,  “growing  in strength and wisdom” while happily working away in his father’s carpenter shop; a whistle while you whittle kind of upbringing.  If Jesus didn’t die in the East could he have spent time there?  Occult skills, like food multiplication, healing and so forth are acquired and emerging skills available to saintly people and in the ancient East there were many schools for that purpose.  The great Buddhist Saint Milarepa attended one and acquired magical skills which he used to extract revenge against his family’s enemies. Moses had them and used them effectively against the Pharaoh.  \nWhat is equally “goof-ball” is to not ask the question, if Jesus acquired the resurrected body He is said to have acquired,  then why did the stone need to be rolled away from the tomb?  Doors, walls and grave stones don’t mean anything to spirits.   If the full Sanhedrin had voted on Jesus’ fate the vote would have been 69 to 2 in favor of executing him.  The abstainers…..Nicodemus and Joseph of Arimathea.  Did Joseph of Arimathea, wealthy and influential as he was,  work a deal with Pilate?  After all, Pilate’s wife advised against the guilty verdict because of a dream she had.  Pilate did what He did, at least in part,  in order to avoid a riot in a population that was swollen because of the Passover Feast.   How come Jesus died so quickly on the cross?  Death from crucifixion could take days.   Why is it the two thieves were alive at the end of the day but not Jesus?  Can blood gush from the wounds of a dead man?  Why wasn’t His body dumped into a heap along with the bodies of the two thieves (and their broken legs) to be consumed by scavenging creatures as was the practice?  Why weren’t His disciples and relatives rounded up, their wealth confiscated and then sold into slavery as was Roman practice?  When one man and a small army revolted in Sepphoris in 6AD, the then capital of Galilee with a population of 30,000,  the Romans crucified 2,000 men, sold the residents into slavery and burned the city to the ground.  The Romans were brutal.   Perhaps a deal was struck between Joseph and Pilate.   Just maybe, just maybe,  Jesus wasn’t dead when taken from the cross.  Maybe after all he didn’t refuse the soothing “medication” that was offered to Him at the outset. Maybe the image on the Shroud was created in the same fashion as the one He deposited on the veil of Veronica while He was alive.  Maybe the gospel writers, in their enthusiasm for promoting their brand of Christianity, got carried away with their work. \nWho knows?  Who will ever know?  The facts and reasonable (but unanswered) questions at least suggest other possibilities for explaining Jesus’ death and resurrection.  Where there is smoke there is usually fire.  Lets be more accepting of the opinion of others and stop from calling “goof ball” those who have legitimate concerns and the courage to raise them.\n\n","date":"February 14, 2013 at 3:50 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24274","author":"Tom Devins","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"I’m sorry the word ‘goof-ball’ occurred in this posting, but I note that it refers to the article about the book ‘Jesus Lived in India’ rather than the book itself. The article, after all, includes successive phrases such as “the evidence strongly suggests” and “there is ample evidence,” which give a wholly unjustified weight to what is presented in the book. There is, I think, an interesting linguistic correspondence between Abraham and Brahma, Sara and Saraswati, and for that matter Krishna and Christ. I also think that’s all it is, an interesting correspondence. I agree that there is a small group of people who maintain that some sites in India also have New Testament correspondence. To claim that this, or any of the other evidence attested, “strongly suggests” anything, or is “ample evidence” is simply untrue.\nI note that the whole tenor of Tom Devins’ comment above is much less assertive. “I don’t know” and “Maybe, just maybe” and “Who will ever know?” I don’t think this is ‘goof-ball’ and agree that “reasonable questions suggesting other possibilities” are at least worth some consideration. I hope that the book ‘Jesus lived in India’ is as humble in its presentation as Tom’s posting.\nElsewhere on this blog however I notice that Tom asserts that “The Catholic Church… through Fr Francis Tiso’s on-site investigation… has confirmed the most recent incident…” of a “rainbow body” dematerialisation. This is entirely untrue. Fr Tiso’s own investigation was dignified and spiritual but not at all scientific and anyway did not come to any definite conclusions other than to assert that the rainbow body phenomenon is quite different from resurrection. There is no suggestion that “The Catholic Church” has any particular interest in it one way or another.\n\n","date":"February 14, 2013 at 8:36 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24303","author":"Hugh Farey","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"I admire Hugh’s restraint in the comments of his first paragraph above, and believe they’re on the right track.  I’d merely observe that failed academics also have to obtain a living and writing sure-to-sell books with outrageous speculations is one way of putting food on the table. \nThe idea of peregrinations in India and Tibet is one attempt to fill in the “missing years”, The Glastonbury legends and the speculations of Mormonism that Jesus spent time in early America are others.\nScholars with few exceptions reject these theories. Modern scholarship has generally rejected any travels by Jesus to India, Tibet or surrounding areas as without historical basis:\nRobert Van Voorst states that modern scholarship has “almost unanimously agreed” that claims of the travels of Jesus to Tibet, Kashmir or India contain “nothing of value”.\nMarcus Borg states that the suggestions that an adult Jesus traveled to Egypt or India and came into contact with Buddhism are “without historical foundation”.\nJohn Dominic Crossan states that none of the theories presented about the travels of Jesus to fill the gap between his early life and the start of his ministry have been supported by modern scholarship.\nLeslie Houlden states that although modern parallels between the teachings of Jesus and Buddha have been drawn, these comparisons emerged after missionary contacts in the 19th century and there is no historically reliable evidence of contacts between Buddhism and Jesus.\nPaula Fredriksen states that no serious scholarly work places Jesus outside the backdrop of 1st century Palestinian Judaism. \nFor further authoritative comment, refer to the site I mentioned in a previous comment above.\n\n","date":"February 14, 2013 at 10:06 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24312","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"I cannot comment on the book as I have not read it, nor can I put into writing my thoughts as eloquently as Hugh or Dave, but here is what goes thru my mind when I hear stories of Jesus traveling to India or anywhere else; Where is the archaeological proof of these travels? Why would these travels not be mentioned in the Gospels? Most importantly why would Jesus need to travel to these areas, if he was whom he claimed to be? I don’t believe for a moment, that there is anything he would have gained from these travels that he already did not know, things such as wisdom or knowledge or enlightenment etc;….Why is it so hard for people to consider that he simply bide his time as a simple builder, until it was his time to shine.\nR\n\n","date":"February 15, 2013 at 2:31 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24327","author":"Ron","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"Holger Kertsten claims are just speculations and the swoon theory has been dismissed long ago by forensic experts.\nNevertheless like the Da Vinci theory on Shroud image production this theory surfaces from time to time and we must be aware of it.\nMy husband approaches this subject thoroughly in his book «Sudário de Turim, mortalha de Cristo ou fraude medieval?» (unfortunately not yet in english language..)and for those interested on this issue I provide one of the  references he consulted, an interesting reading by historian Edgar J. Goodspeed Famous Biblical Hoaxes or Modern Apochrypha Chapter one The Unknown Life of Christ http://www.tentmaker.org/books/Famous BiblicalHoaxes.html  \n                             regards\n                       Maria da Glória\n                Centro Português de Sindonologia\n\n","date":"February 15, 2013 at 4:58 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24342","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"The link does not seem to work Maria.\nThanks,\nR\n\n","date":"February 15, 2013 at 4:01 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24390","author":"Ron","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"http://www.tentmaker.org/books/FamousBiblicalHoaxes.html\nTry that. No spaces between Famous, Biblical or Hoaxes.\n\n","date":"February 15, 2013 at 7:29 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24398","author":"Hugh Farey","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"Footnote to my first comment above: “I checked out the article, and noted that after speculating on which of the Tibetan monks won the prize for fertilizing Mary’s eggs, five egg recipes were recommended, as was a visit to Burger King, and etc…”  \nArticle in this morning’s “Wellington Dominion Post”, Sat, 16 Feb, cites instances this week of customers’ complaints against two separate Wellington Burger King restaurants for selling burgers with disgusting grey and green moulds.  Customer posted photos of offending burgers on Facebook, resulting in aggressive reactions from franchise holders who ordered the customers off the premises.  And so far it has not been an unduly hot summer in Wellington.  It seems that the food pages of The Examiner not only lack scholarly authority on matters religious, but their restaurant recommendations are also best ignored!\n\n","date":"February 15, 2013 at 3:50 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24388","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"Another example of an old story brought into the limelight just because the Christian belief in the Resurrection is systematically being denied by some scholars and provides opportunities to make films, write books and indulge in bad archaeology in order to make money. Having read the book around ten to fifteen years ago, and noting down around eighty dubious claims and mistakes, it has to be said that this is certainly not something that can fall into the category of “recommended reading.” For those interested in a shortcut to find out what has been claimed about Jesus in India and how it can be easily dismissed see the article “The Quest for Jesus in Shroud research” on the HSG website. Kersten does not belong to the tradition behind this rubbish but it is useful to him for furthering his cause: to get Jesus out of the way. He has not succeeded and Hindus in general do not take him seriously.\n\n","date":"February 15, 2013 at 9:07 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24400","author":"Louis","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"I’m sorry Ron.\nPlease try to google «the unknown life of christ edgar j. goodspeed» or http://www.tentmaker.org/books/FamousBiblicalHoaxes.html \nhope this will work\nThanks to Hugh farey for the help\n                          Maria da Glória\n\n","date":"February 18, 2013 at 5:33 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24643","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"The Evidence Strongly Suggests Nothing of the Kind","post":"Sorry for mistyping Hugh Farey\n                       Maria da Glória\n\n","date":"February 18, 2013 at 5:46 am","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","id":"comment-24646","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"}]
