[{"title":"The Extinction of Humanity?","post":"It’s good that this point was raised, it is part of what I told him about there still being a lot more in the box.\n\n","date":"April 5, 2014 at 1:14 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-96822","author":"Louis","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"Hi Dan, John,\nJohn, we met at St. John’s University in February, when Barrie Schwortz gave his presentation. My degree is in Environmental science. Perhaps I can assist with certain facts and details for your chapter “The Apocalypse of Selfishness.”\nBest wishes,\nBill, GTG\nhttp://www.goingtruegreen.com\n\n","date":"April 5, 2014 at 2:24 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-96838","author":"Bill, BBVpublishing","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"Hi John, but here’s fruitful information.\nConservation biology emerged as a distinct professional enterprise with its own practices, cultures, and social institutions in the 1980s. In one sense, it is possible not only to place and date, but even to time, its emergence as an organized discipline: at about 5 p.m. (EST), 8 May 1985, in Ann Arbor, Michigan, at the end of the Second Conference on Conservation Biology. Two ad hoc committees, chaired by Jared Diamond and Peter Brussard, had met during the conference to discuss the need for a new society and a new journal. Following their recommendations, an informal motion to found the society was passed, and Michael E. Soulé was given the task of organizing the new society. It was decided to found a new journal, Conservation Biology. That a successful European journal, Biological Conservation, devoted to the same topic, had been in existence since 1968 apparently went unnoticed. Participants at the Ann Arbor conference seem to have been convinced that they were boldly going where no one had gone before.\nIn another sense, a science of biological conservation is centuries old, going back to the traditions of forest and game management developed in many countries, particularly Germany and India, in the eighteenth and nineteenth centuries. There is as yet no systematic historical or philosophical analysis of the question whether modern conservation biology should be viewed as an enterprise distinct from these earlier disciplines rather than as a development from them. There are also interesting questions about the relation of conservation biology to more traditional biological sub-disciplines, especially ecology. This entry will return to those questions after recounting the historical context of the emergence of conservation biology and explicating its current conceptual structure.\nReturning to Ann Arbor, with hindsight, it is hard not to attribute the sense of self-laudatory pioneering mission among the participants of that conference to little more than a strange but persistent myopia in the vision of the conservation community of the United States during that period. Two factors contributed to that myopia: (i) a genuine lack of awareness of developments elsewhere, particularly in Australia (see below), that were critically shaping the conceptual structure and practices of the emerging discipline; and (ii) the Ann Arbor conference constituted a sharp break from an immediate past during which some highly uncritical attempts to apply ecological principles to problems of biological conservation had resulted in publicly recognized failures (see below). Participants at the Ann Arbor meeting clearly hoped that the development of an explicit agenda for a new discipline represented a transition to maturity that would prevent — or at least discourage — such mistakes in the future.\nIn north America, particularly in the United States, ecologists had generally begun to be concerned with biological conservation only in the 1960s when large-scale anthropogenic conversion of neotropical habitats had forced them to recognize the possibility that their field research sites might soon disappear. One result of such habitat conversion was that species were being driven to extinction before they were scientifically described and studied. Given the well-established north American tradition of designating national parks for nature conservation, a not unexpected response to this problem of habitat destruction was to pursue the creation of nature reserve networks throughout the world. The problem of reserve network design became the first theoretical problem that conservation biology could uniquely claim at its own. In the United States in the 1970s ecologists tried to solve this problem by applying island biogeography theory on the assumption that reserves are adequately modeled as viable islands in oceans of anthropogenically transformed habitat (May 1975, Diamond & May 1976). Within ecology, despite its early promise, island biogeography theory was coming under increasing critical experimental scrutiny during this period (Simberloff 1976). Nevertheless, its principles were adopted in the context of reserve network design even by some international conservation agencies without any attempt to assess whether its empirical basis was sound. The attempt to use island biogeography for reserve network design soon generated a major controversy, whether single large or several small (SLOSS) reserves were preferable. Though this controversy persisted for almost a decade, its ultimate resolution was that it had no solution: by 1985 it was clear that the answer depended on highly contingent local factors (Soulé & Simberloff 1986). The Ann Arbor conference occurred in this context in which it had become clear that conservation biology needed new foundations if it was ever to develop as a successful discipline.\nFor attempts to use island biogeography theory in reserve network design the most telling criticism came from Margules, Higgs and Rafe (1982) who pointed out both that the model had not been empirically established and that there were important disanalogies between biological reserves and islands. In particular, areas between reserves were not as inhospitable to species in the reserves as oceans were to insular species. Graeme Caughley, Chris Margules, Mike Austin, Bob Pressey, and several others, mainly in Australia, pioneered a radically different approach to biological conservation than what was emerging in north America. This approach partly reflects a unique Australian experience including the fact that extensive habitat conversion had only begun relatively recently, leaving much greater scope for systematic biodiversity conservation compared to Asia, Europe, or even North America (Margules 1989). More importantly it reflects the practical background of most Australian conservation biologists in the management of wildlife and other biological resources (rather than in academic research). This resulted in an explicitly pragmatic attitude to the solution of biodiversity conservation problems. The role of academic ecology was comparatively limited. Rather, the version of conservation biology developed by the Australian school relied on generic “common sense” ecological heuristics which will be emphasized in the discussion below. There was also little explicit consideration of the ethical or normative basis of conservation practice, again in sharp contrast to practice in the United States even though, by paying explicit attention to socio-political factors, this approach was implicitly incorporates anthropocentric norms at every stage. A 1989 volume of Biological Conservation edited by Margules brought the Australian approach to biological conservation to a broader audience. The Australians were also the first to propose a reasonable solution to the problem of reserve network design.\nIn the United States, things moved quickly from the Ann Arbor conference. In December 1985, Soulé published a long manifesto, “What is Conservation Biology?” in BioScience, the journal most visible to the academic and, especially, the non-academic biological community in the United States. Soulé proclaimed that a new inter-disciplinary science, conservation biology, based on both substantive and normative ethical foundations, had been recently created to conserve what still remained of Earth’s biological heritage (Soulé 1985). This science was ultimately prescriptive: it prescribed management plans for the conservation of biological diversity at every level of organization. Setting the tone for much of the discussion during the early years of North American conservation biology, Soulé emphasized that the new field was a “crisis discipline.” The first issue of Conservation Biology appeared in May 1987, and the first annual meeting of the new society was held in Montana State University in June 1987. Within ecology, in 1986, Daniel Janzen published an influential exhortation, “The Future of Tropical Ecology,” urging ecologists to undertake the political activism necessary for conservation: “If biologists want a tropics in which to biologize [sic], they are going to have to buy it with care, energy, effort, strategy, tactics, time, and cash. I cannot overemphasize the urgency as well as the responsibility… If our generation does not do it, it won’t be there for the next. Feel uneasy? You had better. There are no bad guys in the next village. They is us [sic]” (Janzen 1986, 306).\nThus, between 1985 and 1987, conservation biology emerged in the United States as an organized academic discipline. Its focus became “biodiversity,” a term that entered the everyday and scientific lexicons around 1988. This neologism was coined by Walter G. Rosen at some point during the organization of the 21 –24 September 1986 “National Forum on BioDiversity” held in Washington, D. C., under the auspices of the US National Academy of Sciences and the Smithsonian Institution. The new term was initially intended as nothing more than a shorthand for “biological diversity” for use in internal paperwork during the organization of that forum. However, from its very birth it showed considerable promise of transcending its humble origins. By the time the proceedings of the forum were published, Rosen’s neologism — though temporarily mutated as “BioDiversity” (Wilson 1988) — had eliminated all rivals to emerge as the title of the book that emerged from that conference.\nThe term “biodiversity” found immediate wide use following its introduction. The first journal with “biodiversity” in its title, Canadian Biodiversity, appeared in 1991, changing its name to Global Biodiversity in 1993; a second, Tropical Biodiversity, began appearing in 1992; Biodiversity Letters and Global Biodiversity followed in 1993. A sociologically synergistic interaction between the use of the term “biodiversity” and the growth of conservation biology as a discipline led to a re-configuration of environmental studies in which biodiversity conservation became a central focus of environmental concern. However, for all its appeal, “biodiversity” has proved notoriously difficult to define — see the entry on biodiversity. In 1989, Soulé and Kohm published a primer on research priorities for the field. It was catholic in scope, including demography, ecology, genetics, island biogeography, public policy, and systematics, as components of conservation biology. It called for massive biological surveys, especially in the neotropics, and for the circumvention of legal barriers to the use of US federal funds for the purchase of land in other countries (Soulé & Kohm 1989). In 1993, Primack produced the first textbook of conservation biology, and in 1994, Meffe and Carroll followed with a more comprehensive effort.\nIn the United States, the legislative context of the 1970s largely determined the course of research in conservation biology in its early years, an exemplary case of the social determination of science. The decisive event was the passage of the Endangered Species Act (ESA) in 1973 at the end of a long history of US federal conservationist legislation including the Endangered Species Preservation and Conservation Acts (of 1966 and 1969, respectively) and the National Environmental Policy Act (1969). Subsequent amendments to the ESA required not only the listing of threatened and endangered species but also the designation of critical habitats and the design of population recovery plans. Equally important as the ESA was the 1976 National Forest Management Act (NFMA). This act required the Forest Service to “provide for diversity of plant and animal communities based on the suitability and capability of the specific land area.” In 1979 the planning regulations developed to implement this provision required the Forest Service to “maintain viable populations of existing native and desired non-native vertebrate species in the planning area.”\nSince populations of threatened and endangered species are generally small, attempts to implement this legislation naturally led to a focus on small populations subject to stochastic fluctuations in size, including extinction. In a 1978 dissertation, “Determining Minimum Viable Population Sizes: A Case Study of the Grizzly Bear,” influenced by the ESA, Mark L. Shaffer attempted to formulate a systematic framework for the analysis of effects of stochasticity on small populations. It introduced the concept of the minimum viable population (MVP), the definition of which involved several conventional choices that eventually came to be widely reified as definitive benchmarks: the probability of persistence that was deemed sufficient as a conservation goal, and the time up to which that probability had to be maintained were both matters of choice. One common choice was to define an MVP as a population that has a 95 % probability of surviving for the next 100 years[15] both numbers are conventions with no firm biological basis though, for a definition to be of operational relevance in the field, some precise numbers such as these were necessary.[16] The conservation and recovery plans for threatened and endangered species required under the ESA led almost inexorably to the risk assessment of small populations through stochastic analysis. The name population “vulnerability” analysis was used by Gilpin and Soulé in 1986; population “viability” analysis soon replaced it. The optimism of the late 1970s and early 1980s was reflected in Gilpin and Soulé’s slogan: “MVP is the product, PVA the process” (Gilpin & Soulé 1986, 19).\nHowever, by the late 1980s, it became clear that the concept of a MVP was at best of very limited use. Even for a single species, populations in slightly different habitat patches may show highly variable demographic trends, especially in the presence of stochasticity, resulting in high variability of estimated MVPs depending critically on local context. By the early 1990s PVA began to focus, instead, on estimating other only slightly more robust parameters such as the expected time to extinction. Had PVA been successful in providing empirically reliable estimates for such parameters, there would be no doubt about the centrality of its role in conservation planning. Indeed, it would justify Shaffer’s rather grandiose 1994 claim: “Like physicists searching for a grand unified theory explaining how the four fundamental forces … interact to control the structure and fate of the universe, conservation biologists now seek their own grand unified theory explaining how habitat type, quality, quantity, and pattern interact to control the structures and fates of species. Population viability analysis (PVA) is the first expression of this quest.” (in Meffe & Carroll 1994, 305-306). Unfortunately, though over hundreds of PVAs have been performed, a common methodology for PVA, or a consensus about its value, is yet to emerge. Indeed, there is ample room for skepticism about the future of PVA in conservation biology.\nIn Australia, Margules and Caughley were among those who expressed such skepticism (Margules 1989; Caughley 1994). Caughley argued that two “paradigms” had emerged in conservation biology: a “small populations” paradigm and a “declining populations” paradigm. In PVA, the former dictated the use of stochastic models, the latter the use of deterministic models. Caughley argued that the former contributed little to the conservation of species in the wild because, beyond the trivial insight that small populations are subject to stochasticity, stochastic models do not provide insight into why species are at risk. Conservation has a better chance of success in the latter case since, with large populations, it is usually possible to design field experiments with appropriate controls to determine the ecological mechanisms of decline. Such experiments, in turn, should lead to new and badly needed theoretical explorations within the declining populations paradigm. Though Caughley did not couch his discussion in terms of national traditions, the small populations paradigm dominated research programs in the United States whereas the declining populations paradigm dominated the Australian tradition.\nThe period since 1995 has seen a new consensus framework for conservation biology emerging through the integration of insight from both traditions. In this framework, which will be the focus of Section 2, the central goal of conservation biology is the establishment of conservation area networks (CANs) and their adequate maintenance over time through appropriate management practices. From Australia, Margules and Pressey formulated this consensus framework in a 2000 article in Nature; in the United States, The Nature Conservancy presented a very similar framework in 2002, underscoring the extent of the consensus that has been achieved. Central to this consensus is the idea that conservation biology is about systematic conservation planning through what is sometimes called the “adaptive management”\n of landscapes. The actual framework that has been developed is one for the prioritization of places for biodiversity value and the formulation of management plans for the long-term (in principle, infinite) survival of the biological entities of interest. The entire process is supposed to be periodically iterated because species (or other units) may have become extinct — or have recovered from problems — in the interim, thereby changing the biodiversity value of a place, or because management practices may have turned out to be ineffective. This is the only sense in which the process is supposed to be adaptive. However, the framework is so new — it is yet to be fully implemented anywhere — that it is possible that this requirement of being adaptive will require changes in the framework as it is currently understood. At present “adaptive management” is only a slogan embodying a tantalizing promissory note.\nRegards,\nAlexander Walker\n\n","date":"April 5, 2014 at 3:12 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-96850","author":"Alexander Walker","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"Thank your for your thoughtful response. I am not writing a book on environmental per se. My point is that selfishness was an important, if not the most important driving forces of evolution. It was the evolution of a species with reflective consciousness  that led to “sin.” Before reflective consciousness, there was no sin. The natural world was a violent place but an animal hunting a prey or a male killing in order to predominate among the females was not sinful.\nOnly the human species can “sin” and ultimately all sin springs from selfishness.\nShorthand:: Christ was the epitome of selflessness and his Resurrection the promise of a reward for selflessness: union with the primordial consciousness from birthed our existence.\nI can’t write an encyclopedia or a multi-volume history of human thought and I hope to write for a broader audience than academics or philosophers.\nI began this project about three years ago. It is now clearer than ever, that selfish driven greed threatens the continued existence of the human species.\nThe providence or irony of the Shroud is that it wasn’t until the invention of photography and now advances in quantum analysis that we could begin to understand the true nature of the Shroud,\nGiven what’s happening, it has not been a moment too soon.\n\n","date":"April 5, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-96857","author":"John Klotz","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"Forgive me if I overlooked the point, I did not realize you were developing an Hamartiology. \nBut, to comment on the “selfishness” doctrine, Kant held that the fundamental principle of our moral duties is a categorical imperative. It is an imperative because it is a command (e.g., “Leave the gun. Take the cannoli.”) More precisely, it commands us to exercise our wills in a particular way, not to perform some action or other. It is categorical in virtue of applying to us unconditionally, or simply because we possesses rational wills, without reference to any ends that we might or might not have. It does not, in other words, apply to us on the condition that we have antecedently adopted some goal for ourselves. Of course, other imperatives have a similar non-conditional form. For instance, ‘Answer an invitation in the third person in the third person’ is an imperative of etiquette, and it is not conditional. (Foot, 1972, p. 308) It does not apply to you only on the condition that you have some end that is served by being polite. But this imperative is not categorical in Kant’s sense, since it does not apply to us simply because we are rational enough to understand and act on it, or simply because we possess a rational will. Imperatives of etiquette apply to us simply because prevailing customs single us out as appropriate objects of appraisal by standards of politeness, whether we accept those standards or not.\nAlexander Walker\n\n","date":"April 5, 2014 at 4:37 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-96866","author":"Alexander Walker","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"“The point is this: humanity, for the first time since its emergence as a self conscious entity, faces extinction.  The driving forces for that extinction primarily involve the selfish exploitation of the environment.  Our air, water, and land are all yielding to onslaughts from interests seeking immense wealth, whatever the environmental costs.”\nCuriously I had just read a short article from our Archdiocesan newspaper that I picked up last evening at church; Wel-Com, April 2014, “In search of the Ark” by Kieran Fenn, which addresses this issue. It is just a little too soon for the article yet to appear on the Wel-Com web-site. Fenn draws on Valdes, A.A. ‘The Bible Questions People Ask’. I was aware of the Babylonian origins of the Noah story and so the article attracted my attention. \nSome extracts:\n“The author took a pre-existing story, with all its interestng details, to transmit a religious teaching. The first lesson was that the flood came because of human frailty, a lesson for our own endangered planet..”\n“Sin accumulated to the point of corruption and perversion that provoked a catastrophe. With all this, the world came back to to the chaos that existed before creation. The order that God has put into creation could be destroyed by human responsibility.\n… No reason is given Noah; he is told to do it and wait. Ridicule from his contemporaries would follow, and Noah’s only answer could be ‘God ordered me to do so. I obey.’ No complaint comes from his lips over four chapters; no other biblical character is told so little and saying so little. Finally God reveals the secret of the rain.\nThe message is clear according to the ways of the Old Testament. If humanity obeys God’s orders, it will be saved. If it disobeys, it faces self-destruction. God specifies the measurements, materials and form of the ark. We have to shape our lives according to God’s dimensions and then we will transcend any storm. Those who do not listen to God’s guidance will drown.” \nReserves are one way of assisting the survival of threatened species, and NZ conservationists have been active in ensuring the survival of many species of our vulnerable indigenous bird, insect, reptile and plant life by moving colonies to predator-free near-by islands, and taking action against exotic introduced predators.  We have recently scored a major success in the UN against whaling in our Southern Ocean. \nHowever there is a much wider issue, that of the survival of the planet. The depredation of large forests which in the past have ensured atmospheric stability, aggravated by our ever-increasing use of fossil fuels, the consequential global warning, melting of the ice caps with rising sea levels, and the drowning of low-lying islands and present coastal areas which will no longer be inhabitable. Most of us are already experiencing the effects of climate change, its effects on changing food production patterns, more frequent climate disasters, and major fatalities in local populations. \nAdam was given steward-ship of the earth. Too often he has seen this as a license to exploit rather than conserve.  There are still lessons to be learnt in the story of Noah.  There is one threatened species I shall not miss from our planet, that of the ever-depleting global-warming deniers!\n\n","date":"April 5, 2014 at 4:37 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-96865","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"I haven’t really been following.  Is the book supposed to reflect reality or is it a work of fiction?\n\n","date":"April 5, 2014 at 6:35 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-96895","author":"Andy","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"Andy,\nWhich book are talking about “Noah” or my manuscript which has been in progress but is reaching completion. Two more Chapters including the Apocalypse of Selfishness. Daveb cited an article from New Zealand.\nThere was the Intergovernmental Panel on Climate Change (IPCC) that  issued a report this week which is devastating. If you live in Bangladesh or a Pacific island,  the Apocalypse isn’t tomorrow, it’s today.\n\n","date":"April 5, 2014 at 7:04 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-96903","author":"John Klotz","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"Andy, I can assure you that the first several chapters of John’s book is good solid factual history of the scientific studies of the Shroud, particularly the development and work of the STURP team.  From here, he develops his own particular thinking on the coming of the Quantum Christ, tying it into the work of Teilhard de Chardin. It now seems to have developed a life of its own, and is addressing relevant critical issues now facing all humanity.\n\n","date":"April 5, 2014 at 7:14 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-96907","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"Selfishness while right on the mark (money) seems more like a “60’s” term.  In today’s lingo, John, it is more commonly expressed as Duality vs. Non-Duality of Spirit.  Quantum Christ like the Christ of Scripture should possibly emphasize John 17:21):  That that all may be One, Father, as I in Thee and Thou in Me.”  No room for duality there unless one wants to remain outside the Bun.\n\n","date":"April 5, 2014 at 10:05 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-96951","author":"clublu22014","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"I don’t mean to offend anyone and I don’t mean to demean my self when I say that sometimes we may spend way too much time at the library. Although I think Occam’s Razor is much over used, I have suddenly found my self resorting to it. There ares several permutations of it.\nBasically I beleive the most sophisticated form is that the solution that requires to the fewest assumptions is more likely the correct one. But it is rephrased. In the military there developed the KISS principle which has two variation depending if you use a comma. It can be “Keep it simple,  stupid.” (with a comma) which calls the addressee stupid. Or it can be without a comma: “Keep it simple stupid” which means that the ultimate in simplicity  should be “simple stupid.”  [understandable by even stupid people].\nI have found the work of Daryl Domning very intriguing. There is an article of his available on the web site of the Jesuit web site of the Jesuit web site America: See Evolution, Evil and Original Sin” America,  Vol. 185 No. 15 (November 12, 2001)\nHe also wrote a book with  colleague, the late Monka K. Helwig:., “Original Selfishness: Original Sin and Evil in the Light of Evolution” (Ashgate, 2006); \nThe issue is whether selfishness was one of the driving forces of evolution. Start there. It’s a simple, but not too simple, proposition. \nNow I appreciate there  are theologians who do not like simple propositions and wander-off into complex constructs that have little relationship to how we actually live our lives. I believe that in  the Great Commandment(s) and the Last Judgment,  Christ made it very simple. In fact he kind of applies Occam’s Razor when he explains the dual commands to love God and Love neighbor and then he says “On these two commandments depend the the whole  law and the prophets.”\nI note that some modern translations have changed the last line. But I like my Confraternity Edition which cost me $1 as a Freshman at CBA Syracuse in September, 1950.\nThat’s very simplistic of Christ isn’t. it? Even more simplistic is the “parable” of the Last Judgment where FOUR TIMES we are told the litany of what we must do to prove our love of God. It is, in the end, it is what we do for “these the least of my brethren.” In my view, both the Great Commandments and the Last Judgment are about the mandate to be selfless and not selfish.\nIn sum, because it’s getting late and I have work to do, I submit the following ridiculously simple equations.\nSelfishness = Evil\nSelflessness = Love.\nThere are a few patches of humor in my manuscript that are no mistake. Chapter 1 which sets forth how we make judgments about facts references, I kid you not, Richard Dawkins, Ira Gershwin, Joe Kennedy and the lyrics of “I Can’t Get Started with You.. Facile yes, but dead on…\n\n","date":"April 6, 2014 at 12:51 am","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-96988","author":"John Klotz","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"Pierre Teilhard de Chardin was a paleontologist, not a physicist, and science, both in the fields of biology and physics, has made gigantic strides since his time. He was not convincing in everything that he wrote, sort of tried to brush things under the carpet when these were inconvenient to him, however these issues are under discussion today. It is these that has made people abandon churches and religious belief, even deny the existence of a deity.\n\n","date":"April 10, 2014 at 10:16 am","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-98100","author":"Louis","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"Louis,\nWhen I was growing up on the Northside of Syracuse, I was the smartest kid on the block. I thought I could do anything. Then the summer before I began college, I was an summer encampment of the Civil Air Patrol (in NYS, not La. Neither David Ferrie nor Lee Harvey Oswald were there) I met a contemporary from Albany who had won a science prize building tesserats. We got some soda straws a  and we built one. I suddenly realized looking at our completed tesserat that time really was the fourth dimension. I mean REALLY.\nOf course my youthful arrogance of being the smartest guy on the block is long gone. I now recognize genius in others when I see it.\nTeilhard may not have deciphered the total mysteries of the universe, but he was a ground breaker in getting Christianity to accept evolution, and not just tolerate it but to rejoice in it.\nThe concept of selfishness as a driving force of evolution and it’s status as “original sin” is not something I got from Teilhard but from an article in America, The conflict between selfishness and selflessness becomes then the primary fact of life. Christ was the martyr of selflessness crucified by the selfish. The Resurrection is a promise of reward to the selfless.\n“There I stand.” Who said that Luther? Machs nichts. I am saying it.\n\n","date":"April 10, 2014 at 11:18 am","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-98109","author":"John Klotz","site":"shroudstory"},{"title":"The Extinction of Humanity?","post":"Hi John\nThanks for the comment. That’s right, Teilhard got the Church to accept evolution and John Paul II did say it was ” a fact”, Benedict XVI unwilling to accept everything, thus making him assert that “you cannot drag 10.000 generations into the laboratory.” Benedict has foresight since original sin and when exactly God put the soul into the human species will need discussion. You may have misunderstood me because I do not really swallow everything that RD has said, in fact he can be very biased, but there are questions he has raised quite rightly.\nWhich is what brings me to the days in school and college, where the influence of the Jesuits, of different nationalities, was very strong. With the American Jesuits I learnt sports, with the German Jesuit lay brothers, all very tough veterans of WW II, fighting in the Reichswehr and Luftwaffe, fed up with destruction in war, making them become missionaries with a lot of conviction, I learnt discipline. While working as a journalist after college I was invited for lunch one day at a big Jesuit seminary. The lunch was preceded by Benediction, officiated by the famous and controversial Belgian Jesuit Father Jacques Dupuis. At that time it looked like he was mixing things up in his theology, today it is different. The issues he raised have also been tackled by the professor of Goan origin Gavin D’Costa at the University of Bristol, advisor to both Catholic and Anglican Churches in England.     \nWhat I am trying to say is that in a way the field of Shroud studies is very much like the fields of Biblical Archaeology and Studies, where we can can see extremes. It is always better to move slowly rather than reach hasty conclusions, often based on preconceived ideas :\nhttps://www.academia.edu/6568383/Does_the_Shroud_show_a_Mandaean_burial\nHopefully by next week a big ten-page pdf article on Jesus in Biblical Archaeology should be ready and posted, which will be another example of what is mentioned above.\nIt is not difficult to agree with you when it comes to the significance of the Resurrection. The ‘selfless’ you mention is what we all need, even in the field of Shroud studies, where a lot of ego bashing will be needed.\n\n","date":"April 10, 2014 at 12:15 pm","url":"https://shroudstory.com/2014/04/05/the-extinction-of-humanity/","cat":"books","id":"comment-98115","author":"Louis","site":"shroudstory"}]
