[{"title":"New Shroud Novel: A Cardinal’s Sin: Attack on the Holy See","post":"Secrets have been threatening to destroy the Vatican for centuries if not a millenia and a half. Somehow, I am reminded of Scripture: Beware false prophets. \nI have been debating whether Amazon Premium was worth it. I was unconsciously enrolled in a year ago for free trial without my realizing it but decided against it renewing it, and that was before the price was jacked up.\nRight now, I feel towards Amazon the way I feel about Google. The reach is amazing and I couldn’t be writing as effectively as I think I am without them. To get out of print books like the complete works of David Sox on the Shroud  (three volumes) or a book on the making of “Silent Witness” through Amazon was amazing,  But the arbitrary manner in which they operate is seriously wrong.\nI used to have a beautiful picture of the harbor in Rockport MA as my Google wall paper. . Them Google decided it wanted the space for advertising so now I get inane wall papers with blinking lights and marching letters. I hate it. But the convenience of Google mail and that where ever I am on whatever computer I am working on,  I have access to years of E-Mail, is amazing and extraordinarily useful. To replicate through other providers would cost a bundle and a lot of time programming it.\nThe only alternative is Apple and they are an even more stringent regime – and ultimately more expensive,\nGoogle, Amazon  and the Apple could teach the Vatican a few things about maintaining discipline. (See, I brought this rant back to topic).\nAnyway, I find the truth about the Vatican more interesting than the fiction.\n\n","date":"March 16, 2014 at 7:12 am","url":"https://shroudstory.com/2014/03/16/new-shroud-novel-a-cardinals-sin-attack-on-the-holy-see/","cat":"books","id":"comment-89545","author":"John Klotz","site":"shroudstory"},{"title":"New Shroud Novel: A Cardinal’s Sin: Attack on the Holy See","post":"Nobody dies horribly in Chapter 1, which makes a pleasant change from the style of recent novels on the Shroud. Just a few broken teeth…\n\n","date":"March 17, 2014 at 7:47 am","url":"https://shroudstory.com/2014/03/16/new-shroud-novel-a-cardinals-sin-attack-on-the-holy-see/","cat":"books","id":"comment-89979","author":"Hugh Farey","site":"shroudstory"}]
