[{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Reminder, I wrote on June 15, 2012 at 12:11 pm (#55 Reply):\n” Each year at Easter, in the very course of the Holy Saturday liturgy, an L shape Resurrection mark (as a sign alluding to Lumen Christi) used to be deliberately imprinted on the Paschal candle by placing granules of incense. NOW the Pray Ms 3B miniature, is just followed by the text of the Exultet (Exultet jam Angelica turba coelorum/Exultent Divina Mysteria)… the very hymn that was sung at mass while the L shaped like mark was precisely imprint into the wax with granules of burning incense.\n\n","date":"June 11, 2013 at 12:00 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36704","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"I want to play too. What if it’s not an L at all, but an upside down 7?\n\n","date":"June 11, 2013 at 12:23 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36707","author":"David Goulet","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Typo corretions: “embedded into wax” (instead of “imprinted”)\n“L-like shaped Resurrection mark”\n\n","date":"June 11, 2013 at 12:32 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36709","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"To David, this is more fun in square Hebrew, Aramaic or else in Greek or Latin.\n\n","date":"June 11, 2013 at 12:36 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36710","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"In Old French too.\n\n","date":"June 11, 2013 at 12:38 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36711","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"I don’t know how long ago you’re referring to, Max, but every Holy Saturday I’ve been at for the last 50 years, and that’s nearly all of them, the priest has stuck 5 grains of incense in a cross shape into the Paschal Candle. Still, I notice (good ol’ Wiki) a thing called a Gammadion, which is usually defined as a swastika, and other things called Gammadia, which are either other shapes made by arranging four gammas in a pattern, or individual gammas worn on liturgical garments. I notice that the earliest known examples of these were found at Massada. Nobody seems to know what, if any, significance the gamma had.\n\n","date":"June 11, 2013 at 1:10 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36714","author":"Hugh Farey","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"I was referring to an Easter Byzantine ritual (as far as the L-shaped pattern is concerned).\n\n","date":"June 11, 2013 at 1:38 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36719","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"A somewhat obscure one then. Most orthodox churches don’t have a Paschal candle as such, but a trikirion of three rather thin candles with no incense stuck in at all. Where does the L-shape come in?\n\n","date":"June 11, 2013 at 4:04 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36726","author":"Hugh Farey","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Re the earliest L-like shaped mark  I came arcross, on June 15, 2012 at 12:43 pm (#58 Reply), I wrote: \n“A BLACK “L” stands out on the flashing gold pallium of a Resurrected Christ in Majesty (Santa Pudenziana Mosaic, ca. 400, Rome). Now the pallium is the Roman evolved form of the Greek himation). Also notice the zigzag weave pattern on the left arm pummel. Besides a 111/112cm width cloth shows stretched just at the back of the throne at Christ shoulder level. Before the 2002 restoration of the Shroud exact width was 111-112cm. \nThe two Christ face (That of the mosaic and that of the Turin Shroud are at the same scale 1:1 with congruent spy details. The face of Christ is 4-5cm off-centred on the left just like in the Turn Shroud and the postion of the feet on the Pudenziana mosaic is also assymetrical as on the TS.The latter’s body image, seen under a certain angle and light, looks like translucid straw yellow impression. This is consistent with the use of flashing gold mosaic tiles to feature Christ’s pallium.\nThe L letter identifies the clothing as Pallium Lumeni Christi = Lumen Christi in Sindonem\n= L in Sindonem = Linus Christi. The official first Pope’s name was Linus as secular representaive of Christ on earth that is as his vicarius (Peter was not officially Pope).”\n\n","date":"June 11, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36732","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Note: Lumen Christi (Latin: Light of Christ). See also Lumen verum illuminans omnem hominem (antiphon) and Inventor rutili dux bone luminis (hymn)\n\n","date":"June 11, 2013 at 5:09 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36733","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Mr Padgett seems to have come up with some intriguing arguments for his solution to the Enigma. Crucial to his case is the actual date of composition. There had been an exposition of the Shroud at Turin in 1868, so that it may have come to Elgar’s attention fairly early in his life (1857-1934). Secondo Pia’s attempts at photography occurred during the eight day exposition commencing on May 25, 1898, and he succeeded on May 28, the Shroud being returned to the Royal Chapel on June 2. The Wiki entry states that Elgar composed the work during 1898-99, although another source I referred to gave 1896, which would seem to be too early if Pia’s photos were the inspiration. Possibly the 1896 date may be unreliable judging from the Wiki commentary, which has the entry:\n“Elgar’s account of the piece’s genesis was that after a tiring day of teaching in late October 1898, he was daydreaming at the piano. A melody he played caught the attention of his wife Alice, (etc)”. \nOther possible intriguing solution are given in the Wiki account, including various popular tunes which Elgar stated were incorrect, and also other explanations including an approximation to the math constant pi, from the intervals 3 1 4 2, although apparently this is a fairly common sequence in composition.   \nThe Roman liturgy for the Easter Saturday vigil Paschal Candle ceremony requires the celebrant to cut on its surface a cross with the figures of the current year, each figure being placed in one of the cross quadrants, and to inscribe the first and last letters of the Greek alphabet above and below, and saying “Christ yesterday and today the beginning and the end Alpha and Omega all time belongs to him (etc)”. He then inserts the five grains of incense into the form of the cross as symbols of the five wounds. I am unable to comment on the Greek practices, whether an L shape or cross was incised.\nThe allusion to the swastika as a combination of four gamma symbols is interesting, but I think only illustrates that symbols can be a rich and imaginative source of inspiration. The swastika itself is a very ancient symbol and would pre-date Masada. It’s form is usually reversed from its more familar Nazi form. It can be found in ancient India and also China. My Chinese daughter-in-law from North China frequently decorated eggs with rows of such symbols as signs of ‘good luck’.\nElgar composed several religious works, including a number of Oratorios both before and after the Enigma Variations. Was the Shroud the inspiration for the Enigma? Who knows? Like many artistic creations, it may have had manifold inspirational influences, some no doubt subconscious, although Elgar seems to have made it clear that there was one particular enigma behind it. As we have now come to learn, the Shroud is certainly enigmatic!\n\n","date":"June 11, 2013 at 5:36 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36735","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"The gammadion is extensively discussed on a few “Sacred Texts” sites. It seems to have had an Indo-Aryan origin but other cultures also imported it. Earliest examples associate it with the sun, whence sun-god, whence any supreme god according to the culture. It was Indian Buddhism that introduced the symbol to China. The central position sometimes included a disc or wheel indicating the sun, and the arms supposedly the rays pointing in all directions. There were variations, sometimes only with three spokes somewhat similar to the Manx three-legged symbol. \nA problem I have in interpreting the Shroud “poker holes” as a gamma symbol is that the shape of the hole pattern depicted above is an inverted gamma pointing in the opposite direction. It is more like an L or even 7. Depending on which one of the four patterns is observed, two show an L and two show a gamma, because of the folding when the holes occurred. If the ‘L’ is intended as an abbreviation for “Lumen” then this is Latin, not Greek of course, whereas the holes seem to have occurred during a Greek-speaking period rather than during Roman Latin. \nIf, however the pattern is intended to be a Gamma, then I wonder if it can be associated with the Trinity. The Greeks picked up the Hebrew habit of gematria (Gk “esopsephia”) during New Testament times (e.g. Rev use of the numer 666 for antichrist). The Greek numerary system at this time used 30 alphabetic symbols for numerals, divided up into three groups of ten, for units, tens, hundreds. The symbol gamma denotes the numeral 3! Is this an instance of “disciplina arcani”, a secret way of saying that this object belongs to the Tri-une God? Or if it is intended to be a gamma on the Shroud, then “This is God’s cloth”? \nOf course it all depends on whether the pattern is deliberate or a providential accident with incense during worship!\n\n","date":"June 11, 2013 at 10:07 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36744","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Correction: Greek numerary system, 27 alphabetic symbols divided up into three groups of nine: 1 to 9, 10 to 90, 100 to 900.\n\n","date":"June 11, 2013 at 10:13 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36745","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"\ndaveb of wellington nz :\nThe Greeks picked up the Hebrew habit of gematria (Gk “esopsephia”) during New Testament times (e.g. Rev use of the numer 666 for antichrist).\n\nJust as a side note, the OT adds clarity to the interpretation of the 666 reference in Rev 13 in the book of Ezra. There we see the use of the ‘number of men’ phrase referring to the number of children called by a family name in the census taken of those coming out of Babylon to rebuild Jerusalem: “the *number of the men* of the people of Israel” -Ezra 2.2. The skip some short verses down and we read: “The children of Adonikam, six hundred sixty and six (666)” -Ezra 2.13. Adonikam = “my lord arose,” of the tribe of Dan from my research. \nThe bit about causing all to receive a mark (name) in the forehead or right hand is a pledge of loyalty to a global political super star (antichrist), a sort of spiritual marriage between the beast and whore of Babylon as a name is traditionally taken in marriage by the wife, and in Hebrew understanding name (shem) = essence; shem is the root of neshama (soul), and what it the essence of a man but his soul?: “upon her forehead a name is written, Mystery, Babylon the Great, Mother of Harlots, Abomination of the Earth” vs the marriage of the Lamb to the faithful bride, New Jerusalem, the number of his name, 144,000  “having his Father’s name written in their foreheads” -Rev14.1, cf Eze 9.4. The High Priest, foreshadowing Yeshua as Melchizedek, had the Name fixed on his forehead, Exo 28.36-8. \nJust as the registration/enrollment (not a tax as widely assumed; compare Luke 2.1 with Heb 12.23, same roots in Aramaic and Greek) decreed by Augustus Caesar as Pontifex Maximus would’ve included a pledge of loyalty soon before Christ came the first time around it will be with the second. The Roman elite, like the Jews and Samaritans, were aware of the Babylonian prophecies/Jewish oracles (ie, the head magi Daniel’s, Isaiah’s, even Balaam’s star prophecy, etc) of a world leader — the Seed of the Woman (cf Spica/Zera in Virgo/Bethulah) — who was to come on the scene in their time. The Roman ruling elite however hijacked the prophecies and applied them to Caesar to usher in a Golden Age, novus ordo seclorum if you like (see Virgil’s commissioned work, Eclogues IV, circa 37 BCE). Some of Nero’s astrologers were even convinced he was to rule from Jerusalem. \nBasically the Roman puppet Herod was following a legal precedence causing him to eliminate any competition to the fulfillment of this prophecy outside the line of Caesar which is why the good news from the Magi of the signal of the King’s (Melech’s) star (Zedek=”Righteousness”/Jupiter) was considered bad news: “When Herod the king heard this, he was troubled, and all Jerusalem with him” -Matt 2.3. His second coming will be bad news to the world political power structure again which still seeks to bump him from his rightful place on the throne as king of kings and rob him of his glory — quite literally as in the cause of the shroud image you might say.\nBut anyways.. how ’bout those poker holes!\n\n","date":"June 13, 2013 at 6:02 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36844","author":"EGM","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"interesting, but I am not convinced …\nYes Dave two of the four show the pattern as gamma. Also I agree that if it was meant an intentional marking of Gamma then it could represent the trinity – gamma has the numerical value of 3 in the Greek numericla system\nI offer some thoughts / questions:\n– If the holes represent an intentional representation of the L for Gamma, then why does it appear that there are a number of other much smaller burn holes? When viewed collectively do not the bigger and smaller holes argue for dropped hot liquid?  Unless in the act of forming the L with whatever implement there was some secondary small droplet leakage from the implement?\n– Why burn the L Shape on, and risk the damage to a sacred object? Why not write it / paint it?\n\n","date":"June 11, 2013 at 10:51 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36748","author":"Matthias","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Oh, you guys are so funny!\nWhat immediately comes to mind is each man views an object through his or her own lens.\nI, on the other hand, see a series of “hearts” and perhaps they were placed on the Shroud to symbolize Jesus’ great commandment, “Love thy neighbor as thyself.”   :)\nBest,\n\n","date":"June 12, 2013 at 12:26 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36752","author":"Angel","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"In looking at Shroud Scope at the poker holes, it reminded me that I remain fascinated by the horizontal trickle of blood along the lower back area. I can’t see any logical reason at all why a ‘forger’ would impose this.\nI proposed some months ago that the trickle came from blood flowing down the underside of the forearm, over the hip region, and down the small of the back, as Jesus was laid down following the descent from the cross\n\n","date":"June 12, 2013 at 2:12 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36757","author":"Matthias","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Angel: I’m glad I cause you mirth, as I really strive hard not to be boring, regardless of any particular comment I might make. They’re commonly referred to as L-shaped burn-holes, and Dan’s posting above notes that Elgar originally designated Variation XIII with no more than the single capital letter ‘L’, and is one of the arguments that Padgett uses to support his case that the “Enigma” is actually the TS, hence the thread above. If you see hearts there, that’s fine.\nMatthias: I think I’d be inclined to agree with you that very likely it was an accident. But once something like this happens, it can develop a life of its own, and it may seem providential and various interpretations can be read into it. There’s a type of primal thinking which tends to reject such events as random accidents, and supernatural causes can be read into the simplest of occurences. Dan recently posted an excellent series of papers by Pam Moon. She addresses the C-14 dating issue, discusses the question of contamination at length and refers to the water marks and burn marks. She sheds some new light on the “L” marks by reference to the Madrid Skylitzes history which contains some beautiful illustrations. Check out her paper “The Shroud of Turin in Constantinople? Paper I: An analysis of the L Shaped markings on the Shroud of Turin and an examination of the Holy Mandylion and Holy Shroud in the Madrid Skylitzes” © Pam Moon\nhttp://www.shroud-enigma.com/resources/Paper_1.pdf In there she discusses the ‘L’ holes at some length, and the likely cause being incense grains.\nBest!\n\n","date":"June 12, 2013 at 2:13 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36758","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"daveb of wellington nz,\nOn a serious note, I admire your knowledge and enjoy all your posts, but couldn’t resist the “hearts” remark.  I was just joking with you.\nBest,\n\n","date":"June 12, 2013 at 9:13 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36825","author":"Angel","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"thanks Dave. I liked Pam’s analysis on the L holes. Given how the shroud would have been folded, into a 2.2m x 0.55m dimension, it seems quite logical that it could have been draped over an altar, and then incense dropped on it.\nBut I have to admit I found her theory re the Madrid Skylitzes and the Shroud unconvincing!\n\n","date":"June 12, 2013 at 2:57 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36760","author":"Matthias","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Matthias: I know of three papers by Pam Moon, I think Dan listed two of them in a posting a few days ago. She seems to have a good grasp on the contamination and bacteria issues. From what she writes I doubt if it would be possible to C-14 date any textile reliably at all, unless it had been hermetically sealed. You may be interested in the other two papers if you haven’t already read them:\n“Coloured Dissolved Organic Matter (CDOM) contamination, mould damage, biocides and the carbon-14 dating of the Shroud of Turin”, © Pam Moon 2013: http://www.shroud-enigma.com/resources/The-C14-dating-of-the-Shroud—19.2.13.pdf\n“The Shroud of Turin in Constantinople? Paper 2, An examination of Byzantine art depicting Christ between AD 945 and AD 1042, following the arrival of the Holy Mandylion in Constantinople in AD 944” © Pam Moon:  http://www.shroud-enigma.com/resources/Paper_II.pdf\nEither way, regardless of the historic arguments, you get to see some beautiful and otherwise rare illustrations.\n\n","date":"June 12, 2013 at 6:30 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36772","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Mr Belz wrote: « […] very likely it was an accident. But once something like this happens, it can develop a life of its own, and it may seem providential and various interpretations can be read into it. There’s a type of primal thinking which tends to reject such events as random accidents, and supernatural causes can be read into the simplest of occurrences. »\n80% agreed (as a ‘fire’ trial by deliberate application of molten grains of resin from an incense censer just  cannot be totally ruled out). \nTo Angel: The true fact is Pareidolia, Apophenia and Hierophany (PAH triad), as psychological phenomena, DID influence diverse cultures across the world. \nMy personal research work and finds in archaeocryptology leads to me conclude that PAH seems to be present in the origin and/or development of the religions, Christianism INCLUDED. Its presence in a ‘sacred textile site’ such as the Turin Shroud can be traced up as early as about 1950 years ago (see e.g. Book of Revelation in the light of the TS + late antique Christian apocalyptic literature, Syriac secret liturgical rituals, late antique and medieval (pseudo-)hierographic literature, the Grail medieval legend etc).\nMore specifically, the second earliest ‘L’/‘Γ’ (gamma)-like shaped marks, I came across in my research work, are to be found on several ancient Egyptian and Ethiopian Coptic domestic, garment and/or liturgical textiles. Greek capital letter gammas (mirrored and non mirrored) generally occur in pairs (front and back or top and bottom). The repeated motif as 4 gamma-shaped patterns appears to have been at the same time both decorative and symbolic. Most likely, it does have a meaning as a reference to Yeshua’s burial winding sheet/garment 4 ‘L’/‘Γ’-shaped burn-holes caused by incense grains and geometrically distributed on the famous burial cloth. Besides the ‘L’ and ‘Γ’ the ‘I’ also occurs as early as the 5th c. CE. Etc.\nRoman and Byzantine paintings and mosaics often include representations of decorated textiles with ‘clavi’ that can symbolically be equated with the TS 4 geometrical burn-holes.\nRe gammadion (from Greek γαμμάδιον), in ancient Greek the word tetraskelion (Greek: τετρασκέλιον), literally meaning, “four legged”, is one of the other names for the shape. Now the Knights Templar’s ‘head’ or alleged ‘idol’ was reported (by Hugues de Payraud) to have  ‘four legs’, two at the front and two at the back.\n\n","date":"June 12, 2013 at 9:49 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36776","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Max, I’m not underestimating your knowledge on the subject.   My mother, throughout my life, always stated I was contrary and I suppose I am to a certain extent.    \nWhen I saw the “L” statement, I just had to comment, but “I see hearts” was only a joke.   :)\nYet, when I have a strong belief on a particular subject, my viewpoint will, in fact, be antithetical to those of others and I will fight to the death to defend it.  My nature too.\nBest,\n\n","date":"June 12, 2013 at 9:47 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36826","author":"Angel","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Oh I see, do hope it has nothig to do with “the contrary Angel(man) syndrome” ;-).\n\n","date":"June 13, 2013 at 6:20 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36846","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Typo: can symbolically be equated with the TS 4 geometrical SERIES OF burn-holes.\n\n","date":"June 12, 2013 at 10:03 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36777","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"PS: Supernatural causes can be read into the most ritualistic of providential occurrences, as far as TS image arch-miraculists are concerned.\n\n","date":"June 12, 2013 at 10:11 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36778","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"My original comment above: “There’s a type of primal thinking which tends to reject such events as random accidents, and supernatural causes can be read into the simplest of occurences.” was prompted by a story I read in a text on Primal Religions very many years ago, which struck me rather forcefully, and has stayed with me. \nThus an African or Aboriginal villager may visit a waterhole and be taken by a crocodile. A modern mind would see this as no more than an unfortunate random accident But the man’s relations would ask questions: “Why did it happen to this particular man? Why at this particular time?” and so on. Obviously some enemy had cast a spell, and they would endeavour to find the perpetrator, search out the man’s enemies and they would exact vengeance. This type of mind-set survived even well into a more enlightened age, and supernatural causes would be atrributed to quite casual events which might be interpreted as having some providential or even an infernal implication. The medieval witchcraft trials and trials by ordeal are other examples of this type of mind-set.\n\n","date":"June 12, 2013 at 6:51 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36817","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Yes, although the burn holes might have  been an ‘accident’ it might have been a divinely inspired one, just as the shroud image may have been generated by a divinely inspired naturalistic event.\n\n","date":"June 13, 2013 at 9:54 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36862","author":"matthias","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Matthias, 100% agreed.\n\n","date":"June 13, 2013 at 10:09 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36864","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Though I prefer the word ‘providential’ to the phrase ‘divinely inspired”;\n\n","date":"June 13, 2013 at 10:12 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36865","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Reminder: As far as the Holy Face of the Holy Mandylion and the Holy Face of Holy Himation aka the Turin Shroud connection as relics is concerned, the very word Mandylion is a Byzantine-Greek borrowed from the Arabic mandil (mindil in Syriac) i.e. a “SCARF”. Now Constantine VII Porphyrogennetos comments in his Book of Ceremonies that the loros (or ceremonial LONG SCARF or stole of Byzantine emperors) symbolized the burial shroud of Christ. The (co-)emperor(s) (+(co-)empress(es) + the 12 most important imperial figures + archangels in paintings and mosaics) normally wore it on Easter Sunday. It was draped all over his WHOLE BODY: “The men’s version of the loros was a long strip, dropping down straight in front to below the waist, and with the portion behind pulled round to the front and hung gracefully over the left arm. The female loros was similar at the front end, but the back end was wider and tucked under a belt after pulling through to the front again.”\n\n","date":"June 12, 2013 at 2:04 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36795","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Question: Seen in conjunction with the empress, did the Byzantine emperor draped in the loros symbolize resurrected Yeshua wearing his long burial shroud as an himation/achiton (draped loose next to the skin) of a Second Temple period gardener and appearing on the first day of the week to Mary Magdalene?\n\n","date":"June 13, 2013 at 8:10 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36855","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"MPH: “Now Constantine VII Porphyrogennetos comments in his Book of Ceremonies that the loros (or ceremonial LONG SCARF or stole of Byzantine emperors) symbolized the burial shroud of Christ.” \nThis reference seems particularly significant to me, and I find it increasingly difficult to reject Wilson’s Mandylion hypothesis even with all the criticisms against it. Constantine VII of course closely inspected the Mandylion on its first arrival in Constantinople, commenting on the “watery” appearance of the image, while his step-brothers were unable to discern it very well at all. \nIn addition we have the references quoted by Albert Dreisbach in his paper “Lazarus & Jesus” at the Atlanta conference in 2005:\n“… we should not be overly surprised to discover as early as A.D. 325, Pope Sylvester I established: that Mass be celebrated on an altar covered with a cloth of linen consecrated by the Bishop, as if it were the clean Shroud of Christ. ”\n“Theodore of Mopsuestia (ca. A.D. 350-428) expresses this motif’s incorporation into the liturgy, describing the role of the deacons in the liturgy as follows: ”\n“When they bring up (the oblation at the offertory) they place it on the altar for the completed representation of the passion so that we may think of Him on the altar as if He were placed in the sepulchre after having received the passion … the deacons who spread\nthe linens on the altar represent the figure of the linen cloths at the burial….”\nThese allusions, although they do not specifically refer to a cloth with an image, clearly demonstrate that the burial cloths were considered particlarly significant in the liturgy, they were clearly in the minds of the liturgists, and it is rational to infer that there must have been some specific known object giving rise to this outlook, for an emphasis to be made on “burial cloths” in the liturgy.\n\n","date":"June 13, 2013 at 6:56 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36889","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"There are at least six different ciphers in the Enigma\nVariations that point to the Turin Shroud: 1) Locks Cipher 2)\nHyphen Cipher 3) Romanza Cipher 4) FACE Cipher 5) L Cipher 6) Tasso\nCipher These ciphers are described on my blog at\nhttp://enigmathemeunmasked.blogspot.com/2013/06/elgars-turin-shroud-enigma-ciphers.html\nThe Turin Shroud was a famous religious relic eons before Secondo\nPia’s historic photograph on May 28, 1898. His amazing photographic\nnegative of the Turin Shroud became an international sensation in\nboth the secular and Catholic press. Elgar did not begin to openly\nwork on the Enigma Variations until five months later on October\n21, 1898. That makes the timing credible, especially since the\nsecret friend of Variation XIII is Jesus Christ.\n\n","date":"June 13, 2013 at 7:01 pm","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36890","author":"Robert Padgett","site":"shroudstory"},{"title":"The poker holes on the Turin Shroud deliberately put there to designate the cloth as sacred?","post":"Reminder: the L-shaped BLACKENED burn-holes DOES echo the clavus/key-like BLACK ‘L’  standing out on the flashing gold pallium/Roman himation of a Resurrected Christ in Majesty (Santa Pudenziana Mosaic, ca. 400, Rome). The fire trial or incense censer accident might well have occurred before 400 CE.\n\n","date":"June 14, 2013 at 7:51 am","url":"https://shroudstory.com/2013/06/11/the-poker-holes-on-the-turin-shroud-deliberately-put-there-to-designate-the-cloth-as-sacred/","cat":"books","id":"comment-36941","author":"Max Patrick Hamon","site":"shroudstory"}]
