[{"title":"The Urantia Book Again","post":"\nYodr777\n I find the possibility of it being produced by camera obscura very interesting.\n\nAs Sue Benford noticed, a camera obscura would not change left and right hand sides, meaning the forger would have placed the wound on the left side. Awkward for a genius.\n\n","date":"February 9, 2013 at 6:37 am","url":"https://shroudstory.com/2013/02/09/the-urantia-book-again/","cat":"books","id":"comment-23853","author":"anoxie","site":"shroudstory"},{"title":"The Urantia Book Again","post":"No one has a good idea how front and back images of a\ncrucified man came to be on the cloth. Yes, it is possible to\ncreate images that look similar. But no one has created images that\nmatch the chemistry, peculiar superficiality and profoundly\nmysterious three-dimensional information content of the images on\nthe Shroud. Again, this is all published in peer-reviewed\nscientific journals.\n\n","date":"February 12, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/02/09/the-urantia-book-again/","cat":"books","id":"comment-24091","author":"Summer Joyner","site":"shroudstory"},{"title":"The Urantia Book Again","post":"The Urantia Book is an amazing document. It says nothing\nabout the shroud except that it was thrown over a near-by cliff.\n(meaning it was not destroyed) … but the way they explain why the\ntomb was empty gives ample evidence that the shroud could be the\nphotographic image of Jesus. His soul resurrected but his body was\nleft behind. The angels were given permission to disintegrate his\nbody in an instant so they wouldn’t have to witness the natural,\nslow, decomposition of his body. That flash could have created the\nimage, in my opinion. Here’s the quote: “The mortal remains of\nJesus underwent the same natural process of elemental\ndisintegration as characterizes all human bodies on earth except\nthat, in point of time, this natural mode of dissolution was\ngreatly accelerated, hastened to that point where it became\nwell-nigh instantaneous.” 189:2.8 If the Urantia Book is a fake,\nit’s a doozy! Every word is the highest and best use of the English\nlanguage, there is no one making money on it, and it asks us to\nlook for the good in all religions that bring man closer to God.\nMost people just keep a closed mind and won’t really read\nit.\n\n","date":"February 12, 2013 at 11:34 pm","url":"https://shroudstory.com/2013/02/09/the-urantia-book-again/","cat":"books","id":"comment-24111","author":"Jeanine","site":"shroudstory"},{"title":"The Urantia Book Again","post":"The Urantia Book’s account of the resurrection, if true, provides credibility to the shroud of Turin. That’s the point I was trying to get across.\n\n","date":"March 31, 2013 at 5:52 pm","url":"https://shroudstory.com/2013/02/09/the-urantia-book-again/","cat":"books","id":"comment-28971","author":"Yoder777","site":"shroudstory"}]
