[{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"I am not a scientist.  I have a PhD in urban planning.\nI would like someone with scientific or engineering credentials to tell me their views on Fanti’s approach to testing the age of linen. Does it really have promise?\nPerhaps Hugh or Daveb might be able to assist.\n\n","date":"June 28, 2015 at 2:49 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-203935","author":"Thomas","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"There is no need to look for scientists. What was published in the book was omitted in the peer-reviewed paper, that came later. Só that is what you will havê to take into account.\n\n","date":"June 28, 2015 at 6:23 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-203947","author":"Louis","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"I do not know if this book advances Giulio Fanti’s ideas beyond what we have seen before.\nThere would be, I think, considerable value in discovering a reliable method of dating archaeological material other than by radiocarbon decay, and to his credit Fanti explored both the chemical and physical deterioration of linen, by means of FTIR spectrography and mechanical testing respectively. His method was to take known samples of different ages and correlate them to changes in their spectra and mechanical properties. If a reasonable correlation were found, then it would be possible to date material of unknown provenance by these methods. Unfortunately, Fanti has not published his findings in detail, and what has been published shows such poor correlation that his work has not been taken up by archaeological science as useful. So many other factors than age can contribute to the deterioration of archaeological materials that it seems unlikely that any measurement of such deterioration can be a reliable method of dating it.\nI have not had an opportunity to study Fanti’s numismatic findings, so cannot comment on them, but I’m afraid I’m unlikely to shell out $60 or $70 for the opportunity.\n\n","date":"June 28, 2015 at 7:02 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-203950","author":"Hugh Farey","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"You should read chapter five of this book (chapter two in the Italian edition), in particular the third and last section. If the contents has not been changed in the English edition, then you discover that Fanti has accurately selected the most damaged fibres for the experiment. Indeed he wanted to distinguish between the fibres of the Shroud and the fibres of the Holland cloth, He thought that the Shroud fibres are much older and used the microscope for individuating the most “old” fibres. No wonder that he ended up with really “old” fibres! This was a second selection of the worst fibres. There had been a first selection because the fibres in the dust collected by Riggi cannot be compared with the fibres freshly taken from whole threads for the control samples.\n\n","date":"June 28, 2015 at 11:19 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-203970","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"That is why what is in the book was omitted in the paper. A lot more work will be needed to make it correspond to what is in the book.\n\n","date":"June 28, 2015 at 8:21 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-203954","author":"Louis","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"Professor Fanti defended his experiments in the following interview:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nYet, as I said earlier, there is more to be done.\n\n","date":"June 28, 2015 at 11:25 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-203971","author":"Louis","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"‘ The Turin Shroud is the most important and studied relic in the  world.’ We often seem to read this but there has been actually a great deal more intensive research directly on the fabric and images ( writings,inks,etc,) of the Dead Sea Scrolls than of the Shroud and it has been undertaken by top- level specialists in the relative disciplines. As the recent report on the Scrolls in Minerva, the international journal of art and archaeology, noted’ no other set of documents has been subjected to so many analytical techniques’. The main difference ,of course, is that the Scrolls, after a poor start, have been open to direct specialist examination with increasingly sophisticated equipment.\nI would certainly argue that we have learned more from the Scrolls than we have from the Shroud.\n\n","date":"June 28, 2015 at 3:41 pm","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-203991","author":"Charles Freeman","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"Agreed to a certain extent, after having interviewed Professors Fitzmyer and Vermes and spoken to paleographers. For the Church canonisation is more important than relics and a lot will havê to change in the Shroud scenario before something gets done.\n\n","date":"June 28, 2015 at 4:14 pm","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-203995","author":"Louis","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"Thomas asks if Fanti’s approach to testing the age of linen really show promise.  My response to that question would have to be:  “Quite possibly.  But that there are some big ‘howevers’ “.  \nHugh has mentioned Fanti’s general approach, essentially measuring age-related changes in the spectral and mechanical properties of linen.  You can find his related papers or references to them on Barrie Schwortz’s shroud.com web-site.  Two in particular are: “Non-destructive dating of ancient flax textiles by means of vibrational spectroscopy” Authors: Giulio Fanti, Pietro Baraldi, Roberto Basso, Anna Tinti;  and “A NEW CYCLIC-LOADS MACHINE FOR THE MEASUREMENT OF MICRO-MECHANICAL PROPERTIES OF SINGLE FLAX FIBERS COMING FROM THE TURIN SHROUD” Authors: Giulio Fanti, Pierandrea Malfi.  \nI will confine my technical comments to the mechanical testing, the Cyclic-Loads machine.  Cyclic load testing has been used for several decades to measure the fatigue characteristics of engineering materials, particularly metallic materials such as steels and aluminium, and has a reputable history in engineering.  It is particularly suitable for testing materials which are susceptible to very many cycles of heavy loading over the life of the different components, such as engine parts and highly stressed components in railway bridging where heavy loadings are repetitive.  Typically all materials will fracture after a certain number of cycles for any given stress, down to a certain stress called the “endurance limit” below which no number of repetitions will produce fracture.  \nAnother mechanical characteristic of materials is the “Young’s modulus”.  This is the stress required to produce unit strain,  All materials will stretch when subject to a tensile load.  The strain is defined as the amount of extension divided by the length of the sample; the stress is the load divided by the cross-sectional area.  Young’s modulus is calculated by dividing the stress by the strain.  Several materials show elastic behaviour so that up to a certain elastic limit, strain is directly proportional to stress and Young’s modulus is fairly constant over this range.  Many materials however, such as aluminium are not elastic, and their stretch behavior increases with loading, so that for these more plastic materials the modulus is defined by adopting an appropriate engineering convention for them over the range of loading.   \nThe mechanical properties chosen by the authors as seemingly age-related were: breaking stress; two Young’s Moduli 1) relating to the last part of the increasing loading cycles, 2) relative to the first part of the decreasing loading cycles;  two loss factors relating to dissipated and stored energies and other factors.  \nMechanical properties of the flax fibres versus known ages of the samples were then correlated.  The authors write: “This goal was reached performing stress-strain measurements in 350 loading-unloading cycles of 85 different flax fibers belonging to samples of 12 different historical and modern flax fabrics, see Ref. [14], dating back to up to more than five thousand years ago, obtaining approximately 16,000 manual acquisitions.” \nThe authors thus obtained five correlation curves for their five parameters.  A measure of the “goodness of fit” when carrying out such work is the “Pearson’s correlation coefficient” = R.  If R = 0.0, then there is no obvious correlation between the parameter and age and consequently no obvious relationship;  If R = 1.0 then there is perfect fit and the parameter gives a very high predictability of true age.  For the five parameters, the authors claim values of R between 0.90 and 0.95, which on the face of it would seem to be quite high correlation ratios.     \nRather than taking a simple average of the five dating methods, the authors then proposed a “weighted mean” of the five methods giving greater weight to some apparently more reliable parameters than others.  They claim: “The resulting uncertainty of the historical dates deriving from the measured mechanical parameters has a standard uncertainty of about 200 years.” \nTaken singly, the five individual parameters give a very large range of possible dates for the TS, and with quite large margins of error.  The oldest date is 556 BC, error 336 years; youngest date 456 AD error 538 years.  However their weighted mean is 372 BC error 214 years.  I might be happier with this last result, if the authors had given a correlation coefficient for their choice of the weighted mean formula.  \nThere are many extraneous factors that can affect the mechanical properties of flax fibres.  The authors note the possible historic effects of humidity and heat.  They claim that these effects are manifest in the appearance of the fibres, such as their colour.  Various fibres were rejected for testing on these grounds.  Other effects, not evidently considered, result from the history of the parent fabric, such as repetitions of folding, rolling and methods of storage and their particular environment.  \nGian Marco Rinaldi above has referred to the subjective selection of apparently older fibres, which may raise a doubt as to the integrity of the selection process. \nI do not agree with Hugh’s conclusion that the results show such poor correlation that the method cannot be considered as useful.  However we need to know a lot more about the raw data, than has been forthcoming to date.  There is certainly the problem of obtaining sufficient calibration samples.  Acceptance of any new scientific method always requires its replication and peer review by other independent investigators, and of course so far, this has not happened. \nIn principle however, the method of mechanical testing might provide a type of credibility check on other more established dating methods, but because of the importance of extraneous effects mentioned, and these will always be unknown, it seems likely that quite large errors of at least 200 years or more, can never be eliminated.\n\n","date":"June 28, 2015 at 5:39 pm","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-204000","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"Thank you Daveb, appreciated.\n\n","date":"June 29, 2015 at 3:57 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-204037","author":"Thomas","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"After writing the above, it occurred to me that rather than taking an apparently arbitrary weighted mean of the five parameters, it may have been more fruitful if, after determining what were the apparently age related parameters, the investigators had attempted to carry out a multi-variate regression analysis.  \nThis would then yield a best-fit formula from the five parameters;  from this it would then be possible to derive what might possibly be a more satisfying result, a more persuasive correlation coefficient; and might even yield less of an error.  Such statistical analysis ought not to have been too much of a challenge for the capabilities of the Padua Engineering Polytech, if necessary consulting with their Mathematics department.  So far I’ve not seen any report that this was ever attempted.\n\n","date":"June 28, 2015 at 7:14 pm","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-204008","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"Re variability of an ancient 3/1 twill weave patterned handloomed natural linen fabric mechanical properties, the mechanical the stress-strain response and strength and failure strain distributions of its flax fibers and return force of its 3/1 twill weave are still to be acurately calculated per se and in reference to alkaline watery based solution in-soaking.\n\n","date":"June 29, 2015 at 2:45 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-204031","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"I have seen that finally you (and of course I am referring in particular to “daveb of wellington nz”!) have improved your comprehension of the matter\n(…but this happens after my many posts on the subject) …\nI’m happy for this late deepening of problems.\nBut you are not yet arrived at the same conclusion that\nI have written, that is, you must use a control system much\nmore accurate (= SPM controls based on AFM, AFM bending tests, etc.)\nin order to then have the statistical data both useful and credible.\nThe evaluation of the mechanical properties for the material of linen\ncan be done at two levels: macro and micro-nano, but I believe\nthat we can only work at the micro-nano (and non-destructively!)\non the material of the Shroud…\n— —- —\nOur friend “daveb of wellington nz” wrote:\n>In principle however, the method of mechanical testing might provide a type of credibility check on other more established dating methods, \nStop.\nWhich are these “more established dating methods”?\nAre you talking about ATR-FTIR (and Raman) or C14, or both?\nA set of useful controls can be immediately done out on\n“so-called-reserve” (= remainings of the cutting of the year 1988)\nusing: ATR-FTIR, Raman and AFM controls = non-destructive controls!\nThis can be an useful (but incomplete!) work.\nThis can be a point where we can start with some preliminar considerations, because errors of at least 200 years or more are certainly more interesting than a XIII-XIV Century result!\nIn any case, if the result has to deal with a different epoch\nthis can be another good shot against the past 14C test.\n— —\nRegarding the message sent by MPH\n(who seems to think to solve the problem with a macro-level approach),\nI can write that:\nI think that some simple experiments can illustrate what happens on the possible geometrical change about the herringbone twill (loaded with a light weight or with a certain heavy weight),  ie: measurements about the actual levels of the retraction or deformation of the linen cloth in reference to the presumed treatment with “alkaline watery solution based in-soaking” (this seeing what wrote MPH).\n— —\nReturning to the question of set of useful controls can be immediately done out on\n“so-called-reserve” … can be useful to remember that:\n>Detailed analysis suggests that certain Raman signatures are characteristic of ageing and may correlate with reduced performance of the fabric, suggesting that the technique could offer a non-destructive approach …\nReference, the old study :\n“Raman spectroscopic analysis of a unique linen artefact:\nthe HMS Victory Trafalgar sail”\nJournal of Raman Spectroscopy,\nSpecial Issue: Raman Spectroscopy in Art and Archaeology II\nVolume 37, Issue 10, pages 1193–1200, October 2006\nLink:\nhttp://onlinelibrary.wiley.com/doi/10.1002/jrs.1609/abstract\nIn other words:\nWhere are Raman spectral comparisons for 14C test remaining material (=so-called reserve) and the rest of the Shroud?\nBut this seems a late deepening of problems.\nInstead (IMO) we have to work using AFM non-destructive\ntechniques on the entire linen (AFM/CFM maps).\n— —\nIt does not seem easy or fun going into the arguments of\nStructural Mechanics, structural damping, etc.\nSo now I want to digress a bit …\nAs regards the question of the appropriate damping of the wind,\nof the appropriate use of the sails, etc. I think maybe you\nshould ask for something to Einstein …of course. But he is not alive! …\nHere what I have read:\n>It is unclear when Einstein started sailing. In 1929, a group of admirers,\nincluding the American banker Henry Goldman, had a sailboat built\nfor him as a present for his 50th birthday. It seems an unlikely gift\nunless Einstein was already a sailor, or at least had a strong interest in sailing. \nand\n>Despite having sailed for many years, Einstein developed\na reputation, rightly or wrongly, of being a rather hapless sailor. … …\n>…Interestingly, Einstein seemed to be indifferent to the dangers of sailing, and the perils were particularly acute since he didn’t know how to swim! It is rather amazing that he didn’t drown. In 1944, for example, while sailing on Saranac Lake in the Adirondacks, Einstein’s boat hit a rock and capsized. A rope entangled his leg, and he was trapped briefly underneath the sail, but he managed to find his way to the surface without panicking and was saved by a passing motorboat. … etc. …\n>… Was Einstein really a lousy sailor? …\nLink:\nhttp://www.oldsaltblog.com/2014/02/albert-einstein-scientist-sailor/\n— —\nHere the last question:\nWhen is it justifiable to exclude ‘outlier’ data points from statistical analyses? \nSometimes reduction of data by deleting outliers can be an useful solution.\nIf you are sure that some error (in measuring or recording the data) has occurred, you can reduce the data omitting the obviously erroneous value (or values) called an “outlier”…\nBut this will generally change both the mean and as well as the variance and hence the standard deviation.\n\n","date":"June 29, 2015 at 9:57 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-204057","author":"piero","site":"shroudstory"},{"title":"Update on New Book by Giulio Fanti and Pierandrea Malfi","post":"Sorry Piero for my typo, I should have written instead “alkaline water based solution in-soaking”\n\n","date":"June 29, 2015 at 10:23 am","url":"https://shroudstory.com/2015/06/28/update-on-new-book-by-giulio-fanti-and-pierandrea-malfi/","cat":"books","id":"comment-204060","author":"Max patrick Hamon","site":"shroudstory"}]
