[{"title":"Sales and Amazon Reviews of Fanti’s New Book","post":"I have just published a critical review here:\nhttp://www.queryonline.it/2013/04/04/sindone-le-datazioni-alternative-di-giulio-fanti/\nIt concerns only the third chapter of Fanti’s book about the new dating methods. Sorry it is in Italian.\n\n","date":"April 4, 2013 at 8:13 am","url":"https://shroudstory.com/2013/04/04/sales-and-amazon-reviews-of-fantis-new-book/","cat":"books","id":"comment-29284","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Sales and Amazon Reviews of Fanti’s New Book","post":"Gian Marco’s review is comprehensive and detailed, and I hope he will not mind my presenting a translation of some important passages below. I started with Google Translate, and carefully worked my way through re-interpreting anything that was literally non-sense. I notice that Dan often uses Bing. Does anybody have any reason why one is better than the other. Google has a tendency simply to ignore negatives, I find, which can completely alter the sense of a passage, which Bing comes up with weird and whimsical idiomatic translations of passages which don’t require it.\nAnyway, here goes:\nAfter a quick summary of what the book is and its reception, Gian Marco says..\n“In fabric over time the cellulose in the fibers is altered and degrades. The more time that passes, the greater the alteration. By measuring, in a fabric of unknown age, some parameter that is related to the degree of alteration, and comparing it with the values of the same parameter in ancient fabrics of known ages, the age of the unknown tissue can, in principle, be estimated. This would work if it were not that alterations may proceed at different speeds depending on several factors. In short, the degradation of cellulose is not a clock that always ticks at the same rate (as it is does with the decay of radiocarbon). To take a trivial example, if I meet someone and observe her dress, I can try to figure out if the dress is new or old, looking more or less if it is worn, torn, faded or crumpled. But I can not correctly estimate the age if I do not take into account various other factors such as the quality of the fabric, the conditions in which it was stored and how and how much was used.\nThe new results.\nFanti has obtained some antique fabrics from different eras of approximately known date. He conducted three sets of measurements using three different methods. In the first and second series he measured certain alterations of cellulose using spectroscopic methods – Fourier transform infrared spectroscopy and Raman spectroscopy. For spectroscopic analyses Fanti turned to two more professors, Anna Tinti of Bologna and Pietro Baraldi of Modena. In the third series he measured a set of mechanical parameters, for example the behavior of fibers under tension and the breaking load (with the assistance of a doctoral student, Pierandrea Malfi).\nIn each series, from measurements on samples of known age, Fanti has constructed a calibration curve, which represents how the trend varies with age. Then he measured the same parameters on the Shroud and derived an estimate of its age by making a comparison with the calibration curve.\nFanti says that he has not found in the literature similar calibration curves for these three methods, and supposes that they have been introduced by him for the first time.\nThere were nine ancient fabrics used in compiling the calibration curves, with ages from 3000 BC to 1000 AD. Five were from Egypt, three from Israel and one from Peru. He also used two modern fabrics of recent manufacture.\nThe confidence intervals at 95% for the origin of the fabric of the shroud with the three methods were respectively: 300 BC ± 400 and 200 BC ± 500, 400 AD ± 400. Averaging these values, Fanti arrived at a final result to 33 BC ± 250 and is satisfied that this interval includes the time of Christ.\nWe see that the three results cover a very wide range, from 300 BC to 400 AD. Considering the bounds of the intervals of confidence, the dates extend further, from 700 BC to 800 AD.\nThe dispersion would be even greater if Fanti had used his original result for the first series, which was 752 BC ± 400. However here Fanti has made a correction, trying to take into account the effects of the fire of 1532 in which the Shroud was involved, and moved the date from 752 BC to 300 BC. This is based on measurements made on a recent piece of fabric which has been subjected to heating. This correction is somewhat arbitrary. On the one hand it is not known at what temperature and for how long the cloth of the Shroud has been heated by the fire. On the other hand the effects on a new fabric manufactured using modern technology may be different from the effects on the Shroud, also taking into account that the damage triggered by the fire may have worsened over the centuries.\nIt should be noted that, as he made a correction for the first method, Fanti should also have made a correction for the third method, as results from similar heating tests of modern materials produced an apparent aging “of a few centuries” using this method. However it seems that Fanti decided to rejuvenate the result of the first series, whose original results came out too old, but preferred not to do the same to the third series, whose original results came out too young.\nAll tests were conducted on individual fibers of flax. These are the ‘elementary’ fibers which make up the threads. The fibers are thin and have a diameter of about 10 or 20 micrometers (thousandths of a millimeter). Thread is manufactured by the twisting together of fibers in the spinning process. Any section of thread may contain a hundred or so fibres.\nThere is no guarantee that the methods are reliable\nThe factors that affect the apparent aging of a fabric are variable in nature. We can cite the light, the conditions of temperature and humidity, the presence of dust, exposure to various chemical agents, and mechanical stresses. Also factors that seem insignificant can accumulate a significant effect if continuing for centuries. For example, a linen fabric which is folded can produce damage to the fibers in the bends (which is why today  the Shroud is kept fully extended to prevent further damage). In general, the processes of degradation can be very slow and are not easily simulated with laboratory experiments.\nHypothetically, you can imagine some differences in the conditions of preservation of the Shroud compared to other fabrics. The weather conditions, temperature and humidity, were different in Europe from in Egypt or Israel. In particular, moisture is harmful to fabrics and the Egyptian climate is probably drier than the French or Piedmontese. The methods of processing flax in Europe in the 14th century may have been different from those of ancient Egypt, such as the bleaching process. The comparison fabrics probably rested for centuries in a tomb and then remained in the warehouses of a museum, while the Shroud has had a much more lively history, especially in the early days. It was transported here and there, both before and after the transition to the Savoy. It was folded and unfolded, and later rolled up on a tight cylinder and unrolled. It was involved in a fire. It was mended. It was exposed to light outdoors, and to the fumes of incense or candles or torches. Perhaps it was brushed to clean it.\nAlso there may have been unknown episodes in the history of the Shroud, especially in the period before 1500, which have had a measurable effect today.\nFanti says he has conducted tests to assess the “systematic effects” of various factors, but in practice he has only made the correction that we saw for the first series.\nThese uncertainties mean that the methods used by Fanti are inherently unreliable because it can not be excluded that there were influences of factors known or unknown, with effects difficult to assess. So, if his methods result in a date that differs from that obtained in other ways, it is necessary to doubt the result. We have two reasons to think that the fabric of the Shroud was manufactured around 1300, the radiocarbon dating and the historical fact of its first appearance. On the other hand, we have no reason to suggest that the Shroud is from the first century. The only “evidence” of antiquity adduced by Shroudologists is in the (non-existent) fingerprints of two coins of Pontius Pilate!\nHowever, there is a more concrete reason to think that the fibers of the Shroud used by Fanti were unsuitable for testing.\nIn two television interviews, Fanti was shown withdrawing a fiber from a piece of fabric. He separated out a thread and pulled out a fiber with tweezers. But this is not the way in which he got the fibers of the Shroud. He did not have a piece of fabric, or even pieces of intact thread. He used a dust collection made by Giovanni Riggi di Numana in 1978.\nIt should be noted that from 1534 to 2002 the cloth of the Shroud was continuously fastened with stitching to another linen cloth for support. In 1978 Riggi unstitched some sections on the edges and stuck in the cavity a vacuum cleaner with which he collected dust in cotton filters interposed along the tube outlet. Years later, some of these filters were made available to Fanti. From these filters, in particular the one designated as “h”, Fanti took the material for his analysis.\nTogether with dust of various kinds were also fragments of fibers of the shroud, in addition to flax fibers of the support fabric, cotton fibers from the filters and possibly other fibers of uncertain origin.\nWe can assume that any fibers of the Shroud collected from the vacuum extractor had deteriorated more than the fibers still enclosed in the threads. Fibers have, in the course of time, detached from the back of the Shroud and become trapped inside the cavity between the cloths, but those that have would be either weaker or more damaged than those which remained in the threads. For example they could be fibers that originally came from areas of stitching or burning or soaking in water or any other places that had suffered damage for some reason.\nIn addition to the fibers that had already become detached in the past, Riggi’s vacuum cleaner could have detached others while it was working, and those fibres, too, would be weaker or more damaged than those which remained. Fanti’s material is thus shown to be unrepresentative in being particularly deteriorated, so it is no wonder that the age he calculated is more apparent than real.\nIn a 2008 article Fanti showed photographs of many fibers collected by filters of which he had already come into possession, including those from filter “h”. We saw that the fibers were very short, averaging about a millimeter. Usually linen fibers are somewhat longer. So those used by Fanti were small fragments derived from the breakage of fibers which were already integrally fragile. In his book Fanti does not say how long the fibers from his comparison tissues were, but he may provide more detail in a future publication.\nAfter they were collected in 1978, the fibers remained on the filters for several years, together with the rest of the dust and dirt sucked in. The individual fibers were exposed to dust on all sides.\nEarlier than 2008, fibers were collected from Fanti’s filters using adhesive tape. Photographs were obtained showing the fibers on the tape. Fanti does not say if these fibres were used for his present experiments, but if they were they had remained in contact with the glue for a time of perhaps several years and then a solvent may have been used to remove them from it. We hope to find more information on these procedures when Fanti’s next article appears.\nHowever they were obtained, Fanti then observed them at length under a microscope. The aim was to separate the flax fibers from the Shroud from those coming from the cloth support or from those of cotton or other origin. Looking into the microscope, Fanti says, he was able to distinguish the fibers of the Shroud not only from those of other material, but also from the linen fibers of the fabric support. For observation under the microscope, the fiber must be illuminated and, if it is not on a tape, somehow manipulated.\nIn short, the Shroud material used for the experiments was not the most fortunate. In his book Fanti makes no secret that the fibers of the Shroud which he used come from Riggi’s filters but does not comment on the risks implicit in the fact that these fibers have had a more complicated history than those freshly extracted from other fabrics containing intact threads. We can only note Fanti’s own words concerning the third method, the mechanical one, with reference to his experiments on the comparison fibres. (p. 85):\n    “In some cases, in fact, fibers taken from particular parts of a thread which had been more exposed to the environment and mechanical actions such as rubbing, showed a structural weakening, due to probable microcracks, which sometimes lead the mechanical method to result in dates with amplitude shifts of up to a thousand years.” Such is the true accuracy of this method. Two fibers taken from the same thread can produce dating with a difference of a thousand years. Fanti continues:\n    “To avoid incurring similar problems of measurement, the fibers used to perform the mechanical tests – and thus the determination of the curves of dating – were taken from their fabric in a similar way to those used to pick up the fibers from the Shroud.”\nI do not know if Fanti means that he extracted fibers from his comparison fabrics with a vacuum cleaner, at least for the third series, but in any case he could not select the fibers that had separated in time from the points of greatest wear and tear that had built up for centuries.\n…\nFor my part, I think that there is no reason to doubt that the material used by Fanti really comes from the filters of the vacuum cleaner used by Riggi in 1978. It is known that Riggi kept the filters and later on several occasions had bestowed portions of the material to others. Today Riggi is gone, but I do not think that Fanti has made false declarations about the origin of the fibers examined by him.\nI would also add that I can not know if Fanti has correctly identified the fibers of the Shroud, distinguishing them from other fibers collected from the extractor, such as those of cloth or filter support, but that would be material of a more recent age than the Shroud itself and not could provide a dating at the time of Christ. In short, I believe that the results are unreliable, not for any doubts about the origin of the material, but for the inadequacy of the methods used.”\n\n","date":"April 4, 2013 at 10:46 am","url":"https://shroudstory.com/2013/04/04/sales-and-amazon-reviews-of-fantis-new-book/","cat":"books","id":"comment-29317","author":"Hugh Farey","site":"shroudstory"},{"title":"Sales and Amazon Reviews of Fanti’s New Book","post":"Please post any comments you have of review at http://tinyurl.com/dxgej5k where the review has been reposted.\n\n","date":"April 4, 2013 at 11:46 am","url":"https://shroudstory.com/2013/04/04/sales-and-amazon-reviews-of-fantis-new-book/","cat":"books","id":"comment-29324","author":"Dan","site":"shroudstory"}]
