[{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"Whatever the defects in Ian Wilson’s speculative account of the pre-history of the Shroud of Turin, it seems to me that Christopher Freeman’s account is simply a tissue of debunking repeating many poorly substantiated claims about relics and then lampooning Wilson’s treatment.\nHe fails to mention explicitly the Gregory sermon or the chronicler Robert de Clari’s observation of an object that is described and sounds very like the shroud in 1204.  He does note the location and claims that the identification of the Image of Edessa with this other relic which certainly sounds like the shroud can’t be.  He doesn’t address Wilson’s speculation that on arrival in the city in 944 if was found to be a shroud and not just an image of the head of Jesus. Also it seems to me that the cloth of Oviedo (regardless of its Carbon date) has stains on it that have the same blood type as the blood on the shroud and have configurations that can be matched to the shroud which tends to corroborate Wilson’s conjecture that the shroud is authentic.\nIt is difficult to be certain of anything from all the fragmentary evidence, but simply pointing out in every case that perhaps there are other interpretations or that Freeman doesn’t see Wilson’s point is not really an argument but a preconceived conviction.  If Wilson can be convicted of being prejudiced in favor of shroud authenticity it seems to me that Freeman can be convicted of the opposite prejudice.  One agenda driven account is not more convincing than another.  Wilson never claims to prove the shroud authentic.  He is making a fragmentary case with what evidence there is.  \nThe shroud is a very mysterious object with remarkable and wholly unique properties and unless we can convincingly explain it then the possibility of authenticity cannot be simply ruled out.   There are many small things that point to authenticity and there are some that point in the opposite direction.\nI do think that Freeman has a point about the handling of shroud research.  STURP did what it could but it was a quickly thrown together association of scientists with relatively few resources.  If they were not as professional as they might have been it should be remembered that they were the first and only investigation that has taken place and their research was compressed into 120 continuous hours.  These are hardly ideal circumstances.  Freeman’s criticisms are Monday morning quarterbacking from the armchair position.\n\n","date":"May 29, 2012 at 12:43 pm","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11692","author":"Ray Schneider","site":"shroudstory"},{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"Charles Freeman … sorry\n\n","date":"May 29, 2012 at 12:45 pm","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11693","author":"Ray Schneider","site":"shroudstory"},{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"So, it’s look like I’m not the only one who see clearly enough to understand that Wilson’s “historical” work is just a bunch of very bad speculations, extrapolations and assumptions !  I’ll say it again :  the Mandylion hypothesis is biggest crap that has ever been thrown into the face of the Shroud world.\nBut, calm down folks !  There’s at least a positive thing that I can easily confirm versus the Mandylion :  even if this cloth WAS NOT the Shroud, it is highly probable that it was based upon the Shroud.  You just have to see the study done by Vignon to understand that this Mandylion is most probably link directly with the Shroud, proving that the Shroud was already there when the Mandylion first came out in Edessa (probably at the biggening of the 5th century).\nSo, even if Wilson is completely off-track with his direct link, we have to conclude that the 2 cloths are most probably link together, just like the Pantocrator icon…\n\n","date":"May 29, 2012 at 1:03 pm","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11694","author":"Yannick Clément","site":"shroudstory"},{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"Dear Yannick, I agree with you, and I am aware that English is not your first language, but please do get a thesaurus. You have used the words ‘speculations, extrapolations, and assumptions’ in that same order of appearance so many times it’s turning into a mantra. ;)\n\n","date":"May 29, 2012 at 4:42 pm","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11699","author":"Davor Aslanovski","site":"shroudstory"},{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"If you agree with me, then you must understand that I use this “mantra” in order to put this into the head of people who consider Wilson like God !  That’s the reason why I repeat myself so often.  Many people in the Shroud world have, for a long time now, taken every hypothesis proposed by Wilson for granted so blindly that I think it’s not a bad thing to repeat it over and over again that many of his ideas are solely based on speculations, extrapolations and (special) assumptions !  Sorry if that bothers you but at least, I’m sure you will never forget it !!! ;-)\n\n","date":"May 30, 2012 at 8:28 am","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11714","author":"Yannick Clément","site":"shroudstory"},{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"We have the Syriac poem “Hymn of the Pearl” which has links with Antioch and Edessa.  The various icons and coins produced from the sixth century onwards display the markings on the Shroud,  Bishop Abraham only takes one cloth from Edessa to Constantinople.  The Shroud ends up in Constantinople.  The Greek church celebrates the arrival of the Mandylion in Constantinople.  They have no feast day for the arrival of the Shroud, a much more significant artifact.  And still Yannick doesn’t get it!  I don’t need him to write his usual 2000 word essay in rebuttal.  The facts speak for themselves!\n\n","date":"May 29, 2012 at 5:15 pm","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11701","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"Excuse me Daveb but if you had done the research I have done, you won’t think that “the facts speak for themselves”.  I’ll repeat it again :  It’s not because the Mandylion is most probably linked with the Shroud (directly or indirectly) that those 2 relics are one and the same !  Just read again all the arguments I’ve already put forward here and reflect upon them please…  And remember that I’m not the only one who see clearly enough to understand that the hypothesis of Wilson is just false !!!\n\n","date":"May 30, 2012 at 8:31 am","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11715","author":"Yannick Clément","site":"shroudstory"},{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"I want to react to some of the things M. Schneider have said here (sorry again for the length of this comment) :\nQuote 1 :  “One agenda driven account is not more convincing than another. Wilson never claims to prove the shroud authentic. He is making a fragmentary case with what evidence there is.”\nComment from me :  It’s interesting to note this admission from M. Schneider that Wilson’s hypothesis is “agenda driven”.  I completely agree with him on this point.  And for the fact that Wilson never claim he has proved the shroud authenticity, it’s maybe true to some extent (I don’t think Wilson ever made an explicit claim like that), but nevertheless, it’s very sad to note that many persons interested in the Shroud (and even some official websites and TV documentaries concerning the Shroud) have considered blindly this very doubtful HYPOTHESIS like if it was a real confirmed THEORY accepted by most scholars, while it’s very far from being the case !!!  That’s why I’m so passionate about this topic and always want to set the record straight every time I get the chance to do so.\nQuote 2 : “There are many small things that point to authenticity and there are some that point in the opposite direction.”\nComment from me :  Here, I would like that M. Schneider told us what are exactly the things (in the plural) that really point in the opposite direction versus the authenticity of the Shroud ???  In the past years, we were aware of only 2 of those things which were the C14 result (concluding that the Shroud was made between 1260 and 1390 !) and the memorandum of Pierre d’Arcy (who claimed he knew the artist who painted this false relic).  That’s the only 2 things I’m aware that were really pointing toward something else than authenticity.  But the reality is this :  those 2 things have been scientifically discarded long ago !!!  The C14 result is now obsolete because of all the evidences that are showing that the sample that was used for the dating was not representative of the main cloth.  And for the d’Arcy memorandum, never mind if this Bishop was honest or not in his letter to the pope, since the STURP team work, we know for sure that it was a false interpretation of the image that was on the Shroud.  Since we know for a fact now that the Shroud IS NOT some kind of artistic forgery, this “evidence” of the memorandum has to be discarded too.  That’s why unless someone can show me one solid evidence, other than the 2 I just mentioned, that point in the direction of non-authenticity, I think it’s fair to say that, presently, there’s absolutely NO real and solid scientific evidence that can really put the authenticity of the Shroud in jeopardy.  That’s why I ask M. Schneider (or anyone else) to tell me what else can really put the Shroud authenticity in doubt at the time we are speaking ???  I don’t see nothing right now…\nQuote 3 : “I do think that Freeman has a point about the handling of shroud research. STURP did what it could but it was a quickly thrown together association of scientists with relatively few resources. If they were not as professional as they might have been it should be remembered that they were the first and only investigation that has taken place and their research was compressed into 120 continuous hours.”\nComment from me :  This quote from M. Schneider really surprises me !  Unless I get it wrong…  One thing’s for sure :  I would really love to hear Barrie Schwortz about that !!!  From what I’ve learn from Barrie along the years, I think this opinion of M. Schneider is simply false versus the reality.  Barrie often told me how the STURP team took almost 2 years in order to be ready for the 5 days of examination in Turin.  I think this simple FACT is enough to discard the term used by M. Schneider when he describe the STURP team as “a quickly thrown together association of scientists” !!!  And when he said that they were a team “with relatively few resources”, I don’t think it’s true either !  Just look at all the material and tests they were able to perform in 1978, despite a pretty short period of time that was hallowed (5 days and nights) and many unplanned bugs and you’ll realize that, for a first in-deep examination of the Shroud, this was a very good success and they were able to collect a large spectrum of data still in use today in Shroud science.  Of course, looking back, anyone can make critics and say “they should have done this” or “they should have tried that”, but that’s completely unfair to say things like that !  That’s what I think.  I really think we should look at the STURP team work and say “Bravo” to those scientists simply because of the great work they were able to accomplish in the context of the time (particularly in regard of the fact that it was a real pioneer work that will most probably be very useful when the time will come to make a second round of direct examination of the cloth).  Lastly, maybe I get it wrong (remember that I don’t speak and understand English completely well), but I have a hard time to understand the fact that M. Schneider seem to criticize the professionalism of the STURP team.  Really, I don’t get it.  When you look at the poor quality of the Shroud research that’s going on these days, I don’t think anyone has the right to put the professionalism of those guys in question !!!  Of course they probably did some interpretation mistakes (the biggest one being the probable error versus the chromophore of the image who resides in a thin layer of impurities on-top of the fibers instead of on the fiber walls themselves), but hey ?  Who is perfect in this world ?  I think the fact that a bunch of conclusions from the STURP papers have already been confirmed is well enough to understand the great professionalism of this team.  So, unless I didn’t understand well what M. Schneider wanted to say, I have to say that I completely disagree with his (pretty poor) opinion of the STURP team…\n\n","date":"May 30, 2012 at 5:04 pm","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11732","author":"Yannick Clément","site":"shroudstory"},{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"What a pity that the STURP team was not properly constituted with respect to the fundamental sciences. Had there been a botanist, he or she could have told the chemists that the superficiality and ease of stripping of the image layer was really no surprise, given that linen fibres preserve the original primary cell wall on the outside with its non-crystalline, easily modifiable hemicelluloses. We could then have been spared the decades of deference to a dud hypothesis  – a 2 or even 3 hit model requiring interaction between adventitious surface contaminants – starch (later changed to dextrins and other degraded starches), soapy saponins and putrefaction amines, requiring all kinds of other qualifying assumptions (capillary action to concentrate contaminants on the surface, laminar flow of gaseous amines from a warm or hot cadaver to override diffusion). All these events come together in near-miraculous synchrony we are told to produce a homogenous Maillard reaction, one that results in sharp imprinting of a cadaver, despite the body exterior that is in immediate contact or close proximity with cloth being largely inert keratin protein (skin and hair). \nThe fact is that the STURP team was largely, perhaps exclusively self-selected, with no truly top-notch scientist, e.g. of Nobel laureate status, in overall charge of the project. The resulting quirkiness and obsessional pursuit of pet theories is plain for all to see in the final reports, scattered around the literature in numerous internet pdf files etc (often incomplete because of paywalls).The few pages that are available are often sketchy, impressionistic or evasive on crucial detail, and yes, frankly pet theory-pushing. I for one have no intention of getting out the credit card to read more of the same.\nSTURP was no Moon landing. Had there been an Apollo 13 mishap, one can be quite sure of one thing. Any rescue mission would have been botched.\nSubmitted at 07:10 UK time, Thur 31 May 2012\n\n","date":"May 31, 2012 at 2:10 am","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11741","author":"colinsberry","site":"shroudstory"},{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"I’m sure the STURP team should had been replaced by the Collinsberry team !!!  That would have been great ! ;-)\n\n","date":"May 31, 2012 at 8:28 am","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11743","author":"Yannick Clément","site":"shroudstory"},{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"Well,Yannick, I did once serve on a national Task Force (British Nutrition Foundation, Complex Carbohydrates, aka dietary fibre, 1990), having contributed the chapter on the Glycaemic Response). One submitted one’s contribution which was then discussed, commented upon, criticized, or even mauled by the other contributors, of whom there were about a dozen as I recall. The end-result was a published hard-back overview that was stripped of at least some of the most personal idiosyncracies of its members. I see no evidence that the STURP researchers allowed themselves to face the same critical scrutiny. Too many self-selected prima donnas, too much self-indulgence…\n\n","date":"May 31, 2012 at 8:47 am","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11746","author":"colinsberry","site":"shroudstory"},{"title":"Scientific Study of the Shroud of Turin hampered by STURP?","post":"Reed Rogers book again my friend.  If you’re honest, you’ll see how much he cared in the preparation of his Shroud investigation at the end of the 70s…\n\n","date":"June 3, 2012 at 6:17 pm","url":"https://shroudstory.com/2012/05/29/scientific-study-of-the-shroud-of-turin-hampered-by-sturp/","cat":"books","id":"comment-11862","author":"Yannick Clément","site":"shroudstory"}]
