[{"title":"The Coming of the Quantum Christ","post":"I like his introduction to Thomas, which is appropriate. I want to point out that it is BECAUSE Thomas doubted that all the rest of us who believe in Jesus Christ have received a blessing, “Blessed are those who have not seen and yet have believed.”  (This could be added to the list of Beatitudes actually.) \nI also want to point out that those who dare to BELIEVE are more blessed than those who doubt. There are many who are very proud of their Doubts and work at inventing new ones, thinking that there is wisdom in this. But the Bible says that the “Fear of the Lord is beginning of wisdom.”  And, “The Fool has said in his heart; there is not God.” \nThomas corrected his mistakes and died for the Lord Jesus, holding fast to faith until his death as a martyr. We need to follow THIS example in Thomas, not the other one. \nPersonally, I am challenged by the verse in Revelation 3 that says, “I know you have little faith and yet you have kept my Word and have not denied my Name.”  It horrifies me to think that I might deny the Lord Jesus and disappoint Him in such a way. \nI need to read the entire PDF carefully but I did skip to the end, about the Quantum Christ. I don’t know where he’s headed with that, but I’ve encountered many false doctrines which attempt to strip away the physical humanity of Christ. One theory is that the entire Bible is only an allegory: a philosophy to learn from. Another theory is that it’s all about LOVE and we don’t need to fear judgment (or hell.) \nAll these theories (also known as false doctrines) attempt to get rid of the Crucifixion. To get rid of a God of judgment.  To get rid of the ugly images of Christ on the cross. To get rid of a God who requires sacrifice from us personally. \nThe Shroud sends us hurtling back to reality! Christ was PHYSICAL. Christ died a horrible death. Christ did not keep that Shroud but for a very short time, after that He didn’t need it. The Shroud tells us that all those THEORIES are LIES.  And the Shroud reminds us once again that it is better to BELIEVE than to doubt. \nI collect thousands of digital images of Jesus art, ancient and recent. One day I was thinking, “I wonder which images are the ones that Jesus likes?”  Immediately I knew that the baby pictures are of no interest to Him. The story that Christ passionately wants to tell is the one of His death, burial and resurrection. That was why He came, that was His huge accomplishment: and we fail Jesus if we try to belittle that in any way.\n\n","date":"December 29, 2011 at 11:19 am","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","id":"comment-6259","author":"AnnieCee","site":"shroudstory"},{"title":"The Coming of the Quantum Christ","post":"Ok, I did read the whole chapter carefully and I liked the whole thing UNTIL I got to the part about the Quantum Christ. He’s looking for Universal Love apparently? By blending all these philosophies together into a magic cocktail?  The Bible actually predicts what Mr. Klotz is hinting at, and the quantum christ is known as: the Antichrist, the one who is a fake and a fraud and a deceiver. \nThe angels told the disciples at the Ascension that Jesus would return in the same way He left. This will be a physical event, not metaphysical or symbolic. When it happens there will be absolutely no doubt that this is it, the real thing.\n\n","date":"December 29, 2011 at 8:17 pm","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","id":"comment-6271","author":"AnnieCee","site":"shroudstory"},{"title":"The Coming of the Quantum Christ","post":"I want to thank you for the comments so far. I guess the problem is the literal translation of the Bible, both Old and New Testaments. I wonder if either of the writers read Genesis literally. Pope Benedict certainly doesn’t. It’s not history, it is metaphor or allegory but we have much to learn from Genesis.\nFour thousand years ago religion explained everything from the blowing of the wind to the flicker of the fire. The first scientists were the ancient priests. Science and religion sprang form the same soil. We have earned many things in the ensuing millennia and many things that were religion are now science. Now science is nibbling at what would seem to be purely religious questions:  most importantly the nature of consciousness and the soul.\nIf you believe in God as creator, then He must have left fingerprints. Certainly the Shroud is such a fingerprint. But the quantum level of existence is something more: it is an interface and its seeming irrationality I believe is evidence that at the quantum level we are just one step removed from that consciousness from which all existence has proceeded and to which all shall return. Ultimately all of the law and all of the prophets resolve to one word and concept: love. What is exciting to me is how at the quantum level some see love not as an abstraction but a reality.\nWhen Galileo demonstrated the folly of Ptolemy, he was nearly burned at the stake and had to recant the truth.\nIt was Pierre Teilhard de Chardin in the Phenomenon of Man who wrote of a synthesis of Science and Religion, something the militant atheists like Dawkins would ultimately reject. But in the scientific study of the Shroud that is what we are doing. If that study demonstrates support for the Resurrection, is that bad?\nIf you truly believe in Christ, do not fear science. I believe that in this skeptical age the Shroud is a “game changer.” Is it perhaps Divine Providence that just when science is knocking on the door of the ultimate issues of existence, science is also proving the reality and vitality of Christ: crucified and Resurrected?\n\n","date":"December 31, 2011 at 8:10 am","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","id":"comment-6369","author":"John Klotz","site":"shroudstory"},{"title":"The Coming of the Quantum Christ","post":"Thanks to John for making available this very interesting and unique take on the potential influence past and present Shroud studies may have on humanity. It’s also a really unique interpretation of the second coming of Christ. Very strong opening statement and closing paragraph.\nWhile I tend to agree with the previous comments regarding the literalness of Christ’s second return (and I’m a creationist), it would not cancel out the Shroud playing a part of knowledge increasing in the time just before that event (Daniel 12:4). As one early STURP spokesman once said, it may be that the Shroud is the claim of Jesus’ death, burial, and resurrection interpreted into the “language” of Science.\nFor what it’s worth, it would be interesting to see the New Atheists take on the actual scientific evidence made available by Shroud researchers, which John seems to be preparing readers for in this introduction. Of course, given their past actions, they may just brush it aside, citing a single carbon dating result as enough “proof” for them that it’s a fraud. (Genuine inquiry doesn’t seem to be high on their list of things to do, as even John noted in how Dawkins “handled” of Pierre Teilhard de Chardin.)\nIt would also be interesting to see what Dawkins would designate as “proof” of the resurrection…\nJoshua\n\n","date":"January 2, 2012 at 9:22 am","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","id":"comment-6468","author":"\"No Apologies Allowed\" Weekly Apologetics Cartoons","site":"shroudstory"},{"title":"The Coming of the Quantum Christ","post":"Thanks for your comments. My use of “Quantum Christ” is as metaphor. However, if you had a chance to read my blog on my son Michael to which I referred, in that post I used scientific metaphors for coping with the issues of death and love. My conclusion after delving into issues involving the Shroud and quantum existence is that my metaphors weren’t metaphors. It’s just that some scientists are now grappling with issues in terms of quantum mechanics. \nDame Isabel Piscek at Dallas was quoted as saying “The Shroud of Turin is the Future of Science.” As some point I will credit her. She as also referred to the image creation as a “event horizon.” That was mind-blowing to me because that was how I described death in my price on Micheal. http://johnklotz.blogspot.com/2007_10_01_archive.html\n\n","date":"January 2, 2012 at 11:24 am","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","id":"comment-6472","author":"John Klotz","site":"shroudstory"},{"title":"The Coming of the Quantum Christ","post":"I think the concept is very interesting, I also think it may be irrelevant. A God that requires an Act of Faith for Salvation will not leave you any purchase on proof in this world which is not His Kingdom. Quantum mechanics will not show you anything of meaning and they will not show you the fingerprints of the Almighty. As an Act of Faith I accept that I will never have proof unless Christ reveals himself to me in an extraordinary form.  One thing that remains a very open question is whether we can know the cause of our existence through science. At present many minds don’t think that may be possible. I am open but not hopeful that the question will ever be settled in my lifetime. Whatever caused the Universe, or our state of being is not necessarily subject to it’s constraints. Time itself, from a quantum point of view probably did not exist prior to this Universe coming into being. It is an intrinsic characteristic to this Universe and therefore may not have existed at all prior to it. From that we can surmise that the cause of the Universe’s coming into being need not necessarily be constrained by Time  . . . or any other characteristic of this state of being. How does one measure or come to know and understand something that is not necessarily subject to anything we can possibly learn from this state of being? We may never be able to know scientifically anything outside our own Universe if that’s the case. It may all end up in the realm of philosophical conjecture.\nRegarding the Shroud I don’t think it shows any evidence of Resurrection. I am a firm believer that God doesn’t break the laws of nature, the laws of nature obey Him. I am faithful that one day one or more viable hypotheses will be developed which will show how, through natural events, the image on the Shroud was created. The only thing we can surmise is that something interrupted the Shroud’s interaction with a dead body. It may be the Resurrection, it may be someone stole the body or some other unforeseen explanation. For me, Faith gives me the answer, the Shroud only poses the question.\n\n","date":"January 12, 2012 at 5:55 pm","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","id":"comment-6878","author":"Chris","site":"shroudstory"}]
