[{"title":"Outstanding Response to Recent Carbon Dating Paper","post":"The Skeptic’s Dictionary has something interesting to say about Raymond Rogers, that you seem not to know, he used two threads that may actually not of come from the Shroud see: http://www.skepdic.com/shroud.html\nUnder latest news.\n\n","date":"December 30, 2010 at 6:48 pm","url":"https://shroudstory.com/2010/12/30/outstanding-response-to-recent-carbon-dating-paper/","cat":"books","id":"comment-2045","author":"William","site":"shroudstory"},{"title":"Outstanding Response to Recent Carbon Dating Paper","post":"William, there is no basis whatsoever for this claim. This is old news. Even Jull in his latest defense of the carbon dating doesn’t make this unsubstantiated claim. It is like saying the Joe Nickell didn’t get his PhD in English from the University of Kentucky. Of course he did. It is a silly claim.\n\n","date":"December 30, 2010 at 10:15 pm","url":"https://shroudstory.com/2010/12/30/outstanding-response-to-recent-carbon-dating-paper/","cat":"books","id":"comment-2046","author":"Episcopalian","site":"shroudstory"},{"title":"Outstanding Response to Recent Carbon Dating Paper","post":"I would point out that the threads of the sample from the C14 area were given to Rogers by prof. Gonella (the Archbishop of Turin’s scientific adviser); Gonella died in 2007, two years after Rogers’ paper, and he has never denied the Rogers’ version: Gonella excised the threads from the centre of the radiocarbon sample A.\nfor Episcopalian: please note that Jull in his paper writes “radiocarbon samples” in inverted commas; Nickell in the article linked by william does the same: coincidence?\n\n","date":"December 31, 2010 at 6:06 am","url":"https://shroudstory.com/2010/12/30/outstanding-response-to-recent-carbon-dating-paper/","cat":"books","id":"comment-2050","author":"domenico","site":"shroudstory"},{"title":"Outstanding Response to Recent Carbon Dating Paper","post":"As a modest Shroud researcher I can’t help comment, Dr Mark Oxley’s post is just brilliant it´s the kind of explanation that summarizes crystal clear all reliable scientific information on the controversy of 1988 radiocarbon dating of the Shroud, so there is almost nothing left to add nevertheless I´ll remember one more fact Dr.J. Timothy Jull apparently has neglected.\nLet alone all microscopic and chemical aspects the late Dr Raymond Rogers pointed out in his paper, he noticed spliced threads in material from the Raes sample and this finding was later confirmed in a study by Dr Robert Villareal and his team from Los Alamos National Laboratory presented at Ohio Shroud Conference held in Columbus 2008.\nDr Thibault Heimburger by contrast phase micoscopic studies in remaining material from radiocarbon sampling area,also confirmed the presence of threads where dyed cotton fibers were spliced to linen fibers.\nI utterly disagree with William, Skeptics Dictionary has nothing worth reading about the Shroud of Turin and Mr. Joe Nickell’s assertions on Shroud matters are always biased by an atheis point of view.\nMr Joe Nickell is not a scientist so he has not the right to criticize from a technical point of view Dr Raymond Rogers’ paper which was published in a peer reviewed scientific journal and Dr.Raymond Rogers was absolutely honest stating that Dr Luigi Gonella provided him the radiocarbon threads.\nMost information about the Shroud on so called skeptic websites is completely misleading and nothing but utter bogus.\nDr Mark Oxley’s book «The Callenge of the Shroud» is truly one of the best easy ways to get reliable and updated information on the Shroud of Turin.\nHystorical information provided is fantastic and it was a great pleasure reading this book.\nMy sincere congratulations to Dr Mark Oxley for his book and his post.\n              I wish all Shroud of Turin blogger’s a HAPPY NEW YEAR\n                          Maria da Glória\n                   CENTRO PORTUGUÊS DE SINDONOLOGIA\n\n","date":"December 31, 2010 at 1:08 pm","url":"https://shroudstory.com/2010/12/30/outstanding-response-to-recent-carbon-dating-paper/","cat":"books","id":"comment-2052","author":"maria da glória gonçalves barroso","site":"shroudstory"},{"title":"Outstanding Response to Recent Carbon Dating Paper","post":"Does it bother anyone that Tim Jull commandeered a souvenir or museum curiosity of the Holy Shroud that was given to Arizona expressly for c14 testing? Wasn’t there a protocol? Is this ethical? Now that Jull admits to having a piece of the shroud shouldn’t he return it to the rightful owner?\n\n","date":"January 5, 2011 at 12:59 pm","url":"https://shroudstory.com/2010/12/30/outstanding-response-to-recent-carbon-dating-paper/","cat":"books","id":"comment-2133","author":"B&B","site":"shroudstory"},{"title":"Outstanding Response to Recent Carbon Dating Paper","post":"Hey, that isn’t even piece of material from the shroud. Look at the photograph. That’s not 3 over 1 herringbone. Did Jull accidentally save a control sample and then study that by mistake? Is Arizona messed up or what?\n\n","date":"January 5, 2011 at 1:32 pm","url":"https://shroudstory.com/2010/12/30/outstanding-response-to-recent-carbon-dating-paper/","cat":"books","id":"comment-2134","author":"B&B","site":"shroudstory"}]
