[{"title":"The Gospel According to Bill O’Reilly Continued","post":"I watched the video and read the various comments on the CBS site. I’d echo one of the comments from a non-USA person, that the rest of us just cannot understand how so many in the USA can get suckered in by this type of so-called celebrity, of which there seem to be far too many. He has a huge following, some pay $500 merely to have their photo taken with this person.  None of the comments on the CBS site however were favourable.  In NZ we tend to have a healthy habit of cutting “tall poppies” down to size.  The interview with O’Reilly helped to me to understand why this is such a healthy practice.\nNorah O’Donnell asked all the right questions, but with responses of only self-satisfied smugness from O’Reilly.  The pretence of the man is transparent to the rest of us.  Why isn’t it in the USA? Are their live so shallow that they can be taken in by this person?\n\n","date":"September 30, 2013 at 6:01 am","url":"https://shroudstory.com/2013/09/30/the-gospel-according-to-bill-oreilly-continued/","cat":"books","id":"comment-45899","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Gospel According to Bill O’Reilly Continued","post":"Dave, as we say here in the USA, if the King James Bible was good enough for Jesus then it is good enough for us.\n\n","date":"September 30, 2013 at 6:22 am","url":"https://shroudstory.com/2013/09/30/the-gospel-according-to-bill-oreilly-continued/","cat":"books","id":"comment-45902","author":"Dan","site":"shroudstory"},{"title":"The Gospel According to Bill O’Reilly Continued","post":"Give that old fashioned Douay-Rheims religion. It was good enough for Pius XII and it’s good enough for me.:-)\n\n","date":"September 30, 2013 at 8:51 am","url":"https://shroudstory.com/2013/09/30/the-gospel-according-to-bill-oreilly-continued/","cat":"books","id":"comment-45913","author":"John Klotz","site":"shroudstory"},{"title":"The Gospel According to Bill O’Reilly Continued","post":"Just like his father the devil, Bill O’Reilly said in his heart, “I will ascend to heaven; I will raise my throne above the stars of God; I will sit enthroned on the mount of assembly, on the utmost heights of the sacred mountain. I will ascend above the tops of the clouds; I will make myself like the Most High.”\n\n","date":"September 30, 2013 at 9:28 am","url":"https://shroudstory.com/2013/09/30/the-gospel-according-to-bill-oreilly-continued/","cat":"books","id":"comment-45915","author":"Henry","site":"shroudstory"},{"title":"The Gospel According to Bill O’Reilly Continued","post":"Bill O’Reilly is so full of himself that he deceives himself into believing . . . [edited to remove the rest of the comment.]\n\n","date":"October 1, 2013 at 9:27 am","url":"https://shroudstory.com/2013/09/30/the-gospel-according-to-bill-oreilly-continued/","cat":"books","id":"comment-45981","author":"Henry","site":"shroudstory"}]
