[{"title":"New Shroud of Turin book by John N. Lupia","post":">As for the Shroud of Turin being a Jewish tallit, that is another matter. It is hard to fathom.\nIt would be great if the Shroud was a Jewish tallit (i.e. prayer shawl) because it would be another problem for the medieval European forgery theory to explain.\nBut the Shroud is in fact a single (even the so-called `side strip’ and `seam’ are part of the same cloth) sheet of linen, 8 cubits x 2 cubits (4.34 m x 1.09 m). It has no “special twined and knotted fringes known as tzitzit attached to its four corners” (Wikipedia) and nor is it “made of wool” as “Most traditional tallitot (plural of tallit) … are” (Wikipedia).\nAs has been previously commented, given the very high quality of the Shroud’s 3:1 herringbone twill weave, it is possible that the cloth may not have been originally intended to be for a burial shroud. The Gospels record that Joseph of Arimathea “bought some linen cloth” (Mk 15:46) hurriedly because “the Sabbath was about to begin” (Lk 23:53-54). So the linen cloth that Joseph bought many have been intended for clothing or a tallit.\nBut short of asking Joseph of Arimathea when we get to Heaven (and even he might not know what the cloth he bought was intended for!) it seems inherently impossible to resolve this question.\nNevertheless, I look forward to reading the gist of John Lupia’s argument.\nStephen\n\n","date":"March 2, 2010 at 8:44 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1073","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"I would like to clarify that the book is not available on CD-ROM as a PDF. It was originally slated to be one of the formats for the book to be published this way but there are too many difficulties in PDF publishing that warranted this format to be rejected. The book was always intended to be a print publication and is now the only format Regina Caeli Press will publish it in. The first issue is in softcover or paperback. \nAs the blogger says by implication that there is not a single Shroud researcher aware of the first century tallit type and consequently they cannot think I am correct in my identification. But most researchers on the Shroud of Turin are not archaeologists and have never studied archaeological textiles. \nI appreciate Stephen’s comments very much. Especially the fact that if the Shroud of Turin can be shown to be an ancient Jewish tallit type before A.D. 66 then authentication becomes accomplished. It would be rather difficult for anyone to argue that it is a medieval forgery since the first century tallit type was not known during this time. It was not until the 17th century that anyone could even have connected the Shroud with the tallit.\nFirst century tallitot (plural) were not exclusively made of wool. The most ancient and popular fabric for them was linen. You cannot rely on Wikipedia or any other link on the internet to learn about the tallit because nearly all if not all describe the tallit as we know it today that has precedence beginning about 1000 A.D. This fact alone supports the view that a medieval forger would not have known about the ancient type.\nThe issue of the side strip is given careful attention throughout the book and plays an important role in helping us identify several important matters that help in identification of the Shroud as a tallit.\nTzitzyot (plural) were removed at burial. If the Shroud of Turin is an authentic tallit then we should not find them attached on the Shroud. But, this issue is a bit more complicated than this simplified explanation and is explained in the book.\nThe dimensions of the Shroud do not conform to 8 x 2 cubits of any sort. If you do the math you see for yourself. The correct dimensions are in my book.\nAs for the Gospel of Mark telling us about the role Joseph of Arimathea played with the Shroud it has been completely obscured by inept translations. The original Greek does not necessarily read as translations have it. But all of this is explained in the book.\nThe problem is not inherently impossible to resolve, Stephen, as there are many factors involved you can only learn by reading the book, which, by the way, also includes explanations about the C-14 dating done in 1988 based on physics.\nJohn\n\n","date":"March 3, 2010 at 1:28 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1076","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":">The dimensions of the Shroud do not conform to 8 x 2 cubits of any sort.\nDisagree. Since Syria was the Middle-East centre of linen production in the first century, the Assyrian cubit was the likely measuring unit for the Shroud. According to the article, Guralnick, E., “Sargonid Sculpture and the Late Assyrian Cubit,” Iraq, Vol. 58, 1996, pp.89-103), there were three Assyrian cubits: the Standard (51.5 cm = 20.3 in), the King’s (55 cm = 21.7 in) and the Royal (55.6 cm = 21.9 in).\nThe Shroud’s 435 x 110 cm divided by the middle cubit value of 55 cm is a near exact multiple of 8 (7.91), and an exact multiple of 2 (2.00), respectively. And given that the length of the Shroud has been reduced by relic-taking (Ricci, G., “The Holy Shroud,” 1981, p.7), it is not unreasonable to assume its original length was 440 cm, or 8 cubits of 55 cm. But if it is objected that the King’s cubit was rare, the more common Royal cubit of 55.6 cm would yield an 8 x 2 cubit Shroud of 445 x 111 cms, which at only 10 cm longer and 1 cm wider than the Shroud, which even if it is not granted that the length of the Shroud has been reduced by relic-taking, is still a very close approximation for what is after all, a cloth measured in a pre-industrial society. \n>As for the Gospel of Mark telling us about the role Joseph of Arimathea played with the Shroud it has been completely obscured by inept translations. The original Greek does not necessarily read as translations have it \nSurely John is not claiming that ALL English translations of Mark 15:46 are “inept” in having  “COMPLETELY obscured” the original Greek and ONLY his translation is right? The vast majority of my nearly 30 e-Sword English translations of Mark 15:46 render the Greek, “… he/Joseph bought a linen cloth …” This agrees with my Interlinear Greek translation: “And having bought a piece of unused linen …”  According to my Greek lexicons, the verb rendered “having bought” is agopasas, which is in the first aorist tense, i.e. a simple completed action, from the root agora, “market place”. Wuest’s “Expanded Translation of the Greek New Testament” which pays particular attention to the exact meaning of the Greek verbs, renders it: “And having purchased fine linen in the market place …” \nStephen\n\n","date":"March 4, 2010 at 1:21 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1078","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nThank you for your reply. It is clear that the dimensions cannot be translated exactly as even you admit. In my book all of this is explained and the unit of measurement given which is exact, not a close approximation, but exact. However, this answer is too simplistic because there are other variables going on that only reading the book can explain with clarity.\nThe key to the Markan text is understanding the what is being said in the Greek. This is very well explained in my book. I do understand your frustration with my comment, but reading the book will clarify all this.\n\n","date":"March 4, 2010 at 11:24 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1080","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nRegarding the translations of Mark 15:46 take a look at your reply to me. You wrote , ” This agrees with my Interlinear Greek translation: “And having bought a piece of unused linen …” This is a good example of what I am referring to since this is not what the Greek reads. The translators, as all translators must do, interpreted the meaning to read according to their translation criteria. The phrase “unused linen” is an interpretation of “sindona” which is a critically important word for understanding what the Shroud of Turin really is. My guess is whoever rendered this translation conflated the meaning with Matthew 27:59 who uses the phrase: sindoni kathara. Again, this phrase too has been subjected to interpretation to read “a clean linen”. It is outside the scope of writing in a blog to explain the intricacies  of New Testament Greek translations. The key idea you must keep in mind is that when translations are made the translators interpret. Interpretations are based upon their assumptions or model or view of what is going on in the text and what each word refers to according to the author’s intention. This is not an easy task. These texts are clearly explained in the book.\nBest regards,\nJohn\n\n","date":"March 4, 2010 at 12:41 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1082","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":">It is clear that the dimensions cannot be translated exactly as even you admit. \nJohn’s original claim was: “The dimensions of the Shroud do not conform to 8 x 2 cubits of any sort” (my emphasis).\nBut now again he attempts to change the subject to “the dimensions cannot be translated exactly” (my emphasis). \nI made the points (not in this order) that: \n1) the Shroud linen (if it is authentic) “is after all, a cloth measured in a pre-industrial society,” with the clear implication that it is unreasonable to expect it to conform to modern standards of exact measurement; \n2) “the length of the Shroud has been reduced by relic-taking,” with the clear implication that no measurement of the length of the Shroud today can be exactly what it originally was; and \n3) as to its width, the Shroud in fact does conform to one relevant 1st century measuring unit, the Assyrian King’s cubit of 55 mm, namely 2 cubits x 55 mm = 110 mm, the latter being the most commonly cited width of the Shroud; and the Shroud is only 1 mm wider than 2 Assyrian Royal cubits of 55.6 = 111 mm. \nI will also add:\n4) the Shroud is a fabric that has over the centuries been stretched, particularly lengthwise, including at times with weights, and as STURP member Barrie Schwortz pointed out in an online interview, the Shroud changes its dimensions slightly depending on the relative humidity of its environment, so the criterion of an exact measurement of the Shroud, by modern standards of precision, is inappropriate and illusory.  \nStephen\n\n","date":"March 4, 2010 at 9:20 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1087","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nYou wrote 1) the Shroud linen (if it is authentic) “is after all, a cloth measured in a pre-industrial society,” with the clear implication that it is unreasonable to expect it to conform to modern standards of exact measurement; \nFirst, I make no claim that the Shroud conforms to modern standards of exact measurement, but ancient standards of exact measurement.\nSecond, you claim 1) the Shroud linen (if it is authentic) “is after all, a cloth measured in a pre-industrial society,” \nThis is anachronistic. There was industrial society using very strict standards and units of measurement in the first century; or else your own argument falls apart claiming the the various cubits were applicable. \nI agree with your number 2 but in Shroud literature there is little or no evidence to show the length has been shortened. In my book I do show the length has been shortened and I speculate using the standard unit of measurement at the time how much is missing.\nYour number 3 is off the mark. Since 2002 the Shroud width does not measure 111 cm, but 113 to 113.7. This does not equal 110 cm. The unit of measurement you are applying is the wrong one. The correct one is published in my book.\nYour number 4 also like 3 above applies to the pre-2002 conservation. The shrinkage and expansion of the Shroud was due to it being sewn onto the Holland cloth, now removed. It has been carefully stretched out now and sandwiched between glass panels to keep it stretched out. The new reading of the measurements should be true or the same throughout time.\nI think we actually might be saying the same thing, in a sense, since you are assertive that the Shroud can be shown to conform to an ancient unit of measurement, just as I do. So, I agree. The only difference is I found another ancient unit that works much better. I think you will be very pleased when you read about it.\nCordially,\nJohn\n\n","date":"March 4, 2010 at 10:22 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1088","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Lupia has stated, “But most researchers on the Shroud of Turin are not archaeologists and have never studied archaeological textiles.” Of course not. The field is multidisciplinary. There are archaeologists and historians and plenty of people who have studied ancient textiles. Nobody but Lupia thinks it is a tallit. This is simply nutty. \nThe guy who claimed that the shroud could not be real because he found a fragment of a shroud was also an archaeologist. Should we believe him because he is an archaeologist who has also studied ancient textiles. \nAs for the claim the the other translations are inept is arrogant in the extreme. That one statement alone makes me wonder if Lupia has any comprehension about the scope of modern biblical scholarship. \nI think I’ll wait on the reviews before I spend this kind of money.\n\n","date":"March 4, 2010 at 3:54 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1083","author":"Theologian","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":">This agrees with my Interlinear Greek translation: “And having bought a piece of unused linen …” This is a good example of what I am referring to since this is not what the Greek reads. \nThe only points that I originally made regarding Joseph of Arimathea were that: “The Gospels record that Joseph of Arimathea `bought some linen cloth’ (Mk 15:46) hurriedly because `the Sabbath was about to begin’ (Lk 23:53-54).”\nTo which John responded, “As for the Gospel of Mark telling us about the role Joseph of Arimathea played with the Shroud it has been completely obscured by inept translations” (my emphasis).\nBut in response to my further support for my point from Mk 15:46 that Joseph of Arimathea “bought some linen cloth,” John has now chosen not to dispute “the role Joseph of Arimathea played with the Shroud” but instead has raised a different issue, whether the linen was “unused.” This is not a point I explicitly made, nor that I wish to debate, but just happened to be also in the interlinear text of Mark 15:46 that I quoted. \nStephen\n\n","date":"March 4, 2010 at 7:34 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1084","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Hi Stephen\nIf you read my comment to Theologian below you will understand my initial point more clearly. I do not think the translation that reads Joseph of Arimathea “bought some linen cloth,” is expressing the author’s intended sense.\nBest regards,\nJohn\n\n","date":"March 4, 2010 at 8:02 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1086","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Theologian\nIt would seem a nutty notion that the Shroud of Turin is a tallit if you only understand the tallit form that has come down to us since 1000 A.D. The tallit is not a medieval invention but an ancient one at least 3,000 years before those that emerged in 1000 A.D. The book explains the ancient Jewish tallit form during the first century, a form very different to that used today, and were the dimensions of the Shroud of Turin.\nThe guy to whom you refer is Shimon Gibson who has made unwarranted comments for which he alone is responsible.  I am making mine in the book for which I alone am responsible. Just as you are responsible for the comments you have made here.\nAnyone can make any claim they wish, but they need supportable and verifiable data to back it up. I can only answer for myself. My book contains supportable and verifiable data to back my claim that the Shroud of Turin is an ancient Jewish tallit.\nThe question on translations I have explained in my second reply to Stephen. Inept here means not suitable to the time, place or event. There is great difficulty involved in determining the most suitable sense of the text, i. e., keeping the author’s intended sense. A typical example has already been given above when some translations of Mark 15:46 characterize the linen as unused. This, of course is inept, i.e., not suitable since the text does not say that. The key words are “agorasas sindona” and there is no sense in which it can convey an “unused linen” outside of interpretation. If the Greek phrase is interpreted to mean that Joseph of Arimathea went out to the market to buy a sindon then it would naturally seem logical that he bought a new one, i.e., one that was unused. But this is all part of the translator’s interpretation. But was that the author’s intended sense? Since these sorts of translations have been around so long there are generations of readers who have just such a picture painted in their mind of Joseph of Arimathea going out to the market to buy a sindon and cannot think outside of that image so deeply embedded in their minds. Yet it never occurs to many that this is not suitable for the time, place and event since it was a Jewish holy day and it is scarcely conceivable that shops selling linen or anything else were open. It should be pointed out that “agorasas” does not exclusively mean “to purchase, or to buy”, since it can also mean “redeem” or “to pay the tax”.  Moreover, the Greek sindon is left here to mean “linen”, a very broad term. But sindon more precisely means tallit. The sources for this are in the book. So if you translate this text where “agorasas” means “to redeem” and “sindona” to mean “tallit” there is an altogether different reading where Joseph of Arimathea went out to redeem the tallit. And from whom would he redeem it from? In the Gospels the tallit of Jesus was the booty in the Roman soldier’s hands who won it tossing dice. In this case Joseph of Arimathea went out to redeem the tallit from the Roman soldier.  I hope you see that there are various ways a text can be translated. Each one requires the translator to interpret the best they can rendering the text suitable according to that historical time, place and event. Moreover, there are various variants among texts going back to the early church papyri. Perhaps you might enjoy reading my review of Comfort & Barrett\nhttp://www.amazon.com/review/R38HE9UXGSIMRM\n“Everyone is free, then, to contradict me. I would only ask my readers for that initial goodwill without which there can be no understanding.” — Benedict XVI, Jesus of Nazareth, xxiv\nJohn\n\n","date":"March 4, 2010 at 7:42 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1085","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":">I do not think the translation that reads Joseph of Arimathea “bought some linen cloth,” is expressing the author’s intended sense\nJohn’s “I do not think” is a big climb-down from his original claim that, “the role Joseph of Arimathea played with the Shroud it has been completely obscured by inept translations” (my emphasis).\n>It should be pointed out that “agorasas” does not exclusively mean “to purchase, or to buy”, since it can also mean “redeem” or “to pay the tax”.\nAgain, John’s “not exclusively” and “it can also mean” is also a big climb-down from his original claim above.\nAnd according to my computerised Parsons NT Greek-English  Dictionary (to save me going through and quoting my hardcopy lexicons), agorasas is a variant of the verb agorazo, which primarily means “to go to market, i.e. (by impl.) to purchase” and only secondarily means “spec. to redeem” hence its overall meaning is “buy, redeem” in that order.\nNow sometimes the secondary meaning of a word can be the correct one in that context, but that is a case John would have to argue on its merits, not by dismissing out of hand ALL (by implication) “translations” of Mark 15:46 as “inept”.\n>since it was a Jewish holy day and it is scarcely conceivable that shops selling linen or anything else were open.\nThe Gospels make it clear that it was before the Sabbath: Mk 14:42 “It was Preparation Day (that is, the day before the Sabbath),” which was also the Passover that year). And so there was no reason why the markets would not have still been open until sundown. Besides, redeeming linen would be just as much a problem as buying it if there were no “shops selling linen or anything else … open.”\nAnd so in the context, Joseph of Arimathea buying new pieces of linen in the Jerusalem markets, fits better than him, a wealthy member of the Sanhedrin, redeeming used linen. \nEven if it be granted that “redeeming” was a usual term for buying used linen, which seems unlikely, as “redeem” has the meaning of buying back something that one formerly owned, i.e. “To recover ownership of by paying a specified sum” (The Free Dictionary). Which is especially unlikely in the case of the “rich man” Joseph of Arimathea (Mt 27:57) that he would have to buy back (e.g. from the 1st century equivalent of a pawnshop?) linen that he had previously owned!\nStephen\n\n","date":"March 4, 2010 at 10:50 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1089","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nIn this world we can only express what we think. Every translation you have ever read in print expresses what the translator thinks the original message says. If you think that is a climb down then stick to the original Greek text and even then what you think it says is in the end only your opinion, or what you think it says. \nAs for my translation it is a supportable and verifiable one based upon various considerations fully explained in my book. \nThe Pesach Eve is a Jewish holy day, not only the Pesach (Passover).  \nI can see you never understood my point that Joseph of Arimathea purchased back or redeemed the tallit of Jesus won in a dice game at the crucifixion. I never said the tallit was that of Joseph of Arimathea which he bought back, obviating you never understood what I was saying since you wrote :\nEven if it be granted that “redeeming” was a usual term for buying used linen, which seems unlikely, as “redeem” has the meaning of buying back something that one formerly owned, i.e. “To recover ownership of by paying a specified sum” (The Free Dictionary). Which is especially unlikely in the case of the “rich man” Joseph of Arimathea (Mt 27:57) that he would have to buy back (e.g. from the 1st century equivalent of a pawnshop?) linen that he had previously owned!\nI hope it is a bit clearer now that Joseph bought back the tallit belonging to Jesus Christ to bury him with it.\nBest regards,\nJohn\n\n","date":"March 5, 2010 at 4:14 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1096","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":">the Shroud width does not measure 111 cm, but 113 to 113.7.\nThanks to John for that latest measurement. I would appreciate a reference for it. \nSo even on John’s own admission there is no one exact measurement of the Shroud, but only a range of measurements.\nThat is also close enough (for me at least) to 2 x the Assyrian Royal cubit of 55.6 cm = 111.2 cm.\nGiven that: 1. it is impossible to know what the exact original dimensions of the Shroud were, given that for centuries it has been stretched, using weights, by  hanging it both vertically and horizontally; 2. it is unreasonable to demand that a ~2,000 year-old cloth, produced when measurements were cubits, based on the length of part of a man’s arm and finger breadths, should conform exactly to the very centimetre or millimetre, to a multiple of an idealised average of one of those cubits, i.e. the Assyrian Royal cubit of 55.6 cm.\n>The unit of measurement you are applying is the wrong one. \nShort of omniscience or a time machine, John cannot know that. His extreme dogmatism and absolutism is out of place in the field of Shroud studies. It is entirely possible that the Shroud was originally woven in the 1st century in Syria and intended to conform by its weaver to approximately 8 x 2 Assyrian Royal cubits. \n>I think we actually might be saying the same thing, in a sense, since you are assertive that the Shroud can be shown to conform to an ancient unit of measurement, just as I do.\nNo. John’s claim originally was that: “The dimensions of the Shroud do not conform to 8 x 2 cubits of any sort” and he has never actually retracted that. My claim is that the dimensions of the Shroud would likely have originally conformed approximately to 8 x 2 of the Assyrian King’s cubit (~ 55 cm) or more likely Royal cubit (~55.6 cm).\n>The only difference is I found another ancient unit that works much better.\nGreat! But paradoxically, if John’s proposed different ancient unit of measurement yields exactly the dimensions of the Shroud today, then it is almost certainly not the originally unit of measurement used by the weaver of the Shroud’s linen. \nThat is because: 1) ancient units of measurement and their application were not exact (see above); 2) due to centuries of stretching the Shroud, both horizontally and vertically, as uncountable numbers of clerics held it up for display, with weights to stop it from flapping (it is approx. 4 x 1 metres yet only as thick as a shirt), as documented in art and photographs; and 3) an unknown length of the Shroud was cut off for relics; it is highly unlikely that the Shroud’s dimensions today are what it originally was, even if we could reconstruct exactly how much has been cut from its length.\n>I think you will be very pleased when you read about it.\nSorry, but given John’s extremist dogmatic claims, to the effect that everyone else is wrong and only he is right, I agree with the commenter who wrote: “I think I’ll wait on the reviews before I spend this kind of money.”\nStephen\n\n","date":"March 5, 2010 at 12:33 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1090","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"I think I will read Corsi’s new novel before I read Lupia’s fiction.\n\n","date":"March 5, 2010 at 8:42 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1092","author":"Theologian","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"John\n>The Pesach Eve is a Jewish holy day, not only the Pesach (Passover). \nWhatever the Jewish custom is today, the Gospels don’t say that the Day of Preparation, on which Jesus was crucified (Mk 15:42; Lk 23:54; Jn 19:31) was then in the 1st century a holy day in which no work, such as buying and selling could be done. \nIn fact the emphasis of the Gospels is that Jesus’ body had to be removed before sundown, because it would then be the Sabbath (when no work could be done – Lk 23:53-24:1), and the Jews did not want the bodies left on their crosses to defile that holy day:\nJn 19:31. Now it was the day of Preparation, and the next day was to be a special Sabbath. Because the Jews did not want the bodies left on the crosses during the Sabbath, they asked Pilate to have the legs broken and the bodies taken down.\n>I can see you never understood my point that Joseph of Arimathea purchased back or redeemed the tallit of Jesus won in a dice game at the crucifixion.\nI did not even know that was your point, because as far as I know, you had not stated it here. But the Gospels say nothing about Joseph of Arimathea redeeming Jesus’ tallit, when they surely would have (it being a redemption theme) if it happened.\nBesides, the Gospels have a word for tallit, Gk. himation “garment, robe, cloak.” It is highly likely that a tallit is meant when the Gk. kraspedon “a fringe or tassel” is used in conjunction with it, e.g. the woman with a haemorrhage and others being healed by merely touching the “hem,” “edge” or “border” of Jesus’ garment (Mt 9:20; 14:36; Mk 6:56; Lk 8:44) and also when Jesus criticised the Scribes and Pharisees because they made “the tassels on their garments long” (Mt 23:5). So if Joseph had bought back from the Roman solders Jesus’ himation at least one of the Gospels would surely have said so. It doesn’t make sense that Mark, just after recording that the soldiers “parted his garments himatia” (Mk 15:24 KJV), would then say that “Joseph bought some linen cloth [sindona]” (Mk 15:46).\nAnyway, in researching the Gk. himation on my computerised Parson’s Greek-English Dictionary, I found a clear refutation of your theory that the Shroud is Jesus’ tallit, and that is Mt 27:59 which states that: “Joseph took the body” and “wrapped it in a clean [Gk. katharos] linen cloth,” because Jesus’ outer garment by that stage would have been anything but clean, it having been placed back over his bleeding scourged body (Mt 27:31; Mk 15:20).\nAlso, in Googling “shroud tallit” I found that the theory that the Shroud is a tallit, had been proposed by a Donald Smith in 1997:\n“Donald Smith, a new BSTS member from North London, has written inviting any Newsletter readers with the requisite specialist knowledge to get in touch with him to discuss a hypothesis he is working on that the Shroud was first a Jewish ‘Tallit’. Otherwise known as a pallium or himation, the measurements he gives for this are 118,4 cm by 444 cm – proportions of one to 3.74, rather than one to four as in the case of the Shroud. Working with 444mm as the Roman cubit and 555mm as the ‘legal’ or ‘Talmudic’ cubit, he proposes that the Shroud’s original length was 10 Roman or 8 Jewish cubits. He maintains that the Shroud is lacking a second seam with identical ‘hem’ and two corners, besides those known not to be original. He believes that all four corners, with ‘gams’ (letter-like forms created in appliqué ribbon) were cut away. The two corner patches we do have are unequal in length, according to him, because an end-strip of similar width to the seam and ‘hem’ combined was also, and last of all, removed. It was also these strips, he suggests, which made it possible to tie it as a ‘bag’.” (BSTS Newsletter, No. 46, Nov/Dec 1997).\nSo the problem is not that the Shroud may have been a Jewish tallit: I said at the outset it may well have been. Although having now realised there is a Gk. word for tallit (himation), I don’t think the Shroud could have been actually a tallit, complete with tassels, etc, but may have been the fine linen sheet basis of a tallit, or other piece of fine linen clothing. No, the problem is your theory that the Shroud was Jesus’ tallit, because the Gospel evidence is against it. \nStephen\n\n","date":"March 5, 2010 at 11:03 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1097","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nIt is clear that discussing a book in a blog with someone who has not read the book can easily come to misunderstandings about what the book actually says. This is especially true when discussing the book with the author who is very reluctant to reveal the crux of the arguments, giving away the store, so to speak, but would rather have readers discuss the book who actually read it. So my recommendation to you and any other poster to this blog is to either buy the book or borrow a copy from a library, read it, and then discuss it here or anywhere else they wish to. \nRegarding the Pesach Eve, an ancient Jewish custom, you have asserted it is contemporary, not ancient. Yet, in your correct reading of the Gospel it clearly says Sabbath eve, meaning the approaching sundown for the Sabbath, when no work was allowed since the Sabbath began about 6 p.m. Friday evening. This is the eve of the Sabbath. Jews throughout history have left all work undone Friday afternoons usually around 2 p. m. to be home before sundown because there were restrictions on how far they could travel home and beyond that it was considered work and a Sabbath violation. Even when they got home they were limited to what they could do not to violate the Sabbath by working at home preparing for the Sabbath feast. So they left early (around 2 p.m.)  to get home and prepare for the Sabbath. This tradition is still true throughout the Middle East when Friday afternoon comes around all commerce ceases around 2 p.m. However, this was no ordinary Sabbath but one of the major Holy Day’s in the Jewish liturgical calendar, Passover (Pesach). This Pesach eve has always been part of the traditional Jewish celebration for Passover, nothing new, nothing modern, but rather, ancient. \nThe redemption or buying back of the tallit of Jesus by Joseph of Arimathea from the Roman soldier is more clearly explained in the book when you read in context.\nYes, himation was ONE of the Greek words used as a synonym for tallit. Other synonyms are given in the book. If it were that easy to find them all on your own then everyone would have easily known them all and the tallit theory would have been long discussed for years as a common piece of knowledge. That is why researchers do the research and publish. They have done the work and presented it on a silver platter so that readers can gain in moments what it took years for a researcher to learn and find through arduous investigations.\nI appreciate your enthusiasm doing biblical searches in Greek lexicons, etc. It shows you are very interested in Scripture and are serious about studying and learning as much as you can. I am sure you will enjoy reading my book whether you buy a copy or borrow one from a library because the study of Greek will be “right up your alley”, to use the American colloquialism. \nI have known about Donald Smith and his theorizing since that publication came out. I have been researching the Shroud of Turin since 1970. I had already developed the tallit theory about a year prior to Smith and was surprised at that time that anyone else considered it. It put me in a bit of a panic thinking it would catch on and that I needed to complete my work ASAP and publish it before anyone else did. But, nobody followed up on this and I breathed a sigh of relief knowing I had more time to research and investigate further since I was not content with the state of my research 1996-1997. As you can see I spent 14 years just studying the tallit specifically. \nI only ask that you be fair and kind and show charity and goodwill and mutual respect as a gentleman about a book he has never read and allow their neighbor (me) to have the book read by actual readers and listen and learn in order  to come to a fuller understanding of just what the book says. It is a bit awkward for me as an author to reveal too much. If you reveal too much too soon it does harm to the commercial value of the book. The book is my intellectual property and all I ask is that you respect that.  \nPerhaps in a month or so you will be reading reviews by readers of the book and you might find by that time it is available in your local library in Perth, Australia. So, be patient and keep all of these thoughts in the back of your mind until you read the book first hand.\nI am very glad to see that you have an enthusiastic interest in this subject since I am sure you will find something in the book worthwhile.\nIt would be not realistic for any author to expect nothing but rave reviews about their book. This is especially true about a book written about a subject that is controversial like the Shroud of Turin. Surprisingly, there are even advocates of the Shroud of Turin who for one reason or another will delight in giving this book scathing reviews, even though the book provides evidence to authenticate the Shroud. It seems that this group of critics fails to recall the words of our Lord in the Gospel of Mark 9:40 “for whoever is not against us is for us.” But age brings about wisdom, and as an older man I have come to realise one thing, that I can only control my behavior, not my neighbors. \nI began my journey in research on the Shroud of Turin as a dark haired young man. The book is now published when I am an older man with white hair. So please allow me, your neighbor, who is neither against you, nor against our Lord, nor against the Shroud, a chance to share his research with others who might be interested enough to buy the book. \nYou are free, of course, to continue to make judgments against me, my abilities, my theories, and my book. I only ask in Christian charity that you be fair and base your comments and criticisms on the merits or demerits of the book itself. For in the end any sensible author knows that all publicity, whether good or bad, stirs up interest in their book.\nBest regards,\nJohn\n\n","date":"March 6, 2010 at 11:21 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1099","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":">The redemption or buying back of the tallit of Jesus by Joseph of Arimathea from the Roman soldier is more clearly explained in the book when you read in context.\nJohn just ignores Mt 27:59 which states: “Joseph took the body, wrapped it in a clean [kathara] linen cloth …”\nThat is a total refutation of his theory that the Shroud is Jesus’ tallit, since the Gospels record that after Jesus had been flogged and crowned with thorns, the soldiers put Jesus’ own clothes (which would include his tallit) back on his by then bleeding body:\nMt 27:26-35. 26Then he released Barabbas to them. But he had Jesus flogged, and handed him over to be crucified … 28They stripped him and put a scarlet robe on him, 29and then twisted together a crown of thorns and set it on his head. … 31After they had mocked him, they took off the robe and put his own clothes on him. Then they led him away to crucify him. … 35When they had crucified him, they divided up his clothes by casting lots.\nJesus’ bloodstained tallit would have been among these same clothes that the soldiers gambled for and which John claims Joseph of Arimathea bought back from one of them and used as Jesus’ burial shroud. \nBut since Mt 27:59 makes it clear that Jesus’ burial shroud was “a clean [kathara] linen cloth” it could not have been Jesus’ tallit.\nStephen\n\n","date":"March 6, 2010 at 4:24 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1102","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nI can see you are only continually looking for loopholes to prove my thesis has no valid basis in scripture and is easily refutable. That is pretty discourteous to the author since it suggests that something so self-evident eluded him and that insufficient study and research has led him down the wrong path. The book was forty years in the making and the last fourteen years were spent on the study of the tallit. The book is thoroughly and meticulously researched, and the manuscript was peer reviewed to assure that no blatant or any other form of errors were contained in it.  I do not mean layout and copy editors but specialists in the fields of archaeological textiles and biblical studies and sacred scripture reviewed the book manuscript.\nWithout having read the book it is impossible for you or anyone else to say that the thesis is refutable since you have not read it. The scriptural narratives were exhaustively researched and the explanations given in the book address and answer the very point you have made since there is strong evidence that the tallit-Shroud was washed prior to burial. This is not anything new in the field of Shroud research since a few Shroud researchers have already made this as a viable theory, including the late Ray Rodgers, who identified some of the chemicals on the Shroud used in laundering it. \nPlease try to refrain from being judgmental. You might have simply asked about the seeming contradiction rather than being so assertive and adversarial claiming that you are right and I am wrong. But thanks for the continued publicity.\nJohn\n\n","date":"March 6, 2010 at 7:12 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1103","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"John\n>The scriptural narratives were exhaustively researched and the explanations given in the book address and answer the very point you have made since there is strong evidence that the tallit-Shroud was washed prior to burial. \nSorry, but “clean” katharos, “clean (lit. or fig.):–clean, clear, pure” does not mean “washed” which is (Gk. nipto Mt 27:24; Jn 9:7,11,15; 13:14; 1Tim 5:10; brecho Lk 7:44; baptizo Lk 11:38; louo Jn 13:10; Ac 9:37; 16:33; 1Cor 6:11; Heb 10:22; 2Pet 2:22; Rev 1:5; or pluno Rev 1:5). Especially the latter: “and have washed [pluno] their robes” (Rev 1:5).\nIf Joseph of Arimathea had bought back Jesus’ bloodstained tallit and washed it, at least one of the Gospels would surely have said so and used one of the words for “washed” above, but they don’t.\nYou are trying to make the evidence fit your theory but you should try to make your theory fit the evidence. Any theory can be propped up by adding `epicycles’ as you are doing to try to make it seem to fit the evidence, but in the end your theory has too many special assumptions that aren’t in a straightforward reading of the relevant Gospel accounts. \nIn science Occam’s Razor decrees that the simplest theory which fits all the facts is the best. And the simplest theory that fits all the relevant facts in  this case is that Joseph of Arimathea bought in the market a clean linen cloth and used that to enshroud Jesus’ body.\nI feel for you, that you have spend many years and written a book based on a theory which contains a fatal flaw. But that is the case and `shooting the messenger’ won’t change it.\nStephen\n\n","date":"March 6, 2010 at 8:30 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1104","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nThank you for the continued publicity and diligence in attempting to find flaws in my book which you have not read. If you ever read the book all of your questions will be happily answered in the text. \nIt is rather naive to think that the Gospels are photo journalistic in the sense that they are recording every single minute detail such as Joseph of Arimathea having the tallit of Jesus washed and dried and brought to the tomb for burial. If a tallit is clean, as Matthew 27:59 says it is, by implication it has been washed. For even new unused tallitot were washed if sold in the market. So the sword you swing swings both ways. I think I heard you cry “Ouch” all the way from here!\nThanks again for your continued publicity of my book.\nAll the best,\nJohn\n\n","date":"March 6, 2010 at 9:02 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1105","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"John\n>If a tallit is clean, as Matthew 27:59 says it is, by implication it has been washed. For even new unused tallitot were washed if sold in the market.\nNot washed clean of bloodstains from being placed over a bleeding living body that had been scourged and crowned with thorns! That would have made Jesus’ tallit ceremonially unclean on what you claim was a holy day.\nThere is also the impossibility of cleaning a 4.5 square metres, absorbent linen sheet of all traces of blood, in the limited time available.  \nAlso washing it would be work on what you claimed was a holy day. So why is it OK to work washing a large bloodstained linen sheet on a holy day (according to you) but not OK to work selling a “clean linen cloth” (Mt 27:59) on a holy day?\nAnd why would Joseph go to all that trouble? There was no requirement that Jesus’ burial shroud had to be his tallit.\nTo try to save your theory that the Shroud is Jesus’ bloodstained tallit washed clean (of which there is nothing in the Gospels) from being falsified by Mt 27:59, that “Joseph took the body” and “wrapped it in a clean [Gk. katharos “clean, clear, pure”] linen cloth,” you have now made it self-contradictory.\nStephen\n\n","date":"March 7, 2010 at 10:34 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1109","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nIn the first place I was showing you how Mt 27:59 certainly means washed since it was typical during the first century that even new unused linen bolts or garments were washed by the workshops that wove them before selling them in the market. This fact alone overcomes your objection that Mt 27:59 does not mean washed since it certainly does. However, it requires someone who is familiar with the historical context and culture of that milieu to be able to comprehend that. When we translate or interpret scripture outside of the historical context in which it is written it is anachronistic and opens up Pandora’s box to every unwarranted thought and suggestion and either everything becomes possible or else a rigid narrow minded view is imposed where only one exclusive anachronistic meaning is possible. In this case you have clearly opted for the latter. \nYou wrote : “Not washed clean of bloodstains from being placed over a bleeding living body that had been scourged and crowned with thorns!”\nThis is a fragment sentence and does not make sense grammatically. \nYour next sentence seems to imply that what you are saying is that if Jesus’ tallit was bloodstained it was ceremonially unclean.  I think you finally see my point.\nAccording to Mark 15:25 Jesus was crucified at the third hour, which requires us to calculate the time from the Roman hours of the day telling us it was at 9 a.m. If he was being buried between 5 and 6 p.m. that gave the Apostles and Joseph of Nicodemus 8 or 9 hours to have the tallit washed and dried. The actually number of hours to do this in Jerusalem during springtime is certainly less than half that time. Having lived in the Middle East and laundered clothes drying them outside I can tell you from experience it would not take more than a few hours. So judging from my own experience I can assert that it would have only taken about a quarter or less of the allotted time in the timeline. Yet you claim : “There is also the impossibility of cleaning a 4.5 square metres, absorbent linen sheet of all traces of blood, in the limited time available.”\nYou continually make wrong conclusions and vigorously assert them very dogmatically as if they are facts. \nAs for your following comments I will preface them by what I have said previously :\nI can see you are only continually looking for loopholes to prove my thesis has no valid basis in scripture and is easily refutable. That is pretty discourteous to the author since it suggests that something so self-evident eluded him and that insufficient study and research has led him down the wrong path.  \nIf you are a Jew then you do not work on a Holy day. If you are a Roman fullo you can work since they were Gentiles and not bound by Mosaic law. Judea was ruled by a Roman Procurator and many Gentile Romans lived in Jerusalem at the time of the crucifixion. Once again your object is easily overcome by anyone familiar with the historical context and culture of that milieu and obviates the fact that you have not done your homework.\nAs for Jesus’ burial shroud being his own personal tallit all the original sources are cited in my book. \nYour continued demonstration of convoluted logic, ignorance of biblical Greek, philology, historical context and culture of that milieu, is doing you more harm as an author to your prospective readers than you are attempting to foist on me. The objections you propose are those of a layman and I am glad you have voiced them allowing me to air them out here in the event anyone else comes to these same considerations. Here they will find a wealth of information to help them see there are explanations that easily overcome them. So, for this opportunity I thank you very much allowing my prospective readers to plainly see that my thesis is not self-contradictory as you dogmatically and continuously assert though you never read my book. This also makes readers of this blog wonder what your real motive might be since I have already politely asked you that if you do think you see problems or objections to my thesis to kindly ask me for an explanation which I would most generously provide as I already have. Yet you continually take a confrontational and adversarial approach that winds up backfiring on you making your readership wonder about the validity and quality of research of your own books.\nThanks again for helping to publicize my book. You are doing a great job.\nBest regards,\nJohn\n\n","date":"March 7, 2010 at 12:41 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1110","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen. I agree with you. Lupia’s attempt at liberal biblical revisionism won’t fly. Isn’t such revisionism always an attempt to make the narrative fit a theory . . . . (the rest of the comment has been deleted as inappropriate by admin)\n\n","date":"March 7, 2010 at 9:32 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1108","author":"Theologian","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Theologian\nI find your comments here amusing to me since you characterize my book, which you have never read, as liberal biblical revisionism. The reason I find this amusing is that most of the biblical scholars who know me think I am  a very conservative Catholic. \nYou wrote : \n“Isn’t such revisionism always an attempt to make the narrative fit a theory, usually an off-the-wall theory?”\nThis also swings both ways. Though I am not a liberal revisionist and have only taken the path of sound biblical scholarship citing the writings of published biblical scholars, none of whom are classified or thought of as liberal revisionists, on the other hand, a real liberal revisionist can deny the validity of all the previously published biblical scholarship cited in my book that shows what I am saying is valid in order to fit their own pet interpretation that wants to falsify it. . . . . (the rest of the comment has been deleted as inappropriate by admin because it applies to an inappropriate comment that has been removed)\n\n","date":"March 7, 2010 at 1:33 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1111","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"John\nYou are taking my critique of your theory too personally. I have nothing personally against you or your theory. Indeed, I said at the outset, “It would be great if the Shroud was a Jewish tallit (i.e. prayer shawl) because it would be another problem for the medieval European forgery theory to explain.” I am only interested at getting at the truth. \n>If you are a Jew then you do not work on a Holy day. If you are a Roman fullo you can work since they were Gentiles and not bound by Mosaic law.\nSo now, in order to save from falsification by Mt 27:59 “Joseph took the body [and] wrapped it in a clean linen cloth” your theory that the Shroud is Jesus’ tallit that was put back on His scourged and crowned-with-thorns bloody body (Mt 27:26-35), you are proposing yet another `epicycle’ that Joseph of Arimathea, on a holy day (according to you) circumvented the Mosaic Law by employing a Gentile to wash Jesus’ bloodstained tallit. \nBut apart from the dishonesty in the things of God you would then be attributing to Joseph, a devout Jew (“a disciple of Jesus” – Mt 27:57; Jn 19:38; who was “waiting for the kingdom of God” – Mk 15:43; Lk 23:51), that would still be work in that it would be a Jew buying services off a Gentile on a holy day (according to you). \nAnd if only Gentiles could then work on Passover Eve (according to you) then why could not Joseph have “bought some linen cloth” (Mk 15:46) from a Gentile market stall? Since Syria was then the major linen production centre in the Middle East, it is highly likely that there would have been Syrian markets selling linen  open on Passover Eve, if not in Jerusalem itself, then outside the then city’s walls.\nAlso the word for “bought” (Gk. agorasas), does not mean “redeem” (except “figuratively”), i.e. “Agorazo does not mean `to redeem'”:\n“Buy, Bought … agorazo. primarily, “to frequent the market-place,” the agora, hence “to do business there, to buy or sell,” is used lit., e.g., in Matt. 14:15. Figuratively Christ is spoken of as having bought His redeemed, making them His property at the price of His blood (i.e., His death through the shedding of His blood in expiation for their sins), 1 Cor. 6:20; 7:23; 2 Pet. 2:1; see also Rev. 5:9; 14:3,4 (not as AV, “redeemed”). Agorazo does not mean “to redeem.” See REDEEM.” (“Vine’s Expository Dictionary of New Testament Words” My emphasis).\nThere is a form of agorazo, that doe mean “redeem,” namely exagorazo:\n“Redeem, Redemption … exagorazo. a strengthened form of agorazo, “to buy” (see BUY, No. 1), denotes “to buy out” (ex for ek), especially of purchasing a slave with a view to his freedom. It is used metaphorically (a) in Gal. 3:13; 4:5, of the deliverance by Christ of Christian Jews from the Law and its curse; what is said of lutron (RANSOM, No. 1) is true of this verb and of agorazo, as to the Death of Christ, that Scripture does not say to whom the price was paid; the various suggestions made are purely speculative; (b) in the Middle Voice, “to buy up for oneself,” Eph. 5:16; and Col. 4:5, of “buying up the opportunity” (RV marg.; text, “redeeming the time,” where “time” is kairos, “a season,” a time in which something is seasonable), i.e., making the most of every opportunity, turning each to the best advantage since none can be recalled if missed.” (“Ibid.“).\nSo if Joseph had bought back Jesus’ tallit from the Roman soldier who had won it in a gamble (Mk 27:35; Mk 15:24; Lk 23:34), Mark would have used exagorasas.\nExcept that if Joseph had bought the linen privately from a Roman soldier, he would not have used either agorasas or exagorasas, since as Vine says above, they mean “primarily, `to frequent the market-place,’ the agora, hence `to do business there, to buy or sell'” (my emphasis). There is another word under Vine’s “Buy, bought,” namely oneomai “to buy, in contradistinction to selling”:\n“oneomai `to buy, in contradistinction to selling,’ is used in Acts 7:16, of the purchase by Abraham of a burying place.” (“Ibid.“)\nthat Mark would have used in Mk 15:46 if he had meant that “Joseph bought some linen cloth” privately from a Roman soldier.\nStephen\n\n","date":"March 7, 2010 at 9:37 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1115","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Once again, I repeat, your continued demonstration of convoluted logic, ignorance of biblical Greek, philology, historical context and culture of that milieu, is doing you more harm as an author to your prospective readers than you are attempting to foist on me. The objections you propose are those of a layman, amateur and hobbyist since you cite authors whom you think are authorities that no biblical scholar would cite as an authoritative source or reference, like Vine. In biblical Greek scholarship the two standard references are to Kittel and BGD. \nNow you are imputing violation of the Sabbath law not to work to a Jew who hires Gentiles to do the work for them. This is very convoluted logic. If you choose to characterize this as Joseph of Arimathea as well as all Jews who did this as a practice as having “circumvented the Mosaic Law” or “dishonesty in the things of God” you are only showing that you do not understand the culture and are viewing this anachronistically, since by doing so any Jew that did this acted within the law and was not circumventing or being dishonest with God, but rather, did what was permissible, i.e., what God allowed.\nYou wrote :\n“But apart from the dishonesty in the things of God you would then be attributing to Joseph, a devout Jew (“a disciple of Jesus” – Mt 27:57; Jn 19:38; who was “waiting for the kingdom of God” – Mk 15:43; Lk 23:51), that would still be work in that it would be a Jew buying services off a Gentile on a holy day (according to you).”\nNow you are saying that buying services is work in violating the Sabbath prohibition, but fail to consider by your own logic that buying linen would too be the same violation. Once again, this is very convoluted logic.\nYou wrote :\n“And if only Gentiles could then work on Passover Eve (according to you) then why could not Joseph have “bought some linen cloth” (Mk 15:46) from a Gentile market stall? Since Syria was then the major linen production centre in the Middle East, it is highly likely that there would have been Syrian markets selling linen open on Passover Eve, if not in Jerusalem itself, then outside the then city’s walls.”\nFirst, your conditional phrase ““And if only Gentiles could then work on Passover Eve” is incorrect since it is a fact. Only Gentiles could work when Jews were prohibited by law.\nSecond, your suggestion that a Jew buy linen or a tallit from a Gentile once again shows your ignorance of the historical context and culture of that milieu of Judea in the first century or any other time for that matter. No Jew would buy anything to wear or touch that has been touch by Gentiles (goyim), which makes the object unclean. Jewish merchants sold tallitot, not Gentiles.\nThird, you are asserting based on very limiting reading that “Since Syria was then the major linen production centre in the Middle East” something that is not quite true. The Roman Province of Syria was only one of the important linen production centers. Palestine was also a major linen center. So was Egypt. Perhaps you never heard of Egyptian linen before.\nFourth, you wrote :\n“it is highly likely that there would have been Syrian markets selling linen open on Passover Eve, if not in Jerusalem itself, then outside the then city’s walls.”\nMaybe they have Syrian markets in Perth, Australia! There was no such thing known in first century Judea. Syrian merchants together with all the other merchants may have had a place in the agora to sell wares but there were not any Syrian markets set up in Judea.\nThe rest of your post only shows your lack of knowledge of New Testament Greek and the accepted scholarly sources. For your own edification buy a copy off Kittel and BGD. Also very excellent sources on NT Greek are Abel, Balz, Chantraine, Funk, Lampe, LSJ, Louw, Spiq, Strong, Swetnam, and  Zerwick.\n\n","date":"March 8, 2010 at 10:45 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1120","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"John\n>For your own edification buy a copy off Kittel and BGD. \nI have both. \nKittel’s “Theological Dictionary of the New Testament” (1985) has “agorazo [to buy, redeem] exagorazo [to redeem] …  agorazo 1. Meaning `to buy’ …” (p.19). Although “redeem” is in the heading of Kittel’s agorazo, it does not give “redeem” as a separate secondary meaning of “to redeem” under that heading but includes examples of redeem under “1. To buy.” There is no specific reference to Mk 15:46.\nBGD, i.e. BAGD (Bauer, Arndt, Gingrich & Danker’s “Greek-English Lexicon of the NT,” 1979), for “agorazo” has 1. lit … buy, purchase … sindona Mk 15:46 …” and 2. fig. based on the analogy of … bestowed freedom on a slave …” (p.12).\nSo your own two recommended authorities, “Kittel and B[A]GD,” do not support your claim that agorasas means “redeem.” In fact BAGD specifically states of agorazo (i.e. agorasas) in respect of sindona in Mk 15:46 that it means “buy, purchase” not “redeem.” \nStephen\n\n","date":"March 8, 2010 at 11:33 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1121","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\n“There are more things in heaven and earth, Horatio, than are dreamt of in your philosophy.”\nI do not expect you to ever fathom the original Greek since you insist on rigid narrow applications that are not exclusive to all others. But for your benefit I have included some citations you may be interested in reading. I know you will always come to conclude that Joseph of Arimathea “bought a linen”. So lets move on.\nYou must be using an abridged edition of Kittel, which unabridged is 10 volumes. You cite p. 19 which is incorrect in the full 10 volume edition.\nSee Liddell, Henry George, and R. Scott, and H. Stuart Jones (1996) Greek-English Lexicon, Oxford: Oxford University Press; page 13, entry: agorazo 2. cites B. P. Grenfell, Revenue Laws of Ptolemy Philadelphus, 60.23 with the meaning of a tax or state contract. See also Spicq, op. cit., volume 1: 26-28; Buchsel, Friedrich,  “agorazo” in Gerhard Kittel, ed., Theological Dictionary of the New Testament (Wm. B. Eerdman’s Publishing Company, Grand Rapids, Michigan, 1999): Volume 1:124-128.\n\n","date":"March 8, 2010 at 12:43 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1124","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Mr. Lupia, you wrote, “your suggestion that a Jew buy linen or a tallit from a Gentile once again shows your ignorance of the historical context and culture of that milieu of Judea in the first century or any other time for that matter. No Jew would buy anything to wear or touch that has been touch by Gentiles (goyim), which makes the object unclean. Jewish merchants sold tallitot, not Gentiles.”\nDid you just make that up, Mr. Lupia? You have to be kidding? Right?\n\n","date":"March 8, 2010 at 11:54 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1122","author":"Theologian","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Theologian\nNo. I did not make this up and it is not a joke. A tallit is no ordinary garment, but sacred. No Jew would buy a holy thing that is religio-culturally considered sacred from a Gentile. \nJohn\n\n","date":"March 8, 2010 at 12:25 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1123","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"John\n>You must be using an abridged edition of Kittel … See Liddell, Henry George, and R. Scott, and H. Stuart Jones (1996) Greek-English Lexicon\nYou simply ignored my: BAGD (Bauer, Arndt, Gingrich & Danker’s “Greek-English Lexicon of the NT,” 1979), for “agorazo” has 1. lit … buy, purchase … sindona Mk 15:46 …” In fact BAGD specifically states of agorazo (i.e. agorasas) in respect of sindona in Mk 15:46 that it means “buy, purchase” not “redeem.” \nBAGD is the world’s leading NT Greek-English lexicon, which you yourself recommended. It specifically states that agorasas in Mk 15:46 means “buy, purchase,” i.e. “bought,” not “redeemed.” \nMy Zodhiates’ “The Complete Word Study Dictionary: New Testament” (1992) also has under agorazo “from agora market place. To buy … Mark … 15:46 …” (p.75).\nMy Thayer’s “Greek-English Lexicon of the New Testament” (1901) under agorazo has “1. To frequent the market-place. 2. To buy (properly, in the market-place. … b. figuratively: Christ is said to have purchased his disciples … But agorazo does not mean redeem (exagorazo …” (p.8. My emphasis). \nMy 24 different e-Sword English translations give the following translation of agorasas in Mk 15:46: “bought” 21; “got” 1; “buying” 1; “purchased 1. Not even one translated it as “redeemed.”\nTo summarise, your theory is refuted (even if you refuse to accept it), that the Shroud of Turin is Jesus’ tallit for reasons including:\n1. There is a Greek word himation for tallit which the Gospels don’t use for Jesus burial cloth but instead use sindon “linen” (Mt 27:59; Mk 15:46; Lk 23:53); \n2. The Gk. word agorasas in Mk 15:46 means “bought” not “reedemed”; \n3. Mt 27:59 says that Joseph wrapped Jesus’ body in “a clean [katharos “clean, clear, pure”] linen cloth” not a bloody tallit that had been washed; \n4. The Gospels don’t state that Passover Eve then was a holy day in which no work, including buying or selling, could be done. Rather, their emphasis is on the need to get Jesus’ body off the cross and entombed before sundown and the Sabbath (which was also the Passover that year) began (Lk 23:54-56; Jn 19:31);\n5. Your theory is self-contradictory because you claim Jews could not buy linen on Passover Eve, but you claim that Joseph of Arimathea, a Jew, bought Jesus’ linen tallit back from the Roman soldier who won it in a gamble (Mt 27:35; Mk 15:24; Lk 23:34; Jn 19:24).\nYou appear to have invested so heavily in your theory, which is the basis of your book, that when presented with evidence that is false; you take the easy way out and ignore that evidence and/or commit the ad hominem fallacy of `shooting the messenger.’\nHowever, other readers who can be bothered to have read this far, will make up their own minds on the truth of your theory and therefore the value of your book. I have made up mine.\nThis is (hopefully) my final comment on this topic. Thanks for the discussion. \nStephen\n\n","date":"March 8, 2010 at 6:14 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1126","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nThank you for your opinion. However, I never said Jews cannot buy linen on Passover Eve. I said they could not sell on a holy day. I also said they would not be able to buy a tallit on a holy day since tallitot were sold by Jews and they could not sell on a holy day. The event of Joseph of Arimathea purchasing the tallit of Jesus from the Roman soldier is an obvious exception since he was not a merchant but a soldier. \nScholars will read the book and their opinions will prevail, most probably after a long protracted debate.  However, I can assure you that the gist of what you are saying above will be found to be completely refuted.\nSince the Shroud of Turin is a very controversial subject any new book with new ideas and a huge discovery that authenticates it is going to be vehemently challenged and debated by many authorities. I have no concern since I know in the end my theory will stand up against scrutiny. \nThere is no need to further respond.\nThank you,\nJohn\n\n","date":"March 8, 2010 at 7:33 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1127","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Lk 23:53 KAI KAQELWN  ENETULIZEN AUTO SINDONI\n“And he took it down and wrapped it in his tallit”\nThe object AUTO is most probably to be understood as\ncomplementing both verbs. So there is a kind of elipsis here, in the first part of the phrase. I think that is an elegant (and classical) stylistic feature. What is remarkable is that the pronoun changes to masculine in the following verse, no?\nAs mentioned earlier the more precise meaning of sindon in New Testament is Greek is tallit. This was known since the 17th century. Read about this remarkable discovery in my book.\nJohn\n\n","date":"March 10, 2010 at 12:07 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1133","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":">Lk 23:53 KAI KAQELWN ENETULIZEN AUTO SINDONI\n>\n>“And he took it down and wrapped it in his tallit”\nFirstly, John’s rendering of auto as “his” above is wrong. According to my Bagster’s “Analytical Greek Lexicon,” n.d., p.60; and Robertson’s “Grammar,” 1977, pp.101-102); auto is a neuter reflexive pronoun.” Therefore John’s “his” above should be “it.” As it is my Greek-English Interlinear NT of Lk 23:53 (speaking of “the body of Jesus” in v.52):\n“… and taking down wrapped it [auto] in linen.” (Marshall, A., “The Interlinear Greek-English New Testament,” 1966, p.349).\nSecondly, John’s rendering of sindoni as “tallit” (i.e. a Jewish prayer shawl) is wrong. According to my Bagster’s “Analytical Greek Lexicon,” p.367, sindoni is the dative singular of sindon.\nAnd sindon, according to my NT Greek-English lexicons, means:\n“fine linen cloth; (a) for as used for swathing dead bodies … Mt 27:59; Mk 15:46 …” (Abbot-Smith, 1937, p.407);\n“linen 1. of the linen cloth in which the body of Jesus was wrapped Mt 27:59 … Mk 15:46; Lk 23:53 …” (Bauer, Arndt, Gingrich & Danker, 1979, p.751);\n“fine Indian cloth; fine linen; in NT a linen garment, and upper garment or wrapping of fine linen, worn in summer by night; and used to envelope dead bodies, Mat 27.59; Mar. 14.51,52; 15.46; Lu. 23.53.” (Bagster’s “Analytical Greek Lexicon, n.d., p.367,\n“a fine linen cloth … the use of this word for swathing dead bodies, as in Mt 27:59, may be seen in the letter regarding funeral expenses … a letter announcing the dispatch of a dead body … (Moulton & Milligan, \n“1. linen cloth … in which the bodies of the dead were wrapped: Mt. xxvii.59; Mk. xv.46; Lk. xxiii.53 …” (Thayer, 1901, p.576);\n“linen cloth, a sheet or wrapping of linen, probably square or oblong in form, worn by the Orientals at night (Mark 1451,52). Used also for wrapping dead bodies (Matt. 27:59; Mark 15:46; Luke 23:53 …” (Zodhiates, 1992, p.1290-91).\nNote that Bauer, Arndt, Gingrich & Danker’s lexicon above was recommended by John (as “BGD”), but it contradicts John’s claim. John also recommended Kittel’s lexicon but there is no entry for sindon in my one-volume abridged edition of the latter.  \nThirdly, as previously pointed out, there is another word himation, which evidently encompasses the Jewish tallit, especially when it is used in conjunction with kraspedon “a fringe or tassel”:\nBesides, the Gospels have a word for tallit, Gk. himation “garment, robe, cloak.” It is highly likely that a tallit is meant when the Gk. kraspedon “a fringe or tassel” is used in conjunction with it, e.g. the woman with a haemorrhage and others being healed by merely touching the “hem,” “edge” or “border” of Jesus’ garment (Mt 9:20; 14:36; Mk 6:56; Lk 8:44) and also when Jesus criticised the Scribes and Pharisees because they made “the tassels on their garments long” (Mt 23:5).”\nOn past experience, I don’t expect John to accept this evidence, so I am writing it for other readers to help them make up their own minds who to believe, the above leading NT Greek-English lexicons, or John.\nStephen\n\n","date":"March 10, 2010 at 11:03 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1135","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nIt is incredible that you write :\n“On past experience, I don’t expect John to accept this evidence, so I am writing it for other readers to help them make up their own minds who to believe, the above leading NT Greek-English lexicons, or John.”\nThis is incredible because your argument is solely based on sources I have pointed out exclusively and not those sources that I have not pointed out on this blog but are in my book. The fact that I have already checked the sources you cite for many years should tell you I already know what they say. What you do not know are the sources I cite that verify what I say is valid since I did not cite them in this blog  but in my book.\nAll who do read this blog will know that I have checked the sources I cited in this blog, just as you have, but they will also know that I have other sources cited in my book not revealed in this blog that support and defend what I am saying. \nIt is not that these lexicons I referred you to in this blog are wrong, but incomplete. It is true that himation means tallit, but it is false to say it is the exclusive word that means tallit. It is true to say that sindon means linen, but it is false to say it only means linen to the exclusion of tallit. It is true to say that sindon is the preferred word for tallit and false to say that it is not. Consequently, anyone or any lexicon that says sindon cannot mean tallit is incorrect. The word sindon has been known since the 17th century to mean tallit. This truth has been confirmed by the most prominent Jewish scholar accepted as the authority in biblical studies. I have not cited the 17th century sources not the Jewish scholar just mentioned. \nAs already mentioned earlier in this blog I pointed out that researchers spend years to discover things and publish them so that readers can learn in a few moments what it took the researcher years to learn.\nAs for your attempt at refuting my translation I gave to Luke 23:53 the commentary I posted is not mine but a New Testament Greek scholar cited in my book. When I made this discovery that Luke 23:53 could be translated this way I wrote to this Greek New Testament scholar to ask his opinion and he confirmed it and what you have read is what he wrote.\nAs already mentioned by me here in this blog I have always consulted the best authorities directly. I could see and understand your point in your constant effort to debunk me if I worked in complete isolation and everything I claim in the book is something never before consulted, but the book has been peer reviewed. No intelligent author publishes new discoveries they have made, especially discoveries that authenticate a controversial subject like the Shroud of Turin, without expert consultation. Can’t you be so kind as to accept this? And have an open mind that others may have something new to offer that without reading their book you can never understand.\n\n","date":"March 10, 2010 at 12:09 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1136","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"John has corrected me, for which I thanked him, under the post, “The Gibson Study Really Says Nothing About the Shroud of Turin,” that there is in fact a side strip and seam on the Shroud.\nHowever, this is more evidence that the Shroud is just a piece of linen (as the gospels state: Mt 27:59; Mk 15:46 & Lk 23:53), not a finished garment like a Jewish tallit. That is because it would be unlikely that someone would make, and another buy, a finished garment with a seam running throughout it’s entire length. But that would be consistent with the Shroud having been just a piece of linen, which is all the Gospels say it was: “So Joseph bought some linen cloth” (Mk 15:46); intended to be made into maller items of clothing which would not include the seam. \nWhich also raises further problems for John’s theory. Why would Jesus who criticised the Scribes and Pharisees for making “the tassels on their garments (presumably their tallits) long” (Mt 23:5), be wearing a 4.1 metre long tallit, which would be much longer than required as a bed sheet for His 1.8 metre high body? John could argue that this was just the tassels, but the underlying principle is not having ostentatiously long clothing. \nRelated to this is Jesus’ criticism of King Herod’s soft and expensive clothes (Mt 11:8; Lk 7:25) contrasting them with John the Baptist’s outdoors clothing (“made of camel’s hair” – Mt 3:4; Mk 1:6). Yet the Shroud has been variously described as “fine linen,” “fine weave,” “expensive,” and “soft” (References omitted for brevity). Jesus would be a hypocrite if He Himself wore a soft and expensive tallit, while criticizing King Herod’s similarly soft and expensive clothing.\nGoogling on “tallit” and “length” reveals that the largest traditional style tallit today (which is also the largest of all tallits) is “72 x 84” inches “Width x Length”, i.e. 1.83 x 2.13 metres (“Tallit / Prayer Shawl,” aJudaica.com). This is nearly twice as wide, yet half as long as the Shroud’s (~4.1 x ~1.1 metres).   \nIn response John may quote this Wikipedia article (since he is mentioned in it and may even have written it) that the typical tallit was longer in the first century:\n\n“The ancient Jewish tallit design was different than that known today. Originally it was a large white rectangular garment with tzitzyot [tassels] in each corner and was used as a garment, bed sheet, and burial shroud … Lupia shows the historical development of the tallit when its design began to change during the second half of the first century C.E. and began to take on the forms known today beginning around 1000 C.E. The long tradition of a single orthodox form of the tallit became modified in a more culturally diverse atmosphere and continued to change throughout time until it became permuted and shortened in length as the kitel, tallit katan, tallit gadol, and the more common tallit prayer shawl form know today” (“Tallit: History,” Wikipedia, 11 March 2010).\nEven if John was able to show that the typical 1st century tallit was ~4 metres long (yet only ~1 metre wide), he has another problem revealed by this Wikipedia article. Which is that, “Originally it [a tallit] was a large white rectangular garment … used as … a … bed sheet, and burial shroud.” In other words, his theory that the Shroud was a Jewish tallit, and not a linen sheet, is a distinction without a difference. For if the tallit Jesus wore was also his bed sheet, with some tassels attached, then absent the tassels, it would just be a bed sheet. \nBut then the tallit of the itinerant Jesus, who often had “no place to lay his head” (Mt 8:20; Lk 9:58), would most likely have been woollen, because of its greater warmth and durability than linen, especially since the same Wikipedia article states that, “Most traditional tallitot (plural of tallit) … are made of wool” (my emphasis). \nWhich in turn raises another major problem for John’s theory. Jesus’ tallit would be expected to show considerable wear and tear from His ~3 years’ public ministry, wearing it by day and sleeping in it at night, in usually rough terrain. Yet the Shroud’s condition is variously described as: “very good,” “surprisingly good,” “remarkably good,” “excellent,” “splendid condition,” and “like new” (References omitted for brevity). \nThe Shroud is consistent with it having been “a clean linen cloth” (Mt 27:59) “bought” in the market-place [Gk. agorasas] (Mk 15:46) by Joseph of Arimathea, but it is not consistent (to put it mildly) with it being Jesus’ well-used tallit that had been put back on over His bleeding body that had been scourged and His head crowned-with-thorns (Mt 27:26-35).\nStephen\n\n","date":"March 12, 2010 at 7:12 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1144","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nAll of your criticisms are ill informed due to lack of scholarly knowledge of the subject. If you read my book you will learn a great deal. Your constant attacks critiquing a book you never read is not only dishonest but risible. Buy the book. No Shroud researcher should be without a copy of my book if they are to be taken seriously.\n\n","date":"March 12, 2010 at 12:58 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1148","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"John\n>Your constant attacks critiquing a book you never read …\nI am not critiquing your book. I am critiquing your theory that the Shroud of Turin is Jesus’ tallit.\nAnd I can do that without reading your book, based on what I know about: 1. the Shroud of Turin; 2. the Gospels’ account of Jesus’ life, suffering, death and burial; 3. Jewish tallits in general; and 4. what you have said here about your theory contained in your book.\nIf you had satisfactorily answered my critique of your theory, I would have been among the first to have bought your book. But you haven’t, so I haven’t. \nRemember that I am not against your theory in principle. At the very outset I wrote: \n“It would be great if the Shroud was a Jewish tallit (i.e. prayer shawl) because it would be another problem for the medieval European forgery theory to explain.”\n and I still mean that.\nBut unfortunately you have failed to respond adequately to my testing of your theory and have instead increasingly resorted to the `shooting the messenger’ ad hominem fallacy:\n“Shooting the messenger … `Shooting the messenger’ is a metaphoric phrase used to describe the act of lashing out at the (blameless) bearer of bad news. In ancient times, messages were delivered in person by a human envoy. Sometimes, as in war … An easily-provoked combatant receiving such an overture could more easily vent anger … on the deliverer of the unpopular message than on its author, thus literally killing the messenger … In modern usage, the expression still refers to any kind of punishment meted out to the person bringing bad news, but has taken on an ironic dimension as well. `Attacking the messenger’ is a subdivision of the ad hominem logical fallacy.” (“Shooting the messenger,” Wikipedia, 9 February 2010)\nI have always assumed that when those I am debating with on the Internet start responding, not with reasoned arguments and evidence, but with ad hominem personal attacks, that is their `body language’ that they know deep down that their argument is weak.\nHowever, I am not saying that I won’t ever buy your book. I try to buy every book on the Shroud, even those that I disagree with. And it may be that, while your book’s central thesis that the Shroud of Turin is Jesus’ tallit is wrong, there is still much of value in it, e.g. ancient linen and Jewish burial practices, etc. Therefore, I look forward to reading reviews of your book from those who have bought and read it.\nStephen\n\n","date":"March 12, 2010 at 9:28 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1159","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"I think you ought to read John N. Lupia, The Ancient Jewish Shroud At Turin (Regina Caeli Press, 2010)\nI ordered this book somewhat reluctantly because all Shroud books make the same redundant claim to new discoveries, the mystery solved, and so on, but this book really delivers what it claims. When you are buying books today you have watch what you spend them on and have no regrets. You will not regret you bought this book. This is a very remarkable and extraordinary book unlike any other book I read on the Shroud of Turin, which typically repeat the same old information in a new way. This book is radically different since it essentially presents new evidence to identify what the Shroud of Turin really is, an ancient Jewish tallit garment. The author is a real scholar who knows his stuff and presents every detail and evidence as you go along.\nThe author begins by narrating his forty-year search to understand the nature of the Shroud archaeologically. He shows his own thinking process about it over the years and how new facts continually changed his view until he arrived at his definitive conclusion. His discovery of the Jewish tallit design called the Shepherd’s coat led him down the trail of clues that it is a modern version, basically a half-length pattern design, of the ancient Jewish tallit that Jesus wore. His explanations and mock-up replica of the Shroud of Turin with their illustrations that demonstrate this are very convincing and strengthen his argument.  He then explains that the side strip is not original to the Shroud but added on during the time of the Apostles. His arguments for this are based on the dislocation of the armholes on the Shroud to the selvage by 2 cm with the new side strip. He also points out the side strip could not have been original because the tallit is a\nseamless garment mentioned by St. John in his Gospel and would have been only a 6 cm strip cut or torn off at burial as customary.\nThe key to his argument is the identification of the sindon with the tallit, first made by John Lighfoot in 1653. This same identification of the sindon with the tallit is made by the Jewish scholar Marcus Jastraw. Since the ancient Jewish tallit form was not known in the 17th century it could not have been a medieval forgery as the C-14 dating test reported in 1988. The fact that the Shroud can be shown to be an ancient Jewish tallit demolishes the 1988 C-14 dating and opens up the question of what went wrong. He suggests that the C-14 dating done in 1988 did not take several important considerations into account that he explains in the book including atmospheric contamination, carbon soot contamination possibly from medieval stitching, and elevated C-14 levels caused by the fire in 1532.  He also thinks that a new C-14 dating test is ill advised because the causes are still present that skewed the 1988 test results.\nThe second chapter delves into a detailed description of the Shroud and continues the question of identification as an ancient Jewish tallit showing that first century Jews were buried in them. He also points out that the tallit began to undergo design changes around A.D. 66 and none of these changes are found on the Shroud suggesting it dates earlier. The photograph of the man wearing the Shroud mock-up replica is very compelling evidence that will convince even the hardcore skeptic.\nThe third chapter deals with ancient garments and shows how the Shroud of Turin, an ancient Jewish tallit, fits into the scheme of ancient textiles garments in antiquity.\nThe fourth chapter deals with sizes of ancient garments and shows the Shroud of Turin is consistent with what we should expect to find.\nThe fifth chapter deals with the tallit and its different functions as a garment, a bedsheet, and burial shroud.\nThe sixth chapter explains how the tallit is torn or cut at burial so that the fringes or tassels in each of its four corners are removed. This was done to the Shroud when strips of cloth were torn off its width at both ends taking these tassels with them, and the long strip replaced by the current side strip. These three strips are identified as the keiriais mentioned in the burial accounts in the Gospels.\nThe seventh chapter deals with the writings of St. John Chrysostom who describes the burial linen of Jesus as torn or cut at burial consistent with the entire identification of the Shroud as Jesus’ personal tallit.\nThe eighth chapter deals with the Greek text of the New Testament showing the choice of words carefully selected by the Evangelists all refer to the same thing, the tallit. The theme in the Gospels is that Jesus was wearing his tallit during the Passion and stripped of his garments at crucifixion. Among these is the garment without seam, Jesus’ personal tallit. This was won at a dice game by Roman soldiers and was purchased from the soldier who won it by Joseph of Arimathea. All the Gospels use Greek precise words that describe the tallit before and after the tassels are removed. Also, the Gospels refer to the linen strips cut or torn off the Shroud to wrap the body as mentioned above, keiriais.\nThe ninth chapter discusses the manufacture of the Shroud fabric as a mixture of cotton and linen and that this type of linen thread was known in antiquity.\nThe tenth chapter discusses how the seamless garment was depicted as Jesus burial garment in Byzantine art and gives further evidence that the early church kept this iconography alive.\nThe conclusion is the summary of salient points and it sums up the case in identification of the Shroud as an ancient Jewish tallit. It is an amazing book that will excite any ready to see that the Shroud of Turin is Jesus’ personal tallit garment that it contains the image of him crucified, a notion that once it sinks in gives you goose-bumps. I highly recommend this book to anyone interested in the Shroud of Turin including skeptics, enthusiasts and the curious. I rate it 5 gold stars.\n\n","date":"March 20, 2010 at 3:30 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1164","author":"Gail","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Gail\nThanks for reviewing John’s book here.\n>He then explains that the side strip is not original to the Shroud but added on during the time of the Apostles.\nThis is another flaw in John’s thesis. The side strip is original, it and the main body of the Shroud having been part of the same large cloth that had been cut into three parts, the middle part removed, and the two remaining parts (the `main body’ and `side strip’) then being rejoined expertly such that the threads appear to be continuous across the two rejoined parts. See quote from the BSTS Newsletter, No. 51, June 2000 in a previous comment.\n>The key to his argument is the identification of the sindon with the tallit …\nAgain, according to all my Greek NT lexicons Gk. sindon means “linen” not “tallit” (see previous comment). \nAlso, all my 20+ e-Sword translations of all 5 places sindon occurs in the NT (Mt 27:59; Mk 14:51,52; 15:46 & Lk 23:53) translate it as “linen” except the Message translates Mk 14:51-52 as “bedsheet” and NJB translates Mt 27:59; Mk 15:46 & Lk 23:53 as “shroud.” None of them translate sindon as “tallit.”\n>The fact that the Shroud can be shown to be an ancient Jewish tallit demolishes the 1988 C-14 dating and opens up the question of what went wrong. \nAgreed that if the Shroud was a form of Jewish tallit that did not exist after the 1st century that would be further evidence against the radiocarbon-dating of it as medieval. \nHowever, even if the Shroud was an ancient Jewish tallit, does not mean it was Jesus’ tallit. Mk 15:46 says that Jesus “bought [Gk. agorasas “buy in a market-place”] some linen cloth” and Mt 27:59 says that “Joseph took the body” and “wrapped it in a clean linen cloth.” But Jesus’ tallit would not have been clean (to put it mildly) having been placed back over his scourged and crowned-with-thorns bleeding body (Mt 27:26-31; Mk 15:15-20).\n>The sixth chapter explains how the tallit is torn or cut at burial so that the fringes or tassels in each of its four corners are removed. This was done to the Shroud when strips of cloth were torn off its width at both ends taking these tassels with them, and the long strip replaced by the current side strip. \nAs a look at a full-length photo of the Shroud shows, there are no such tears or cuts at “each of its four corners” where tassels would have been torn or cut off. See also “Length Measurements on the Shroud of Turin: Restoration 2002.” And again see above that there is no “long strip replaced by the current side strip.” \n>The eighth chapter deals with the Greek text of the New Testament showing the choice of words carefully selected by the Evangelists all refer to the same thing, the tallit. \nAgain see previous comment that there is a Gk word, himation (“garment,” “robe,” cloak”) that is mentioned in conjunction with tassels [Gk. kraspedon “a fringe or tassel”] (Mt 9:20; 14:36; Mk 6:56; Lk 8:44).\n>… Jesus was wearing his tallit during the Passion and stripped of his garments at crucifixion. … This was won at a dice game by Roman soldiers and was purchased from the soldier who won it by Joseph of Arimathea. \nAgain, the Gospels say nothing about Joseph of Arimathea buying any of Jesus’ garments off the Roman soldiers who cast lots for them (Mt 27:35; Mk 15:24; Lk 23:34). And again the Gk. word “bought” agorasas means “buy in a market place” (an agora).\n>The ninth chapter discusses the manufacture of the Shroud fabric as a mixture of cotton and linen and that this type of linen thread was known in antiquity.\nThe Shroud is not “a mixture of cotton and linen.” It is pure linen with minute traces of cotton attributed by textile expert Prof. Gilbert Raes (1973) to the loom it was woven on having also been used to weave cotton. But in fact there may be no cotton in the Shroud, the traces of cotton found being part of a medieval patch (see “The Raes Corner was an early indicator that something was wrong with the carbon 14 dating“). \n>The conclusion is the summary of salient points and it sums up the case in identification of the Shroud as an ancient Jewish tallit.\nAgain that the Shroud was intended to be the basis of “an ancient Jewish tallit” (which in the 1st century was basically a bed sheet with tassels – “Tallit: History,” Wikipedia, 11 March 2010) is possible.\nBut that the Shroud is Jesus’ tallit is against all the Biblical evidence. And also, Jesus’ tallit would almost certainly have been made of wool (as most were), given that wool was warmer and more durable that linen in the rough outdoors terrain that Jesus moved and slept in for much of the ~3 years of His public ministry.\nJohn’s theory has therefore been falsified for reasons stated above and in previous comments. And again I state that I have nothing personally against John, or his theory, and indeed I personally wish that it was true. \nStephen\n\n","date":"March 21, 2010 at 9:35 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1165","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Thank you Gail and Stephen. I’ve ordered the book and will read it. But for now, I have a hard time thinking that there is much to this who tallit idea.\n\n","date":"March 21, 2010 at 9:54 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1166","author":"Episcopalian","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Sounds to me like Lupia is saying that his speculations are proof of his speculations. Talk about extreme fallacy.\n\n","date":"March 21, 2010 at 10:09 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1167","author":"theologian","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Stephen\nThe theory presented by Dr. Mechthild Flury-Lemberg is her theory, not a fact. She presented her theory in order to explain the Shroud of Turin as we see it today with the side strip as original at the time of manufacture as her best explanation. I discussed this with her for about two months and she did seem to agree that another explanation as I have given is possible. \nThe Greek lexicons you have do not put sindon = tallit for some reason. However, the Greek word sindon has been known to mean precisely “tallit” since it was discovered in the 17th century in Hebrew and Greek texts by John Lightfoot in 1653. This is an interesting fact in itself that precludes any medieval forgery. Also, very interesting is the fact that his work is never cited by Greek lexicons. Also interesting is the fact that Marcus Jastraw the highly respected source of multiple volume lexicons that provide Hebrew and Greek translations of ancient original texts where he too cites sindon as tallit is also not cited in the Greek lexicons that you consult. It is not that they are wrong but incomplete. Since they do not contain complete citations does not falsify the meaning of sindon = tallit. That would be an illogical conclusion for anyone to assert since the evidence refutes it.\nThe remainder of your so-called Poperian falsification is circular argumentation since you cannot ascertain that sindon means tallit. You can, of course, comprehend this if you do the research as I have done and read Lightfoot and Jastraw. Until you do you are doing nothing more than repeating ad nauseum the same claim which my book clearly shows is dead wrong. The fact that you continue to pursue the same arguments over and over again without checking sources that were cited in the review already shows your lack of objectivity and dedication to research in the matter. Can you please explain why you never checked Lightfoot and Jastraw which the review cited? Until you do you are only doomed to circular argumentation. You have never proven that sindon does not mean tallit. All you have done is shown that certain Greek lexicons do not have it, which is no proof at all.\nYou claim the tzitzyot were removed from the four corners in a manner not proposed in my book. I also find it risible that you refer NOW to the dimensions of the Shroud from the Restoration in 2002 something you NEVER knew until I pointed it out to you. The same is true about the theory proposed by Dr. Flury-Lemberg, which you NEVER knew until I pointed it out to you. These two facts are clear in the blog here  and in the associated blog on this site under Shimon Gibson saying nothing about the Shroud. Yet you purport to be an expert on the Shroud and never knew these two very basic facts published widely these past eight years. I have known these facts along these years and analyzed them in the book. Without reading my book you will never learn about their analysis unless a blogger or some other website cites them. \nAs for Gilbert Raes you have made an enormous blunder. You apparently know nothing about his writings. Raes reports are completely contrary to what you are purporting he said. He is the expert who did find cotton inside the threads at the time of spinning NOT weaving. \nAll biblical evidence supports my thesis since my thesis is based primarily on the biblical evidence. But you would need to read my book to find that out.\nIt is rather curious that a so-called proponent of authentication of the Shroud of Turin is so driven to disprove a viable thesis that proves the Shroud is authentic. It is like the football player who catches the ball and runs the wrong way making a touchdown on the opponents goal line. One is wondering whose side you are really on. Your own words seem to suggest which. Matthew 7:16 By their fruit you will recognize them. Luke 6:44 Each tree is recognized by its own fruit.\n\n","date":"March 21, 2010 at 10:36 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1168","author":"John Lupia","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"John\n>The theory presented by Dr. Mechthild Flury-Lemberg is her theory, not a fact. \nIt is a fact, revealed first by x-rays, and available for you and anyone else to see for themselves, that “every thread in the weave of the Shroud is continuous through the seam and matches its corresponding side strip thread in position, thickness, and intensity” (Adler, A.D., 1997, “Concerning the Side Strip on the Shroud of Turin“). \nAnd it is a fact that Flury-Lemberg personally examined the Shroud during its 2002 restoration and found that the Shroud’s main body and sidestrip are two separate pieces of linen joined by a seam. \nIt is Flury-Lemberg’s theory that the main body of the Shroud and its sidestrip were cut and then rejoined at the same time from a larger piece of cloth. And it seems to be the only reasonable explanation of those facts, which as far as I am aware all leading sindonologists (including Wilson and Whanger who originally proposed a completely separately woven sidestrip theory) now accept. If your theory depends on the sidestrip being a completely separately woven piece of linen added to the Shroud at a later time, then you would have to explain how two separately woven pieces of linen match so perfectly across “every thread … in position, thickness, and intensity.”\n>The Greek lexicons you have do not put sindon = tallit for some reason. \nThanks for conceding it. The “reason” is that sindon means “linen” not “tallit”!\n>All you have done is shown that certain Greek lexicons do not have it, which is no proof at all.\nThey are among the leading NT Greek lexicons, including BAGD which you personally recommended to me. That you have not yet cited a NT Greek lexicon which defines sindon as “tallit” (even as a secondary meaning) indicates, given your claim of extensive research over many years into the meaning of these words, that there is no NT Greek lexicon that defines sindon as “tallit.”\n>… you refer NOW to the dimensions of the Shroud from the Restoration in 2002 something you NEVER knew until I pointed it out to you. The same is true about the theory proposed by Dr. Flury-Lemberg, which you NEVER knew until I pointed it out to you.\nAnd I thanked you at the time for your correcting me on these points. But it is not true that I “NEVER” knew them. As I stated later in a previous comment: \nBut Googling on “Turn [sic] Shroud: Past, Present and Future” and “seam” I found a report (which I already had on my computer but had forgotten) on this in the BSTS Newsletter of June 2000 …\n That is, I actually had previously read that dimensions and side-strip information in the BSTS Newsletter, No. 51, June 2000 and had saved it to my computer but had temporarily forgotten it. \nAnyway, this is another of your ad hominem fallacies of irrelevance. Although I had read this information previously and saved it to my computer, but had temporarily forgotten it, it is irrelevant to the truth of this matter, whether I personally did or did not know about it before you pointed out to me.\n>Raes … is the expert who did find cotton inside the threads at the time of spinning NOT weaving. \nAgreed. But it was only minute traces of cotton that he assumed was due to the Shroud being woven on the same loom (quotes can be supplied), not to the Shroud being intended to be a mixture of linen and cotton. And further research has suggested that the cotton in Raes’ sample, which was from the same contaminated corner of the Shroud as the radiocarbon dating sample was taken, was part of a rewoven patch, and there is no cotton in the Shroud itself.   \n>All biblical evidence supports my thesis since my thesis is based primarily on the biblical evidence. But you would need to read my book to find that out.\nGail has read your book and I was responding to her review. If she got it wrong, then take it up with her. \n>It is rather curious that a so-called proponent of authentication of the Shroud of Turin is so driven to disprove a viable thesis that proves the Shroud is authentic.\nI am “driven” to follow the truth wherever it leads. It is of the utmost importance that proponents of the Shroud’s authenticity, test all theories about the Shroud, whether from anti- or pro-authenticity theorists. \nThe Shroud pro-authenticity cause would not be helped but harmed by uncritical acceptance of a false theory about the Shroud, on the basis of that if it were true, the Shroud would have to be authentic. Apart from the ethical problem of knowingly holding a false theory because it is most convenient or effective, anti-authenticity critics would eventually discover the falsehood and the Shroud itself would be discredited, especially if it were discovered that Shroud pro-authenticity theorists knew about the false theory but kept quiet about it. \n>One is wondering whose side you are really on. \nYou have no need to wonder. I am on the side of Him who said, “I AM the Truth” (Jn 14:6). And one of my guiding Bible texts is, “Test everything. Hold on to the good.” (1Th 5:21). You are evidently confusing your theory with the truth, such that anyone who disagrees with your theory is not on the side of the truth.\nStephen\n\n","date":"March 21, 2010 at 9:28 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1171","author":"Stephen E. Jones","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"STEPHEN:\nJohn\n>The theory presented by Dr. Mechthild Flury-Lemberg is her theory, not a fact.\nIt is a fact, revealed first by x-rays, and available for you and anyone else to see for themselves, that “every thread in the weave of the Shroud is continuous through the seam and matches its corresponding side strip thread in position, thickness, and intensity” (Adler, A.D., 1997, “Concerning the Side Strip on the Shroud of Turin“). \nLUPIA:\nYou are mixed up about this report Stephen since the late Dr. Adler was attempting to prove that there is not cut and sewn seam but one continuous cloth with a tuck.\nSTEPHEN:\nAnd it is a fact that Flury-Lemberg personally examined the Shroud during its 2002 restoration and found that the Shroud’s main body and sidestrip are two separate pieces of linen joined by a seam.\nIt is Flury-Lemberg’s theory that the main body of the Shroud and its sidestrip were cut and then rejoined at the same time from a larger piece of cloth. And it seems to be the only reasonable explanation of those facts, which as far as I am aware all leading sindonologists (including Wilson and Whanger who originally proposed a completely separately woven sidestrip theory) now accept. If your theory depends on the sidestrip being a completely separately woven piece of linen added to the Shroud at a later time, then you would have to explain how two separately woven pieces of linen match so perfectly across “every thread … in position, thickness, and intensity.”\nLUPIA :\nAgreed. And the proof of this is in the book explained by (1) the asymmetry the added on side strip creates with the original Tallit arm slits. These are visible and measurable and the left side is 2cm farther from the selvage than the right side. This is a verifiable fact. Details of this are explained in my book which you will be able to grasp once you read it. (2) the threads are different in Yarns in Tex measurements. The side strip cloth is denser and heavier than the main cloth, so they actually do not match in the same thickness, and intensity (3) and the main cloth has cotton fibers inside the threads whereas the side strip does not. Please see below for a fuller explanation.\nSTEPHEN:\n>The Greek lexicons you have do not put sindon = tallit for some reason.\nThanks for conceding it. The “reason” is that sindon means “linen” not “tallit”!\n>All you have done is shown that certain Greek lexicons do not have it, which is no proof at all.\nThey are among the leading NT Greek lexicons, including BAGD which you personally recommended to me. That you have not yet cited a NT Greek lexicon which defines sindon as “tallit” (even as a secondary meaning) indicates, given your claim of extensive research over many years into the meaning of these words, that there is no NT Greek lexicon that defines sindon as “tallit.”\nLUPIA:\nThat is incorrect. I have now pointed to the sources that do show this to be the correct meaning of sindon  after the reviewer cited them in her review; Lightfoot and Jastraw and you still have not yet checked those sources  but continue to deny the truth and insist it is wrong. Why? Please  do yourself a favor and check out Lightfoot and Jastraw. This is now the third time. First when you read the review and failed to check and now twice I am asking you to do the same.\nSTEPHEN :\n>… you refer NOW to the dimensions of the Shroud from the Restoration in 2002 something you NEVER knew until I pointed it out to you. The same is true about the theory proposed by Dr. Flury-Lemberg, which you NEVER knew until I pointed it out to you.\nAnd I thanked you at the time for your correcting me on these points. But it is not true that I “NEVER” knew them. As I stated later in a previous comment:\nBut Googling on “Turn [sic] Shroud: Past, Present and Future” and “seam” I found a report (which I already had on my computer but had forgotten) on this in the BSTS Newsletter of June 2000 …\nThat is, I actually had previously read that dimensions and side-strip information in the BSTS Newsletter, No. 51, June 2000 and had saved it to my computer but had temporarily forgotten it.\nAnyway, this is another of your ad hominem fallacies of irrelevance. Although I had read this information previously and saved it to my computer, but had temporarily forgotten it, it is irrelevant to the truth of this matter, whether I personally did or did not know about it before you pointed out to me.\nLUPIA:\nNot really. Anyone claiming to be a Shroud expert would not have made that mistake regardless. Do not take it personally. It is not an ad hominem, just an observation.\nSTEPHEN:\n>Raes … is the expert who did find cotton inside the threads at the time of spinning NOT weaving.\nAgreed. But it was only minute traces of cotton that he assumed was due to the Shroud being woven on the same loom (quotes can be supplied), not to the Shroud being intended to be a mixture of linen and cotton. And further research has suggested that the cotton in Raes’ sample, which was from the same contaminated corner of the Shroud as the radiocarbon dating sample was taken, was part of a rewoven patch, and there is no cotton in the Shroud itself. \nLUPIA:\nStephen you have it all wrong about the two published reports by Raes. This error is widely published in Shroud literature as cotton got on the threads from the loom. This is completely false. That was never published by Raes but it did manage to widely circulate in Shroud literature as misinformation. According to Raes two reports which I have read he definitely says the cotton got into the linen yarn as the thread was spun. The cotton is inside the threads of the main cloth of the Shroud but not in the side strip. Anything else you have read is misinformation. Also, independent researchers have also confirmed that the Raes samples of the main cloth do contain cotton fibers inside the threads. Please read the two reports published by Gilbert Raes. Additionally, some of the independent researchers who found the cotton no longer hold the invisible weave theory as a strong argument but see that it is contradicted by other scientific evidence. I thought the patch theory was viable at one time but after lengthy discussions with Dr. Flury-Lemberg I abandoned the patch theory completely.\nSTEPHEN:\n>All biblical evidence supports my thesis since my thesis is based primarily on the biblical evidence. But you would need to read my book to find that out.\nGail has read your book and I was responding to her review. If she got it wrong, then take it up with her. \nLUPIA\nI do not follow what you are saying. I did not find the review claiming I did not base the thesis of my forensic study on biblical evidence. True, it is not solely based on biblical evidence  since science that supports the identification is not biblical.\nSTEPHEN:\n>It is rather curious that a so-called proponent of authentication of the Shroud of Turin is so driven to disprove a viable thesis that proves the Shroud is authentic.\nI am “driven” to follow the truth wherever it leads. It is of the utmost importance that proponents of the Shroud’s authenticity, test all theories about the Shroud, whether from anti- or pro-authenticity theorists.\nThe Shroud pro-authenticity cause would not be helped but harmed by uncritical acceptance of a false theory about the Shroud, on the basis of that if it were true, the Shroud would have to be authentic. Apart from the ethical problem of knowingly holding a false theory because it is most convenient or effective, anti-authenticity critics would eventually discover the falsehood and the Shroud itself would be discredited, especially if it were discovered that Shroud pro-authenticity theorists knew about the false theory but kept quiet about it. \nLUPIA:\nI do not follow your conspiracy theory. It is an outrageous allegation that Shroud researchers would push a false theory in the news to win favorable publicity that the Shroud is authentic. This sounds more like the skeptics point of view. I know of no Shroud researcher in any country that would do as you suggested. That you think they would tells me and readers here much.\nSTEPHEN\n>One is wondering whose side you are really on.\nYou have no need to wonder. I am on the side of Him who said, “I AM the Truth” (Jn 14:6). And one of my guiding Bible texts is, “Test everything. Hold on to the good.” (1Th 5:21). You are evidently confusing your theory with the truth, such that anyone who disagrees with your theory is not on the side of the truth.\nLUPIA:\nI wrote on March 4th\n“Everyone is free, then, to contradict me. I would only ask my readers for that initial goodwill without which there can be no understanding.” — Benedict XVI, Jesus of Nazareth, xxiv\n\n","date":"March 21, 2010 at 10:48 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-1172","author":"John","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"I claim the Turin Shroud was the unique Jewish-Roman tallit of the priest and secret disciple John Mark, before he had to leave it in the hands of the temple officers in Gethsemane, it was used by these officers to cover up and beat Jesus in prison, and before Joseph of Arimathea bought it from these temple officers to use it as Jesus’ priestly burial garment and thus bury Jesus “as is the burial custom of the Jews” (John 19,40), namely in a garment. On the early morning of Easter John Mark “saw and believed” (John 20,8); he saw his tallit in the empty grave, “rolled up in one place” (John 20,7), just as a priest’s temple garment was always rolled up and put in one particular place in the temple, namely at the head of the sleeping priest, and believed that only a risen Jesus could have done this for him. He took it form the grave – Jerome says that Jesus gave it to the servant of the priest (De Viris Illustribus II)-, removed the corners and its fringes, to prevent that anyone would recognize the rolled up cloth as his unique tallit, hid it and remained a priest and secret disciple, just as Jesus had commanded him – “remain until I come” (John 21,22) -, and later took it to Ephesus with Mary.\n     If you wish, read the arguments and details from Bible and Talmud and Shroud research in my free biblical article “The seam and missing corners of the Turin Shroud as characteristics of John Mark’s temple garment” on my site http://www.JesusKing.info, or else my more elaborate free article, which contains the same thesis, “John Mark – Author of the Gospel of John with Jesus’ mother”. The articles are also available and free in Dutch.\n     I am sorry I didn’t know about Mr. John N. Lupia’s book, or about this site, until today.\nGod bless.\n\n","date":"January 24, 2011 at 5:14 pm","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-2276","author":"A.A.M. van der Hoeven","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Dribble, ramblings on by Seekers of Smooth Things, nothing regarding Qumran and related period textiles in this very long long self indulgence, using Talmudic sources for cubic is in error given the Rabbi’s don’t know what actual cubic is hence the moratorium on rebuilding the temple …..  \nNothing about related ancient mosaics, or related sects of the period as to what is known of textiles.   Theologians should stick with dogma, stay out of archaeological research…  \nI’m going to buy this one and decide for myself… \nHey Stephen write your own book… .\n\n","date":"September 3, 2011 at 2:23 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-3776","author":"Bald Eagle","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"Hello Bald Eagle,\nYou might also like to read the excerpt of my above mentioned articles on John Mark’s garment and the Shroud. It’s only 7,5 pages long, and is free on http://www.jesusking.info/John%20Mark%27s%20garment.pdf .\nAnd the Jewish Encyclopedia has an image of a tallit as long as the Shroud, with long border(s) and corner fringes, worn thrown loosely around the shoulders: http://www.jewishencyclopedia.com/img_template.jsp?volume11/V11p677002.jpg&volume=volume11&imgid=1901\nEnjoy the reading,\nAdrie\n\n","date":"September 3, 2011 at 8:03 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-3780","author":"A.A.M. van der Hoeven","site":"shroudstory"},{"title":"New Shroud of Turin book by John N. Lupia","post":"The fifteenth-century image of a tallit as long as the Shroud with long border(s) and corner fringes, worn thrown loosely around the shoulders, has been moved to http://www.jewishencyclopedia.com/articles/14210-tallit\n\n","date":"December 30, 2011 at 6:22 am","url":"https://shroudstory.com/2010/03/02/new-shroud-of-turin-book-by-john-n-lupia/","cat":"news_&_views","id":"comment-6286","author":"A.A.M. van der Hoeven","site":"shroudstory"}]
