[{"title":"New Fictional Book: Blood Doctrine","post":"Didn’t Jerome Corsi try a novel on this level?  Isn’t there agreement that the Blood from the Shroud (and perhaps the Blood from the Sudarium of Oviedo) is too degraded to produce the chromosomal-DNA codes for replication into an evacuated egg cell?  The microscopic bone fragments from the Jesus Family Tomb would not provide a better cloning specimen… it too has DNA structure which is too far degraded to be used for cloning.  So… what would have been interesting is if Piatt wrote about the DNA connection between the Shroud, Sudarium, and Jesus Family Tomb and expressed a more modern scientific view of Resurrection- likelihood.\n\n","date":"May 3, 2014 at 11:01 am","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","id":"comment-109837","author":"Annette Cloutier","site":"shroudstory"},{"title":"New Fictional Book: Blood Doctrine","post":"Hi Annette\nWhatever Piatt may write in the future, one wonders what he can derive from the “Jesus family tomb”. At least 35 people are believed to have been buried in this “Jesus family”/Talpiot tomb, all the DNA studies have been rejected. Generally you cannot derive useful material when the theory is agenda-driven (and how!) and there is no real science that can offer support. See:\nhttps://www.academia.edu/6932873/Jesus_was_not_buried_in_Talpiot_Parts_I_II_and_III\n\n","date":"May 3, 2014 at 12:28 pm","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","id":"comment-109892","author":"Louis","site":"shroudstory"},{"title":"New Fictional Book: Blood Doctrine","post":"Thanks Louis, brilliant research.  Thank you.  I only wished that Amos Kloner hadn’t given the construction crew the okay to plow that tomb asunder the next day after his three day investigation.  There should have been an international investigation of biblical scholars and archaeologists allowed to study it before completely demolishing such a tomb with the name Jesus son of Joseph and two Mary ossuaries (Maria and Mariamne e mara).\n\n","date":"May 3, 2014 at 12:51 pm","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","id":"comment-109907","author":"Annette Cloutier","site":"shroudstory"},{"title":"New Fictional Book: Blood Doctrine","post":"The linen god, released July 2013, check it out!    \nhttp://www.amazon.com/The-Linen-God-James-OShea/dp/1938679067\nThe Shroud of Turin is the most studied and controversial religious relic in human history. The ancient linen cloth bears the image of a man, alleged to be that of Jesus of Nazareth. What if it were real? What if it contained a secret powerful enough to alter the course of human history? And what if it fell into the wrong hands? Manny Lusum is convinced the Shroud is the genuine article and obsessed with proving it scientifically. Grace Barden is not only Manny’s best friend, but she’s also secretly in love with the physics student and soon-to-be Catholic priest. Across the globe, three grisly murders and the theft of a secret manuscript thrust Grace and Manny into a generations-old conspiracy of biblical proportions. From New York to Rome to the inner sanctum of the Vatican, they struggle to untangle a bizarre mystery surrounding the controversial artifact. In a dramatic confrontation between faith and the ultimate evil on the world stage, Grace and Manny are pushed to the edge of an abyss, balanced between heaven and hell.\n\n","date":"May 3, 2014 at 3:02 pm","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","id":"comment-110004","author":"Lynett","site":"shroudstory"},{"title":"New Fictional Book: Blood Doctrine","post":"Thanks for the remarks, Annette, coming from you, who was lucky to study under Father George MacRae.\nThere are several reasons why the tomb was handled that way. First, people don’t seem to bother that much about tombs, children were seen playing “football” with skulls from the Talpiot tomb. Amos Kloner was working under pressure, he had to abandon the excavation of the next tomb as the ultra-orthodox “haredim” began to throw stones at him. Second, the names are common, which is what Professor Charlesworth realised only later. The pool of names was small during the period, as anyone who reads the NT will deduce. \nThe second wife of Herod the Great was named Mariamne, and God knows how many ossuaries with this name are lying in unexcavated caves. “Mara” is probably a second woman, perhaps a sister of Mariamene, and must have died later because two scribal hands can be seen in the inscription. The Patio tomb also has an ossuary with the name “Mara”. Was she also a “lordess”?! “Mara” can also be masculine and the Syrian Orthodox Church, who originally seemed to have had many members of the Judaeo-Christian community — one remnant is the people called “Nasranis” in the south of India — only began calling woman saints “Martha”, not “Mara”, in the fourth century. Their bishops and patriarchs are addressed as “Mar” and “Mor”, and there is no feminine form, they have no women priests.\n\n","date":"May 3, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","id":"comment-110006","author":"Louis","site":"shroudstory"},{"title":"New Fictional Book: Blood Doctrine","post":"Hi Louis,\nSorry I’m so tardy with my response to your always thorough and in depth replies. I was with relatives from abroad most of this past Saturday and Sunday.\nI’m wishing that perhaps I may have the opportunity of meeting you in person one day and we can discuss the Jesus Family Tomb with the Shroud Connection and the origin of the Gospel of Mark (first Gospel).   Perhaps, too, add a new insight to NT studies that would do the Harvard Divinity Charles Chauncey Stillman Professor of Roman Catholic Studies and first Catholic Dean of HDS, The Reverend Professor George Windsor MacRae, S.J. proud.  Are you perhaps a Jesuit yourself?  Will you be attending the St. Louis Shroud Convention in October?  Louis should be in St. Louis at that most appropriate time don’t you think?  Perhaps we could meet for a more thorough discussion then and there?\n\n","date":"May 4, 2014 at 11:15 pm","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","id":"comment-111343","author":"clublu22014","site":"shroudstory"},{"title":"New Fictional Book: Blood Doctrine","post":"Hi clublu2201(the rest is missing)\nThis is the second invitation to go to Saint Louis, but unfortunately I can’t go. There is much to write and a lot of other work to do and I am not in the US. No I’m not a Jesuit, I did study under Jesuits of various nationalities, particularly Germans, Spaniards, Basques, Indians, in school and college. They can train you and sharpen your mind, but I think the main part is what you see and go through in life, and that is what makes one stick to the essential and leave the rest aside. You can also contact me by e-mail.\nBest.\n\n","date":"May 4, 2014 at 11:32 pm","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","id":"comment-111358","author":"Louis","site":"shroudstory"},{"title":"New Fictional Book: Blood Doctrine","post":"So Louis, where are you now?  How can I email you?  I’m not too sure about blogging on Dan’s blog about my gnawing insights over many years of study into the origins of the canonical Gospels, (Mark in particular), even though these insights emanate from the Shroud itself.  But suffice it to say, I am very grateful for your own insights even though they appear to be in opposition to my own.  And, I might add, I am sure you have many  in your camp.  I’d be lucky to find one scholar in mine.\n\n","date":"May 4, 2014 at 11:53 pm","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","id":"comment-111375","author":"clublu22014","site":"shroudstory"},{"title":"New Fictional Book: Blood Doctrine","post":"Clublu2201, you will find my e-mail on the HSG website, also some papers. I think that the Jesus movement was fed by oral tradition, one that preceded the written word, preaching and action were more important for it to gain impetus.\n\n","date":"May 5, 2014 at 10:01 am","url":"https://shroudstory.com/2014/05/03/new-fictional-book-blood-doctrine/","cat":"books","id":"comment-111793","author":"Louis","site":"shroudstory"}]
