[{"title":"Tinfoil Hats All Around, Quickly","post":"You know, I just don’t know.  I have ordered Silvia’s book because I am interested in the subject.  Last September I had the privilege of sitting next to a thirteen year old boy named Norpa Rinpoche at the Buddhist Drikung Monastery about 50 miles from Lhasa. He is said to be the reincarnate of the monastery’s abbott who passed away 30 years ago.  Being the ignorant, uninformed Westerner that I am I asked his superior, “how do you know?”  Reincarnation is such an accepted belief among Easterners that the question is just not asked.  It is not a belief; it is a way of life.\nAt age 3 Norpa Rinpoche  identified  the home in which the deceased abbott was born.  At age 7 he picked out the abbott’s personal effects from an assortment of the personal effects of others, all mixed together randomly.  I was told that a review of the deceased’s writings also pointed to Norpa Rinpoche as his reincarnate.  The Tibetan Buddhists are closely monitored by the Chinese who, among other controls over Tibetan religious expression, require that all reincarnates be approved as such by the government.  After documenting the case the Chinese approved Norpa Rinpoche as a reincarnate.\nFor me personally, while I am not quiet sure if reincarnation is real of not, I can’t afford to be wrong.  If I do return I want to bring as much of what I have learned in this life back with me and am living accordingly, making sure that I have sufficient mind control to deal with the barrage of thoughts that will hit me when that last breath is taken.  My Christian belief that you get one and only one shot at life gave rise to a “bucket list” and the need to cram as much worldly experience as I can into my one and only lifetime.  Needless to say, the first think to hit the trash can in my preparation for death(I am 72 years young) was my bucket list, replaced by meditation exercises.\n I am afraid the Western travel and entertainment industry would be devastated if everyone adopted reincarnation.\n\n","date":"February 16, 2013 at 10:31 am","url":"https://shroudstory.com/2013/02/16/tinfoil-hats-all-around-quickly/","cat":"books","id":"comment-24441","author":"Tom Devins","site":"shroudstory"},{"title":"Tinfoil Hats All Around, Quickly","post":"A good source for deeper studies are the materials published by the late Professor C.T.K. Chari, who taught at Madras Christian College, India, and investigated cases in Burma and Sri Lanka (see http://www.ctkchari.org). \nWhile doing a course in Parapsychology my professor called for volunteers willing to be hypnotized for regression and a fifteen-year-old girl could see her grandfather reading a newspaper and the background was green. She tried her best to read what he had been reading but did not succeed as she could not support the strain. Her parents happened to be present on that day, the last day of the course, to see their daughter receive her certificate and the father confirmed that he came from a family of landowners, therefore the green background. This experience is more in keeping with what is learnt in modern psychology.   \nIn another course the importance of scientific control was stressed and the professor was known to have unmasked people claiming to perform miracles or other feats. Uri Geller could not bend any spoon in his presence and there were around ten journalists, including one from a TV channel, around. It was reported that Geller took the first flight back to Tel Aviv that very day. The professor had also challenged a famous man claiming to perform miracles to do it in his presence, under scientific control. All that had to be done was to fill a cavity, but there could be nothing more than uttering a word or making a gesture. The challenge was not accepted.\nBuddhist belief in reincarnation actually comes from Hinduism, which is much more older, and involves metempsychosis. For further reading see the works of the Indian Anglican wandering monk Sadhu Sundar Singh where he dwells on Tibet and the book on World Philosophies by Professor David E. Cooper.\n\n","date":"February 17, 2013 at 10:16 am","url":"https://shroudstory.com/2013/02/16/tinfoil-hats-all-around-quickly/","cat":"books","id":"comment-24523","author":"Louis","site":"shroudstory"}]
