[{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"Dear Charles,\nit is very interesting for me that your wife is working at the Victoria and Albert Museum, because:\n“A strange fact is reported by J.M. McDonell in Shroud News (No. 84, 1994, page\n9). I quote: “Meanwhile Dr. Tite acquired from the Victoria and Albert Museum a\nstrip of cloth of 10 x 70 mm from a 14th century cloth, which he had cut in three\nequal pieces…” Such a sample is not noted in Nature”\nSource: http://www.shroud.com/pdfs/vanhels6.pdf \nSo perhaps your wife could look around in the museum whether there is such a cloth from the 14th century with heribone weave in the museum, and if in the end such a strip is missing interesting questions could be asked to Prof. Tite…\n\n","date":"November 28, 2013 at 10:59 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53194","author":"Helmut Felzmann","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"Helmut. It is some years since my wife worked at the V and A so she  cannot comment on any samples given by the V and A to Dr. Tite – she worked on the twentieth century collections.\n It is most unlikely that the V and A would give away part of its collections- why would it? Is there a hint here that Dr. Tite actually got hold of a fourteenth century cloth from a respectable museum, cut it into three and distributed it to the three radiocarbon labs and made each of them substitute it for the samples taken from the Shroud.  – I think you should ask Dan Brown, not my wife, about this.\n\n","date":"November 28, 2013 at 11:45 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53219","author":"Charles Freeman","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"Charles, that’s a pity.\nWell – exchange of the samples: there is much more evidence for it than you might think. But this would be to much for discussing it in this thread. If there is a real interest for this subject, a new thread could be opened.\n\n","date":"November 29, 2013 at 5:53 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53810","author":"Helmut Felzmann","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"Helmut – that is up to you if you want to start a new thread but do see whether you can sell the idea to Dan Brown first- he might be able to pay you a good price.\nSorry,  I can’t see who would have gained by this bizarre idea. There was much more in it for the radiocarbon labs if they had been able, against the expectations of people who deal in medieval relics, to come up with a first century date. Now that really would have made their reputation!\n\n","date":"November 29, 2013 at 6:43 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53838","author":"Charles Freeman","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"I am unable to comment on whether Mrs Charles Freeman can speak as authoritatively on ancient textiles as I understand that Mme Methchild Flury-Lemburg is able to. Much of Wilson’s comments on what Mme FL has to say on aspects of the TS are given in quotation marks, and therefore would seem to be direct quotes. True, he does not cite a specific source for her remarks, it is even possible that they may have resulted from some personal discussion, as they have both been associated together at various times at Turin. \nHis extensive bibliography includes three published items by Mme Flury-Lemburg.\n1) “The Linen Cloth of the Turin Shroud: Some Observations of its Technical Aspects” in ‘Sindon’, new series, no. 16, December 2001, pp.55-76;\n2) ‘Sindone’ 2002, “L’Intervento Conservativo, Preservation, Konsieverung,” Turin, Editrice ODPE, 2003;\n3) ‘The Invisible Mending of the Shroud in Theory and Reality’, in ‘Shroud Newsletter’, 65, British Society for the Turin Shroud, June 2007, pp.10-27. \nWhether there is anything in any of these references concerning the stitching of the selvedge piece to the main cloth, I am unable to say. As stated, it may well have been a direct quote during an oral conversation, which Wilson has reported. He obviously thought it sufficiently significant to comment extensively on it, and her alleged comments clearly made an impression on Wilson.\n\n","date":"November 28, 2013 at 4:25 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53369","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"His extensive bibliography includes three published items by Mme Flury-Lemburg.\n1) “The Linen Cloth of the Turin Shroud: Some Observations of its Technical Aspects” in ‘Sindon’, new series, no. 16, December 2001, pp.55-76;\n2) ‘Sindone’ 2002, “L’Intervento Conservativo, Preservation, Konsieverung,” Turin, Editrice ODPE, 2003;\n3) ‘The Invisible Mending of the Shroud in Theory and Reality’, in ‘Shroud Newsletter’, 65, British Society for the Turin Shroud, June 2007, pp.10-27.\nThe third one is irrelevant to the question of Masada stitching.\nWhether there is anything in any of these references concerning the stitching of the selvedge piece to the main cloth, I am unable to say. \nI also, as I don’t have any of those sources. However, based on this\nhttp://www.pbs.org/wnet/secrets/previous_seasons/case_shroudchrist/interview.html\nand quotation from this:\nhttp://www.shroud.com/pdfs/chronology.pdf\n“This further implies the two sections of sewing threads (C-14 region versus main Shroud) were applied at different times and by different artisans with the main Shroud stitching possibly from the same time period as a cloth from Masada in Israel, dated to BC 40 to AD 73 [M. Flury-Lemberg, Mechthild, Sindon N.S. Quad. 16 (Dec 2001., pg. 60)].”\nwe can say that the argument from stitchings is MFL observation, and not Wilson’s extrapolation, as Charles is trying to suggest. However, I would be careful about that, since we have no guarantee that such stitching is unparalleled in history.\n\n","date":"November 28, 2013 at 5:15 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53397","author":"O.K.","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"OK/Dave B.  It is clear from Wilson that the actual stitching that he is referring to is Fig 23 in the Masada report even though he provides no reference that pinpoints this. I assume that he is correct in saying that this is the one that Flury-Lemberg pinpointed but he does not provide a reference to any conversation of text so we cannot follow it up.\nWhat I cannot find any support for is Wilson’s assertion that ‘the excavators adjudged this to be a very unusual seam’. I have read through the section in which they discuss the stitching and fig.23 is presented as one of the six examples of stitching they choose to highlight  with an illustration as typical but nowhere do they say that it ‘very unusual’ .\nToday that stitch is a standard one,immediately recognised by my wife from the Masada figure as the same  one used when two cloths are sewn together today. Common sense  (not always the best guide) would suggest that this same stitch has persisted throughout history until today as it serves the simple purpose for which it was intended and there is nothing fancy or unusual about it. So if the fig.23 counter-hemming stitch is the same stitch used on the Shroud it is simply saying that the Shroud stitchers used a conventional stitch and this does not tell us anything about the date that they did it. There is certainly no evidence that  this kind of stitch disappeared throughout the Middle Ages and then popped up again in exactly the same form as in Masada just in time for my wife and her fellow seamstresses to use it as one of her standard stitches. I suspect it has simply gone being used throughout history as the easiest way to achieve what needs to be achieved when two cloths are being joined.\nMy own feeling is that this stitch evidence gets us absolutely nowhere and like the cubits is just one of those bits of deadwood that need to be discarded as research on the Shroud moves on.\n\n","date":"November 28, 2013 at 5:47 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53414","author":"Charles Freeman","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"Here is a reference for Mechthild Flury-Lemberg: “The linen cloth of the Turin Shroud: Some observations on its technical aspects”, “Sindon”, n. 16, December 2001, pp. 55-76. I copy from p. 59-60:\n“The seam that connects the 8 cm wide strip to the larger segment is not a simple one. The type of seam construction chosen clearly displays the intention to make the seam disappear on the face of the cloth as mucu as possible. This is another reason to believe that the Shroud was planned and produced by professionals. The sewing has been done from the reverse of the fabric and the stitches have been executed with great care and are barely noticeable on the face of the Shroud (fig. 3a). The seam appears flat on the face (fig. 3b) and raised like a roll on the reverse of the fabric (fig. 3c). Examples of this same kind of seam are again to be found among the textile fragments of Massada [5] (fig. 3a), already mentioned above. To conclude this chapter it can be said that the linen cloth of the Shroud of Turin does not display any weaving or sewing techniques which speak aginst its origin as a high quality product of the textile workers of the first century A.D.”\nSo far Flury-Lemberg. Her figures 3abc are photos of details of the Shroud. Her second mention of fig. 3a is to be intended as another figure on the same page with the scheme or drawing of the stitch from the Masada IV volume, fig. 23 p. 171.\nThis article is the translation of the original German text of Flury-Lemberg that had appeared in a previous volume of the same journal: Sindon n. 13, June 2000. That volume contains the proceedings of the March 2000 Turin Symposium. I can also provide the German text but it seems that this English translation is correct.\n\n","date":"November 28, 2013 at 9:22 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53538","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"Selvedges, eh?\nTake a piece of woven cloth. The two ends have been cut off a larger roll, and if not finished off in some way, the weft threads will slide off the ends of the warp threads and the edges will become tatty. This finishing off, I will call a HEM. The two sides of the cloth are held together by the weft threads themselves, and do not need any finishing off to keep the cloth intact. These two sides are the SELVEDGES. They do not require stitching at all.\nThe shroud of Turin has its famous sidestrip, which may or may not be separate from the main cloth. It appears that at the Raes sample end, it was separate, as Raes took his sample to pieces, but such is the continuity of the weft threads across the supposed seam that there is some doubt as to whether the stitching along it actually joins two pieces of cloth together or not. I will refer to this as a TUCK. The idea that a much wider piece of cloth had a strip taken out of it, and the two sides sewn back together has little to recommend it, in my view.\nA quick look at the Durante photo on shroudscope shows that the shroud is actually hemmed (the side folded over and sewn down) all around the perimeter, including the exposed edges of the cut away corners. How old this continuous hem is, and what stitches were used in its creation, I’ve no idea. However as a consequence no selvedges are now visible at all.\nSo what and where is the mysterious stitching that may or may not resemble something from Masada? Presumably we are talking about the stitching of the TUCK, which almost certainly has nothing to do with SELVEDGES. So what was the stitch across the tuck? Alan Whanger describes it as a “wide relaxed running stitch, as S-shaped stitch.” His description does not sound terribly complicated. The only quote I can find from Flury-Lemberg herself is at http://www.pbs.org/wnet/secrets/previous_seasons/case_shroudchrist/interview.html, and says, “The linen cloth of the Shroud of Turin does not display any weaving or sewing techniques which would speak against its origin as a high quality product of the textile workers of the first century.” How unusual is that?\n\n","date":"November 28, 2013 at 6:02 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53420","author":"Hugh Farey","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"I am most grateful to O.K. and particularly to Gian Marco Rinaldi for identifying the reference by Mme Flury-Lemburg which would seem to corroborate Ian Wilson’s understanding of what she has to say on the matter. \nIt would seem that Mrs Charles Freeman and her fellow seamstresses have not quite grasped the complexity of the stitching as perceived by Mme Flury-Lemburg. \nI would comment further however that I do not share Mme Flury-Lemburg’s views on the question of invisible mending as properly identified by Ray Rogers, Joe Marino and Susan Benford, and it is also evident that several poor decisions were made in respect of the 2002 “restoration” under her supervision. However I am prepared to respect her informed opinion on the stitching of the side-strip. \nCharles Freeman is at liberty to discard as “deadwood” whatever does not suit his particular bias in the matter, whether it relates to Masada-like stitching or Assyrian cubits.  Hugh however, I feel lost himself somewhere between his hem and his tuck.\n\n","date":"November 28, 2013 at 10:25 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53568","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"Daveb, this sewing, or some variants of it, is quite simple and it is the obvious means of joining two pieces of cloth so as to render the seaming less visible on the front side. All women who have some practice of stitching know it. There is no reason to think that it was not known in medieval times. Indeed there are examples from medieval times which are analogous but more elaborate.\n\n","date":"November 28, 2013 at 10:46 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53579","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"Daveb. It is not a bias as such -it is just sorting out what is relevant or irrelevant. The Shroud is high quality- certainly not as high as other known examples e.g. medieval table cloths or altar cloths -but woven by professionals so one would EXPECT that the stitching would also be done by professionals. No surprises there. Flury-Lemberg simply confirms, and it is helpful to have her confirmation, that the stitching is in line with the professional quality of the weaving.\nMrs. Charles Freeman can only work from the illustrations given by Wilson and the Masada report- she certainly does not see this stitch as complex so far as a professional seamstress is concerned because it the standard one used in these cases -but it is good to see that it is not a botched job in this case!!. \nAs my wife, who is playing an unexpected starring role here, continues: The sentence ‘The linen cloth of the Shroud of Turin does not display any weaving or sewing techniques which would speak against its origin as a high quality product of the textile workers of the first century’ could be rewritten as ‘The linen cloth of the Shroud of Turin does not display any weaving or sewing techniques which would speak against its origin as a high quality product of the textile workers of the twenty- first century.” \nThe question we need to ask the ‘history of stitching’ experts- and Gian Marco Rinaldi seems to be able to help here- is whether we could replace ‘first century ‘ and ‘twenty-first century’ by textile weavers ‘of the medieval period.’ if we can,then we are simply back to saying that, other than confirming that the stitching was professionally done, it could be of any date from the first century onwards. This is why I  think  the evidence of the stitching can be discarded as irrelevant for dating purposes. If there is no evidence that this form of stitching was ever known in the Middle Ages then we do have something of relevance to work on. So over to anyone who knows about the history of stitching to tell us.\n\n","date":"November 29, 2013 at 5:44 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53806","author":"Charles Freeman","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"P.S. Wilson’s caption for this stitch  that he illustrates as fig 8. on  p. 110 of The Shroud (2010) ‘ reads ‘Very rare type of ‘Invisible Seam.”\nLOL from the resident seamstress of the Freeman household.\n\n","date":"November 29, 2013 at 5:53 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53809","author":"Charles Freeman","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"Well, you might be right, daveb! However, I’m very grateful to Gian Marco’s full reference. Flury-Lemberg is impressed by the fact that the shroud seam was carefully made, but she does not suggest that it was particularly complex, nor that it was particularly unusual, nor that there is anything unusual about finding a similar stitch in the Masada textiles. She quite specifically does not imply that the stitching defines the period of manufacture.\nI’m not sure that I agree with her idea that the seam was designed “to make the seam disappear on the face of the cloth as much as possible.” I invite readers to look at their own shirts and trousers. My shirts have joins which look similar to the seam of the shroud, and the rolled underside is clearly detectable through the outer surface. My trousers, on the other hand, have a more invisible join, as the underside edges are not rolled, but folded flat against the main cloth.\n\n","date":"November 28, 2013 at 11:06 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53591","author":"Hugh Farey","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"For the variety of medieval seams, see for example:\nhttp://heatherrosejones.com/archaeologicalsewing/index.html\nLook also at the wool samples which are more numerous.\nOther examples are here:\nhttp://nvg.org.au/documents/other/stitches.pdf\nThere are examples that are similar but more complex than the sketch in Masada IV, but if medieval people were able to do a complex seam they were also able to do a simple one. I would add that the seam on the Shroud might itself be of a complex variety because the underside edges appear to be somewhat rolled and not flat as they should be in the basic “flat felled” type.\n\n","date":"November 29, 2013 at 8:08 am","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53853","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Unraveling Unusual Stitches in the Turin Shroud","post":"I would concede a point of interpretation from the Methchild Flury-Lemburg quotation at the heading of Ian Wilson’s Chapter 6 ‘The Cloth’s Own Tale’. Effectively that nothing in the weaving or sewing techniques speaks against a high-quality product of textile workers of the first century AD. It might equally be said that it is within the capability of 20th century textile workers, although the process of extracting the linen from the flax is clearly quite different. The important point she makes however is that the cloth cannot be rejected as not being of 1st century provenance simply on the grounds of the weaving or sewing techniques used. \nHowever, elsewhere she rejects it as being of medieval provenance because of the width of the cloth. She refers for example to bed-sheets which commonly had a seam running down their middle, as medieval looms lacked the width of ancient types. \nI think it a serious error of logic in focusing on only one property at a time and then making a judgment simply on that. It may not suit the scientific mind-set, but it is how evidence works in our law-courts. The TOTAL evidence must be weighed to arrive at a successful conclusion. I prefer to think in terms of Venn diagrams. Thus evidence might satisfy Propositions A, B, C and D but not satisfy Propositions E and F. It may be that E and F are so critical as to negate the conclusion, or it may be that they are can be considered as not so relevant. However if all propositions A through to F are in fact satisfied then there is clearly a strong case.\nIn the case of the TS, there are several points of evidence that point to its authenticity. Some of these are very strong, others less so. The question of weaving and sewing tends perhaps to be the type of evidence that allows the admissibility of authenticity without it being necessarily corroborative. The forensic evidence is particularly strong and tends to be coroborative. The question of halophyte pollens demonstrates that the TS was certainly at some time in Palestine, other pollens that it was there during the months of March or April. The arogonite limestone is persuasive but needs further independent confirmation. \nIt is important not to lose sight of the whole picture. Experts may carp and niggle over particular aspects exclusive to their particular specialty. But experts never get to sit on juries, their role is advisory only. The judge’s direction is always couched in terms of what the evidence leads a reasonable person to conclude.\n\n","date":"November 29, 2013 at 4:35 pm","url":"https://shroudstory.com/2013/11/28/unraveling-unusual-stitches-in-the-turin-shroud/","cat":"books","id":"comment-53946","author":"daveb of wellington nz","site":"shroudstory"}]
