[{"title":"Was the Shroud of Turin created by Gnostics?","post":"Generally, the Gnotics tend to DENY the reality of the humanity of Christ.  They tend to DENY the reality of the incarnation and they believed that Jesus didn’t really suffer on the Cross.  Some Gnotic sect were going as far as proclaiming that it wasn’t Jesus who was crucified but Simon of Cyrene !  The Roman would have made a mistake because Simon looked like Christ !  Do you understand now why the official Church of the time looked at them as heretics ???  \nAnd now you want me to believe that people like that who denied the reality of the incarnation of God and who believed that Christ just took a human appearence on earth (a human disguise if you want) are the creators of the Shroud of Turin ???  It’s completely ridiculous !  \nFrankly, do you see someone who deny the reality of the incarnation create something like the Shroud who, in my mind, PROVE the reality of the incarnation of God (and also prove that he really suffered and died on the cross) ?  Again, it’s totally ludicrous !\nThat’s why all the references made in the documentary “The real face of Jesus” about the Gnostic concept of the Universe versus the Shroud of Turin was completely off-track…\nThis present news reported by Dan is another proof that people don’t know what to invent about the Shroud…  And they seemed to often tend to link the Shroud with all the “mysterious” people that were present around christianity over the years, like the Gnostic, the Knight templars, etc, etc.  It’s completely ridiculous and that prove what I was saying yesterday :  The Shroud always tend to be displayed as a “mysterious” object from the Twillight Zone almost.  I’m just sad to see this kind of crap, again and again and again.  But I know why it is that way :  it’s easier to make a buck with crazy things like that !  It got more appeal to the general public and the media.  But in the end, it’s all crap.\nWe’re lucky to have some people like Dan, Barrie Schwortz and some others who get their feet on the ground versus the Shroud and who don’t contribute to the growth of these stupid ideas.  Unfortunatelly, it’s not the case for the medias in general who are always willing to make some space for this kind of crap.\nIn conclusion, I want to say it again :  The Shroud wasn’t “created”.  We get enough scientific proof that it is an authentic burial Shroud of someone who was tortured and died like Jesus-Christ.  This “someone” was a real man like you and I and he suffer and died like you and I.  That’s not what the Gnostics believed…\n\n","date":"December 1, 2011 at 11:49 am","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","id":"comment-5133","author":"Yannick Clément","site":"shroudstory"},{"title":"Was the Shroud of Turin created by Gnostics?","post":"I agree completely. I would add that most probably in the St Pauls letters there were already gnostic groups that posed a major challenge to the belief in an incarnation/death/resurrection of God. However, there was nothing like a gnostic church. It was more like a big number of gnostic groups which not always agreed among them (see Nag Hammadi gospels). So attributing the SHroud to “Gnostics” gives the impression that there was an organized movement with commons rules and rites that held a gnostic view.It is curious that every year before Christmas and/or Easter new “highly challenging theories that could make the basement of Christian faith collapse” are presented in the form of books, TV shows…After all, Jesus after 2000 years still raises interest\n\n","date":"December 1, 2011 at 2:00 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","id":"comment-5138","author":"Gabriel","site":"shroudstory"},{"title":"Was the Shroud of Turin created by Gnostics?","post":"I agree with you Gabriel !  And the most compeling evidence that the Gnotics had nothing to do with the Shroud is that they didn’t really believe in the incarnation of God while the Shroud represent precisely the opposite !!!  It’s ludicrous.  Another perfect example of how Jesus and the Shroud are used to fool people.  A perfect example of what I called “The Da Vinci Code Syndrome” !\n\n","date":"December 1, 2011 at 2:06 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","id":"comment-5139","author":"Yannick Clément","site":"shroudstory"},{"title":"Was the Shroud of Turin created by Gnostics?","post":"In the context of their belief, if the Shroud would be the work of a Gnostic forger, the image of Christ would be that of a LIVING man…  And probably that this image would show him with a big smile and a blink of an eye !\n\n","date":"December 1, 2011 at 3:11 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","id":"comment-5140","author":"Yannick Clément","site":"shroudstory"},{"title":"Was the Shroud of Turin created by Gnostics?","post":"I suggest that you all consider who you are having the conversation about the authenticity of the Holy Shroud with. You are not having it with me because I am not willing to consider the idea that the image was created without the help of two humans at least: the crucifixion victim and the craftsman who created the image. You should know also that you are not having that conversation with an atheist or Christians who don’t believe in life-after-death. \nAs I tried to explain in the last slide, atheists fail at the level of intelligence, not reflective judgment. They don’t understand that humans are embodied spirits because they can’t grasp the difference between these two types of questions: 1) What is the relationship between myself and my body?  2) What is the relationship between the earth and the sun? \nThe first question is a mystery: Just because a human asks a question doesn’t mean there is an answer. The second question, like all scientific questions, will be answered at some point in the future with further observations, hypothesis, and controlled experiments. It is because of the success of science that we know an infinite being exists. Knowing this, we can see in the mysteriousness of the Shroud a reason to believe the infinite being communicated Himself to mankind.\n\n","date":"December 1, 2011 at 3:26 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","id":"comment-5142","author":"David Roemer","site":"shroudstory"},{"title":"Was the Shroud of Turin created by Gnostics?","post":"Quote : “I am not willing to consider the idea that the image was created without the help of two humans at least: the crucifixion victim and the craftsman who created the image.”\nYou’re free to believe that but the perspective that someone had gone as far as scourged and crucified someone in the Roman fashion in order to create a simple relic of Christ is an idea that is so incredible that I would prefer to believe the image was created by Merlin the Wizard ! ;-)  Why a forger would need to give himself so much problems just to create a relic when some blood stains would do the job ? Doesn’t make any sense to me…\nQuote : “It is because of the success of science that we know an infinite being exists.”\nI completely disagree with this idea.  And I must say that it’s not a Christian Catholic idea at all.  And this idea is completely off-track with the message of Jesus…  \nI believe in God without any proof of his existence just because science will never be able to prove his existence.  It’s a question of faith, not science.  It’s mainly a question of confidence.  And I must add this :  I was a believer before knowing anything about the Shroud !  So, my faith is surely not based on the Shroud of Turin…\nThat’s what I think and I wanted to let you know.  You’re free to believe otherwise, of course.\n\n","date":"December 1, 2011 at 6:01 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","id":"comment-5147","author":"Yannick Clément","site":"shroudstory"},{"title":"Was the Shroud of Turin created by Gnostics?","post":"We know God exists because we have free will. Free will makes us unified with respect to ourselves and different from other human being. In other words, humans are finite beings. From the success of science we know that the universe is intelligible. Everything has a reason and an explanation. A finite being needs a cause. If every being in the universe needed a cause the universe would not be intelligible. Hence, there must exist an infinite being. The infinite being is called God in the Western religions.\nI believe in life after death for a large number of reasons, one of which is the mysteriousness of the Shroud of Turin. Another reason is that the followers of Jesus swore up and down that He appeared to them after He died. Another reason is that He saved mankind for meaning. He taught us that our purpose in life is to serve God in this world to be with him in the next.\n\n","date":"December 2, 2011 at 1:12 am","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","id":"comment-5152","author":"David Roemer","site":"shroudstory"},{"title":"Was the Shroud of Turin created by Gnostics?","post":"The thing is :  science will never be able to “prove” life after death or the existence of God or spiritual things like that.  This other reality is outside his field of competence.  Science try to answer the question :  How things work.  Religion try to answer the question :  Why those things worked that way (try to find the purpose).  It’s 2 level completely different.  Science is bound to the material world and will never be able to explain or even examine the other world (the spiritual world).  This other reality will be fully understand by us only when we’ll die.  And I really don’t think we’ll need then a scientist to understand !!! :-)\nThat’s what I think.\n\n","date":"December 2, 2011 at 11:52 am","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","id":"comment-5166","author":"Yannick Clément","site":"shroudstory"},{"title":"Was the Shroud of Turin created by Gnostics?","post":"The human mind is structured like the scientific method. At the bottom is observing, which requires paying attention. At the level of intelligence, humans try to understand why things happen and the relationship between things. Extremely intelligent people invent new insights and theories. At the level of reflective judgment, humans marshal the evidence and decide whether a theory or insight is true. Reflective judgment requires being rational. The highest level is deciding what to do with our bodies. This requires being responsible. Deciding whether or not to believe in life-after-death is a matter of reflective judgment. \nHowever, there are two kinds of knowledge: faith and reason. In reason, you know something is true because you can see the truth of it. In faith, you know something is true because God is telling you. Faith is both a rational judgment and a gift from God.\nSuppose someone says, “God hasn’t given me the gift of faith.” That person is admitting God exists, is acknowledging the large amount of evidence showing there is life-after-death, and is admitting they don’t have a meaningful life. You can’t say such a person has bad judgment. So for this reason, you can’t say that you can prove there is life-after-death. What we should do is give our reasons for believing accompanied with a summons, not a demand, to believe.\n\n","date":"December 2, 2011 at 12:39 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","id":"comment-5167","author":"David Roemer","site":"shroudstory"},{"title":"Was the Shroud of Turin created by Gnostics?","post":"David, that is fine an good as a personal vision of reality. It is nonetheless your opinion. But an Atheist would disagree, particularly one of the so-called new Atheists who reject the very notion of faith as being something that one might call knowledge. \nThe Atheist doesn’t say, “God hasn’t given me the gift of faith.” He says it is all bunk to even think so. So where does that leave you? \nDan Porter\n\n","date":"December 2, 2011 at 1:17 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","id":"comment-5168","author":"episcopalian","site":"shroudstory"},{"title":"Was the Shroud of Turin created by Gnostics?","post":"Atheists and liberal Christians fail at the level of intelligence, not the level of reflective judgment. Ordinarily, intelligence is a measure of how long it takes someone to grasp an insight and the ability to invent new theories. But in the case of God, there is so much anxiety, bias, and inhibition that many people can’t even grasp the concept. Atheists have a blind spot about the mind-body problem. The only solutions they can grasp are materialism (the mind is an illusion), dualism (there are spiritual substances), and idealism (the brain is an illusion.)  Atheists will put on their thinking caps when they are planning a bank robbery, but not when it comes to understanding why God exists.\n\n","date":"December 2, 2011 at 1:42 pm","url":"https://shroudstory.com/2011/12/01/was-the-shroud-of-turin-created-by-gnostics/","cat":"books","id":"comment-5170","author":"David Roemer","site":"shroudstory"}]
