[{"title":"What really happened during ‘Lost 40 Days’?","post":"thought tonights show interesting especially the part you indicate the shroud plays in the resurrection of Jesus at the very moment he goes from ‘death’ to ‘life’.  My problem is the fact that (1) a Christian “walk(s) by faith not by sight” and (2) the scriptures are clear in a number of translation Jesus was resurrected “in the spirit” and not ‘in the flesh’ making the material body unimportant in his resurrection.  This is born out by the fact he would look differently to those people who saw him ie Mary thought he was a gardener the ’emanus’ incident where he was not recognized until he broke ‘bread’ add the fact he ‘vanished’ right then & there…when he ‘appeared’ in the upper room it was through locked doors (no material body could do this) time/space not withstanding!  The body was NOT in the tomb but the linen cloths (scriptures indicates ‘cloths’ pluarl were..yet everytime Jesus appears he is fully clothed!\nYour program slipped over these evidences that Jesus appeared in materialized bodies in order to prove he had been resurrected from the dead.  How else would he prove that having been resurrected ‘ in the spirit’ which cannot be seen by human eyes?\n\n","date":"April 21, 2011 at 2:41 am","url":"https://shroudstory.com/2011/04/20/what-really-happened-during-lost-40-days/","cat":"books","id":"comment-2963","author":"Angela","site":"shroudstory"},{"title":"What really happened during ‘Lost 40 Days’?","post":"This would be pretty much why the blow by:\n“Jesus answered and said to them, “Destroy this temple, and in three days I will raise it up.”  20 The Jews therefore said, “It took forty-six years to build this temple, and will You raise it up in three days?”  21 But He was speaking of the temple of His body,” (John 2:19-21).\n“And He said to them, “Why are you troubled, and why do doubts arise in your hearts?  39 “See My hands and My feet, that it is I Myself; touch Me and see, for a spirit does not have flesh and bones as you see that I have.” (Luke 24:38-39).\n“When therefore it was evening, on that day, the first day of the week, and when the doors were shut where the disciples were, for fear of the Jews, Jesus came and stood in their midst, and said to them, “Peace be with you.”  20 And when He had said this, He showed them both His hands and His side.  The disciples therefore rejoiced when they saw the Lord,” (John 20:19-20).\n\n","date":"April 22, 2011 at 2:59 pm","url":"https://shroudstory.com/2011/04/20/what-really-happened-during-lost-40-days/","cat":"books","id":"comment-3001","author":"Paul","site":"shroudstory"}]
