[{"id":"comment-45706","author":"pakeha","post":"Could you give a source for that interview, please?.","date":"2013-09-28","mins":"5:47 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-46136","author":"pakeha","post":"O.K. : Pakeha: Generally I saw that google translated some previous articles well, but unfortunately not in this case. In fact those articles were written for Poles, and I don’t bother translating them into English too much work. The main point: the Shroud didn’t lay flat, neither it was in strict contact with the body. The situation was something between the two, and Mario Latendresse showed in his paper, that it doesn’t create any major distortions which were argued before, both by sceptics and Shroud proponents. Thanks for the heads up on the Mario Latendresse article. I’ll hunt it out and read it and let you know what I think of it..","date":"2013-10-04","mins":"8:18 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-46137","author":"pakeha","post":"Joe Marino : I’m dealing with a sick dog. Will get back when I’m able. All the best with the dog. These faithful friends deserve all attention and care we can give them..","date":"2013-10-04","mins":"8:20 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45708","author":"pakeha","post":"Thanks for your comments, Dave Mo. It’ll be interesting to see how mr Marino defends those charges!.","date":"2013-09-28","mins":"5:51 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45710","author":"pakeha","post":"I read your reply and was astonished to see you “highly recommend Emmanuela Marinelli’s article “The Setting of the Radiocarbon Dating of the Shroud” at http://www.shroud.com/pdfs/marinelliv.pdf” What is it in Marinelli’s article you find convincing?.","date":"2013-09-28","mins":"5:56 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45799","author":"pakeha","post":"Freemasonry? Do you agree with this?.","date":"2013-09-29","mins":"8:38 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45780","author":"pakeha","post":"Flury Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please? Thanks!.","date":"2013-09-29","mins":"4:58 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45781","author":"pakeha","post":"Joe Marino : With my problems with copying and pasting, I’m trying replying to the email in my in box rather than starting in the comments section. Since I don’t know if doing this will post Pakeha’s comment that I’m replying to, I’m going to reproduce it again here. Pakeha wrote, <> It’s scholarly with numerous footnotes and references, extremely detailed and dispassionate. Marinelli has been a sindonologist for decades and is renowned for her research. I’m astonished that you’re astonished that I recommended it. What is it in Marinelli’s article you question? What I’ve read by Marinelli hasn’t impressed me at all. Still, in the hopes of getting a more detailed reply from you, I’ll detail the flaws in this presentation of hers..","date":"2013-09-29","mins":"5:02 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45786","author":"pakeha","post":"Just for starters, Marinelli says in her introduction “The Shroud is an extraordinary relic because, in addition to its being stained with blood 1.,bears the imprinted image of the corpse that was wrapped in it.” She used the Heller Adler paper as her source material. At the very least, that paper has been disputed repeatedly. So right from the start, from the very first foot note, Marinelli, seems to be on dodgy ground. In the very same sentence, Marinelli states the cloth ” bears the imprinted image of the corpse that was wrapped in it.” If there’s anything thing we can say about the image on the cloth, it wasn’t the product of being wrapped around a head, let alone a corpse. I think we’re all familiar with the Mercator Projection? My point is that in one sentence and with the very first footnote, Marinelli’s 2012 presentation in Valencia shows reason to doubt her seriousness. It’s why I asked why jmarino claims this is valuable reading..","date":"2013-09-29","mins":"5:32 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45787","author":"pakeha","post":"Embarrassingly enough, from page 16 onward, Marinelli actually refers to Kouznetzov’s infamous ‘findings’. And sources the fellow in footnotes! Is Marinelli the last person in the world to learn Kouznetzov was a fraudulent conman and that his findings were a blatant hoax? Again I ask jmarino, why should we take Marinelli’s presentation seriously?.","date":"2013-09-29","mins":"5:42 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45851","author":"pakeha","post":"Sorry, no prize. Marinelli failed to mention the fellow is a recognised con artist. This only encouraged readers to give some sort of credence to a notorious hoax. There was no need to mention the fellow without explaining he’s a scammer, unless Marinelli was taken in by the scam or is supporting it. Do you see any other option, jmarino?.","date":"2013-09-29","mins":"5:23 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45862","author":"pakeha","post":"Jmarino240 : O.K. Says in #54 that Marinelli’s paper is a reprint of her 1990 book. First of all, her book is over 250 pages and covers other aspects of the Shroud besides C 14. Her paper is only 35 pages. Secondly, in her article, she has many footnotes and references to materials published after 1990. I can see your point, jmarino, of course. However, leaving in the Kouznetsov hoax was a serious blunder, as it only served to perpetrate the fellow’s scam..","date":"2013-09-29","mins":"5:49 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45852","author":"pakeha","post":"Hugh Farey : OK’s reference agrees with Pakeha and disagrees with Marinelli. This one (http://www.shroudofjesus.com/page6.html) says pretty well the opposite. There is almost as little consensus among pro authenticitists as there is among the antis regarding the exact mechanism of production. Hugh, are you saying the Mercater Projection doesn’t apply to the TS?.","date":"2013-09-29","mins":"5:26 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45854","author":"pakeha","post":"Joe Marino : In response to pakeha’s #45 posting, Marinelli’s 1st sentence also footnotes 2 other medical doctors. The Heller Adler paper was in a scientific peer review journal. You say it’s been disputed repeatedly but give no names. Skeptics may dispute it repeatedly but that carries no weight. Practically any Shroud paper by proponent or skeptic alike is disputed repeatedly. I’m not familiar with the Mercator Projection. For Marinelli to state that the Shroud “bears the imprinted image of the corpse that was wrapped in it,” which has been a traditional observation by many for numerous years, is hardly a reason, in part or in full, to doubt her seriousness. I believe the scholarly nature of the paper is evident Seriously, jmarino, you didn’t take the trouble to find out what the Mercater Projection is? Here’s a good place to start http://en.wikipedia.org/wiki/Mercator projection Whether it’s traditional or not, Marinelli’s observation a cloth wrapped around a three dimensional object would produce anything like what we observe in the TS is foolish. I invite you, jmarino, to try for yourself just what impression is left on a cloth which is wrapped around a three dimensional object..","date":"2013-09-29","mins":"5:32 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45857","author":"pakeha","post":"Joe Marino : In response to pakeha’s #45 posting, Marinelli’s 1st sentence also footnotes 2 other medical doctors. The Heller Adler paper was in a scientific peer review journal. You say it’s been disputed repeatedly but give no names. Skeptics may dispute it repeatedly but that carries no weight. Practically any Shroud paper by proponent or skeptic alike is disputed repeatedly. I’m not familiar with the Mercator Projection. For Marinelli to state that the Shroud “bears the imprinted image of the corpse that was wrapped in it,” which has been a traditional observation by many for numerous years, is hardly a reason, in part or in full, to doubt her seriousness. I believe the scholarly nature of the paper is evident I don’t think anything approaching a scholarly nature is shown in that paper. Anyone who would perpetrate Kouznetsov’s con game cannot be considered a scholar. Correct me if I’m wrong, but the fellow was exposed for a hoaxer on a number of pro authenticity sites. I’ll get back to you sources which rebutt the Heller Adler paper, jmarino. Sorry not to have included them earlier! In any case, could you explain why Flury Lemburg’s evaluation of the possibility of reweaving is untenable? Thanks..","date":"2013-09-29","mins":"5:38 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45858","author":"pakeha","post":"Chris B : “If there’s anything thing we can say about the image on the cloth, it wasn’t the product of being wrapped around a head, let alone a corpse. I think we’re all familiar with the Mercator Projection?” So what’s your explanation? Orthogonal projection? A 14th century icon. What’s your explanation?.","date":"2013-09-29","mins":"5:40 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45957","author":"pakeha","post":"No it isn’t indeed. It’s simply a description of what the cloth is, based on the evidence we have to date..","date":"2013-09-30","mins":"4:46 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45866","author":"pakeha","post":"O.K. : jmarino240 : pakeha wrote: “Flury Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?” Please see the end portion of my reply to David in #37. Remember there is some conflict of interest (and responsibility!) here. Flury Lemberg has been hired by the Archidiocese of Turin. And they don’t want to admit that the samples they cut from the Shroud and gave to the laboratories were actually flawed. Why ever not? Keep in mind that Flury Lemburg, while rebutting the patching idea, believes the 14th century datingto be flawed..","date":"2013-09-29","mins":"6:04 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45860","author":"pakeha","post":"O.K. : Hugh Farey : OK’s reference agrees with Pakeha and disagrees with Marinelli. This one (http://www.shroudofjesus.com/page6.html) says pretty well the opposite. There is almost as little consensus among pro authenticitists as there is among the antis regarding the exact mechanism of production. Guys and girls, the problem with Marinelli’s paper is that it is actually a reprint of her 1990 book “The Enigma of the Shroud”, written together with Orazio Petrosillo, so some of the Marinelli’s arguments are outdated. The book was a harsh criticism of 1988 C14 test, basing on what was known at that time. Thanks for that information, OK. You have to wonder why a scholar would, in 2012, present a paper which is over 20 years old and without bothering to update it. The Kouznetsov scam really sticks out like a sore thumb, doesn’t it. I daresay that also explains why the results of the Oxford lab’s testing of Jackson’s idea isn’t mentioned, either..","date":"2013-09-29","mins":"5:45 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45956","author":"pakeha","post":"Thank you very much for posting up those links. They were new to me and I was glad to read them..","date":"2013-09-30","mins":"4:43 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45865","author":"pakeha","post":"Jmarino240 : I can’t speak for Marinelli–I’ve posted a response from her in one posting–but I don’t disagree that she should have mentioned Kouznetsov’s credibility issues as part of the background and data. I’m glad you see that, jmarino, because I believe what has to be a priority in any discussion of the TS is an earnest desire to establish the truth. Here are several links on the subject of Kouznetsov’s credibility issues http://greatshroudofturinfaq.com/Science/Dating/Kouznetsov2.html http://www.shroud.com/bsts4312.htm http://www.csicop.org/si/show/case of the holy fraudster/ http://www.thefreelibrary.com/The+amazing+Dr+Kouznetsov. a0169923805 It’s an unsavoury subject, yes, but better to know the truth of the matter..","date":"2013-09-29","mins":"6:02 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45867","author":"pakeha","post":"O.K. : Pakeha: No, the imprint on the Shroud is not Mercator projection. Actually, Mario Latendresse has shown that contrary to previous beliefs (which claimed that the Shroud must have been completely flat), it is possible for the body to leave projection without creating major distortions. They would appear ONLY if the image had been a contact image, of which the Shroud is not the case. However there are some minor distortions, which is totally consistent with Shroud enveloping the real human body, contrary to what Joe Nickell and Stevven Schafersmann claim. I have dealed with one sceptic who claimed the same. See my article: http://ok.apologetyka.info/racjonalista/caun turynski faszerstwo niedokonane cz 1,558.htm It is in polish, but Google can translate it. Thanks for the link. I’ll read it and get back to you..","date":"2013-09-29","mins":"6:06 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45955","author":"pakeha","post":"But we know the samples weren’t bad. Flury Lemburg is most steadfast in explaining why that is so. Remember, Flury Lemburg headed the team of the 2002 restoration. Is there anyone alive who is more familiar the that linen fabric? In any case, because of the observable ‘banding’ of the weave of the cloth, we know there’s no sign of patching or reweaving in the area..","date":"2013-09-30","mins":"4:40 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45958","author":"pakeha","post":"O.K., I’m finding the Google translate very confusing and I’m sure it doesn’t do justice to your work. Is there any chance you could get that properly translated for your blog?.","date":"2013-09-30","mins":"4:48 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45954","author":"pakeha","post":"Joe Marino : In response to pakeha’s #45 posting, Marinelli’s 1st sentence also footnotes 2 other medical doctors. The Heller Adler paper was in a scientific peer review journal. You say it’s been disputed repeatedly but give no names. Skeptics may dispute it repeatedly but that carries no weight. Practically any Shroud paper by proponent or skeptic alike is disputed repeatedly. I’m not familiar with the Mercator Projection. For Marinelli to state that the Shroud “bears the imprinted image of the corpse that was wrapped in it,” which has been a traditional observation by many for numerous years, is hardly a reason, in part or in full, to doubt her seriousness. I believe the scholarly nature of the paper is evident Hi, jmarino. Sorry to have taken so long in providing links to arguments against the Heller/Adler conclusions. They’re written by hugh farey and I found them to be most interesting. Http://forums.randi.org/showthread.php?p=9387545&highlight=Adler+blood#post9387545 http://forums.randi.org/showpost.php?p=9394626&postcount=8900 http://forums.randi.org/showthread.php?p=9386857&highlight=Adler+blood#post9386857 http://forums.randi.org/showpost.php?p=9386813&postcount=8803.","date":"2013-09-30","mins":"4:29 pm","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45971","author":"pakeha","post":"Jmarino240 : pakeha wrote: “Flury Lemburg wasn’t of that opinion re the reweaving question. Could you explain why she’s wrong, please?” Please see the end portion of my reply to David in #37. Hang on. Are you saying Flury Lemburg was incompetant to find cotton fibres in the area? And seriously, do you understand the amount of extraneous fibre need to have skewed the dating. Are you claiming Fleury Lemburg wouldn’t notice there was over 50% cotton in that area? Or is she part of the conspiracy?.","date":"2013-10-01","mins":"2:39 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"},{"id":"comment-45972","author":"pakeha","post":"Hugh Farey : I have also examined these radiographs and do not agree with the Whangers. The two photos directly referred to in the quotation above (Figures 17 and 18 of Radiological Aspects of the Shroud of Turin) actually show at least three layers of cloth, where the Holland backing appears to have been folded back over the foot of the shroud, including all the area from which the Raes sample was taken. Strange that they don’t mention that. No wonder the “herringbone weave pattern is much less obvious than in the nearby body of the Shroud fabric.” That’s very interesting, hugh..","date":"2013-10-01","mins":"2:41 am","url":"https://shroudstory.com/2013/09/23/shreds-of-evidence-a-guest-posting-by-joe-marino/","cat":"books","title":"Shreds of Evidence: A Guest Posting by Joe Marino"}]
