[{"id":"comment-9815","author":"susana","post":"I will continue to assert that Dawkins is merely an adequate academic, not a brilliant one by any stretch of the imagination. He has latched on to this money maker of an idea and has become the champion of a rhetoric that has little value. He is no fool though, and knows which side his bread is buttered on. If he continues to debate truly brilliant minds he will lose the most significant part of his income, and that’s all there is to that. Still, I pray for the guy every day, and so should we all..","date":"2012-03-31","mins":"7:20 am","url":"https://shroudstory.com/2012/03/31/speaking-of-issuing-challenges-to-dawkins/","cat":"event","title":"Speaking of issuing challenges to Dawkins"},{"id":"comment-9838","author":"susana","post":"“When I discovered that Joshua was acting on a divine command, I decided that I could not worship such a God.” As people of faith, we accept that God is infinitely more intelligent, wiser, more just and more trustworthy than any human. Yes, there are times when what He does escapes our logic and we may even shake our fist at him. I have. But only for a moment. Then we remind ourselves that we trust Him with all our heart and soul. We have to believe that His reasoning is far superior to ours and encompasses knowledge that we don’t possess. I have also struggled with that passage, and many others (from my 21st century sensibilities, I can’t even stand the passages about animal sacrifice), but then I remind myself that I firmly believe that God not only has all the attributes that I just listed, but I also believe that He exists in the eternal present and has knowledge of what has happened and what will happen at any point in history. As such, I believe His decisions are always wise and correct, though I may not understand them or agree with them. Another aspect of this we have to remember as people of faith is that we are not to put so much stock in this earthly life. We get all tied up in a knot because people lost their lives and normally we would do anything to preserve life, but according to God’s plan as I understand it, this is not the life we’re supposed to value. Just because many innocents died that day, it doesn’t mean they were obliterated. I trust in a God of infinite justice who will ultimately save all the innocents who have died to this life, throughout history. They will have eternal life. It’s like I said; you can choose to believe or not believe, you can choose to trust or not to trust, but if you do believe, and if you do trust, then believe and trust wholeheartedly. Trust that God knows what He’s doing. Dawkins wouldn’t understand that because he doesn’t believe in God, but those of us who do can’t resort to the same kind of materialistic reasoning that Dawkins uses. If we do that, then really, what’s the difference between us?.","date":"2012-04-01","mins":"3:06 pm","url":"https://shroudstory.com/2012/03/31/speaking-of-issuing-challenges-to-dawkins/","cat":"event","title":"Speaking of issuing challenges to Dawkins"}]
