[{"id":"comment-214024","author":"chrisb","post":"Would God the Father deliberately skew the evidence well away from a 1st century date? By using this method of irradiation, an all knowing God would foresee the problems this would create for those in the future searching for evidence..","date":"2015-10-31","mins":"5:29 pm","url":"https://shroudstory.com/2015/10/30/bob-rucker-a-burst-of-radiation-did-three-things/","cat":"blood_studies","title":"Bob Rucker:  A Burst of Radiation Did Three Things"},{"id":"comment-14550","author":"chrisb","post":"I read a paper on Shroud.com by August D. Accetta, Kenneth Lyons and John Jackson investigating apparent x ray qualities on the Shroud. From the paper “The Shroud image suggests quite strongly the presence of many skeletal details e.g. Carpal and metacarpal bones, some 22 teeth, eye sockets, left femur, left and possibly right thumbs flexed under the palms of the hands, as well as soft tissue and soft tissue injuries; all presumably originating from some form of radiation emitted from the body enshrouded.” Has this line of enquiry been discredited? If indeed these phenomenon can be observed on the Shroud, then seems overwhelmingly in favour of a supernatural burst of energy..","date":"2012-08-06","mins":"4:54 pm","url":"https://shroudstory.com/2012/08/05/giulio-fanti-responds-are-you-listening-yannick-and-colin/","cat":"blood_studies","title":"Giulio Fanti Responds. Are you listening Yannick and Colin?"},{"id":"comment-19544","author":"chrisb","post":"Yannick, there’s already a Catholic Church that has been around for nearly two thousand years. You’ll have to give your cult another name other than “Catholic”..","date":"2012-11-27","mins":"11:53 am","url":"https://shroudstory.com/2012/11/25/must-read-cloning-the-man-on-the-shroud-of-turin/","cat":"blood_studies","title":"MUST READ:  Cloning the man on the Shroud of Turin"},{"id":"comment-25050","author":"chrisb","post":"Don’t know if anyone has considered this scenario, but the blood flows maybe a result of the body reanimating during the resurrection. The body was washed prior to being wrapped in the clean shroud, so there wouldn’t be any blood on the shroud prior to the resurrection event. During the resurrection, the heart begins beating and blood flows from the wounds. There isn’t enough time for the blood to pool because the reanimated body is about to leave the shroud, and it is this “leaving” which causes the body image. Simples..","date":"2013-02-20","mins":"11:46 am","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-25064","author":"chrisb","post":"Trickles along the arms are from the wrist wounds after the heart started beating, as are all the other blood stains. Assuming a “dematerializing” resurrection took place not long after the heart began beating then this could explain why there is no pooling. Of course to believe this scenario one has to believe that a resurrection actually took place..","date":"2013-02-20","mins":"2:42 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-25176","author":"chrisb","post":"A possible scenario. His heart would have started beating from the resurrection event, making blood flow for a short time before the body leaving the cloth. The resurrection event could also have sealed the wounds..","date":"2013-02-21","mins":"2:29 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-25178","author":"chrisb","post":"Sorry there’s more. In the above scenario he would have been wrapped in a clean cloth in the tomb – the shroud..","date":"2013-02-21","mins":"2:32 pm","url":"https://shroudstory.com/2013/02/19/on-the-topic-of-bloodstains-picking-up-threads-of-useful-discussion/","cat":"blood_studies","title":"On the Topic of Bloodstains: Picking up Threads of Useful Discussion"},{"id":"comment-137987","author":"chrisb","post":"If the sheet was pulled taut just before being imaged as per Izabel Piczek, assuming the blood is already there, you wouldn’t expect a secondary blood image..","date":"2014-07-14","mins":"4:17 am","url":"https://shroudstory.com/2014/07/13/why-doesnt-the-blood-create-an-image/","cat":"blood_studies","title":"Why Doesn’t the Blood Create an Image?"}]
