[{"id":"comment-79011","author":"chrisb","post":"Or the blood may have come after the image assuming the resurrected body had a beating heart and open wounds for a small period of time..","date":"2014-02-13","mins":"10:23 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79386","author":"chrisb","post":"Louis : Kelly # 40: “I don’t think he’s omitting clinical death or the typical crucifixion, death, resurrection sequence my take on it was that he was saying that when Christ’s dead body came back to life, the heart was restarted as part of the process, hence some bleeding occurred.” This doesn’t sound convincing. How did the bleeding stop? Did Jesus go to a doctor before he allowed doubting Thomas to feel his resurrected body? Just a hypothesis Louis, it doesn’t deny Christ’s death. Developing it a little further, I envisage the body was washed and placed in a clean Shroud. It assumes the resurrection consists firstly of the heart beginning to beat, and open wounds would cause blood to flow out of them onto the Shroud (Jesus would still be lying in situ). Then after a short while, the ‘Light of God’ if you will, caused the resurrection proper, fixing the image, blood and wounds..","date":"2014-02-14","mins":"1:48 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79412","author":"chrisb","post":"It wasn’t clear in my earlier post, but I envisage that the blood would be fixed on the Shroud, and that the risen Lord would no longer be bloodied..","date":"2014-02-14","mins":"3:27 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79416","author":"chrisb","post":"Louis, Dave, thanks for your comments. Like you say, we have no idea really how the resurrection happened. Don’t know were it came from but I thought it was a given that the risen Jesus had a real physical heart.","date":"2014-02-14","mins":"3:37 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-37791","author":"chrisb","post":"Neither are you making any sense Colin. Have you really managed to eliminate all possibilities that blood second means it’s a fake?.","date":"2013-06-22","mins":"4:56 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-50071","author":"chrisb","post":"Excellent point. I’ve often thought that there must have been some attempt at preservation earlier on in the Shroud’s life..","date":"2013-11-05","mins":"2:17 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-44826","author":"chrisb","post":"Wouldn’t the heat from the various fires the Shroud has been exposed to affect the strength of the fibres? If so, the result would be younger than 400 AD..","date":"2013-09-20","mins":"7:24 am","url":"https://shroudstory.com/2013/09/20/paper-chase-giulio-fantis-new-flax-fiber-dating-machine/","cat":"carbon_14_dating","title":"Paper Chase:  Giulio Fanti’s New Flax Fiber Dating Machine"}]
