[{"id":"comment-94242","author":"psuedonym","post":"One more thing Jerry is patently ignorant of: substantiated miracles! Clearly, Mr. Coyne should defer to the initiated what should be deferred to them..","date":"2014-03-28","mins":"11:00 am","url":"https://shroudstory.com/2014/03/28/thanks-for-mentioning-the-shroud-of-turin-again/","cat":"article","title":"Thanks for mentioning the Shroud of Turin again"},{"id":"comment-94696","author":"psuedonym","post":"Yes, but, Frei’s finding were published on his behalf by Professor Heinrich Pfeiffer. The list was corroborated by Ian Wilson and is present in his most recent book which I’ll provide here: “Plant pollens corresponding to the Shroud’s historically definite travels around western Europe and the western Mediterranean 1 Varieties best known under their everyday names Rice (Oryza sativa L.) Anemone (Anemone coronaria L.) Rock rose (Cistus creticus L.) Beech (Fagus silvatica) Rush (Scirpus triquetrus L.) Castor oil plant (Ricinus communis L.) Rye (Secale spec.) Cedar of Lebanon (Cedrus libanotica Lk.) Spina Christi (Palinurus Spina Christi Mill.) Cypress (Cupressus sempervirens L.) Thistle (Carduus personata Jacq.) Hazel (Corylus avellana L.) Yew (Taxus baccata L.) Juniper (Juniperus oxycerdus L.) Laurel (Laurus nobilis L.) Love lies bleeding (Amaranthus lividus L.) Oriental plane tree (Plantanus orientalis L.) Pine (Pinus halepensis L.) Pistacia (Pistacia halepenis L. & Pistacia lentiscus L.) 2 Other varieties Alnus glutinosa Vill. Capparis spec. Carpinus betulus L. Lythrum salicaria L. Phyllirea angustifolia L. Posterium spinosium L. Ridolfia segetum moris Plant pollens indicative of the Shroud at some time in its history having been in Near Eastern environs, particularly Anatolia and Israel 1 Varieties found in Desert and semi desert 4 Varieties found in salty environs, terrain particularly the Dead sea Acacia (Acacia albida Del.) Althea officinalis L. Artemsia herba alba A. Anabasis aphylla L. Atraphaxis spinosa L. Gundelia tourneforti L. Haplophyllum tuberculatum J. Haloxylon persicum Bg. Helianthemum versicarium B. Prosopis farcta Machr. Oligomejus subulata Boiss. Reaumaria hirtella J. & Sp. Peganum harmala L. Suaeda aegyptiaca Zoh. Pteranthus dichotomus Forsk. Tamarix nilotica Bunge Scabiosa prolifera L. 2 Varieties found in steppe type terrain, 5 Varieties particularly typical of the as in eastern Turkey and southern Israel environs of Jerusalem Glaucinum grandiflorum Bassia muricata Asch. Hyoscyamus reticulatus L. Echinops glaberrimus DC Ixiolirion montanum Herb. Fagonia mollis Del. Linum mucronatum Bert. Hyoscyamus aureus L. Roemaria hybrida (L.) DC Onosma syriacum Labil Silene conoida L. Zygophylllum dumosum B.” 3 Varieties particularly typical of Anatolian (Turkish) environs Epimedinum pubigerum DC Prunus spartiodes Spach. Anyways, I’m not inclined to banish Frei’s pollen findings to the realm of “Shroud Apocrypha”..","date":"2014-03-29","mins":"6:50 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94705","author":"psuedonym","post":"The posting got squashed, sorry..","date":"2014-03-29","mins":"7:08 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94736","author":"psuedonym","post":"Max Frei had placed his sample on “sticky tapes” and then placed the individual tapes on glass slides. Then, the man marked the slides with a number and letter group such as 2bd, 4bd, and so on. In a broad look at the items present on the samples there are FLOWER PARTS (my emphasis), bugs, cotton fibers, modern synthetic fibers and old wool fibers. If the same flowers are indeed Matricaria recutita and Anthemis bornmuelleri, then the anomaly is inexplicable.","date":"2014-03-29","mins":"8:25 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94710","author":"psuedonym","post":"(Reposted)”Plant pollens indicative of the Shroud at some time in its history having been in Near Eastern environs, particularly Anatolia and Israel 1 Varieties found in desert and semi desert terrain Acacia (Acacia albida Del.) Artemisia herba alba A. Haplophyllum tuberculatum J. Helianthemum versicarium B. Oligomejus subulata Boiss. Peganum harmala L. Pteranthus dichotomus Forsk. Scabiosa prolifera L. 2 Varieties found in steppe type terrain, as in eastern Turkey and Southern Israel Glaucium grandiflorum Hysocyamus reticulatus Ixiolirion montanum Herb. Linum mucronatum Bert. Roemaria hybrida (L.) DC Silene conoida L. 3 Varieties particularly typical of Anatolian (Turkish) environs Epimedium pubigerum DC Prunus spartiodes Spach 4 Varieties found in salty environs, particularly the Dead Sea Althea officinalis L. Anabasis aphylla L. Gunedelia tournefortii L. Haloxylon persicum Bg. Prosopis farcta Machr. Reaumaria hirtella J. & Sp. Suaeda aegyptiaca Zoh. Tamarix nilotica Bunge 5 Varieties particularly typical of the environs of Jerusalem Bassia muricata Asch. Echinops glaberrimus DC Fagonia mollis Del. Hyoscyamus auren L. Onosma syriacum Labil. Zygophyllum dumosum B.” Anyway, do not dismiss Frei posthaste..","date":"2014-03-29","mins":"7:26 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"},{"id":"comment-94727","author":"psuedonym","post":"Hugh Farey : Thanks, Psuedonym, but a mere list of plants means very little. Let’s look at the top two flowers in your list, Anemone coronaria and Cistus creticus. These are both brightly coloured insect pollinated plants whose pollen is not released into the air, but must be collected, and delivered, by insects. It cannot have drifted onto the Shroud. Their pollen is not identifiable at species level anyway. These are serious anomalies in Max Frei’s findings, and must be explained. Forgive my own lack of palynological sophistication, but Frei’s samples, observed on glass microscope slides, apparently had insects present on them. Would this, perhaps, account for the Anemone coronaria and Cistus cretius?.","date":"2014-03-29","mins":"8:02 pm","url":"https://shroudstory.com/2014/03/27/barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"radio_and_podcasts","title":"Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show"}]
