[{"id":"comment-9739","author":"b_kay","post":"This is for Cody: I had a vision where an angel came (in the form of man) and he said that we needed to go someplace and for me to hold onto his arm. I did, and we slowly started upward. I am afraid of heights, and he must have sensed it because he then said, “Do not be afraid.” Up was high up through the clouds. We arrived at our destination. The colors of the grass were so bright, like emerald green. We then went into a room with a lot of people sitting around a giant table, and we attended a conference, and I was told that I would not remember what we spoke of on this day. That vision happened when I was 28 years old. I am now 70. Since you ‘forgot’ what was in the letter, maybe you were not supposed to remember , but somewhere inside you know what it is about. That is what I feel the message was. I feel I had things I needed to work on and work out in this life. Maybe I wasn’t fulfilling my ‘contract’. I think I did receive guidance. The angel then took me back down, and he told me he would come for me when the time was near for me to cross over. I never saw him again..","date":"2012-03-28","mins":"10:59 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9754","author":"b_kay","post":"I could never forget it, Sue, if I live to be 100. He didn’t have wings like you think angels should have, but instead was a soldier dressed in World War II uniform. He was all beat up and had sort of reddish hair. He also told me that he came to me now so I wouldn’t be afraid to go with him when the time came. That was smart, because I might be afraid to go with someone that looked like him! I have seen angels before, and they all had wings!.","date":"2012-03-29","mins":"12:38 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"}]
