[{"id":"comment-212501","author":"louis","post":"Sampath, you are wrong. The “dominant Christians” in Rome were getting used to life out of the catacombs, they did not know anything about Thomas and India. While writing as a professional journalist with expertise in history and religion, including ancient India, I had occasion to delve into rare photographs and documents, the result being an article that was published in a leading daily and preserved in a university library for reference. I have more, concrete, information and will work on this when I have time as I will soon be in radio silence for some days – working on another project..","date":"2015-10-14","mins":"4:28 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212515","author":"louis","post":"I think Shamir Orit’s paper, presented at the Bari congress should help..","date":"2015-10-14","mins":"5:31 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212484","author":"louis","post":"I did some research and found nothing about linen in ancient Índia. The Saint Thomas Christians in South Índia began with the Jewish Christians called “Nasranis”. Today the world’s youngest cardinal Mar Isaac Cleemis Thottunkal belongs to this community, divided into Catholic (Syro Malabar,Syro Malankara and Latin rites), Mar Thoma, Jacobite, Assyrian, Syrian Orthodox, and Church of South India Churches..","date":"2015-10-14","mins":"10:23 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212516","author":"louis","post":"Sampath: http://www.nasrani.net/2008/09/20/letter of st thomas the apostle to edessa from india/ other than the link on the New Testament, posted below..","date":"2015-10-14","mins":"5:38 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212508","author":"louis","post":"Sampath, That was decided at the Council of Nicaea, presided by the emperor Constantine, in the year 325. I don’t know what he was doing there, since he was not even baptised then.There were about a thousand bishops there, from different regions in the Near East and so on. They were worried about fringe groups like the gnostics. I generally don’t like to stray from the topic, so let us concentrate on the “Nasranis” to see how they got to India — via Iraq and Syria. There is a synagogue style church in Kerala..","date":"2015-10-14","mins":"5:11 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212510","author":"louis","post":"Sampath, regarding the New Testament and the 29 books you asked about, you will find the complete picture here, provided by one of the twentieth century’s greatest bibical scholars: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ.","date":"2015-10-14","mins":"5:17 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212493","author":"louis","post":"Piero DNA studies were being conducted, supposedly linking the Nasranis, first century Jewish Christians, who arrived in Índia probably after Saint Thomas, to the Essenes. They are fully Christian but maintain some Jewish customs, and are mixed with people from other Christian communities in India because Christianity is string in the state of Kerala..","date":"2015-10-14","mins":"1:38 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212520","author":"louis","post":"Unfortunately this blog continues allows amateurs to provoke professionals in the field and people responding to queries addressed to other bloggers, which is bad manners. There are people who think that there was just one “route”, the main route through which everything was chanelled! My paper will be ready the soonest possible..","date":"2015-10-14","mins":"6:51 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212579","author":"louis","post":"David, did you read my comments addressed to Sampath above? I guess you didn’t. It refers to something that was published and says that the next article will go further. It was necessary to say something about the Nasranis, Jewish Christians, who probably followed the apostle Thomas to Índia. If you are smart, you will understand. Religious/biblical history is not my “favourite domain”, it is my área of expertise, having published dozens of articles on the topic. What ravings of an upstart amateur was not dismissed? If you had read the blog carefully if you notice that quite recently my comments were rehashed and used by the man you defend and passed off as his own. He also has the tendency to read comments I havê posted to then base himself on these. The man you defend hás also been picking on me ever since I began posting on this blog. My bet is that he will continue to do só – and he will get what he deserves. I will shortly be in radio silence because of another project, which perhaps you will be able to read when ready..","date":"2015-10-15","mins":"1:52 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212524","author":"louis","post":"Dan, have you read the above provocation? Didn’t I tell you warn you that the man doesn’t learn from mistakes? There is something seriously wrong here. Could you please check into it?.","date":"2015-10-14","mins":"7:25 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212549","author":"louis","post":"I think Hugh is not the right person to preach ethics on this blog since he hás never been bothered with the fact that many prominent Shroud scholars and scientists have, till some time ago, been the target of character assassinaton. On the contrary, he continued to exchange comments with them, encouraging them in the process. To give just one example, he knows that an Oxford scholar, who we needed here, was forced to leave the blog in disgust as a result of the comments of the person who he defends, who hás also been targeting me endlessly, wanting to play the role of prima donna. Further, he takes it for granted that what is online is the only material I havê published. He does not know that it is not even 5% of what I havê published. Further, he is now a self appointed judge,talking “on behalf of the amateurs”. As a journalist, I receive information, also going beyond the realm of Shroud studies, which I cannot reveal. It is a question of ethics, which does not seem to be part of Hugh’its baggage. Not long ago he revealed the contents of an e mail message he received from Archbishop Marcel Sanchez Sorondo, Chancellor of the Pontifical Academy of Sciences, which was not all necessary and should not havê been done for obvious reasons. It is the stuff of people who indulge in vatileaks. My advice to Hugh is to go beyond theatre and try and publish at least one paper in a scientific journal. He must remember that there are people who want him dismissed as editor of the BSTS newsletter. It is always better to think before leaping..","date":"2015-10-15","mins":"6:51 am","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212587","author":"louis","post":"Hugh, I am used to English subtlety and sarcasm and do not like it. You must havê noticed that I speak my mind. I also havê noticed that you sometimes post comments as though it is a source of entertainment. Haven’t you read Ian Wilson, who preceded you as editor of the BSTS newsletter? That no nonsense style is what I like. I will not repeat over and over again what and where I havê published. All I will say now is that some articles published in leading dailies are preserved for reference in an university library and the library of a very important institution. Due to the nature of some of the topics I wrote on privacy is a necessity and I am not obliged to reveal everything people might like to know. I hope you will understand and there will be no need to mince words. As for the highly qualified Oxford scholar, he was driven out of the blog by the man you defend. He left in and disgust and made it clear that he did not want his name mentioned on this blog. I understand his feelings and respect them. You should look for a journal in England yourself if you want to published something..","date":"2015-10-15","mins":"3:10 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212609","author":"louis","post":"David, please mind your own business. Have you read the entire thread? Who started the ugly discussion? I will not swallow any insults, insinuations, comments putting me in a dangerous situation. Dan is the moderator and he allowed the discussion to flow freely. I asked him to intervene, but he didn’t do so. Then Hugh got into the discussion and made things worse..","date":"2015-10-15","mins":"7:19 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212604","author":"louis","post":"Please respect people in your comments, Hugh. Who appointed you as judge on this blog, now cunningly using the tactic of pitting one commenter against another? You may fool others but you don’t fool me. None of the other commenters you mentioned have worked professionally in the fields in which I write. Do you get that? I think you have not been dismissed as editor of the BSTS newsletter because nobody wants the job. Might I say that you do not even have sound judgement? You demonstrated that by making public the contents of the message you received from Archbishop Marcelo Sánchez Sorondo, Chancellor of the Pontifical Academy of Sciences, indulging in “Vatileaks”. So much for one who calls himself a “core Catholic”. Are you sure you have read the relevant Shroud literature? Have you read what transpired in 1988 that made Cardinal Anastasio Ballestrero regret his approach? Please behave yourself and stop using terms like “secrecy and innuendo”, remembering that it was you put your nose into a discussion that had nothing to do with you. Do you really understand English or do you speak some Welsh dialect? There is no “cloak and dagger” stuff, which is part of your seemingly paranoid mentality. Please read my previous comments carefully and remember that what is posted on a blog are public statements. If you want to create problems for me because of the nature of some of the things I have to write, putting me in a dangerous situation, I will create problems for you with the police authorities in England with the help of investigative journalists. Is that clear? You have a lot of thinking to do..","date":"2015-10-15","mins":"6:27 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-212504","author":"louis","post":"It is clear that the material found in Masada is not similar to the Shroud linen..","date":"2015-10-14","mins":"4:37 pm","url":"https://shroudstory.com/2015/10/14/linen-from-india/","cat":"archaeology","title":"Linen from India?"},{"id":"comment-107180","author":"louis","post":"That’s right, Daveb, as long as we don’t see any image nothing can be said..","date":"2014-04-30","mins":"5:38 pm","url":"https://shroudstory.com/2014/04/30/newly-discovered-very-early-image-of-jesus/","cat":"archaeology","title":"Newly Discovered Very Early Image of Jesus?"},{"id":"comment-107254","author":"louis","post":"I have seen the image but no inscription over the Internet, it is a youngish boy with curly hair who seems to be wearing a “bermuda”, not a tunic. How is it known that it is Jesus?.","date":"2014-04-30","mins":"6:54 pm","url":"https://shroudstory.com/2014/04/30/newly-discovered-very-early-image-of-jesus/","cat":"archaeology","title":"Newly Discovered Very Early Image of Jesus?"},{"id":"comment-111188","author":"louis","post":"The peshita is the oldest syriac NT text. The Vatican apparently wanted to examine the book in the link and perhaps acquire it for the library. One must remember that there were many gnostics groups in that region during the period and so the origin maybe traced to them. What sculpture are you talking about? Do you mean the mosaic? Best..","date":"2014-05-04","mins":"8:13 pm","url":"https://shroudstory.com/2014/04/30/newly-discovered-very-early-image-of-jesus/","cat":"archaeology","title":"Newly Discovered Very Early Image of Jesus?"},{"id":"comment-193952","author":"louis","post":"Further to the above, it seems that it is being taken for granted that all Jews buried in Jerusalem during the Second Temple period were buried wrapped in the same kind of shroud. Was the same kind of burial cloth used to wrap, say, Caiaphas or Herod? The man found in Akeldama, in the so called “Tomb of the Shroud”, referred to above, was in a tomb with 20 ossuaries, only his loculus was plaster sealed because he was a leper. There seem to have been other rules when it came to crucified people like Jesus, but this topic is for “Jesus was not buried in Talpiot, Part IV”..","date":"2015-03-21","mins":"10:57 am","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-111282","author":"louis","post":"Angel, I remember now that I too saw it but didn’t pay much attention as it was 11th century. I f you can locate it, well and good. Nice to see you have flown back to planet earth. Best..","date":"2014-05-04","mins":"10:02 pm","url":"https://shroudstory.com/2014/04/30/newly-discovered-very-early-image-of-jesus/","cat":"archaeology","title":"Newly Discovered Very Early Image of Jesus?"},{"id":"comment-193956","author":"louis","post":"James Tabor is not an archaeologist, he is a professor, and accompanied the archaeologists. The tomb had been looted in antiquity and just some bones, hair and bits of shroud textile were found. The position you are looking for cannot be determined. It was the shroud that drew attention..","date":"2015-03-21","mins":"2:45 pm","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-193949","author":"louis","post":"James Tabor is an intelligent and questioning scholar, however he seems to be on the wrong track. He belonged to the Worldwide Church of God when he was young, founded by Herbert W. Armstrong, whom I met once when listening to a talk he gave. The DNA tests did not exactly provide the results he claims, he ignored Pfann, Spigelman and Rollston. Of course, he also had to emphasise Feuerverger, Kilty and Elliott, providing statistics that have also been questioned. See the review of the book that was published after the Princeton Conference held in Jerusalem to discuss the so called Jesus family tomb: https://www.academia.edu/7471223/Jesus was not buried in Talpiot   Part III I would like Dr. Kelly Kearse to comment on the DNA contamination..","date":"2015-03-21","mins":"10:01 am","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-193959","author":"louis","post":"The man came from an aristocratic family and it seems that the case was unnecessarily used to make a comparison with the Turin Shroud..","date":"2015-03-21","mins":"3:17 pm","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-194021","author":"louis","post":"Thank you, Kelly. I had wanted to know how much scientific support there could be from another source. So my review above was correct about the speculation and sensationalism..","date":"2015-03-22","mins":"8:55 am","url":"https://shroudstory.com/2015/03/21/tabor-a-distinctive-1st-century-weave/","cat":"archaeology","title":"Tabor: A Distinctive 1st Century Weave"},{"id":"comment-191558","author":"louis","post":"Thanks for posting this, Dan. We must remember that the Creed says, “true God and true man”, with reference to the two natures. As a man Jesus would eat when he was hungry, drink when he wanted to do so (much more than John the Baptizer), sleep when he was tired, and so forth. He could thus marry. The Mary Magdalene issue came under the limelight with the so called Jesus family tomb, proposing that all the “family” members were buried in Talpiot. However, this book and documentary are agenda driven. They were also meant to try to demonstrate that as a rabbi Jesus would have to marry. The problem is that Jesus was not a rabbi in the conventional sense, he could only have been a rabbi in the broad sense. He assumed more than one role in his earthly ministry. Why should he have to be married? Jeremiah was single. Was John the Baptizer married? Did he pitch a tent to live with a wife in the wilderness? The tomb topic caused such a sensation that the Princeton conference was held in Jerusalem. It was then that I asked Father Joseph A. Fitzmyer, SJ, Emeritus Professor of Biblical Studies at Catholic University of America, Washington DC, if he would attend. He told me that he wouldn’t although he had been invited, in fact he was coming close to retirement then. Earlier, Father Fitzmyer had been invited to examine the Aramaic inscription on the “James ossuary” on display in Toronto. The ossuary had been the topic of a book by Hershel Shanks and Ben Witherington III, an interesting work,with some unjustified conclusions. He also reviewed the book on the “Jesus family tomb”. His points of view, as one of world’s top biblical scholars — who translated ancient Aramaic, Hebrew, Syriac, Greek and Latin texts into English — were of paramount importance. The truth about what can be learned about Mary Magdalene ( Father Fitzmyer’s interpretation of ancient Greek texts and review of a book that appeared after the Princeton conference) can be found in the following: https://www.academia.edu/7556467/Jesus was not buried in Talpiot   Parts I and II and: https://www.academia.edu/7556467/Jesus was not buried in Talpiot   Parts I and II Karen King has been pushing her agenda driven hypotheses a bit too far. One has to be careful with papyrii that come from “anonymous figures” (see the post above) as well as with unprovenanced artefacts relating to biblical archaeology that appear once in a while in Israel..","date":"2015-02-22","mins":"10:12 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191639","author":"louis","post":"David Goulet It seems that you sometimes post comments as pastime, picking on people with nasty comments that can be provocative. Let me ask you the following: 1) Have you read all the posts Dan posted on this topic? 2) Have you read the articles on Talpiot? 3) Have you read the exchanges? 4) Are you a journalist writing on the topic of biblical archaeology, with published articles and interviews with top biblical scholars in prestigious dailies? 5) Have you reviewed any books on the topic? Please refrain from hitting below the belly and stick to your field, which is computer technology..","date":"2015-02-23","mins":"8:39 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191648","author":"louis","post":"That’s alright, David, although you do not seem to have read the exchanges. It is not a question of one manship. The debate is serious, if someone has towed the wrong line — evident in the exchanges right from the beginning — and reached a dead end it should be admitted..","date":"2015-02-23","mins":"10:09 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191640","author":"louis","post":"Sorry, from the exchanges above it is clear that defending Karen King right from the beginning was a waste of time..","date":"2015-02-23","mins":"8:51 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191656","author":"louis","post":"OK, David. I could have been contested directly, not with comments dropping hints indirectly. Dan posted the piece of news after my suggestion. This a field in which I have been involved for a good number of years, also receiving books from publishers wanting to get either a “green” or a “red” signal for translation from me, having “Expert” written under my name by the editors of top dailies where my articles or interviews were published and so forth. It is a serious, professional engagement. This experience was not acquired by reading encyclopaedias or books in libraries, it came when talking to world renowned Biblical scholars and epigraphers, discussing authors and books with editors and directors of publishing houses, book reviews, articles. By the way, now that you mention Jesus, I first believe in him, try my best to follow his teachings, and, I am not looking at the Shroud as a prop for belief in his Resurrection..","date":"2015-02-23","mins":"11:20 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191647","author":"louis","post":"That is the way Rome has always interpreted it, also referring to the institution as the mystical body. In this context, it dismissed the papyrus as fake, which is what I said right from the beginning..","date":"2015-02-23","mins":"10:01 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191668","author":"louis","post":"D “… may have influenced the decision for the present posting”. Dan is the right person to answer that..","date":"2015-02-23","mins":"2:43 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191661","author":"louis","post":"Thanks, David. Sorry, I thought your expertise was in the field of computers..","date":"2015-02-23","mins":"12:11 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191748","author":"louis","post":"The suggestion of posting this bit of news was sent by me to Dan, as he acknowledged above. Of course, there was an axe to grind: as one who has been writing and advising professionally in this field for many years as also rejecting the papyrus as a fraud right from the beginning — particularly on this blog — it would be appropriate to post an update, given the previous posts. There have been requests all along these years to give talks about the birth of Christianity and its significance today, but these have had to be turned down. People are advised about the best books to read, the authors on whom one can rely. Above all, they are also told what to dismiss without paying any attention — the papyrus in question among them..","date":"2015-02-24","mins":"5:46 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191560","author":"louis","post":"Part III can be found here: https://www.academia.edu/7471223/Jesus was not buried in Talpiot   Part III.","date":"2015-02-22","mins":"10:17 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191958","author":"louis","post":"More rubbish on the Internet, coming from an amateur: http://www.salon.com/2015/02/27/9 things you think you know about jesus that are probably wrong partner/ The Turin Shroud is mentioned and there is reference to Thomas Jefferson as a sort of biblical scholar (!). Comments of 22 Feb. Above had already addressed some of the points..","date":"2015-02-27","mins":"8:33 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-209025","author":"louis","post":"Great news: http://news.yahoo.com/origins gospel jesuss wife begin emerge 115640514.html I, at least, always insisted right from the beginning that it was a fake..","date":"2015-08-26","mins":"11:15 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191582","author":"louis","post":"Hi David It seems that you were sort of forced to change your mind! See your comments on shroudstory, 2014: April 10, 2014 at 7:54 pm Reply “Suspicion concerning Karen King’s agenda is no proof of forgery, nor is lack of provenance.” I insisted, right from the beginning, that Karen King’s agenda, and her insistence, was the key to the apparent forgery. Provenance is extremely important in biblical archaeology and a lot of dirty business goes on. It was thus gratifying to hear Professor Stigler, at the University of Chicago, saying exactly what I was thinking when it came to Talpiot (See Part III above). “*I see no connection with the Talpiot case” Of course there is a connection, it is the hidden agenda industry. That is why I wrote above: “Karen King has been pushing her agenda driven hypotheses a bit too far. One has to be careful with papyrii that come from “anonymous figures” (see the post above) as well as with unprovenanced artefacts relating to biblical archaeology that appear once in a while in Israel.” The “James ossuary” is one such artefact. In this case, too, I wrote a piece pointing out why the second part of the inscription was written by a different hand. It went online three months before the IAA officially dismissed the claim that it had held the remains of James the Just. Remember, there is something called intuition…… Coupled with some insight, it can give good results..","date":"2015-02-22","mins":"3:10 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-211963","author":"louis","post":"I continue to stand by my position. There are just too many questions that remain unanswered to be in favour of authenticity and the big problem is the agenda behind the sensationalism — as usual..","date":"2015-10-07","mins":"7:47 am","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"},{"id":"comment-191590","author":"louis","post":"David, you were defending Karen King while I was challenging the forgery she was promoting right from the beginning. Sorry, you must admit defeat..","date":"2015-02-22","mins":"5:07 pm","url":"https://shroudstory.com/2015/02/22/update-again-on-the-gospel-of-jesus-wife/","cat":"archaeology","title":"Update Again on the Gospel of Jesus’ Wife"}]
