[{"id":"comment-127633","author":"louis","post":"Professor Christopher Ramsey is clean, he believes that there was no error in the 1988 carbon dating, and is willing to open the doors of the Oxford laboratory, if necessary, for another test. The problem is that it seems no one has come with a theory about how the results were skewed which is acceptable to all Shroudies or not challenged by non Shroudies. Professor Ramsey is a practising Christian, his faith does not depend on the TS..","date":"2014-06-07","mins":"6:36 pm","url":"https://shroudstory.com/2014/06/07/1988-pictures-and-details-from-oxford/","cat":"carbon_14_dating","title":"1988 Pictures and Details from Oxford"},{"id":"comment-38435","author":"louis","post":"It is evident that more research on the threads will be needed and very likely that new findings will emerge. But, coming to Randi, who is said to have researched occult and the paranormal, two very different things, one must presume that as a magician he can easily detect sleight of hand. In the case of Sai Baba (India), challenged by Dr. Abraham Kovoor (Sri Lanka) and parapsychologists from different countries, the history is known. So much for magic. How could Randi research genuine paranormal phenomena, which are spontaneous? Would he judge Abraham Lincoln to have been a liar, leaving aside Mary Todd Lincoln’s interests? It is known that the mind is capable of neutralizing space and time in genuine paranormal phenomena. Would Randi judge Jesus to have been a magician? Magicians do not heal and cure, and the secular and sceptical Jewish archaeologist Shimon Gibson has acknowledged that it was precisely because of his healing and curing activity that made Jesus hated and feared by the High Priests, leading to the crucifixion..","date":"2013-06-30","mins":"5:28 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"id":"comment-38486","author":"louis","post":"John, thanks for the lead, I will go through your blog the soonest possible because we have common interests. Some two years ago I received a book on theology published in England for review but the fact that the author sort of ignored the Gospel according to John kind of put me off. There are particles of Revelation in nature , Father Karl Rahner wrote, and I have seen scientist theologians with whom such topics were discussed rejecting such a view, insisting that there was much more in nature than what the Jesuit theologian thought there was. The author of the book propounded such a view, but at the expense of rejecting John and thus concentrating only on the synoptics. It depends on how phenomena in nature are interpreted and Rahner did not have access to information about the universe that we now have..","date":"2013-07-01","mins":"6:51 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","title":"A bit of interweaving in the Arizona sample?"},{"id":"comment-127825","author":"louis","post":"The Vatican is not afraid of any C14 test, it is 2000 years old and learns from mistakes and the relic is not an article of faith. My suggestion: read Ian Wilson’s last Shroud book to learn why it could be a mistake to rush forward with another C14 test..","date":"2014-06-08","mins":"5:38 pm","url":"https://shroudstory.com/2014/06/07/1988-pictures-and-details-from-oxford/","cat":"carbon_14_dating","title":"1988 Pictures and Details from Oxford"},{"id":"comment-173826","author":"louis","post":"O.K. Rome appears to be willing to conduct another C14 test, however the hesitation is because of the choice of laboratories. The other problem is that no commission to propose the inter disciplinary approach has been formed. In short, everything is at a standstill. What we can do now is to concentrate on the image formation process, to which you also have made useful contributions. Now, one word of caution: If the Shroud did indeed wrap the body of Jesus, then no amount of carbon dating will give correct results. I, for one, believe in mind over matter, that matter can be largely illusory, and also that God is not subject to the laws of nature as we are. One should also add that laws of nature are propositions. In one of the two courses I did in parapsycholgy I learnt that phenomena can be divided into: — paranormal — which is human — extranormal — which is also human — supranormal — which is a force from beyond our world, acting in our world. If Jesus was once wrapped in the Shroud, the Resurrection event would have affected the cloth permanently..","date":"2014-11-30","mins":"11:05 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173594","author":"louis","post":"One wonders whether carbon dating is worthwhile after considering the possibility that the Shroud may not be an object suitable for this kind of test. In the interview he gave me Prof. G.Fanti says that just one thread a few millimetres long is sufficient. But what happens if something goes wrong again? Then there will be request for centimetres and if something goes wrong again, they will ask for a foot. Chapter 7 entitled “What’s in a date?” in Ian Wilson’s book “The Shroud. Fresh light on the 2000 year old mystery” gives the reasons why carbon dating is not advisable and he does mention the views of the late John Tyrer, textile expert who worked in Manchester, about the problem of contamination. It is just one example, there are many other ones, so it is worth reading this particular chapter because of the context of the discussion. It seems that even Professor Christopher Ramsey has foreseen more problems that can arise with fresh carbon dating. See the last Q/A in: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies.","date":"2014-11-29","mins":"8:41 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-174326","author":"louis","post":"At least two images Professor Danin has identified on the Shroud are clear. The rest will depend on whether the Church (one parish) will throw its doors open for further research. Some of the material taken from the relic during the Restoration should help in identifying more pollen grains..","date":"2014-12-02","mins":"1:48 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173832","author":"louis","post":"O.K. “There is no proven relation between the body of Jeus being wrapped in the Shroud, and the C14 amount.” What exactly is proven? Whatever his worldview may have been it does seem that Rogers was a serious scientist and did find anomalies in the sample with which he worked. I stand by the mending hypothesis, along with a couple of others that have been proposed. “Personally, I don’t believe the Resurrection affected C14 amount.” Why not? How do you interpret the Resurrection? Note: You wrote sometime ago that your papers were posted on a website devoted to apologetics. If you read German, go through the book on your most famous countryman, Pope John Paul II, written by the German journalist Andreas Englisch. He leaves it to readers to judge from themselves, although he himself made a decision and regained his faith. Speaking of apologetics, I trust you know the criteria adopted by Rome in the beatification and canonisation processes. Would you say that there is no proven relation between the healing/curing and the saint to whom prayers were offered? I will make things easier for you;Remember, where there is Jesus, there is subtlety. And, before I forget, if the fresh C14 test you are eager to see gives a medieval date will you give up Shroud studies and say the relic is a fake?.","date":"2014-11-30","mins":"11:39 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-173860","author":"louis","post":"O.K. I understood what you said,that is why the supranormal phenomena was mentioned. A force from beyond acting in our world can leave permanent effects. You must have read at least one of the scientific papers with this proposal. A recent one was presented in Saint Louis but has not yet been published. As for the book on Pope John Paul II by a German journalist who was a Vatican correspondent for twenty years: http://andreasenglisch.de/paepste.php and: http://andreasenglisch.de/autor.php.","date":"2014-11-30","mins":"1:33 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-174292","author":"louis","post":"Thomas, I think it is one of the possibilities. One could include in supranormal phenomena what at least the Catholic Church employs as criteria in the beatification/canonisation process. Not before all possibilities of natural phenomena are considered and the role played by the devil’s advocate..","date":"2014-12-02","mins":"7:12 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-79065","author":"louis","post":"This seems to be a reference to David Roemer, as he kept on going on and on without listening or understanding why he got a negative from Cardinal Timothy Dolan. Who exactly is the “heretic” here, Dolan or Roemer? February 11, 2014 at 8:18 am | #63 Quote David Roemer Re #62. If Cardinal Dolan will not allow you to present your slideshow (at Saint Patrick’s?) that is because of the Shroud Exposition in Turin in 2015 authorised by Pope Francis. How can the Archdiocese of New York contradict the Archdiocese of Turin or the Holy See? You are of course free to present your show, perhaps somewhere else in New York. The Shroud is not a part of the Deposit of Faith, it can be a prop for those whose faith is weak, but it is certainly not the foundation of Faith. That would be ridiculous. Which is why it is strange that one Congregation passed your complaint on to another one, as you say. Cardinal Dolan is not Hans Küng, Leonardo Boff or Tissa Balasuriya, nor has he written a book saying things like Anthony de Mello, to which the Congregation for the Doctrine of the Faith took exception..","date":"2014-02-13","mins":"2:57 pm","url":"https://shroudstory.com/2014/02/13/a-magical-medieval-shroud/","cat":"carbon_14_dating","title":"A Magical Medieval Shroud"},{"id":"comment-173599","author":"louis","post":"What about the desperate attempts to demonstrate that the relic is a fake?.","date":"2014-11-29","mins":"9:06 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . ."},{"id":"comment-192799","author":"louis","post":"It should not be forgotten that no examination of the chemical composition of the 1988 sample was made..","date":"2015-03-08","mins":"11:49 am","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193150","author":"louis","post":"In an interview posted yesterday Italian physicist and Shroud scientist Dr. Paolo Di Lazzaro, says that contamination was not removed in 1988 and that any future test should ensure that there is no sign of it. He did some very interesting research on image formation, published in a peer reviewed journal: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin “Miraculists” and “Naturalists” may be able to decide who has more reason — till today..","date":"2015-03-11","mins":"5:50 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-193219","author":"louis","post":"You’re welcome, Sampath. I think you do not know it, but we are neighbours..","date":"2015-03-12","mins":"1:18 pm","url":"https://shroudstory.com/2015/03/08/a-rebuttal-of-jacksons-refutation-of-reweaving/","cat":"carbon_14_dating","title":"A Rebuttal of Jackson’s Refutation of Reweaving?"},{"id":"comment-47884","author":"louis","post":"One must be fair and stick to honesty when commenting. Not even the Archdiocese of Turin, whose spokesman was Monsignor Giuseppe Ghiberti, doubted the provenance of Rogers’ sample. They only contested his conclusions, which still is one among several hypothesis of how the results of 1988 carbon dating may have been skewed. In my view Rogers’ mistake appears to have been his bias against the supernatural,making him to refer to the so called “lunatic fringe.” Nietzsche proclaimed the death of God and died insane, now we have had RD taking a bus around London saying the same sort of thing. It is important to take all data into account, leave prejudice, if not hatred, aside in order to avoid making dogmatic proclamations. An open mind is the best option, particularly when there is conflicting data..","date":"2013-10-18","mins":"9:00 am","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-47951","author":"louis","post":"Colin : “No, it’s not about honesty, so much as transparency. What should have been totally transparent is clouded in mystery and uncertainty.” Agree, but the damage has been done and here we are trying to see who was wrong in an operation that went off the mark from beginning to end,with mistakes made by both Church and laboratories. From what is known, the authorities in Turin are working to see what can be gauged from the data they have with them and only then will they probably decide what to do..","date":"2013-10-18","mins":"7:34 pm","url":"https://shroudstory.com/2013/10/18/again-joe-marino-sue-benford-and-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Again:  Joe Marino, Sue Benford and the Carbon Dating of the Shroud of Turin"},{"id":"comment-33241","author":"louis","post":"From a number of sources it can be deduced that: 1. Professor Carlos Chagas did not believe in the authenticity of the Shroud 2. It is also probable that Professor Luigi Gonella had his own doubts 3. Cardinal Anastasio Ballestrero was sceptical in the beginning, that is, in the period before the CD test 4. The three laboratories wanted the limelight 5. Cardinal Ballestrero was under pressure, in fact he admitted that in an interview published shortly before he died, and stressed by CIELT 6. There is confirmation that Cardinal Ballestrero was right in his statements..","date":"2013-05-08","mins":"11:35 am","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33267","author":"louis","post":"Regarding the pressure, the relic is not an article of faith, the creed does not say “and was buried wrapped in the Turin Shroud”, so Pope John Paul II simply gave the green signal after what Turin told him. If the Pontifical Academy had exerted pressure Professor Chagas would have had his way, the original protocol he drafted would be respected, and things would have taken a different turn..","date":"2013-05-08","mins":"4:46 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33287","author":"louis","post":"The case of “Lindow Woman”, something to do with the Reyn Bardt murder, is stale news, having been reported in a BSTS newsletter more than ten years ago. As for Lindow Man, fresh carbon dating reported to have been conducted on this item produced the results: 2 BC to AD 119. The new dating, accompanied by a photograph, can be seen in “The Quest for Jesus in Shroud research” on the HSG website..","date":"2013-05-08","mins":"8:09 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-33520","author":"louis","post":"That’s alright, David I got your point. It is not difficult to agree that CD is not as infallible as some scientists claim. There is even a funny side to the story of the Lindow peat bog acting as as a preservative. The peat from there has for years been used to make cosmetics and one scientist studying the area joked that one could be sure that since vegetables are also grown there God knows what went into making tomato sauce..","date":"2013-05-11","mins":"6:46 pm","url":"https://shroudstory.com/2013/05/07/an-email-from-professor-christopher-ramsey/","cat":"carbon_14_dating","title":"An email from Professor Christopher Ramsey"},{"id":"comment-34990","author":"louis","post":"Good night Jesterof, and be prepared,you will have a lot more research to do..","date":"2013-05-26","mins":"11:13 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34801","author":"louis","post":"Giorgio, you have raised good questions. Though the doubts will have to be cleared by the experts, it looks like the particles have something to do with Mc Crone’s insistence on red ochre and vermilion, probably coming from other sources like icons and paintings that are said to have been pressed over the Shroud to impart holiness. The last part you quoted seems to point to a lot more contamination..","date":"2013-05-25","mins":"7:29 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34811","author":"louis","post":"Agreed. We need revaluation by the experts.. That’s why I don’t believe we’re just looking at the dorsal area 3 AB and 3 AC. It would seem to me we might be dealing with much more contamination then just those two isolated areas. Giorgio, the laboratories talk about contamination as though it is an easy thing to remove, but it really appears to be something easier said than done. The object is linen, specifically, the Turin Shroud, which has passed through many places, probably in many different lands,held by so many hands and a lot more. The last part you quoted in #12 gains a lot of importance..","date":"2013-05-25","mins":"8:32 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34819","author":"louis","post":"Giorgio, we have agreed about contamination. As for the colour of what is said to be blood stains, the Australian Dr.Loy is reported to have affirmed that the blood of people who die after a trauma is very red..","date":"2013-05-25","mins":"9:25 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34823","author":"louis","post":"One wonders how work on the tapes is possible now that Dr. Whanger stepped out of the minefield. Professor Danin insisted that Uri Baruch did a good job on the tapes..","date":"2013-05-25","mins":"9:39 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34827","author":"louis","post":"Jesterof, yes I have. It is the book “The Blood and the Shroud: New Evidence that the World’s Most Sacred Relic is Real”..","date":"2013-05-25","mins":"9:54 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34830","author":"louis","post":"You’re welcome, Jesterof. It would be nice for you to share what more you can discover with us..","date":"2013-05-25","mins":"10:04 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34836","author":"louis","post":"You’re right about Dr. Mc Crone, and that was exactly what was meant in #13. From what can be understood in the literature, the “too red” or “very red” refers to the blood in general, that is, to the post mortem blood. Hope this helps. I can’t say anything about the colour depending on the light source and presume that the scientists who studied the stains would have known that..","date":"2013-05-25","mins":"10:26 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34878","author":"louis","post":"Hullo Kelly Yes, I did also read some time ago about Dr. Loy’s death.Unfortunately the book which I asked Jesterof to consult isn’t within reach now, but if I remember correctly Dr. Loy was saying that ancient blood can retain a very red colour if it was the result of a traumatic death. This was clearly the reason why his opinion was cited in the book. Presumably he dealt with cases of violent death in the ancient world, cases similar to Lindow Man, found in England, and so he was an authority on the subject. Hope this helps and I wish you success in your endeavours. Best..","date":"2013-05-26","mins":"10:49 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34893","author":"louis","post":"Jesterof, you are slowly putting an end to the harping on the issue of bilirubin, so for the time being there is no reason to scream..","date":"2013-05-26","mins":"3:25 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34897","author":"louis","post":"I know you were Jesterof, and it would be nice and enlightening if both you and Kelly can contribute more to the study of the blood stains.","date":"2013-05-26","mins":"3:52 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34915","author":"louis","post":"Jesterof and Yannick, between Adler and Mc Crone I would vote for the former. Jesterof, its too early to scream, let’s wait till Giorgio posts some of that correspondence on the HSG website..","date":"2013-05-26","mins":"6:16 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34938","author":"louis","post":"Jesterof, you have only read part of the reports, other than Dr Adler there were drs. Heller, Baima Bollone and Rodante talking about blood..","date":"2013-05-26","mins":"8:02 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34950","author":"louis","post":"Jesterof, re. # 76 With all this talk about — you said it —bilirubin, go to http://www.ohioshroudconference.com/papers/p04.pdf and —you said it — for blood, go to http://www.ohioshroudconference.com/papers/p19.pdf This is just for a start and you will have piles to read, so maybe you get get hold of a nice Shroud book to save time..","date":"2013-05-26","mins":"8:37 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-34794","author":"louis","post":"There was no chemical analysis of the sample taken for the 1988 carbon dating.","date":"2013-05-25","mins":"6:57 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","title":"An Important and Highly Informative Guest Posting by Paul Maloney"},{"id":"comment-48162","author":"louis","post":"Thanks for the lead, O.K. I hesitate to take pseudepigrapha very seriously because there is a lot of allegory, no one knows the true authors, and the dating of many documents is still being discussed. Of course, they do help us to judge what was on the minds of the people in that region during the period, concentrating on who copied whom. Remi van Haelst is a good scientist and I have taken note of the lead to read when there is time. By the way, it is good to see you have some encyclopaedic knowledge of Shroud history and related topics. Will we be soon receiving some more good news from you, something like a new Shroud newsletter, even if it is in Polish with English translation?.","date":"2013-10-20","mins":"6:11 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48155","author":"louis","post":"Max re. # 31 You wonder whether Father Heinrich Pfeiffer would disagree with your cryptoanalysis. Perhaps that would depend on what was the reaction of Sister Blandina Paschalis Schlömer to the paper you sent her on the second shroud. They conduct studies together. In my interview with Fr. Pfeiffer, excerpts from which are on the HSG website, the emphasis was on the “Veronica” and the TS and he did not reject the “Oviedo Cloth”. Your research on the Stuttgart Psalter is certainly worthy of appreciation. Now about the second shroud….","date":"2013-10-20","mins":"4:45 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-48165","author":"louis","post":"Unfortunately that is a part of the story and you will have to live with it,and, most important, not give up..","date":"2013-10-20","mins":"6:37 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon"},{"id":"comment-46088","author":"louis","post":"Except for Princess Clothilde and the Poor Clare nuns, we do not know who else may have handled the Shroud for any invisible weaving, mending and so on. Who knows what may have gone unrecorded?.","date":"2013-10-03","mins":"4:56 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46068","author":"louis","post":"It is not that easy to claim anything — on both sides. Read the book “The Shroud. The 2000 year old mystery solved”, where the author wants to know why the big holes were left as they were..","date":"2013-10-03","mins":"9:47 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46100","author":"louis","post":"Yes, that’s correct, I had forgotten about him, but the question is if there were other people who made repairs and whose work was not recorded..","date":"2013-10-03","mins":"7:01 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46487","author":"louis","post":"A surface sheen was indeed seen on the Shroud, sort of confirming what Dr. Garza Valdez had proposed, however scientists have argued that this type of contamination was not enough to skew the carbon dating test..","date":"2013-10-08","mins":"12:20 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-46079","author":"louis","post":"One wonders whether the people who supervised the job did not find a suitable piece of cloth for the patches. Whatever the case, IW raised a good question..","date":"2013-10-03","mins":"2:01 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","title":"And then, too, we have two comments from Daveb of Wellington"},{"id":"comment-18667","author":"louis","post":"“Greatest scientific cheat of all times”? That’s funny. Both Gonella and Riggi were there to decide and have heated arguments about the site from where the samples had to be cut. Cardinal Anastasio Ballestrero, OCD did not take that much interest, at least in the beginning, apparently because of his “Carmelite spirituality,” but years later he gave an interview to an Italian magazine saying that he had been manipulated and expressing sadness about what had been done. Father Werner Bulst told German TV that there was a “plot”, and I had first hand confirmation about what he was referring to. So it will be important to see what fresh information Franco Faia brings..","date":"2012-10-31","mins":"8:09 am","url":"https://shroudstory.com/2012/10/30/another-article-on-francesca-saracinos-la-notte-della-sindone-documentary/","cat":"carbon_14_dating","title":"Another Article on Francesca Saracino’s “La notte della Sindone” Documentary"},{"id":"comment-18685","author":"louis","post":"Who are you?.","date":"2012-10-31","mins":"6:46 pm","url":"https://shroudstory.com/2012/10/30/another-article-on-francesca-saracinos-la-notte-della-sindone-documentary/","cat":"carbon_14_dating","title":"Another Article on Francesca Saracino’s “La notte della Sindone” Documentary"},{"id":"comment-18686","author":"louis","post":"Gabriel, if you go through the history of the Shroud since 1988 you will find material on the “plot” with a lot of variations in the story. It is the result of people within the Church doubting the authenticity of the relic even before the carbon dating. Curiously, Professor Carlos Chagas, who did not believe in authenticity either, prepared the best protocol, which was thrown by into the dustbin. It seems the co producer of the documentary is RAI and for that reason something good can be expected. Whatever is said, it better be something really new and convincing because the “plot” does not seem to have affected the decision about the sample and the results..","date":"2012-10-31","mins":"7:29 pm","url":"https://shroudstory.com/2012/10/30/another-article-on-francesca-saracinos-la-notte-della-sindone-documentary/","cat":"carbon_14_dating","title":"Another Article on Francesca Saracino’s “La notte della Sindone” Documentary"},{"id":"comment-18719","author":"louis","post":"You’re welcome, Gabriel. The focus should be on what has been called “many questions unanswered.” It could something about what exactly Cardinal Ballestrero was referring to in his interview without going into details and there appears to have been treachery there, treachery coming from those who “manipulated” him. If my guess is correct the document will tell us who the traitors were and, on my part, I wish to see why they acted that way and if it is in agreement with what I was told. Best..","date":"2012-11-01","mins":"5:33 pm","url":"https://shroudstory.com/2012/10/30/another-article-on-francesca-saracinos-la-notte-della-sindone-documentary/","cat":"carbon_14_dating","title":"Another Article on Francesca Saracino’s “La notte della Sindone” Documentary"},{"id":"comment-31328","author":"louis","post":"A petition sent to Pope John Paul II with around 57 signatures brought no result. The Vatican link in this case via Turin and that is where the problem starts..","date":"2013-04-19","mins":"4:48 pm","url":"https://shroudstory.com/2013/04/18/antonacci-proposing-molecular-and-sub-atomic-testing-to-resolve-disputes-regarding-the-shroud/","cat":"carbon_14_dating","title":"Antonacci Proposing Molecular and Sub-Atomic Testing To Resolve Disputes Regarding the Shroud"},{"id":"comment-84448","author":"louis","post":"Charles, Professor Fanti told the press that he will not hand over his sample and Dr. Rogers also worked on something that was not given to him officially (like fibres or a tiny piece of the cloth in an envelope with the Shroud custodian’s seal). A lot of people may not agree with his findings, however the good thing is that his integrity cannot be questioned, that being one of the reasons why he received funds from the University of Padua. Now, what about that piece of sample retained in Arizona? It could be used for further tests, and that would please scientists who question the findings of both Rogers and Fanti..","date":"2014-03-03","mins":"9:21 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-84476","author":"louis","post":"Charles and Hugh: I am compiling a list of doubts cast on the methodology employed by both Ray Rogers and Giulio Fanti, but there is no time to keep collecting many useful comments posted on shroudstory in bits and pieces and paste them. I am inviting everyone interested to make a list of the doubts and send them, even in the form of an attachment, to my e mail address on the HSG website so that that they can be printed, analysed and rearranged to obtain responses, which will be a part of a number of articles I will be writing on the TS and biblical archaeology. The e mail address and identity will not be revealed, if that is anyone’s wish. Thanks in advance..","date":"2014-03-03","mins":"10:44 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-19067","author":"louis","post":"Gabriel, you have hit the nail on the head when you mention the Church’s current position. The remedy is to begin a lot of rethinking, and, as commented earlier, Benedict XVI’s position was voiced by Bishop Kevin Vann at the last Dallas Conference. Since it has fallen on deaf ears the Church continues to remain silent..","date":"2012-11-15","mins":"8:52 am","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility"},{"id":"comment-84564","author":"louis","post":"Espero tener más respuestas para publicar un articulo en breve.","date":"2014-03-03","mins":"4:37 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","title":"As long as these results are not refuted . . . [they] have scientific validity?"},{"id":"comment-33336","author":"louis","post":"It is completely wrong to think that the Church authorities are not aware that there is an inner circle, a sort of “Shroud studies curia” in the realm of Shroud studies, where only what is convenient to those higher up in the hierarchy is allowed to be published, consultation is done in e mails behind the scenes, and where there is a lot of back biting. In fact this has already been pointed out in one website, by someone who is not a Shroudie, so signature campaigns, high sounding titles in peer reviewed papers and so on will not influence Turin, and therefore, also, Rome. To go deeper into the matter, one need only look at some of that nonsense that was posted on Shroud websites or published in Shroud newsletters, coming, mind you, from the pro authenticity camp. It does not seem that Pope Francis and Archbishop Nosiglia are blindfolded..","date":"2013-05-09","mins":"11:34 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-50224","author":"louis","post":"As commented more than once on this blog: a) If the TS is ever “proved” to be a fake it will not demolish Christianity b) If it can be “proved” in some way or the other that it demonstrates the Resurrection, there will still be many more questions to answer. Let us now turn our attention to Jacobovici with his “Jesus family tomb” hypothesis for we have here another example of extremes, this time with the use of bad archaeology, and by someone who is not an archaeologist. Anyone who has read enough about the topic knows that this hypothesis has been dismissed by the topmost scholars. So what did he do? He has appealed to the Patio tomb, twenty metres away, bringing in yet another theory, based on flimsy evidence. He went to the extent of bringing world renowned epigrapher Father Émile Puech into the scene to show the less accurate of two replicas of the so called Jonah ossuary leading the priest into a trap, the same thing he did with Professor François Bovon, who died last week. Nothing has been proved, but that does not deter him. He also smiled when Father Puech told him that Jesus was resurrected and so there could be no remains in any ossuary. Realising that this second theory is also bound to fall apart, he has now announced a (bombastic) book and documentary to be launched together with Discovery in a few months time. And what is it about? It is about “God’s bride”, that is, Jesus and Mary Magdalene. And what is it based on? A fourth century, repeat, fourth century, gnostic document. Worse, he has twisted the meaning of one line to suit his fancies. Well, by now he should know that he will not have the success he expects because the flaws have already been shown by some of the world’s best scholars. Jacobovici is also one track minded, he has not studied enough, and if he did he would think twice about what he is proposing, realising that he faces the possibility of being swallowed by quicksand in the very beach he is taking us to see some entertainment which he is advertising as serious studies. He who smiles last smiles most. We should avoid extreme positions, whether it comes to the TS or to developments in Biblical Archaeology..","date":"2013-11-06","mins":"5:14 pm","url":"https://shroudstory.com/2013/11/06/blowing-the-antonacci-proposal-to-bits/","cat":"carbon_14_dating","title":"Blowing the Antonacci Proposal to bits"},{"id":"comment-33408","author":"louis","post":"Por que todo essa briga por causa de uma lingua? Todos que estão postando comentários entendem inglês e mesmo o inglês um pouco errado dá para ser entendido..","date":"2013-05-10","mins":"9:27 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","title":"Best News Article on Fanti’s Methods"},{"id":"comment-79050","author":"louis","post":"What does this mean? Assuming the man is Jesus, does it mean that God was in a hurry to get the Resurrection going, that is, he couldn’t wait for clinical death? If yes, what was the purpose, since the appearances only began on Easter Sunday? Such kind of speculation is exactly what the proponents of the Kashmir Tomb are waiting for..","date":"2014-02-13","mins":"2:11 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-78796","author":"louis","post":"Professor Giulio Fanti wrote about the earthquake in connection with his image formation hypothesis, not as something to do with how the 1988 CD results were skewed. Hopefully there should be additional material this year..","date":"2014-02-12","mins":"6:12 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-78601","author":"louis","post":"Professor Giulio Fanti mentioned the earthquake in his hypothesis about how the image had been formed in an interview granted years ago: http://holyshroudguild.org/science and religion meet in shroud research.html.","date":"2014-02-12","mins":"6:18 am","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79101","author":"louis","post":"It is very likely that there is a good reason why there is no body image under the bloodstains, but this is being kept for an article meant to be published in a month or two. I am assuming that Drs. Adler and Heller examined the fibres with great care and came to the conclusion that any discolouration found after the blood had been dissolved was due to the serum. But since this is an area where there is also disagreement perhaps a second examination is in order, whenever that will be possible..","date":"2014-02-13","mins":"5:07 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79127","author":"louis","post":"Actually there is a review and two articles,related to the shroud but on different aspects. The second part of the first part is a bit mind boggling, so can you kindly put it in a different way? Yanonymous (that’s right!) could be highly mistaken about the energetic model, however that is for the article..","date":"2014-02-13","mins":"6:49 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79073","author":"louis","post":"Kelly # 40: “I don’t think he’s omitting clinical death or the typical crucifixion, death, resurrection sequence my take on it was that he was saying that when Christ’s dead body came back to life, the heart was restarted as part of the process, hence some bleeding occurred.” This doesn’t sound convincing. How did the bleeding stop? Did Jesus go to a doctor before he allowed doubting Thomas to feel his resurrected body?.","date":"2014-02-13","mins":"3:21 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79411","author":"louis","post":"Kelly Kearse:”The second part of the first part is actually still part of the original quotation from BB. I believe he is saying that (in his opinion) the imaging happened after the bloodstains. Looking forward to reading your articles.” Thanks. It seems that STURP II had to clarify this point, but this was not done and the why lies perhaps in Shroud realm history. You have been tackling highly complicated matters in the Shroud image and at this rate you will surely be invited by Turin for any fresh hands on examination they may have in the future..","date":"2014-02-14","mins":"3:17 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79399","author":"louis","post":"Chris, in that sense it is really worthwhile pondering what you wrote. How God really did it only He knows..","date":"2014-02-14","mins":"2:39 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79424","author":"louis","post":"Daveb, you raised some important points. I believe that the Incarnation means that the divine Jesus took human form and left our world in this form and how that was done is a mystery. There are non Christians who don’t bother about the mystery, either saying that he was just “pure spirit” like the Yezidis or judging that it is not essential that it has to be understood, as was the case with the Hindus Swami Vivekananda and Mahatma Gandhi, for whom Jesus was “avatar”, incarnation of God. Many Catholics opt to be cremated and the curious are told that it is allowed by the Church as long as belief in the after life is not denied. Of course, they believe that the living will pray for them. How that after life will be and what the judgment will be like troubled even a genius like Ludwig Wittgenstein: https://www.academia.edu/5569992/Why was Wittgensteins burial attended by a religious ceremony If the Catholic Church allows cremation, surely it does not expect the faithful to believe that everyone will be resurrected like Jesus?.","date":"2014-02-14","mins":"4:02 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-79417","author":"louis","post":"Chris, yes, we can speculate but,ultimately, Christians depart from this world with belief in the after life, a belief strengthened by what the NT says about the Resurrection. Could it be that it is also fed by fear of judgment? Perhaps that is true sometimes. See the link to Wittgenstein in the response to daveb..","date":"2014-02-14","mins":"3:46 pm","url":"https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/","cat":"carbon_14_dating","title":"Breaking News:  Another Day, Another Solution to the Image and the Carbon Dating"},{"id":"comment-198048","author":"louis","post":"Vatican communications: http://www.catholicherald.co.uk/news/2015/04/30/pope francis appoints commission to reform vatican media/.","date":"2015-04-30","mins":"5:22 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-198049","author":"louis","post":"Pope Francis is No.1 on Twitter,eight times more than Pres. Obama: http://www.thetablet.co.uk/news/2012/0/pope francis is most influential world leader on twitter report finds.","date":"2015-04-30","mins":"5:29 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196930","author":"louis","post":"This doubt seems to have been answered recently: https://shroudstory.com/2015/03/16/barrie schwortz not a painting photograph scorch or rubbing/.","date":"2015-04-20","mins":"10:51 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196943","author":"louis","post":"Thanks for the information, Gian Marco. It had to come from David Sox!.","date":"2015-04-20","mins":"1:14 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196948","author":"louis","post":"I may not agree with Stephen Jones about everything,but look what he had to say about Revd. David Sox in the second paragraph: http://theshroudofturin.blogspot.com.br/2015/03/my theory that radiocarbon dating.html Former BSTS Newsetter editor Ian Wilson also found that Sox was a mischief maker..","date":"2015-04-20","mins":"2:14 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196927","author":"louis","post":"As I stated in a previous comment, it is important to read what Ian Wilson said about radiocarbon dating of the Shroud..","date":"2015-04-20","mins":"10:11 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196966","author":"louis","post":"That’s a funny question..","date":"2015-04-20","mins":"4:17 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196981","author":"louis","post":"Read Ian Wilson’s review of David Sox’s book. Apparently Dr. Wolfli had problems dating his mother in law’s linen tablecloth! http://www.shroud.com/pdfs/n20part4.pdf.","date":"2015-04-20","mins":"5:54 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197064","author":"louis","post":"Hi Max That’s right, Max. Ian Wilson is a serious scholar and I had occasion to interview him for a full page report in a leading daily. If it was a joke he would not even mention it in the review. Any progress with your Templar studies?.","date":"2015-04-21","mins":"11:11 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197052","author":"louis","post":"Re: Dr.Wolfli It is evident that Ian Wilson didn’t take it as a joke.If he had, there would be no mention in the review. Dr. Wolfli is recorded elsewhere expressing doubts about the Shroud’s radiocarbon dating..","date":"2015-04-21","mins":"9:57 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197057","author":"louis","post":"That review is what I was referring to in a comment yesterday, Max. There is no joke there..","date":"2015-04-21","mins":"10:37 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197179","author":"louis","post":"Patrick, Actually the case is not closed. Cardinal Anastasio Ballestrero was forced into a situation for which he was not prepared, probably getting the wrong advice from Professor Luigi Gonella. The Church is willing to go through a rerun of the radiocarbon dating but faces the same problems it saw in 1988. It would never hold the expositions if it believed that there is proof that the Shroud is a forgery..","date":"2015-04-22","mins":"9:22 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197199","author":"louis","post":"Hi John This is very good information, however it is a bit different from what I was given to understand by an authority in Rome. Professor Luigi Gonella did not seem to be pro authenticity, but was Professor Carlos Chagas responsible for the decision? Was he the one whispering in the Pope’s ears? I did watch a 20 minute TV report the day he died, where he said that he did not believe that the Shroud was authentic. The problem is that it doesn’t make sense. How could Professor Chagas trample on the protocols he himself prepared? Where can I find Emanuela’s presentation at Valencia? This matter needs further explanation. Also, what did David Rolfe mean by saying “the game is over”? Who was dictating the terms in the game and what kind of game was it?.","date":"2015-04-22","mins":"11:15 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197210","author":"louis","post":"Thanks for the link, John. I know what can sometimes go on in Rome. Human nature is complex, but US ambassador Frank Shakespeare did not loose his faith! After all, the problem is there in other places too. Now what surprises me is that Ian Wilson — of all people! — seems to be have got his facts wrong, if what you are telling me is entirely correct. He was all praise for Professor Chagas and laid the blame on Professor Gonella’s shoulders in his books. Curiously, Daniel Raffard de Brienne was hesitant to attack Gonella when I queried him, but that was because he found him to be very friendly. Now, one last doubt: Who or what was behind Professor Chagas?.","date":"2015-04-22","mins":"12:27 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196922","author":"louis","post":"There is a missing link in the story. The archdiocese of Turin has not said anything about the material collected during the controversial restoration and the microphotographs in its possession. Are we to presume that they do not advance anything in research? If so, we have two options: 1) Fresh radiocarbon dating 2) Non invasive examinations I think Ian Wilson has in his last Shroud book argued convincingly about why fresh carbon dating is not advisable. We also cannot use what was left of the 1988 sample due to the controversy and if another one has to be cut who will be in charge? Do we want to go through all those problems again? Most important, Professor Christopher Ramsey is willing to throw open the doors of the Oxford laboratory, but has warned about what may happen. What he told me can be read in: https://www.academia.edu/7893085/The Quest for Jesus in Shroud research Given the endless debates, not only during the recent Saint Louis conference, but also seen on websites and blogs it is obvious that Professor Ramsey is correct. It is therefore preferable to rely on non invasive tests, in some kind of STURP II, since better equipment and methodology is now available. The most important thing to be examined is the blood under the image. Serum rings have been identified, but more is needed. The Church is holding the expositions because of tradition, not because the relic is an article of faith. Do we have any proof that Moses existed or about the Exodus? No, we don’t, at least according to Israel Finkelstein, Israel’s foremost archaeologist. Yet, Judaism continues, many who left the faith keep thinking about the terrible evil during the Nazi holocaust. If the Shroud is judged to be authentic, it will help both Christianity and Judaism. Even then, there will be questions that will remain unanswered. But there are questions that other religions have also left unanswered, but that is another story..","date":"2015-04-20","mins":"9:54 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197219","author":"louis","post":"Would you know the names of the institutes, both in the US and the UK?.","date":"2015-04-22","mins":"1:36 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-196925","author":"louis","post":"STURP did some research on medieval painting and discarded the possibility of any comparison with this kind of art. We must not forget Dr. Paolo di Lazzaro’s experiment and ponder about how medieval technology could produce the image we see on the Shroud..","date":"2015-04-20","mins":"10:09 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197211","author":"louis","post":"Hey Colin, Max is Polish..","date":"2015-04-22","mins":"12:28 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197214","author":"louis","post":"Hi Max Please explain the fumigation you are referring to in some detail..","date":"2015-04-22","mins":"12:59 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-197280","author":"louis","post":"Thanks for the information, Joe. The problem is that is still does not answer the question about why Professor Carlos Chagas acted in the way described by John. I do not think it is anti Americanism, although I have observed that many people in Third World countries tend to be ambivalent when it comes to Americans. They admire their progress, but wanting to be like them, and unable to do so, they become jealous. There is a clue when it comes to who was working behind the scenes, however a little more information is needed to fill a gap..","date":"2015-04-23","mins":"6:17 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","title":"Carbon Date the Shroud Again?"},{"id":"comment-98198","author":"louis","post":"The owner of the papyrus prefers to remain anonymous..","date":"2014-04-10","mins":"7:47 pm","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"id":"comment-98203","author":"louis","post":"See #6 above.","date":"2014-04-10","mins":"8:07 pm","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"id":"comment-98701","author":"louis","post":"Forget Karen King. Has no one noticed that she keeps changing her statements, is now sitting over the wall as it is convenient to her because she does not know what more is to come, and does not reveal the provenance because the owner of the fragment prefers to remain anonymous?.","date":"2014-04-12","mins":"10:52 am","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"id":"comment-98167","author":"louis","post":"It is not just carbon dating, there are other problems too, starting with provenance. Since it was brought to the limelight by Karen King, who has an axe to grind, the matter becomes even more suspicious. Harvard is very liberal and will publish almost everything under the sun that is liberal and this is not the end of the story..","date":"2014-04-10","mins":"5:05 pm","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"id":"comment-98186","author":"louis","post":"More is to come, it is not the end of the story, but we must remember that Professor François Bovon told Jacobovici that his Jesus Mary Magdalene connection in the “Jesus family tomb” story was science fiction. Bovon was actually referring to literary devices in antiquity, his interest was in the literary, not historical, Magdalene but some gnostic groups had ritual orgies,they simply could not accept a celibate Jesus. In our own days we have had the ex nun Jane Schaberg wishing that Jesus and Mary Magdalene had a good time in bed! It is the plain truth..","date":"2014-04-10","mins":"7:11 pm","url":"https://shroudstory.com/2014/04/10/carbon-dating-problems-with-the-jesus-wife-fragment/","cat":"carbon_14_dating","title":"Carbon Dating Problems with the “Jesus’ Wife” Fragment"},{"id":"comment-209479","author":"louis","post":"One wonders whether the carbon dating of the manuscript can really be linked to the carbon dating of the Shroud. They are two very different objects. In the case of the Koran, it is important to remember that oral tradition was involved and the Arabic script evolved from time to time. There are scholars who have adopted a different approach. Michael Cook and Patricia Crone (Hagarism: The Making of the Islamic World, 1977, Cambridge University Press) contend that the book was formed gradually, in response to Jewish and Christian challenges. What we see here is also seen in the development of Old Testament and New Testament texts..","date":"2015-09-02","mins":"9:40 am","url":"https://shroudstory.com/2015/09/02/carbon-dating-with-the-potential-to-become-controversial/","cat":"carbon_14_dating","title":"Carbon Dating with the Potential to Become Controversial"},{"id":"comment-10961","author":"louis","post":"Lawyers can be good in finding loopholes. Ray Rogers was on the whole a good scientist but he seemed to be dogmatic when it came to ideas on religion– and he was a chemist..","date":"2012-04-29","mins":"5:41 pm","url":"https://shroudstory.com/2012/04/29/carbon-dating-the-shroud-of-turin-again/","cat":"carbon_14_dating","title":"Carbon Dating the Shroud of Turin Again?"},{"id":"comment-74321","author":"louis","post":"Hullo Anonymous,that seems to be a sweeping statement as there are many in the pro authenticity camp waiting for fresh C14 dating, including those who believe the relic demonstrates the Resurrection. If you read “The Shroud: the 2000 year old mystery solved” you will understand why this may not necessarily bring correct results..","date":"2014-01-23","mins":"9:05 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74293","author":"louis","post":"Daveb, the some of the concrete came from you and is that because I put Charles in a “spot”, as Colin said?! Now what about the rest of the concrete? Is it being imported in England from NZ?.","date":"2014-01-23","mins":"5:47 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74290","author":"louis","post":"Colin: I am still waiting for the concrete you promised on behalf of two commenters whose spokesman you chose to become. Why is it taking so long to come? After all, you said it falls within a 150 mile radius in England..","date":"2014-01-23","mins":"5:32 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74307","author":"louis","post":"Hugh Farey, #94 Quote: Insinuations? “… from the person you mentioned ….” I hope I don’t insinuate. If I don’t agree with you, or think your conclusions unfounded, I hope I explain clearly where I think you are mistaken. I think “insinuation” is a perjorative word, and very much hope Louis is unable to substantiate his claim with even one example, let alone “plenty.” Reply: Webster’s says insinuation is “the act of saying something bad or insulting in an indirect way”. I did not receive any explanation ADDRESSED TO ME where it was clear where you thought I was mistaken in a recent comment. What I saw was an insinuation about something I had written when commenting on the point of view of another Shroudie to whose website Dan had drawn our attention. I do not like commenters posting comments while underestimating someone else’s intelligence. Unfortunately a “group mind” has been formed on this blog and it is being contagious, newcomers on the Shroud scene inheriting the characteristics of some of the older Shroudies, part of an “inner circle” which decides what can be published, what should be suppressed, what should be ignored, doors only open to chummies who dance to a pre determined tune. Why be surprised that many scholars whose contributions could be of immense importance have refused to enter the realm of Shroud studies? Are they blindfolded? Is their intelligence also being underestimated? To go more deeply into this “group mind” we have Gustave le Bon, who influenced Freud. I dislike using capital letters when commenting but have to do so to drive my point about (bad) insinuations. As the new editor of the BSTS newsletter I think you should be aware that what is written on this blog is monitored in Turin and Rome, and at the rate things are going no one should be surprised that petitions to the Pope are ignored..","date":"2014-01-23","mins":"7:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74296","author":"louis","post":"Colin Berry: “I am following Ian Wilson’s views closely right now, on Hugh’s latest BSTS page, especially re the Machy Mould that has received scarcely a mention on this site, despite it focusing on “concrete” history of the Shroud, circa mid 14th century. Forgive me if I take no lectures about alleged “kindergarten” level while a major dimension of the Shroud’s early recorded history is ignored here. I responded to Wilson’s first post on the Machy Mould over a year ago, and an presently preparing a response to his update. What Machy Mould do I hear you say? Quite. That says it all.” Reply: It is obvious that newcomers have to begin with Ian Wilson instead of depending on spoonfeeding. The “Brit” historian never said he was proclaiming gospel truth and has always been open to corrections that could help fill the gaps. But where is the concrete you promised on behalf of others? Also, since you insist that it is Jacques de Molay we see on the Shroud, let us keep science aside for a while and turn our attention to history. Have you read the Chinon Parchment? Why did Philippe le Bel suppress the document and swiftly dispatch the Templar Grandmaster to the stake? Why did he have his drummers around the stake? Most important of all, since you imply that de Molay was scorched, can you let us know where he is buried?.","date":"2014-01-23","mins":"6:17 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74312","author":"louis","post":"Mr. Farey, let me tell you the following: it is not advisable to concentrate on the microscope, be one track minded and neglect other studies, there is a lot to learn from humanities. I was not referring to any of the items you listed in # 106. As editor of the BSTS newsletter you should remember what you posted on the blog, I’m not going into spoonfeeding..","date":"2014-01-23","mins":"7:50 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74322","author":"louis","post":"Righto Colin, after you convince us Shroudies that Drs Adler and Heller were wrong you will also have to tell us where Jacques de Molay was buried after he was scorched..","date":"2014-01-23","mins":"9:17 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74371","author":"louis","post":"Colin says: Jacques de Molay? Do I need to remind you that he was first slow roasted, and then reduced to ashes? So why are you referring to his place of burial? There was no burial – so it’s not clear what the purpose of your comment was. Are you being deliberately obtuse? Reply: I am not being obtuse, I’m looking for the rationale behind your comment. If I understood you correctly, de Molay was first slow roasted, wrapped in the Shroud, unwrapped and then tied again to the stake to be reduced to ashes. Is that what you are saying? I would dismiss this theory, coming as it is from Baigent, filled with hatred of Catholicism, clutching at straws in attempts to do away with belief in the divinity of Jesus. He has written another book to get Jesus out of the way and has been laughed out of court even by non Christians..","date":"2014-01-24","mins":"8:21 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74375","author":"louis","post":"So please explain how it was done..","date":"2014-01-24","mins":"9:00 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74320","author":"louis","post":"That’s all right, Hugh, no hard feelings. The reference was to the Jospice Mattress. I have not yet read your comments in # 106 but will do so shortly when more time is available as these require careful scrutiny. What worries me is the relationship of the realm of Shroud studies with Rome and Turin, which could have been better. Your approach to the Shroud is correct and I am sure the authorities are looking for good science, so it will depend on you to back your comments with hard evidence..","date":"2014-01-23","mins":"8:56 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74385","author":"louis","post":"Colin, # 130. So Geoffroy de Charny produced a shroud depicting his ancestor claiming that it was the Shroud of Christ? That clashes with the historical data obtained by Wilson, but one will have to wait for the paper you promised to write. All I will say now is that Baigent, Lomas and Knight produced similar speculation, contributing to nothing. As a Brit you probably know that Lord Ripon took a very courageous decision, defied Queen Victoria, and did a lot of good..","date":"2014-01-24","mins":"10:02 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74396","author":"louis","post":"Nothing will be stated till your paper is ready and posted. I have not used theological rant, merely shown a link between Baigent, Lomas and Knight and Lord Ripon, but nothing to do with Anglicanism. Don’t forget: you told Dan that he was quasi Catholic and Hugh Farey had to to tell you (elsewhere) that he is Catholic. Why? Who has a theological or anti theological agenda?.","date":"2014-01-24","mins":"11:18 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74419","author":"louis","post":"Let me tell you something: I am not indulging in half truths and show no total irrelevancies. When you cannot answer a query you say you have other things to do and come back after a while without answering the query. Did you answer my query above? No, you didn’t. Why are you interested in who is Catholic, who believes in what? That is irrelevancy. You still have time to check the link between Baigent, Lomas, Knight and Lord Ripon, who broke the link. As for misunderstandings, it is you who are not clear. I was referring to the paper, which you now call response, you said you would write..","date":"2014-01-24","mins":"2:11 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74407","author":"louis","post":"Hi Max. So you have returned with heavy artillery?.","date":"2014-01-24","mins":"12:02 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74453","author":"louis","post":"#157 was addressed to Colin..","date":"2014-01-24","mins":"4:57 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74452","author":"louis","post":"The query is still there, but it is not important. I am more interested in reading any response to the Machy paper you may write. The Vatican is not in a hurry to decide anything about fresh carbon dating of the Shroud, and that is because the Church does not believe that faith depends upon relics, if some Shroudies do that is their point of view. There are millions of Protestants and Orthodox Christians and even Catholics who are not interested in relics. It does not seem that the 1988 CD test decided the issue once and for all and IW’s last Shroud book has a very balanced point of view..","date":"2014-01-24","mins":"4:54 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74463","author":"louis","post":"I welcome any pursuit of the truth in Shroud research, but am wary when it comes to those who demonstrate preconceptions..","date":"2014-01-24","mins":"6:08 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74529","author":"louis","post":"The sample was taken from an anomalous site, also the dirtiest part of the Shroud, so invisible darning cannot be ruled out and it remains one among several hypotheses about how the carbon dating results may have been skewed..","date":"2014-01-25","mins":"7:48 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-73965","author":"louis","post":"There is one response in the thread “The idea of something…” Sitting on the fence? Could be, but about to jump on the side of anti authenticity…..","date":"2014-01-21","mins":"1:56 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74695","author":"louis","post":"There was no chemical analysis of the sample in 1988 and Mme. Mechthild Flury Lemberg was not around, as she should have been. What we know is that Professors Giovanni Riggi and Luigi Gonella took a long time arguing about from which site the sample had to be taken, and the representatives from the laboratories kept quiet. I therefore asked Charles to let us know how many of the protocols he cited in one recent comment were followed and Colin accused me of putting him in a “spot.”.","date":"2014-01-26","mins":"1:56 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74706","author":"louis","post":"Thanks, Daveb. See # 205 below.","date":"2014-01-26","mins":"4:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74705","author":"louis","post":"An all too common spoiling tactic is to avoid a complete picture of what preceded the 1988 CD test. A lot of things went wrong from beginning to end in 1988, a point of view supported by other commenters on this blog. But, to cut a long story short, let us start with the fact that the papal custodian Cardinal Anastasio Balestrero ignored the letter sent to him by Dr. Harry Gove et al. The letter warned that “fundamental modification in the proposed procedures may lead to failure” The number of laboratories were reduced to three and the protocols prepared by Dr. Carlos Chagas, President of the Pontifical Academy of Sciences, were rejected apparently due to the pressure exerted by Professor Luigi Gonella. There was some discussion a few days ago about the laboratories in which thread Charles commented a few things, defending them against what he considered could be judged as libel. It is obvious that the laboratories wanted to be in the limelight and chose to ignore the protocols, that is why he was asked about them. One bad mistake STURP made was to not include a textile specialist in the team and no expert from this field was present when the sample was taken. As I. Wilson wisely noted, “the choice of site for that one sample being well documented as having been subjected to prolonged, repeated handling throughout centuries.” Worse, no chemical analysis of the sample was made. God knows what else was in the sample other than just pure linen. So what we have here is a succession of errors that makes Rogers paper worthy of consideration. Rogers was not a religious scientist, he had no axe to grind..","date":"2014-01-26","mins":"4:24 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74715","author":"louis","post":"Charles, see # 209.","date":"2014-01-26","mins":"5:24 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74714","author":"louis","post":"A balanced comment, awaiting a response from those who have more data. Who knows, perhaps the cotton was dyed to make it match the colour of the relic made dirty in the site threatened by the sweaty hand of the clergy..","date":"2014-01-26","mins":"5:05 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74716","author":"louis","post":"Sorry, the response is in # 210, or it may change to # 211!.","date":"2014-01-26","mins":"5:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74738","author":"louis","post":"Mediaeval bishops are not portrayed wearing gloves while holding the Shroud during expositions and even St. Francis de Sales is recorded to have felt embarrassed after being chided when sweat from his forehead fell on the Shroud. With all those vestments, who could blame him and the prelates? They seemed to have shown much more respect for the Shroud than Cardinal Anastasio Ballestrero before the 1988 dating and evidence for this appears in a photograph in one of the BSTS newsletters, where he appears leaning over the relic. It is even doubtful that Professor Luigi Gonella believed in authenticity, therefore the careless manner in which the sample was taken..","date":"2014-01-26","mins":"7:32 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74749","author":"louis","post":"Well, the damage has been done and we are now crying over spilt milk. This is because of what happened in mediaeval times and in 1988, but, more recently, photographs of the restoration show no gloves being used…..","date":"2014-01-26","mins":"8:13 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74012","author":"louis","post":"Wilson has correctly pointed out in his book why another C14 test will not help clear the doubts..","date":"2014-01-21","mins":"5:48 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74017","author":"louis","post":"Sorry, what you have stated is incorrect. You should read the book first, written by a historian with an M.A. From Oxford. I have no doubt that Meacham is a good archaeologist but Wilson’s knowledge is far superior. ..","date":"2014-01-21","mins":"5:57 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74030","author":"louis","post":"Anyone who reads Wilson’s book knows that he has studied the 1988 C14 dating carefully, cited a number of archaeologists and cases, presenting his point of view in his usual elegant manner, but never claiming to be infallible.On the contrary, he is the first one to weigh the evidence impartially, even when it comes to papers claiming that the dating results were skewed. As far as I know, the Pope never claims to be infallible as a man, the Church only says he is infallible when he issues an “ex cathedra” document, and that has New Testament support. This of course is valid for anyone who believes it is the 2000 year old Apostolic Church with roots in scripture. Whether individual Catholics believe in papal infallibility or not is another story..","date":"2014-01-21","mins":"7:30 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74034","author":"louis","post":"There are two papers published in “Textile Horizons” by the late John Tyrer on shroud.com and these can be enlightening when it comes to the cotton and the question of cleaning linen for carbon dating..","date":"2014-01-21","mins":"8:09 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-73968","author":"louis","post":"John Tyrer has been forgotten, and the other suggestion is to read what Ian Wilson has to say about contamination in his last Shroud book..","date":"2014-01-21","mins":"2:18 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74268","author":"louis","post":"Nothing useful to say? Are you saying Charles posted rubbish on this site?.","date":"2014-01-23","mins":"2:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74260","author":"louis","post":"Charles, Re # 70 Quote: ‘On April 17, 1988, ten years after the S.Tu.R.P. Project had been initiated, British Museum scientific director Michael Tite published in Nature[26] the “final” protocol: the laboratories at Oxford, Zürich and Tucson would perform the test; they would receive one sample weighing 40 mg., sampled from a single portion of weave; the laboratories would receive two more samples, clearly distinguishable from the original one—a decision calling on the ethical dependability of the laboratories; samples would be delivered to the laboratories’ representatives in Turin; each test would be filmed; there would be no comparison of results (nor communication) between laboratories until the results be certified as definitive, univocal and complete; the proportional counter method would not be used because it required gram quantities rather than milligram quantities of shroud material.’ Cotton aside, just how many of these procedures were followed?.","date":"2014-01-23","mins":"1:59 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74276","author":"louis","post":"I have not seen anything 100% concrete, whether they come from Brits or not..","date":"2014-01-23","mins":"2:45 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74278","author":"louis","post":"I am still waiting for two “concrete” responses..","date":"2014-01-23","mins":"3:28 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-74288","author":"louis","post":"CB: Re read Hugh Farey’s response to Annete Cloutier above, and her acknowedgement that she has been received a courteous, considered and detailed reply. Look and learn all those authenticists who operate by casual insinuation and trumped up charges. Hugh’s responses are a model for us all (myself included). Sorry, I would advise newcomers on the Shroud scene to begin at kindergarten, that is, start reading Ian Wilson’s 1978 Shroud book. As for the responses of the person you mentioned, I have seen plenty of insinuations, however life teaches us that politics makes strange fellows..","date":"2014-01-23","mins":"5:27 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","title":"Cat Among the Pigeons"},{"id":"comment-37755","author":"louis","post":"Max, it seems that the contamination came together with the centuries, but let me know where you have identified the modern contamination..","date":"2013-06-22","mins":"11:27 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37664","author":"louis","post":"The authors who promoted the idea that it is de Molay who appears on the Shroud are not convincing at all and their agenda is not exactly secret. The whole idea is therefore suspect..","date":"2013-06-21","mins":"5:16 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-37669","author":"louis","post":"Between doctors Barbet and Zugibe it is the former who is more convincing, the latter attributed the Jospice Mattress Imprint to bilirubin without producing any similar images to support his claim. As for de Molay, he left Cyprus for France to discuss plans for a new crusade to hit back at the Saracens and this was at the request of Clement VI, in Avignon. No heretic or Grand Master who had to be worshipped as a god would agree with this..","date":"2013-06-21","mins":"5:56 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","title":"Colin Berry:  a hunch – just that – that Rogers may have been used"},{"id":"comment-33431","author":"louis","post":"There is no point in cutting more pieces from the Shroud and Meacham did mention errors in carbon dating in a paper. At least one sample was in the possession of Cardinal Giovanni Saldarini and must be with Archbishop Nosiglia now. But is it worthwhile using such a sample for another CD test if nothing can be said about the source(s) of contamination with certainty and there are many hypotheses about how the 1988 test was skewed? These should be sorted out before proceeding and much will depend on Turin, the authorities there being highly irritated right now with what transpired recently..","date":"2013-05-10","mins":"3:01 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33443","author":"louis","post":"David Goulet is right about non intrusive technology and the possibility of future generations trying to solve the riddle, in fact that was what I heard from more than one prominent Shroud scholar. Regarding ancient cloths, how many have been through everything the Shroud has gone through? Were they, for instance, exposed to smoke from candles and incense in badly ventilated mediaeval churches?.","date":"2013-05-10","mins":"4:48 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33446","author":"louis","post":"The laboratories assume that they can remove contamination easily, but there are different kinds of contamination in the case of the Shroud, so here we have something that is easier said than done..","date":"2013-05-10","mins":"5:01 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33448","author":"louis","post":"My background is not science, but what was meant is that the smoke would have been absorbed by the fibres completely, nothing to do with blackening the Shroud. What would you have to say about the papers written by the late John Tyrer?.","date":"2013-05-10","mins":"6:24 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33522","author":"louis","post":"That point is acceptable, however Rogers seemed to have used extremely little fibre and there are now calls for examinations at the molecular level. The other problem is that no chemical analysis of the sample was made by the laboratories before the carbon dating. Now, more than ever, attention has to be paid to the doubts raised by British Museum scientist Dr. Sheridan Bowman when it comes to contaminated material. Perhaps that was the reason why Dr. Harry Gove did not answer Professor Stephen Mattingly in the end..","date":"2013-05-11","mins":"7:13 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-33527","author":"louis","post":"Right, that includes at least some of the things I’ve said. Now if we reach the molecular level and find what is expected to be seen there, at least by those in the pro authenticity camp, then we can also be sure that Tyrer, Bowman and others were right all along..","date":"2013-05-11","mins":"7:52 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating."},{"id":"comment-107947","author":"louis","post":"Rogers did a good job with the threads, and his hypothesis is still valid, but it must be remembered that both his peer reviewed paper as well as Giulio Fanti’s one on the double image were rejected by Turin. Rogers clearly understood that his image formation was incomplete, and at that point it was taken up by the people “who had an argument with his image hypothesis.” Approaching the issue from the point of view of biblical studies, one does not have to be a scholar like Rudolf Schnackenburg to understand that it is extremely difficult, if not impossible, to get hold of the historical Jesus. Even the liberal Protestant scholar and pastor Helmut Koester has bluntly stated that the “quests”, including the recent ones, have failed. One could say that if the previous quests were demolished by Schweitzer, Koester did the same in his own way by questioning the recent ones. Norman Mailer understood the problem by just reading the New Testament. Jesus hovers over the narratives, the TS image is subtle….. Perhaps this may help..","date":"2014-05-01","mins":"10:46 am","url":"https://shroudstory.com/2014/05/01/comment-promoted-john-klotz-on-how-ray-rogers-gets-critiqued/","cat":"carbon_14_dating","title":"Comment Promoted:  John Klotz on How Ray Rogers Gets Critiqued"},{"id":"comment-108116","author":"louis","post":"John wrote, “His ideas on image formation were incomplete as even he realized.”.","date":"2014-05-01","mins":"2:26 pm","url":"https://shroudstory.com/2014/05/01/comment-promoted-john-klotz-on-how-ray-rogers-gets-critiqued/","cat":"carbon_14_dating","title":"Comment Promoted:  John Klotz on How Ray Rogers Gets Critiqued"},{"id":"comment-108127","author":"louis","post":"It is evident that no dogmatic assertions can be made at this stage. We can talk about both naturalistic and supernatural explanations and much more work will be needed..","date":"2014-05-01","mins":"2:37 pm","url":"https://shroudstory.com/2014/05/01/comment-promoted-john-klotz-on-how-ray-rogers-gets-critiqued/","cat":"carbon_14_dating","title":"Comment Promoted:  John Klotz on How Ray Rogers Gets Critiqued"},{"id":"comment-108161","author":"louis","post":"100% agreed, John. That is exactly how things stand now..","date":"2014-05-01","mins":"3:33 pm","url":"https://shroudstory.com/2014/05/01/comment-promoted-john-klotz-on-how-ray-rogers-gets-critiqued/","cat":"carbon_14_dating","title":"Comment Promoted:  John Klotz on How Ray Rogers Gets Critiqued"},{"id":"comment-28603","author":"louis","post":"Validity apart, both samples were unauthorised..","date":"2013-03-28","mins":"9:21 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","title":"Common Sense for Today"},{"id":"comment-127848","author":"louis","post":"One must wait to see if the conspiracy theory can generate anything other than contagion, even paranoia. There are signs that this is happening and it will not further Shroud studies..","date":"2014-06-08","mins":"7:56 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","title":"Conspiracy Theory Part 4"},{"id":"comment-38118","author":"louis","post":"Colin, I couldn’t find the thread where we touched on the topic of existentialism briefly, but let me tell you that it was in connection with Jesus and the TS. Since this is a TS blog I prefer not to stray very far from discussing the relic. Anyway, when I commented on existentialism it was meant to include everything, not just humans or ants, but even plants and inanimate matter and it looks like that was what you were also referring to. Naturally, it is important — to a certain extent — to learn and be guided by what science can tell us as long as we don’t drift into scientism, that is one of the reasons why I have always had a high regard for Gould. I think that it is religion and not science that is naturally cognitive and even Hawking appears to have recognised that in some way or the other, also becoming a member of the Pontifical Academy of Science..","date":"2013-06-26","mins":"5:51 pm","url":"https://shroudstory.com/2013/06/25/cotton/","cat":"carbon_14_dating","title":"Cotton"},{"id":"comment-125585","author":"louis","post":"Max, I am basing myself on the gospels and the fact that Jesus was executed as a criminal. If it were not for Joseph of Arimathea the body would be dumped in a trench grave. The gospels say that a burial cloth was bought and I presume that “Othonia” refers to the bands. I know about your studies and contentions, but as I said more than once it would be better if you could put it into pdf together with sketches, diagrams etc, whatever you may need to illustrate the text to make it easier to understand..","date":"2014-05-29","mins":"6:09 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-125331","author":"louis","post":"The important thing appears to have been to get the body and whatever contained blood together in as short a time as possible and bury them together with the spices. This was the minimum that had to be done, there was no time for the rest of the conventions, which were left for Sunday morning..","date":"2014-05-28","mins":"5:07 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-125747","author":"louis","post":"Max, there are several points to be tackled. The Babylonian Talmud is dated to the fifth century, not everything it says necessarily applied to the first century. The same book also says that Jesus was a bastard. Is that what you want? Further, whatever it says, Jesus was executed as a criminal, not as a saint. The Sadducees did not believe in the after life, whether the burial cloth was black, white, purple or green would make no difference to them. We can presume that it was white because Joseph bought it, and he did not believe that Jesus was a criminal. Moreover, by handling the body he became ritually clean, unable to go to the Temple, which also signified a break with the Temple leadership. It was a hasty burial, the the body must have been left with the minimum conventions followed, until it could be probably attended to after the Sabbath. According to the late Father Raymond E. Brown, who was a world renowned Biblical scholar, Joseph did not have time to give Jesus a proper burial, which would include washing the body, anointing it with oil and then clothing and wrapping it. The New Jerusalem Bible I use says Joseph “took the body, wrapped it in a clean shroud.” The problem is of course what is meant by “othonia”, but then it was not that important for the authors of the gospels as the risen Christ and, we must not forget, the Greek they used was not Plato’s Greek..","date":"2014-05-30","mins":"1:34 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-125973","author":"louis","post":"Hi Mike Thanks for the comment. We differ little. The strips could have been used to bind either the body, like the chin for instance, or the shroud..","date":"2014-05-31","mins":"5:40 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-126105","author":"louis","post":"Max, it seems that you have not read my previous comment. I am not hiding behind Raymond E. Brown not only because I don’t agree with everything he wrote but also as you may have noted in my comments and articles, I am not one to hide behind anybody. Could you please, here and now, and in a few lines, not in a dozen paragraphs, explain Brown’s exegesis, as you understand it. I am referring to the burial. Jesus was executed as a criminal, his burial is another thing..","date":"2014-06-01","mins":"1:02 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-125983","author":"louis","post":"Max, you seem to have misunderstood what I said although the meaning is clear. 1) I do not think Sadducees buried Jesus, on the contrary I think Joseph was a Pharisee. Were Essenes involved? Certainly not, ritual purity was of paramount importance for them, the Pharisees would look like liberals if we are to make comparisons. 2) The order to execute Jesus came from the Sanhedrin, however it had to be carried out by the Romans because these prohibited Jews from executing anyone. Actually the court members had the Romans execute Jesus because they were afraid of the people, but we know that they also had others, less important people, stoned to death by mobs. 3)We have no other rabbinic sources, but so what? It cannot be taken for granted that what we read in them is absolute truth. Have you consulted Neusner, Schaefer? 4) Raymond E. Brown was a highly respected Biblical scholar. Neither him nor me carved any interpretation on stone. I find no difficulty in agreeing with him when it comes to the haste in Jesus’ burial, that is, when it comes to his contention that there was no time to follow all the conventions like washing, anointment with oil, but nothing beyond that. He made a big mistake when he came to the end of the burial procedures, one that is being echoed today with bad consequences..","date":"2014-05-31","mins":"6:16 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-126154","author":"louis","post":"Max, you are hitting below the belly. That is something I do not like. My style, as you may have seen is blunt, and fair to whoever presents a convincing point of view, not mislead anyone, much on the contrary, backing any assertions with as much evidence as possible. I also dislike exchanges with broken records, with people chanting mantras, so allow me to tell you once and for all: 1) Father Raymond E. Brown was a great biblical scholar, the problem was that occasionally he could stretch his arguments beyond what could be justified. I think you have not read about what he wrote regarding Jesus’ burial, particularly the last stage. 2) There is no evidence that Jesus’ body was “tightly wrapped”, repeat, “tightly wrapped” in the NT. “Bound” can mean be loosely wrapped. It seems you are insisting on this to further your hypothesis 3) Why wrap a dead body so tightly when all of the conventions were not followed and the disciples had to return to do the rest on Sunday? Was there any danger of Jesus body falling apart? Was it cut to pieces?.","date":"2014-06-01","mins":"5:46 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-126173","author":"louis","post":"Max, where is the intellectual dishonesty? Wrapped with spices with strips of linen does not necessarily mean “tightly wrapped”. Why wrap tightly if all the conventions were not followed and the rest had to be done on Sunday?.","date":"2014-06-01","mins":"7:15 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-126818","author":"louis","post":"Max What Greek translation are you using? Are you consulting Nestle Aland? I know we are not taking about facts,we are just speculating. I see no rationale in “compressing, to tightly wrap” if the body had to be unwrapped again for the rest of the rituals like washing, anointing with oil. Obviously I have no time frame, but neither have you. The gospels tell us that the disciples were in a hurry, that’s all: 1) Assuming Joseph of Arimathea was not around, he had to be found and told that Jesus had died 2) Joseph had to go to talk to Pontius Pilate and request the body for a decent burial 3) Pilate had to send centurions to the crucifixion site, who verified that Jesus had died 4) The centurions had to go back to Pilate’s palace 5) Relationship between the Jews and Romans was not easy. Pilate had to be careful, if he made a mistake it would be reported to Rome and he would lose his job. He must have questioned Joseph in order to be convinced that he was doing the right thing, perhaps even drawn out some document to defend himself just in case anything went wrong 6) Nicodemus had to go to buy a burial shroud, or ask someone to buy it for him. People would be be more worried about getting the animals for blood sacrifice, no one would think about burial shrouds, given that it was the eve of Passover. The population of Jerusalem must have swelled, it would not be that easy to move around, perhaps causing more delay in getting hold of a burial cloth 7) Joseph would have then have to go to the crucifxion site with the burial shroud 7) The body would then have to be removed from the cross, wrapped in the burial cloth and taken to the tomb So, philology aside, we can imagine the time it took to remove the body from the cross and lay it in the tomb..","date":"2014-06-04","mins":"2:45 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-126168","author":"louis","post":"Raymond E. Brown has Joseph burying Jesus in a criminal’s tomb. There is no “loosely draped over” in the NT, and given that the disciples had to return on Sunday, they meant “entulisso.”.","date":"2014-06-01","mins":"6:54 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-126830","author":"louis","post":"Max, there are too many details which will need time for analysis and reply. This is a big problem. You have been harping on this issue for such a long time that last year I requested you to prepare a pdf and send it to Dan for uploading or send it to me c/o Dan if you are unwilling to disclose your e mail address.","date":"2014-06-04","mins":"3:44 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-126839","author":"louis","post":"Max, your contentions take a lot more time to answer. See my previous message. If you are not an abstainer have a glass of Napoleon and calm down, I am sipping coffee now and then while working on translations..","date":"2014-06-04","mins":"4:39 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-127375","author":"louis","post":"Sorry Max, don’t teach me about Biblical archaeology, and I think you now why. You keep on posting your thoughts in bits and pieces, refer to papers that are not to be seen, like the one you said was presented in 1998, and now you introduce “archaeoastronomy”. For us to continue, put your papers in pdf in send it to Dan so that he can upload them or send them to me by e mail care of Dan if you do not want to reveal your e mail address. Another alternative is to post them on some Shroud website. OK?.","date":"2014-06-06","mins":"5:08 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","title":"Dissent of the day:  I’ll say one thing for Jones"},{"id":"comment-194059","author":"louis","post":"O.K. See the response to question 13, reference 30 about the Arizona sample: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin My view is that the 1988 results may have been skewed either because of reweaving or contamination. The greatest mystery, however, is image formation, as the interview demonstrates, and that is something that the laboratories cannot explain..","date":"2015-03-22","mins":"5:03 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194200","author":"louis","post":"Hi Giorgio You’re right. Also note what Hugh said above: “However Paolo di Lazzaro makes a valid point that any of these photos may only illuminate surface discrepancies, independent of any deeper interpolation, so that while on the surface it appears that the more the contamination the older the Shroud (to 99.93% reliability), underneath it may be that the more the interweaving the younger the Shroud.”.","date":"2015-03-23","mins":"8:25 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194068","author":"louis","post":"Your’e welcome, O.K. It was just to draw your attention to what was written about the Arizona sample, reference 30. The mystery of image formation continues. Continue with your good work on the images, all of us need to see it..","date":"2015-03-22","mins":"5:28 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194364","author":"louis","post":"You are welcome, David. You may also like an even more recent interview on the highly complex image formation process, demonstrating that painting, scorch, printing and, in my view, the Maillard reaction, can be ruled out: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin Allow me to also tell you something more about what we discussed on another thread: “a distinctive 1st century weave”: I respect both professors Tabor and Gibson, the latter having dismissed both the James ossuary and Jesus family tomb. While the former has apparently ceased to be Christian, the latter is a sceptical and secular Jew. So what happens? The tendency one detects is the one where personal beliefs are imposed on the evidence, and that will simply not work. As a matter of fact, writing on biblical archaeology and bibical studies for quite a long time, one sort of gets used to this. Another very important full page interview with Father Joseph A. Fitzmyer, SJ — who edited and translated the (Aramaic) Tobit texts of Qumran cave 4 — published in a leading daily will hopefully soon be posted online. It will give you an even better idea about what exactly is correct interpretation when it comes to biblical archaeology and studies..","date":"2015-03-25","mins":"9:37 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194359","author":"louis","post":"“A border encompassing a much larger area than we are assuming”: This is claimed in the following recent interview, however we must wait for a paper: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies The protocols drawn by Professor Carlos Chagas of the Pontifical Academy of Sciences in 1988 were discarded by Professor Luigi Gonella, presumably with the permission of his boss, Cardinal Anastasio Ballestrero of Turin, the relic’s papal custodian. The several samples were to be cut from the border, not away from the border. If the suspicion is confirmed, Archbishop Cesare Nosiglia will have another item added to the list that should be presented to him. Any examination, however, will have to be made with Dr. Mechthild Flury Lemberg and another expert to avoid controversy..","date":"2015-03-25","mins":"8:36 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194485","author":"louis","post":"I leave the above also for others to judge: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin.","date":"2015-03-26","mins":"11:12 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-194484","author":"louis","post":"Hugh, I have to disagree. I wouldn’t put Paolo di Lazzaro in a group together with others because his research is completely independent. He has contradicted other Shroud scientists and invited more research. His experiments demonstrate that the image has nothing to do with vapour, painting, Maillard reaction, radiation, photography and scorch..","date":"2015-03-26","mins":"11:11 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","title":"Do the Blue Quad Mosaics tell a different story than we think?"},{"id":"comment-122089","author":"louis","post":"So the “first three Savoy lords” were quietly “sharing major relics” and the Pope did not know about anything? How did this happen? Did they demand secrecy? http://holyshroudguild.org/uploads/2/7/1/7/2717873/was20there20a20link20between20theknightstemplar20and20the20turinshroud20.an20interview20withdr.20barbara20frale.pdf.","date":"2014-05-20","mins":"12:52 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-122109","author":"louis","post":"Newvistas.homestead.com/Media Re Patch.html.","date":"2014-05-20","mins":"1:23 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-122152","author":"louis","post":"John, another message for you, very easy to read and understand: http://www.newadvent.org/cathen/13535a.htm.","date":"2014-05-20","mins":"2:31 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-122222","author":"louis","post":"This is difficult now because it seems that material that had been with Ray Rogers and then with Dr. Alan Adler was sent by the latter’s family to Turin after his death..","date":"2014-05-20","mins":"4:33 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-209775","author":"louis","post":"Of course Hugh has had to defend himself as one of those present in Hampshire, and he adopts the tactic of distorting the whole story. What happened in Hampshire was not ecumenism involving different faiths. I also do not believe that the “music” there would have have sounded pleasant to Pope Francis. If it did he would have to give up his post, throw away his cassock, and perhaps go back to Buenos Aires, where he can dance tango at a club, as a means to forget decades of wasted time. Conviction is not to be confused with fanaticism. As for any new investigation, it will not be in our time, we will all be gone before that..","date":"2015-09-06","mins":"6:39 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209778","author":"louis","post":"The mess continues… in the realm of Shroud studies..","date":"2015-09-06","mins":"7:03 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209885","author":"louis","post":"After the papal states were lost and the anti Catholic and anti papal general Giuseppe Garibaldi did his dirty work those who lived in the Vatican felt as though they were prisoners. The situation was brought to an end with the Lateran Treaty and dictator Benito Mussolini gave the Vatican compensation for what it had lost. At least he had realised that it had to be done. It was he who built the Via della Conciliazione, linking the Vatican and Rome. In 2002, the year they returned to Italy, the Italian royal family had an audience with Pope John Paul II and were received by Cardinal Severino Poletto for a private showing of the Turin Shroud. If I’m not mistaken, Prince Emanuele Filiberto is a member of the Confraternity of the Turin Shroud..","date":"2015-09-08","mins":"9:21 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209837","author":"louis","post":"Hi Giorgio I agree with what you’ve said. As for the rest, about which we discussed yesterday, I’ve got no responses..","date":"2015-09-07","mins":"2:01 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209619","author":"louis","post":"Science is not my field but I’ve noticed that one peer reviewed paper dismisses another peer reviewed paper, which, in turn, can be dismissed by another peer reviewed paper… That’s how it goes it seems. At least we know that “peer reviewed” only means that the paper is worth considering, not that it is gospel truth. It appears that new evidence has been found, supporting not a fifteenth century but a thirteenth century patch, which goes to say that Dr.Mechthild Flury Lemberg did not examine enough, so we might expect something in the near future: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies.","date":"2015-09-04","mins":"6:00 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209726","author":"louis","post":"Professor Luigi Garlaschelli is a member of CICAP, which exists to investigate paranormal phenomena. While there a number of hoaxes produced by charlatans to prove that such phenomena exist, there is genuine paranormal phenomena. The big problem is that to be genuine it has to be spontaneous and cannot therefore be reproduced in a laboratory. Genuine paranormal phenomena appear as though by accident. There are many agendas in the Shroud story. Some want confirmation that Jesus was indeed resurrected in order to help them in their weak (Catholic) faith, others want to demonstrate that the relic is genuine but that a natural process was involved, which is what Ray Rogers appeared to have believed. Then we have a sect claiming that the blood demonstrates that Jesus survived the crucifixon and went to India and there are also secular scholars who want evidence that there is life after death — and so there is more than just this illusory world of material things. The Church is neutral because the relic is not a part of the Deposit of Faith..","date":"2015-09-06","mins":"8:46 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209772","author":"louis","post":"Hi Giorgio Thank God you also have understood. Others too may have understood but prefer to keep quiet because of PR, in order to be on good terms with the “consensus” that is controlling Shroud studies for years. This “consensus” has also allowed rubbish to be published in the realm of Shroud studies, as though thinking that the clerics in Rome and Turin are blind. This is detrimental to Shroud studies. We have to thrash things out openly, minus personal attacks, four letter words and character assassination..","date":"2015-09-06","mins":"6:07 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209738","author":"louis","post":"I sent Dan a suggestion today. There is a difference between paranormal and supranormal phenomena, the latter being a force from beyond acting in our world, relating to the criteria the Church employs in canonisation. C. G. Jung delved into the topic, it was the result of seeing relatives going to Spiritualist sessions, however he was able to make a distinction between what the spiritualists were claiming and paranormal phenomena. On the other hand, Freud, despite his contributions to understanding the mind, limited his research. He accused Jung of “dabbling in occultism” and yet, at the end of his life, he appeared to have thought twice and began to investigate paranormal phenomena himself. We do not know how much he found out as many of his papers are preserved at the Library of Congress, beyond the reach of researchers: https://www.academia.edu/5565370/Historians put Freud on the couch If it is Jesus we see on the Shroud as a burial cloth then it is likely to be a supranormal phenomenon (resurrection). The Courtauld trained agnostic art historian Thomas de Wesselow in fact thinks that both are one and the same thing: https://www.academia.edu/10819998/Book Review The Sign by Thomas de Wesselow The sect that is propounding the belief that Jesus survived the crucifixion and went to India in order to pave the way for the claims of its founder conveniently ignores that the New Testament narratives do not talk about a normal body but a glorious body when it comes to the post Easter appearances. Caravaggio got the point and painted two faces of Jesus in his “Supper at Emmaus”..","date":"2015-09-06","mins":"11:18 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209761","author":"louis","post":"Daveb, Professors Gonella and Chagas did not believe in the authenticity of the Shroud and neither did Cardinal Ballestrero, although he changed his mind after 1988, giving the impression that he had been led into a trap. My feeling is that Pope John Paul II did not take much interest because of his philosophical bent of mind, confirmed by his statement at the Exposition. The message is this: even if the Shroud is authentic it will not answer all our questions. What remains to be answered is in the hands of highly qualified European scholars, and they are working on it. You are one who has clearly understood why Rome has closed the doors. With “Shroudie” presence at the Hampshire convention it is possible that they are now “sealed”. I have often said that the left hand does not know what the right hand is doing in the realm of Shroud studies and it is unjust that “Shroudies” in general will have to pay the price for a blunder committed by a few..","date":"2015-09-06","mins":"4:36 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209776","author":"louis","post":"Thanks, Giorgio. Your comment is in keeping with your approach in Shroud studies, where you have used sound judgement in selecting material and offering views. Keep up the good work!.","date":"2015-09-06","mins":"6:54 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209765","author":"louis","post":"Come on, Joe. Haven’t you seen the news that was announced on this blog quite recently? If you missed it have a look. If you did but didn’t pay attention please do so when you have the time. You studied theology, so your views are welcome..","date":"2015-09-06","mins":"5:18 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209768","author":"louis","post":"Great, any views to offer?.","date":"2015-09-06","mins":"5:35 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209786","author":"louis","post":"This is what the Church wants to see: Andreas Englisch. A sceptical German journalist who regained his faith and wrote a fascinating book on John Paul II: http://andreasenglisch.de/ Peter Seewald Another sceptical German journalist, former editor of “Der Spiegel”, a tough hombre and an ex communist who regained his faith after interviews with Benedict XVI. The pontiff refused to see any questions in advance: http://www.catholicdigest.com/articles/people/q and a/2011/02 28/my meeting with the pope a qa with peter seewald journalist And above all, evidence that there is a power from beyond acting in our world, indirectly saying “Christ is risen”: http://www.cam.org.au/News and Events/News and Events/News/Article/9875/surgeon tells of healed baby crucial miracle for maltas first saint#.Vezqg BF Viko None of the three are “Shroudies”..","date":"2015-09-06","mins":"8:51 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209784","author":"louis","post":"Thanks. There is a small mistake. Cardinal Joseph Ratzinger was the archbishop of Munich and Freising in 1978, he only went to Rome later. I agree that there should be ways to establish bonds of faith. What happened in Hampshire, however, was far from this. It was an attempt by a sect to propound their views about the historical Jesus, which strikes at the very foundation of the Christian faith. Is that ecumenism? Is that how bonds of faith should be promoted? Is this what “Shroudies” want Rome to see? Further, Dan received a private email that he felt obliged to publish and this was followed by nasty comments including attacks on the Christian faith by a member of the sect. I am sure you’ve read most of the Shroud material and know about what has gone in the realm of Shroud studies, not forgetting the message from the Pontiff that was read out by Bishop Kevin Vann of Fort Worth, Texas during the last Shroud conference in Dallas. What has changed after that? The Church knows that many people want to make sure that they are right in their Christian faith by seeing “proof” that the Shroud is authentic. It does not want that kind of approach. What if the Shroud did not exist? As I wrote in a previous comment, the authenticity of the Shroud will not answer all our questions. There is a lot more that will require responses if people are to believe that the monotheism of the Bible is the correct answer..","date":"2015-09-06","mins":"8:14 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-209811","author":"louis","post":"What has not been explained till today is why the sect with its approach was given any attention at all. What they say turns Jesus into a liar and trickster, telling people that he would be resurrected on the third day and then quietly went to Kashmir. The rationale behind the talk is said to be to generate bonds of faith. Really? Why have there been no approaches to synagogues, particularly messianic synagogues, which have been growing in the US, Hindu temples, Sikh gurdwaras,Dawoodi Bohra,Khoja and Ismaili mosques, and so on? Most of these places will have no nasty things to say about Jesus. As far as I know the convention had also to do with the sect’s missionary activity, where Mark Guscin’s research into the Sudarium of Oviedo would be used to reiterate the claim that Jesus survived the crucifixion. Why did “Shroudies” not question the sect’s belief about Jesus,which has absolutely no historical basis? A convincing explanation is needed. Deep inside the move is an obsession with monotheism, which can be dangerous and cause a lot of harm, as Jan Assmann told us. Freud only concentrated on Moses because of his background, ignoring other approaches: https://www.academia.edu/15308857/Freuds incomplete speculation on monotheism As a matter of fact, Hindu cosmology corresponds with what we know about the universe today, which is what Carl Sagan pointed out. His colleague Stephen Jay Gould realised the problem that could be caused for believers in the Bible and proposed: https://www.academia.edu/14727603/Why Stephen Jay Gould proposed the principle of Non overlapping Magisteria Rome was not interested in the 1988 carbon dating, it was forced into the situation. That was what I was told by an authority in the city. The expositions are held because they are part of the tradition, much in the same way that the “Veronica” is shown to the public once a year at Saint Peter’s Basilica. We must not forget that there are millions of Protestants with deep Christian faith, who do not believe in relics, which in fact can be repugnant to them..","date":"2015-09-07","mins":"9:03 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article"},{"id":"comment-208736","author":"louis","post":"Why are the other scientists and “scientists” quiet?.","date":"2015-08-22","mins":"5:08 pm","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Food for Thought: An Important Paper on Radiocarbon Dating"},{"id":"comment-208952","author":"louis","post":"Hello daveb You seem to have misunderstood what I wrote above. To get representative sampling a petition will have to be sent to the Pope, who will ignore it for two reasons: the relic is not a part of the Deposit of Faith and Shroud studies have missed the mark, not to forget the minefield. So there is no point in fuming and fretting. All Christians have to live by faith, not by material supports, which can serve as props for faith depending on whether one believes in them or not. So,basically, we have to believe what is in the New Testament: “Jesus said to him: You believe because you can see me. Blessed are those who have not seen and yet believe”. John 20:29, from the New Jerusalem Bible (editor: Dom Henry Wansbrough, OSB), which is the version I use. I do think that the Shroud is authentic and that the 1988 results may have been skewed. Like Ian Wilson, I also think that it may not be an object suitable for carbon dating. He has provided a number of good reasons in his last Shroud book. But, what happens if for some reason or the other, the fresh sampling you are demanding for carbon dating does not give the desired results for pro authenticists? There will be no “enormous hope for humanity” but despair.Is that what you would like to see?.","date":"2015-08-25","mins":"10:02 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Food for Thought: An Important Paper on Radiocarbon Dating"},{"id":"comment-122138","author":"louis","post":"Hi John Many thanks for posting these comments. I think the R Cs (like you and me) and Rome realise that a mistake had been made in 1204, but what would happened if the relic fell into the hands of the non Christians? Constantinople became Istanbul. Pope John Paul II asked for forgiveness and returned about two relics to Patriarch Bartholomew I, but the Fourth Crusade was actually fought by mercenaries and financed by the Doge of Venice, there were financial interests. Pope Innocent had threatened all those who stole relics with excommunication and the Savoys must have known about that, although they took possession of the TS only much later. Well, God sometimes seems to work in strange ways and Father “Kim” hit the nail on the head..","date":"2014-05-20","mins":"2:03 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","title":"Documented Pieces Removed from the Shroud"},{"id":"comment-208896","author":"louis","post":"Hello daveb and Sampath With the latest developments forget about representative sampling and petitions to the Pope. The Shroud is not part of the Deposit of Faith for the Church, it may be for others..","date":"2015-08-24","mins":"7:37 pm","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Food for Thought: An Important Paper on Radiocarbon Dating"},{"id":"comment-208768","author":"louis","post":"Thanks, Hugh. I had recommended the paper with the intention of demonstrating that radiocarbon dating is not beyond controversy. The comments on this thread have helped to understand that CD is not really an “unsinkable Titanic”. The paper also helps us understand that radiocarbon dating and archaeology do really clash sometimes..","date":"2015-08-23","mins":"8:45 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","title":"Food for Thought: An Important Paper on Radiocarbon Dating"},{"id":"comment-215007","author":"louis","post":"Hey Dan, I spotted this the day before yesterday: November 21, 2015 at 3:43 pm Reply Oxford will stand by the 1988 results, as we have learnt from Professor Christopher Ramsey. It has now opened a centre to study relics and the priest who wrote the report mentioned the Shroud in passing. Of the five relics to be studied, one is certainly a fake. I can vouch for one because my paternal uncle, who was the dean of a medical college, examined it and delivered his report to both Church and State and had it published in the journal of an European academy of sciences: .http://www.catholicherald.co.uk/commentandblogs/2015/11/20/five relics whose stories have gripped the world/.","date":"2015-11-23","mins":"5:14 am","url":"https://shroudstory.com/2015/11/23/fr-matthew-pittam-on-relics/","cat":"carbon_14_dating","title":"Fr. Matthew Pittam on Relics"},{"id":"comment-80670","author":"louis","post":"Both clergymen and scientists are human and make mistakes and the 1988 carbon dating was not conducted as it should have been. That is why the controversy is raging till today. Mistakes made by scientists and published in the best scientific journals are many. Here is an example from this week: http://stapcell.blogspot.com.br/2014/02/image similarity.html.","date":"2014-02-19","mins":"3:57 pm","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin"},{"id":"comment-98368","author":"louis","post":"Who was Jesus married to?.","date":"2014-04-11","mins":"10:41 am","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof."},{"id":"comment-98429","author":"louis","post":"I was waiting for a reply from webmaster Dan to learn who Jesus’ wife was..","date":"2014-04-11","mins":"4:18 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof."},{"id":"comment-98470","author":"louis","post":"Jesus’ appreciation of celibacy can be gauged from his saying on eunuchs, but I am still waiting to learn what exactly Dan was trying to say..","date":"2014-04-11","mins":"7:25 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof."},{"id":"comment-98438","author":"louis","post":"Whatever the views others have posted, I’m still waiting.","date":"2014-04-11","mins":"4:42 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof."},{"id":"comment-28495","author":"louis","post":"Why jump to anti authenticity conclusions without reading the book first? It is obvious that Professor Fanti knows that his reputation is at stake with what he has written. Perhaps Professor Barberis should write the first review, in view of what he recently told La Stampa?.","date":"2013-03-27","mins":"12:14 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-28521","author":"louis","post":"He was doing science to “comfort his unbelief”..","date":"2013-03-27","mins":"4:44 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD"},{"id":"comment-214937","author":"louis","post":"Oxford will stand by the 1988 results, as we have learnt from Professor Christopher Ramsey. It has now opened a centre to study relics and the priest who wrote the report mentioned the Shroud in passing. Of the five relics to be studied, one is certainly a fake. I can vouch for one because my paternal uncle, who was the dean of a medical college, examined it and delivered his report to both Church and State and had it published in the journal of an European academy of sciences: .http://www.catholicherald.co.uk/commentandblogs/2015/11/20/five relics whose stories have gripped the world/.","date":"2015-11-21","mins":"3:43 pm","url":"https://shroudstory.com/2015/11/21/computer-hacking-theory-for-carbon-dating-continues/","cat":"uncategorized","title":"Computer Hacking Theory for Carbon Dating Continues"},{"id":"comment-214943","author":"louis","post":"I wouldn’t be that harsh with them. Professor Ramsey is a practising Christian and is willing to throw the doors of his laboratory open for a fresh round of radiocarbon dating, however he has warned that there should be a consensus when it comes to a hypothesis about why the 1988 results would have been skewed. He is correct. He does not want “Shroudies” to come with other hypotheses if something goes wrong. Not even Turin and Rome seem to believe what Shroud scientists are saying, if we remember what PAS Chancellor Archbishop Marcelo Sánchez Sorondo said last year. A further problem is that the Church has its hands tied:it has learnt from the blunders committed by Cardinal Anastasio Ballestrero..","date":"2015-11-21","mins":"5:04 pm","url":"https://shroudstory.com/2015/11/21/computer-hacking-theory-for-carbon-dating-continues/","cat":"uncategorized","title":"Computer Hacking Theory for Carbon Dating Continues"},{"id":"comment-214948","author":"louis","post":"The biblical scholars and archaeologists based in Israel I have spoken to do not believe in the authenticity of the Shroud, and among these is an eminent Catholic biblical scholar. Archaeologists there tend to believe in the efficacy of carbon dating, two examples being when it was used to date the cloths found in Masada and the wrappings used to cover the Dead Sea Scrolls. Last month I had the opportunity to meet, talk to and interview Professor Israel Finkelstein, Israel’s most prominent and also quite controversial archaeologist. He has never hesitated to rely on C14 for his chronology and even when it goes against many of the things we read in the Old Testament: https://www.academia.edu/18473226/The key role of Biblical Archaeology in Exegesis An interview with Professor Israel Finkelstein If “Shroudies” want to challenge the 1988 results they should change their approach in order to convince Rome and Turin that there should be another test, and perhaps how it should be done..","date":"2015-11-21","mins":"6:29 pm","url":"https://shroudstory.com/2015/11/21/computer-hacking-theory-for-carbon-dating-continues/","cat":"uncategorized","title":"Computer Hacking Theory for Carbon Dating Continues"},{"id":"comment-135489","author":"louis","post":"Dan, I find it difficult to agree with most of what Stephen Jones is saying, however he has the right to say whatever he feels, as long as he knows that posting on your blog is a public statement, as you reminded him. It is for his own good. But perhaps commenters are being unduly harsh with him, there have been even worse allegations before. The sample switching plot gained support in continental Europe. Dr. Michael Tite just kept quiet. How did the Church react? Dr. Tite was invited to the Round Table in Turin by Cardinal Severino Poletto..","date":"2014-07-05","mins":"11:05 am","url":"https://shroudstory.com/2014/07/05/stephen-jones-continues-his-computer-hacking-conspiracy-theory/","cat":"conspiracy_theory","title":"Stephen Jones  Continues his Computer Hacking Conspiracy Theory"},{"id":"comment-124466","author":"louis","post":"It is doubtful that the laboratory at Arizona will take this seriously. Whatever, Stephen Jones should make his own ”calibrations” first, in the second part, to find a suitable role for Gorbachev, not Andropov, who was in power in 1988..","date":"2014-05-25","mins":"10:39 am","url":"https://shroudstory.com/2014/05/24/stephen-jones-the-kgb-allegedly-executed-both-shroud-of-turin-hackers/","cat":"hacking","title":"Stephen Jones: The KGB allegedly executed both Shroud of Turin Hackers"},{"id":"comment-216401","author":"louis","post":"I, and I think, Mario, were the only ones who were knew who exactly was posting as “Joe”. I commented on this earlier..","date":"2015-12-13","mins":"10:51 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216051","author":"louis","post":"So, do you think this is correct? I am asking you because you you have at times taken on the role of judge here. On my part I have not changed my views. See the first three paragraphs: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies.","date":"2015-12-09","mins":"4:17 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216039","author":"louis","post":"“Joe” is YC. He hás the protection of Shroud.com and. Unfortunately, also Dan’s. There are double standards at work hére and I don’t see how what góes on here will be interesting to posterity..","date":"2015-12-09","mins":"3:04 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216127","author":"louis","post":"Jesus said..,.. The secret lies there..","date":"2015-12-10","mins":"9:45 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216380","author":"louis","post":"Joe, have I understood you correctly? Have you given up the patch (invisible reweaving) hypothesis?.","date":"2015-12-13","mins":"8:26 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216388","author":"louis","post":"Thanks, Joe. I queried you because of my article on the research that you and Sue Benford conducted, posted on your homepage and elsewhere. Professor Giulio Fanti mentioned a possible thirteenth century patch in my interview with him, which you must have read. I think dates are important because more than one person seems to have made repairs on the Shroud..","date":"2015-12-13","mins":"9:05 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216426","author":"louis","post":"No examination was made of the chemical composition of the sample..","date":"2015-12-13","mins":"5:22 pm","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216471","author":"louis","post":"That view seems to be some progress. As for gesso, go through the information in the link I provided to Marco Rinaldi yesterday. I went to the V&A while I was researching medieval history in England, but that was to buy some pictures, nothing to do with the Shroud. If I had known about what was to come I would havê sought the opinions of the experts there..","date":"2015-12-14","mins":"7:21 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216473","author":"louis","post":"I know about the three in one herringbone weave textile preserved there. It is silk, made in Turkey. V&A were contacted some years ago and responded without problems initially and then stopped when it came to the TS. Do you havê the transcript of your talk?.","date":"2015-12-14","mins":"8:22 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-216483","author":"louis","post":"Thanks, I will check that..","date":"2015-12-14","mins":"10:53 am","url":"https://shroudstory.com/2015/12/09/important-new-paper-on-the-carbon-dating-samples/","cat":"carbon_14_dating","title":"Important New Paper on the Carbon Dating Samples"},{"id":"comment-76451","author":"louis","post":"What started badly ended badly. That seems to have been the case with the 1988 carbon dating and is the reason for the controversy that is raging till today. Dr. Michael Tite appeared at the round table convened by Cardinal Severino Poletto, so he was at least willing to listen to what people on the other side of the controversy had to say. Another of those present was the French author and Shroud scholar Daniel Raffard de Brienne, then the CIELT president, who came from an aristocratic family, was a descendant of a Duke of Athens, and a highly respected person in France. This is what he had to say in response to questions 5 and 6 in the interview:.","date":"2014-02-04","mins":"8:40 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76467","author":"louis","post":"There is no indication that ancestry is necessarily a qualification for respect in #48, it was just mentioned as part of his bio. De Brienne was a staunch defender of conservative Catholicism and this was on his own initiative, he was not playing the role of Duke of Norfolk in France, some kind of leader of Catholicism in that country. Given his position, he had access to Church authorities and prominent Shroud scholars, from whom he may have derived some of his conclusions, although Iam sure not everyone would agree with what was voiced in France, given what Ian Wilson wrote in the BSTS newsletters when he was the editor. De Brienne wrote a number of books: http://danielraffarddebrienne.hautetfort.com/.","date":"2014-02-04","mins":"9:38 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76771","author":"louis","post":"Charles, there are said to be 3×1 weaves at V&A. Were you able to check this?.","date":"2014-02-05","mins":"12:38 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76791","author":"louis","post":"Charles:Louis,I have not seen them but the V and A references are apparently ’7027 1860′, ’8615 1863′. It seems quite difficult to find out more although you should be able to make an enquiry to the textile department. I got one answer on a completely different topic when one of their staff gave me a list of articles of the medieval textile trade. Charles, Thank you, I did maintain some contact with them around two years ago, however it reached a dead end because my query met with silence..","date":"2014-02-05","mins":"2:51 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76804","author":"louis","post":"As commented months ago, there seems to have been no reason for Jews to not use imported cloth Jews in Roman occupied Palestine as long as there was no “mixing of kinds”. Leviticus 19:19 mentions the prohibition of mixing linen and wool..","date":"2014-02-05","mins":"3:36 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-76812","author":"louis","post":"Given the clashes seen above, I thought it worthwhile posting this link where Pope Francis gives some tips about how to use the internet. Http://www.ilsussidiario.net/News/English Spoken Here/Arts Entertainment/2014/1/25/INTERNET Says Pope Francis Toughen up people /461834/.","date":"2014-02-05","mins":"4:12 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-77076","author":"louis","post":"That’s right, Charles. It becomes clear that a lot more work will be needed in researching textiles..","date":"2014-02-06","mins":"4:39 pm","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-77274","author":"louis","post":"Piero, I think the “tallits”, prayer shawls, were longer in the biblical period, however we do not know if these were made of linen, they at least had to be in keeping with what is in Deuteronomy..","date":"2014-02-07","mins":"11:38 am","url":"https://shroudstory.com/2014/02/02/it-was-a-single-procedural-screw-up-no-other-area-was-sampled-is-that-enough/","cat":"carbon_14_dating","title":"It Was A Single Procedural Screw-Up. No Other Area Was Sampled. Is That Enough?"},{"id":"comment-81261","author":"louis","post":"Jerry Coyne has written for important publications and the trouble is that what he is proposing is metaphysical naturalism. If it is difficult to accept much of Christian philosopher Swinburne’s natural theology, it is even worse when it comes to Coyne. He doesn’t even seem to look before he leaps. Can he disprove that religion is natural and science is not? Even Freud, who dismissed religion as infantile neurosis, did not deny that there was a search for transcendence and it went beyond looking for “comfort in the mother’s womb”. This transcendence is what we could call faith, and faith is part of religion. Lastly, why are scientists like Coyne so worried about the Shroud? Does it make them worry that they will be proved wrong? It looks like it does..","date":"2014-02-21","mins":"7:48 pm","url":"https://shroudstory.com/2014/02/21/jerry-coyne-pounces-on-the-earthquake-hypothesis/","cat":"carbon_14_dating","title":"Jerry Coyne Pounces on the Earthquake Hypothesis"},{"id":"comment-193882","author":"louis","post":"Https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin Hugh, Professor C. Ramsey changed his mind, as is evident in the above interview..","date":"2015-03-20","mins":"1:06 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-193900","author":"louis","post":"I have seen statements by him where he is not optimistic, therefore not even I. Wilson was able to convince him..","date":"2015-03-20","mins":"5:33 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-193906","author":"louis","post":"Quite correct, but even then he is open minded, he is Christian..","date":"2015-03-20","mins":"6:47 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-193901","author":"louis","post":"I disagree with John. How could CNN lose Jesus if they never found Him?.","date":"2015-03-20","mins":"5:35 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-194028","author":"louis","post":"Contamination is a serious problem when it comes to carbon dating the Shroud, it is likely to have skewed the 1988 results and no one can be sure that it can be removed. The problem goes beyond threads and surface contamination. Ian Wilson has provided a number of reasons in his book “The Shroud. The 2000 year old mystery solved”..","date":"2015-03-22","mins":"10:32 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-193943","author":"louis","post":"Rick, if they did find him it would not lead to a documentary. Documentaries generally offer suspense to draw a large audience, fill coffers and the rest..","date":"2015-03-21","mins":"7:16 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-194075","author":"louis","post":"Finding Jesus? One important fact in the life of Jesus: He did not exclude anybody. Pope Francis shows how to do it: http://finance.yahoo.com/video/cheer prisoners popes coming lunch 113918609.html.","date":"2015-03-22","mins":"6:29 pm","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-194375","author":"louis","post":"“Finding Nirvana”: http://www.bbc.com/news/world asia china 32032790 Actually Nirvana in this case means “nothingness”, but who can imagine absolute nothingness? Scientists say that nothing comes from nothing and nothing goes to nothing. Nirvana does not answer the question, Why is there something instead of nothing?.","date":"2015-03-25","mins":"11:05 am","url":"https://shroudstory.com/2015/03/20/john-klotz-delivers-the-knockout/","cat":"carbon_14_dating","title":"John Klotz Delivers the Knockout"},{"id":"comment-178672","author":"louis","post":"David Mo: Não foi feito nenhum exame da composição química da amostra. Os protocolos do Professor Carlos Chagas foram jogados na lixeira e uma única amostra foi tirada. Translation: The chemical composition of the sample was not examined. Professor Carlos Chagas’ protocols were thrown into the waste paper basket and a single sample was taken..","date":"2014-12-23","mins":"9:07 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-178931","author":"louis","post":"David Mo: Each object is a different case. Some years ago,before I began writing on the Shroud, I bumped into “Lindow Man” and photographed it while researching medieval history in England. It had nothing to do with what I was researching but the photograph came in handy when Ian Wilson mentioned that the carbon dating was controversial in a Shroud book, there was a discrepancy of 800 years. Last year I obtained what I suppose is up to date information. You can see the photograph and read something about the dating here: https://www.academia.edu/7893085/The Quest for Jesus in Shroud research Professor Carlos Chagas drew out a well researched protocol. I agree that these were “muito pesados”, but that was a necessity due to the fact that the dating procedure had to be “completo”. The Carmelite monk turned cardinal Anastasio Ballestrero found himself in a situation for which he was not prepared. He was almost a puppet in the hands of the laboratories and changed his mind after the dating was announced. Rome has not accepted the carbon dating,but that, as I wrote earlier, is in one of the three drawers mentioned..","date":"2014-12-24","mins":"10:58 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-178967","author":"louis","post":"The late Daniel Raffard de Brienne, who was President of CIELT, France, was one of the Shroud scholars invited to the Round Table in Turin and we were able to exchange some views about the Shroud after that. He was amused with the fact that some of those in the anti authenticity camp requested another carbon dating test during the discussion. We also dwelt on the attitude of Professor Luigi Gonella, however de Brienne, although disagreeing with his position, refused to attack him because he found him to be a very friendly man. It is not surprising that Professor Gonella was defending his position as late as 2000. Did he have any choice? Perhaps it had something to with face saving, given that he trampled on the well researched protocols of Professor Carlos Chagas, far more qualified than him, and we do not know what went on behind the scenes for him to get his way in 1988. It is doubtful that he needed any “nihil obstat” from “someone higher up in Turin”. The relic is not a part of the “depositum fidei”. If it was, one can be sure that it would be placed on the high altar of Saint Peter’s Basilica. There is some relevant literature to read. It is Ian Wilson’s book “The Shroud. Fresh light on the 2000 year old mystery”. I will suggest pages 123 141, particularly page 140, where he cites a few lines from a paper on the dating of the Shroud in the prestigious “Journal of Research of the National Institute of Standards and Technology” in 2004..","date":"2014-12-24","mins":"2:32 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-179125","author":"louis","post":"Hello David Mo: Pope John Paul II left the question to science, however at the same time the relic is preserved in such a way that it is practically written all over the walls that the 1988 carbon dating results are not considered to be definitive. All attempts to reproduce the image have fallen short of the mark and books saying that it is a medieval production have also not been convincing. The relic is not a part of the deposit of Faith and as I have said more than once, even if it is “proved” to be genuine many questions will remain to be answered. If you read Ian Wilson’s last Shroud book with an open mind you will reach the conclusion that there are no “stories” when it comes to the roles of Cardinal Anastasio Ballestrero and Professor Luigi Gonella. Everything went wrong from beginning to end. If there will be any progress today it will be a different story, for we now have the highly qualified Archbishop Marcelo Sánchez Sorondo as Chancellor of the Pontifical Academy of Sciences. I am not one to believe that science can answer all our questions. Many scientists sometimes do not know what they write, keep on changing their theories or are unwilling to address metaphysical questions because they are unable to do so. You can see clear examples in the introduction to: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ What they do is to mix scientific theories with metaphysics, trying to find an easy way out, but that is scientism, which does not necessarily correspond to reality. There are questions that hardliners in the field of science, whether tackling physics or biology,are unwilling to address. However that is for the next Shroud article…...","date":"2014-12-25","mins":"9:46 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-178178","author":"louis","post":"David Mo: Você leu cuidadosamente o que eu escrevi? Não falei que concordava com o Professor Ramsey em tudo que ele disse. É importante ver antes de saltar. Did you carefully read what I wrote? I never said that I agreed with everything that Professor Ramsey said. It is important to look before leaping..","date":"2014-12-21","mins":"8:43 am","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-178544","author":"louis","post":"David Mo: I agree with Professor Ramsey only about one thing and there is reference to it in the last question of the following interview: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies Ian Wilson and Professor Christopher Ramsey are in different drawers, both are believing Christians but do not share the same views about the Shroud. There is yet another drawer: for the Church. It is clear in the question..","date":"2014-12-22","mins":"7:39 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-178077","author":"louis","post":"Piero There was a message for you on another thread yesterday: “December 19, 2014 at 7:03 pm Reply Piero, you refuse to pick up the gauntlet. Why is that so? Can you answer my question? If not, then please put an end to this rubbish about the dye. What you must do is to provide convincing arguments about why the dye had something to do with the partial head image seen on the Jospice Mattress. If you do that I will withdraw my paper. Here it is again: https://www.academia.edu/4691379/Can the Jospice Mattress imprint be compared to the Image on the Shroud Look at the partial head image carefully and ponder about about what Father Francis O’Leary had to say.”.","date":"2014-12-20","mins":"8:36 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-177858","author":"louis","post":"PHPL; Patrick, there are many hypotheses to explain why the carbon dating results were skewed and this is what complicates the matter. I am inclined to agree with Ian Wilson, Professor Christopher Ramsey and can also understand why the Church is cautious. See the last question in the following interview: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies.","date":"2014-12-19","mins":"6:54 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-178541","author":"louis","post":"Piero, please read the paper carefully as well as see what Father Francis O’Leary called the “face” and which I prefer to refer to as a partial head image. If you cannot do that then you are not being objective..","date":"2014-12-22","mins":"7:21 pm","url":"https://shroudstory.com/2014/12/19/just-published-what-went-wrong-with-the-radiocarbon-date/","cat":"carbon_14_dating","title":"Just Published:  What Went Wrong with the Radiocarbon Date?"},{"id":"comment-28946","author":"louis","post":"Michael Grybowski has given a balanced report because he received correct information and therefore stressed peer review and flaws in the1988 carbon dating. But there is a lot more than just laboratory contamination involved and fresh carbon dating may not deliver correct results..","date":"2013-03-31","mins":"10:20 am","url":"https://shroudstory.com/2013/03/31/lets-just-say-i-am-taking-my-time/","cat":"carbon_14_dating","title":"Let’s just say I am taking my time . . ."},{"id":"comment-21442","author":"louis","post":"Mr. Stielau posted stale news. As for Dr. Christopher Ramsey, he is willing to entertain proposals for a new CD test but at the rates things are going in the realm of Shroud studies where there are many hypotheses and no agreement about what exactly went wrong it is difficult to proceed. It also looks that Mr. Steilau is not aware that Dr. Michael Tite was present at the Round Table convened by Cardinal Severino Poletto. Remember: if a piece of the TS is subjected to C14 again and no 1st century date is obtained no attention will be paid to pleas for yet another test..","date":"2013-01-01","mins":"7:47 pm","url":"https://shroudstory.com/2013/01/01/liar-please-abandon-this-foolishness/","cat":"carbon_14_dating","title":"Liar, please abandon this foolishness"},{"id":"comment-197285","author":"louis","post":"The damage was done with the dirtiest site of the Shroud chosen for cutting the sample. There should be direct examination of the Shroud fibres,preferably near the site from where this sample was cut..","date":"2015-04-23","mins":"6:31 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-197586","author":"louis","post":"Hi Angel I was told that Thymol contamination was detected on the Shroud some three years ago. Contamination is indeed a serious problem and I agree with Ian Wilson that this is a major hurdle when it comes to radiocarbon dating..","date":"2015-04-25","mins":"7:02 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-197278","author":"louis","post":"Not necessarily. Who said the Resurrection involved radiation?.","date":"2015-04-23","mins":"5:58 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","title":"Look at what happened between 1988 and 2015"},{"id":"comment-194396","author":"louis","post":"This “physics of miracles” story was proposed by Eberhard Lindner around fifteen to twenty years ago. I am inclined to agree with I.Wilson that “radiocarbon dating has had far too stifling an influence on the subject for far too long already.” I am therefore working on the bloodstains, another lead that may lead to something more concrete, and hope to have an article online in the next few days..","date":"2015-03-25","mins":"2:24 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194636","author":"louis","post":"See how much could have been avoided if an examination was made of the chemical composition of the Shroud? The sample was cut from the dirtiest site of the relic..","date":"2015-03-27","mins":"5:12 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195197","author":"louis","post":"Hugh, why do you think Professor Giovanni Riggi, who cut the 1988 sample, state that “fibres of other origins had become mixed up with the original fabric”? See “Shroud Studies bring Good News” in the following link: newvistas.homestead.com/Media Re Patch.htmlhttp://newvistas.homestead.com/Media Re Patch.html.","date":"2015-04-02","mins":"11:14 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195213","author":"louis","post":"Perhaps something to add in CNN and “Finding Jesus”: “Foxes have dens and birds have their nests, but the Son of Man has no place to lay his head.” Matthew, 8: 20 http://www.npr.org/2014/04/13/302019921/statue of a homeless jesus startles a wealthy community.","date":"2015-04-02","mins":"6:26 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195263","author":"louis","post":"Good morning,Hugh You have not exactly responded to my query asking you to read the newvistas.homestead. Com link above and comment. There is a problem there with the fibres. Why didn’t Professor Riggi just remove the fibres? Why did he cut another piece from the sample he had already taken? As I have pointed out more than once, the sample was taken from the dirtiest site on the relic and no examination was made of its chemical composition. I don’t think anyone really examined the site carefully before 1988..","date":"2015-04-03","mins":"7:42 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195200","author":"louis","post":"You can try again: http://newvistas.homestead.com/Media Re Patch.html The problem is that many people were handling this site of the relic — for centuries. I keep an open mind about the hypothesis of why the 1988 radiocarbon dating results may have been skewed. In my view it is either contamination or reweaving, or both..","date":"2015-04-02","mins":"12:08 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195283","author":"louis","post":"Thanks, Hugh. You know something? That site from where the sample was cut can say so many things. You have only mentioned surface, but what about the rest? What if the reweaving was invisible? Professor C. Ramsey has stated that any fresh radiocarbon dating would be preceded by cleaning to remove contamination but that is something even Ian Wilson will doubt. I, at least, am one to agree with what he wrote in his last Shroud book..","date":"2015-04-03","mins":"11:26 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-195290","author":"louis","post":"There can be no doubt that Dr. Mechthild Flury Lemberg, a member of the Lutheran Church, is a very serious professional. However there is also no record demonstrating that the Hamburg born expert, residing in Switzerland, ever used Swiss made Carl Zeiss equipment to examine the site from where the sample was cut in 1988..","date":"2015-04-03","mins":"12:30 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192502","author":"louis","post":"Mark Goodacre is a respected biblical scholar. He has pointed out where exactly sensationalists and their books have made bad mistakes in attacking the NT narratives and how they try to get away by distorting archaeological findings. But please don’t expect biblical scholars to have the time to read the extensive literature — scientific and historical — on the Shroud. Their field is full of heated controversy about the Bible. The 1988 mess was mainly the fault of the Church, specifically, Turin. What started in the wrong direction lead to bad results, the object of heated discussions till today. My next Shroud article will be online next week, dwelling on the image formation process and a bit of what could be done about solving the dating problem. The clergymen have their hands tied..","date":"2015-03-05","mins":"9:31 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192522","author":"louis","post":"Directed to Julian: He was asked about it and that was his opinion, Juilan. More needs to be done to convince some people that the 1988 exercise was a fiasco..","date":"2015-03-05","mins":"12:07 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193345","author":"louis","post":"Everything went wrong in 1988, from beginning to end. It must be emphasised that no examination of the chemical composition of the sample was made. The dating is not the last word on the topic: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin.","date":"2015-03-14","mins":"7:11 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-192541","author":"louis","post":"Directed to Julian: I have seen biblical scholars and archaeologists, both in and out of Israel and far more important, rejecting the Shroud, Julian. I did speak to them, they are highly qualified, only they do not have the time to read the extensive literature on the Shroud. In one case I showed an image of the Justinian solidi to one scholar.He liked it and read what I had written in favour of the relic’s authenticity, but just kept quiet. There were very important things for him to write about, time was short for him. There is another thing I would like to point out. Even if the relic is “proved” to be authentic it will still leave many questions unanswered, a new understanding of the Bible will be necessary. See the introduction to https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ The so called Jesus family tomb gained far more attention from academics. Some, but not all, were more inclined to believe that Jesus was buried in Talpiot, but of course not wrapped in the Turin Shroud: https://www.academia.edu/7471223/Jesus was not buried in Talpiot   Part III Stay tuned, you will see something about the debate on the image formation process and why the Church appears to be hesitant to move in an article that will be online next week..","date":"2015-03-05","mins":"1:51 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193148","author":"louis","post":"It is not easy to dismiss the Manoppello veil as a painting and the glass is an impediment when it comes to further research. Two scientists who studied the image closely with equipment said that the cloth is linen, not byssus. There is at least one site where there is paint, so perhaps someone thought that adding some colour in one or two regions would make the image look better. We will have to wait for more research..","date":"2015-03-11","mins":"5:37 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193157","author":"louis","post":"It seems that the paper co authored with Jaworski was followed some years later by the statement about linen. I did interview Father Heinrich Pfeiffer, SJ on the topic and he also mentioned the body/shroud/veil, but have not read Badde’s book. I also do not know if Chiara Vigo, who identified the cloth as byssus, has been a major influence. All I can say know is that more research is needed. Curiously, there seems to be something in common with the Guadalupe image. In this case American scientist Dr. Phil Callahan was of the opinion that we would have to wait till what humans painted over the image turns into flakes. It is also considered to be an acheiropoietos image and I know that the Knights of Columbus published some material about it last year..","date":"2015-03-11","mins":"7:41 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193153","author":"louis","post":"Hi Kelly Both Giulio Fanti and Paolo Di Lazzaro identified the cloth as linen. Although he does not talk about this in the interview posted yesterday: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin but on the image formation process my guess is that more work will be needed. No, Dan did not forward anything to me, but some other Shroudies also have my e mail. I will be working on another Shroud article shortly and will need your help..","date":"2015-03-11","mins":"6:34 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193233","author":"louis","post":"Hi O.K. Thanks for the remarks. I do not know if de Wesselow has made a complete study of the image and do feel that more research is needed. The problem is that the Church moves very slowly at times and there are many relics that are worthwhile studying by means of close examination with adequate equipment. From one Shroud scholar whose name I cannot reveal I learnt that his request to study one relic was turned down and the sad part is that he has the qualifications. I appreciate all the excellent work you have been doing with the images and did see the site you refer to. It does indeed have some good information. There is one problem that Kelly mentioned and I myself had noted years ago during an interview with Father H. Pfeiffer. It is the order: body/shroud/veil. The Manoppello veil does not exactly show signs of a crucfixion victim. I guess you will get my point..","date":"2015-03-12","mins":"5:04 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193230","author":"louis","post":"There are things that those in the realm of Shroud studies should not forget: Why blame Professor Goodacre when even Ian Wilson, foremost Shroud scholar, states in his book that no scientist has been able to convincingly challenge the 1988 carbon dating results? Further, in his address at the Saint Louis Shroud conference Bishop Michael Sheridan pointed out that more studies are under way and I have been criticised for stating that the Church has its hands tied. See the last Q/A: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin I would like to know what exactly the solution is..","date":"2015-03-12","mins":"4:38 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193245","author":"louis","post":"Hi Kelly If you wish to contact me it can be via lcdf72@gmail.com.","date":"2015-03-12","mins":"6:00 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-193238","author":"louis","post":"Directed to Sampath Fernando: Sampath, there is nothing to thank me for, I’m just doing some work. As an environmental engineer perhaps you get into a time machine and try to find out what the environmental conditions were like in Jerusalem in AD 33..","date":"2015-03-12","mins":"5:20 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194356","author":"louis","post":"One of the biggest mistakes committed in 1988: no examination was made of the chemical composition of the samples. So, we see the results till today…being discussed on this blog and elsewhere..","date":"2015-03-25","mins":"8:09 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194371","author":"louis","post":"I was specifically referring to the cleaning process, which he said was impossible in some cases. What about Ian Wilson’s views?.","date":"2015-03-25","mins":"10:27 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194362","author":"louis","post":"Hugh, you must have read John Tyrer’s papers. There is more in Ian Wilson’s “The Shroud. The 2000 year old mystery solved.”.","date":"2015-03-25","mins":"9:10 am","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194383","author":"louis","post":"Patrick The late John Tyrer, of Manchester, England, was an expert in textiles. Carbon dating on the whole is worthy of credit, however there are cases where it simply does not apply easily. Read what a scientist in the field of physics had to say: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin Another big problem is that there are several hypotheses about how the 1988 results may have been skewed and this will have to be sorted before requesting Oxford or some other laboratory to try again. Professor Christopher Ramsey had something to say about this: https://www.academia.edu/7893085/The Quest for Jesus in Shroud research..","date":"2015-03-25","mins":"12:12 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-194386","author":"louis","post":"Thank you,Hugh. I really don’t know what experiments John Tyrer may have made and wonder why he had to say 900º. Now let us go to Ian Wilson and to his book “The Shroud. The 2000 year old mystery solved” which you must have read. What would you have to say about the cases of textile contamination he mentions?.","date":"2015-03-25","mins":"12:47 pm","url":"https://shroudstory.com/2015/03/05/mark-goodacre-answers-carbon-dating-questions-on-cnn-website/","cat":"carbon_14_dating","title":"Mark Goodacre Answers  Carbon Dating Questions on CNN Website"},{"id":"comment-28733","author":"louis","post":"All this had the approval of Cardinal Anastasio Ballestrero, OCD the relic’s papal custodian, who was apparently influenced by “Carmelite spirituality,” where there are no “material supports.” The prelate — at least then — was just as sceptical about the Shroud’s authenticity as the scientists. It looks like whether just one or seven pieces were cut for the dating would make no difference to them, so they took what was given..","date":"2013-03-29","mins":"2:24 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","title":"Of provenance, chain of custody, proper care and suitability of samples"},{"id":"comment-48607","author":"louis","post":"The belief that Jesus imprinted his likeness on cloth is ancient, it is part of the Orthodox Church’s liturgy. Go to the link: http://www.orthodoxoutreach.net/icons/iconhistory.html.","date":"2013-10-24","mins":"9:05 am","url":"https://shroudstory.com/2013/10/24/meanwhile-part-2-works-for-me/","cat":"carbon_14_dating","title":"Meanwhile, Part 2:  “Works for Me”"},{"id":"comment-28729","author":"louis","post":"It was Riggi who decided about the cutting of the sample, and together with Gonella, made a big mess. The scientists took what was given to them. Curiously Riggi is said to have been known for “rigorous methodology”, BSTS Newsletter, 67..","date":"2013-03-29","mins":"1:52 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","title":"Of provenance, chain of custody, proper care and suitability of samples"},{"id":"comment-50089","author":"louis","post":"It is wise to advise caution when it comes to another round of carbon dating at this time, and Thymol is only one of the reasons..","date":"2013-11-05","mins":"5:02 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-50091","author":"louis","post":"That is not applicable when it comes to the Turin Shroud..","date":"2013-11-05","mins":"5:33 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-50102","author":"louis","post":"Colin, how many Turin Shrouds are there in the world? The going got rough at the other end with everything, from A to Z, going wrong: from the mess made by scientists Professors Luigi Gonella and Giovanni Riggi (look from where he took the sample!) till the announcement, with that significant exclamation mark after the dates written on the blackboard. It is important to stress that Dr. Michael Tite attended the Round Table convened by Cardinal Severino Poletto and Professor Christopher Ramsey keeps an open mind and is a practicing Christian while believing that the 1988 CD results were correct. On my part, I see no need to press the case for authenticity simply because my faith does not depend on relics and even the Church has left the question of authenticity to science. How often have I stated on this blog that even if the TS is proved to be authentic it will still not answer many questions!.","date":"2013-11-05","mins":"6:15 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-50106","author":"louis","post":"Colin, I may not agree with each and every view of the Shroudies you have attacked but I also do not question their seriousness and surely that is the approach of blogmaster Dan? That is obviously the reason why your views as a scientist are welcome here, but, once again, as long as there are no personal attacks, which only serve to bring emotions to boiling points that are not conducive to fruitful discussion. To be fair, that has to apply to everyone posting comments here, so you can calm down, have a glass of Scotch(?) and be prepared for another round of entertaining discussion tomorrow..","date":"2013-11-05","mins":"7:28 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-50193","author":"louis","post":"Colin,many of the oldtimers in the realm of Shroud studies have presented a balanced point of view, aware, one presumes, that there is no point in being one track minded. As commented yesterday, even if the TS is “proved” to be the genuine article it will still not answer many questions, many of which are still to be addressed..","date":"2013-11-06","mins":"11:14 am","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-50218","author":"louis","post":"Colin, one has to be as relaxed and sanguine as possible when discussing the TS, where there are passions on both sides. Blowing our tops only impedes one from thinking clearly..","date":"2013-11-06","mins":"4:24 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-50170","author":"louis","post":"Colin, I agree to the extent that Taleban mind control would apply here only if the TS is being used to determine if Christian faith is fact or fiction..","date":"2013-11-06","mins":"7:55 am","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-50096","author":"louis","post":"Sinn Fein: Who really were the terrorists? Were they the descendants of people Oliver Cromwell imposed on Ireland? Martin Mc Guiness was fighting the terrorist group called Ulster Defence Association..","date":"2013-11-05","mins":"5:51 pm","url":"https://shroudstory.com/2013/11/05/overheard-behind-us-during-barries-talk-thats-only-listerine/","cat":"carbon_14_dating","title":"Overheard behind us during Barrie’s Talk: “That’s only Listerine”"},{"id":"comment-25151","author":"louis","post":"This is stale news again and the problem is that Gazay does not seem to be available for contact..","date":"2013-02-21","mins":"9:31 am","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights"},{"id":"comment-25206","author":"louis","post":"Thanks for the tip, David. It is useful because the link has been brought up to date. Around seven years ago attempts were made to contact François Gazay with the help of Serge Mouraviev but there was no success. This lead has been lying dormant for quite a while, so perhaps fellow Shroudies in France can help?.","date":"2013-02-21","mins":"6:49 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights"},{"id":"comment-33827","author":"louis","post":"Personal attacks do not help further the cause of the Shroud or pro authenticity Shroudies. Much on the contrary, it is probably one of the causes why both Rome and Turin have sort of distanced themselves from the realm of studies, ignoring all the pleas. Does it have to be repeated again and again that the message sent by Benedict XVI to the last Dallas Conference also had also something to do with this? It is foolish to think that this blog is not being monitored.Rogers presented a viable hypothesis, which should be taken seriously, but it is one among many hypotheses and nothing has been “proved” so far..","date":"2013-05-16","mins":"7:50 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might."},{"id":"comment-33811","author":"louis","post":"Scientists in the pro authenticity camp have openly requested that samples be taken from extra sampling sites. Now whether that is worthwhile is controversial because carbon dating simply does not have the infallibility imparted to it. There are Shroud books with a more balanced approach where issues relating to carbon dating are clearly explained..","date":"2013-05-16","mins":"6:36 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might."},{"id":"comment-82002","author":"louis","post":"No comparison can be made, the objects are different, and the preservation even more different..","date":"2014-02-24","mins":"10:13 am","url":"https://shroudstory.com/2014/02/24/paper-chase-radiocarbon-dating-of-scrolls-and-linen-fragments-from-the-judean-desert/","cat":"carbon_14_dating","title":"Paper Chase:  Radiocarbon Dating of Scrolls and Linen Fragments from the Judean Desert"},{"id":"comment-82471","author":"louis","post":"But that does not mean any comparison can be made with Shroud dating..","date":"2014-02-25","mins":"5:52 pm","url":"https://shroudstory.com/2014/02/24/paper-chase-radiocarbon-dating-of-scrolls-and-linen-fragments-from-the-judean-desert/","cat":"carbon_14_dating","title":"Paper Chase:  Radiocarbon Dating of Scrolls and Linen Fragments from the Judean Desert"},{"id":"comment-172666","author":"louis","post":"It was an extremely pleasant experience to have exchanged views with the late Daniel Raffard de Brienne, president of CIELT. A descendant of John de Brienne, King of Jerusalem (1170 1237) as well as of Walter VI de Brienne, Duke of Athens. He was always very polite and straightforward in his approach. My only difference with him was when he dismissed any link between the Knights Templar and the Shroud. Unfortunately, he was unjustly accused of being biased in his approach, being a descendant of a Duke of Athens, however his hypothesis included also Otho de la Roche, so there was no far fetched claim at all. He was one of the few Shroud scholars invited by Cardinal Severino Poletto to the Round Table in Turin and took part in the debates. What he said about the handling of the 1988 samples — sizes and weights — left me a bit perplexed. Now it makes a lot more sense with Dan’s post: https://www.academia.edu/9156258/Shroud Studies in France.","date":"2014-11-23","mins":"8:10 am","url":"https://shroudstory.com/2014/11/23/paper-chase-the-shroud-of-turin-and-its-radiodating/","cat":"carbon_14_dating","title":"Paper Chase:  The Shroud of Turin and its Radiodating"},{"id":"comment-172737","author":"louis","post":"I am wondering what Hugh means by “fairly abstruse measurements” and what exactly he is referring to. An entry in Stephen Jones’ blog says “The thickness of the cloth is about one third of a millimetre[12] (0.345 mm [13]), slightly thicker than shirt cloth[14], and its weight is approximately 2.45 kgs (about 5½ lbs)[15].” and he refers to a book by J C. Iannone. Dr.Michael Tite was also present at the Round Table in Turin referred to in my previous comment above and, from what I know, a lot of things,including the weights and sizes of the samples, were also discussed. By then, it was known that an examination of the chemical composition of the Shroud samples was not made and the Belgian scientist Remi van Haelst had already published his paper. Daniel Raffard de Brienne was amused when he heard a request for a rerun coming from the non “Shroudie”, anti authenticity camp..","date":"2014-11-23","mins":"7:51 pm","url":"https://shroudstory.com/2014/11/23/paper-chase-the-shroud-of-turin-and-its-radiodating/","cat":"carbon_14_dating","title":"Paper Chase:  The Shroud of Turin and its Radiodating"},{"id":"comment-81442","author":"louis","post":"The first paragraph by Hugh above summarises the problems in the controversy very well. We should only pay attention to whatever is worthwhile reading..","date":"2014-02-22","mins":"1:13 pm","url":"https://shroudstory.com/2014/02/22/part-3-is-up-did-stephen-jones-make-the-case/","cat":"carbon_14_dating","title":"Part 3  is up:  Did Stephen Jones make the case?"},{"id":"comment-79688","author":"louis","post":"Yannick, can’t you stop resorting to personal attacks? I said take it easy, we will see more image formation hypotheses this year and not along the lines Rogers proposed..","date":"2014-02-15","mins":"9:27 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","title":"Piezonuclear What?"},{"id":"comment-79798","author":"louis","post":"Sorry, Yannick, if this is a bait I have not swallowed it. I did not think anything, it is the scientists who are thinking, and as there are ethical standards to follow, their views or findings will only be revealed at the correct time. But, of course, I am inclined to prompt so that the scientific thinking moves forward..","date":"2014-02-16","mins":"10:18 am","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","title":"Piezonuclear What?"},{"id":"comment-79821","author":"louis","post":"Professor Giulio Fanti is a serious scientist and a respectable person and I repudiate the insinuations that he is having a good time with the funds, something like saying he is filling his belly with campari and spaghetti alla carbonara, and I am not the only person who has objected to the personal attacks directed at him in this blog. If he obtained the funds from the university it is because they approved his projects and they know what kind of person he is and, as I wrote earlier, his research has also gone beyond the Turin Shroud, but involves topics that are related to the relic, however the material is vast and it takes a lot of time to prepare the results. I think that Dr. Rogers was also a serious scientist and knew what he was doing, and only take exception to a paper he wrote involving evolution, where he implied that it was a automatic process, failing to explain where the rationality came from..","date":"2014-02-16","mins":"12:52 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","title":"Piezonuclear What?"},{"id":"comment-79646","author":"louis","post":"Yannick, did Ray Rogers get his fibres directly from the Church?.","date":"2014-02-15","mins":"6:10 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","title":"Piezonuclear What?"},{"id":"comment-79652","author":"louis","post":"And did Gonella have the Church’s permission?.","date":"2014-02-15","mins":"6:27 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","title":"Piezonuclear What?"},{"id":"comment-79658","author":"louis","post":"Yannick, so, you see, Rogers and Fanti obtained their fibres in the same way. Many of your comments and papers are good, however you will lose your standing if you resort to personal attacks. Professor Giulio Fanti is not in for money, he is a very serious scientist and his research has gone beyond the Turin Shroud, involves a lot of hard work, material, travelling and so on. If Ray Rogers did the same amount of research he would also need money. The fruits of Professor Fanti’s research will be known after his papers are ready..","date":"2014-02-15","mins":"7:06 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","title":"Piezonuclear What?"},{"id":"comment-79669","author":"louis","post":"Yannick, it is one scientist contesting another scientist, but that is part of science isn’t it? Professor Fanti has still not published much of his research and we still have a long way to go when it comes to image formation. If part of Fanti’s research was contested by Turin so was Rogers’ paper. The paper by Fanti and Maggiolo was contested only verbally by one of the scientists linked to Turin and not only no paper was published, the microphotographs were not made available. Take it easy, you can write down what I’m saying today, 15th February, 2014, we Shroudies will have more news regarding image formation this year, and it will not be along the lines of what Rogers thought..","date":"2014-02-15","mins":"8:05 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","title":"Piezonuclear What?"},{"id":"comment-48223","author":"louis","post":"The answer is in the Gospels: Jesus was not bothered about the material world..","date":"2013-10-21","mins":"8:08 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-48222","author":"louis","post":"Christianity is disappearing in Australia, but that does not mean that there are no large numbers of practicing Christians and Christian journalists in other countries. The exclamation mark meant that the laboratories knew they would meet opposition, and it could also indicate that they themselves were not really sure about the results. The big problem was the donation Oxford received, which led people to say that they got the impression that the results were made to order..","date":"2013-10-21","mins":"8:05 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-48468","author":"louis","post":"Physicists are more open to dialogue, but that is not the case with biologists. When it comes to evolutionary biologists, like those whom Gould called “Darwinian fundamentalists”, the situation is far worse..","date":"2013-10-22","mins":"8:52 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-48310","author":"louis","post":"Turning water into wine or feeding 5000 was not a primary concern, the occasions just arose there. It is evident in the gospels that Jesus knew that it was very difficult for people to do away with material concerns, some could go half the way, others the full way, with just a staff as material possession..","date":"2013-10-21","mins":"7:32 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","title":"Quote for Today: Stephen Jones on journalists and their readers"},{"id":"comment-60826","author":"louis","post":"This is more ammunition for the pro authenticity camp, whose arsenal is always open. Dr. Alan Adler knew he could not blame Turin and presume he had the clerics in mind. The mess in Turin began with Professor Luigi Gonella, who did away with the protocols, and Professor Giovanni Riggi, who took just one sample and from the wrong site. Dr. Adler must have noticed that the representatives of the C 14 labs kept quiet while Professors Gonella and Riggi were arguing — for some two hours it seems — about from where the sample had to be taken. What was the reason for this?.","date":"2013-12-17","mins":"8:25 am","url":"https://shroudstory.com/2013/12/17/quote-of-the-year-al-adler-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Quote of the Year:  Al Adler on the Carbon Dating of the Shroud of Turin"},{"id":"comment-28957","author":"louis","post":"John, it is good that you added a serious note because we are talking about serious matters, matters that can influence people and affect their lives, even unconsciously. First of all, it seems that the Shroud is a secondary matter for the Church because it does not want the faithful to base their faith only on relics. What if there was no Turin Shroud? There is a lot more in the box and I am sure this is something blogmaster Dan will agree with ( see his post on PZ Myers). For more, have a look at what New York Cardinal Timothy Dolan told ABC News’ George Stephanopoulos today, expressing opinions that were voiced more than a decade ago by the late Cardinal George Basil Hume, Archbishop of Westminster. It has also been good to read that collinsberry is being taken seriously when he objects to personal attacks,character assassination and dogmatic statements expressed arrogantly, which are not at all conducive to good discussions..","date":"2013-03-31","mins":"12:49 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","title":"Res ipsa loquitur:  The facts speak for themselves."},{"id":"comment-28967","author":"louis","post":"That is going off the track, the discussion is about the Shroud..","date":"2013-03-31","mins":"2:28 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","title":"Res ipsa loquitur:  The facts speak for themselves."},{"id":"comment-28962","author":"louis","post":"Not even a thinker as deep as Pope John Paul II believed that the Shroud could offer a counter thrust. One has to read what he said when he went to the Shroud exposition in 2000..","date":"2013-03-31","mins":"1:44 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","title":"Res ipsa loquitur:  The facts speak for themselves."},{"id":"comment-29221","author":"louis","post":"Piero, more or less a philosopher and sociologist? If the authenticity of the TS can answer all questions the Church would concentrate all its efforts on researching the relic and, perhaps, think about closing down the Pontifical Academy of Science. I cannot answer the other questions you have raised because my field is not science, but I do not question the validity of the points you have raised nor the need for answers..","date":"2013-04-03","mins":"11:29 am","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","title":"Res ipsa loquitur:  The facts speak for themselves."},{"id":"comment-29231","author":"louis","post":"Piero, There can be no doubt that another door has been opened, it is the question of peer review and the archbishop’s comments that have also to be addressed. No, no time was devoted to Cahors, though one article by Babinet (on the TS and the Knights Templar) was read and it was good. More attention has been devoted to incorruption, where more concrete information can be available, however the study is incomplete. Best..","date":"2013-04-03","mins":"12:54 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","title":"Res ipsa loquitur:  The facts speak for themselves."},{"id":"comment-28947","author":"louis","post":"Matthias (#4) has given the best suggestion, but it must not be forgotten that Saldarini, Poletto and, now, Nosiglia made it clear that they were having headaches with what was going on,so who are the scientists to whom they can give the authorised threads?.","date":"2013-03-31","mins":"11:19 am","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","title":"Res ipsa loquitur:  The facts speak for themselves."},{"id":"comment-79566","author":"louis","post":"#¨6 What is meant by “original body of Jesus”? Were there copies? If the “original body” is in the Vatican, there would be no Church and also no Vatican..","date":"2014-02-15","mins":"9:14 am","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Richard Dawkins on the Shroud of Turin"},{"id":"comment-108048","author":"louis","post":"Daveb, many thanks for the encouragement. You are an experienced civil engineer, dealing with “exact sciences”, and I take your work on the statistics seriously. But let me tell you that it will not help in this case, it is not me but the experts who have demolished the results. That, obviously, is the reason why Feuerverger disappeared from the scene, he seems to have cooperated with Jacobovici to distort the results, so wait and see. The pdf should be ready today, but probably available only tomorrow..","date":"2014-05-01","mins":"12:50 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-108052","author":"louis","post":"You’re welcome, Chesterbell. The quest is for the truth and the pdf should be ready today..","date":"2014-05-01","mins":"12:52 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-108135","author":"louis","post":"No need to thank me for anything. All I can say now that there is a is a lot more in the box, and it has been duly addressed in what I am writing..","date":"2014-05-01","mins":"2:53 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-79613","author":"louis","post":"Read #7.","date":"2014-02-15","mins":"2:05 pm","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","title":"Richard Dawkins on the Shroud of Turin"},{"id":"comment-108456","author":"louis","post":"Daveb and Chesterbelloc, the review of the “Jesus family”/Talpiot Tomb can now be read in Part III of the article “Jesus was not buried in Talpiot”: https://www.academia.edu/6932766/Jesus was not buried in Talpiot Parts I II and III.","date":"2014-05-01","mins":"11:18 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-105850","author":"louis","post":"Ian Wilson vehemently dismissed any possibility of mischief making in the process, particularly aiming at Brother Bruno Bonnet Eymard and talking about the fact that the idea seemed to have gained acceptance in continental Europe, meaning France of course. In his interview, Daniel Raffard de Brienne, then president of the French Shroud organisation CIELT, said that there was no possibility of control, only manipulation. This “manipulation” appears to have been what Cardinal Anastasio Ballestrero was referring to in the interview he gave shortly before his death. The conclusion is of course left to individual Shroudies, but there is a clue in the recent e mail from Bishop Marcelo Sánchez Sorondo, of the PAS, who is highly qualified and has received a number of important international awards..","date":"2014-04-29","mins":"11:40 am","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-108472","author":"louis","post":"Daveb and Chesterbelloc, there was a small modification in one of the captions of the photographs in the review of the “Jesus Family”/Talpiot Tomb book, Part III of “Jesus was not buried in Talpiot” so the link is now: https://www.academia.edu/6932873/Jesus was not buried in Talpiot Parts I II and III.","date":"2014-05-01","mins":"11:43 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-106061","author":"louis","post":"Daveb, thanks for the remarks. You must have noted in the introduction that, from my point of view, there is something in favour of the Templar hypothesis and I am waiting for more material to be able to write something more. But first the article about Jesus in biblical archaeology which should be ready and posted as a pdf this week. Daniel Raffard de Brienne was a descendant of Walter V de Brienne, Duke of Athens, therefore it was inevitable that he had some axe to grind in ruling out the Templars. I felt sad for him because he was unable to get anyone to search the archives in Athens. The chest in Besançon is an important link, and who knows, there could have been a de Brienne – de la Roche connection, the latter giving the TS to the Knights Templar for safekeeping in some heavily guarded, impregnable monastery fortress due to the situation in France..","date":"2014-04-29","mins":"5:46 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-107193","author":"louis","post":"Hi Chesterbell, I write on many topics, mainly developments in biblical archaeology and studies, bits of history, theology and philosophy, Turin Shroud, science theology dialogue, parapsychology, existentialism, Freud, Jung etc. Some of the material on the TS is on the Holy Shroud Guild website and you will find it by clicking on the folder, and other articles are scattered on different websites. A big pdf review article on Jesus in biblical archaeology should be ready and posted tomorrow, it will be Part III of “Jesus was not buried in Talpiot”. Feel free to contact me by e mail if you need more information..","date":"2014-04-30","mins":"5:51 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-74829","author":"louis","post":"Who is BT Dan? This is easier said than done and who said the Pope will listen to a proposal about what he should or should not do? He has advisors around him, who are certainly aware about what Dr. Christopher Ramsey warned, as mentioned in the thread “Time out: Interruption Interrupted.”.","date":"2014-01-27","mins":"10:43 am","url":"https://shroudstory.com/2014/01/27/shroud-pope-francis-call-for-new-test/","cat":"carbon_14_dating","title":"Should Pope Francis Call for New Test?"},{"id":"comment-107353","author":"louis","post":"Hi daveb, thanks for the comments. I read the review by Donahue, an industrial chemist, a long time ago. He is very badly mistaken, a typical amateur. My review of the book is being given the finishing touches now and has two versions, one with and the other without two photographs I took, just for the sake of illustration and not essential. All I can say now is forget the statistics, the James ossuary, the Jesus(?) ossuary, bones and some of the rest as much serious claims have been tackled. In my view what will be needed now is more work by several serious scholars, in another book..","date":"2014-04-30","mins":"8:58 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","title":"Sabotage?"},{"id":"comment-73087","author":"louis","post":"I read the interview years ago. Do you have an explanation for why Cardinal Ballestrero changed his mind?.","date":"2014-01-11","mins":"6:00 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","title":"Surely You’re Joking, Mr. Jones"},{"id":"comment-32767","author":"louis","post":"No wonder everything went wrong, from beginning to end..","date":"2013-05-03","mins":"2:39 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","title":"Special Request from Hugh Farey"},{"id":"comment-73058","author":"louis","post":"The mistakes in the 1988 carbon dating started in Turin when Cardinal Anastasio Ballestrero, O.C.D., supposedly influenced by the Carmelite way of thinking — there are no material supports — left everything in the hands of Professors Giovanni Riggi and Luigi Gonella. There is evidence to support this allegation, and that is a photograph where the prelate appears leaning over the Shroud, published in one of the older issues of the BSTS newsletter. To make matters worse, the protocols prepared by Professor Carlos Chagas were ignored and the rest of the story is known to everyone in the realm of Shroud studies. Cardinal Ballestrero did give an interview to a Carmelite magazine shortly before he died, saying that he had been manipulated. What did he mean by that?.","date":"2014-01-11","mins":"12:56 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","title":"Surely You’re Joking, Mr. Jones"},{"id":"comment-33553","author":"louis","post":"David has listed some of the main points that drove the “Jesus movement”, that later became the Church. So we know that there was much more in it than just sociology. The Resurrection was an unique event, within the bounds of history, but as Benedict XVI said, pointing to beyond and above history. What is beyond and above history is what is called Christian faith today. But what can be said about what happened in history? That the Resurrection was a less historical event, in terms of the number of people who saw the risen Jesus. But how did these people see the risen Jesus? What happened is described with some details in the NT, which are crystal clear, and from which it is possible to see why the disciples acted that way. Without this historically rooted event there would be no Church and no Christianity because the risen Jesus (within history) led to the Christ beyond and above history (Christianity)..","date":"2013-05-12","mins":"10:06 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?"},{"id":"comment-210384","author":"louis","post":"No one is obliged to impose a belief on anyone else. Most Christians and some Jews (and not only Messianic Jews) believe in Jesus’ resurrection. Some pro authenticists believe that the relic demonstrates a supernatural event, others don’t. In the latter group are those who believe that Jesus survived the crucifixion and went to India. To say that, in my view, is to judge Jesus to have been the greatest liar and trickster, or expert magician, in history. I did not see any of the “Shroudies” at the Hampshire event telling the people there that they got their history wrong. Alright, they chose to keep quiet. But, at least they could have asked them why they did not send a letter to Turin, asking the clerics to transfer the relic to any of the museums listed in the link: https://en.wikipedia.org/wiki/List of magic museums ?.","date":"2015-09-14","mins":"1:35 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210449","author":"louis","post":"Professor Marco Bella has correctly noticed that some people are mixing things up, as though depending on the authenticity of the Shroud to continue to believe in Jesus. I have had frank discussions about this point with prominent Shroudies and can confirm what he is saying. I cannot say anything about the professor’s beliefs, but the fact that at least one co author of the paper is a well known sceptic appears to have prompted some “Shroudies” to be suspicious about everything. What one can say with certainty is that Turin does not seem to take papers in Shroud research seriously and we cannot hope that any doors will be thrown open for another hands on examination, or for another round of carbon dating. Oxford has said that its doors are open for carbon dating, however the differences in opinion about why exactly the 1988 results may have been skewed would have to be sorted out first. Professor Christopher Ramsey made that very clear: https://www.academia.edu/7893085/The Quest for Jesus in Shroud research In his last Shroud book “The Shroud.The 2000 year old mystery solved” Ian Wilson provides a complete picture about what has gone on and even doubts that any solution can be reached, considering many things that have been published so far, and why the relic may not even be an artefact suitable for carbon dating..","date":"2015-09-15","mins":"9:52 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210463","author":"louis","post":"The Church does not mix things up, it places emphasis on canonisation. Given the chaotic world we live in people are looking for responses, something “palpable” that can serve as a prop for faith. Good Father Francis O’Leary had a spiritual interpretation of the Jospice Mattress Imprint, with which I could not agree. Poor Mother Teresa spent a number of years doubting the existence of God, while carrying on the work she was doing. She discussed her doubts with Archbishop Perrier of Calcutta, but there is no record of her looking to relics for solace. She of course never really gave up her faith. The Church holds the Shroud expositions because of tradition, just as the “Veronica” is exhibited once a year in Saint Peter’s Basilica, Rome. For the rest: https://www.academia.edu/14795646/An interview with Professor Heinrich Pfeiffer SJ.","date":"2015-09-15","mins":"11:44 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-210476","author":"louis","post":"The Shroud does not seem to be on the agenda now. Canonisations sometimes take dozens of years and involve tons of documents and that also happens when a candidate has to be declared “Venerable”. For instance, it is the case of the Swiss Capuchin Archbishop Anastasius Hartmann, who was archbishop of Patna and Bombay, both cities in India: http://catholicsaints.info/venerable anastasius hartmann/.","date":"2015-09-15","mins":"3:04 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-126148","author":"louis","post":"Daveb, further to the comment above, it seems that the Church’s position on fresh carbon dating was clear in the e mail received from PAS chancellor Cardinal Miguel Sánchez Sorondo, two lines from which were reproduced on this blog by the recipient recently. The Church is surrounded by traitors, as the experiences of Paul VI and, more recently, Benedict XVI has shown. It has no choice but to move very carefully. It is not hard to agree with you that advances in science “may well come with a more definitive way of testing the Shroud’s age.” That has been Ian Wilson’s position for more than a decade and the reasons why he thinks so are convincingly stated in his last Shroud book. The entire relic was scanned during the controversial restoration, however, given the Church’s silence, one must presume that not enough information was extracted..","date":"2014-06-01","mins":"5:12 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","title":"The Collapse of the Fraud Theory"},{"id":"comment-210541","author":"louis","post":"Bono prays to Jesus and believes in…..","date":"2015-09-16","mins":"4:34 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","title":"The Chemist Rogers and Plastic Bags"},{"id":"comment-126102","author":"louis","post":"The Church is in no hurry for fresh carbon dating because the relic is not an article of faith and, learning from mistakes, it will be careful in selecting laboratories this time it seems. There is too much infighting in the realm of Shroud studies, a lot of ego bashing is needed, a lot of things must improve. If not we will continue to see even petitions sent to the Pope stored in a drawer..","date":"2014-06-01","mins":"12:43 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","title":"The Collapse of the Fraud Theory"},{"id":"comment-50644","author":"louis","post":"Colin, not all scientists think like you, thinking they can see “the whole picture”. That is why we see scientism from time to time. Have you read “Return to the Centre” by Dom Bede Griffiths? Many years ago we differed publicly by publishing some Letters to the Editor in a weekly, but he did have some interesting points to make, some of which are very relevant today. It has something to do with the material and non material..","date":"2013-11-10","mins":"1:28 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","title":"The Mysterious Arizona Piece"},{"id":"comment-50652","author":"louis","post":"It is the mysterious universe and the quantum uncertainty that is most interesting..","date":"2013-11-10","mins":"2:46 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","title":"The Mysterious Arizona Piece"},{"id":"comment-50659","author":"louis","post":"As commented on this blog more than once, everything went wrong, from beginning to end in 1988..","date":"2013-11-10","mins":"4:02 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","title":"The Mysterious Arizona Piece"},{"id":"comment-50660","author":"louis","post":"We are finite, our investigation tools are limited, so there are some who appeal to vivid imagination and that is wrong..","date":"2013-11-10","mins":"4:04 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","title":"The Mysterious Arizona Piece"},{"id":"comment-50950","author":"louis","post":"Official argument for the secret wrapping? There is no official argument, but the clue is at the end of the long story..","date":"2013-11-12","mins":"10:48 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","title":"The Mysterious Arizona Piece"},{"id":"comment-173834","author":"louis","post":"Thanks, Giorgio. I do not know which Shroudies you are referring to, but it would be nice to have both pro and anti authenticty folks involved..","date":"2014-11-30","mins":"11:43 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"id":"comment-173827","author":"louis","post":"Hi Giorgio Who is your mentor?.","date":"2014-11-30","mins":"11:08 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"id":"comment-173838","author":"louis","post":"Alright, I understand, but others may not..","date":"2014-11-30","mins":"11:56 am","url":"https://shroudstory.com/2014/11/30/the-raes-samples-that-rogers-used-had-been-switched/","cat":"carbon_14_dating","title":"The Raes samples that Rogers used had been switched?"},{"id":"comment-215006","author":"louis","post":"I am inclined to agree with Robert who has written about “‘enhanced contamination’ other than that associated with a reweave.” It is the hypothesis that Ian Wilson has favoured and it is worthwhile reading what he has to say about it in his book “The Shroud; the 2000 year old mystery solved. We will have to wait and see what Professor Giulio Fanti can say about thirteenth century reweaving in the future. Carbon dating has been used to date archaeological sites in Israel and it continues to be convincing to archaeologists even when micro archaeology is used. We must remember that both the Masada cloths and the wrappings used on the Dead Sea Scrolls were dated correctly: https://www.academia.edu/18473226/The key role of Biblical Archaeology in Exegesis An interview with Professor Israel Finkelstein.","date":"2015-11-23","mins":"5:09 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-214985","author":"louis","post":"In his last interview Professor Giulio Fanti said he would be working on a thirteenth century reweaving hypothesis, for which he had some evidence. It is only not clear which of the two sets of samples Ray Rogers examined, one of which was official and Professor Fanti expresses some doubts: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies I have faithfully reported what was told to me and the Italian scientist will work on the reweaving hypothesis in the future since he is working on some other things we know about the Shroud right now. I do not know what Ray Rogers’ beliefs were; he did seem to be agnostic, if not atheist. In one paper he co authored he mentioned evolution in passing but failed to say anything about where the rationality came from. Last month my interview with another scientist, a biblical archaeologist, demonstrated to me what objectivity should be and why clashes bewteen text (Bible) and spade (archaeology) does not mean the end of faith: https://www.academia.edu/18473226/The key role of Biblical Archaeology in Exegesis An interview with Professor Israel Finkelstein.","date":"2015-11-22","mins":"5:39 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215067","author":"louis","post":"At least Dr.Tite does not say that the image is a painting or was produced with the use of acid or some scorching technique..","date":"2015-11-24","mins":"5:13 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215030","author":"louis","post":"It is obvious that earthquakes do not produce images and even Professor Giulio Fanti has sort of given up the corona discharge hypothesis and will be working on both thirteenth century patch and contamination in the future. I prefer the contamination hypothesis on account of the convincing examples that Ian Wilson provides in his book and also because it is one of TS Cs preferred hypotheses. Now, the question that arises is: what sort of contamination? As I wrote in the previous comment, radiocarbon dating is used in biblical archaeology in Israel, and the results are published even if they clash with what is in the Old Testament, be it the Exodus, the “empire” of David and Solomon and the rest: https://www.academia.edu/18473226/The key role of Biblical Archaeology in Exegesis An interview with Professor Israel Finkelstein We must find out what kind of contamination may have skewed the results of the 1988 carbon dating. The wrappings used on the Dead Sea Scrolls and the Masada cloths were dated correctly. It is important to note that Willard Libby himself dated the Masada cloths, around the year 1950..","date":"2015-11-23","mins":"2:23 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215033","author":"louis","post":"In an interview conducted some years ago, Professor Giulio Fanti pointed out that Professor Luigi Gralaschelli failed when it comes to the microscopic level: https://www.academia.edu/18636589/Science and religion meet in Shroud research.","date":"2015-11-23","mins":"4:21 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215037","author":"louis","post":"Daveb, alias Mr. David Belz, who is not a scientist, continues with his provocations, protected by two people whom I have identified. One wonders why CB was silenced and daveb can continue provoking. He knows next to nothing about Parapsychology and I doubt that he has read any journals devoted to psychical research. He lives in a country that has earthquakes now and then. Apparently he has not heard of a single case where some image was produced on cloth and yet he dares toy with the idea that the Shroud image may have been produced as a result of an earthquake..","date":"2015-11-23","mins":"5:29 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215068","author":"louis","post":"Thank you, Dan. I do not know who Chantal Boisselier is or what she does in life, but I got the impression that she made the comment on behalf of someone in France, putting out a feeler to see how it will be received. I have to tell this lady that I do not have to promote any of my articles and if a link is provided to one of them it is only because it is relevant to the discussion taking place. Not only have some of my articles been preserved in the libraries of a renowned university and institution, some of them have even been posted online at the request of the webmasters. I am sometimes even consulted by scholars with Ph Ds, authors of important books, who also teach at universities when they are preparing their own papers and what is discussed is kept confidential, in the same way that documents and reports prepared after examinations, research by individuals or institutions and so on that are sent to me are. I have never attacked anyone on this blog. What I have done is to defend scholars and scientists who have been the object of nasty insinuations and character assassination. I have also defended myself when some commenters have hurled insults at me, trying to get me out of the blog either by poking fun at me or by making little of what I write, even using foul language in the process. As far as I know, none of them have published anything in a magazine or a daily. I am not here to flatter anyone in order to gain support from other commenters or to resort to tactics like pitting one commenter against another. On the contrary, I try to help by posting a link to a bit of news or some article that commenters will find useful..","date":"2015-11-24","mins":"6:02 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215070","author":"louis","post":"Sampath, a few days ago you defended the “earthquake theory”, remember? You are an environmental engineer and in the right place to find out what can happen during an earthquake. My view is this: the Resurrection of Jesus was an unique event and we should not expect to rise like he did..","date":"2015-11-24","mins":"6:32 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215095","author":"louis","post":"Do you have any image that was produced as the result of an earthquake?.","date":"2015-11-25","mins":"1:29 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215054","author":"louis","post":"One wonders whether this paper was peer reviewed. The author is not a scientist. If it could have been taken seriously Professor Giulio Fanti would have been delighted and gone ahead with his corona discharge hypothesis, however he seems to have given it up..","date":"2015-11-24","mins":"5:41 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215085","author":"louis","post":"Here you are, Sampath: November 13, 2015 at 3:56 pm Reply “… Yes there is a possibility to get images during seismic events with Radon. I don’t know whether De Liso managed to get both frontal and dorsal images from the experiments.” You must also think about why it happened only to the body of Jesus if he was just one among many wrapped in a shroud in Jerusalem during the period. Professor Giulio Fanti has sort of given up the idea of corona discharge, which was linked to the “earthquake theory” and that is what he has also done by abandoning the possibility of light having something to do with image information. A few days ago you also wrote that the story of Moses and the events surrounding him are nothing but plagiarism. That is a sweeping statement for which there is no justification. If you read this recent interview conducted last month with a prominent Israeli archaelogist you will notice that Near Eastern texts did indeed have an influence on the Old Testament narratives but there seems to be an independent strand that took centuries to form. This is still the object of studies: https://www.academia.edu/18473226/The key role of Biblical Archaeology in Exegesis An interview with Professor Israel Finkelstein.","date":"2015-11-25","mins":"7:58 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215109","author":"louis","post":"If our exchange is read right from the beginning it becomes obvious that you changed your mind. I have relied on Professor Giulio Fanti’s research and he has abandoned the corona discharge/earthquake hypothesis and also stated that light was not involved in image formation. Why would only Jesus’ body, wrapped in a burial cloth, have been affected by an earthquake? The same can be said about the Maillard reaction. Read question 11 in the following interview, where there is also something about first century Jewish burials: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin.","date":"2015-11-25","mins":"6:46 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215102","author":"louis","post":"No, I wasn’t talking about the de Liso images because she is not a scientist and her paper was probably not peer reviewed. I was just asking if you knew about any image that was produced as a result of an earthquake. I have not seen any. It is obvious that in the case of the Shroud both frontal and dorsal images were created at the same time, so what de Liso produced is irrelevant..","date":"2015-11-25","mins":"3:52 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215071","author":"louis","post":"Something interesting to read: empirical science and the soul: http://www.ilsussidiario.net/News/English Spoken Here/Science Technology/2015/5/19/EMPIRICAL SCIENCE William Carrol Souls Matter/610056/.","date":"2015-11-24","mins":"6:34 pm","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215089","author":"louis","post":"Quite correct. The link was provided just to let intererested readers know what is being said. Swinburne has not been convincing with his emphasis on natural theology, which obliges him to ignore the Gospel according to John. You might also like to read the review of a book by a scientist who was also an Anglican priest: https://www.academia.edu/16566394/An introduction to chaos theology as well as: https://www.academia.edu/8424286/Book Review The Future of Atheism Alister Mc Grath and Daniel Dennett in Dialogue You must have read that Daniel Dennett is also cited in the article to which a link was provided in the previous comment. An uncaused universe is a metaphysical impossibilty, as Paul Copan states in this book review. Were you able to read something about Dom Bede Griffiths?.","date":"2015-11-25","mins":"8:48 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215138","author":"louis","post":"Hello John This is a topic that will take a very long time to discuss, so I will have to direct you to some links to articles, reviews and interviews, which you can read whenever you have the time. It is a sequence, which will enable you to grasp the approach that is taken. Needless to say, it will be modified as time goes by, because we learn about developments in science and religion almost every,single day. I can say something about a few points you have mentioned in your comment. We are indeed in the “shadows”, however there is a clash between Buddha because Buddhism is a negative soteriology and Jesus, linked to the Judaeo Christian tradition, which does not say the same thing. Actually, in Buddhism some concepts are very vague and, in the end, there is “nothing”. Science tells us that nothing comes from nothing and nothing goes to nothing. Viewed from that angle, the Judaeo Christian tradition is more convincing. So if there is “something”, What is it? Read the introduction: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ Note that Stephen Hawking keeps on changing his mind. He is a very good scientist, but I have the feeling he is also influenced by biology and this is a kind of guide to the direction he is taking. If we get back to the “shadows” you mentioned, Who created them? It was a problem that C.G. Jung discussed with his closest friend, the American Dominican monk Father Victor White. Their friendship almost came to an end and, yet, the deep spiritual bond was not broken. Evil, in the Swiss psychiatrist’s view, was God’s “shadow”. Really? And why? He based himself on Genesis:. Https://www.academia.edu/7344691/C. G. Jung Father Victor White and privatio boni It is not that the topic they were discussing was not the object of dispute before them. It was present even in Old Testament times, possibly causing the split between Enochic Judaism and the Essenes: https://www.academia.edu/12734802/Book Review Beyond the Essene Hypothesis The Parting of the Ways between Qumran and Enochic Judaism In our own days, we are confronted with what happened during the Nazi holocaust, which leads us to the Bible again and to questions that remain unanswered: https://www.academia.edu/12823419/Book Review Jesus and Yahveh the names divine If you read what is in the first link you will notice that some things are not compatible with what we learn from biblical archaeology today. William F. Albright is a thing of the past: https://www.academia.edu/18473226/The key role of Biblical Archaeology in Exegesis An interview with Professor Israel Finkelstein I was able to meet, talk to and interview the prominent archaeologist, part of a project that will later include more studies in science and religion. So, if you have read what is in the link above you are bound to ask, If archaeology cannot give the final verdict and the Bible narratives include some Near Eastern myths where does that get us? Do we (that is, those of us who are Christians) have to become like Heidegger, or, better, like Wittgenstein, and think about becoming monks?: https://www.academia.edu/6085481/Why was Wittgensteins burial attended by a religious ceremony Or do we have to toss what we learn from archaeology and Bible aside as unconvincing, leading to blind alleys, and become atheists like Freud?: https://www.academia.edu/15308857/Freuds incomplete speculation on monotheism In my view, none of this needed, we have to wait for more developments in science and religion and both have to be put together: https://www.academia.edu/14727603/Why Stephen Jay Gould proposed the principle of Non overlapping Magisteria Just too many links had to be posted here, but it was necessary in order to drive my point home. You can always contact me by email if you wish to do so. I will be concentrating on book reviews in the next few days, but I can always make some time for you..","date":"2015-11-26","mins":"11:11 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-215139","author":"louis","post":"Hello John This is a topic that takes a very long time to discuss. You can contact me by email if you wish as there are many links to post. I am concentrating on a book review now, but can always make some time for you. Here are a few links: Read the introduction: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ keeping in mind that Stephen Hawking always changes his mind. He is a very good scientist. One gets the feeling that he has been influenced by biology (evolution as Dobzhansky understood it, minus the religion). Francis Collins is also mentioned in this introduction and you say he “believes in the God of the Bible”. Yes, he does. The problem is that the God of the Bible took a long time to emerge, if we are to understand the narratives correctly. Biblical archaeology tell a different story: https://www.academia.edu/18473226/The key role of Biblical Archaeology in Exegesis An interview with Professor Israel Finkelstein the result of a meeting with the prominent archaeologist last month, part of my project involving both science aand religion. You will read that archaeology cannot give the final verdict and will ask,What do we do then if the narratives in the Bible also absorbed Near Eastern myths? That is no problem, studies are being conducted, and science and religion should not necessarily clash: https://www.academia.edu/14727603/Why Stephen Jay Gould proposed the principle of Non overlapping Magisteria We are not in a position to ask, What caused God? We are finite. More on that later..","date":"2015-11-26","mins":"11:53 am","url":"https://shroudstory.com/2015/11/22/three-questions-about-the-reweaving-hypothesis/","cat":"carbon_14_dating","title":"Three Questions About The Reweaving Hypothesis"},{"id":"comment-74721","author":"louis","post":"This is stale news and it seems Professor Christopher has changed his mind and is now more willing to defend the 1988 CD results. Yet that does not change the picture as he would certainly entertain proposals for fresh carbon dating, but as he told me, it would have to be definitive and differences in opinion would have to be sorted out first to avoid more and more papers about why this second test may also have gone wrong. Needless to say, if it doesn’t indicate the first century AD. Surely it doesn’t make a difference to him since he is a practicing Christian, perhaps a lesson for those with weak faith..","date":"2014-01-26","mins":"5:55 pm","url":"https://shroudstory.com/2014/01/26/time-out-interruption-interrupted/","cat":"carbon_14_dating","title":"Time Out: Interruption Interrupted"},{"id":"comment-74254","author":"louis","post":"That’s right. What if there was no Turin Shroud?.","date":"2014-01-23","mins":"12:24 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","title":"Titulus Crucis:  A Fascinating Guest Posting by O.K."},{"id":"comment-74246","author":"louis","post":"The birth of Christianity can be traced to the Resurrection, not to any relics. Even if we have these relics they will not tell us the full story and Christians at least depart from this world with a big amount of faith..","date":"2014-01-23","mins":"11:05 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","title":"Titulus Crucis:  A Fascinating Guest Posting by O.K."},{"id":"comment-51114","author":"louis","post":"Kelly, if science has so far been unable to prove what the Shroud is, then it could be a supranormal phenomena, that is, a force from beyond acting in our world. That at least is what I learned in a course in Parapsychology, a subject recognised by the UN, one pioneer in the field being J.B.Rhine, at Duke University..","date":"2013-11-13","mins":"11:04 am","url":"https://shroudstory.com/2013/11/13/what-lab-director-is-so-crazy/","cat":"carbon_14_dating","title":"What Lab Director is So Crazy?"},{"id":"comment-51155","author":"louis","post":"That is the right approach, Kelly, simply because the scientific tests are by no means exhausted and, as you know, Pope John Paul II left the matter to science. Only if science fails to deliver a correct verdict can we appeal to supranormal phenomena..","date":"2013-11-13","mins":"7:07 pm","url":"https://shroudstory.com/2013/11/13/what-lab-director-is-so-crazy/","cat":"carbon_14_dating","title":"What Lab Director is So Crazy?"}]
