[{"id":"comment-212050","author":"louis","post":"Louis makes it a point to substantiate what he writes: http://www.vam.ac.uk/content/articles/i/indian textiles introduction/.","date":"2015-10-08","mins":"10:10 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-211890","author":"louis","post":"The authors cite the research by Professor Giulio Fanti on the DNA, mentioned in q/a 9: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies They do not say from which Indian language the word “sindia” or “sindien” came from. It does not seem to be Sanscrit. Actually silk and not linen is what India is known for and there is a paper written by an expert: http://www.exoticindiaart.com/book/details/textiles in ancient india IDG856/ Curiously, the Spanish Jesuit historian and archaeologist Father Henry Heras, who taught at Saint Xavier’s College, Bombay, and who also deciphered the script used in the Indus Valley Civilisation, thought that the “three kings” who went to see baby Jesus may have been from Western India. He found some cultures in Western India where gold and frankincense were given as presents to babies:. Http://www.manresa sj.org/stamps/1 Heras.htm.","date":"2015-10-06","mins":"9:05 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-211896","author":"louis","post":"You’re welcome, OK. I hope you can get information about the roughly 2000 microphotographs in Turin, which may be of use to you since you are good when it comes to imaging..","date":"2015-10-06","mins":"11:19 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-211913","author":"louis","post":"Further to the comment above, I found something on “History of clothing in ancient India” on Wikipedia. There is mention of the Harappan (Indus Valley Civilisation) custom of dyeing cloth and there seems to be evidence of dyeing with red madder: https://en.wikipedia.org/wiki/History of clothing in India.","date":"2015-10-06","mins":"3:42 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-212090","author":"louis","post":"Josephus linked the “Ophir” of the Old Testament to Índia and we know that the country was one the ancient civilisations where there was flax cultivation. Perhaps that is why Orit Shamir did not find similar cloth in Israel and Joseph of Arimathea may have bought the cloth because he had the money. This is just speculation and the authors of the Shroud paper recently published in Italy do not explain the origin of the word “sindon” clearly. There is still a lot to be done in Shroud research when it comes to reweaving, pollen grains, bloodstains and much more..","date":"2015-10-08","mins":"7:32 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-211933","author":"louis","post":"Sampath, it must have come from the Nasranis, the Jewish Christians in Kerala, who were influenced by Syrian art. There is at least one church in Kerala that has a synagogue like interior..","date":"2015-10-06","mins":"7:02 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-211926","author":"louis","post":"Hello Sampath If the cloth was really manufactured in India, it may have come from the Dravidian Cholas or from the Indo Aryan people who were in the Indus valley. Jewish presence in Sri Lanka dates to the 13th century, with the arrival of Portuguese Jewish merchants. In Índia the Nasranis, Jewish Christians, arrived in the 1st century. They may have followed the route of the apostle Thomas. Many documents were lost when the Jews were caught in the crossfire between the Portuguese and Dutch in 16th century Cochin..","date":"2015-10-06","mins":"6:15 pm","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-211893","author":"louis","post":"More breaking news: “Shroudie” elected as Patriarch of the Assyrian Church of the East. Mar Gewargis Sliwa was been elected as Gewargis III, Patriarch of the Assyrian Church of the East. He was consecrated at Saint John’s Cathedral, Erbil, Iraq: https://uk.sports.yahoo.com/photos/mar gewargis sliwa speaks elected catholicos patriarch assyrian photo 154214348.html; ylt=Awr B8p s4h N Wvyg Aiyajzbk F; ylu=X3o DMT Bx NG1o Mm E2 BH Nl Yw Nmc C1hd H Rya WI Ec2xr A3 J1cmw Ea XQD.","date":"2015-10-06","mins":"10:09 am","url":"https://shroudstory.com/2015/10/06/breaking-news-sources-of-dna-on-the-shroud-of-turin/","cat":"science","title":"Breaking News:  Sources of DNA on the Shroud of Turin"},{"id":"comment-216170","author":"louis","post":"Try this review of a book written by an Anglican priest who was also a scientist for many years. It is just a start. Https://www.academia.edu/16566394/An introduction to chaos theology It is of course not the complete story and we will have to go much beyond. Freud limited himself because of his own father complex: https://www.academia.edu/15308857/Freuds incomplete speculation on monotheism.","date":"2015-12-10","mins":"6:09 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216060","author":"louis","post":"We cannot talk about holy writ as we used to decades ago. Some things that we find in the Old Testament cannot be verified: https://www.academia.edu/18994343/The key role of Biblical Archaeology in Exegesis An Interview with Professor Israel Finkelstein The New Testament is safe so far, as far as archaeology is concerned..","date":"2015-12-09","mins":"5:02 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216118","author":"louis","post":"Hello Sampath Paul was a very Jewish Jew and so it was inevitable that he placed importance on some customs, particularly those that had to do with the creation story. However, they are not essential, so you can continue to be a practising Christian without bothering about these questions..","date":"2015-12-10","mins":"7:35 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216172","author":"louis","post":"You’re welcome, Sampath. The important thing is for you to have found useful what I asked you to read. If possible, contact me by email if you are travelling in December as there are some suggestions that I would like to give you..","date":"2015-12-10","mins":"7:02 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216119","author":"louis","post":"Directed to Sampath Fernando: Sampath, there are different ways of interpreting the Bible: https://www.academia.edu/12850351/Book Review The Interpretation of Scripture In Defence of the Historical Critical Method.","date":"2015-12-10","mins":"7:41 am","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216248","author":"louis","post":"There are historians who say that the Virgin Birth cannot be sustained historically but confess it liturgically when they are priests. Since the doctrine continued to be held by the early Christians it led to the “mamzer” theory which found its way indirectly into the Talmud Bavli (6th century AD). It was successfully refuted by Professor Francis Schaefer: https://www.academia.edu/7471287/Book Review The Tomb of Jesus and His Family Exploring Ancient Jewish Tombs Near Jerusalems Walls.","date":"2015-12-11","mins":"5:36 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"},{"id":"comment-216167","author":"louis","post":"Hello Sampath Bible studies, biblical archaeology and Christian theology: The historical critical method can be used together with other methods and one of its top proponents has been Father Joseph A. Fitzmyer, interviewed here: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ The big problem is when the historical critical method (text) goes hand in hand with biblical archaeology (spade).That is evident in recent discoveries, about which you can learn something from the interview with archaeologist Professor Israel Finkelstein: https://www.academia.edu/18994343/The key role of Biblical Archaeology in Exegesis An Interview with Professor Israel Finkelstein If you feel the need to fill the gaps there are also scientist theologians who have expressed their points of view: https://www.academia.edu/16566394/An introduction to chaos theology.","date":"2015-12-10","mins":"5:18 pm","url":"https://shroudstory.com/2015/12/08/jesus-the-xx-male/","cat":"science_and_religion","title":"Jesus, the XX Male"}]
