[{"id":"comment-169924","author":"louis","post":"Why waste time seeing things like halos in the Shroud image? I saw halos depicted on non Christian images more than a decade ago. References to make things easy? http://en.wikipedia.org/wiki/Halo (religious iconography).","date":"2014-11-08","mins":"4:30 pm","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-170646","author":"louis","post":"It is possible to accept the proposition if it is circular shading, not a “halo”. The circle, interpreted as a halo, is depicted on the battle standard of Ivan the Terrible and dozens of icons and manuscripts before the emperor’s period, apparently derived from the Mandylion..","date":"2014-11-11","mins":"2:57 pm","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-170136","author":"louis","post":"David, that’s right. It is wrong to impose on the Shroud influences from older images. I did learn to detect the aura with instruments while studying Parapsychology and it is also controversial, something to do with Kirlian photography, liquid in the body and so on. I think the halo, as you pointed out, was conceived to convey the holiness, luminous quality, of mythical figures..","date":"2014-11-09","mins":"1:15 pm","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-170160","author":"louis","post":"A bit off track but it is really worthwhile watching this rare documentary. After 40 years as an atheist an Australian university professor of philosophy moved to Egypt to become a Coptic monk in a monastery in the Egyptian desert: http://www.vox.com/xpress/2014/11/9/7177553/why australian atheist philosopher moved to egypt became coptic monk.","date":"2014-11-09","mins":"2:50 pm","url":"https://shroudstory.com/2014/11/08/a-detailed-response-to-the-halo-study/","cat":"history","title":"A Detailed Response to The Halo Study"},{"id":"comment-98751","author":"louis","post":"I am not sure if this was IW’s first public writing about the Shroud and I appreciated what he was writing because I myself was writing for a weekly once in a while, but on other topics such as theology, Church history and so forth. His article caught the attention of Father Francis O’Leary because of the mattress imprint phenomenon, which was mentioned in at least one of his Shroud books. The good priest was giving it a spiritual connotation, making a connection with the TS, which was not convincing, however how could one bother someone who was involved in a much more important task, that is, trying to raise funds for his Hospice, where poor terminal patients could die with dignity? IW and I agreed that the image formation process in the Imprint and the TS was not the same: http://holyshroudguild.org/uploads/2/7/1/7/2717873/can the jospice mattress imprint.mht 2.pdf Part II will be written and posted shortly. Success in your research!.","date":"2014-04-12","mins":"2:03 pm","url":"https://shroudstory.com/2014/04/12/a-gift-to-the-shroud-of-turin-blogosphere-from-stephen-jones/","cat":"history","title":"A Gift to the Shroud of Turin Blogosphere from Stephen Jones"},{"id":"comment-98691","author":"louis","post":"Only now has Ian Wilson’s article in the “Catholic Herald” been noticed? Father Francis O’Leary approached him precisely because he read such an article by him in the weekly..","date":"2014-04-12","mins":"10:24 am","url":"https://shroudstory.com/2014/04/12/a-gift-to-the-shroud-of-turin-blogosphere-from-stephen-jones/","cat":"history","title":"A Gift to the Shroud of Turin Blogosphere from Stephen Jones"},{"id":"comment-215421","author":"louis","post":"Daniel Raffard de Brienne believed that the Shroud was in the hands of Otho de la Roche in 1205, that it remained there till the fourteenth century, and was taken to France by the last Duke of Athens. He dismissed the Knights Templar hypothesis, on which I am working, with a better plate, going a bit further than Ian Wilson’s contention, as proposed in his last Shroud book: https://www.academia.edu/9156258/Shroud Studies in France.","date":"2015-12-01","mins":"8:22 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215495","author":"louis","post":"Directed to Mario Latendresse Although I am not a trained historian like Ian Wilson (MA, Oxon) I studied history for two years in college and began writing on the topic soon after that, beginning with two articles published in a major daily, one of which is preserved in the library of one of the world’s top universities. The other one was sent to the Vatican Secretary of State, without my knowledge, because the topic involved both Church and State and there were people trying to influence a decision that had to be taken in Rome. Whatever the discussions there, the decision they took was in favour of the line I was pursuing. I would not that be that harsh with Daniel Raffard de Brienne. He wrote for the best history magazines in France and was always frank with me. He did not really believe that the Knights Templar possessed the Shroud and it is possible, repeat, possible, that he was thinking about his ancestor Gauthier V de Brienne, who was the Duke of Athens, but it did not influence his views when we were discussing the topic. If we look at it that way, my great great grandfather, a member of the Portuguese parliament in the 1840s, received the title “young nobleman” and awarded Knight of the “Ordem Militar de Cristo”, the Order of Christ — to which greats like Vasco da Gama, Ferdinand Magellan, Pedro Álvares Cabral belonged — by the King of Portugal. The Knights Templar were reconstituted in Portugal, becoming the Knights of Christ. That was what the Portuguese King Diniz insisted on when he took the matter to Pope John XXI. It does not in any way influence my decision to research the Templar hypothesis. I agree with Ian Wilson that the the historical group “fits the requirements with uncanny precision.” The Image of Edessa/Shroud was stolen during the Fourth Crusade, in 1204: https://www.academia.edu/7447446/Was there a link between the Knights Templar and the Turin Shroud An interview with Dr. Barbara Frale It was the Order of Knights Templar, not the Hospitalers, who guarded the relics and the Templars had heavily guarded monastery fortresses. You have mentioned “statements” and this nothing more than hearsay. My next Shroud article will be on the Templars..","date":"2015-12-02","mins":"12:13 pm","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-215543","author":"louis","post":"Daniel Raffard de Brienne never mentioned his ancestor to me and the closest he got to involving Gauthier was when he said that he was looking for a correspondent in Athens who could search the archives there. Other “Shroudies” were stressing the link he is supposed to have made between Athens and Lirey by placing his ancestor in between. The documents you cite do not mean much, in that the question about what happened between 1204 and the years that Philippe VI ( 1293 1350) was in power is not answered. We need more information because it was easy to say that the relic was “gifted” or “acquired”, but what exactly happened before that? That is the reason I am pursuing the Knights Templar as the possible owners of the Shroud. We know that they did not take part in the Fourth Crusade. Who did were the French and Italian mercenaries paid by Enrico Dandolo, the Doge of Venice. Yet, the Templars had spies in Constantinople. Why did they keep quiet if they possessed the relic? Was it because Pope Innocent III sent a letter to the mercenaries telling them that they had been excommunicated? The Pope knew that relics were being stolen. See question two and the response: https://www.academia.edu/7447446/Was there a link between the Knights Templar and the Turin Shroud An interview with Dr. Barbara Frale.","date":"2015-12-03","mins":"8:25 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-208732","author":"louis","post":"Re: Image of Edessa: http://greatshroudofturinfaq.com/History/Greek Byzantine/Post 944/three944.html We also have the manuscript with what the knight Robert de Clari wrote. He was present during the Fourth Crusade. According to Father Heirich Pfeiffer the Abgarlegend is in the liturgical books of the Eastern Church, but that the sermons changed after the image arrived in Constantinople: https://www.academia.edu/14795646/An interview with Professor Heinrich Pfeiffer SJ.","date":"2015-08-22","mins":"2:13 pm","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-215554","author":"louis","post":"Hello Mario Daniel Raffard de Brienne and myself discussed some things at length, only part of which has been published. He also dwelt on the Round Table convened by Cardinal Severino Poletto in Turin, at which he was present, together with Ian Wilson, Father Heinrich Pfeiffer, Professor Avinoam Danin and others. He was still President of CIELT then and the organisation’s newsletter was still being published, in fact he mentioned my interview with Father Pfeiffer, on the Manoppello veil and the Shroud, in one of the issues. I have no copy of the “Dictionnaire”, only a book he wrote about the theory of evolution and two booklets, based on his highly conservative way of thinking. Sometimes people are afraid of what they tell journalists and, consequently, of what may be published, so I suppose that objections to the ancestor theory had already been raised, and he may have thought it wise to keep quiet about it. I, for one, have always kept confidential whatever information is given to me, publishing only that for which permission has been given in order to not put people into trouble. As you may have seen, it is precisely what you call an “open question” that I am dwelling on, the reason for a small piece on the Knights Templar that is being written, going just a small step further than what Ian Wilson has published. The mercenaries I referred to were the French and Italians on the payroll of the Doge of Venice, obviously not the Templars. It is these mercenaries who were stealing the relics. Perhaps some of those that reached Rome were among the pieces that were returned by Pope John Paul II to Patriarch Bartholomew I of Istanbul..","date":"2015-12-03","mins":"10:28 am","url":"https://shroudstory.com/2015/12/01/a-must-read-regarding-the-othon-de-la-roche-hypothesis/","cat":"history","title":"A Must Read Regarding the Othon de la Roche Hypothesis"},{"id":"comment-207954","author":"louis","post":"Obviously I did not mean to say that being a former FBI Special Agent meant that is was a qualification in archaeology, it was a reference to seriousness in research. If nothing appears on the museum’s website that is because it is in a Muslim country, where the government is encouraging fundamentalism..","date":"2015-08-11","mins":"6:06 am","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-208781","author":"louis","post":"It is evident that the image of Edessa Turin Shroud link has not been established because the gap between the years 1204 1353 is being researched. Whatever, Father Pfeiffer’s contention about the Eastern Church’s liturgy and the change in the sermons has not been challenged. The link to his interview is above, on this thread..","date":"2015-08-23","mins":"10:53 am","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-207917","author":"louis","post":"There are some unkind remarks about Phil Dayvault on page 276, footnote 546. It was this former FBI Special Agent who first saw the mosaic, and what is wrong if he asks for financial aid? Are all “Shroudies” loaded with moneybags?.","date":"2015-08-10","mins":"6:27 pm","url":"https://shroudstory.com/2015/08/10/a-superbly-detailed-exploration-of-the-image-of-edessa/","cat":"history","title":"A superbly detailed exploration of the Image of Edessa"},{"id":"comment-27396","author":"louis","post":"Its nice to see a Shroud article on this website..","date":"2013-03-15","mins":"9:48 pm","url":"https://shroudstory.com/2013/03/15/abr-the-shroud-of-turins-earlier-history-part-one-to-edessa/","cat":"history","title":"ABR: The Shroud of Turin’s Earlier History: Part One: To Edessa"},{"id":"comment-101752","author":"louis","post":"President Bashar Assad of Syria may know next to nothing about the Turin Shroud, and sent his Easter greetings: http://www.dailystar.com.lb/News/Middle East/2014/Apr 20/253928 assad visits recaptured christian town state tv.ashx#axzz2z Sq Nh Uo5.","date":"2014-04-20","mins":"5:30 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-28497","author":"louis","post":"Anyone who has read recent Shroud (history) books knows that the excavations being made in Sanlurfa can bring more concrete evidence in favour of the Edessa connection. The impact of the destruction can be felt in Shroud studies and, incredible as it may seem, the destruction continues even today. Only 57 of Iraq’s 300 churches, many of them ancient, are intact and the same will happen in Syria. Any hidden evidence in favour of Shroud authenticity may have been destroyed, thanks to Schwartzkopf, Obama, Kerry & Co..","date":"2013-03-27","mins":"12:23 pm","url":"https://shroudstory.com/2013/03/26/abr-the-shroud-of-turins-earlier-history-part-two-to-the-great-city/","cat":"history","title":"ABR: The Shroud of Turin’s Earlier History: Part Two: To the Great City"},{"id":"comment-102098","author":"louis","post":"O.K., there is much to agree with you, after all it is a world of politics, isn’t it? That is why we are also involved in Shroud studies, to judge whether the relic wrapped the dead body of the Man who said, “My kingdom is not of this world.” Your end is of course very different from the place where much blood is being shed, and, one day, when there is peace in the region, you may be able to go there, and then you will understand more deeply what I am saying. Take it easy, It doesn’t seem that the West is inclined to let Putin have his way. Hitler began that way..","date":"2014-04-21","mins":"6:46 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-102079","author":"louis","post":"Partially correct, Daveb. I want to see someone introducing democracy in that part of the world, it only exists in Israel. So why blame Assad? He tried to get the opposition to talk, but they wouldn’t listen. Why? Because they are backed by al Nusra, A/Q and hundreds of fundamentalist, fanatical Chechen, Saudi Arabian, Iraqi mercenaries, financed by Saudi Arabian petrodollars. Do these people have mercy? They destroyed Maaloula, the ancient Christian city where Aramaic is still spoken, they kidnapped nuns, they kidnapped two bishops, who are not to be seen. Last week they shot an 80 year old Dutch Catholic priest in the head, he had refused to budge, trying to help his flock. The mercenaries are backed by the atheist and playboy Hollande, of France, who is in league with the fundamentalist Erdogan in Turkey, one of those who supplies arms to the bloodthirsty fundamentalists. Western democracies have stopped being blind, their eyes have opened..","date":"2014-04-21","mins":"5:50 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-102106","author":"louis","post":"O.K. You got the point, but since we are still in this somewhat illusory world of material things, we must be aware about the ancient but suffering communities, struggling to survive. One of the following videos shows one of these communities (also in Assad’s Syria) who seem to be singing in Moscow (Putin’s territory)! http://www.mashpedia.com/Assyrian Church of the East.","date":"2014-04-21","mins":"7:13 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-102420","author":"louis","post":"The influence was exercised by the three “greats”: Konrad Adenauer (Germany), Robert Schuman (France) and Alcide de Gasperi (Italy), all of them staunch Catholics, but times were different then. Hirohito was obliged to sign a document renouncing the bit of “divinity” that was claimed, a royal prerogative. What we see here are cultural differences and that is why there is no change in Iraq and Afghanistan..","date":"2014-04-22","mins":"1:25 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-102010","author":"louis","post":"Easter Sunday:Archbishop Justin Welby, Primate of England, sent a message of hope to those suffering for their faith, talking about Resurrection and persecution..","date":"2014-04-21","mins":"1:12 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-102011","author":"louis","post":"The link is here: http://news.yahoo.com/anglican leader praises persecuted christians easter sermon 160310587.html.","date":"2014-04-21","mins":"1:12 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-102071","author":"louis","post":"O.K. Putin and Ukraine is one thing, Assad and Syria is another, Putin is ex KGB, Assad is a doctor who studied in England while his wife studied in an Anglican school there. The democracy the West was expecting did not appear in the Middle East, what appeared was fundamentalism. Look what happened in Egypt and the people there were simply lucky to have Mursi overthrown and general Mohammed al Sissi take charge. His policy is to also protect the Copts, a recent sign of this being his visit to Patriarch Tawadros on Easter Sunday. The same sort of thing is happening in Syria. You are badly mistaken, the anti Assad King Abdullah of Jordan went to the Vatican to try to influence the Pope but had no success, the pontiff knew better. Whatever their defects, which were many, neither S. Hussein or Gaddafi were in favour of A/Q. B/L was of Saudi origin, he came from a country where not even a Christian chapel can be built, although they are the ones who finance the hundreds of mosques being built all over the world in “Christian” countries. Have you seen what Prince Charles and Prime Minister David Cameron said about protecting Christians recently? Are they badly informed? Have you seen the plight of Christians in Pakistan? Where was B/L found? The military there didn’t know anything about it? Why is Pakistan getting even more closer to Saudi Arabia? You will see now why Patriarch Karim’s video interview makes sense..","date":"2014-04-21","mins":"5:23 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-102048","author":"louis","post":"Hi O.K. You call me naïve? Is that because you are Catholic in Eastern Europe and aiming at Putin, a Russian Orthodox Christian? I am in direct and almost constant contact, sometimes personal, with Syrian (Arabic speaking) Christians, both clergy and laity. I have to because of my research into early Christianity. It began years ago when I was invited for coffee and an opportunity to meet and talk to the Iraqi prelate Mor Severios Jamil Hava, bishop of Baghdad, which was preceded by the usual two hour mass celebrated in Aramaic. I have come to learn what really is going on in Syria through them in the process, although politics does not interest me that much, but we live in this … world. Would you call Mor Cyril Aphrem Karim, recently elected the supreme head of the Syrian Orthodox Church a liar? Watch the video, then tell me: He is Syrian born and speaks English fairly well, having studied at Saint Patrick’s,Maynooth, Ireland, a Catholic institution. I don’t think Putin is a saint, on the contrary he seems to use his cunning KGB mind, but to blame him for what is going on in Syria… Best..","date":"2014-04-21","mins":"4:00 pm","url":"https://shroudstory.com/2014/04/20/alleluia-christ-is-risen-he-is-risen-indeed-alleluia/","cat":"history","title":"Alleluia! Christ is Risen! – He is risen indeed! Alleluia!"},{"id":"comment-149499","author":"louis","post":"There are hundreds of findings when it comes to Jewish magical incantations, ostraca and magical bowls. It was common practice to have these objects, although they were prohibited in the Old Testament. Dozens of magical documents were found in the Cairo Genizah and have even been published, James Davila wrote about the excavation in Nippur: ” nearly every house excavated in Nippur had one or more incantation bowls buried in it.” Many, but not all, of them were protections against Lilith, some were curses and so on. Shlomo Moussaieff has the biggest collection of such objects. Last, but not the least, the priests at the Temple were known to practice witchcraft, the competition to reach the office of High Priest was strong. Monotheism, as we know it today, was defied by the Council of Nicaea in AD 325..","date":"2014-09-08","mins":"4:45 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"},{"id":"comment-149544","author":"louis","post":"Kabbala has its roots in gnosticism, it is speculation, nothing to do with the OT. It certainly began as a reaction to attacks on the deity, as described in the OT, and curiously the defence absorbed elements coming from the opposite camp.The “Last Supper Papyrus” is indeed NT orthodox, using Jewish imagery, and the folds may really indicate that it could have been kept in a frame, as a prayer, to stimulate faith, and not used as a “charm”. Jeanna Bryner has demonstrated bias..","date":"2014-09-08","mins":"10:36 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"},{"id":"comment-149526","author":"louis","post":"Sorry, in the last line “defied” should read “defined”..","date":"2014-09-08","mins":"8:09 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"},{"id":"comment-149273","author":"louis","post":"Dan, you may have not noticed that I posted a link to the papyrus on the blog around a week ago. Anyway, we can deduce two things from the discovery: The Egyptian Christians were influenced by ancient Egypt and therefore adopted the concept of “charms”. We also have examples in the Old Testament, where ideas from surrounding cultures, particularly Mesopotamian, crept into some texts. The text shows strong influence of Old Testament ( strictly Jewish) imagery..","date":"2014-09-07","mins":"12:03 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"},{"id":"comment-149302","author":"louis","post":"No problem, you are bound to forget something or the other in the searching you have to do to keep the blog going..","date":"2014-09-07","mins":"3:48 pm","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"},{"id":"comment-149429","author":"louis","post":"Read the Old Testament in comparison with the literature of the surrounding cultures and the early history of Egyptian Christians in comparison with the milieu to find the evidence..","date":"2014-09-08","mins":"8:12 am","url":"https://shroudstory.com/2014/09/07/an-old-christian-papyrus/","cat":"history","title":"An Old Christian Papyrus"},{"id":"comment-210952","author":"louis","post":"Mr. Donnelly wrote about a “miracle duplication of the actual True Sindon, 33 AD”. I heard this suggestion from my professor of parapsychology years ago but found it unlikely. A lot more research on ancient textiles will be needed. What if Joseph of Arimathea, knowing that Jesus would be put to death, had sufficient time to make arrangements to buy two shrouds, instead of one? It is a possibility. The custom of using just one burial shroud began with Rabban Gamaliel II.","date":"2015-09-22","mins":"3:07 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"id":"comment-210901","author":"louis","post":"In the interview “Professor Giulio Fanti discusses the controversies in the realm of Shroud studies” on http://academia. Edu it is stated that work is being done on what is possibly a 13th century patch going beyond the site from where the 1988 sample was cut..","date":"2015-09-21","mins":"9:00 pm","url":"https://shroudstory.com/2015/09/21/another-overwhelming-evidence-argument/","cat":"history","title":"Another Overwhelming Evidence Argument?"},{"id":"comment-43686","author":"louis","post":"John,you are right about what I would call a “direct line” to God (#8) which has nothing to do with what the biblical narratives say or do not say, in my view, and which can change people’s lives for the better. You may have noticed that there have been highly critical — and highly respected — scholars like D.N. Freedman, a convert to Christianity, who became a Presbyterian minister and did not lose his faith..","date":"2013-09-10","mins":"10:58 pm","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","title":"Articles on the Shroud’s History"},{"id":"comment-73312","author":"louis","post":"For every piece of cloth we have ten theories,with little agreement,prompting additional theories, papers and what not, all this getting us nowhere. I still think that Ian Wilson’s Tetradiplon hypothesis is viable but will need modifications. He did ask Pope John Paul II, to whom he dedicated the book “Holy Faces, Secret Places”, for some ‘glasnost’ in the Vatican. For reasons stated more than once on this blog this will apparently not be possible, there will have to be a change in direction in the realm of Shroud studies for Shroudies to gain the confidence of the authorities. The constructive criticism we see in shroudstory, which is not restricted to chummies, can help pave the way for Shroudies in general to learn from mistakes and change attitudes. Who knows, it may even lead to the ‘glasnost’, that petitions to Rome have not been able to obtain..","date":"2014-01-14","mins":"10:28 am","url":"https://shroudstory.com/2014/01/14/arculfus-shroud-a-guest-posting-by-o-k/","cat":"history","title":"Arculfus’ Shroud:  A Guest Posting by O.K."},{"id":"comment-43517","author":"louis","post":"There is really no such thing as Bible Innerancy and it is only accepted by fundamentalists who end up as unbelievers (and anti Christian!) when they realise they are wrong. It is difficult to find archaeological material from the Patriarchal period and the best Biblical scholars generally use the JEDP theory proposed by Wellhausen to trace the thought processes of the authors of the Pentaeuch. The historical critical method is useful and there are good and respected scholars like Professor Blenkinsopp and Father Fitzmyer, and one can begin with Father Roland de Vaux’s history of ancient Israel..","date":"2013-09-09","mins":"6:19 pm","url":"https://shroudstory.com/2013/09/09/articles-on-the-shrouds-history/","cat":"history","title":"Articles on the Shroud’s History"},{"id":"comment-166663","author":"louis","post":"Now that the Savoys have been mentioned one is prompted to ask why would they keep a forgery in their possession a secret for a hundred years? It doesn’t make sense: https://www.academia.edu/7447446/Was there a link between the Knights Templar and the Turin Shroud An interview with Dr. Barbara Frale Another problem for the history article is that there is nothing in any of the STURP papers or other peer reviewed material published by scientists who were not a part of the team about any sign of a painted image being scraped by a knife..","date":"2014-10-29","mins":"4:16 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-17150","author":"louis","post":"Radford does not seem to have done his homework and has therefore been mixing things unnecessarily, particularly by mentioning the Shroud. As for the James ossuary, Prof. Amos Kloner, former Jerusalem District Archaeologist, and one of those involved in debunking the “Jesus Family Tomb”, had this to say: “The inscription looks new. The writer tried to impart an ancient form to the letters by using contemporary letters….” It did not mean that Oded Golan was involved in the forgery as he acquired the ossuary in the controversial antiquities market, where the IAA is struggling to preserve order. There are very serious people there. In 1967 they listened to Father Roland de Vaux, former editor in chief of the Dead Sea Scrolls, about how to handle these precious documents. Bedouin had been selling fragments in the market..","date":"2012-10-02","mins":"8:55 am","url":"https://shroudstory.com/2012/10/02/bad-science-bad-journalism-religious-hoaxes-all/","cat":"history","title":"Bad Science? Bad Journalism? Religious Hoaxes All?"},{"id":"comment-166924","author":"louis","post":"Quite right..","date":"2014-10-30","mins":"12:22 pm","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-166883","author":"louis","post":"Some of what you state is true, and we have to be objective as far as possible, whether we belong to the pro or authenticity camps. It is true that the STURP report has nothing that places the Shroud between AD 0 and 30. Their examination was in 1978 and during that period everything was calm in the realm of Shroud studies. Not so after that. It was slowly transformed into a minefield, with only chummies allowed to publish whatever they wanted — you yourself noted that — whether it corresponded to the truth or not. This is to say nothing about infighting and a lot more. Did this reach Rome? Of course it did. Unless things change for the better there is no hope for STURP II or any other possibility of hands on examination. Pope Francis is a tough South American hombre, tougher than his Bavarian predecessor, not one to swallow nonsense, wherever it comes from. See the first three paragraphs of: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies There is another big problem. Rome has left the question to science and scientists have no access to the relic now because of the situation that was created, also due to internal and external factors. The expositions are not being held to tell the faithful, the curious and sceptics that their faith or scepticism will depend on the whatever we can learn from the relic. On the contrary, the position of the Church is the traditional one, based on the narratives in the New Testament, as pointed out by Benedict XVI in his book “Jesus of Nazareth”, found in the last paragraph of: https://www.academia.edu/7893085/The Quest for Jesus in Shroud research In a nutshell, it is Resurrection faith,not Empty tomb faith or Turin Shroud faith..","date":"2014-10-30","mins":"8:27 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-166917","author":"louis","post":"Latest News: It may be time to forget the canonical gospels and the Shroud, something more interesting has arisen. It is — you said it! — the book “The Lost Gospel” by S. Jacobovici and B.Wilson. Http://www.amazon.com/Lost Gospel Decoding Marriage Magdalene/dp/1605986100/ref=la B001 H6 U22 W 1 1?s=books&ie=UTF8&qid=1414667013&sr=1 1 Sensationalism always sells, makes it to the New York Times” bestseller list in seconds. We have the blurb with j.D. Crossan saying that it is the last nail in the coffin of “biblical literalism”. But who said that to believe one has to be a biblical literalist in every sense? There are things that are to be taken literally, others not. S. Jacobovici must be careful with Crossan’s comment, it can backfire. If we walk backwards we reach the OT and what happens next? Rabbi Jacob Neusner’s warning has fallen on deaf ears. It’s a pity I concentrated on the chair Karl Marx sat on to write “Das Kapital” for more time than necessary at the BL. Our English “Shroudies”, those in the anti authenticity camp included, could drive there and look for the manuscript..","date":"2014-10-30","mins":"11:54 am","url":"https://shroudstory.com/2014/10/29/barrie-schwortz-dismisses-freemans-claims-it-was-the-science/","cat":"history","title":"Barrie Schwortz Dismisses Freeman’s Claims: It was the Science"},{"id":"comment-170612","author":"louis","post":"One has to be careful when interpreting apocryphal gospels, sometimes called “secondary orality”, although there were multiple versions of a story in texts that appeared to know one another at some level. Had Jesus taken the burial shroud with him out of the tomb he would show it to doubting Thomas as the “snapshot of the Resurrection” and do away with the need to allow him to probe his body. One does not have to be a biblical scholar to understand what the (canonical)Gospel narratives convey, even Caravaggio understood what was meant and expressed it in his Emmaus paintings. Tomorrow we will read the announcement about another “gospel” by Jacobovici/Wilson, where wild imagination has Jesus married to Mary Magdalene, with whom he had two children. Not only is this “gospel” very old, the evidence they claim is simply not there..","date":"2014-11-11","mins":"8:53 am","url":"https://shroudstory.com/2014/11/11/jesus-walked-off-with-his-shroud/","cat":"biblical_evidence","title":"Jesus walked off with his shroud?"},{"id":"comment-170681","author":"louis","post":"Hello David I too like Encyclopaedia Britannica and also agree with you that some details can be disputed, so please send me the extract. There are some sayings that are not in the canonical gospels that could be considered as being uttered by Jesus and they are very few. It is a topic of discussion for some biblical scholars and the major problem is that the apocryphal documents are all dated to beyond AD 150. Did some sayings go unrecorded in the gospels? That has to be discussed..","date":"2014-11-11","mins":"7:45 pm","url":"https://shroudstory.com/2014/11/11/jesus-walked-off-with-his-shroud/","cat":"biblical_evidence","title":"Jesus walked off with his shroud?"},{"id":"comment-170661","author":"louis","post":"As I wrote in the previous comment, care and circumspection are needed when interpreting apocryphal gospels. It also becomes necessary to add that one has to be doubly careful when it comes to late gnostic documents that also have something to do with biblical figures. The latest by Jacobovici/Wilson is some reweaving of gnostic documents with the Joseph and Aseneth (Old Testament) sixth century story and the result is that we get Jesus and Mary Magdalene instead of Joseph and Aseneth. That is the “Lost Gospel” of Jacobovici/Wilson. It is not a Gospel at all. There seem to be no limits to this agenda driven pseudo scholarship..","date":"2014-11-11","mins":"5:02 pm","url":"https://shroudstory.com/2014/11/11/jesus-walked-off-with-his-shroud/","cat":"biblical_evidence","title":"Jesus walked off with his shroud?"},{"id":"comment-200521","author":"louis","post":"Daniel Raffard de Brienne, a descendant of Walter V de Brienne, Duke of Athens, didn’t think so. The de Brienne and de la Roche families were related by marriage. Https://www.academia.edu/9156258/Shroud Studies in France.","date":"2015-05-29","mins":"9:35 am","url":"https://shroudstory.com/2015/05/29/challenging-the-othon-de-la-roche-story/","cat":"history","title":"Challenging the Othon de la Roche Story"},{"id":"comment-25502","author":"louis","post":"This research should have been done years ago. That the Knights Templar were not heretics can be gauged from the fact that (Avignon) Pope Clement V summoned Jacques de Molay, based in Cyprus, to discuss new crusading plans. It was in the interest of the Grand Master to boost morale after the Fall of Acre, but he fell into the hands of Philippe le Bel, whose treasury was empty. One scholar in France who refused to accept the Templar hypothesis was the late Daniel Raffard de Brienne (see the interview article “Shroud Studies in France”, on the HSG website). Some years after that came the successful research conducted by Barbara Frale on the Chinon Parchment and unfortunately all hope in further findings turned out to be an illusion when she apparently made some distortions while working on Arnaut Sabbatier, destroying an entire chapter in an important Shroud book. We are now left hoping that Breton can provide some clues..","date":"2013-02-24","mins":"11:01 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-99702","author":"louis","post":"Biblical archaeology and forgery? One hopes some mention is made of the so called James ossuary, returned to the owner by the IAA because because he acquired it before 1978, with a statement questioning the second part of the inscription: Yaakov bar Yehosef, akhui d’Yeshua James, son of Joseph, brother of Jesus The ossuary’s owner Oded Golan was lucky that the Egyptian Coptic Jeweller Marco Ghattas did not go to Israel to testify, although he did tell the press that he forged at least 20 inscriptions for him. Whoever forged the second part of the inscription thought it would be easy for everyone to swallow it. He seems to have read the New Testament, but not the Old Testament carefully. OT references demonstrate that the inscription should read: Yeshua (Jesus) was the brother of Yehosef (Joseph). This was just one of the flaws,.","date":"2014-04-15","mins":"9:06 pm","url":"https://shroudstory.com/2014/04/15/cnns-jesus-code-six-objects-connected-to-the-biblical-jesus/","cat":"history","title":"CNN’s Jesus Code:  Six Objects Connected to the Biblical Jesus"},{"id":"comment-25514","author":"louis","post":"One further comment: Philippe le Bel had treated Boniface VIII very badly, that being the reason why Clement V knew who he was dealing with. All information in favour of the Templars was suppressed by the French king, who had absolutely no power to prevent de Molay from being led to the stake. If both Church and State are blamed for what happened to the Grand Master then that is like giving a green signal to Baigent, leading to what is now being said about Lirey and Cluny..","date":"2013-02-24","mins":"11:56 am","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-17299","author":"louis","post":"It relates to the first paragraph of what you wrote..","date":"2012-10-07","mins":"4:10 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-25517","author":"louis","post":"Correction: Clement V had absolutely no power to prevent de Molay from being led to the stake. The French monarchy had lost the confidence of the Church, therefore the successors of the Templars were the Knights of Christ, in Portugal..","date":"2013-02-24","mins":"12:11 pm","url":"https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/","cat":"history","title":"David Rolfe we need you"},{"id":"comment-17300","author":"louis","post":"The above comment was the response to Davor Aslanovski’s query..","date":"2012-10-07","mins":"4:12 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17308","author":"louis","post":"As a Jew Jesus would not have been buried naked and perhaps it was the magnitude of the resurrection, as mentioned by Chris B, that made the disciples realise that they had been in close contact with the divine and the reason for preserving the burial shroud..","date":"2012-10-07","mins":"6:19 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17317","author":"louis","post":"Some clarification is needed about my comments, so here they are: Davor has been critical about the personal attacks, insults that are seen in the field of Shroud studies. And, he is not the only one outside the field to point this out. Given the situation, which is not new, there is no reason to doubt that this was brought to the attention of Benedict XVI, and therefore the link made between Davor’s remarks and the message of the Pontiff — particularly the words about cooperation between Shroud groups —as read out by Bishop Vann in Dallas. It seems that it has fallen on deaf years and the lack of respect can only contribute to make scholars —sceptical about the Shroud or not — from participating in some way or the other to the field of Shroud studies. In my view, there is no doubt that Davor can contribute with constructive criticism, if there are conditions for this, and this includes eliminating the hostility, wherever it comes from. This blog is certainly the best for exchanging views about the relic, but at the rates things are going, a lot more moderation may be needed to maintain the good standard..","date":"2012-10-07","mins":"7:57 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17331","author":"louis","post":"You’re welcome, Davor..","date":"2012-10-08","mins":"9:26 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17343","author":"louis","post":"The big problem is that there are Christian scholars who guarantee that the Shroud is 100% genuine but refer to it as the “Shroud” and not as the “Holy Shroud”, others who are not 100% certain that the relic is genuine and give talks about it in churches. For some more, Cardinal Giovanni Saldarini referred to it as an “icon”, his predecessor Cardinal Anastásio Ballestrero was photographed leaning over it, Prof.Carlos Chagas who was the president of the Pontifical Academy of Sciences during the 1988 CD test did not believe it was genuine. No wonder one review of “The Sign” said that the author was more convinced about the authenticity than the Pope. Last but not the least, scholars who believe that Jesus got out of the Shroud alive get more attention than they deserve, a non Christian, who seems to be furthering the interests of his own sect, is the one who helps decide what should appear on the Shroud book list. In these circumstances, who has the right to demand that the Church conduct further tests? Is this the way to convince Professor Christopher Ramsey to kindly continue to keep the doors of his laboratory open? Given what has been stated above, with no personal attacks or insults, it is clear that the correct procedure would have been to let Davor Aslanovski state what he wanted without being provoked and attacked. He has clearly said that he is sceptical about the Shroud’s authenticity, but he is also open minded and may have a lot to offer..","date":"2012-10-08","mins":"6:57 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17524","author":"louis","post":"It is very difficult to be a Christian, and that, perhaps, is what led Nietzsche to say, “The last Christian died on the cross.” That was no doubt an exaggeration he needed to justify the direction he was taking. One can not lose hope, even in this realm of Shroud studies, where it is not fresh news that there was some talk about who among the “Shroudies” was Christian. All of us who use the label “Christian” need to think about it from time to time. It takes us to the “mustard seed” in that parable of Jesus…..","date":"2012-10-11","mins":"9:54 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17289","author":"louis","post":"Yes, Davor, that’s right. If you contact BSTS they have the entire message in one of the previous issues and you may also find it in pdf format over the internet as many issues are now available online. Benedict XVI stressed the need for cooperation..","date":"2012-10-07","mins":"12:50 pm","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-17287","author":"louis","post":"It was a very good idea to post the comments by Davor Aslanovski on this blog, first because despite his scepticism he is still open minded and draws attention to the fact that Christian faith does not depend on relics. Secondly, what he has noticed is also what struck Benedict XVI, therefore his message as read out by Bishop Kevin Vann of Forth Worth, Texas at the last Shroud conference in Dallas. That said, it is also true that “heresy” was not the right word to use, but it seems that Davor was using it in a very broad sense. A scholar like him can contribute much in the field of Shroud studies — if he is given the right conditions..","date":"2012-10-07","mins":"11:56 am","url":"https://shroudstory.com/2012/10/07/davor-aslanovski-sindonology-a-heresy/","cat":"history","title":"Davor Aslanovski: Sindonology a Heresy"},{"id":"comment-69229","author":"louis","post":"John, John P. Meier has an end in sight, and that is when it comes to the Resurrection. He has said that this is off limit for him. By the way, did you notice #29 on the thread “Did the Apostles notice an Image on the Cloth?” It has something to do with what we have exchanged on this blog before..","date":"2013-12-27","mins":"6:39 pm","url":"https://shroudstory.com/2013/12/25/did-jesus-talk-funny-and-when-was-he-born/","cat":"history","title":"Did Jesus Talk Funny and When Was He Born?"},{"id":"comment-67732","author":"louis","post":"John, Kenotic Christology tells us that Christ emptied himself of his divine attributes in order to become a human being. It would be something like this, at least in my view: The Virgin Birth was the divine action for him to enter our “wavelength” and the Resurrection for him to leave it. There were some signs of his divinity in between, but no prerogatives were used. The prerogatives in the beginning (birth) and departure(Resurrection) were “triggered from above”, not by him, and I guess you will understand that. The NT passages that help in a way to grasp this are: John 1: 1 18 Philippians 2: 5 9 The Jerusalem based Irish Dominican biblical scholar Father Jerome Murphy O’Connor, who died recently, felt that to interpret Philippians literally would imply indulging in docetism and James Dunn gave a more allegorical interpretation, both of which are not convincing..","date":"2013-12-25","mins":"4:58 pm","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-69247","author":"louis","post":"John, J.P. Meier got two papal gold medals when studying in Rome but it is Benedict XVI, writing as Joseph Ratzinger, who has given a better explanation in his “Jesus of Nazareth”. It seems that Meier is wrong in judging that the Resurrection is beyond what the historian can tackle. After all, what can be deduced from the Gospels is that the Resurrection was a less historical event, but isn’t that sufficient for a historian or should it be left to those in the field of psychical research to decide? As for Crossan, I did read his lengthy book on the Historical Jesus for review. How can one who believes that Jesus’ dead body was eaten by wild dogs be considered a Christian? Only as an Unitarian, perhaps. I once questioned the editor of a Protestant magazine about the decision to interview him, where he was presented as the world’s best Jesus scholar! That was obviously said in order to sell as many magazines as possible — the money line again! — and the editor told me that Crossan still had faith. It could be in the supreme being we call God, but certainly not the Christ of faith..","date":"2013-12-27","mins":"7:32 pm","url":"https://shroudstory.com/2013/12/25/did-jesus-talk-funny-and-when-was-he-born/","cat":"history","title":"Did Jesus Talk Funny and When Was He Born?"},{"id":"comment-65612","author":"louis","post":"It is probable that the way in which the burial cloth lay in the sepulchre convinced the disciples instantaneously that the body had not been stolen, it had left the cloth. Whether an image had contributed to the conviction is another story because the Gospel makes no mention. But we must also remember than any image would not be noticed there and then, being on the inner side of the cloth. Just the position of the cloth would be enough for the disciples, excited as they were..","date":"2013-12-23","mins":"9:32 am","url":"https://shroudstory.com/2013/12/23/did-the-apostles-notice-an-image-on-the-cloth/","cat":"history","title":"Did the Apostles Notice an Image on the Cloth?"},{"id":"comment-116912","author":"louis","post":"Come on O.K. I want to see this evidence because if it convincing then you have to put everything aside and translate just the few relevant lines in English for us. After all, you know that we have been waiting for decades for concrete evidence and you will save IW and us a lot of time..","date":"2014-05-11","mins":"11:40 am","url":"https://shroudstory.com/2014/05/11/drop-the-alexios-i-komnenos-letter/","cat":"history","title":"Drop the Alexios I Komnenos Letter"},{"id":"comment-117257","author":"louis","post":"Good question, however since there were no editors around it is possible that the relics were listed as they came into his head..","date":"2014-05-11","mins":"7:53 pm","url":"https://shroudstory.com/2014/05/11/drop-the-alexios-i-komnenos-letter/","cat":"history","title":"Drop the Alexios I Komnenos Letter"},{"id":"comment-116982","author":"louis","post":"O.K. Thanks for the reply. What you mean to say is clear, it may not be concrete evidence but it does help narrow the search. More documentation would have been useful, and if it existed it was probably destroyed during the Fourth Crusade. Many of the documents Napoleon looted from the Vatican Archives are said to have been used by shopkeepers to wrap their goods. They probably obtained it from overloaded carts taking the material from Rome to Paris, with documents falling on the ground. I wish you success in your research!.","date":"2014-05-11","mins":"1:23 pm","url":"https://shroudstory.com/2014/05/11/drop-the-alexios-i-komnenos-letter/","cat":"history","title":"Drop the Alexios I Komnenos Letter"},{"id":"comment-144538","author":"louis","post":"Part of the conflict can be traced to the “brits” laughing at what the “yanks” had seen on the Shroud while turning a blind eye to what some of their own members also claimed to have seen. Just have a look at the older issues of the BSTS newsletter. Yes, T. Litt questioned some of the findings by U. Baruch but his methodology was in turn dismissed by A. Danin. He had used a powerful, confocal lens, not removed and washed the grains for examination, and did not publish anything. The result;A.Danin stands by what U.Baruch said he discovered..","date":"2014-08-18","mins":"8:20 am","url":"https://shroudstory.com/2014/08/17/evidence-of-the-resurrection/","cat":"history","title":"Evidence of the Resurrection?"},{"id":"comment-144392","author":"louis","post":"Scepticism about the resurrection of Jesus is quite common today, be it among theologians or among laymen. Some theologians refer to the event in a sense that is not traditional, there are churchmen who are vague when it comes to definition and there are those laymen who pretend they believe in it when in fact they don’t. When Jesus is not buried in Talpiot( east Jerusalem) https://www.academia.edu/7471223/Jesus was not buried in Talpiot   Part III his remains are to be found in Kashmir (north India): https://www.academia.edu/7893085/The Quest for Jesus in Shroud research Both theories have hidden agendas..","date":"2014-08-17","mins":"4:20 pm","url":"https://shroudstory.com/2014/08/17/evidence-of-the-resurrection/","cat":"history","title":"Evidence of the Resurrection?"},{"id":"comment-144412","author":"louis","post":"Actually there are more flaws in the Talpiot tomb theory, one recently brought to light by Père E. Puech. The body of a crucified person was never brought into a family tomb, it would have to be buried alone for the “earth of Israel” to purify the bones of sin. The documentary kept quiet about this. The James ossuary, which jokingly came to be called the “Protestant hoax”, was on the list of Discovery’s Top Ten Hoaxes, the IAA returned the bone box to the owner without authenticating the second part of the inscription..","date":"2014-08-17","mins":"6:07 pm","url":"https://shroudstory.com/2014/08/17/evidence-of-the-resurrection/","cat":"history","title":"Evidence of the Resurrection?"},{"id":"comment-207400","author":"louis","post":"Mario has done his best to forge a link in the chain of the Shroud’s history, taking us to Sainte Chapelle. This apparently is also due to the fact that the Templar hypothesis has gaps to be filled. Daniel Raffard de Brienne dismissed the hypothesis because he judged the Templar head to have been a sculpture, probably based on some of the depositions during their trial: https://www.academia.edu/9156258/Shroud Studies in France On the other hand, other depositions did not mention sculptures and Dr. Barbara Frale felt that the topic was not part of de Brienne’s expertise: https://www.academia.edu/7447446/Was there a link between the Knights Templar and the Turin Shroud An interview with Dr. Barbara Frale Then we have the respected historian Malcolm Barber saying that “unless it can be shown that the Templar idol was the Shroud, there is no reason to assume that the painting was intended to represent Christ in the first place.” He was referring to the Templecombe image. We know that the head was not “Baphomet” and also that Jacques de Molay was summoned from Athens to France by Clement V to discuss plans for a new crusade. It would also be in the interest of the Grand Master to boost the morale of the knights after the fall of Acre. Philip the Fair arrested Jacques de Molay because his treasury was empty and forced Clement to suppress the crusader order. He was not one to respect the papacy, and Boniface VIII also had problems with him. Christ was so important to the Templars that their “successors”, the “Ordem de Cristo” (Order of Christ) in Portugal continued the tradition. It was the cross and the sword that made knights of this order such as Vasco da Gama and Pedro Álvares Cabral go in search of new lands, taking monks along with them. In about two months time some research I have made will be available..","date":"2015-08-04","mins":"9:46 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207479","author":"louis","post":"Thomas, de Wesselow’s book is good on the whole, his only mistake being that he equates burial cloth with event: https://www.academia.edu/10819998/Book Review The Sign by Thomas de Wesselow Other than this we have to be very careful with what we “see” on the Shroud: https://www.academia.edu/12813935/Does the Shroud show a Mandaean burial.","date":"2015-08-05","mins":"9:23 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207406","author":"louis","post":"Vasco da Gama, knight of the Order of Christ, and navigator. Note the importance of the cross: http://vignette3.wikia.nocookie.net/club de regatas vasco da gama/images/2/23/Vasco da gama logo.png/revision/latest?cb=20140606020115 http://www.marasinews.com/en/portfolio/the most famous european navigator vasco da gama/.","date":"2015-08-04","mins":"11:04 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207430","author":"louis","post":"Lack of documentation is one of the reasons that we have been unable to fill the 1204 1353 gap with a big amount of certainty. Iraqi Archbishop Gewargis Sliwa of the Assyrian Church of the East was able to do some research in his native country that led to the seventh century: http://www.shroud.com/late03.htm#archbishop Many of the documents are now in danger of being destroyed by ISIS and an Iraqi dominican friar is doing his best to save as much as possible. We may still find clues in these ancient documents: http://news.yahoo.com/iraqi friar saved ancient christian manuscripts 174458216.html; ylt=A0 LE Vyh2 Cc FV Lyk Adwd X Nyo A; ylu=X3o DMT Ey N2 Vlb DE0 BG Nvb G8 D Ym Yx BH Bvcw My BHZ0a WQD Qj A1 Mj Vf MQ Rz ZWM Dc3 I.","date":"2015-08-04","mins":"2:05 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207480","author":"louis","post":"Daveb, can you provide an image of the Cathar crucifix?.","date":"2015-08-05","mins":"9:24 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207550","author":"louis","post":"It is possible, David. I am working on the Templar hypothesis, but information is scarce. Another problem is that the knights themselves were accused of holding anti Christian belefs. Was this true only when it came to certain preceptories?This is what Robert Babinet proposed, although he also held the view that they possessed the relic..","date":"2015-08-06","mins":"5:18 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207511","author":"louis","post":"Thanks for the information, Daveb. It is a pity that no image is available. According to Dr. Barbara Frale the Knights Templar got hold of the Shroud before it could fall into the hands of the Cathars. The problem is the usual lack of documentation and speculation is inevitable..","date":"2015-08-05","mins":"6:54 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207774","author":"louis","post":"Daveb, you are right. I at least can easily see a thorn from the plant “Zisyphus spina christi” that Professor A. Danin identified on the Shroud. I have a branch with thorns from the plant, plucked on the outskirts of Jerusalem. Lady Ethel Drower wrote that people never cut down “Christ’s thorn jujube” in Iraq. Have a look at: http://www.flowersinisrael.com/ziziphusspina christi page.htm.","date":"2015-08-08","mins":"5:32 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207809","author":"louis","post":"Professor Heinrich Pfeiffer, SJ had something to say about Abgar and the liturgy in the Eastern Church: https://www.academia.edu/14795646/An interview with Professor Heinrich Pfeiffer SJ.","date":"2015-08-09","mins":"2:03 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207776","author":"louis","post":"India: Illustrated copies of the “Ramayana” and “Mahabharata” show the figures wearing helmet like crowns. The maharaja usually belonged to the “kshatriya”(warrior) caste. The crown used by the last Maharaja of Mysore: http://www.theguardian.com/world/2015/may/27/intrigue royal house kanthraj urs of mysore#img 1.","date":"2015-08-08","mins":"5:51 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-207752","author":"louis","post":"Http://jesuitjoe.blogspot.com.br/2015/05/back to new orleans.html Scroll down to see the crown of thorns that Pope Pius IX is said to have sent to Jefferson Davis..","date":"2015-08-08","mins":"9:08 am","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-101286","author":"louis","post":"They forget to say that Christianity started as a Resurrection movement..","date":"2014-04-19","mins":"11:28 am","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","title":"Happy Easter from Discovery"},{"id":"comment-101326","author":"louis","post":"The problem is not camels, or animals in general, it is the question: were the authors of Genesis aware of bacteria and virus?.","date":"2014-04-19","mins":"12:55 pm","url":"https://shroudstory.com/2014/04/19/happy-easter-from-discovery/","cat":"history","title":"Happy Easter from Discovery"},{"id":"comment-207770","author":"louis","post":"You’re welcome, daveb. It could be, but then what would she stand to gain? Two top US Civil War generals, Sheridan and Sherman, were Catholics — fighting the Confederates. General Robert Lee is also said to have kept a portrait of the Pope at home. Well, both Davis and Lee belonged to the Episcopal Church..","date":"2015-08-08","mins":"4:03 pm","url":"https://shroudstory.com/2015/08/04/from-constantinople-to-lirey-through-the-sainte-chapelle/","cat":"history","title":"From Constantinople to Lirey through the Sainte-Chapelle"},{"id":"comment-148055","author":"louis","post":"The Templars were also in Cyprus..","date":"2014-09-02","mins":"8:20 am","url":"https://shroudstory.com/2014/09/02/history-in-the-unmaking-the-shroud-of-joseph-of-arimathea/","cat":"history","title":"History in the Unmaking:  The Shroud of Joseph of Arimathea"},{"id":"comment-148059","author":"louis","post":"Heraclius, Patriarch of Jerusalem, consecrated the Templar (round) Church in London in honour of the Virgin Mary. See Part II, with photographs in: https://www.academia.edu/7556467/Jesus was not buried in Talpiot   Parts I and II.","date":"2014-09-02","mins":"8:42 am","url":"https://shroudstory.com/2014/09/02/history-in-the-unmaking-the-shroud-of-joseph-of-arimathea/","cat":"history","title":"History in the Unmaking:  The Shroud of Joseph of Arimathea"},{"id":"comment-183122","author":"louis","post":"Moses took “brutal personal revenge” on an Egyptian..","date":"2015-01-13","mins":"8:18 pm","url":"https://shroudstory.com/2015/01/13/history-explained/","cat":"history","title":"History Explained?"},{"id":"comment-167907","author":"louis","post":"It is good for us to have both a professional historian and a professional scientist to act as “devil’s advocates” when it comes to the Shroud. We must remember that even RD served as one when called by the Vatican and Pope John Paul II invited his atheist friend Sandro Pertini to go skiing with him at least once. If anyone picks up a stone to throw at me I will ask, “Are you a Christian? Prove it to me.” No one will be led to faith in Christ in the minefield that is the realm of Shroud studies. Converts to the Christian faith have come into the fold for other reasons, many of them not even having heard about the Turin Shroud. Given what has transpired, maybe the historian should start with the scientist’s hypothesis, beginning at the stake to which Jacques de Molay was led. That will lead to a very interesting discussion..","date":"2014-11-02","mins":"10:38 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168238","author":"louis","post":"We should know what has changed in the bloodstains..","date":"2014-11-03","mins":"10:46 am","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-167959","author":"louis","post":"The dumb bell shaped pellets that one sees in illustrations of the Roman flagrum are said to have caused the welts seen on the image. They are said to be very clear in close ups in David Crute’s high definition filming of the Shroud. The whip is very different from what we see in Mel Gibson’s film..","date":"2014-11-02","mins":"5:01 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168322","author":"louis","post":"Colin, what you refer to as a “pre 1978” is exactly what I meant when I told Charles earlier today to forget about relying too much on artistic renditions and read the STURP reports..","date":"2014-11-03","mins":"2:46 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168328","author":"louis","post":"Colin, at least we know Dr. Alan Adler’s qualifications and can take the findings he obtained together with Dr. John Heller seriously. More DNA studies have been suggested and I expect that those under way will soon be published in peer reviewed journals. The topic was discussed in the interview with Professor Giulio Fanti: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies.","date":"2014-11-03","mins":"3:05 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168356","author":"louis","post":"No problem at all, Colin. The professor himself stated that to answer the last question in the interview he was leaving the field of science to enter into the realm of religious belief. I may be wrong, but I thought I detected a bias in favour of positivism in R. Rogers, as stated in the interview, and he belonged to the older and more prominent group of scientists. Just yesterday I read a short essay by the Italian philosopher Paolo Flores d’Arcais and found his bias against religion unbelievable. The bias was so strong, the man seemed to be so filled with hatred, that some of his arguments were simply unconvincing, he dodged important questions. It is not hard to understand why universities maybe depending on ‘new blood’ research students, as you say. That is welcome, we have to face hard facts, whether we like it or not. The big problem is scientism, and concentrating on existential issues as I am, I find it difficult to believe that objective science is synonymous with existential knowledge. We have to go beyond the universe as we find it. May I say even beyond the universe as the best discoveries and scientific theories say it is? It is a challenge to bring evidence that reality is not exclusively physical..","date":"2014-11-03","mins":"4:34 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168258","author":"louis","post":"Charles, I did read your article and feel the need to point out that one cannot depend only on artists’ depictions of the body of Christ to judge the Shroud. Artists during the period did not necessarily think like each other. If you go through what is written about the bloodstains in Shroud literature you will notice that serum rings were identified around the major blood flows. The stains were reddish brown, similar to crusty dried blood, different from the body image, seen just on discolored fibres and extremely superficial. The bloodstains flouresced under the STURP team’s UV light. Drs. Heller and Adler were serious scientists, the latter was Jewish born, with no axe to grind, and was a world authority in bilirubin. Both of them conducted nothing less than eleven tests in order to enable them to make sure that what they saw were real bloodstains. Among the constituents identified were protein, albumin and bile pigment bilirubin. What need new confirmation is the serum that was identified on the bloodstains under the body image..","date":"2014-11-03","mins":"12:04 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168366","author":"louis","post":"Have you read the STURP reports, Charles? If you haven’t then it is better for you to read them first, even Colin told you that soon after I did. I am sure you have read some bloggers telling you that you have been biased from the start. How can you defend yourself?.","date":"2014-11-03","mins":"5:11 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-168414","author":"louis","post":"David, it would be great if you could make that pigtail image available to all of us. Hugh, Ian Wilson wrote that he saw a stain, possibly hair oil used to “bind” the pigtail, on the Shroud in 1973 and that he had wanted Scotland Yard to examine it in 1978. I don’t know whether he made a formal request, and it seems to have been forgotten. It is said that the pigtail was a symbol of Jewish resistance to Roman rule and was left unbound only on feast days..","date":"2014-11-03","mins":"8:09 pm","url":"https://shroudstory.com/2014/11/01/history-vs-science-the-freeman-beat-goes-on/","cat":"history","title":"History vs. Science:  The Freeman Beat Goes On"},{"id":"comment-16503","author":"louis","post":"It is very strange, but no surprise, that Karen King does not mention the provenance and context and she certainly does know that good archaeology demands such a procedure. At first sight the papyrus is a fake..","date":"2012-09-19","mins":"8:15 am","url":"https://shroudstory.com/2012/09/19/hot-new-topic-the-wife-of-jesus/","cat":"history","title":"Hot New Topic: The Wife of Jesus"},{"id":"comment-78380","author":"louis","post":"Annette, re.#99. Thanks for the remarks. I am posting this here as the Reply/Quote mode is still not working. There are diferences between what is said about the deities in Greek mythology and the Resurrection of Christ, as given in the NT. Your remarks about Paul are mostly correct, however I don’t believe he was a Hellenized Jew to the extent that Philo was. The early Christians faced lions, could heal and cure (admitted even by their enemies), lived a community life admired by non Christians and so on, but surely not because of a burial cloth. You can bet on it: If it was a burial cloth, that would be clearly stated in the gospels, where as I said, it receives a little more than a passing mention. There is another problem.The Western world is becoming increasingly sceptical, but it is not the Shroud that will take them back to church, the Shroud will not provide solutions to all their doubts, much more is needed..","date":"2014-02-11","mins":"2:56 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78360","author":"louis","post":"Annette, I left a response for you in # 98, however these Quotes and Replies are not working as they should and you may not have noticed it..","date":"2014-02-11","mins":"1:51 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78452","author":"louis","post":"Hi Annette, Paul was thought to be mad because ” too much learning had made him mad.” It seems that his learning enabled him to distinguish Greek myth from Christian faith, and of course his very Jewish unconscious helped. Can we date early Christianity till around AD 300? If yes, then there was no financial support, meaning that there were no external resources. With Constantine on the scene things changed. It could be that there are many people who ponder on the Shroud and think it bolsters faith in the Resurrection. I stick to the Church’s point of view, it can be a prop, and it is certainly not a foundation for faith. Jesus said, “When the Son of Man returns, will he find faith?”… You see? He knew about it 2000 years ago….. And it is just the beginning..","date":"2014-02-11","mins":"7:50 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78463","author":"louis","post":"Annette, I don’t think so, also because I prefer my own independent line of research, while keeping an eye on what is being said out there, some of it useful, some of it not. Are you planning to be there and are you a member of SBL? May I ask: what makes you sceptical about the NT?.","date":"2014-02-11","mins":"8:37 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78459","author":"louis","post":"Annette, re. 114 “Louis, I admire your adherence to Story… however, I’m more in adherence to Shroud phenomenon (non Story) and how it will move this next generation scientifically and spiritually.” I can understand what you are saying, in fact that is what at least some Shroudies feel. I beg to differ, thinking that Jesus’ message also was “take it or leave it”, it is evident in the gospel and he was instructing his disciples. That, to me at least, is another of Jesus’ timeless sayings, it applied in AD 1, it applies in AD 2014. Science? It can help, but only to an extent. It can answer the How questions, but never the Why questions. Stephen Hawking tries, and has failed, but he’s a great fellow, knows the limits of science, and is is a member of the Pontifical Academy of Sciences..","date":"2014-02-11","mins":"8:09 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78605","author":"louis","post":"Hi Annette, here’s a hurried comment as we could go on and on. No offence is intended when I say that you have been influenced by Harvard theology, or should I say, Talpiot? I think much of what Bultmann said is no longer valid as he was influenced by Heidegger. In the end, he continued to be a liberal Lutheran and Heidegger, the ex Jesuit seminarian who fought with the Jesuits, called a priest to his home and asked for a Catholic burial. His faith was revived by history, not by philosophy or Bultmann’s theology. I think one has to read in between the lines to get to the core of Jesus’ message, but it involves head and heart..","date":"2014-02-12","mins":"6:27 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78795","author":"louis","post":"Hi Annette, I wouldn’t say that the 4 gospels are gnostic,because if they were the decisions taken at Nicaea would be different. Like Father Rudolf Schnackenburg I believe Jesus is hovering above the gospels, in fact it was something that even Albert Schweitzer felt, therefore the existence of the mysterium Christi till today. One has to read between the lines. Nicknames were common in the first century, the names during the Second Temple were different, but to judge everything as allegory? Have you written anything on this topic? Some of the things I wrote are on the HSG website..","date":"2014-02-12","mins":"6:08 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78803","author":"louis","post":"Max re. 121, The Sanhedrin had two tombs reserved for Jews who had been executed as criminals. Why was Jesus not buried in one of them? It could be that Joseph also had clout and convinced the religious authorities that he would look after the burial arrangements..","date":"2014-02-12","mins":"6:24 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79045","author":"louis","post":"Max, it is not difficult to concede that Joseph took matters into his own hand knowing that the family owned no tomb. What may have happened is that the religious authorities kept an eye and took him to task after that. They had to know what was going on as the body could not be left on the cross and if no one came to claim it the procedure would have been to arrange for the burial in one of tombs(dug in the soil) reserved for criminals. Can you give me the source for #135?.","date":"2014-02-13","mins":"1:29 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79053","author":"louis","post":"Max, please reply the fastest possible..","date":"2014-02-13","mins":"2:12 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79075","author":"louis","post":"Max, very many thanks. I needed this in the context of a paper I am writing, which,God willing, should be ready and posted next month..","date":"2014-02-13","mins":"3:26 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77471","author":"louis","post":"Assuming the TS Man is Jesus, how do we know at what time exactly the Resurrection took place? Is it being assumed that it was timed to be some minutes before the disciples arrived at the tomb on early Sunday morning? We have “Holy Saturday”, which is based on the discovery of the empty tomb on Sunday, but how do we know that the Resurrection did not take place on Friday night or on Saturday? Who knows, God may have wanted to reveal the good news in sequence, first the discovery of the empty tomb, then the appearances, not the other way round, perhaps to reduce the shock for us humans..","date":"2014-02-08","mins":"8:54 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79999","author":"louis","post":"Hi David Mo: I have written about biblical archaeology and studies for years and Yohanan is nothing new to me, however do send a lead whenever you find something else that could be useful..","date":"2014-02-17","mins":"7:30 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79132","author":"louis","post":"Anonymous alias Yannick, since you butted in let me explain the following: For some reason or the other between 63 BC and around AD 30 the Romans did not allow the Sanhedrin to carry out any death punishment, they had to be the executioners, and the Jews could handle the remains of executed Jews as they wished. Jesus was not buried in a tomb that had been used, it was probably one that Joseph had kept ready for himself and his descendants. Being unused, it it was in keeping with Jewish law to bury Jesus, crucified as a criminal, there. That is what Max meant by Halakhah..","date":"2014-02-13","mins":"7:01 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-79406","author":"louis","post":"Max, stop spoonfeeding..","date":"2014-02-14","mins":"3:04 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77237","author":"louis","post":"John, You correctly pointed out the Dr.Baden JFK lone assassin link and rightfully stressed the reports by Drs. Bucklin and Zugibe. As for Jesus in India, this rubbish gained worldwide attention due to the agenda driven work of Holger Kersten, his book cover showing the Shroud face with eyes wide open. Actually Kersten became a Buddhist and wanted to put Jesus as no. 2, however he based most of his work on spurious and unfounded reports. For the debunking, see: http://holyshroudguild.org/uploads/2/7/1/7/2717873/the quest for jesus in shroud research.pdf.pdf.","date":"2014-02-07","mins":"8:52 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77899","author":"louis","post":"Annette, surely you don’t believe that a burial cloth led to the birth of Christianity? The apostles, including Paul, would have to taken it around while they were preaching, particularly about the Resurrection, but they didn’t do so..","date":"2014-02-09","mins":"7:55 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-77254","author":"louis","post":"You’re welcome, John.Thanks for the kind remarks. The trouble in this field is that ideology — based on distorted history, where facts are cunningly twisted — is imposed on findings..","date":"2014-02-07","mins":"10:28 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78143","author":"louis","post":"#74 Anonymous: That is the best explanation position we seem to have right now..","date":"2014-02-10","mins":"5:41 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78133","author":"louis","post":"Someone is missing: a forensic pathologist with many years of experience in a morgue..","date":"2014-02-10","mins":"5:05 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78157","author":"louis","post":"Hi Max, I based myself on the images, illustrations, replicas etc. Produced by CES. It is possible that a talit was used, but why should there have been two of them?.","date":"2014-02-10","mins":"6:49 pm","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-78308","author":"louis","post":"Hi Annette, Sorry I can’t agree with you and I’ll tell you why: Paul was a Pharisee who studied with Gamaliel, not a Sadducee easily susceptible to Greek and Roman influence. He “saw” Jesus on the road to Damascus, actually saw a very bright light and heard a voice,and that episode left him blind for a while, so he had no need for any burial cloth. Notice that if you read the Gospels, the burial shroud is only given passing mention, it was just the ignition, and the Jesus movement went forward with the appearances. I used to think that Msgr. John P. Meier was a sort of liberal, but he proved to be conservative at times, and Father Joseph Fitzmyer was more liberal in interpretation but conservative in certain topics, and considered to have “impeccable critical credentials.” Father Jean Carmignac detected expressions in the Gospels that could make more sense in hebrew, so there may have been gospel manuscripts in this language that may have been destroyed during the persecution (remember, Paul was even flogged) and so only the oral tradition was maintained. Msgr.Meier is of the opinion that Jesus’ divinity was recognised before the Easter event, but that is not what Fr. Fitzmyer thinks. He stresses that the Resurrection is the central belief of Christianity and it was this event that led to the change in name, that is, from Jesus of Nazareth to Jesus Christ…. And he was of course not referring to the Shroud.: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ.","date":"2014-02-11","mins":"9:25 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-172065","author":"louis","post":"Hello Colin You are sounding like errrr… Ian Paisley now, one step before beginning to vomit. You know he lost to Martin Mc Guinness. We need your comments as a published scientist. Are you working on Rogers versus Fanti?.","date":"2014-11-19","mins":"9:50 am","url":"https://shroudstory.com/2014/11/19/i-think-he-sees/","cat":"history","title":"I think HE sees?"},{"id":"comment-78311","author":"louis","post":"Hi Max, since you refer to two cloths, as well as to flowers, plants and even objects, do you agree with Professor Danin and, if yes, in which cloth would the images be?.","date":"2014-02-11","mins":"9:33 am","url":"https://shroudstory.com/2014/02/07/how-certain-are-we-that-the-man-on-the-shroud-is-in-rigor-mortis/","cat":"history","title":"How certain are we that the man on the shroud is in rigor mortis?"},{"id":"comment-44201","author":"louis","post":"This is a good approach and will help to improve the blog, but it should go hand in hand with the prohibition of personal attacks and mean insinuations. As for intellectual honesty, Rogers may have changed his mind about invisible mending, which did not make him less sceptical about the supernatural it seems. Apparently it did not clash with his worldview, for he had other means to express his views about a natural process in image formation. So far so good, but then it does not seem to have been the case when he co authored a paper which involved evolution. In this paper the process was automatic, and nothing was said about the rationality. In other words, the question about where the rationality came from was conveniently avoided. No one expects a scientist to become a philosopher overnight, but it was something that would require just a few minutes of thinking. Was it bias or intellectual dishonesty? One must remember that when a scientist quietly embeds a worldview into his science he ceases to be a scientist because he is then indulging in scientism..","date":"2013-09-14","mins":"10:31 am","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","title":"Intellectual Dishonesty in Shroud of Turin Research"},{"id":"comment-44223","author":"louis","post":"Thanks Ron, some sense of humour is also needed, it is “in”, what should also be “out” is the use of four letter words – which makes it necessary to delete comments..","date":"2013-09-14","mins":"3:55 pm","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","title":"Intellectual Dishonesty in Shroud of Turin Research"},{"id":"comment-44298","author":"louis","post":"After having interviewed more than one of the world’s topmost biblical scholars — far superior to J.D. Crossan — and confronted them with forthright questions, and spoken to one of the most respected epigraphers in the field of Biblical Archaeology in Israel a very clear picture was obtained of the controversy surrounding Jesus. There were attempts to dodge questions by one scholar but these required answers because sensationalists were hurling all sorts of accusations against respected scholars and institutions. They were therefore duly answered but that was not the case when it came to Jesus. One reply was not at all convincing, it was simply no reply. When it comes to Biblical studies, we, in the 21st century, have no pipeline to Jesus apart from the New Testament and the christologies, which are normative of Christian faith. The bodily resurrection of Jesus is a basic part of the NT kerygmatic proclamation and a fundamental affirmation of Christian faith. When J.D.Crossan rejects this, there is no reason why he should be included among Catholic biblical scholars, even though he is said to have “faith”. His point of view is something like what the Unitarians believe..","date":"2013-09-15","mins":"10:30 am","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","title":"Intellectual Dishonesty in Shroud of Turin Research"},{"id":"comment-44348","author":"louis","post":"This comment was posted in the wrong thread. Here it is: September 15, 2013 at 5:59 pm | #5 Reply | Quote Father Joseph A. Fitzmyer’s book, mentioned in a previous comment, was not written from the point of view of faith and is a must read for Catholic, Protestant, Orthodox and Jewish scholars. In his review, Father Daniel Harrington, another famous American Jesuit scholar, explains how the book is a thorough study of the concept of “Messiah”. But it seems that many in the world are involved in soul searching, unwilling to read scholarly books about the Bible, and go beyond what Boteach and Boyarin or even Fitzmyer have said. That was the case with Laura Schlessinger, criticised by Boteach. Go to the link http://forward.com/articles/7887/dr laura loses her religion/.","date":"2013-09-15","mins":"6:16 pm","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","title":"Intellectual Dishonesty in Shroud of Turin Research"},{"id":"comment-70620","author":"louis","post":"David, your quotation is incorrect, this verse from Matthew is not used to justify the claim about real brothers and sisters, there are others. However, to continue the argument, let us take Mark 15:40, “Mary the mother of James the younger and Joses, and Salome”, where he refers to the mother of the person hanging on the cross. Why didn’t he say “his mother” or “the mother of Jesus”? We can go on and on, but in circles, if only NT data is cited. As Father Raymond E. Brown wisely noted, “the scientifically controllable biblical evidence leaves the question of the historicity of the virginal conception an unresolved problem”, but also acknowledged that the long standing (RC) tradition about the perpetual virginity supplies an answer to that part of the question. The “Lexicon für Theologie und Kirche” – H.Denzinger and A. Schonmetzer, used in the Catholic Church, says (in DS 44,46) that interpreters recall the long tradition about Mary as “Aeiparthenos” or “semper virgo” and prefer to understand the “brothers and sisters” in the broader sense. That is also the argument used by Dr. Matthew Levering. What he said was that the early Church Fathers, after analysing the entiretry of the biblical witness, concluded both that the NT offered no proof that Mary was the mother of the brothers and sisters of Jesus and that the living Mary discovered through ecclesial contemplation of the biblical texts had no child other than Jesus. It was a response to the “burden of proof” that many demand. One of those who demanded such a thing was Ben Witherington, who leaped with joy when the discovery of the James ossuary (provenance unknown) was announced to the world because for him it was an occasion for the Catholic Church to “revisit” the Virgin Birth. The ossuary was returned to its owner, with the government’s verdict intact, that is, the second part of the inscription “akhui d’Yeshua”, “brother of Jesus” is a forgery. That did not deter Witherington. The occasion for him to revisit his claim only arose when the James ossuary was said to have been in the Talpiot tomb, a totally unfounded claim according to the official reports. But it prompted him to say that James was buried elsewhere! It is a problem when scholars coming from a background that has no apostolic tradition, and therefore loaded with bias, ignore even the early Church fathers. But, above all, you seem to have forgotten (or do not know?) that even Jesus’ enemies did not believe that Joseph was his human father…..","date":"2013-12-31","mins":"2:37 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","title":"It Continues:  James, son of Joseph, brother of Jesus"},{"id":"comment-44301","author":"louis","post":"Further to the above, there is an interesting study by the historian and Talmudic scholar Daniel Boyarin entitled “The Jewish Gospels: The story of the Jewish Christ”, which goes beyond what we can learn from the Dead Sea Scrolls..","date":"2013-09-15","mins":"11:18 am","url":"https://shroudstory.com/2013/09/14/intellectual-dishonesty-in-shroud-of-turin-research/","cat":"history","title":"Intellectual Dishonesty in Shroud of Turin Research"},{"id":"comment-74447","author":"louis","post":"That’s right, Annette. You might find the pdf article on Talpiot interesting: http://www.holyshroudguild.org/uploads/2/7/1/7/2717873/jesus  was  not  buried  in  talpiot parts i and ii pdf.pdf More on the topic in about two months time..","date":"2014-01-24","mins":"4:13 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","title":"It Continues:  James, son of Joseph, brother of Jesus"},{"id":"comment-69843","author":"louis","post":"David, it is important to stress that the government returned the James ossuary to Oded Golan but continues to officially maintain that the second part of the inscription, “akhui d’Yeshua”, “brother of Jesus” is a forgery, exactly as I wrote in my article that was published before the IAA report came out. When the police raided Golan’s apartment they found dental drills and it is known that he was in contact with a Coptic Christian antiquarian in Egypt, who did not appear at the trial. Now that is not to say that Golan himself forged the second part of the inscription, it is still not known who did the job. “Akhui” can mean “brother”, “half brother”, “step brother”, “cousin”, “relative”, even “partner”, in Aramaic, just as “adelphos” “plural “adelphoi”, in Greek, can also be understood as “relative” or “kinsman”, as anyone who reads the Gospel according to Mark will understand. Above all, Jesus, nailed to the cross and sensing that death was approaching, was worried about who would look after his mother. What was “brother” James doing and why was he not around? Why did Jesus have to ask a disciple to look after his mother? Moreover, Mary herself must have thought about her future, making Jesus tell her where to look for help. The Orthodox Jewish community, particularly the ultra orthodox branch known as the “haredim”, are very strict about burial sites and the government has to obey them. They were the ones who threw stones on Jerusalem District Archaeologist Amos Kloner. Do I need to say that the orthodox norms have to be respected, even though it complicates matters for those in the field of biblical archaeology? Other belief communities like the Shintos in Japan or the Native American Indians, for example, are also careful when it comes to burial sites. It is not so among the Hindus, because of the belief in reincarnation, also involving metempsychosis, and whose dead are cremated and the ashes scattered on large water bodies like rivers or seas. Statistics do help but it is not advisable to place much importance on them. What we can with certainty is that the names on the ossuaries are: Jesus? Son of Joseph ( the more respected paleographers and archaeologists agree that the name “Jesus” is by no means certain, therefore the question mark. It is worth noting that this question mark appeared in the original report, decades before the controversy began) Mary Mariam (or Mariame) and Mara (it is certainly not “Mary Magdalene”, as written in the two part article “Jesus was not buried in Talpiot” on the Holy Shroud Guild website, which you found informative). As mentioned in my article, even Professor François Bovon of Harvard distanced himself from the allegations made by Jacobovici, realising that he had been led into a trap. He made it clear that, in his view, Jesus was buried in the Church of the Holy Sepulchre area, as also maintained by Dan Bahat and Amos Kloner, both of them former Jerusalem District Archaeologists. Joses Judas, son of Jesus There is more to come shortly and I cannot release any information in advance. As you know, the advances in science make Bible interpretation even more difficult, with both fundamentalists and liberals saying things that are not at all convincing. You may find some more useful information about this in the interview article “What do we know about the Bible? An interview with Joseph A. Fitzmyer, SJ” on the academia. Edu website..","date":"2013-12-29","mins":"11:51 am","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","title":"It Continues:  James, son of Joseph, brother of Jesus"},{"id":"comment-69641","author":"louis","post":"It continues because people with biases, in this case anti Christian or even anti Catholic, just do not want to give up and some of them have not so hidden agendas like Simcha Jacobovici. Exactly three months before, repeat, before, the Israel Antiquities Authority stated that the inscription was a partial forgery I published (in print, not posted on the internet) an article saying the same thing. It was then run on a Shroudie e mail list from Ohio, also before, repeat, before, the IAA declaration. Years after that a Protestant publisher kindly sent me the book on the topic by Shanks/Witherington to read and comment. I thanked them and sent them a copy of my article and they just kept quiet because they had to. Ben Witherington III, of Asbury Theological Seminary, had said that the Catholic Church had to “revisit” the Virgin Birth in the book on the James ossuary he co authored. Later, as soon as the Talpiot sensationalism reached the front pages of newspapers across the world he quickly changed his mind and declared, “No, James is buried elsewhere”. The ossuary cracked when it was flown to Toronto. Where was the crack? Exactly between “Jesus son of Joseph” and “brother of James”. It was as though Jesus sent a message telling those who swallowed the whole story hook, line and sinker upto where the inscription was authentic and where the forgery began! The full Talpiot story is on the Holy Shroud Guild website..","date":"2013-12-28","mins":"5:02 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","title":"It Continues:  James, son of Joseph, brother of Jesus"},{"id":"comment-47557","author":"louis","post":"Joseph Atwill knows next to nothing. Can he answer the question why this is not in the Mishnah? Is he trying to be funny or is this just another attempt to fill the coffers of publishing houses, a complaint often voiced by serious biblical scholars?.","date":"2013-10-15","mins":"9:19 am","url":"https://shroudstory.com/2013/10/15/jesus-fiction-created-by-roman-aristocrats/","cat":"history","title":"Jesus:  Fiction Created by Roman Aristocrats?"},{"id":"comment-69890","author":"louis","post":"David, Many thanks for the comments. Yes, there is no evidence that the Mariamene/Mara on one ossuary is Mary Magdalene. Professor François Bovon was totally unaware of the premise of the programme when he was interviewed, and distanced himself from the Talpiot sensationalism by saying that his interest was not historical but on the level of literary traditions. Father Joseph A. Fitzmyer went further, and although he found Professor Bovon’s paper “Le privilege pascal de Marie Madeleine” good he also pointed out that in Part III, “Acta Philipi”, “no evidence was given that the Mariamne in that writing was the name of Mary of Magdala.” It is a problem when you use fourth century literature to claim something about what went on in the first century in Jerusalem. Charles Pellegrino was more cautious than Simcha Jacobovici,but did not seem to have dedicated more time to homework. He consulted Father Mervyn Fernando of Sri Lanka about the Resurrection when this priest is not known for biblical studies, more for theology one could say, having been drawn into this area by the half Indian, half Spanish priest Raimundo Panikkar whom he met in the ashram of another priest, the Englishman Dom Bede Griffiths, in the south of India. Why didn’t he consult biblical scholars in the US when there are so many good ones there? You are quite right when you say that Jacobovici has not been cautious in his assertions, and that he because he is desperate, even given to clutching at straws, going beyond Jerusalem by providing a link to the Kashmir tomb! So, if Jesus’ remains are not in Jerusalem they are in Kashmir, is it? It seems he had done even less homework than Pellegrino, as you will see in the article: http://holyshroudguild.org/uploads/2/7/1/7/2717873/the quest for jesus in shroud research.pdf.pdf Unfortunately the myth is being used for political purposes. J.P. Meier, now a monsignor, is a good scholar, but has been challenged by two other well known Catholic scholars, Luke Timothy Johnson in the US and Father Anthony Kelly in Australia. The Virgin Birth is not part of the earliest tradition, it was part of the developing Christology, but in New Testament times. Father Fitzmyer also sees a problem, which you can see in the interview article “What do we know about the Bible? An Interview with Joseph A. Fitzmyer, SJ” on the academia.edu website. But we can can go further because while he does point to the fact that the only ones who touch upon it are Matthew and Luke, he also draws attention to another fact: Paul knows of Jesus’ Davidic descent and stresses Jesus’ birth “from a woman”. He also knows of Jesus’ divine sonship and implies his pre existence and neither of these details are considered by him to be in conflict with the two other preceding facts. If there were adopted brothers and sisters around Jesus as he hung, nailed to the cross, there would be no worry about who would look after his mother. There should be some news for you about the combination of names after I work on this and other material in March. All I can say now is that people who found this significant at the time of the publication of the Pellegrino/Jacobovici book are now more cautious, distancing themselves from what was claimed by the duo..","date":"2013-12-29","mins":"6:35 pm","url":"https://shroudstory.com/2013/12/28/it-continues-james-son-of-joseph-brother-of-jesus/","cat":"history","title":"It Continues:  James, son of Joseph, brother of Jesus"},{"id":"comment-120138","author":"louis","post":"That is likely. Mel Gibson’ “The Passion of Christ” has Jesus with almost shoulder length hair while the disciples look as though they went for haircuts quite regularly by first century standards..","date":"2014-05-15","mins":"6:13 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-120596","author":"louis","post":"St. Paul would probably reject using shampoo if he were here with us today. This discussion is interesting and valid because it relates to Shroud studies and the length of Jesus’ hair. But even more important are the words of Jesus and the peacemakers who take them very seriously. American Cardinal Theodore Mc Carrick and US bishops have done what no politician has ever shown: http://www.catholicherald.co.uk/news/2014/05/15/us bishops and iranian ayatollahs hold talks on nuclear arms/.","date":"2014-05-16","mins":"7:49 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-122264","author":"louis","post":"The Catholic Truth Society in London, England has just published a booklet by Dr. Pravin Thevathasan,psychiatrist and editor of the “Catholic Medical Quarterly” in that country and a convert to Catholicism. It has something to do with the difference between psychiatric problems and visions and apparitions. There are two links:: http://www.catholicherald.co.uk/commentandblogs/2014/05/19/we need both medicine and catholicism to understand mental illness/ http://www.dioceseofshrewsbury.org/news/attachment/dr pravin thevathasan.","date":"2014-05-20","mins":"5:56 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-122237","author":"louis","post":"Paul needed no shroud for his missionary work, his zeal came with the experience on the road to Damascus..","date":"2014-05-20","mins":"5:03 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-122775","author":"louis","post":"If Paul was flogged and stoned for preaching his new message, trampling on part of the old, it could be worse for him walking about displaying a burial shroud, an unclean object. It would have been ripped from his hands and destroyed..","date":"2014-05-21","mins":"3:34 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-122816","author":"louis","post":"Hi Dave (Hines, there are many Davids but not a single Goliath here): No one can disagree with you when you write about Paul, he is still a strong force to reckon with. If you are studying the apostle perhaps you could read — that is, if you have not already read them — two books by Joseph A. Fitzmyer, SJ, not only a world renowned NT scholar but also the foremost Pauline scholar of the 2 Oth century: “According to Paul: Studies in the Theology of the Apostle” (Paulist Press) “Spiritual Exercises based on Paul’s Epistle to the Romans” (Eerdmans). An interview with Father Fitzmyer is in the link if you are interested in reading it, however there is nothing about Paul there. Https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ I think it was the experience of the risen Christ that was the impetus for the Jesus movement, the primitive Church, the reason for a complete change in the attitude of the apostles. If a Shroud played an important role, it would, in my view, have been mentioned several times and by several people in what we call Scripture. Whatever you may think about that stated above, I appreciate your work, it is needed a lot today. Best..","date":"2014-05-21","mins":"5:22 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-122322","author":"louis","post":"De Wesselow thinks the Shroud was the Resurrection — and remains agnostic..","date":"2014-05-20","mins":"7:55 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-122831","author":"louis","post":"I knew you would agree, Mike. This was the oral tradition in the primitive communities, that was later put down in writing..","date":"2014-05-21","mins":"5:58 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-120082","author":"louis","post":"Jesus of Nazareth may have had long hair but took no Nazirite vow, he drank wine. Unless, of course, that is interpreted as having been produced by non alcoholic grapes, but that takes us to the Seventh Day Adventists, not the NT..","date":"2014-05-15","mins":"3:59 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-123349","author":"louis","post":"Hi Dave, it is good to see that you are one who analyses issues carefully. There is much to study and I trust that excavations in Turkey may bring more things to light. I think the absence of a historical record in scripture is due to the fact the Jesus movement was a Resurrection movement, not an Empty tomb movement, the references to the empty tomb were only to explain how a supernatural event got that way. Peace..","date":"2014-05-22","mins":"8:33 pm","url":"https://shroudstory.com/2014/05/14/jesus-long-hair-again-and-again-and-again/","cat":"history","title":"Jesus’ Long Hair Again and Again and Again"},{"id":"comment-171388","author":"louis","post":"There is no early evidence that indicates that the witnesses of Jesus’ appearances concluded that Jesus had been raised from the dead because they ALSO knew that the tomb was empty. The personal encounters with Jesus were decisive and later attempts to combine the two traditions — empty tomb and appearances — were done to provide additional support for Jesus’ resurrection for the LATER generation of believers. Stephen Jones is an Evangelical Christian,but I have my doubts if he has ever read the Protestant (Reformed Church) theologian Jürgen Moltmann. Moltmann is not a “Shroudie”..","date":"2014-11-15","mins":"7:59 am","url":"https://shroudstory.com/2014/11/15/john-of-john-the-servant-of-the-priest-that-also/","cat":"history","title":"John of . . . , John the . . . ,  Servant of the Priest? That Also?"},{"id":"comment-114785","author":"louis","post":"What did the Church Fathers think about Jesus as the clean shaven short haired Apollo? Here is a sculpture with a short haired Zeus: http://us.fotolia.com/id/4749961.","date":"2014-05-08","mins":"2:33 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116192","author":"louis","post":"Hi clublu2201, breaking news that will leave you popeyed: http://www.cbsnews.com/news/catholic church denounces planned satanic mass at harvard/.","date":"2014-05-10","mins":"1:26 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-114571","author":"louis","post":"What if the two objects were derived from the same source? Carbon dating has a margin of error and the Image of Edessa was stolen in 1204..","date":"2014-05-08","mins":"8:57 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116124","author":"louis","post":"Some pigment has been detected on the Manoppello image, probably an artist’s work to make the image better, the same that was done to what is preserved in Guadalupe..","date":"2014-05-10","mins":"10:53 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116163","author":"louis","post":"I understand, and if that is the case then the comments should be moderated..","date":"2014-05-10","mins":"12:12 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-114899","author":"louis","post":"That appears to have really been the way they argued and why the Byzantine dominance won in the end. If Jesus had short, wooly hair, that could mean African origin, and there are some who think, even in the realm of Shroud studies. That the Jews were descendants of Africans. “Zeus like” would be more acceptable because Jesus was Caucasian, with a beard like that shown in sculptures of Zeus, but that leaves the question of long hair to be answered..","date":"2014-05-08","mins":"6:20 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116155","author":"louis","post":"O.K. This is not a Catholic blog, it is neutral, the malice can be contagious, and I think this will interest you: http://www.catholicherald.co.uk/commentandblogs/2014/05/08/debate whats the point of catholic blogging/.","date":"2014-05-10","mins":"11:57 am","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116229","author":"louis","post":"Annette saya May 10, 2014 at 2:40 pm “Louis, thanks. This is so Aleister Crowleyish… what a mess that guy was for performing his kooky Black Masses in the early 1900′s… thought he was quiet the intellectual as well… ended up being a child rapist and a misfit. But certain people still give him much adulation… Scientologists for some. Sometimes I wonder why people choose to live in a “satanic” bubble? Why it even needs to be “studied”? Instantly we know its cause and effect!” Hi Annette, I had to post this here since there was no “reply” option. I think these things happen because since God is slowly being edged “out” that leaves a vacuum and the “in” can be filled with just about everything, things like “Religion without God”, the above and so on. Regarding yesterday’s query about “liberal” Harvard and the core of the NT and what is the means of procedure now, on another thread, you might appreciate the intro in: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ The future, in my view, lies in the science theology dialogue, not in scientism and fundamentalism..","date":"2014-05-10","mins":"2:59 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116180","author":"louis","post":"Fully agreed, it happens particularly when comments are anonymous or pseudonyms are used, which is something ruled out by the best blogs. It is not of course always the case, when the commenter is known, but there are also known commenters who have used pseudonyms to attack and insult others with four letter words and post misleading comments.The tactic appears to be dictated by the occasion, that is, depending on what is to be commented..","date":"2014-05-10","mins":"12:45 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-116242","author":"louis","post":"Clublu2201, you can reach me at lcdf72@gmail.com.","date":"2014-05-10","mins":"3:31 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-115016","author":"louis","post":"May 8, 2014 at 8:59 pm Chesterbelloc says, “Louis, I have some books by Cardinal Dulles that I haven’t read yet. Besides Chesterton and Belloc, I really like Cardinal Newman.” Very easy to agree with that, with that brilliant mind, and a saint’s way of life..","date":"2014-05-08","mins":"9:05 pm","url":"https://shroudstory.com/2014/05/08/more-on-the-letter-from-alexius-comnenus-never-have-preconvictions-about-relics/","cat":"history","title":"More on the Letter from Alexius Comnenus:  Never have preconvictions about relics"},{"id":"comment-114755","author":"louis","post":"There was no “Q” as a single source, there were several communities who had oral traditions that were later put down in writing. This oral tradition is of crucial importance to understand the growth of the Jesus movement that became the Church..","date":"2014-05-08","mins":"1:35 pm","url":"https://shroudstory.com/2014/05/08/might-the-av-ivory-have-been-the-inspiration-for-the-pray-manuscript/","cat":"history","title":"Might the A&V Ivory have been the inspiration for the Pray Manuscript"},{"id":"comment-114864","author":"louis","post":"Calvin was just one among others to be cynical about relics, but he also caused a lot of suffering for millions of people for generations with his doctrine of predestination which was used to justify slavery, even apartheid in South Africa. His doctrine weighs much more than what he wrote about the Virgin’s milk..","date":"2014-05-08","mins":"5:19 pm","url":"https://shroudstory.com/2014/05/08/more-on-the-letter-from-alexius-comnenus-never-have-preconvictions-about-relics/","cat":"history","title":"More on the Letter from Alexius Comnenus:  Never have preconvictions about relics"},{"id":"comment-114895","author":"louis","post":"Chesterbelloc, the true cross was part of Calvin’s cynical approach in the overall strategy to get at Rome. By the way,did you like the stuff on biblical archaeology?.","date":"2014-05-08","mins":"6:11 pm","url":"https://shroudstory.com/2014/05/08/more-on-the-letter-from-alexius-comnenus-never-have-preconvictions-about-relics/","cat":"history","title":"More on the Letter from Alexius Comnenus:  Never have preconvictions about relics"},{"id":"comment-115011","author":"louis","post":"You’re welcome, Chesterbelloc. Are you studying apologetics, beyond Belloc and Chesterton, perhaps Cardinal Avery Dulles?.","date":"2014-05-08","mins":"8:56 pm","url":"https://shroudstory.com/2014/05/08/more-on-the-letter-from-alexius-comnenus-never-have-preconvictions-about-relics/","cat":"history","title":"More on the Letter from Alexius Comnenus:  Never have preconvictions about relics"},{"id":"comment-38744","author":"louis","post":"They probably didn’t bother to check that either because M&S doesn’t advertise with them..","date":"2013-07-08","mins":"5:07 pm","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","title":"NBC News on the archaeology of Christianity"},{"id":"comment-173104","author":"louis","post":"The late Daniel Raffard de Brienne was pursuing some research but had no success. He was unjustly accused of being biased in favour of his ancestor Walter V de Brienne, Duke of Athens. However, there was a link with Othon de la Roche and consequently the chest lying at the Ray Sur Saône Castle: https://www.academia.edu/9156258/Shroud Studies in France.","date":"2014-11-26","mins":"9:08 am","url":"https://shroudstory.com/2014/11/26/newly-published-paper-othon-de-la-roche-and-the-shroud-by-alessandro-piana/","cat":"history","title":"Newly Published Paper:  Othon de La Roche and the Shroud by Alessandro Piana"},{"id":"comment-38729","author":"louis","post":"This is funny, the people at NBC did not read the Gospel accounts before commenting and seem to have assumed that there was just one store, some sort of Marks & Spencer, where burial cloths could be obtained..","date":"2013-07-08","mins":"10:43 am","url":"https://shroudstory.com/2013/07/07/nbc-news-on-the-archaeology-of-christianity/","cat":"history","title":"NBC News on the archaeology of Christianity"},{"id":"comment-21402","author":"louis","post":"There’s no need to thank me for anything, Angel, I’m just trying to help. As I said, the relics are said to have been traced only to the fifth century and details about the 1972 authentication are needed. Only then can further discussion come. Happy New Year and best wishes!.","date":"2012-12-31","mins":"4:32 pm","url":"https://shroudstory.com/2012/12/23/paper-chase-the-conspiracy-against-the-shroud/","cat":"history","title":"Paper Chase:  The Conspiracy Against the Shroud"},{"id":"comment-30037","author":"louis","post":"Heythrop is Jesuit run, therefore it is no surprise that they have been tolerant in publishing the paper that may eventually be proved to be wrong in its conclusion if it is based on data that can, in turn, be shown to be faulty,.","date":"2013-04-09","mins":"10:57 am","url":"https://shroudstory.com/2013/04/09/paper-chase-new-peer-reviewed-article/","cat":"history","title":"Paper Chase:  New Peer Reviewed Article"},{"id":"comment-21158","author":"louis","post":"The critical issues that the Church will have to tackle are very deep and do not involve the TS. Many have left the fold because they have seen a lot of superficiality and idle talk, little in practice. They are not interested in the relic and find it absurd that some Christians use it to keep their faith going. Who knows, if there is some ego bashing in the realm of Shroud studies, that could help stimulate more belief in God indirectly..","date":"2012-12-26","mins":"9:15 pm","url":"https://shroudstory.com/2012/12/23/paper-chase-the-conspiracy-against-the-shroud/","cat":"history","title":"Paper Chase:  The Conspiracy Against the Shroud"},{"id":"comment-21034","author":"louis","post":"It all depends on the kind of Gnostics to which reference is being made. While they would not have manufactured such a relic a supernatural interpretation of the image would certainly be welcome..","date":"2012-12-23","mins":"6:15 pm","url":"https://shroudstory.com/2012/12/23/paper-chase-the-conspiracy-against-the-shroud/","cat":"history","title":"Paper Chase:  The Conspiracy Against the Shroud"},{"id":"comment-21382","author":"louis","post":"Hullo Angel, It is doubtful that these relics are genuine since they appear to have been traced only till the fifth century and the credibility is probably due to the fact that there is no feather from St. Michael the Archangel. The Archdiocese of Chicago will have better information for you since the Church is said to have authenticated them in 1972. One must know the criteria that was employed. The phenomenon of incorruption is much more interesting and more palpable and there are cases like those of Bernadette Soubirous, the Arab Charbel Makhlouf and Blessed Charles I (von Habsburg Lothringen), last emperor of the Austro Hungarian Empire, to name a few. Some years ago reports said that the Church had ordered an investigation. All best wishes!.","date":"2012-12-31","mins":"8:39 am","url":"https://shroudstory.com/2012/12/23/paper-chase-the-conspiracy-against-the-shroud/","cat":"history","title":"Paper Chase:  The Conspiracy Against the Shroud"},{"id":"comment-21368","author":"louis","post":"Angel, Sorry to tell you that those who are agenda driven are making the most noise in this topic and the link has merely given them attention. Happy New Year and all the best!.","date":"2012-12-30","mins":"7:00 pm","url":"https://shroudstory.com/2012/12/23/paper-chase-the-conspiracy-against-the-shroud/","cat":"history","title":"Paper Chase:  The Conspiracy Against the Shroud"},{"id":"comment-71272","author":"louis","post":"There is one incorrect statement being repeated above. Professor Avinoam Danin never disowned Uri Baruch, on the contrary he thinks highly of the Israeli technology Baruch used. From what he said it can be gauged that he felt Professor T. Litt had not handled the pollen grains correctly, as can can be seen in the last two paragraphs of article no. 7, “Shroud Studies bring Good News” in the link: http://newvistas.homestead.com/Media Re Patch.html If it is so easy to date the Shroud using C14 on the pollen grains it would have been in Turin’s agenda, but that is not the case. It is just one indicator and, as things stand, nothing can be said with certainty, as Ian Wilson admits in his book. That is why the suggestion was: bring together what Uri Baruch examined, what is still with Dr. Alan Whanger and what was vacuumed off the Shroud during the restoration work..","date":"2014-01-02","mins":"5:13 pm","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","title":"Paper Chase:  Z Twist Again"},{"id":"comment-71580","author":"louis","post":"Hugh Farey and David Goulet have raised very good points in the above discussion, which will put to rest any call for carbon dating of the pollen on the Shroud..","date":"2014-01-03","mins":"9:04 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","title":"Paper Chase:  Z Twist Again"},{"id":"comment-16977","author":"louis","post":"This is a very nice presentation and the only question that arises is if chemistry alone can help determine the image forming process..","date":"2012-09-27","mins":"8:40 am","url":"https://shroudstory.com/2012/09/26/paper-chase-barrie-schwortz-the-shroud-of-turin-research-project-1978-scientific-examination-of-the-shroud/","cat":"history","title":"Paper Chase: Barrie Schwortz’ “The Shroud of Turin Research Project 1978 Scientific Examination of the Shroud”"},{"id":"comment-71116","author":"louis","post":"The controversy regarding pollen grains has still not been resolved, everything is at a standstill. Professor T. Litt contested the findings of Uri Baruch, and Professor Avinoam Danin defended the latter, also saying that the German scientist had not handled the grains as he should have done. My suggestion, given on this blog some months ago, is that there should be a comparison between what U. Baruch found, what is still in the hands of Dr. Alan Whanger and what was vacuumed off the Shroud during the restoration work..","date":"2014-01-02","mins":"9:35 am","url":"https://shroudstory.com/2014/01/01/paper-chase-z-twist-again/","cat":"history","title":"Paper Chase:  Z Twist Again"},{"id":"comment-38991","author":"louis","post":"Assuming that the Image of Edessa/TS are one and the same object and was taken by de la Roche to France it is possible that, given the situation in France, he handed the relic over to the Knights Templar, with their heavily guarded monastery fortresses, for safekeeping. Why did the knights keep quiet about what they had in their possession, only giving hints from time to time? Because the relic was stolen, not given as a present by the Eastern Church to the “Catholic” invaders, many of them mercenaries paid by the Doge of Venice, taking part in an ugly episode in the history of Christendom known as the Fourth Crusade. The tell tale signs are the Templecombe image, psalm 57 chanted by the knights during their special Masses and the round churches — based on the Church of the Holy Sepulchre — they built in several countries in Europe. It is even possible that they knew about the existence of the relic before the year 1204, although they did not take part in the crusade and only infiltrated spies there. They may have thus known the whereabouts of the relic after Constantinople was sacked..","date":"2013-07-14","mins":"5:47 pm","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","title":"Paper Chase: The Shroud of Turin’s Missing Years"},{"id":"comment-39020","author":"louis","post":"David, there are just too many papers from armchair historians and lawyers which do not get close enough to what is most probable. Barbara Frale has gone further, although she has been unsuccessful in filling in all the gaps, at least till today. Othon probably knew he could not ensure that the relic would be safe in his possession in the territory where he was for reasons you have stated. As commented previously, only the Knights Templar left tell tale signs, dropped hints during their depositions, Philippe le Bel came to know about this image that they “adored” and so on. What is meant by “something very similar”? Remember that one account talks about “four hands and four feet”..","date":"2013-07-15","mins":"10:31 am","url":"https://shroudstory.com/2013/07/11/paper-chase-the-shroud-of-turins-missing-years/","cat":"history","title":"Paper Chase: The Shroud of Turin’s Missing Years"},{"id":"comment-48606","author":"louis","post":"Bar Daisan, “Bardesanes” in Latin, was a Syrian gnostic from the region of Edessa. And he was also a docetist…..","date":"2013-10-24","mins":"8:57 am","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","title":"Paper Chase: Thomas & The Hymn of the Pearl"},{"id":"comment-141998","author":"louis","post":"On what basis?.","date":"2014-08-03","mins":"11:07 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142000","author":"louis","post":"The inscription is authentic, so in that sense I too am pro authenticity. However as Father Émile Puech ( also an expert in Hebrew, Aramaic, Ge’ez, Akkadian, Ugaritic, other Mesopotamian scripts) has written, it is “Qupha”, and that is not Caiaphas. The tomb could belong to another Sadduceean family. The pool of names during the period was extremely limited, there were two high priests named “Jesus” during the time of Christ. The statisticians even say that one in every ten ossuaries should have the incription “Jesus, son of Joseph”. So many “Jesus family tombs” will we have then?.","date":"2014-08-03","mins":"11:28 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-48824","author":"louis","post":"O.K. There is yet another theory, which I will make available over the Internet shortly, but it is speculation about where the TS may have been till the Fourth Crusade..","date":"2013-10-26","mins":"4:16 pm","url":"https://shroudstory.com/2013/10/24/paper-chase-thomas-the-hymn-of-the-pearl/","cat":"history","title":"Paper Chase: Thomas & The Hymn of the Pearl"},{"id":"comment-142014","author":"louis","post":"Mike, I would hesitate to refer to OSV when it comes to biblical archaeology and have noticed that the authors drift towards theology. We shouldn’t mix things here. Regarding your query about “Qupha”, there is no certainty that it is a Jewish name, the best scholars think it is a surname: “Qafa” or “Qofa”, and it is “Qupha” according to E. Puech. I read about the controversy a long time ago and if I’m not mistaken the reference was in Father Puech’s book: “La croyance des Esséniens en la vie future: Immortalité, résurrection, vie éternelle?”, 2 volumes, Paris, Liv. Lecoffre, 1993. There were 12 ossuaries in the tomb, and the name was inscribed twice on one ossuary. The tomb was not rich, something that could be expected from the status conscious Sadducees who were very influenced by the Greeks. Puech wondered why “the priest” was also not inscribed if it did indeed refer to Caiaphas and it is not hard to agree with him. You know something? This ossuary will not take us anywhere. I am more inclined to agree with the great Israeli scholar David Flusser, We must bury Caiaphas, not remember him..","date":"2014-08-03","mins":"1:02 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142038","author":"louis","post":"As I said, the NT account is sufficient for me, as it is for Jewish scholars. The role of Caiaphas in the trial and crucifixion of Jesus is accepted by them and therefore the view of David Flusser. Yes, Ma’aziah is a priestly course that served at the Temple, however from “Beth Imri” can have at least two interpretations. The main problem is the interpretation of “Qupha”, which Father É. Puech does not associate with Caiaphas. He seemed to have based his judgment on the accents, and being a world renowned epigrapher, co editor in chief of the Dead Sea Scrolls, a highly qualified and well respected scholar, I bet on his interpretation..","date":"2014-08-03","mins":"3:50 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142023","author":"louis","post":"Mike, yes, it could be an argument for the Jesus of history, although I do not agree that we need to rely on archaeology to prove that Jesus existed. What has the daughter to do with it?.","date":"2014-08-03","mins":"1:49 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142219","author":"louis","post":"As I wrote above, a tomb belonging to a (Sadducean) priestly family with Caiaphas among those buried there would be much more elaborate. There would be no clumsily executed inscriptions. Fr. Puech had written that Quphah was written twice in scriptio defectiva and once in scriptio plena, which cannot be transcribed into a diphthong. A lot of nonsense written about Herod’s tomb and Masada will also have to be eliminated..","date":"2014-08-04","mins":"9:37 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142258","author":"louis","post":"Well, the important thing is to have a fruitful discussion, where different, relevant ideas and leads are put forth and both sides can learn from each other. Helen K. Bond is a qualified scholar, however her field is NT literature and language, not palaeography and epigraphy. That is why I rely more on E. Puech. She has raised relevant points and perhaps in the future these could be taken together with what is finally decided about the ossuary inscription to reach a conclusion. For the time being I will follow the advice of the great Israeli scholar: We should not remember Caiaphas, we should bury him. I think the same about Herod, but asking to do the same with him is well nigh impossible..","date":"2014-08-04","mins":"2:08 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142260","author":"louis","post":"Sorry, the great scholar I was referring to is David Flusser..","date":"2014-08-04","mins":"2:12 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142612","author":"louis","post":"If Jesus was not buried in Talpiot, much less did he go to Kashmir, to live, die and be buried there. Why? See: https://www.academia.edu/7893085/The Quest for Jesus in Shroud research.","date":"2014-08-06","mins":"12:07 pm","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-142586","author":"louis","post":"There are famous scholars who have written on the topic with the latest research. Some of them appear in: https://www.academia.edu/7471223/Jesus was not buried in Talpiot   Part III.","date":"2014-08-06","mins":"8:37 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-141984","author":"louis","post":"Forget Caiaphas, the high priest. Père Emile Puech, world renowned epigrapher and co editor in chief of the Dead Sea Scrolls wrote: It has been erroneously interpreted as “Caiaphah”, the high priest. The correct reading should be “Quphah”. He published a paper on the topic..","date":"2014-08-03","mins":"9:44 am","url":"https://shroudstory.com/2014/08/01/paul-maier-at-the-veritas-forum-the-real-jesus/","cat":"history","title":"Paul Maier at The Veritas Forum: The Real Jesus"},{"id":"comment-207186","author":"louis","post":"Hi Dan What is presumably a Catholic relic was found in a Anglican colony at your end: http://www.catholicherald.co.uk/commentandblogs/2015/07/30/could a relic of the blessed virgin be buried in americas first settlement/.","date":"2015-08-01","mins":"5:48 pm","url":"https://shroudstory.com/2015/08/01/remembering-an-earlier-posting-about-the-seamless-robe/","cat":"history","title":"Remembering an Earlier Posting About The Seamless Robe"},{"id":"comment-141983","author":"louis","post":"Good morning, Mike. Salaam waleh kum. No, I haven’t but will do so shortly. Thanks. By the way, have you seen this?: http://electronicintifada.net/content/jerusalem declaration christian zionism/627 I am sure it will interest you. All the views at that end are controversial, but we must know how people think..","date":"2014-08-03","mins":"9:36 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-141795","author":"louis","post":"Russell Kirk clearly understood that Jesus “transcended matter”, as he says, in his resurrection. Why did he say this and not “broke the bounds of death”? It can be traced to his previous studies, before his conversion to Catholicism. But, what did matter mean to Jesus? Did he break the bounds of death or did he transcend matter? This is a question that requires lengthy discussion and will be dealt with later in a paper. For the time being, it must be pointed out that the Hindu belief in reincarnation makes taking any material goods for an after life redundant and it would also be pointless because the dead bodies are cremated. There were other ancient peoples who believed in an after life and took not only some precious material goods but also slaves and young girls with them, these being buried alive. The concept of resurrection, as primitive Christians interpreted it, based as it was on Jewish belief, was essentially different and the birth of the Jesus movement was a resurrection movement, not an empty tomb movement. The NT leaves no doubt about this. In today’s sceptical world not many theologians believe in literal resurrection and the “Jesus family tomb” story was specifically produced to deny the event. How much of it is true? https://www.academia.edu/7556467/Jesus was not buried in Talpiot   Parts I and II explains the beginning and how the Knights Templar and the Turin Shroud come into the picture – with illustrations. Https://www.academia.edu/7471223/Jesus was not buried in Talpiot   Part III gives a detailed account about the topic from the academic point of view. Is that the end of the story? No, it isn’t. There is more to come and hopefully Part IV will be written shortly..","date":"2014-08-02","mins":"9:39 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-141991","author":"louis","post":"Mike, the quote has also something to do with the Resurrection. The situation in Iraq is not surprising, at least to me. It was foreseen years ago by the Iraqi Catholic (Chaldean) Patriarch Raphael Bidawid. Today’s news has Habbib al Sadr, ambassador to the Vatican, saying something about the situation: http://www.catholicnewsagency.com/news/christians a fundamental part of iraq ambassador observes 43473/.","date":"2014-08-03","mins":"10:21 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-141993","author":"louis","post":"What happens to those who leave their bodies here with regret?.","date":"2014-08-03","mins":"10:38 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-141900","author":"louis","post":"Further to the above, the need arises to quote Joseph A. Fitzmyer,SJ, who needs no introduction: “… the early kerygma did not content itself to affirm merely that Jesus was alive or that he was a living influence in the lives of his followers. It included an admission that Jesus had been ‘raised’ to a state of glory in the presence of the Father, and that would have had to mean ‘raised bodily.'” It is clear that there was no room for collective hallucination or some sort of psychic event. There is some difference between the views of Father Fitzmyer and Monsignor J. P. Meier, both heavyweights in biblical studies. While the former believes that Jesus of Nazareth became Christ after the Resurrection, the latter has written that the disciples were conscious that Jesus was Lord before the event..","date":"2014-08-02","mins":"9:12 pm","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-142006","author":"louis","post":"What about the pharaohs?.","date":"2014-08-03","mins":"12:12 pm","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-142048","author":"louis","post":"Initially there was some defence of the “Jesus family tomb”, however for some reason or the other the views changed. I don’t see the need to read Bart Ehrman to confirm the existence of Jesus. Thinking Christians will find more than one difficulty in the NT, not only when it comes to the Resurrection. Perhaps if they think deep enough these doubts will be dispelled, otherwise they may cease to be Christians and become thinking agnostics..","date":"2014-08-03","mins":"4:51 pm","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-142032","author":"louis","post":"OK, that’s understood. The only problem is that nothing exactly is proved, the scientists are still in the process of looking for hard evidence..","date":"2014-08-03","mins":"2:46 pm","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-142073","author":"louis","post":"Well, that is correct. Benedict is a theologian, he took the lead from his predecessor who was also a philosopher and issued the encyclical “Fides et Ratio”, “Faith and Reason”, a wonderful document. Of course, Benedict also places immense importance on reason. But what happens when it comes to Jesus demanding absolute faith, even when it seems to be irrational? There are examples in the Gospel..","date":"2014-08-03","mins":"7:18 pm","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-142068","author":"louis","post":"There are people who sit over the fence: http://news.yahoo.com/atheist believes god 094500261–politics.html and that is because for many thinking Christians conflicting information is received all the time. They are receptive, like to digest before swallowing. It is like being a computer with the sound forge anti virus. But the time for decision always comes, sometimes it requires a leap of faith, sometimes not. Jesus demanded absolute faith..","date":"2014-08-03","mins":"7:00 pm","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-142222","author":"louis","post":"The above material is stale news..","date":"2014-08-04","mins":"9:40 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-142395","author":"louis","post":"Thomas, have you read the above exchanges? Who has to chill out?.","date":"2014-08-05","mins":"8:02 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-142286","author":"louis","post":"I disapprove of the tactic to hit below the belly with cynical comments when there is no ammunition. It has not hurt me in the least and the reason is the following: The paper is dated 1997, the author is not a heavyweight and there have been dozens of better papers and books by renowned scholars after her paper was published. I therefore stand by what I commented..","date":"2014-08-04","mins":"5:15 pm","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-141895","author":"louis","post":"These views are actually old stories. Anyone is free to believe them, but then they shouldn’t say they are Christian. Unless they subscribe to the Unitarian version..","date":"2014-08-02","mins":"7:50 pm","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-141980","author":"louis","post":"Absolute nonsense is to write what was written in the comment of 4.41 PM, in which it was also stated that “Jesus embraced this idea of an after life” and then deny the track to where we are being led. What can be inferred from this? That Jesus learnt about the after life here on earth, he learnt theology here. Now since the topic is Jesus’ Resurrection what will the above mean? Why would someone who came to learn theology here on earth have been resurrected by God? The NT tells us that there were some good men around who also desired the kingdom of God, who obviously must have been interested in theology, in what Isaiah wrote. Were they also resurrected like Jesus? The previous posts from the above commenter have included: a) a defence of the “Jesus family tomb” b) a defence of Bart Ehrman c) a comment saying the Resurrection of Jesus, that he was raised bodily, is difficult to accept Why should I read “It has nothing to do with Unitarianism. Take a grip!”? Such beliefs are not those held by the Catholic, Protestant, Anglican and Orthodox Churches. If someone still claims to be Christian after professing them, he has only one option: the Unitarian Church. Reference was made to Joseph A. Fitzmyer, SJ and John P. Meier (9.12 PM) because they are top heavweights, they just happen to be Catholics, there are good Protestant scholars around too. Msgr. Meier got his two papal gold medals when studying at the Pontifical Biblical Institute in Rome, Father Fitzmyer obtained his gold medal from the British Academy, around the time he taught Biblical Studies at Oxford University. Both of them believe in what they write, they don’t write one thing and believe in something else. They say mass every day..","date":"2014-08-03","mins":"9:06 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-13286","author":"louis","post":"Why all this rubbish about “Exhoheretic”? Any thinking Christian knows that his/her faith cannot depend on the Turin Shroud. And, it is also incorrect to state that scientists have not studied the relic..","date":"2012-07-01","mins":"12:53 pm","url":"https://shroudstory.com/2012/07/01/sindonology-oh-what-an-awful-word/","cat":"history","title":"Sindonology: Oh, what an awful word?"},{"id":"comment-215722","author":"louis","post":"This is a good question and I hope the SSG member will remember the experiment made by Dr. John Jackson together with Professor Christopher Ramsey. He could go further..","date":"2015-12-06","mins":"9:57 am","url":"https://shroudstory.com/2015/12/06/ssg-member-wants-to-know/","cat":"history","title":"SSG Member Wants to Know"},{"id":"comment-215792","author":"louis","post":"Hugh is completely mistaken. I have the correct information, but will only reveal it …..","date":"2015-12-07","mins":"7:41 am","url":"https://shroudstory.com/2015/12/06/ssg-member-wants-to-know/","cat":"history","title":"SSG Member Wants to Know"},{"id":"comment-215797","author":"louis","post":"Hi Dan I do get information now and then which I am not obliged to reveal. This information can be research, papers, tips and so on and not limited to Shroud studies. It applies to most of the topics on which I write. Journalism is strongly linked to ethics. I think that just too many amateurs are commenting and they don’t seem to respect the professionals. Is that how “Shroudies” want to convince Turin?.","date":"2015-12-07","mins":"8:24 am","url":"https://shroudstory.com/2015/12/06/ssg-member-wants-to-know/","cat":"history","title":"SSG Member Wants to Know"},{"id":"comment-215849","author":"louis","post":"Hugh says “Louis, of course, about which, of course, he is sworn to secrecy”. Nobody has sworn me to secrecy it is a question of ethics as I commented previously. If Hugh does not understand that then there is nothing more I can say. I will maintain my silence till I have more concrete information from various sources and it must be remembered that we are talking about hypotheses. The Chambery chapel fire is just one of them and the experiment made by Drs. Jackson and Ramsey had no success. That does not mean that other attempts cannot be made, with results a long distance from what Hugh is thinking. Patience please..","date":"2015-12-07","mins":"8:18 pm","url":"https://shroudstory.com/2015/12/06/ssg-member-wants-to-know/","cat":"history","title":"SSG Member Wants to Know"},{"id":"comment-169282","author":"louis","post":"It is good to probe ancient sources, but one has to be careful with interpretation..","date":"2014-11-06","mins":"11:57 am","url":"https://shroudstory.com/2014/11/06/stephen-jones-the-shroud-was-not-left-behind/","cat":"history","title":"Stephen Jones:  The Shroud was not left behind"},{"id":"comment-112853","author":"louis","post":"This story is something like the James ossuary, where “brother of Jesus” was added to “James son of Joseph”, apparently as an attempt to pass it off as the genuine article. Whoever did it must have read the NT, known about the interpretation in the Catholic, Orthodox and Protestant churches, but not about OT usage, where “Jesus” would be the brother of “Joseph”, not “James”. Since they were all Jews inscriptions would denote the same thing in both periods. It has therefore been said that modern forgers are not bright. We need more concrete evidence, go beyond working hypothesis, to link the Image of Edessa with the TS and hopefully something new should turn up soon. The problem is the always the same: you may be in a hurry but others you depend on are not or are unwilling to cooperate..","date":"2014-05-06","mins":"11:17 am","url":"https://shroudstory.com/2014/05/06/ten-reasons-to-believe/","cat":"history","title":"Ten Reasons to Believe"},{"id":"comment-171098","author":"louis","post":"We should know where the church vestment is preserved..","date":"2014-11-13","mins":"3:33 pm","url":"https://shroudstory.com/2014/11/13/the-14th-century-3-in-1-herring-bone-weave/","cat":"history","title":"The 14th century 3 in 1 herring bone weave"},{"id":"comment-171102","author":"louis","post":"So there is something more than just Turkish 3×1 silk there. It is strange that V&A has been reticent, keeping quiet all this while. I contacted them years ago regarding 3×1 weaves and they fell silent..","date":"2014-11-13","mins":"3:59 pm","url":"https://shroudstory.com/2014/11/13/the-14th-century-3-in-1-herring-bone-weave/","cat":"history","title":"The 14th century 3 in 1 herring bone weave"},{"id":"comment-171197","author":"louis","post":"Http://lespans.com/broken chevron pattern/.","date":"2014-11-14","mins":"8:26 am","url":"https://shroudstory.com/2014/11/13/the-14th-century-3-in-1-herring-bone-weave/","cat":"history","title":"The 14th century 3 in 1 herring bone weave"},{"id":"comment-164943","author":"louis","post":"A naked Jesus painted on a shroud for a re enactment of the gospel accounts of the resurrection?.","date":"2014-10-23","mins":"3:24 pm","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-165169","author":"louis","post":"There is a problem when it comes to Jesus’s resurrection and there are various reasons why it is being challenged. For agnostics like de Wesselow, the Shroud is the Resurrection and, whatever the value of his book in demonstrating that the relic is not a painting, his interpretation of the New Testament is wrong: https://www.academia.edu/4691390/Book review The Sign by Thomas de Wesselow Some others challenge the belief on other grounds, which also do not prove anything: https://www.academia.edu/7556467/Jesus was not buried in Talpiot   Parts I and II Part IV will be written shortly. Just an empty tomb with an empty shroud — with no image — would not give rise to Christianity. The Jesus Movement was a Resurrection Movement, not an Empty Tomb movement. That is clear in the NT, and doubting Thomas’ incredulity illustrates this..","date":"2014-10-24","mins":"10:03 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-165181","author":"louis","post":"Here is Part III: https://www.academia.edu/7471223/Jesus was not buried in Talpiot   Part III Part IV will be one nail in the coffin of the documentary/book, something that was hidden from the public in the midst of the hype..","date":"2014-10-24","mins":"10:52 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-165142","author":"louis","post":"O.K. I hope John will post the comment deleted by the “Guardian” here. You must have observed that in the Western world God is going ‘out’, and scepticism is coming ‘in’, that is why the news outlets spread any new bit of news, but they are mostly neutral. People are looking for palpable signs that God exists, or that what Christ said is true. C.G. Jung first believed in Christ, then hung a copy of the Shroud face in his study: https://www.academia.edu/6823292/What did Jung see in the Shroud.","date":"2014-10-24","mins":"8:08 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-165194","author":"louis","post":"Thanks for the remarks, David G. I added G because there are other Davids around! Keep tuned while some fine tuning is done by me..","date":"2014-10-24","mins":"11:26 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-165148","author":"louis","post":"A “loincloth painted on” the Shroud is ridiculous, it is an attempt to do away with a strong point in favour of authenticity.See the first comment on this thread..","date":"2014-10-24","mins":"8:22 am","url":"https://shroudstory.com/2014/10/23/the-guardian-notes-the-history-today-article-by-charles-freeman/","cat":"history","title":"The Guardian Notes the History Today Article by Charles Freeman"},{"id":"comment-95862","author":"louis","post":"One wonders why the plate was not preserved..","date":"2014-04-02","mins":"11:36 am","url":"https://shroudstory.com/2014/04/02/the-holy-grail-found-in-spain/","cat":"history","title":"The Holy Grail Found in Spain?"},{"id":"comment-95852","author":"louis","post":"The Irish Dominican biblical scholar Father Jerome Murphy O’Connor, an expert in Jerusalem, who died recently, felt that the cup used by Jesus was like the clay cups used by the Essenes. It appears in Mel Gibson’s “The Passion”, available on youtube..","date":"2014-04-02","mins":"10:19 am","url":"https://shroudstory.com/2014/04/02/the-holy-grail-found-in-spain/","cat":"history","title":"The Holy Grail Found in Spain?"},{"id":"comment-95874","author":"louis","post":"Further to #4, it is important to note that the legends begin to appear only from the late 12th century onwards..","date":"2014-04-02","mins":"12:54 pm","url":"https://shroudstory.com/2014/04/02/the-holy-grail-found-in-spain/","cat":"history","title":"The Holy Grail Found in Spain?"},{"id":"comment-95898","author":"louis","post":"OK in # 7. Answering #1: “And that’s wrong. According to Hesemann and others, clay is ritually unclean, and couldn’t have been used during Passover meal. Instead, stone chalice was probably used which likely is now in Valencia.” Answer: As far as I know Father Jerome Murphy O’Connor was a world renowned biblical scholar, which Hesemann isn’t, so how can such comparison arise? It seems that Hesemann hasn’t done important homework. I have taken photographs of the clay cups and jars used by the Essenes in Qumran and the Pharisees were liberal when compared to them even when it came to ritual purity. It is believed that these clay bowls and cups were meant for storing soup, even for medicinal purposes, in fact one scholar even thought that there was a pottery — not stone — factory in Qumran. This pottery was found by the French Dominican archaeologist Father Roland de Vaux, Qumran excavator and first editor in chief of the Dead Sea Scrolls. “The legend, yes. But the cup as a material object existed independently of legend.” Answer: There is no proof that the material object is the authentic one. Sooner or later more cups, chalices and what not will appear together with the claim to the title “true Holy Grail”. Ian Wilson has provided the best explanation for why the legend emerged and, particularly, why Joseph of Arimathea appears there..","date":"2014-04-02","mins":"2:35 pm","url":"https://shroudstory.com/2014/04/02/the-holy-grail-found-in-spain/","cat":"history","title":"The Holy Grail Found in Spain?"},{"id":"comment-95908","author":"louis","post":"OK: Sorry, I have no time to read the source you mentioned, however it is nice to see that you now do not disagree that the Essenes used clay jars even to store food. Passover? All they had to do was to use clay cups and jars that had never been used and these were available in abundance. I think the Essenes produced this pottery also to exchange it for other kinds of goods like clothes, footwear in Jerusalem and one of their cups may well have landed on the Last Supper table. Jesus did not bother about ritual purity, he stayed in the house of Simon the leper, in a leper colony, on the way to Jerusalem. The great Israeli scholar Yigael Yadin used this fact to buttress his contention that Jesus was anti Essene and had to show them what he thought about ritual purity. It is the spirit that matters…..","date":"2014-04-02","mins":"3:01 pm","url":"https://shroudstory.com/2014/04/02/the-holy-grail-found-in-spain/","cat":"history","title":"The Holy Grail Found in Spain?"},{"id":"comment-74002","author":"louis","post":"These are some of the doubts mentioned in the first paragraph above that have to be addressed. A number of papers have been published, the doubts have not been removed, and the debate is still raging..","date":"2014-01-21","mins":"5:25 pm","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"id":"comment-73978","author":"louis","post":"It is true that the C14 date has not been satisfactorily discredited in scientific papers, however there are also many doubts about the entire procedure beginning at Turin and ending with the three laboratories that have not been satisfactorily answered. Now on another recent thread I was indirectly accused of “over speculation” when it came to the Jospice Mattress Imprint, and also had to read that both this image and the one on the TS were possibly the work of artists. I will leave the question about an artist and the TS to Shroudies who have better images and data. What I want is a detailed paper on how an artist produced the image on the mattress, not forgetting to tackle each and every minute detail we have about the imprint, including the details prior to and after Les’ death..","date":"2014-01-21","mins":"3:30 pm","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"id":"comment-114098","author":"louis","post":"Daveb, no, I didn’t mean you were naive. What I meant is that Karen King’s agenda is not different from those of other scholars who share her views when it comes to a complete picture of Jesus. To get an idea about what is going on Internet research is not enough, there is a lot of material to read and analyse. The hidden agendas are either anti Christian or those of fanatical feminists, sometimes there is no hesitation to distort what we can assume to be facts by making far fetched claims and try to pass it off as truth. Bluntly speaking, scholars can not connect the dots sometimes, so they keep quiet and discuss it among themselves. If the agendas are the same it is done behind the scenes, but this is enough for the greedy and the unscrupulous to justify the production of documentaries and books by sensationalist authors. Some years ago the Baigent/Leigh duo attacked the Vatican by saying that they were responsible for hiding some parts of the Dead Sea Scrolls. This was dismissed by a well known Jewish scholar and refuted by the also well known Protestant scholars Betz and Riesner. Something along these lines will have to be done now..","date":"2014-05-07","mins":"6:43 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-113717","author":"louis","post":"Hi Dan, didn’t I predict on this blog that this would happen? I would tell Harvard to look before leaping and I think Karen King adopted a strategy, one that slowly distanced itself from authentication, a face saving approach. The fact that the owner’s identity was not revealed was a tell tale sign right from the beginning, however Harvard has released a documentary…...","date":"2014-05-07","mins":"8:57 am","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-73946","author":"louis","post":"If that is the case then what is the raison d’etre for the BSTS and its newsletter?.","date":"2014-01-21","mins":"11:01 am","url":"https://shroudstory.com/2014/01/20/the-idea-of-something-being-authentic-is-just-too-powerful/","cat":"history","title":"The idea of something being authentic is \"just too powerful\""},{"id":"comment-115014","author":"louis","post":"Jacobovici traces the fragment to the Valentinans with his wishful thinking. He says their writings could be based on history and that is why Paul kept silent about Jesus’ celibacy. Apparently he expects that it will be passed off as a scholarly viewpoint..","date":"2014-05-08","mins":"9:02 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-115060","author":"louis","post":"That’s right, clublu2201. With an agenda like the one he has,he finds it difficult to give up and prefers to clutch at straws. There is a lot of money behind it. You are right about Paul too, the blinding flash on the road to Damascus shaped the rest of his life and mission..","date":"2014-05-08","mins":"10:22 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-115054","author":"louis","post":"Clublu2210 says: May 8, 2014 at 9:37 pm “Professor George Windsor Mac Rae, S.J., would have left it up to Prof. Frank Cross… George Mac Rae would have been disappointed in Karen King, and have advised her not to have not accepted the faux papyrus. George’s field was Early Christian Gnosticism, and this piece didn’t fit the field. Thanks for asking Louis. I think King Conned should have listened even a little to the voice who previously held her Divinity chair.” You are absolutely correct, it seems the standards have fallen..","date":"2014-05-08","mins":"10:15 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-115776","author":"louis","post":"Hi Annette, it is sometimes taken for granted that religious belief is outdated and that we have an alternative which says ‘forget about God’, which was the message RD gave when he went around London in that bus. It was exactly in this city that more than a decade ago I could sense what was to come. I went to a bookshop belonging to a big chain bookstore to ask if they had a book about Jesus in history. The young man at the counter looked at me and asked, “Jesus? How do you spell that?”. Knowing the mentality prevailing at that end I said quietly, “J e s u s”. He had to do his job, so he looked at the computer and said that the book I was looking for was not available. Around the same time I once saw a boy wearing a white t shirt walking on the road. The words “Jesus died for his sins, not mine.” was printed on it. Well, we are talking about people in general, but this attitude reached the higher, more educated strata in the Western world a long time ago and can now also be felt in the academy and that is what I meant. It is there only in some universities, it seems, but my guess is that it will spread. The younger generation is not that interested in religion. Judaism and Christianity are evolving, times have changed, they have to adapt to developments in science, although science cannot explain everything. See the interview: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ I agree with you that there is room for more growth, but making new translations of the Bible will not help. Science theology dialogue is crucial and so is good systematic theology as well as new ideas in Christology. ..","date":"2014-05-09","mins":"9:48 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-115719","author":"louis","post":"Hi clublu2201, Harvard has been liberal for a long time and Iowa and North Carolina are worse. It seems to be a growing tendency and the professors who are Christian believers are accused of imposing their faith on biblical studies. The people at SBL are also accused of the same thing. We are supposed to believe that biblical studies has come to an end..","date":"2014-05-09","mins":"8:10 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-191512","author":"louis","post":"As I pointed out last year, Karen King is trying to get people to swallow a forgery, obtained from an “anonymous figure”. After all, that is very interesting for her because of the line she is towing. More bad news for her: http://edition.cnn.com/2015/02/20/living/jesus series gospel wife/index.html One has to be careful with anonymous figures or collectors in this area just as with unprovenanced artefacts relating to biblical archaeology in Israel..","date":"2015-02-21","mins":"4:56 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-113744","author":"louis","post":"There is also the money line to follow, it is also there in the field of biblical archaeology. Jesus said, “Where is your treasure there is your heart also”………….","date":"2014-05-07","mins":"9:53 am","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-114081","author":"louis","post":"If it was as easy as that it would be fine for the status quo in the believing world, but it isn’t. Even scripture is being questioned, starting with the first century NT and going back to the OT till around 1500 BC or even further back. The scene is no longer the same as it was fifty years ago. Https://www.academia.edu/6932873/Jesus was not buried in Talpiot Parts I II and III The NT began to be questioned by Strauss, Baur, Reimarus, the OT by Spinoza, more lately by Assmann, Finkelstein, Pinker and so on..","date":"2014-05-07","mins":"6:20 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-114042","author":"louis","post":"Sorry, daveb, first go through Karen King’s agenda to see what exactly is going on first..","date":"2014-05-07","mins":"5:25 pm","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-114196","author":"louis","post":"Two of the commenters come from an anglo saxon background, one from an Eastern European region. Such differences in approach are inevitable..","date":"2014-05-07","mins":"9:38 pm","url":"https://shroudstory.com/2014/05/07/the-letter-from-alexius-comnenus/","cat":"history","title":"The Letter from Alexius Comnenus"},{"id":"comment-114574","author":"louis","post":"Hi clublu2201, I was waiting for further contact. What would your professor, Father George Mac Rae say about the controversy? After all, it would be part of his field..","date":"2014-05-08","mins":"9:02 am","url":"https://shroudstory.com/2014/05/07/the-latest-news-on-the-gospel-of-jesus-wife/","cat":"history","title":"The Latest News on the Gospel of Jesus’ Wife"},{"id":"comment-100316","author":"louis","post":"Daveb: “The dishonesty of the two clerics in their massaging the evidence in this affair, Thurston and Chevalier, is set out in a paper: “THE CONSPIRACY AGAINST THE SHROUD”; By Jack Markwardt; 2001.” They were not dishonest, Canon Chevalier was considered to be the most cultured man in Europe, Father Thurston was a well known scholar in England. Just many people with these qualifications are interested in the Shroud today?.","date":"2014-04-17","mins":"9:51 am","url":"https://shroudstory.com/2008/10/21/the-ridiculous-picknett-and-prince-photograph-theory/","cat":"history","title":"The Ridiculous Picknett and Prince Photograph Theory"},{"id":"comment-53206","author":"louis","post":"Charles, remember I requested you about the same thing mentioned in #30 below, and this was months ago?.","date":"2013-11-28","mins":"11:19 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-118213","author":"louis","post":"They could be thieves involved in insurrection, sicarii stealing to support their movement, which, Josephus tells us, began in AD 6. The sicarii hated the Sadducees, who collaborated with the also hated Romans when needed. The sicarii are said to have murdered Jonathan, the high priest and it is even thought that is was they who set the Temple on fire when Titus was besieging Jerusalem — to burn the records of who paid and did not pay the tax. They knew that the priests pocketed the money, turning a blind eye to the suffering of poor Jews..","date":"2014-05-12","mins":"9:35 pm","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-51996","author":"louis","post":"These measurements will not help much in authenticating the TS..","date":"2013-11-19","mins":"7:55 am","url":"https://shroudstory.com/2013/11/18/the-shroud-is-8-x-2-assyrian-whatchamacallits/","cat":"history","title":"The Shroud is 8 x 2 Assyrian Whatchamacallits"},{"id":"comment-118555","author":"louis","post":"The high priest did not tear his garments because of insurrection, the accusation was “blashphemy”, which was the reason for the condemnation. Insurrection was the reason given to the Romans..","date":"2014-05-13","mins":"9:17 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-142221","author":"louis","post":"Please show me where is the fanaticism. I am waiting..","date":"2014-08-04","mins":"9:40 am","url":"https://shroudstory.com/2014/08/02/the-key-to-understand-resurrection/","cat":"news_&_views","title":"The Key to Understand Resurrection?"},{"id":"comment-118601","author":"louis","post":"Re: Christopher Kelley. He forgot to mention that the kaaba itself, not only the idols, was a pre islamic object of worship..","date":"2014-05-13","mins":"11:04 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118596","author":"louis","post":"Exactly, the Sanhedrin had to have Rome execute Jesus because of his fame, which was not the case with Stephen and James, who were stoned to death..","date":"2014-05-13","mins":"10:59 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118203","author":"louis","post":"Dan, if one leg might appear shorter than the other on the Turin Shroud it should no surprise because we are dealing with a victim of crucifixion. Now, if the angled footrest on the Orthodox Cross is based on the Byzantine legend that Jesus had a shorter leg then it tells us that they could be cockeyed at times. Didn’t they read the gospels? How could a limping Jesus cure a lame man?.","date":"2014-05-12","mins":"9:10 pm","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118613","author":"louis","post":"It makes little difference if the two men were robbers or rebels, in my view they could have been thieves stealing for the insurrection, as stated in comment 2 above. The central issue was Jesus, not the two crucified next to him..","date":"2014-05-13","mins":"11:17 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-117196","author":"louis","post":"O.K. You did some good work. As we know, both Mesarites and de Clari refer to the cloth as a burial cloth, the problem arises when the former refers to a “cheap cloth”. What was cheap in his view? Perhaps what he meant to say was that the linen was like sackcloth when compared to the luxurious fabrics used by the rich Byzantines, taking silk brocade as an example..","date":"2014-05-11","mins":"6:08 pm","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","title":"The Three Byzantine Burial Cloths of Jesus"},{"id":"comment-117774","author":"louis","post":"There could have been another piece of the same cloth that had been cut into about three smaller pieces to make the bands and these were lost during the looting..","date":"2014-05-12","mins":"9:22 am","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","title":"The Three Byzantine Burial Cloths of Jesus"},{"id":"comment-119984","author":"louis","post":"There is an ancient community of Christians in the south of India. They are known as the “Nasranis”, which is a variation of “Nazarenes”, and are mostly Jewish in origin. The Portuguese called them “Judaizers” in the 16th century and tried to suppress their Jewish customs, which are still maintained today although they are Christians. Their site http://www.nasrani.net has something about a letter sent by the apostle Thomas from India to Edessa, with reference to Adai. When Thomas went to Syria on the way to India(?) he mentioned no image in Edessa, which means that he may travelled before our Image of Edessa/TS arrived in Edessa. Http://www.nasrani.net/2008/09/20/letter of st thomas the apostle to edessa from india/.","date":"2014-05-15","mins":"11:20 am","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","title":"The Three Byzantine Burial Cloths of Jesus"},{"id":"comment-120143","author":"louis","post":"Every second Christian in the region is named “Thomas”. The gnostics place a lot of value on spurious writings linked to Thomas because of the “Gospel of Thomas”. However American scholar Luke Timothy Johnson, who is a heavyweight, has argued convincingly why it is based on the canonical gospels. One group has argued that Thomas could not have preached Jesus in India because the gospels were written after his arrival there. This is pure ignorance and I have argued more than once that the written gospels were preceded by an oral tradition prevailing among the Jesus movement communities. “Q”, “Quelle” or “source” in German is just a hypothesis, the communities did not all rely on one source, they themselves were several sources, therefore the differences in the narratives we read in the gospels, which nonetheless provide a message that is on the whole uniform and coherent. Jesus did not go to India, as the group has claimed: http://holyshroudguild.org/uploads/2/7/1/7/2717873/the quest for jesus in shroud research.pdf.pdf.","date":"2014-05-15","mins":"6:26 pm","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","title":"The Three Byzantine Burial Cloths of Jesus"},{"id":"comment-120123","author":"louis","post":"Hi O.K. I was slow when writing. Did you see the question mark in my comment above? I see no hard evidence, only pointed out that there are traditions that are ancient. Thomas was said to have been beheaded in India, but his remains are said to be in Syria..","date":"2014-05-15","mins":"5:50 pm","url":"https://shroudstory.com/2014/05/11/the-three-byzantine-burial-cloths-of-jesus/","cat":"history","title":"The Three Byzantine Burial Cloths of Jesus"},{"id":"comment-76458","author":"louis","post":"The Order of de Molay is part of some groups in freemasonry, De Molay was the Grandmaster of the Knights Templar. Philippe le Bel’s treasury was empty so he pounced on the opportunity to arrest the GM and his knights after he left Cyprus and reached France to discuss plans for a new crusade with the Pope..","date":"2014-02-04","mins":"9:03 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76535","author":"louis","post":"Hi John, I’m sure you know that the De Molay society is for youngsters, so to bring the discussion back to 14th century France, the Chinon Parchment dispelled all the doubts, the Templars were no heretics, and even Malcolm Barber welcomed the discovery of the document. Pope Clement V was forced to suppress the Order and since the document he made did not leave the door open for any revival, Pope John XXII established the Order of Christ in Portugal, which counted Vasco da Gama, Ferdinand Magellan, Pedro Álvares Cabral and other important names in history among the ranks. It looks like stars were important to Geoffrey de Charny, who was keen on establishing another Order of Chivalry, the Order of the Star, where members would be devoted to the Christian faith, in keeping with what the Templars thought..","date":"2014-02-04","mins":"2:04 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76582","author":"louis","post":"If it is IHS then it is Jesus, which is no surprise, and it certainly could not refer to Jacques de Molay.","date":"2014-02-04","mins":"7:01 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76587","author":"louis","post":"Sounds convincing and within the context.","date":"2014-02-04","mins":"7:33 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76594","author":"louis","post":"Further comment required, Max, if you are still awake….","date":"2014-02-04","mins":"8:06 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76728","author":"louis","post":"Many thanks, Max. Full speed ahead with your research!.","date":"2014-02-05","mins":"8:55 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76729","author":"louis","post":"Ditto.","date":"2014-02-05","mins":"8:57 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76742","author":"louis","post":"Max, as I told you more than once, put your research in a small pdf paper with illustrations and I’m sure Dan will upload it for all to read. I know this takes time but it makes it easier and much more quicker for us to follow your rationale, which can bring a logical sequence, eliminating the need to drive your point in bits and pieces..","date":"2014-02-05","mins":"10:45 am","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76833","author":"louis","post":"Thanks, Max, I understand and wish you success in your research..","date":"2014-02-05","mins":"6:03 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-76845","author":"louis","post":"See, Max, your research is making headway..","date":"2014-02-05","mins":"7:20 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-77097","author":"louis","post":"That’s why I encouraged you earlier, Max..","date":"2014-02-06","mins":"5:42 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-181919","author":"louis","post":"Hello David Good to see you back on the scene. There is no point disagreeing with what you wrote. You have correctly pointed that the oral tradition has not been stressed, it has been ignored. The Jesus Movement, to become the Church later, was moved by the oral tradition. Without it there would be no Christianity. Unfortunately only a part of the oral tradition was put down in writing, in our gospels..","date":"2015-01-07","mins":"6:51 pm","url":"https://shroudstory.com/2015/01/07/we-also-have-the-shroud-of-turin/","cat":"history","title":"We also have the Shroud of Turin"},{"id":"comment-77101","author":"louis","post":"You’re welcome, Max, I knew you were on the right track. You know something? I know you are very hard pressed for time, but do put your studies in pdf when you can and post them on a Shroud website..","date":"2014-02-06","mins":"5:57 pm","url":"https://shroudstory.com/2014/02/04/the-two-lirey-badges-unmistakable-differences/","cat":"history","title":"The Two Lirey Badges: Unmistakable Differences"},{"id":"comment-181806","author":"louis","post":"I received several books by J.D. Crossan for review years ago. He is becoming a thing of the past. Ignoring the after effects of the Resurrection event, he believes that Jesus body was eaten by wild dogs, while continuing to be a believing Christian and asking the question, “What kind of manifestation of God was Jesus?”. His faith therefore remains intact. One big problem I at least could detect while reading his books and articles is that his approach led him to show interest in the so called Jesus family tomb in the East Talpiot district of Jerusalem. It is a blind alley: https://www.academia.edu/7556467/Jesus was not buried in Talpiot   Parts I and II and followed by: https://www.academia.edu/7471223/Jesus was not buried in Talpiot   Part III There will be more to write later this year on those parts of the biblical tradition that J.D. Crossan has ignored, after an article on the Shroud image formation process. Both will be online..","date":"2015-01-07","mins":"7:07 am","url":"https://shroudstory.com/2015/01/07/we-also-have-the-shroud-of-turin/","cat":"history","title":"We also have the Shroud of Turin"},{"id":"comment-181823","author":"louis","post":"At the other end of the spectrum serious, although very conservative, scholars will be holding a conference. Those living in the San Diego, California region may be interested: http://www.jpcatholic.com/Biblical Conference.php.","date":"2015-01-07","mins":"8:36 am","url":"https://shroudstory.com/2015/01/07/we-also-have-the-shroud-of-turin/","cat":"history","title":"We also have the Shroud of Turin"},{"id":"comment-171107","author":"louis","post":"I have to agree with Stephen Jones here. The British Museum is not that far from V&A..","date":"2014-11-13","mins":"5:16 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-181917","author":"louis","post":"It is always advisable to avoid extremes, keeping away from fundamentalism and extreme liberalism as well. One great New Testament scholar I had occasion to interview twice, once during the launching of his excellent guide “Responses to 101 Questions on the Dead Sea Scrolls” (Paulist Press), was Father Joseph A. Fitzmyer, SJ who was judged to be the scholar’s scholar in the United States before his retirement. It was published in a major daily in a different language and I hope to be able to post it soon. From what I could learn from him, biblical interpretation is a very difficult task, and he had also been judged as someone with “impeccable critical credentials”, also having been on the Pontifical Biblical Commission for a while. His opinion was therefore very important. He employed the historical critical, whose shortcomings were pointed out by Benedict XVI in his book “Jesus of Nazareth”. It does indeed have its problems, although it is better than the “formesgeschichte”, form criticism, developed by German Protestant scholars around Bultmann. Father Fitzmyer’s exegesis was criticised by the biblical scholars at the John Paul the Great Catholic University, San Diego, California, a link to whom was given by me above and cited by Rick. The reason the scholars were critical was that their approach was different from the one adopted by the Jesuit professor. We therefore continue to see different approaches to biblical studies. J.D.Crossan seems to have interpreted the New Testament narratives in an allegorical way, against which Father Fitzmyer warned in the interview: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ But he does indeed have some faith, in the broad sense. It is something I have also observed in some practicing Christians, although they do not say it in public. It is very difficult to agree with the Irish American J.D. Crossan and that is because he has ignored the depth of the post Easter NT narratives, in keeping with his allegorical interpretation..","date":"2015-01-07","mins":"6:42 pm","url":"https://shroudstory.com/2015/01/07/we-also-have-the-shroud-of-turin/","cat":"history","title":"We also have the Shroud of Turin"},{"id":"comment-171190","author":"louis","post":"Colin, Dan now has his foot near the brake and the blog has improved considerably. But I think any one using pseudonyms to also indulge in personal and vitriolic attacks should be warned and blocked from commenting if things continue the same. Good for us is that there is an antidote appearing from time to time here. It is your (Scotch Irish?) sense of humour..","date":"2014-11-14","mins":"7:17 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171109","author":"louis","post":"Sorry, I meant the “weaving fan” was correct. Now, what was the reason V&A could not cut up a tiny sample? Who is the “weaving fan” and how did he know that? We must know his name. Why is he hiding behind a pseudonym?.","date":"2014-11-13","mins":"5:22 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171191","author":"louis","post":"Hugh, I at least do appreciate the point you have raised. If suggestions are allowed and Charles agrees, perhaps two people in the Shroud “crowd”, you and M.Mechthild Flury Lemberg, one pro and the other anti authenticity, could be invited to go together with Charles to V&A..","date":"2014-11-14","mins":"7:25 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171279","author":"louis","post":"The late Daniel Raffard de Brienne, French lawyer, Shroud scholar and President of CIELT, was one of the few authorities invited by Cardinal Severino Poletto to the Round Table held in Turin. He had something to say about the samples: https://www.academia.edu/9156258/Shroud Studies in France.","date":"2014-11-14","mins":"7:58 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171115","author":"louis","post":"What is meant by “unconnected exercise”?.","date":"2014-11-13","mins":"6:13 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-171119","author":"louis","post":"That is not convincing, the Shroud is not just “another” religious relic..","date":"2014-11-13","mins":"6:38 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-214399","author":"louis","post":"There are gaps in the story of the chest. There is some connection between the de Brienne and the de la Roche families. Daniel Raffard de Brienne, a descendant of Gauthier V de Brienne, Duke of Athens, dismissed the Templar hypothesis and believed that although Otho da la Roche possessed the Shroud in Athens the relic remained there till the fourteenth century: https://www.academia.edu/9156258/Shroud Studies in France On the other hand, Dr Barbara Frale, who believes the Knights Templar possessed the relic, and expressed her views in several publications, particularly after she discovered the Chinon parchment in the Vatican Secret Archives, thought that the image of Christ referred to by Bishop Epihanius might have been the Shroud. The description says that the image was on a curtain: https://www.academia.edu/7447446/Was there a link between the Knights Templar and the Turin Shroud An interview with Dr. Barbara Frale.","date":"2015-11-08","mins":"12:59 pm","url":"https://shroudstory.com/2015/11/08/what-am-i-missing/","cat":"history","title":"What am I missing?"},{"id":"comment-171120","author":"louis","post":"If you can prove that the Shroud is not herringbone at all and what we see is a chevron weave then Charles would have to forget about going to V&A and that will also mean that M. Mechthild Flury Lemberg may have been using the wrong glasses for a long time..","date":"2014-11-13","mins":"6:43 pm","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-207508","author":"louis","post":"Jews in the first century were buried in a single burial cloth. Things like Egyptian mummy bandages were not used..","date":"2015-08-05","mins":"6:18 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207677","author":"louis","post":"Dan, I think it is high time that you cut Max down to size since he continues to hurl adjectives and insults at well known biblical scholars, Shroud scholars and commenters on this blog. This is the only place where he can do it since he does not have a website..","date":"2015-08-07","mins":"8:49 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207551","author":"louis","post":"Unfortunately unsubstantiated claims are made, with no evidence at all..","date":"2015-08-06","mins":"5:33 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207680","author":"louis","post":"The message was directed to Dan, requesting him to take appropriate action. The ball is in the other side of the court..","date":"2015-08-07","mins":"10:11 am","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207707","author":"louis","post":"While this is not exactly a Christian blog there are believing Christians posting comments here, as well as those who believe in “g od”. But what we often see here gets us closer to Nietzsche, Freud, Sam Harris and RD. On the other hand, there are well known atheists who believe in the people cited above and have blogs where we do not see insults and personal attacks and where fruitful discussion takes place..","date":"2015-08-07","mins":"7:09 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207685","author":"louis","post":"Dan, you have now seen that he does not learn from mistakes and and posts on the blog insults and personal attacks, things he would never do on a blog or website that belonged to him. Turin as well as Shroud enthusiasts wanting to know more about the relic read the comments. Why should “Shroudies” engaging in fruitful discussion here pay the price for the damage done by those who do not know how to comment?.","date":"2015-08-07","mins":"12:43 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-207712","author":"louis","post":"Dan, I am waiting for your response to the above attack..","date":"2015-08-07","mins":"7:44 pm","url":"https://shroudstory.com/2015/08/05/when-is-a-sindon-not-a-sindon/","cat":"history","title":"When is a Sindon Not a Sindon?"},{"id":"comment-171208","author":"louis","post":"Colin, I can understand your position when it comes to metaphysics as science theology dialogue is one topic I write on. I also review books in this field, although the preference is Biblical archaeology (200 BC – AD 200 roughly) and sometimes biblical studies. Right now I have a 1000+ page book on Jesus to read and review, obliging me to keep two books on Freud and one on the history of Jerusalem aside — till next year. Although I am a Christian (RC) by conviction, I find it necessary to hear both sides of the story because that is also part of the dialogue. When I was in England I saw people, atheists included, anxious to find someone who could listen to them, there was an unconscious quest for transcendence, which is what even the godless Jew Freud wrote about. When do you expect your book to be launched?.","date":"2014-11-14","mins":"10:10 am","url":"https://shroudstory.com/2014/11/13/weaving-fan-a-k-a-colin-berry/","cat":"history","title":"Weaving Fan a.k.a. Colin Berry?"},{"id":"comment-208695","author":"louis","post":"Sampath, the risen Christ would not have given a burial cloth to the servant of the priest, of all people. It was an unclean object..","date":"2015-08-21","mins":"1:35 pm","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","title":"Who is Addai?"},{"id":"comment-208761","author":"louis","post":"You’re welcome, Sampath. I’ve been a Religion Writer for around twenty years..","date":"2015-08-23","mins":"7:18 am","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","title":"Who is Addai?"},{"id":"comment-72443","author":"louis","post":"Why all this big noise when it comes to the letters? The Mandylion in Edessa does not depend on them. It is likely that the legends grew as a result of the need to explain how the Mandylion/Turin Shroud reached the city, assuming they were one and the same object..","date":"2014-01-06","mins":"8:30 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72494","author":"louis","post":"John Markwardt’s paper is well researched and interesting, however it is highly doubtful that Jesus was given to writing letters. In ancient literature scribes added some of their own spices to oral tradition in order to make it more digestible..","date":"2014-01-07","mins":"2:10 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-36948","author":"louis","post":"This story about Hitler and his “obsession” with the TS is not new. He was born in a Catholic family and that was also the case with SS General Karl Friedrich Otto Wolff who is said to have received orders from the fuehrer to invade the Vatican but delayed the move,considering the idea to be madness. Relations with the Catholic Church were tense, as the friction between the Austrian Cardinal Theodor Innitzer and Berlin demonstrated. The American Jesuit Father Robert Graham is said to be the best authority in these matters but so far no one seems to be able to say anything with absolute certainty..","date":"2013-06-14","mins":"8:59 am","url":"https://shroudstory.com/2013/06/14/will-the-alfred-rosenberg-diaries-tell-us-anything/","cat":"history","title":"Will the Alfred Rosenberg Diaries Tell Us Anything?"},{"id":"comment-72508","author":"louis","post":"That is exactly what I meant, albeit indirectly, in #33. Ian Wilson wrote that Jesus was the only historical figure known to have impressed his likeness on cloth, which is the starting point of his works on the Shroud. That something had been going on in Edessa in connection with an image has been pointed out even by — of all people! — Robert Eisenman. During the interview he granted me Father Pfeiffer supported IW’s contention, stating that the Eastern Church only realised that they had a full body image in their possession when the Image of Edessa/Turin Shroud reached Constantinople. That was embarrassing for the emperor, he said, and so the original preaching had to be changed. The Orthodox Church’s version of the story can be seen at: http://www.stseraphim.org/iconnotmadebyhands.html.","date":"2014-01-07","mins":"4:40 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72527","author":"louis","post":"Ian Wilson’s book “Holy Faces, Secret Places” is a valuable source of information and mentions the controversies. It had no effect on the authorities since it seems relics are not easily available for scientific examination. It would have been helpful to judge who was right and about what..","date":"2014-01-07","mins":"7:16 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-72528","author":"louis","post":"That is also dwelt upon in the book mentioned above..","date":"2014-01-07","mins":"7:17 pm","url":"https://shroudstory.com/2014/01/06/yannick-clment-on-the-letters-between-jesus-and-king-abgar/","cat":"history","title":"Yannick Clément on the Letters Between Jesus and King Abgar"},{"id":"comment-208716","author":"louis","post":"Hi Sampath You are right about Jesus’ attitude. To provide an example, he lodged in the house of Simon the leper, in a leper colony, while he was on his way to Jerusalem on one occasion. The Israeli archaeologist Yigael Yadin, who was convinced that Jesus was anti Essene, thought that he did it on purpose in order to show the group what he thought about their views on rituals of purity. That was typical of him, one way of demonstrating what God’s love meant. Now, that does not mean that others agreed with him, particularly the Sadducees, who were the priests controlling the Temple. As for the Gnostic gospels, they have to be handled with care. They were written after AD 150, many of them also used the canonical gospels as sources, including the Gospel of Thomas. When it comes to their dualism a big problem is encountered. Studies are being made by respected European scholars, concentrating on a new way of understanding Christology, which may go to explain why the gnostics thought the way they did. What is called mysterium Christi began in the first century and continues till today..","date":"2015-08-22","mins":"6:54 am","url":"https://shroudstory.com/2015/08/19/who-is-addai/","cat":"history","title":"Who is Addai?"}]
