[{"id":"comment-53914","author":"louis","post":"The last sentence is absolutely correct..","date":"2013-11-29","mins":"2:14 pm","url":"https://shroudstory.com/2013/11/29/a-point-of-view/","cat":"other_blogs","title":"A Point of View"},{"id":"comment-53860","author":"louis","post":"“There is no lab test for Christ ness” – Dr. Alan Adler.","date":"2013-11-29","mins":"8:47 am","url":"https://shroudstory.com/2013/11/29/a-point-of-view/","cat":"other_blogs","title":"A Point of View"},{"id":"comment-140335","author":"louis","post":"Hi One wonders where his “evidence” will take us. Some of the people who have had such experiences claim to have seen Jesus surrounded by very bright light, others a dark tunnel with a light at the end, yet others floating above us here below and seeing everything that was going on. The evidence seems to lead to the unconscious, which encompasses past, present and future. What is “seen” is embedded in the unconscious. That is why ontology — our minds and the universe included — and the mind body problem was mentioned. There can be a positive effect: the blogger says, “materialism slides into the background and its importance often dissipates.” It is like shock therapy. Why? Because life is short, there is generally not enough time to think, we have to eat, see to it that we are living under a roof and that it does not collapse and so on. Of course, there are people who have all these material things easily and do not want to think, they are immersed in materialism..","date":"2014-07-25","mins":"3:42 pm","url":"https://shroudstory.com/2014/07/25/the-shroud-of-turin-and-near-death-experiences/","cat":"science_and_religion","title":"The Shroud of Turin and Near Death Experiences"},{"id":"comment-78323","author":"louis","post":"Fundamentalism can be dangerous, it has led many, particularly pastors, to abandon their respective churches and assume an anti Christian stance. The world lost an eminent biblical scholar and the author of many good books, this week, books that can be very helpful in biblical interpretation. A few minutes of talking with Father Daniel J. Harrington, SJ convinced me that was worthwhile reading what he had written, whether on OT, NT, Qumran,Christianity/Judaism/Faith: http://www.bc.edu/content/bc/offices/pubaf/news/2014 jan feb/fr harrington obit1.html.","date":"2014-02-11","mins":"10:48 am","url":"https://shroudstory.com/2014/02/11/abraham-and-his-camels-the-shroud-of-turin-how-did-we-get-here/","cat":"other_blogs","title":"Abraham and His Camels & The Shroud of Turin. How did we get here?"},{"id":"comment-140292","author":"louis","post":"He is unnecessarily mixing things up, as though the TS is only meant to remind us about the so called NDE and the question of survival after death.There are humans who only think about their survival after death and forget about the rest of creation. If he goes a little deeper into ontology, about which we know very little, he will be led to the topic of energy and much more. For a start, the mind body problem is still not resolved..","date":"2014-07-25","mins":"9:57 am","url":"https://shroudstory.com/2014/07/25/the-shroud-of-turin-and-near-death-experiences/","cat":"science_and_religion","title":"The Shroud of Turin and Near Death Experiences"},{"id":"comment-216207","author":"louis","post":"Hey O.K. President Vladimir Putin would appreciate receiving Shroud material. Don’t you think so? http://www.catholicherald.co.uk/issues/december 11th 2015/vladimir putins holy war/.","date":"2015-12-11","mins":"9:00 am","url":"https://shroudstory.com/2015/12/10/allusions/","cat":"guest_posting","title":"Allusions"},{"id":"comment-97208","author":"louis","post":"O.K. The debate will go much beyond what we read here and we will have developments this year..","date":"2014-04-06","mins":"6:45 pm","url":"https://shroudstory.com/2014/04/03/am-i-the-only-one/","cat":"other_blogs","title":"Am I the only one?"},{"id":"comment-140337","author":"louis","post":"There is also pre death experience. One case: http://abcnews.go.com/International/wire Story/young mh17 victim eerie premonition crash 24673616.","date":"2014-07-25","mins":"3:52 pm","url":"https://shroudstory.com/2014/07/25/the-shroud-of-turin-and-near-death-experiences/","cat":"science_and_religion","title":"The Shroud of Turin and Near Death Experiences"},{"id":"comment-30198","author":"louis","post":"One problem is that Professor Danin “saw” a very large quantity of flowers..","date":"2013-04-10","mins":"9:24 am","url":"https://shroudstory.com/2013/04/10/and-now-the-flowers/","cat":"other_blogs","title":"And Now the Flowers"},{"id":"comment-206697","author":"louis","post":"Breaking News: A man is Australia says he is Jesus Christ, the Turin Shroud proves it, and…. He is gaining followers. Perhaps it is time to compile a Shroud jokebook: http://www.mjemagazine.com/this man is convinced he is jesus christ already gaining followers photos/.","date":"2015-07-27","mins":"4:05 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206749","author":"louis","post":"Correct, Thomas, but at least they are neighbouring countries. By the way, I did not forget your request and am slowly working on an article where I hope to include the information you requested..","date":"2015-07-28","mins":"7:00 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206699","author":"louis","post":"Freud did not place much value on intuition, C.G. Jung did. Some Hindus believe that intuition is direct contact with the Absolute. If that is the case then most of us are atheists as life demonstrates that to be practical many people trample on their intuitions, they go ahead and do wrong things even when they know the damage they are causing. The topic was the cause of the rift between Freud and the Rev. Oskar Pfister. Teilhard actually neglected to give a complete picture of his view of evolution and what we see today unfortunately gets us closer to the neo Darwinians and RD. C.G. Jung went directly to the point: https://www.academia.edu/7344691/C. G. Jung Father Victor White and privatio boni.","date":"2015-07-27","mins":"4:37 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206785","author":"louis","post":"Lest I be misunderstood: The theological problems have not been tackled convincingly, both by scientists such as Teilhard or systematic theologians such as Küng. One could say the same about Karl Rahner. The gaps they have left are yawning, so what we see is: http://time.com/3972713/detroit satanic statue baphomet/ Pope Francis is not exactly an intellectual, he is like a parish priest. Benedict XVI was an university professor for forty years and is keeping in touch with what is being said, whether that comes from atheists or neo Darwinians. Thank God there have been recent developments coming from university professors in Europe, and these appear to be more promising..","date":"2015-07-28","mins":"12:01 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-206701","author":"louis","post":"Hey, did you call him for coffee? He’s your neighbour..","date":"2015-07-27","mins":"4:52 pm","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-207034","author":"louis","post":"The information I have from authorities on the topic in Israel is that it was common to use just one burial shroud..","date":"2015-07-31","mins":"8:44 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-207050","author":"louis","post":"Max, I hesitated before responding to this query because you are very aggressive, keep on posting comments every second minute, which are not responses, and attach adjectives to people’s names, including respected Shroud scholars and scientists. I think you are taking advantage of the fact that Dan is not moderating the blog, but I will give you a chance this time. I think there is no sufficient research on the items you mentioned, so no definitive statements can be made. As for my expertise, I have been writing on developments in biblical archaeology, among other topics, since 1997 and I have access to information which I cannot reveal, unless permission is granted.. I do not look for scoops, just wait for reliable information from known authorities..","date":"2015-07-31","mins":"9:33 am","url":"https://shroudstory.com/2015/07/27/and-we-are-all-mathematician-even-if-we-dont-know-it/","cat":"other_blogs","title":"And We Are All Mathematician Even if We Don’t Know It"},{"id":"comment-65690","author":"louis","post":"Christmas also calls for reflection, at least for believing Christians, and an article by Cardinal Theodore E. Mc Carrick, retired archbishop of Washington, DC, is a good start: http://americamagazine.org/place poor joy gospel Happy Christmas and success in Shroud studies in 2014 to all!.","date":"2013-12-23","mins":"11:27 am","url":"https://shroudstory.com/2013/12/21/another-christmas-card/","cat":"other_blogs","title":"Another Christmas Card"},{"id":"comment-83117","author":"louis","post":"You got the point, Annette. These kind of associations deviate our attention from the essential in Shroud studies. I am preparing something in the field of biblical archaeology, which hopefully should be posted soon..","date":"2014-02-27","mins":"2:01 pm","url":"https://shroudstory.com/2014/02/27/apollonius-of-tyana-proof-or-doom-for-christianity/","cat":"other_blogs","title":"Apollonius of Tyana:  Proof or Doom for Christianity?"},{"id":"comment-205532","author":"louis","post":"Hugh, Frei’s list was published in Ian Wilson’s book “The Shroud:The 2000 year old mystery solved” and was given to him by Father Heinrich Pfeiffer. What we need now is to compare this list with what remains of the Swiss criminologist’s collection in the US and the pollen grains found during the restoration..","date":"2015-07-13","mins":"4:09 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-205654","author":"louis","post":"It does seem that the House of Savoy knew about the letter Pope Innocent III sent to the “crusaders” who took part in the Fourth Crusade: https://www.academia.edu/7447446/Was there a link between the Knights Templar and the Turin Shroud An interview with Dr. Barbara Frale.","date":"2015-07-14","mins":"9:45 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-205676","author":"louis","post":"Thomas, I think she was referring to what is in a book by the expert Ernst Kitzinger, which I have not read. It is known that Bishop Epiphanius opposed the use of some kind of images in churches..","date":"2015-07-14","mins":"12:00 pm","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-205825","author":"louis","post":"Thomas, I will do some research and get back to you..","date":"2015-07-15","mins":"5:36 am","url":"https://shroudstory.com/2015/07/13/beg-your-pardon-comment-promoted/","cat":"comments_promoted","title":"Beg Your Pardon (Comment Promoted)"},{"id":"comment-180523","author":"louis","post":"Rabbi Geoffrey Mitelman has penned a nice article, however he does not address the topic deeply and that makes his approach defeatist. There are things beyond the purview of the Bible. If that is not true there would be no need for systematic theology, but this is a field that has to advance slowly because scientists keep on changing their theories. Both physics and biology have not tacked the question of initial mechanism. Hawking has been influenced by Einstein who, in turn, was influenced by Spinoza, and that limits the quest. More details on this in the introduction to: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ There is no denying that RD has also raised some important questions and it is not possible to dodge them. What is the solution? Science Theology dialogue, since he has neglected to delve into both theology and philosophy. Science and religion should walk together for the benefit of mankind. Happy New Year to everyone!.","date":"2015-01-01","mins":"8:09 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-83049","author":"louis","post":"There is so much myth surrounding Apollonius. He was said to be a “Western yogi” and the Sanskrit texts that had been provided by an Indian scholar to substantiate some connection with India was proved to be a forgery quite recently. So now we have him scourged and crucified and placed in a burial shroud..","date":"2014-02-27","mins":"8:42 am","url":"https://shroudstory.com/2014/02/27/apollonius-of-tyana-proof-or-doom-for-christianity/","cat":"other_blogs","title":"Apollonius of Tyana:  Proof or Doom for Christianity?"},{"id":"comment-180601","author":"louis","post":"Did Einstein really understand the universe? First, he did not go beyond Spinoza (as the link above demonstrates), then he said the world would become Buddhist in the future. Can we go further? Yes, we can. Did Buddha understand the universe? It is doubtful how far he understood it. Nirvana means Nothingness. So what is the meaning of it all?.","date":"2015-01-01","mins":"3:10 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180620","author":"louis","post":"The confusion created by scientists in the West, with the consequent decline in religion there has generated a tidal wave against “Abrahamic religions” in India. First a big church was set on fire: http://www.archdioceseofbombay.org/news/national/press statement burning st sebastians church Then “reconversions to Hinduism” by force: http://www.catholicherald.co.uk/news/2014/12/30/cardinal protests against forced conversion of christians to hinduism/ Next, a book by the University of Chicago Indologist Wendy Doniger has been banned in the country: http://en.wikipedia.org/wiki/The Hindus: An Alternative Historyristians to hinduism http://en.wikipedia.org/wiki/The Hindus: An Alternative History The agenda: The Indian Prime Minister wants to take President Obama to Varanasi..","date":"2015-01-01","mins":"6:06 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-183129","author":"louis","post":"Father Jonathan Morris (Fox News) has something to say: http://finance.yahoo.com/video/christianity under attack government 182302397.html.","date":"2015-01-13","mins":"9:02 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180593","author":"louis","post":"From the philosophical point of view, if we restrict the debate to the universe there is no possibility of answering the question, Does God Exist? In the link provided above it is clear that Hawking has begun to cling to Einstein, who clung to Spinoza, and was also influenced by Freud. That has only lead to a vicious circle..","date":"2015-01-01","mins":"2:28 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180602","author":"louis","post":"Hello David Yes, you can repeat the last paragraph, there are clues..","date":"2015-01-01","mins":"3:12 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180711","author":"louis","post":"Not even C.G. Jung abandoned his Christian faith because of the problem of evil: https://www.academia.edu/7344691/C. G. Jung Father Victor White and privatio boni This is a topic that will be addressed more at length in the future. All I can say now is that there can be no intellectually fulfilled atheist, so consequently there also can be no atheist and rationalist..","date":"2015-01-02","mins":"6:54 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180534","author":"louis","post":"Anoxie, what is that supposed to mean?.","date":"2015-01-01","mins":"9:10 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180729","author":"louis","post":"I don’t really see how science can work without a deity, given that we are finite. It is another story if they indulge in scientism. That would be going beyond the limits of science, into the realm of philosophy and theology. There should be science theology dialogue..","date":"2015-01-02","mins":"8:05 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181275","author":"louis","post":"That is why Sir Karl Popper wrote that science can never answer the question of the significance of the universe and the reason why science theology dialogue is necessary: https://www.academia.edu/5353803/God science and religion today There are clues in the New Testament..","date":"2015-01-04","mins":"10:27 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-181929","author":"louis","post":"What is created is destroyed and what is destroyed is created. The key to understanding that is in the New Testament. Empirical psychology is more important than philosophy and both fields need to get closer to each other. If empirical psychology discovers something philosophers will make attempts to interpret it. But, as Pope John Paul II, also a philosopher, pointed out in his important encyclical “Fides et Ratio” (Faith and Reason) philosophy needs theology. That takes us back to the New Testament since Scripture is the soul of theology. Despite his brilliant philosophy Wittgenstein based his life on Scripture, his Catholic friends buried him at Saint Giles, Cambridge after he told them to pray for him as he lay dying. It is doubtful if atheism can be intellectually satisfying. There is no denying that there are still problems that need to be solved, there is more in the box, so more thinking is needed: https://www.academia.edu/8424286/Book Review The Future of Atheism Alister Mc Grath and Daniel Dennett in Dialogue.","date":"2015-01-07","mins":"7:17 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-180842","author":"louis","post":"What is wrong?.","date":"2015-01-02","mins":"5:39 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-182889","author":"louis","post":"Hello David and O.K. This is a nice discussion both of you are having, but where a solution is not that easy. Rewriting Genesis will not help because it is a mixed bag, there is Mesopotamian influence. The book contains a deep mystery and that is the original thread. I think O.K. Understands that. C.G. Jung tried his best to reach a solution with his closest friend, the Oxford based American Dominican monk Father Victor White: https://www.academia.edu/7344691/C. G. Jung Father Victor White and privatio boni The differences led to a big division between them and it was only a spiritual bond that made them keep contact with each other. The situation was painful to both of them. We must remember something important: all of us are immersed in evil in many things we do, it is simply that we are not aware of it or sweep the problem under the rug. Perhaps because it is a question of survival. David understands that. Jung thought about these things, he felt it in his skin. That is evident in what he told the nun who helped him, in the last line in the above link..","date":"2015-01-12","mins":"7:37 pm","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-30954","author":"louis","post":"A big part of the French population is known to be Catholic, though not necessarily practicing. Sarkozy never denied his Catholicism and reminded his people more than once about regaining forgotten values and traditions, and something similar was said by Merkel, a Lutheran, in Germany. Unfortunately, Sarkozy was not re elected..","date":"2013-04-16","mins":"8:49 am","url":"https://shroudstory.com/2013/04/15/danusha-goska-on-catholics-atheists-censorship-and-the-shroud/","cat":"news_&_views","title":"Danusha Goska on Catholics, Atheists, Censorship and the Shroud"},{"id":"comment-34678","author":"louis","post":"Matthew 26:28 ” … My blood of the covenant, which is poured out for MANY…”.","date":"2013-05-24","mins":"5:26 pm","url":"https://shroudstory.com/2013/05/24/an-atheist-going-to-a-heaven-he-doesnt-believe-in/","cat":"news_&_views","title":"An Atheist Going to a Heaven He Doesn’t Believe In"},{"id":"comment-45553","author":"louis","post":"The well known German journalist Peter Seewald, former editor of “Der Spiegel”, once a communist and atheist, returned to Catholicism, stating that “Pope Benedict XVI is a spiritual master who can give answers.” In the interviews he later published in a book, Seewald heard the pontiff tell him that he did not want to see any questions in advance, and they were forthright questions, with answers that convinced him. Seewald was looking for the truth. Whether that will also be the case with Piergiorgio Odifreddi only time will show..","date":"2013-09-26","mins":"8:39 pm","url":"https://shroudstory.com/2013/09/26/quotations-for-today-benedict-xvi-and-atheist-piergiorgio-odifreddi/","cat":"off_topic","title":"Quotations for Today: Benedict XVI and Atheist Piergiorgio Odifreddi"},{"id":"comment-45659","author":"louis","post":"The Church is hitting hard and there is now news from: not Benedict, but Pope Francis. He has excommunicated the Australian priest Greg Reynolds for advocating the ordination of women..","date":"2013-09-27","mins":"7:26 pm","url":"https://shroudstory.com/2013/09/26/quotations-for-today-benedict-xvi-and-atheist-piergiorgio-odifreddi/","cat":"off_topic","title":"Quotations for Today: Benedict XVI and Atheist Piergiorgio Odifreddi"},{"id":"comment-45623","author":"louis","post":"There is more to read. Pope Benedict has also aimed at RD: http://blogs.telegraph.co.uk/news/timstanley/100237766/hes back benedict xvi speaks out on sex abuse and calls richard dawkins science fiction/.","date":"2013-09-27","mins":"11:05 am","url":"https://shroudstory.com/2013/09/26/quotations-for-today-benedict-xvi-and-atheist-piergiorgio-odifreddi/","cat":"off_topic","title":"Quotations for Today: Benedict XVI and Atheist Piergiorgio Odifreddi"},{"id":"comment-38221","author":"louis","post":"This calls our attention to an old, but good, lead, something to ponder about. Reminds one of the Templar chant, psalm 57..","date":"2013-06-27","mins":"10:33 am","url":"https://shroudstory.com/2013/06/27/the-face-of-god-and-the-shroud-of-turin/","cat":"news_&_views","title":"The Face of God and the Shroud of Turin"},{"id":"comment-33048","author":"louis","post":"That is the right and very good approach, Matthias..","date":"2013-05-06","mins":"10:13 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-145532","author":"louis","post":"Serious problems can arise when the search is not for the face of God: http://www.examiner.com/article/consecrated host returned by satanists after archbishop files lawsuit.","date":"2014-08-22","mins":"8:55 pm","url":"https://shroudstory.com/2014/08/21/the-search-for-the-face-of-god/","cat":"news_&_views","title":"The Search for the Face of God"},{"id":"comment-34031","author":"louis","post":"Angel #101 It is not difficult to detect pagan influence in the composition of the Torah and the question of “he” and “she” has more to do with anthropomorphism. In the NT Jesus tells us what it is like “up there” while answering a query posed by the Sadducees..","date":"2013-05-19","mins":"9:30 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34529","author":"louis","post":"Angel,re #125 Sorry, you seem to have been led to read rubbish, because that which you read is a way of dodging the issue. Genesis says creation was ready in six days, the world was ready for humans to explore and so on. There were different trends that merged in the composition of that book and only a fundamentalist is willing to take what is written literally. The apostle Paul understood many such things clearly and thus began to transform the Jesus movement into the Christian Church. Best..","date":"2013-05-23","mins":"8:07 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34029","author":"louis","post":"Angel #95 If we look for certainties all the time then there will be no time left to do anything else, therefore many things are taken for granted in life. Delete the “if” in #94 as it helps to make things more clear. Best..","date":"2013-05-19","mins":"9:11 am","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34252","author":"louis","post":"Angel The account in Genesis can not be taken literally, the Pentateuch is a composite document. Best..","date":"2013-05-21","mins":"7:38 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34538","author":"louis","post":"The Bible was not dropped from heaven to be taken literally in everything that is stated, it was a slow development involving inspiration and revelation, myths, legends, history. Genesis shows how Mesopotamian myths crept into the text and therefore also how neigbouring nations influenced Hebrew culture..","date":"2013-05-23","mins":"8:49 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34532","author":"louis","post":"Angel, re.the comment addressed to Jesterof. Non human animals were also created male and female. Best..","date":"2013-05-23","mins":"8:18 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-34660","author":"louis","post":"Angel There is absolutely no reason to interpret everything in the Bible as metaphor and the objection is against the fundamentalist approach, something like saying “Everything is true or nothing is true.” That is the biggest mistake and clashes with what we learn from science today, but not that science alone can determine what we can know about existence. I have a lengthy six page interview on the Bible ( Finkelstein, Exodus, Wellhausen and JEDP, Albright, John P. Meier, Helmut Koester, Revelation and Inspiration in the Bible, Dead Sea Scrolls, Father Roland de Vaux, Geza Vermes, Father Émile Puech, Father Justin Taylor, Essenes, Qumran excavations, “Jesus family tomb,” the Messiah, Jesus of history/Christ of faith etc.) with one of the world’s foremost biblical scholars and hope to be able to post it soon. Best..","date":"2013-05-24","mins":"3:36 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33101","author":"louis","post":"So its a question of Believe in the Shroud because of Jesus and believe in Jesus because of the Shroud?.","date":"2013-05-06","mins":"7:18 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33073","author":"louis","post":"OK Yannick, this time I agree with your above comments..","date":"2013-05-06","mins":"1:08 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33288","author":"louis","post":"Hullo Angel You can be sure that Jesus was anti Essene because he did many of the things the Essenes prohibited. The Essenes also had some strange esoteric beliefs since they were a fringe group and it is not clear if they influenced John the Baptist because there were many baptismal groups and “free lance” baptizers around in the desert region. If Jesus was a Nazarite he would have to make vows and take pigeons to the Temple for blood sacrifice and it is highly improbable that he would agree with these things. Best..","date":"2013-05-08","mins":"8:29 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33353","author":"louis","post":"That the Essenes were in a way demons in the guise of angels is revealed in some of their writings. Take for instance the War Manual..","date":"2013-05-09","mins":"4:10 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33564","author":"louis","post":"Angel #60 Don’t worry about how my name was spelt. What’s in a name? It does not matter if Mary Magdalene was a prostitute or not, it does matter when we try to find out the relationship between Jesus and the Essenes. They are two very different things and one can, when dealing with the Essenes, be misled by Allegro or Wilson. Don’t rely on Wikipedia for your studies, it may be an useful start. Go to the heavyweights: Fathers Roland de Vaux and Fitzmyer, Yadin, García Martínez and others. Best..","date":"2013-05-12","mins":"3:38 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-181276","author":"louis","post":"Atheists are sometimes too lazy to think, they give up. Heidegger did not find a deity in his philosophy, then sensed that something was wrong. I think it was, “The wisdom of this world…”. He sought refuge in history, and returned to the Catholicism he had abandoned, began to enter and bless himself each time he passed by a church and called a priest to his home to formally request a Catholic burial. Https://www.academia.edu/8424286/Book Review The Future of Atheism Alister Mc Grath and Daniel Dennett in Dialogue.","date":"2015-01-04","mins":"10:34 am","url":"https://shroudstory.com/2015/01/01/again-does-god-exist/","cat":"science_and_religion","title":"Again:  Does God Exist?"},{"id":"comment-33829","author":"louis","post":"It is the words of Jesus that matter, not whether he was 20, 30,40 or 50 years of age when he uttered them. The impact is such that those who understand don’t seem to bother about minor matters. We can not forget that he played the central role in history and this is something that a even a sceptic like Renan accepted without problems, going to the extent of stating that …..","date":"2013-05-16","mins":"7:58 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33575","author":"louis","post":"Angel Will you mind if I say you are on the wrong track? Robert Eisenman is not taken seriously by most DSS scholars, he was by the sensationalist writers Baigent and Leigh. The same can be said about Norman Golb, although he is serious, only his theory being flawed. I did learn about Geza Vermes. RIP. There were flaws in his translations and he, too, is controversial. Tell me what you feel about his scholarship and, depending what you say, I may have some news for you. Best..","date":"2013-05-12","mins":"7:54 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33837","author":"louis","post":"Jesterof, your arguments about the age have been convincing, and what was being referred to were some biblical studies where the question of age has been raised..","date":"2013-05-16","mins":"9:10 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33901","author":"louis","post":"Agreed, the Bible scholars generally do not bother about the age because there are more important things to write about and the chronology is generally accepted..","date":"2013-05-17","mins":"5:25 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-33956","author":"louis","post":"Obviously it was a way of rounding up the age, 50 if Jesus was 30, and it could have been 100 if he was seventy. They were talking in terms of fifties and hundreds because the context was the reference to Abraham who had lived more than 2000 years earlier. If 50 was used, therefore, that was due to the fact that Jesus was below 50, not because he was in his forties..","date":"2013-05-18","mins":"1:56 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-17143","author":"louis","post":"Thanks for the tip, Angel. I will have a look at the images you mention. Yes, there may be still a lot to find and it is important that whatever is found has provenance and context and is rightly interpreted. All the best..","date":"2012-10-01","mins":"11:17 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17346","author":"louis","post":"Hullo Ron.Many thanks for the tip. So much has been filmed or written about OT archaeology that is nothing but wishful thinking, if not wild imagination. Since the lead has come from you I will take it seriously and see the video the soonest possible. L..","date":"2012-10-08","mins":"8:54 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17318","author":"louis","post":"Hullo Angel. I have seen the images you mentioned but have to tell you that unfortunately they are not at all convincing. Why, for instance, is the mountain with the “blackened top” photographed behind another mountain? Real archaeology is rigourous and this seems to be the work of amateurs. They have seen a “tree” between two rocks on top of a mountain. Why is there no close up? No tree is visible and the image seems to have been photoshopped. There is a bush inside the compound of Saint Catherine’s Monastery in Sinai and visitors are obliged to go the area barefoot. Such things, aslo, seem to be folklore and do not help if one is looking for something to maintain faith. Best..","date":"2012-10-07","mins":"8:39 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17084","author":"louis","post":"Hullo Angel. Yes, no religion is born in a vacuum, but this raises the question: Who influenced whom? The question of Zoroastrianism and Judaism is an old story and it could have been the other way round. The Essenes had their dualism (which could be traced to Zurvan), but it was subordinate to monotheism. There were bits of gnosticism before Christianity, however it was not full blown gnosticism. Paul is very difficult to interpret because he is very subtle and he understood the Christ event very well. It looks like a great deal of study is needed, given that there is no agreement about his letters, his point of view and so on..","date":"2012-09-30","mins":"2:34 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-17064","author":"louis","post":"The coin found in the mouth of Miriam — as archaeologist Zvi Greenhut said, to pay the god Charon in order to be ferried accross the Styx — in the Caiaphas tomb is evidence that the Sadducees were heavily influenced by the Greeks. There is even earlier evidence that there were cults held around + 500 BC Jewish tombs. The AD 42 43 coin proves that at least some Sadducees believed in an after life but not in bodily resurrection..","date":"2012-09-29","mins":"4:39 pm","url":"https://shroudstory.com/2012/09/29/blogger-please-dont-get-upset-if-your-catholic/","cat":"other_blogs","title":"Blogger: Please don’t get upset if you are Catholic"},{"id":"comment-65709","author":"louis","post":"Colin Berry has every right to propose what he wants, as long as it is backed by scientific evidence. Jacques de Molay is part of history, not of science, and the person who proposed this “original” theory and written even more “original” books has not been taken seriously. He has only proved that he is spurred by hatred of Christ and Christianity..","date":"2013-12-23","mins":"11:51 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-66008","author":"louis","post":"Hullo John, what you say is unfortunately true, so we are led to say … “Follow the money line.” After some on site research in mediaeval history in England some years ago and reading some books about the Templars the only conclusion that could be reached is that, with the exception of Joseph Addison, and lately Piers Paul Read, almost all that has been written on the warrior monks is rubbish. Most of this could have been avoided if the “Chinon Parchment” had been found a hundred or so years earlier. Jacques de Molay was interested in raising the morale of his knights after the Fall of Acre, that being the reason why he gladly went to France to discuss plans for a new crusade with Pope Clement V. As you know, Philippe le Bel’s coffers were empty and the rest is history. No heretic would ask to face Notre Dame while dying at the stake!.","date":"2013-12-23","mins":"6:42 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-65646","author":"louis","post":"Scientific proof that Christianity is true? The Catholic Church, at least, has its Communion of Saints, and the canonisation process often involves medical practioners who are non Catholics, atheists and agnostics. The Indian born Hindu surgeon Dr. Anil Dhawan, Professor of Paedriatric Hepatology at King’s College Hospital, Denmark Hill, in the south of London, was one of them: http://www.catholicnews.com/data/stories/cns/0702902.htm The German journalist and author Andreas Englisch, a Vatican Correspondent for twenty years, who was a sort of lapsed Catholic, returned to his faith filled with conviction and wrote a book on Pope John Paul II in which he mentions several cases of healing and curing by the pontiff. One case, involving a Jewish millionaire in New York, was even reported in the UK’s “Daily Telegraph”..","date":"2013-12-23","mins":"10:19 am","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-66040","author":"louis","post":"John argues very well in #43. Professor Avinoam Danin was onto more research on the thorns, as he himself stated in his book “Botany of the Shroud”, however he had little cooperation..","date":"2013-12-23","mins":"7:36 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"},{"id":"comment-208057","author":"louis","post":"Among the recent Popes, only Benedict XVI demonstrated belief in authenticity openly, however that is his personal opinion, the relic is not part of the Deposit of Faith. That of course does not mean that the other pontiffs reject authenticity, they leave the matter to science. It was the Italian company Italgas which funded all that expensive equipment for the Shroud’s conservation. The Holy See gladly accepts donations. HP donated US$ 500,000 of computer equipment to them and an American millionaire, who preferred to remain anonymous, paid for the construction of a new building to house the cardinals during a conclave. If the Church thinks that the Shroud is a fake it would never have Italgas spending that amount of money. Shortly before the Exposition I commented on this blog that Pope Francis would talk about suffering, and that was exactly what he did. It was what could be expected of him. Being South American, he was influenced by the Peruvian priest theologian Father Gustavo Gutierrez. He seems to have done the right thing. Shrould studies have fallen short of the mark, and carbon dating is not an easy matter for the Church because of anti clericalism..","date":"2015-08-12","mins":"9:39 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208249","author":"louis","post":"Bom dia, Antero Concordo com você. O sofrimento humano preocupa o Papa, por isso falei antes da Exposição que ele ia falar sobre isso. Infelizmente, tanta bobagem está sendo falado tanto dentro com fora da área de estudos sobre o Sudário, que com certeza chegou aos ouvidos dele, que ele preferiu não falar nada sobre a autenticidade. Durante meus trabalhos escrevendo sobre a arqueologia bíblica e estudos bíblicos observei que nenhum estudioso o arqueólogo, padres incluidos, estavam interessados na relíquia. Não acredito que algo vai mudar na nossa geração. Saudaçoes, Louis ————— Good morning, Antero I agree with you. Human suffering worries the Pope, that is why I said before the Exposition that he would talk about this. Unfortunately, so much nonsense is being said both in and out of the realm of Shroud studies, which certainly reached his ears,that he preferred not to talk about authenticity. During my work writing on biblical archaeology and biblical studies I noticed that no scholar or archaeologist, priests included, were interested in the relic. I don’t believe that anything will change in our generation. Regards. Louis.","date":"2015-08-14","mins":"9:13 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208080","author":"louis","post":"Hi Nabber I get your point. The problem is that although no one expected Pope Francis to swing the thurible in front of the relic, as the Russian Orthodox Metropolitan Hilarion did: https://www.google.com/search?site=&tbm=isch&source=hp&biw=1366&bih=667&q=hilarion+shroud&oq=hilarion+shroud&gs l=img.12…1811.5640.0.7842.15.15.0.0.0.0.123.1359.14j1.15.0….0…1.1.64.img..5.10.954.e Rb Pt0 EGA Fw#tbm=isch&q=hilarion+shroud+serbian+orthodox+church&imgrc=y9e Siurx Aea MM%3 A he did not even kneel in front of it. Popes John Paul II and Benedict XVI did so: Benedict can be seen in the link: http://theratzingerforum.yuku.com/topic/526/Special Events?page=20#.Vct8 Evl Viko As I said in the above comment, the pontiffs have not rejected authenticity, but they are also not in a position to make any official pronouncement as the matter has been left to science. Shrould studies have fallen short of the mark, and carbon dating is not an easy matter for the Church because of anti clericalism..","date":"2015-08-12","mins":"12:15 pm","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208258","author":"louis","post":"Http://www.huffingtonpost.com/2013/12/17/pope birthday homeless n 4458357.html.","date":"2015-08-14","mins":"11:44 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208257","author":"louis","post":"Pope Francis’ heart is here. Chief Almoner Archbishop Konrad Krajewski makes sure the homeless in Rome get something to eat every day. If not, Francis will box his ears: http://www.huffingtonpost.com/entry/pope francis visit east harlem school 55cbb5d3e4b0898c48866df9?cps=gravity 2677 1251852405132522851&kvcommref=mostpopular.","date":"2015-08-14","mins":"11:43 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208265","author":"louis","post":"Good question, Hugh. I think the blog is meant for serious discussion, not for entertainment..","date":"2015-08-14","mins":"1:01 pm","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-208269","author":"louis","post":"Hi Dan; Just a suggestion, take it or leave it: ” 1. You need to be civil. No ad hominem, personal attacks, or character assassination, please! 2. Keep your comments brief. No lengthy diatribes. 3. Keep on topic. A little wandering is OK, but debates between two people who are getting way off topic are not helpful to others. 4. That’s about it. Let’s have some good discussions, folks!” It is what I found on a blog, one among many where serious discussions are going on..","date":"2015-08-14","mins":"1:29 pm","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-203982","author":"louis","post":"There is a yardstick by which to judge other experiments being made. It is the experiments that were made by Dr. Paolo Di Lazzaro, described in: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin Not long after this was published his work was highlighted in “National Geographic”. As for the blood, Drs. Heller and Adler were serious scientists and published their findings in peer reviewed papers..","date":"2015-06-28","mins":"1:36 pm","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","title":"Extreme Blogging"},{"id":"comment-208278","author":"louis","post":"Relics don’t fill empty stomachs. Pope Francis has been criticised for his views, however there is another important figure who thinks like him. Archbishop Justin Welby, of Canterbury, has been doing some good work in England and is outspoken: http://www.archbishopofcanterbury.org/articles.php/5579/capitalism must draw alongside the suffering says archbishop.","date":"2015-08-14","mins":"3:32 pm","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-203996","author":"louis","post":"Now we also need some lines about why there really is blood on the Shroud..","date":"2015-06-28","mins":"4:16 pm","url":"https://shroudstory.com/2015/06/28/extreme-blogging/","cat":"other_blogs","title":"Extreme Blogging"},{"id":"comment-35147","author":"louis","post":"David, your last sentence confirms what I noticed and commented earlier. Also have to agree with you regarding Geering, certainly not worth attention..","date":"2013-05-28","mins":"6:32 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","title":"Forced by the evidence to jettison long-held assumptions about Catholic relics"},{"id":"comment-208064","author":"louis","post":"The reason some people look to the Shroud is to find out if it confirms Scripture. The interpretation of Scripture can be a problem, particularly because it is the soul of theology. When it comes to systematic theology the problem becomes worse. We see that in literature: https://www.academia.edu/12823419/Book Review Jesus and Yahveh the names divine as well as in what biblical scholars have thought: https://www.academia.edu/12851672/The Historical Jesus The view of Professor Geza Vermes God does seem to turn down the blinds when he wants to, leaving us to decide about faith..","date":"2015-08-12","mins":"9:59 am","url":"https://shroudstory.com/2015/08/12/does-pope-francis-believe-the-shroud-is-real/","cat":"other_blogs","title":"Does Pope Francis Believe the Shroud is Real?"},{"id":"comment-35155","author":"louis","post":"David, many thanks for your opinion. Around two years ago I did read an article written by him and noticed that he was dodging some issue here and there and anyone who did not understand biblical studies in depth, at least to some extent, could swallow what he was saying. The same thing was also noticed when it came to Lüdemann. To me this is not honest but agenda driven scholarship. Well, that trick by Geering prompted me to dismiss him but as you say he is influential it is worthwhile having a look at what he has said recently and this will be done shortly. Renewed thanks for this lead..","date":"2013-05-28","mins":"8:09 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","title":"Forced by the evidence to jettison long-held assumptions about Catholic relics"},{"id":"comment-35378","author":"louis","post":"It is likely that Geering’s position is based on what physicists say about the universe, but one is led to wonder whether he has thought about cognition, that is, religion as naturally cognitive and science as unnaturally cognitive. So he may have taken what is unnaturally cognitive as something naturally cognitive. That could explain why his position is odd..","date":"2013-05-30","mins":"3:49 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","title":"Forced by the evidence to jettison long-held assumptions about Catholic relics"},{"id":"comment-34880","author":"louis","post":"Pastor Parker was one of the few who finally opened his eyes in the Bible belt region and took the right approach. The fundamentalists are not only reared with virulent anti Catholicism, they also want to take everything in the Bible literally, as though it was dropped from heaven in King James English. The reasoning goes like this: Catholics are not guided by the Bible, but we are, and everything is true or nothing is true. When they realise that they were wrong the sense of frustration is so great that they become atheists and anti Christian. Look at what Loftus, Price and Lüdemann are doing..","date":"2013-05-26","mins":"11:15 am","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","title":"Forced by the evidence to jettison long-held assumptions about Catholic relics"},{"id":"comment-34908","author":"louis","post":"David,I have read something by Ehrman and agree with you about his arguments for the historical reality of Jesus, but I have found the rest mostly unconvincing. The Irish ex priest John Dominic Crossan —whose book on the historical Jesus I had occasion to review many years ago — says that Jesus’ dead body was eaten by wild dogs and yet is is counted among the top Catholic scholars. Have you read Professor Luke Timothy Johnson’s “The Real Jesus”? It is a popular book, very easy to understand and he demolishes Crossan, Spong, Thiering (your neighbour!) easily. The three men cited in #4 are all ex (fundamentalist) pastors. The problem of evil and suffering is indeed a great problem, and most of those who believe in the Bible tend to sweep these topics under the carpet as it seems to be a more practical approach to them. We don’t appear to have any theological solution and this was exactly what caused the rift between two very close friends, C.G.Jung and the (Oxford Blackfriars Dominican) Father Victor White. It is known that Jung was strongly attracted to the Catholic Church — he hung a copy of the Shroud face behind a small curtain in his study — and needed White, was in fact thinking of him as his successor, but in the end the friendship sort of ended because of a misunderstanding. Jung wanted to visit White as he lay dying as a result of injuries sustained in a motorcycle accident in England, but his age and health prevented him from travelling and he asked the local Catholic priest to say a mass for White after his death. It is one of those great tragedies in the history of ideas. Regarding that statement by the Rev. Shafer Parker, he sounds a bit like Pope Francis I, and this,too, is a problem because it sound like a kind of dualism, more to do with Zoroastrian belief. The Lord’s Prayer has “.. But deliver us from evil..”, so that is evidently what every believing Christian should hope for every day, the ultimate omnipotence of God, rather than entertain the idea that Satan is laying down all the rules here..","date":"2013-05-26","mins":"5:49 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","title":"Forced by the evidence to jettison long-held assumptions about Catholic relics"},{"id":"comment-34912","author":"louis","post":"You see, Jesterof, how Ehrman is contributing to the suffering he is complaining about. Not many have the money he made selling those books, undermining the faith of Christians, contributing to evil..","date":"2013-05-26","mins":"6:01 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","title":"Forced by the evidence to jettison long-held assumptions about Catholic relics"},{"id":"comment-35061","author":"louis","post":"David, since Crossan was looking for a way to reject the physical resurrection of Jesus the wild dogs were handy for him and he could perhaps thus devote more time to looking for more background like Greco Roman influence in Palestine or the Mediterranean region on the whole. You are also right about Thiering, who makes Pagels look like a devout Christian, and it was kind of obvious that in her case it was wild imagination. An editor gave me Wright’s 850 page book on the Resurrection to read last year but there was a lot of writing to do and piles of other books on other topics to read so he had to be kept aside. In my view Professor Vermes was never the best Jesus scholar, that honour has to be reserved for Msgr. J.P.Meier, although Fr. Anthony Kelly (your neighbour again!) has aimed at him. Vermes was sort of obsessed with Jesus and gave his approach a different slant, questioning the rationale behind the birth of Christianity and dismissing important NT accounts like the parable of the Wicked Tenants as an invention of the primitive Church. It was written all over the walls that his writing were mostly agenda driven. Hopefully more about this and much more important viewpoints, all of it original, should be posted on the Internet shortly. As you said, Job is still an unresolved problem. Leibniz never convinced many and the efforts being made today to tackle the problem do not seem to be very promising. We will have to continue to live with these kind of things, using faith as a prop..","date":"2013-05-27","mins":"6:56 pm","url":"https://shroudstory.com/2013/05/26/forced-by-the-evidence-to-jettison-long-held-assumptions-about-catholic-relics/","cat":"other_blogs","title":"Forced by the evidence to jettison long-held assumptions about Catholic relics"},{"id":"comment-196720","author":"louis","post":"Come on, Colin. Are you comparing your results to the Shroud image? There is a lot more work to do to try and get there..","date":"2015-04-18","mins":"12:10 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-196746","author":"louis","post":"Hugh seems to have misunderstood the interview with Paolo Di Lazzaro. He never said that it was radiation, neither did I. I wrote “radiation like” because laser was used in the experiment and I simply do not believe that only the dead Jesus could have been baking like a piece of bread in an oven, or that “impurities” and what not could have produced that image. It would be like saying that the hundreds of other crucified Jews were all neatly buried, washed with the best soap to become spotlessly clean and then placed in air conditioned tombs. One thing must be kept in mind: If it IS Jesus, no amount science will be able to determine what exactly happened..","date":"2015-04-18","mins":"4:06 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-196761","author":"louis","post":"What is meant is that radiation, or a radiation like energy, which is the term I like, was the best means found to generate an imprint similar to what we see on the Shroud. Now this certainly does not mean that Dr. Paolo Di Lazzaro believes that the image was produced by radiation..","date":"2015-04-18","mins":"6:35 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-196729","author":"louis","post":"All right, let us go step by step. You said that the gooey imprinting medium is painted onto the subject first, followed by blood and that the blood ended up under the body. The problem is that no blood was detected on top of the body image of the Shroud. You get me? Please, hagiographies don’t interest me, exception taken to the lives of Thomas More and John Fisher, at your end, which were found fascinating. I think it is correct to concentrate on one particular experiment — NG also thought so, after me — but to emphasise that research is not hagiography!.","date":"2015-04-18","mins":"2:00 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-196727","author":"louis","post":"Hi Colin I trust you have read Dr. Paolo di Lazzaro’s description of his experiment and all that we know about the Shroud. Now let us go to the bloodstains, which have been the object of controversy. My suggestion is that if Turin allows another hands on examination of the Shroud the same should be done with the Sudarium of Oviedo simultaneously. Meanwhile, being anti authenticity how would you explain the correspondence of the blood stains on both relics? Only don’t come with the story that the medieval forger (France) got hold of the sudarium (in Spain),found a found a suitable Knight Templar and beat him up in such a way so that the bloodstains could show an exact correspondence: https://www.academia.edu/11804110/Is the Sudarium of Oviedo the key to unraveling the mystery of the Shroud of Turin.","date":"2015-04-18","mins":"1:05 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-196742","author":"louis","post":"There is no hurry, Colin, take your time. Forget the acid for the time being, concentrate on the blood below the print we were discussing. I only understand the basics in printing, yet have never seen anything like what you describe. What you are saying is that linen acts like a bloodsucker!.","date":"2015-04-18","mins":"3:51 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-196737","author":"louis","post":"I got what you mean, Colin, but only to a certain extent. Do you mean that it works that way only with linen? Not long after I began writing on developments in the chemical, dye and pesticides industry my director thought it would be better for me to also learn something about the printing process. I therefore had to work as printing supervisor and learnt enough about the printing process during the period. Of course, we were printing on paper, not linen. Have a look at the link below, which will take you to screen printing, go to no.5, which refers to printing garments. Why is it different with linen? http://www.screenprintinghowto.org/.","date":"2015-04-18","mins":"3:04 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-196767","author":"louis","post":"Colin, it is not like that on the Shroud. Only serum rings were detected because of the image/blood overlap..","date":"2015-04-18","mins":"6:53 pm","url":"https://shroudstory.com/2015/04/18/god-does-whatever-he-feels-like/","cat":"other_blogs","title":"God Does Whatever He Feels Like"},{"id":"comment-172573","author":"louis","post":"Hi John (John Klotz): Something you will be very interested to read: http://thinkprogress.org/climate/2014/11/22/3596041/poll religion climate end times evangelicals.","date":"2014-11-22","mins":"3:10 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-171260","author":"louis","post":"Brother Guy Consalmagno on cosmology: https://search.yahoo.com/search; ylt=A0 LEV1 F Wj WZ Uf.8 A Sx X Nyo A?ei=UTF 8&fr=yfp t 250&fp=1&p=guy+consolmagno+consciousness+universe&Spell State=&fr2=sp qrw corr top.","date":"2014-11-14","mins":"6:23 pm","url":"https://shroudstory.com/2014/11/14/god-in-his-lab/","cat":"other_blogs","title":"God in his lab"},{"id":"comment-205272","author":"louis","post":"It does seem that Sam Harris, although American, did not bother to read about Cardinal Avery Dulles: http://averydulles.blogspot.com.br/.","date":"2015-07-11","mins":"2:18 pm","url":"https://shroudstory.com/2015/07/11/ignorance-with-wings/","cat":"other_blogs","title":"Ignorance with Wings"},{"id":"comment-35350","author":"louis","post":"This is nothing but anti Catholic bias, typical of religious communities called “churches” with no apostolic tradition. They are aware of that, develop a complex as a result, and aim at Catholicism in some way or the other Did the blogger enter a time machine to see what Jesus’ hair was like as he lay dead in the sepulchre?.","date":"2013-05-30","mins":"10:33 am","url":"https://shroudstory.com/2013/05/30/how-can-you-argue-with-this/","cat":"other_blogs","title":"How can you argue with this?"},{"id":"comment-167203","author":"louis","post":"How knowledge is created? What if it is not created and comes in the form of intuitive knowledge, generated spontaneously, coming as though by accident? In this case the question of objectivity does not arise. Why? Because the knowledge comes spontaneously, it is not chosen and can come in the form of bad news. It leads to insight..","date":"2014-10-31","mins":"8:15 am","url":"https://shroudstory.com/2014/10/31/how-knowledge-is-created-the-shroud-of-turin/","cat":"other_blogs","title":"How Knowledge is Created:  The Shroud of Turin"},{"id":"comment-55147","author":"louis","post":"Incomparable brilliance of Brahmanic Civilization? It should actually be Indus Valley Civilisation and they did not need science because there was no one studied anthropology in the region then, so it was convenient to to come up with the caste system and give it a mythical religious sanction although it had (and has) something to do with race. Teilhard was the object of some mention in the Church last year, not, of course, as a heretic. We know more than he did now. The Church, however, cannot make any official pronouncements because many things in science are not 100% proved, in physics, for example, where we move from hypothesis to hypothesis. It is evident that even Stephen Hawking knows that. If he didn’t he wouldn’t be a member of the Pontifical Academy of Science..","date":"2013-12-02","mins":"3:22 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-205388","author":"louis","post":"You’re welcome, daveb. You will find a lot of useful material there..","date":"2015-07-12","mins":"10:08 am","url":"https://shroudstory.com/2015/07/11/ignorance-with-wings/","cat":"other_blogs","title":"Ignorance with Wings"},{"id":"comment-55943","author":"louis","post":"R.H. Cahall,re. #30, is your first name Alice or Wyatt? It was you who began this talk about “Brahmanism” and science. Let me say the following once and for all: The caste system is based on mythology, it is racial in origin. If you went to India you would notice that and it is only applicable there, not to other peoples like Eskimos, Jews, Zulus, Anglo Saxons and the rest. It is linked to the belief in reincarnation and the cause of much suffering in that country. There was no science around when it was invented, just mythology providing “divine sanction” because it was “divinely created”. With 21st century now around, it is still not interesting for many to get rid of the caste system, and I think you know why..","date":"2013-12-03","mins":"6:29 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-148333","author":"louis","post":"I mentioned Chiara Vigo and provided a link on another thread yesterday. She fell on her knees the instant she saw the Manoppello veil, and her religious faith should be respected. But now we have science telling us that it may not be byssus, that brush strokes can be seen in some areas and so on. We have to be strictly objective, there is no “Veronica” in the gospels..","date":"2014-09-03","mins":"2:56 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-148294","author":"louis","post":"Piero, I interviewed Fr. Pfeiffer some years ago and obtained some data on the veil, however the overall the impression was that there is a lot more work to be done. As he said, the veil cannot be removed from the frame, it is delicate and can be damaged beyond repair if this done. Your suggestion about a control, as an “attempt to obtain a transparent portrait on byssus”, is correct..","date":"2014-09-03","mins":"11:23 am","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-55236","author":"louis","post":"Cahall, I didn’t say anthropology was not a science, only that science did not interest that ancient civilisation, numbers maybe, and that was because the Indo Aryans were greedy, demanding whatever they could from the lower castes. The outcome was that it lead (and does lead) to a lot of suffering, with Gandhi trying trying to get rid of the caste system and Mother Teresa helping the victims. Only two people were given a Head of State funeral in India despite not being presidents or prime ministers: Mahatma Gandhi and Mother Teresa..","date":"2013-12-02","mins":"6:36 pm","url":"https://shroudstory.com/2013/11/30/it-may-not-suit-the-scientific-mind-set/","cat":"comments_promoted","title":"It may not suit the scientific mind-set"},{"id":"comment-148309","author":"louis","post":"Scientific sources to whom I have had access have raised the question of the textile being linen. I am being open minded because the mystery is still not solved, the main problem being the fact that the veil cannot be removed from the frame..","date":"2014-09-03","mins":"12:36 pm","url":"https://shroudstory.com/2014/09/02/manoppello-shroud-and-durer-a-short-presentation-by-o-k/","cat":"guest_posting","title":"Manoppello, Shroud and Durer:  A Short Presentation by O.K."},{"id":"comment-212137","author":"louis","post":"I think insulting the Church by using the word “simony” only make matters worse. It must not be forgotten that the Oxford scholar who left the blog reminded Christians that they have duties. It must also be remembered that there are, yes, millions of Christians, Protestants, who lead good Christian lives and do not need the Shroud, not part of the deposit of faith in the Catholic Church, or any other relic as a prop for their faith. We will probably all be gone by the time the Church makes a decision. It moves slowly and has its hands tied for a number of reasons..","date":"2015-10-09","mins":"10:15 am","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-212241","author":"louis","post":"Some two non invasive tests will do..","date":"2015-10-10","mins":"1:46 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-103239","author":"louis","post":"Something is wrong here. This is an unjust accusation levelled at Dan and shroudstory. It becomes even more obvious when some Shroud websites and publications are taken into account. Yes, Shroudstory has sometimes reported some controversial papers,but it always followed by the blogmaster’s comments, he is not asking anyone to swallow anything, and that is the difference..","date":"2014-04-24","mins":"10:46 am","url":"https://shroudstory.com/2014/04/24/of-pro-authenticists-and-anti-authenticists/","cat":"other_blogs","title":"Of Pro-Authenticists and Anti-Authenticists"},{"id":"comment-46322","author":"louis","post":"One problem here is that some of the points mentioned in favour of the authenticity of the relic were also reiterated in the conference in Spain and doubts were raised, particularly when it came to “no image under the blood stains”..","date":"2013-10-06","mins":"4:07 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-212247","author":"louis","post":"It is hard to believe that the authentication of the Shroud will change that many minds. It will give hope to those who want to know if there is survival after death, although it will not them if they will go to heaven or hell. As for the rest, we are led to human nature, and, as explained by Jesus: Luke 16:19–31, New International Version: “19“There was a rich man who was dressed in purple and fine linen and lived in luxury every day. 20 At his gate was laid a beggar named Lazarus, covered with sores 21and longing to eat what fell from the rich man’s table. Even the dogs came and licked his sores. 22“The time came when the beggar died and the angels carried him to Abraham’s side. The rich man also died and was buried. 23 In Hades, where he was in torment, he looked up and saw Abraham far away, with Lazarus by his side. 24 So he called to him, ‘Father Abraham, have pity on me and send Lazarus to dip the tip of his finger in water and cool my tongue, because I am in agony in this fire.’ 25“But Abraham replied, ‘Son, remember that in your lifetime you received your good things, while Lazarus received bad things, but now he is comforted here and you are in agony. 26 And besides all this, between us and you a great chasm has been set in place, so that those who want to go from here to you cannot, nor can anyone cross over from there to us.’ 27“He answered, ‘Then I beg you, father, send Lazarus to my family, 28for I have five brothers. Let him warn them, so that they will not also come to this place of torment.’ 29“Abraham replied, ‘They have Moses and the Prophets; let them listen to them.’ 30“‘No, father Abraham,’ he said, ‘but if someone from the dead goes to them, they will repent.’ 31“He said to him, ‘If they do not listen to Moses and the Prophets, they will not be convinced even if someone rises from the dead.’” People tend to be practical in life, sweeping under the carpet what is inconvenient, even in Christian societies: http://www.catholicherald.co.uk/news/2015/10/06/syrian archbishop criticises us for siding with al qaeda/.","date":"2015-10-10","mins":"5:53 pm","url":"https://shroudstory.com/2015/10/09/no-closer-to-the-truth-because-of-simony/","cat":"comments_promoted","title":"No Closer to the Truth Because of Simony"},{"id":"comment-46374","author":"louis","post":"There is no consensus regarding the names and those who claim that the identities are known are merely indulging in guesswork to put forward what is in their private agendas. See “Jesus was not buried in Talpiot, Parts I and II” on the Holy Shroud Guild website. There was plenty of time — till AD 70, when the Tenth Roman Legion commanded by Titus besieged Jerusalem — to expose any Christians who were spreading lies about the Resurrection..","date":"2013-10-07","mins":"10:23 am","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46327","author":"louis","post":"David, the only link I found so far is http://www.shroud.com/pdfs/boiveng.pdf however it is about the use of plants in ancient funerary rituals and very interesting. Someone on this blog raised doubts about the “no image under the blood stains” a few months ago but I don’t remember who it was. There have been suggestions about blood stains that may have been added in the mediaeval period, but, once again, we only see suggestions, papers and so on, many of them rejected by Turin, and no one can say anything about another hands on examination. To start with, the archdiocese could at least release the microphotographs in its possession, as this could stimulate better research, and we would not see people saying things and writing papers over and over again, sounding like broken records..","date":"2013-10-06","mins":"5:13 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46690","author":"louis","post":"There seems to be no difficulty in agreeing with Daveb because Barbet’s study remains a classic in Shroud studies..","date":"2013-10-09","mins":"3:54 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46335","author":"louis","post":"Breaking news: Not altogether off topic because Biblical studies are part of Shroud studies, and the link below has an indirect message for Shroudies: forget the Turin Shroud! http://bibleinterp.com/opeds/2013/10/coh378003.shtml Mme Claude Cohen Matlofsky tells us that the “illegitmate child” Jesus is buried with his “adulterous mother” Mary in the Talpiot tomb. She has not given due attention to two things Rabbi Jacob Neusner has written: 1) “If we can dismiss as unhistorical the Gospel’s Jesus of Christianity what can we of faithful Israel save of our rabbi Moses for Judaism?” 2) Read the 3rd to 6th century rabbinic literature with circumspection (she cites them in the footnotes because of the question of marriage and compares the Hellenistic Jew and turncoat Flavius Josephus to Jesus!) One wonders if she has read at least a few lines of: 3) Freud 4) Toynbee 5) Assmann – that would make her shiver Where did the courage come from? Simcha Jacobovici, of course. Two weeks ago he led poor Father Émile Puech — world renowned epigrapher and co editor in chief of the Dead Sea Scrolls — into a trap with a video taped interview, for which some scholars are waiting for him to apologise. More? He has two replicas of the so called Jonah ossuary, and they are different is some details..","date":"2013-10-06","mins":"8:44 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-46577","author":"louis","post":"At this rate we can only hope the BSTS will continue to have a raison d’etre..","date":"2013-10-08","mins":"10:06 pm","url":"https://shroudstory.com/2013/10/06/one-persons-take-away-from-a-shroud-lecture/","cat":"other_blogs","title":"One Person’s Take Away from a Shroud Lecture"},{"id":"comment-140741","author":"louis","post":"Her approach is amusing and reveals that there are many doubts that have to be cleared, we cannot be hasty in reaching conclusions. There are things that cannot be “seen”, they are just “felt”. Freud himself did a lot of rethinking towards the end of his life, but by then he was a victim of the Jewish holocaust, which made him bitter about the Bible,and he resigned himself to his fate. He had taken a certain direction and that was it. As Frankl said, he confined himself to the basement. Yet, he did write about the occult, “If I were at the beginning rather than at the end of a scientific career I might possibly choose this field of research in spite of all difficulties.” He knew that his work would be judged to be unscientific if he were to take a different direction. The dilemma haunted him throughout his life. As Ernest Jones wrote regarding his position, “An exquisite oscillation between scepticism and credulity so striking that it is possible to question just as many pieces of evidence in support of his doubt concerning occult beliefs as of his adherence to them”. Https://www.academia.edu/5565370/Historians put Freud on the couch It seems that, deep inside, he did suspect that Jung could be correct. Now, this is no justification to dabble in occult, séances, voodoo and the rest. Not even Jung would say this. It is only to say that plagued with doubts as we are, not even the authenticity of the TS will take them away..","date":"2014-07-27","mins":"3:59 pm","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","title":"Penn & Teller’s Hateful Bullshit"},{"id":"comment-140885","author":"louis","post":"N.T. Wright is good, but can be biased, Marcus Borg is indeed moderate, Spong cannot be considered a Christian in the correct sense of the term and Crossan is said to “have faith”. Others have taken different approaches. See: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ Father Fitzmyer has been said to be “liberal”, however that is not true. He is extremely careful when assessing the evidence when it comes to the NT..","date":"2014-07-28","mins":"8:42 am","url":"https://shroudstory.com/2014/07/27/penn-tellers-hateful-bullshit/","cat":"other_blogs","title":"Penn & Teller’s Hateful Bullshit"},{"id":"comment-174917","author":"louis","post":"Actually, as “The New York Times” observed, Benedict XVI referred to the Shroud as an “icon of Holy Saturday”. Why was that so? Did he see no signs of the Resurrection in the relic or was it due to his pessimism? Benedict is a truth seeker, not one to mince words. He goes straight to the point, which is something anyone will notice in his responses to the German journalist Peter Seewald, former editor of “Der Spiegel” and former communist, during the interview that led to the book, published by Ignatius Press in the US. The emeritus pope refused to see any questions in advance and replied to Seewald without hestitation, making the tough journalist abandon communism and atheism and return to the Catholic faith..","date":"2014-12-06","mins":"9:03 am","url":"https://shroudstory.com/2014/12/06/revisiting-shroud-of-turin-and-physics-of-resurrection/","cat":"other_blogs","title":"Revisiting Shroud of Turin and physics of resurrection"},{"id":"comment-174941","author":"louis","post":"Thank you, Hugh. God willing, there is more to come from other quarters in January, after which your comments will be welcome. Whether it is gibberish or not…….","date":"2014-12-06","mins":"10:30 am","url":"https://shroudstory.com/2014/12/06/revisiting-shroud-of-turin-and-physics-of-resurrection/","cat":"other_blogs","title":"Revisiting Shroud of Turin and physics of resurrection"},{"id":"comment-147599","author":"louis","post":"Reminds one of the Hindu sadhus in India. No wonder Jesus is avatar in Hinduism..","date":"2014-08-31","mins":"6:06 pm","url":"https://shroudstory.com/2014/08/31/shroud-4-kids-great-site/","cat":"other_blogs","title":"Shroud 4 Kids: Great Site"},{"id":"comment-174945","author":"louis","post":"“Good Friday – where human understanding ends, Easter where mystery begins”. Pope Emeritus Benedict XVI was the object of an article by Roland Hill in the weekly “The Tablet”, published in England many years ago. He was then Cardinal Joseph Ratzinger, Prefect of the Congregation for the Doctrine of the Faith. The top German intellectual, who taught in universities in his native country for forty years, is, as I wrote, a truth seeker. He did not expect to be Pope, in fact he had asked John Paul II, the pope philosopher, to be released of his duties as prefect to work in the Vatican library. His request was turned down. The “Tablet” article portrayed Benedict as someone who was perplexed by the fact that Jesus was crucified. In other words, Why did God allow that to happen? When he went to Auschwitz, the pontiff asked, “Where was God?”. Whether we want to face it or not, most people in the world suffer, there is both moral AND physical evil, it is part of the “mysterious iniquitatis”, not even Alvan Plantinga has been able to tackle that. C.G. Jung and his closest friend, the American Dominican Father Victor White, based at Blackfriars, Oxford, reached no conclusion. The friendship almost came to an end. There was a thin but very strong thread that linked them and it was not broken. It was extremely strong. What was it? A spiritual bond. The Swiss psychiatrist told the priest, who lay dying, that he was now wearing Job’s shoes. After Father White’s untimely death, Jung thanked a Mother Superior of a Contemplative Order in England for the “spiritual help” she gave him: https://www.academia.edu/7344691/C. G. Jung Father Victor White and privatio boni He understood the problem in the deepest sense. More about this in a review of a book about Jesus that should hopefully be published by February. Easter is no mystery. It was a logical effect. Jesus said, “Heaven and earth shall pass away but my words shall not pass away.” Get the message?.","date":"2014-12-06","mins":"11:07 am","url":"https://shroudstory.com/2014/12/06/revisiting-shroud-of-turin-and-physics-of-resurrection/","cat":"other_blogs","title":"Revisiting Shroud of Turin and physics of resurrection"},{"id":"comment-175121","author":"louis","post":"Dan wisely deleted the thread on the Turin Shroud as proof of the existence of God. It was going in the wrong direction with some strange comments. So I will post here some comments about two intellectual giants, one of whom knew about the existence of the relic, and their belief in God. C.G. Jung kept a copy of the Shroud face in his study, possibly given to him by his closest friend, the American Dominican scholar Father Victor White, based at Blackfriars, Oxford. He did not keep it there because it was what led to his belief in God. On the contrary, he seems to have viewed it as a kind of consequence of the existence of God in some way. When asked whether he believed in God, he replied that he did not have to believe, he knew. Https://www.academia.edu/6823292/What did Jung see in the Shroud Ludwig Wittgenstein may not have have known anything about the Shroud, although he did spend some years meditating in a monastery, Klosterneuberg, in Austria. The Austrian British philosopher was in the words of Bertrand Russell, the most perfect example he had ever known “of genius as traditionally conceived; passionate,intense and dominating.” Wittgenstein felt that his philosophy was leading him nowhere, something was missing. “I cannot help seeing everything from a religious point of view”, he wrote. Was it intuition? Was it something like what Jung sensed? Could be. Psychology (Jung) raises questions that have to be tackled by philosophy (Wittgenstein). How far can philosophy get? Pope John Paul II answered the question in his encyclical “Fides et Ratio” (Faith and Reason”). Heidegger had no room for God in his philosophy, but made arrangements for a Catholic burial before he died. C.G. Jung was given a Protestant burial and Wittgenstein asked his Catholic friends to pray for him before he died: https://www.academia.edu/6085481/Why was Wittgensteins burial attended by a religious ceremony.","date":"2014-12-07","mins":"2:53 pm","url":"https://shroudstory.com/2014/12/06/revisiting-shroud-of-turin-and-physics-of-resurrection/","cat":"other_blogs","title":"Revisiting Shroud of Turin and physics of resurrection"},{"id":"comment-172921","author":"louis","post":"Plain rubbish. One does not need to be a biblical scholar to understand what family relations meant to Jesus. Did he change his mind after the Resurrection? It does not seem so. He appointed Peter as the head of the Church. James, his cousin, to whom he appeared, later became the first bishop of Jerusalem and Judah bar Kyriakos, the last of the twelve Jewish Christian bishops of Jerusalem was a descendant of Jude, also related to Jesus. What we read in the New Testament is the Word being preached, no talk about any burial shroud being carried around as “proof” of the Easter event..","date":"2014-11-25","mins":"6:53 am","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus"},{"id":"comment-172933","author":"louis","post":"It is sad to see people in the realm of Shroud studies clutching at straws in order to authenticate the relic. Are they being different from people in other fields who have other points of view and who also employ similar methods? We have an attempt to find what remained of Jesus (and Mary Magdalene) in Talpiot: https://www.academia.edu/7471223/Jesus was not buried in Talpiot   Part III Before that attempt began, there was another, much bigger one, where Jesus was taken not to Talpiot but to Kashmir: https://www.academia.edu/7893085/The Quest for Jesus in Shroud research The first attempt has been debunked. As for the second one, it is better to excavate the Kashmir tomb and show the world that who is buried there is the Sufi mystic Yuz Asaf. Please, “Shroudies” should show better research..","date":"2014-11-25","mins":"8:14 am","url":"https://shroudstory.com/2014/11/25/st-john-of-the-shroud-priest-servant-of-the-priest-cousin-to-jesus/","cat":"other_blogs","title":"St. John of the Shroud: Priest, Servant of the Priest, Cousin to Jesus"},{"id":"comment-29126","author":"louis","post":"Father Longenecker seems to have got the idea that Jesus was a Nazarite because of the hairstyle. It is doubtful that Jesus would take a vow and even more doubtful that he would take pigeons to the Temple for blood sacrifice..","date":"2013-04-02","mins":"9:03 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-29134","author":"louis","post":"Charles, you mentioned these cloths some months ago. The problem is that it is easier for someone interested in Shroud research, living in Europe, and with time and money, to follow your lead..","date":"2013-04-02","mins":"9:58 am","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-29149","author":"louis","post":"While, in my view, there is more in favour of the Shroud’s authenticity than against it, the lack of “proof” is what leads one to not express opinions in a dogmatic way. As you know, the C 14 test has not been successfully challenged so far and Wilson, whom you mention, was the first one to recognise this in his last Shroud book, which contains a lot of useful information. The Church therefore is not in a position to say anything about authenticity with 100% certainty, as the recent statements by Turin’s archbishop made it clear. That also appears to be the reason why it seems there are people appointed by the Church to trace the provenance of the relic, to “fill the gaps” one could say, so I presume the new avenues you suggested above have not been ignored..","date":"2013-04-02","mins":"2:47 pm","url":"https://shroudstory.com/2013/04/02/ten-questions-for-shroud-skeptics-from-fr-longenecker/","cat":"other_blogs","title":"Ten Questions for Shroud Skeptics from Fr. Longenecker"},{"id":"comment-208685","author":"louis","post":"The discussion on this thread could go on and on, but I will add something in a few lines. David Goulet hás correctly noted that it is not possible to align Allah and Yahveh. The Indonesian govt. Does not want the Christian version of God to be aligned with Allah, for theological reasons. The Turks, on the other hand, kind of forced Benedict XVI to pray at Hagia Sophia to the “same God” for polítical reasons as they want to enter the EU, while silently approving the IS today. The Orthodox Church hás hardly any rights in Turkey, and Christians are safer with Kurds, who helped the Armenians when they were being massacred by the Turks during the genocide. There is something rethinking going on among highly qualified European scholars today. They are working on a more deep version of Christology, going beyond the topic as raised in the book (link “Jesus and Jahveh” above, on this thread).Note that the author says”Jesus did not tell us who he was”..","date":"2015-08-21","mins":"10:47 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"id":"comment-208671","author":"louis","post":"Allah is supposed to have been a genéric name for the deity before the rise of Islam, therefore Indonesian Christians use it and are having problems. It is extremely important to remember that Jesus had his own views on God, Moses and Scripture and that is where the difference lies. I think John has not understood that there is no Christ, just Jesus, in Islam. What exactly did Jesus mean by Father’s house? He also used it with reference to the Temple, when the moneychangers were chased away. Whatever the interpretation is, it will have to be in agreement with the rest of Jesus’ sayings. Needless to say, it hás nothing to do with Islam because there is no room for any Divine Father of Jesus in this religion..","date":"2015-08-21","mins":"7:55 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"id":"comment-208700","author":"louis","post":"Http://www.catholicherald.co.uk/news/2015/08/21/isis destroys ancient syrian monastery/.","date":"2015-08-21","mins":"5:38 pm","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"id":"comment-208625","author":"louis","post":"Hi Nabber and David Both of you are correct, but it is time that we go deeper into the topic and I am working on it now, going further than what was written earlier: See paragraph 3 in: https://www.academia.edu/14260892/Why Harnack and Loisy clashed over the Church and how the question reached literature: https://www.academia.edu/12823419/Book Review Jesus and Yahveh the names divine More will be written as some fine tuning is being done by scholars in Germany and England..","date":"2015-08-20","mins":"10:30 am","url":"https://shroudstory.com/2015/08/20/the-end-if-near/","cat":"other_blogs","title":"The End if Near"},{"id":"comment-149633","author":"louis","post":"We can only speculate about the width..","date":"2014-09-09","mins":"8:02 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149441","author":"louis","post":"Not yet..","date":"2014-09-08","mins":"9:37 am","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149716","author":"louis","post":"Agreed, but it is not proof. The weave is more important..","date":"2014-09-09","mins":"4:05 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149978","author":"louis","post":"Thomas Wesselow was well intentioned when he wrote the book. Being an agnostic he does not accept resurrection and as a Courtauld trained art scholar he did not find the TS image to be a painting. Https://www.academia.edu/4691390/Book review The Sign by Thomas de Wesselow Most Christians and some Jews believe in Jesus’ resurrection. The Israeli scholar and Jewish theologian Pinchas Lapide believed that only an extraordinary event could explain the rise of the Jesus movement..","date":"2014-09-10","mins":"3:51 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-149972","author":"louis","post":"History is one thing, speculation another. There would be no shrine for a defeated,crucified master after all the promises he made, which had turned out to be illusions,nor would there be unrest in the peaceful budding Jesus movement. The movement would cease to exist and the disciples would return to their professions..","date":"2014-09-10","mins":"3:34 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-150022","author":"louis","post":"Textiles are preserved at V&A, London. Some have the herring bone twill pattern, however they are Turkish and Mediaeval..","date":"2014-09-10","mins":"6:21 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-150016","author":"louis","post":"It is doubtful if academics always write gospel truth. In an article entitled “Jesus is ill served by this literary device”, published in the “Daily Telegraph”, well known author A.N. Wilson wrote that he was seduced by Professor Geza Vermes’ book “Jesus the Jew” and became ashamed of the book about Jesus he wrote “under the influence.” He changed direction. I had occasion to interview Professor Vermes, of Oxford, for a leading daily, in connection with the launching of his book on the Dead Sea Scrolls. He was a good man, with a good sense of humour, accused of being “obsessed with Jesus” by a journalist in Israel. I think he was indeed “obsessed with Jesus”, but mixed feelings were involved. He never attended synagogue and preferred to listen to that “small voice” while walking in his garden. It influenced his writings. A good interview, with a now retired academic and Catholic priest, where there is no mixing of Bible studies with theology, where theology and scripture are in different compartments: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ.","date":"2014-09-10","mins":"6:01 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-205389","author":"louis","post":"It does seem that a lot of what was published in Shroud newsletters, infighting, favouritism, personal attacks and so on did not make the realm of Shroud studies interesting to many historians of religion and scientists. There is still time (for this generation of “Shroudies”) to make things more attractive to scholars and scientists. I really do not see the need to bring J.D. Crossan into the picture; as I commented a few days ago, if we are to believe what he thinks,there would be no New Testament for him to misinterpret. I received his book on the “historical Jesus” for review more than a decade ago. We learn more about Mediteranean culture than about Jesus. How could a sophisticated and learned Jesus be a “Mediterranean peasant”, as he wants us to believe? It is known from archaeological research that Jews migrated from Judaea to Lower Galilee after the Hasmoneans took over and they owned the land. Some became tenant farmers. Further, as Father Joseph A. Fitzmyer tell us, we have no access to the ” historical Jesus”, only to the “Jesus of history” and Msgr. J.P. Meier makes it clear that even the “real Jesus” is not accessible to us. No wonder that even the liberal Protestant scholar Helmut Koester felt that Jesus research should be laid to rest for another hundred years. J.D.Crossan was in Jerusalem after the so called Jesus family tomb documentary and accompanying book was launched. Perhaps he went there thinking that he might have been wrong in writing about what happened to Jesus’ body after the crucifixion. Only, he went to the wrong tomb! That was his second mistake. Why? No serious archaeologist or historian, both in and out of Israel, believes that Jesus was not buried in a tomb. Https://www.academia.edu/7471287/Book Review The Tomb of Jesus and His Family Exploring Ancient Jewish Tombs Near Jerusalems Walls.","date":"2015-07-12","mins":"10:43 am","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","title":"The Meaning of Solid"},{"id":"comment-150331","author":"louis","post":"It is the chummies who have caused the most damage to Shroud studies..","date":"2014-09-11","mins":"9:54 pm","url":"https://shroudstory.com/2014/09/08/the-length-and-width-of-it/","cat":"other_blogs","title":"The Length and Width of It"},{"id":"comment-205519","author":"louis","post":"I can answer for myself and my studies and can say nothing about why scientists in general have not taken up the methodology employed by Shroud scientists. All I can say is that Shroud scientists did their job with seriousness and this should pave the way for others to make their own tests. After two decades of writing on biblical archaeology and studies I have noted that controversy is still raging and will not come to an end soon. If Jesus’ resurrection is dismissed as myth or as an event that is beyond the purview of the historian in these circles one can really not expect any interest in a relic that has not yet been authenticated. You will read about the reaction to what we have learnt so far from one historian I had occasion to interview: https://www.academia.edu/12851672/The Historical Jesus The view of Professor Geza Vermes In this controversy about what is fact or myth there also appears to be no lack of manufactured evidence, apparently coming from mythicists. The link below is an old article that was published as soon as the James ossuary reached the front pages, around three months before the IAA said that the second part of the inscription was forged: https://www.academia.edu/13960422/The James Ossuary Much Ado About Nothing.","date":"2015-07-13","mins":"2:22 pm","url":"https://shroudstory.com/2015/07/12/the-meaning-of-solid/","cat":"other_blogs","title":"The Meaning of Solid"},{"id":"comment-38541","author":"louis","post":"Shea is one of the top American Catholic apologists and he rightly mentions Zola… who believed in the wrong people..","date":"2013-07-02","mins":"10:26 pm","url":"https://shroudstory.com/2013/07/02/the-most-obvious-synthesis-of-all-the-evidence/","cat":"news_&_views","title":"The most obvious synthesis of all the evidence"},{"id":"comment-211782","author":"louis","post":"We did not know if what happens in a black hole stays in a black hole. Stephen Hawking believes it could be a passage to other universes and he wouldn’t go in although he likes space flights. Shroudstory com. Is not a black hole because ideas and insights go in and do indeed re appear in the minds of readers, who can make their own contributions and can even become “Shroudies” if they want to..","date":"2015-10-04","mins":"3:25 pm","url":"https://shroudstory.com/2015/10/04/the-sponge-the-great-black-hole-of-the-shroudie-blogosphere/","cat":"other_blogs","title":"The Sponge: The Great Black Hole of the Shroudie Blogosphere"},{"id":"comment-147592","author":"louis","post":"As I wrote around a week ago, Dan, Time will tell..","date":"2014-08-31","mins":"4:42 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-147814","author":"louis","post":"What I am trying to say is that the discussion going on in the blog is ignored by many of the Shroud scientists, whether they have examined the relic or not. Dan pointed this out in a thread around two weeks ago. Now, why is this happening? Is it because the discussion is considered to be nothing more than mere speculation?.","date":"2014-09-01","mins":"1:20 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-147749","author":"louis","post":"Good to see you agreed with my wording, Dan. The discussion on the image is becoming a game of ping pong. It could be OK if it was only that, but it isn’t. The same things are being repeated over and over again. One day or the other someone may find an undeniable link between the TS and the Image of Edessa, fresh carbon dating may tell us something, Shroud conferences may produce new and convincing theories, or some scientist may feel he has made an exact copy of the TS. Time will tell..","date":"2014-09-01","mins":"8:51 am","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-147805","author":"louis","post":"I have noticed that those who have examined the relic ignore what is being said by others who are working on high definition pictures. They seem decided about what it is and what it is not. This is not to say that discussion about high definition pictures should be ruled out, it is necessary, as long as things are not repeated over and over again. Since the relic is no longer available, at least for the time being, for fresh hand on examination, Turin could at least release the almost 2000 microphotographs taken during the restoration it has in its possession. Time will tell,but the sooner the better..","date":"2014-09-01","mins":"12:46 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-147793","author":"louis","post":"Time will tell: it will give us the last word about the TS..","date":"2014-09-01","mins":"12:02 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-147812","author":"louis","post":"Sorry, have a look at what people who have seen the relic have published. I am not saying they are 100% correct, but then it is apparent that they find most of the discussion to be speculation..","date":"2014-09-01","mins":"1:09 pm","url":"https://shroudstory.com/2014/08/30/time-will-tell/","cat":"other_blogs","title":"Time will tell."},{"id":"comment-58894","author":"louis","post":"There are just too many comments being posted regarding IW that sound like loose sayings. A solution can be reached if the comments are more specific..","date":"2013-12-13","mins":"12:40 pm","url":"https://shroudstory.com/2013/12/13/update-at-the-holy-shroud-guild/","cat":"other_blogs","title":"Update at The Holy Shroud Guild"},{"id":"comment-58839","author":"louis","post":"What is the title of your book, Michael?.","date":"2013-12-13","mins":"10:18 am","url":"https://shroudstory.com/2013/12/13/update-at-the-holy-shroud-guild/","cat":"other_blogs","title":"Update at The Holy Shroud Guild"},{"id":"comment-50493","author":"louis","post":"Another clear example of scientism, coming from a physicist who has gone beyond his area of expertise to make tall claims….. And has a lot of homework to do..","date":"2013-11-08","mins":"8:32 pm","url":"https://shroudstory.com/2013/11/07/victor-stenger-the-shroud-of-turin-might-have-contained-genetic-material-with-no-y-chromosomes/","cat":"other_blogs","title":"Victor Stenger:  The Shroud of Turin might have contained genetic material with no Y-chromosomes"},{"id":"comment-59898","author":"louis","post":"John, I have downloaded your piece on the JFK assassination to read later. Something seems to say that there were “right people at the right time”, which is what goes to show that there was a conspiracy. Kennedy came from a Boston Brahmin family, his father Joseph was ambassador to the Court of Saint James, he won a medal for bravery (as ensign,PT109), won a Pulitzer Prize for his book. But he was also Catholic, and that, as you know, was a problem for him, as it was for Al Smith. The fact that he was a statesman, not an ordinary politician, must have irritated many. People can take it for a while, hiding prejudices,but when power is involved and there is prejudice the scene changes. Look at Abraham Lincoln,who was a realist and wanted to free the slaves and keep the nation intact. He knew about prejudices but was not influenced by them. His best General, Ulysses Grant, was. Grant was worried that both Generals Sheridan and Sherman were Catholic….","date":"2013-12-15","mins":"12:38 pm","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!"},{"id":"comment-59875","author":"louis","post":"John, since you have written about the mystery in JFK’s assassination this might interest you: http://www.irishcentral.com/news/Did Irish born William Greer cause JF Ks death 107915254.html.","date":"2013-12-15","mins":"11:20 am","url":"https://shroudstory.com/2013/12/15/well-no-you-cant-call-him-a-catholic-wingnut-wingnut-yes/","cat":"other_blogs","title":"Well, no. You can’t call him a Catholic Wingnut. Wingnut? Yes!"},{"id":"comment-24099","author":"louis","post":"Max, There are three things to be considered if the Shroud is proved to be the genuine article: 1. If the image just shows the dead Jesus what can it tell us that is really important? 2. If it does show the dead Jesus in the process of Resurrection does it answer all our questions? 3. As you know, the Church moves slowly, it is in no hurry, and as you yourself agreed with me not long ago it is the risen Jesus, and not any burial cloth, that led to the birth of Christianity, according to the Gospels. Caravaggio understood this very well and therefore his beautiful two versions of the Supper at Emmaus. It is worthwhile sending a petition to Shroud custodian Archbishop Cesare Nosiglia but the question that arises is if the Church will first create a scientific commission for the purpose of studying the photographs you mention. Meanwhile… looking forward to your paper on the coins over the eyes theory..","date":"2013-02-12","mins":"6:51 pm","url":"https://shroudstory.com/2013/02/11/when-all-else-fails-resort-to-ridicule/","cat":"other_blogs","title":"When all else fails, resort to ridicule"},{"id":"comment-37150","author":"louis","post":"I would hesitate to say that the Bible must be consistent with the Shroud because if something goes wrong those who base their faith on the relic may find themselves lost and become atheists overnight. The reaction could be something like what was described by me in a comment about fundamentalists around a month ago: They seem to say “Everything is true or nothing is true”, kind of believing that the Bible was dropped from heaven in King James English. The instant they find they are wrong the sense of frustration is so strong that they become not only atheists but also anti Christian, as though saying that Marx was right about religion after all. The more famous of these are former fundamentalist pastors. An example? Price, author of the book “Jesus is dead”. There is an interesting document entitled “The Biblical Commission’s Instruction on the Historical Truth of the Gospels”, Woodstock College Theological Studies, 1964, by Father Joseph A. Fitzmyer, SJ who needs no introduction given that he is known as the “scholar’s scholar” in the US. He co authored the “Jerome Biblical Commentary” together with Fathers Raymond Brown and Roland Murphy, was a member of the Pontifical Biblical Commission, finished his doctorate under William F. Albright (Johns Hopkins), taught Aramaic and Hebrew at Chicago Univ., Biblical Studies at Oxford, worked with Qumran excavator Father Roland de Vaux while sorting out the Dead Sea Scrolls in 1956, was awarded a gold medal by the British Academy…. Fitzmyer has said that Jesus of Nazareth walked the roads of Palestine, he only became Christ after the Resurrection. The centrality of the event for Christian faith need hardly be mentioned, but to hook that on to what is seen on the Shroud would not seem advisable..","date":"2013-06-16","mins":"9:53 am","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","title":"Which Came First, the Gospels or the Shroud?"},{"id":"comment-37153","author":"louis","post":"Further to the above, Pope Francis I has announced that he will be issuing what he called a ‘strong document’, the encyclical on faith begun by Benedict XVI and finished by him. Most of the writing was done by Benedict. The Bavarian pontiff has always been known as a scholar who spent his whole lifetime working on theology based on biblical studies and as someone who speaks his mind. In the view of Peter Seewald, former editor of ‘Der Spiegel’, his countryman is a ‘spiritual master who can give answers’. Seewald gave up being a communist and atheist and returned to Catholicism after interviewing Benedict, putting forth forthright questions and after being told by the pontiff not to show the questions in advance..","date":"2013-06-16","mins":"11:56 am","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","title":"Which Came First, the Gospels or the Shroud?"},{"id":"comment-37209","author":"louis","post":"It is difficult to see how an ex priest like Crossan who believes that Jesus’ dead body was eaten by wild dogs can be a Catholic..","date":"2013-06-17","mins":"10:27 am","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","title":"Which Came First, the Gospels or the Shroud?"},{"id":"comment-73687","author":"louis","post":"Wilson’s starting point is that no one other than Jesus is known to have left his likeness on cloth and it is from there that he develops his theory. He has never been dogmatic and has said more than once that a lot more research is needed, therefore the need to read all the books he has published on the topic, not forgetting “Holy Faces, Secret Places”, which is about other images that could be related to the Shroud. We must not forget the mosaic discovered not long ago in Turkey and, yes, there is another gap to fill after 1204, where the Templar connection can help and hopefully some more evidence will surface soon. I have published two interviews with Wilson, one a full page interview article in a major daily and a third one, stored in a drawer, is yet to be published. We did have extremely frank discussions, and agreed about everything, which is what prompted me to place a lot of hope in his work. But, unfortunately, there have been problems in Shroud research. In my view, it is wrong to concentrate on making the Shroud known as much as possible, occasionally publishing rubbish in the process. As I said more than once, crucial research inside churches has come to a standstill because the left hand does not know what the right hand is doing in the realm of Shroud studies, particularly in websites and publications, where generally only chummies have had doors opened to them. Of course, it is part of Shroud politics, it is a sort of closed circle, and is that conducive to progress? That apparently is the reason why people blowing their tops with articles criticising the attitudes of prelates on websites, petitions to the Pope and so on have been ignored. The clerics in Turin and Rome are not blindfolded, they do know what is going on..","date":"2014-01-19","mins":"10:57 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-37178","author":"louis","post":"One must add that Zias is a good archaeologist and anthropologist — and judged the Shroud to be a “bad forgery”..","date":"2013-06-16","mins":"7:35 pm","url":"https://shroudstory.com/2013/06/16/which-came-first-the-gospels-or-the-shroud/","cat":"other_blogs","title":"Which Came First, the Gospels or the Shroud?"},{"id":"comment-73688","author":"louis","post":"See # 11.","date":"2014-01-19","mins":"10:59 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73731","author":"louis","post":"There is a lot of text, so how about an illustration? http://www.banknote.ws/COLLECTION/countries/ASI/ARM/ARM0054.htm.","date":"2014-01-19","mins":"3:19 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73717","author":"louis","post":"Thanks, Charles. I understand what you mean, so here we go, trying to fill the gaps….","date":"2014-01-19","mins":"1:27 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73604","author":"louis","post":"Wilson did his best and has been honest in admitting that there are difficulties along his route,he is not fooling anybody, and I would go further and say that he is the best scholar to weigh the evidence in the realm of Shroud studies. There has been a lot of destruction in history and in this case it began in Edessa (Urfa today). It is possible that doors may have been opened in the Church for further research if the right hand had known what the left hand was doing in Shroud websites and publications. As commented earlier, a change in direction is needed..","date":"2014-01-18","mins":"2:28 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73690","author":"louis","post":"#11 was addressed to Charles Freeman..","date":"2014-01-19","mins":"11:00 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73833","author":"louis","post":"Abgar is part of the Orthodox Church’s liturgy..","date":"2014-01-20","mins":"2:06 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73838","author":"louis","post":"That’s correct..","date":"2014-01-20","mins":"2:36 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73617","author":"louis","post":"It goes without saying that Wilson’s Mandylion/Image of Edessa/Shroud theory overrides the gaps. Without that there would be no Shroud websites, no Shroud books, no Shroud conferences, no Shroud papers,no Shroud blogs..","date":"2014-01-18","mins":"5:42 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73865","author":"louis","post":"Ian Wilson is unnecessarily becoming the object of ridicule in this thread and, in fact, much of what he said in his book(s) is being repeated in the blog as though it is the commenter’s own research. As commented earlier, If it were not for him, there would be no shroud websites,books, papers, conferences, congresses and…. This shroudstory blog. Rome is aware of the gaps and the controversy and there is a commission to check the provenance..","date":"2014-01-20","mins":"5:27 pm","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-73944","author":"louis","post":"David: If I understood you correctly then, yes, the essential message is at the core. Books by academics always have to be given preference, however I have noted that, at least in the area of philosophy, there are academics who make things more confusing and the original sources, that is, the philosophers themselves, are more clear. Worse, sometimes academics like to distort the truth, guided by emotion and prejudice. In my view that has been the case with Walter Kauffman, of Princeton, when it came to Nietzsche. He also had to defend Freud by attacking Adler and Jung, ignoring the fact that while there may have been some contradictions in what Jung wrote many of the Freud files are still not available for scrutiny and these would help in clarifying the many doubts in the battle that is raging in the realm of studies in the field of psychoanalysis..","date":"2014-01-21","mins":"10:50 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-196250","author":"louis","post":"The Virgin Birth has nothing to do with Christian fundamentalism, as the author seems to imply. Biblical scholars says that it was a firm belief before AD 70, and,as a matter of fact, the oral tradition appears have to have been so strong that it reached Islam, where Mary is mentioned 33 times. The Virgin Birth would be not only outside the laws of physics but also outside the laws of biology. The funny side of the story is that sometimes some conservative scholars become liberal and liberals become conservative when it comes to certain issues. Some insist, for instance, that there was a “regula fidei” before Iranaeus, before the Church Fathers began to write. Another source of controversy is “Kyrios” in Greek, “Mare'” in Aramaic, that, is “Lord”. It is used of Yahveh in11 Qtg Job24,6 7. As it is used in the NT, was it applied to the pre or post Easter Jesus? For more: https://www.academia.edu/4700001/What do we know about the Bible An interview with Joseph A. Fitzmyer SJ.","date":"2015-04-13","mins":"4:04 pm","url":"https://shroudstory.com/2015/04/13/with-anyone-interested-in-listening/","cat":"other_blogs","title":"With Anyone Interested in Listening"},{"id":"comment-73939","author":"louis","post":"Charles, I got this tip from a Shroud website and it is not surprising. The Church is very careful and very slow when it comes to many matters and relics are secondary, they will not help tackle other, more urgent, issues that have arisen lately. I dislike having to sound like a broken record, however I must insist that prospects for better relations between the realm of Shroud studies and Turin are and will continue to be bleak. You can write down what I am saying. Just read what has been posted on Shroud websites and published in Shroud publications and you will understand why. I think Wilson did his best with the sources at his disposal and at least he was the first scholar to establish a link between history, in the form of traditions, legends, some ancient sources, recording Jesus having left his likeness on cloth and the Turin Shroud. At least some of his contentions could have been been verified with help from Rome and if this did not take concrete shape it has been largely due, again, to what has gone on in the realm of Shroud studies. I have to say it again: the clerics in Rome and Turin are not blindfolded..","date":"2014-01-21","mins":"10:34 am","url":"https://shroudstory.com/2014/01/18/wilson-shroudies-vs-academia-another-guest-posting-by-o-k/","cat":"guest_posting","title":"Wilson & Shroudies vs Academia:  Another Guest Posting by O.K."},{"id":"comment-196224","author":"louis","post":"Escaping scientism?: http://christiannews.net/2015/04/13/new museum to present overwhelming evidence for creation/.","date":"2015-04-13","mins":"10:24 am","url":"https://shroudstory.com/2015/04/13/with-anyone-interested-in-listening/","cat":"other_blogs","title":"With Anyone Interested in Listening"},{"id":"comment-198802","author":"louis","post":"Sampath, Kaisa hai, hamara dost? – I think you will understand. Rogers was a good scientist, however he has almost been deified, the result being a cult like devotion to his views. It leads to a world of make believe, with irrational conclusions. It is nice to see that you at least understood. You may remember that I mentioned the Maillard hypothesis in question no. 11: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin Now we must ask what were the “biological products”. Best..","date":"2015-05-10","mins":"5:23 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","title":"Yannick Clément on Colin Berry’s Latest Hypothesis"},{"id":"comment-198791","author":"louis","post":"Alchemy was succeeded by Chemistry, just as Spiritualism was succeeded by Parapsychology..","date":"2015-05-10","mins":"2:17 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","title":"Yannick Clément on Colin Berry’s Latest Hypothesis"},{"id":"comment-198785","author":"louis","post":"Yesterday I told Colin to consider Dr. Paolo Di Lazzaro’s inteview because all characteristics would have to be taken into account. He had said that he was “quietly confident” that he would be successful, but I have my doubts. As for the post above, it puts forward some rubbish: “We also have to assume that this forger took the dead body out of the shroud before it started to corrupt in such a way that this extraction did not disturb the bloodstains, never broke the linen fibrils under them and did not disturb the body image.” It does not seem that people reading what is posted here are fools. Then we are led to to the Rogers mantra, where: ” to produce a Shroud like image with the use of biological products that could have been released inside the Shroud shortly after death by a highly traumatized human corpse” First it was the Maillard effect, now it is “biological products”. I have said it before and say it again: Flogging was a legal preliminary to every Roman crucifixion and thousands of Jews were crucified like Jesus. Assuming that the relic is authentic, why should it only have happened to his body?.","date":"2015-05-10","mins":"12:58 pm","url":"https://shroudstory.com/2015/05/10/yannick-clment-on-colin-berrys-latest-hypothesis/","cat":"guest_posting","title":"Yannick Clément on Colin Berry’s Latest Hypothesis"},{"id":"comment-33472","author":"louis","post":"Hullo Angel No, the pigeons taken by Jesus’ mother to the Temple was a common Jewish practice and had nothing to do with Essene belief. Father Roland de Vaux, who excavated Qumran, found a cemetery for animals, where the flesh was completely removed from the bones before burial. This is still a mystery to be solved. Did the Essenes reject blood sacrifice? It is possible that they did not offer blood sacrifices at the Temple because this magnificent building was rejected by them — and it was in the hands of the Sadducees, the “Saduquim”, with whom they had serious differences. They had a different idea about what the Temple would have to be like, and, who knows, would offer blood sacrifices if they had their way. After all, they thought that they, and not the Sadducees, were the legitimate priests. Also to be remembered is that the prophets rejected these sacrifices:”I will have mercy and not sacrifice.” It is also possible that the Essenes had what is called “kapparot” blood sacrifice rituals, in their communities, but there is no proof. They also seem to have been influenced by beliefs in ancient Iran, learnt by the Israelites in general after the Babylonian Captivity, although their dualism was subordinate to Jewish monotheism. Syncretism was common even then and the Sadducees demonstrated Greek influence. How is it that that there is no mention of the Essenes in the New Testament? Did Jesus know about the Essenes? Yes. How could he NOT have known about them? It has been pointed out that he referred to them as Herodians. Herod favoured them, and they did not have to make an oath of loyalty to him. They were influenced by a military manual, Herod’s manual, which, in turn, was influenced by a Roman military manual. They were preparing for the “final war” between the “Sons of light” (Essenes) and the “Sons of darkness” (The “kittim”, that is, the Romans, and possibly Jews belonging to other groups). This is clearly Iranian influence. The Bible absorbed many of the beliefs in Near Eastern cultures. We can see five different traditions – JEDP, that is Jahvist, Elohist, Deuteronomist and Priestly — making their points in the composition of the the Pentateuch, the first five books of the Bible. To understand what Jesus thought about all this you must first understand why he hovers in the New Testament. That is the key to unlock the mystery. All the best..","date":"2013-05-10","mins":"10:14 pm","url":"https://shroudstory.com/2013/05/06/the-shroud-of-turin-a-bit-scary-for-atheists/","cat":"news_&_views","title":"The Shroud of Turin:  A bit scary for Atheists?"},{"id":"comment-65988","author":"louis","post":"There appears to be have been no sign of humility, on the contrary “1260 1390!” was scribbled over the blackboard behind Hall, Tite and Hedges, who made the announcement at the British Museum. Dr. Michael Tite, however, did attend the Round Table convened by Cardinal Severino Poletto in Turin and Professor Christopher Ramsey has kept an open mind, although he believes there was no error in the 1988 C14 test..","date":"2013-12-23","mins":"6:00 pm","url":"https://shroudstory.com/2013/12/22/building-a-house-on-argumentum-ad-ignorantiam/","cat":"comments_promoted","title":"Building A House on .Argumentum ad Ignorantiam"}]
