[{"id":"comment-210279","author":"louis","post":"“We must not be hasty too hasty to dismiss it altogether”. Naturally, although Professor Danin seems to have changed his mind. However, in the following interview.it is said that that the dusts vacuumed from the relic confirm the data obtained by Max Frei Sulzer, supported by fragments of pollen grains detected on the relic. We may expect a paper on this in the future: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies.","date":"2015-09-13","mins":"8:43 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210462","author":"louis","post":"Where is this information derived from?.","date":"2015-09-15","mins":"11:24 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210447","author":"louis","post":"The latest information we have is that Professor Avinoam Danin now seems to agree with Professor T. Litt and that should put an end to the discussion about Gundelia tournefortii. Another reason is that Uri Baruch did not examine the grains in the way that he should have done. He did not even wash them before examination..","date":"2015-09-15","mins":"9:30 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210459","author":"louis","post":"Correct, Hugh. I was relying on what Professor Danin told me, which was published in an article entitled “Shroud Studies bring Good News”, which had more to do with Dr. Barbara Frale’s finding of the Chinon Parchment and the possible Templar Turin Shroud connection. I do not know what kind of lens Uri Baruch used, but I presume that he had better equipment than Professor Litt because Professor Danin told me that he would have to use better equipment, not the confocal lens he was using. Well, from what I can judge, both Uri Baruch and Professor Litt did not wash the grains before examination, however Professor Danin felt that the former’s work was reliable because of the lens he was using. For some reason or the other Professor Danin has changed his mind and that is why I wrote the previous comment..","date":"2015-09-15","mins":"10:45 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-210478","author":"louis","post":"Thanks for the information, Gian Marco. Being a palynologist one could presume that Uri Baruch used sophisticated equipment, or at least that was the impression I got from what I heard. I do not know why Professor Danin changed his mind. In the interview below you will read about some confirmation about Max Frei Sulzer’s findings. One must wait to see what will come of this: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies.","date":"2015-09-15","mins":"3:14 pm","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-211965","author":"louis","post":"This is actually an old demand, as you can read in the article, published in 2003: https://www.academia.edu/16338005/Shroud Studies bring Good News   February 2003 Professor Avinoam Danin no longer supports what remains of the Frei collection, the remaining part of which is in private hands, unavailable for examination. What was obtained in 2002 also remains unavailable for research..","date":"2015-10-07","mins":"7:56 am","url":"https://shroudstory.com/2015/09/13/doubting-the-pollen-evidence/","cat":"science","title":"Doubting the Pollen Evidence"},{"id":"comment-214266","author":"louis","post":"Professor A. Danin’s papers appear in Gérard Lucotte’s references, however it does not mean anything today because the professor changed his mind about Max Frei’s collection recently, athough he stands by the flower and plant images he said he identified on the Shroud. In 2003 he wanted Turin to allow the taking of fresh samples from the relic, but apparently his request fell on deaf ears. See the last paragraph: https://www.academia.edu/16338005/Shroud Studies bring Good News   February 2003.","date":"2015-11-05","mins":"3:38 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"id":"comment-214301","author":"louis","post":"One must add that the pollen grains require more examination. Professor Giulio Fanti, at the University of Padua, whose work on the DNA found its way into the recent paper published in “Nature” said that the pollen fragments from the Shroud examined by him matched the results obtained by Max Frei Sulzer: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies.","date":"2015-11-06","mins":"12:09 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"id":"comment-214326","author":"louis","post":"For some reason or the other, Professor Danin no longer considers what he wrote about the pollens valid. Well, who did the examination was Uri Baruch, but then he left the field of palynology to go into computer sciences. Professor Danin does however maintain that he has identified flower and thorn images on the Shroud. He was wanting Turin to provide more grains, and that was back in 2003. See the last paragraph: https://www.academia.edu/16338005/Shroud Studies bring Good News   February 2003.","date":"2015-11-06","mins":"4:12 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"id":"comment-214323","author":"louis","post":"Have you read the response to the question about pollen grains in the link provided above? It mentions them as well as Max Frei Sulzer. It must be remembered that Professor Fanti was working on pollen dust and fragments, not on grains that were found intact. Some of his results did match the ones obtained by the Swiss criminologist. Yet, his study remains incomplete and is the reason for my previous comment. It would help if what remains of Frei Sulzer’s collection in Durham, NC is made available for examination..","date":"2015-11-06","mins":"4:04 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"id":"comment-214329","author":"louis","post":"There is nothing to apologise for, Hugh. You are right about the confusion that can be caused when things are stated differently in two different publications. I even pointed out to Professor Fanti that what he stated in “La Sindone: Primo secolo dopo Christo!” was partially changed in a paper he authored later. I think he faces the same problem all Shroud scientists face: no access to the relic, even for a non invasive examination. So they have to work on the data they have. Regarding that podcast with Dr. Alan Whanger, did you ask him about the pollen grains in his collection?.","date":"2015-11-06","mins":"5:34 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"id":"comment-214332","author":"louis","post":"Dr. Alan sent me his book — which even Mother Teresa appreciated — and I read and reviewed it, but it is not online. The information obtained from the newsletters he sent also helped. All this was years ago. Ian Wilson took exception to many of the things that Dr. Alan said he identified on the Shroud and published his views in the BSTS newsletters. It seems that that was the beginning of the controversy. Professor Danin also kindly provided me with all the information I needed, however I think the Church has not appreciated his efforts sufficiently, which is what I judged after reading his book “Botany of the Shroud”, which has beautiful illustrations. As a botanist Prof. Danin is certain that he does see images of flowers and thorns on the Shroud, in fact he showed some of what he saw to Cardinal Severino Poletto during the special showing of the relic at the end of the Round Table held in Turin. As I said, the palynologist was Uri Baruch, who left the field. I think we have to start from scratch, and will depend on Turin to provide new grains and an examination of what is left of Max Frei Sulzer’s collection in the possession of Dr. Whanger..","date":"2015-11-06","mins":"7:03 pm","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"},{"id":"comment-214287","author":"louis","post":"I had my doubts about peer review because I saw that at times what was published in a peer reviewed journal was dismissed later on by a paper in a similar journal. So one can imagine what happens when there is no peer review. Dr. Paolo Di Lazzaro explained the whole process in detail in the response to question no.9: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin.","date":"2015-11-06","mins":"6:40 am","url":"https://shroudstory.com/2015/11/05/paper-chase-new-paper-on-sem-analysis-of-pollen/","cat":"paper_chase","title":"Paper Chase:  New Paper on SEM Analysis of Pollen"}]
