[{"id":"comment-150330","author":"louis","post":"Tossed aside like a dirty rag? The author did not study the topic nor read the NT as he should have. It was a Jewish burial. If the Sudarium of Oviedo is authentic, it may have been the “cloth which was folded” and kept aside, not tossed aside, in the tomb. It had served its purpose, it was not necessary for wrapping the body, but it was folded and kept aside because it contained blood and there were Jewish laws and customs..","date":"2014-09-11","mins":"9:48 pm","url":"https://shroudstory.com/2014/09/11/article-on-the-sudarium-of-oviedo/","cat":"article","title":"Article on the Sudarium of Oviedo"},{"id":"comment-191140","author":"louis","post":"As I commented more than once, a comparison will have to be made with the material taken from the Shroud during the restoration with what is in Dr. Alan Whanger’s possession. If this is done then we will have real news..","date":"2015-02-15","mins":"5:11 pm","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-191151","author":"louis","post":"The Church is slow to move, and from information I have received, with no permission to reveal the contents, even a request to study another relic that could help in Shroud research — an important link in my view — has been ignored. It has nothing to do with the relics mentioned in Ian Wilson’s study, “Holy Faces, Secret Places”. Since you are tuned, you will soon see online a dismissal of an important claim made in the realm of Shroud studies — without the need for the microphotographs. Dr. Alan Whanger, a Methodist, is respected in Turin, in fact he was one of the scholars invited to the Round Table in Turin by Cardinal Severino Poletto. One can hope that the cooperation requested by Benedict XVI, read out by Bishop Kevin Vann at a Shroud conference in Dallas, will bring more results. Well, Archbishop Cesare Nosiglia was not among the twenty to receive the cardinal’s hat from Pope Francis this week. When this happens perhaps he will be more bold and we will see developments..","date":"2015-02-15","mins":"6:50 pm","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-191184","author":"louis","post":"Some progress was made in pollen studies. The following was the first step in a different study and should be refined as more research is undertaken: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies.","date":"2015-02-16","mins":"7:37 am","url":"https://shroudstory.com/2015/02/15/important-new-pollen-discovery-on-the-sudarium-of-oviedo/","cat":"press_coverage","title":"Important New Pollen Discovery on the Sudarium of Oviedo?"},{"id":"comment-207771","author":"louis","post":"Sampath, have you read enough? The suggestion first came from Dr. Kelly Kearse, a professional in the field. Best. Https://www.academia.edu/11804110/Is the Sudarium of Oviedo the key to unraveling the mystery of the Shroud of Turin.","date":"2015-08-08","mins":"4:16 pm","url":"https://shroudstory.com/2015/08/02/interview-with-mark-guscin/","cat":"sudarium","title":"Interview with Mark Guscin"},{"id":"comment-195512","author":"louis","post":"Yes, this is mentioned in the article. It must also be pointed out that the main stains on the Sudarium were placed on the Shroud face in relief..","date":"2015-04-06","mins":"1:20 pm","url":"https://shroudstory.com/2015/04/06/new-paper-on-the-sudarium-of-oviedo/","cat":"sudarium","title":"New Paper on the Sudarium of Oviedo"},{"id":"comment-195724","author":"louis","post":"Some more on the Sudarium, from Professor Avinoam Danin, some years ago in “The New York Times”: http://www.turin shroud.com/jps/pollen.htm.","date":"2015-04-08","mins":"8:14 am","url":"https://shroudstory.com/2015/04/06/new-paper-on-the-sudarium-of-oviedo/","cat":"sudarium","title":"New Paper on the Sudarium of Oviedo"},{"id":"comment-195767","author":"louis","post":"Hello Sampath Thank you for the remarks. Much will depend on further research, and if hands on examination will be permitted in the future. In the case of the Sudarium, we do have details about the radiocarbon dating, so it is not to be taken very seriously and, as you know, the 1988 dating of the Shroud is controversial, there are just too many doubts for one to be sure about the results. The Shroud is not an article of faith in the Catholic Church, but many Catholics and Orthodox Christians venerate relics, not Protestants. Yet, the Shroud is an ecumenical topic and can help bring Christians together..","date":"2015-04-08","mins":"5:09 pm","url":"https://shroudstory.com/2015/04/06/new-paper-on-the-sudarium-of-oviedo/","cat":"sudarium","title":"New Paper on the Sudarium of Oviedo"},{"id":"comment-195768","author":"louis","post":"Sorry, I meant “we do not have details” about the radiocarbon dating of the Sudarium. The icon and other materials are Orthodox Church relics..","date":"2015-04-08","mins":"5:14 pm","url":"https://shroudstory.com/2015/04/06/new-paper-on-the-sudarium-of-oviedo/","cat":"sudarium","title":"New Paper on the Sudarium of Oviedo"},{"id":"comment-195639","author":"louis","post":"Directed to Antero de Frias Moreira, in Lisbon: Boa tarde, Antero Agradeço sua mensagem e encorajamento. Também vejo que você faz a sua parte do trabalho. Sobre a datação da relíquia, sei que a Camara Santa explodiu em 1934, causando danos, e também cheguei a pensar que esse acontecimento poderia ser uma das causas dos resultados em 1983. Translation: Thank you for your message and encouragement. I also see that you do your part of the job. Regarding the dating of the relic, I know that the Camara Santa exploded in 1934, and also thought that this happening may have been one of the causes of the 1983 results..","date":"2015-04-07","mins":"2:27 pm","url":"https://shroudstory.com/2015/04/06/new-paper-on-the-sudarium-of-oviedo/","cat":"sudarium","title":"New Paper on the Sudarium of Oviedo"},{"id":"comment-31666","author":"louis","post":"More work on the Sudarium is needed..","date":"2013-04-23","mins":"4:34 pm","url":"https://shroudstory.com/2013/04/23/new-video-on-the-sudarium-of-oveido/","cat":"news_&_views","title":"New Video on the Sudarium of Oveido"},{"id":"comment-31668","author":"louis","post":"Things like this move very slowly in the Church..","date":"2013-04-23","mins":"4:43 pm","url":"https://shroudstory.com/2013/04/23/new-video-on-the-sudarium-of-oveido/","cat":"news_&_views","title":"New Video on the Sudarium of Oveido"},{"id":"comment-198204","author":"louis","post":"Thanks for posting this, Dan. It is nice to see that you are doing your part of the job and one hopes that some scientists at your end will join hands with the Spaniards and step on the accelerator. Dr. Juan Manuel Miñarro López, Professor of Sculpture at the University of Seville, Spain has published a convincing monograph and the 3 D image he created can be seen in the link below: https://www.academia.edu/11804110/Is the Sudarium of Oviedo the key to unraveling the mystery of the Shroud of Turin Pope Francis is latino and his native language is Spanish, the right hombre in Rome to get things done. If any petition is sent to him it will have to include both Shroud and Sudarium..","date":"2015-05-03","mins":"6:43 am","url":"https://shroudstory.com/2015/05/03/shroud-and-sudarium-blood-agreement/","cat":"2015","title":"Shroud and Sudarium Blood Agreement"},{"id":"comment-198211","author":"louis","post":"Kelly Kearse, Ph.D is a very serious and honest “Shroudie” and that is why I cited him in the above article. He has asked important questions and I think I have the key to one, important secret. Confirmation can come when we have more details, but how is that possible if there is said to be no methodology nor equipment, as mentioned in the article?.","date":"2015-05-03","mins":"10:52 am","url":"https://shroudstory.com/2015/05/03/shroud-and-sudarium-blood-agreement/","cat":"2015","title":"Shroud and Sudarium Blood Agreement"},{"id":"comment-190790","author":"louis","post":"More work and cooperation between Shroud groups is needed to do the job correctly..","date":"2015-02-12","mins":"5:24 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190866","author":"louis","post":"Some useful research has been done, however more is needed..","date":"2015-02-12","mins":"5:02 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-190873","author":"louis","post":"There is one big problem in Shroud studies. It is people blowing their tops when flaws are detected in their research. How far will that get us?.","date":"2015-02-12","mins":"6:05 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-191351","author":"louis","post":"Hold on, there will be more about the topic shortly..","date":"2015-02-18","mins":"5:59 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-191449","author":"louis","post":"The responses to questions 9 and 10 in the following interview are optimistic when it comes to Turin Shroud DNA, both plant and human. Of course, the pro authenticity stand is not a result of this, the optimism lies in refining the finds.: https://www.academia.edu/8841978/Professor Giulio Fanti discusses the controversies in the realm of Shroud studies My doubt lies in what Professor Frank Tipler, a Jewish convert to (conservative) Catholicism has said, found in the last line of response 10. He has gone further and is said to be a brilliant scientist, however his books sparked controversy in scientific circles..","date":"2015-02-20","mins":"6:43 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-191501","author":"louis","post":"Kelly, thanks for the explanation. It now makes sense why Professor Tipler’s contention did not receive wide attention..","date":"2015-02-21","mins":"1:38 pm","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-215439","author":"louis","post":"Dan cited my paper above, Hugh’s question is valid and I can answer for myself. We do not know when exactly rigor mortis set in, since this process takes about two hours to start and goes on till there is complete postmortem stiffness. It is clear that the man who used the cloth to cover Jesus’ face was concerned with restraining the blood coming from the nose and the right hand side of the mouth (see the larger illustrations in the paper, particularly the face image). He may therefore not have thought it necessary to wrap the cloth around the head. What he may have done was to fold the cloth so that it would become more thick and thus more pressure could be applied. It would be more effective. It is a possibility. There is no general agreement about how the cloth was used on the face, not even in Spain. The pathologist and coroner I mentioned has limited information. Whatever, it is evident that this does not affect the perfect model produced by the professor of sculpture..","date":"2015-12-01","mins":"1:35 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-191486","author":"louis","post":"Although it is not explicitly stated in the interview the implication was that what Professor Frank Tipler stated could confirm the Virgin birth. Well, Professor Tipler was strongly influenced by Wolfhart Pannenberg, which paved the way for his conversion to Christianity, specifically Catholicism. The emphasis was on the Resurrection of Christ and history as a form of Revelation — which is also what led Heidegger back to Catholicism! — and importance was laid on ancient apolcalyptic texts, both Jewish and Christian. It was the latter that generated criticism. I have not read what exactly Professor Tipler wrote, however my doubt arises because he is a physicist, well versed in theology. Would his interpretation of the DNA be correct?.","date":"2015-02-21","mins":"10:05 am","url":"https://shroudstory.com/2015/02/12/the-sudarium-of-oviedo-as-evidence/","cat":"sudarium","title":"The Sudarium of Oviedo as Evidence?"},{"id":"comment-195716","author":"louis","post":"Antero, bom dia, peço desculpas, pensava que morava em Lisboa. Translation: Good morning, Antero, sorry, I thought you lived in Lisbon..","date":"2015-04-08","mins":"7:18 am","url":"https://shroudstory.com/2015/04/06/new-paper-on-the-sudarium-of-oviedo/","cat":"sudarium","title":"New Paper on the Sudarium of Oviedo"},{"id":"comment-215544","author":"louis","post":"It is incorrect to say it is unlikely that three radiocarbon labs committed the same error. They were using parts of the same sample. Professor Pier Luigi Baima Bollone commented on the dating of the Sudarium, and this can be read in paragraph 2: https://www.academia.edu/11804110/Is the Sudarium of Oviedo the key to unraveling the mystery of the Shroud of Turin Contamination is a big problem when it comes to objects that are subjected to C14,.","date":"2015-12-03","mins":"8:43 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215724","author":"louis","post":"The impression one gets is that Turin does not take seriously any of the proposals presented to explain why the 1988 radiocarbon dating results may have been skewed. That is in fact sort of echoed in Ian Wilson’s last Shroud book. We now know that Turin has brushed aside the proposals and the attention is focused on radiocarbon dating but, even then, they are hesitant to go forward. The reason can be read in the last q/r: https://www.academia.edu/11355553/Dr. Paolo Di Lazzaro explains his research on image formation on the Shroud of Turin With the recent Vatileaks scandals one notices that there is no lack of traitors, clerics included. Now, when it comes to dating ancient textiles, although the Masada excavation is still the object of controversy despite the good intentions of Y. Yadin, we at least know that the cloths found there were dated to AD 70. For more, the cloths used to wrap the Dead Sea Scrolls were also correctly dated. Note: By Willard Libby himself, around 1950. The results he obtained matched the studies made by Father Roland de Vaux. Who excavated Qumran and was the first editor in chief of the Dead Sea Srolls. Radiocarbon dating is an important tool in deciding chronology in biblical archaeology and micro archaeology will not change the picture. It is used together with C14: https://www.academia.edu/18994343/The key role of Biblical Archaeology in Exegesis An Interview with Professor Israel Finkelstein That is why the questions in the thread “SSG member wants to know” are important. They may be one among other leads..","date":"2015-12-06","mins":"10:28 am","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"},{"id":"comment-215638","author":"louis","post":"Addressed to Jim Carney: Hi Not all “Shroudies” believe in the Resurrection, much less in miracles. You may have noticed that not many Catholics who go to church think in traditional terms. That is because they have learnt about developments in science, which seem to clash with what the Bible tells us. I have seen people giving up their faith overnight. There were attempts to get rid of the idea of Jesus’ resurrection: https://www.academia.edu/7471223/Jesus was not buried in Talpiot   Part III which were not taken seriously as they did not involve archaeologists but those in the film/documentary making indutsry.. That much for New Testament archaeology, on which work is still being done. When it comes to Old Testament archaeology and the Bible things become worse: https://www.academia.edu/18994343/The key role of Biblical Archaeology in Exegesis An Interview with Professor Israel Finkelstein As one who has also written on the science theology dialogue, my guess is that we can go beyond physics and biology and cut the story short by deriving lessons from what we know about the findings in biblical archaeology. It is the only that way that systematic theologians can take the right direction. Right now many of them are so lost that hey keep on making vague assertions, confusing people even more..","date":"2015-12-04","mins":"1:40 pm","url":"https://shroudstory.com/2015/11/30/the-sudarium-a-better-provenance-and-history/","cat":"history","title":"The Sudarium:  A Better Provenance and History?"}]
