[{"id":"comment-7497","author":"robert","post":"I just read it, too. The tone says it all. Actually, I was just going to say what Chris has: If he’s so confident, he should go ahead and make one. But maybe after he’s read a bit more about the Shroud..","date":"2012-01-25","mins":"5:42 am","url":"https://shroudstory.com/2012/01/24/hes-back-and-its-a-doozy/","cat":"other_blogs","title":"He’s back and it’s a doozy"},{"id":"comment-10804","author":"robert","post":"I have a deep interest in ND Es. I had a short piece published in the recent edition of the Journal of Near Death Studies and am working on another piece for that journal. This article was surprisingly well done, in my view, and I’m glad to know about the book it came from. Is there a relationship between the Shroud and ND Es? I think that is certainly possible. It’s what I have intuitively felt. There is a fascinating case of a woman named Anita Moorjani (her book, Dying to Be Me, was released last month and is doing very well on Amazon). After a long battle, she “died” from stage 4 lymphoma, her body riddled with tumors the size of lemons. While on the other side (her description), she was shown that she had been living in fear, while she was meant to live in love. She was told that, now that she had realized that, if she chose to go back, her body would adjust to her new love based way of being, and would heal quite quickly. This, miraculously, turned out to be true. What is particularly interesting from the standpoint of the Shroud is that she was also told that, depending on her choice to return to her body or not, test results would yield different verdicts. If she chose to stay, the results would show she died from her cancer. If she returned to her body, the results would show a cancer on the retreat. The really mind bending thing is that this test had already been done; however, the results were not yet in. When she did return to her body, it happened exactly as she was told it would. Taken at face value, her story is one in which some kind of spiritual influence came from (through?) her disembodied mind to her “dead” body, transforming that body and, what’s more, leaving an (apparently back dated) imprint on a medical test. The obvious implication is that the Shroud could have been the result of a similar kind of phenomenon (though without the “back dating” element); only, in the Shroud’s case, this phenomenon would have been taken to a much greater extreme, so that, rather than the body being healed, over weeks, of what killed it, the body would have been instantly transformed into some other order of being. So maybe the Shroud was produced by the same sort of thing as we see with Anita Moorjani, only in this case, the spiritual influx would have been far greater..","date":"2012-04-24","mins":"4:19 am","url":"https://shroudstory.com/2012/04/23/shroud-of-turin-relationship-to-nde-and-obe/","cat":"other_blogs","title":"Shroud of Turin Relationship to NDE and OBE?"}]
