[{"id":"comment-3617","author":"anniecee","post":"” All it can do is comfort those who soldier on under the false apprehension that they are alone.” “God loves us, and wants us to love Him back. If God were a metaphysical certainty, our fealty to Him would be out of fear, not love. God is no rapist. There is no love without faith.” Tobacconist, I appreciate your comments. Thank you..","date":"2011-08-16","mins":"9:44 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3261","author":"anniecee","post":"I think Cookie means they want a print of the Jesus picture. Colton’s book is easy to find, yes at Walmart or all over. I believe that prints of the Jesus picture are only available at http://www.akiane.com and they’re a little bit expensive..","date":"2011-06-24","mins":"11:45 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3309","author":"anniecee","post":"My own opinion is that modern society has become very jaded and cynical, to the point where it’s hard for us to believe in spiritual things at all. People used to be much more superstitious and much more spiritual, in general. They believed in angels, gods and demons and often had these things all mixed up in their Christianity too. So people didn’t need much encouragement to imagine spiritual things. But now, people have a difficult time believing that ANY of it is real. So I think the book helps to make heaven more relevant for a modern civilization. The book doesn’t say much beyond what we already know in the Bible. So scripturally the story seems to be very sound. But the way it’s presented brings all those things to life in a whole new way. IMO, it’s a very encouraging testimony..","date":"2011-07-04","mins":"10:02 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3641","author":"anniecee","post":"You may be right… I think in heaven it won’t matter what skin color we have and I’m sure we’ll all be relieved that it’s not an issue. The Bible indicates that even the angels have various skin colors. Michael the Archangel has skin that shines like bronze or copper: how beautiful he must be!.","date":"2011-08-20","mins":"5:52 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4550","author":"anniecee","post":"People think it is more tolerant to adopt a concept of God such as you describe but there are two serious flaws in what you say: 1. There is no separation from God — Sin separates us from God. Anyone who has raised children can believe in the concept of original sin. Original sin needs to be acknowledged more than it is. People want to believe in the theoretical goodness of all mankind, but the world scene damns that theory within seconds. 2. Truth lives within us and can only be revealed through experience. — TRUTH as you describe it means that truth can be anything we want it to be and truth can be individually customized to each experience. By this definition, there is no central truth. I do think you’re right, that there’s no book that contains the entire Truth, not even the Bible. People who read the Bible for the words alone are possibly not going to end up with much, especially if they read it for the wrong reasons. The Bible is the inspired Word of God, but it’s not the complete Word. Even the Bible says that if everything about Jesus had been written, the world would not be able to contain the books. So there’s alot more Truth about Jesus than only what’s recorded in the Bible. But the Holy Bible is what God gave us, and apparently it’s enough Truth to get started with. But if we REALLY want to know what TRUTH is, then we must know Jesus Christ personally. Jesus said that HE is the TRUTH. In other words, truth is not a moral concept… **** TRUTH is a PERSON.**** You must read the Bible with the goal of getting to know Jesus. PLUS, the Bible is only the launching pad because Jesus also sent the Holy Spirit to “guide us into all truth.” If we leave Jesus out of our lives, we will never know Truth. It’s Jesus or nothing. No man made god ever did for us what Jesus did. That’s what the Shroud of Turin is about: the crucifixion AND the resurrection of Christ. He died, He was not a Victim, He did it by Choice, and He raised HIMSELF from the dead without anybody’s assistance. The Grave is empty, because Jesus LIVES. This is the basic Gospel. If we don’t believe in THIS Jesus, then we don’t believe in Him at all. Jesus said that He is the ONLY way to the Father. Jesus said that HE is the Way, the Truth and the Life. Jesus is not tolerant of all religions, in fact Jesus is not tolerant of ANY religions. Jesus despised “religion” when He walked this earth and He insulted the Jewish religious leaders on many occasions. Jesus does not represent a religion formed by man AFTER he died. Jesus represents HIMSELF, the living GOD. We must accept Jesus under HIS terms, or we have not accepted Him at all. In fact, we insult Him by lumping the Christ in with other gods who have never done anything for our salvation as Christ did. The universal “god” is a lesser god… far, far, far less. Although on the surface the universal “god” appears to be more tolerant and gracious, this humanistic interpretation of a universal god has nothing whatsoever to offer us. The universal god has no basic form, no basic code of behavior… the universal god is just vapor. I think universalists might as well admit they are agnostics: it would be more honest than trying to portray that they believe something when actually, they don’t believe in anything. I’m not trying to be harsh, just trying to cut out the nonsense because the vague, vaporous interpretation of a universal god is basically a copout. The gods do not allow it, and most importantly: Jesus Christ does not allow that interpretation of God..","date":"2011-11-04","mins":"3:56 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3310","author":"anniecee","post":"Yes, I was concerned about the universalism that seems to be creeping into her work. Although people think that a unified religion is a good idea, it doesn’t work out in practicality because the gods themselves don’t allow it. Each religion is somewhat exclusive, and some of them are extremely exclusive. You can’t be faithful to ANY religion if you embrace ALL of them. Which is perhaps a good illustration of what Jesus said, “I would that you were hot or cold, but because you are lukewarm I will spit you out of my mouth.” And Jesus also said, “I am the Way, the Truth and the Life. No man comes to the Father except by Me.” So Jesus himself made it clear that he doesn’t go for this unified religion stuff. Also in I Timothy 2:5, “There is but one mediator between God and man: the man Christ Jesus.” Yes, I’m concerned about Akiane. The humanist tendencies of athiesm seem to be creeping into what she believes..","date":"2011-07-04","mins":"10:13 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3311","author":"anniecee","post":"Well, before he was middle eastern he was God, the Son of God, and the Word who created this planet and this universe. IMO, it’s not surprising that he’s very unique in his appearance. :).","date":"2011-07-04","mins":"10:16 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5208","author":"anniecee","post":"Post number #187 is by A Grotta… are you A Grotta as well as Michele?.","date":"2011-12-03","mins":"4:18 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9688","author":"anniecee","post":"Hi Kent, we’re really slow giving you a reply, but then again maybe not BECAUSE – since you asked this question – there has been a new published report about this very thing. I don’t know the details very well. But there are Shroud experts who could tell you the smallest details about it. I believe the study was done in Italy and they did experiments with intense light on linen and they got results that were encouraging. And, it would have been impossible for such a method to have been applied to the linen during the time that Christ was here on earth: no such technology existed. So this indicates (possibly, hopefully, AWESOMELY) that the image must have been applied supernaturally. If you’re interested in all this, catch up with the fellas at the top of the blog (the daily posts) and they’ll be glad to steer you around all the fascinating facts about the Shroud. :).","date":"2012-03-27","mins":"7:30 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3312","author":"anniecee","post":"IMO, it’s best not to get hung up on details because the story comes from a 3 year old who may have muddled some things in his mind. He related the story to his parents, over a period of two years or more. So many things could have influenced the clarity of the vision by that time. The gist of it is: apparently he really did have a near death experience and there are some things that are particularly impressed on him that he was very strong about. First of all, Jesus really really loves children. And second, we must know Jesus when we die. Third, Colton wants everyone to know that heaven is for real. These things are scriptural and if this is the main message of Colton’s story it’s a really good story. Colton’s book is not the Bible, it’s not scripture. So I don’t think it needs to be gone over with a fine tooth comb for accuracy. But I do think God has used this story for good purposes. For example: Jesus loves the children. I’m trying to help orphans in Haiti and I can’t get anybody to care about the orphanage I’ve been assisting. Not even my own family. People are so indifferent now a days. I really understand Jesus’ frustration with the church of Laodicea, they could not be MOVED to care about anything. There are children starving and abused all over the world. Maybe Jesus wants to stir up compassion for these little ones who do not deserve the suffering they’ve been born into. IMO, we should not ignore Colton’s message about the children..","date":"2011-07-04","mins":"10:36 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3616","author":"anniecee","post":"David Rego, I just now saw your post. You can contact me through the website at http://www.http://bonsecours orphans.com The contact form goes to me. I’ve been praying for help. It seems it’s very difficult to move people’s hearts these days. I’m not sure why, sometimes I wonder if this is the Church of Laodicea manifest on the earth. Thank you for inquiring..","date":"2011-08-16","mins":"9:37 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3396","author":"anniecee","post":"I agree. I read it twice in a week, and re read some favorite sections. I basically memorized it! Such wonderful confirmation of what God has planned for those who love him. Recently I saw this video of a man who had a near death experience, and I have thought about his story a lot. It’s very compelling:.","date":"2011-07-24","mins":"4:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3401","author":"anniecee","post":"I think so. I think Christians (including myself) need to be more heavenly minded, that our rewards are not in this life but in the next. The reality of heaven changes our perspective considerably. The book does give some examples of people whose lives were touched and changed because of Colton’s testimony. His experience has had a profound affect on many people..","date":"2011-07-25","mins":"12:00 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5117","author":"anniecee","post":"I think God is reaching out to you, too, Michelle. That’s why you are so convinced God is real, and He cares about you. One of my friends has a similar history, her life is a long series of tragedies and traumas and injuries. Her longing for love got her into several bad relationships, some of which she was lucky to survive. Two years ago she married a man who is very sweet and kind, a good Christian guy with a reputation for being steady and reliable. . I figured God would do this for her eventually because she really needs to know what it’s like to be in a decent family. And by the time she found this man, a lot of the ginger had been knocked out of her so she wasn’t looking for excitement anymore, she just wanted peace. I noticed that she didn’t know how to be “normal” because of the bizarre life she’d had. Now she’s very grateful for the peace of being in a quiet, normal relationship. When Adam & Eve ate from the Tree of the Knowledge of Good and Evil, the serpent was right about some things. He said they would become like God, knowing good and evil. I believe this is possibly our Quest in Life, the purpose for our existance. You have encountered evil and you know what it is. There is some wisdom in knowing this, especially if God helps to process those horrible experiences so they turn into wisdom. You also need to understand what it means to be Good… and the word “good” is so much more rich than we realize it is. The Bible says that only God is good. The little bit we know about “goodness” is only the tip of the iceberg you might say: it’s only a teeny glimpse into the immense goodness of God. I found this website just now, because I love the book of Hebrews where it talks about how God does everything “Better.” A better Way, a better Covenant etc. Http://www.messianic literary.com/hebrews.htm That’s a messianic Jewish site which is kinda cool. I thought the outline he provided was a good start on reading Hebrews in light of knowing something BETTER. YES, God has a BETTER plan for your life!.","date":"2011-11-30","mins":"8:04 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9737","author":"anniecee","post":"I don’t have a problem with it, because the Bible does say, “Out of the mouth of Babes…” and that’s what is SO unique about this painting and the confirmation of by Colton AS WELL AS another very young child who had a near death experience! Another little boy ALSO confirmed that the picture looked like the Jesus he saw. All these “babies” think this painting is like Jesus. If a cult following was being developed, I would have a problem with it. But the only thing that’s happened is little children have confirmed that’s what the Jesus they saw in their vision looks like. Which is really cool. And, it’s from 2 or 3 witnesses so that’s an interesting point too. Might as well enjoy it, because Colton’s book is all about Jesus and it glorifies the Lord. I thought the family did a good job of writing the book in such a way that it was merely a narrative of what Colton told them. They didn’t jump to conclusions, they just told Colton’s story and they didn’t do it in such a way that it would glorify themselves. That’s a very difficult balance, I think there was a lot of wisdom in the way they wrote the book. I highly recommend it. And I tend to be more skeptical and jaded than most, IMO. But I absolutely loved Colton’s story: it’s incredibly encouraging especially in these difficult times..","date":"2012-03-28","mins":"9:42 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3571","author":"anniecee","post":"That’s a sweet story, Rosanne. I appreciate how people share their own experiences and thoughts here. Gives me alot to think about. I agree, it’s difficult to see people turn their backs on God. Prayers are needed..","date":"2011-08-11","mins":"4:01 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4527","author":"anniecee","post":"The book of Revelation chapter 10 also talks about an enormous angel that stands with one foot on land and one foot on the sea. The angel gives the prophet Daniel a letter or parchment, maybe it is similar to the one the angel gave you. Maybe you should read the book of Revelation and see if it helps you understand your dream. Revelation is hard to understand, so don’t get frustrated if it doesn’t make sense. It’s not supposed to make sense, I think. And yet Revelation does give us clues and things to look for so we’ll be able to understand when these things start happening. And they DO seem to be happening, now, in our time..","date":"2011-11-03","mins":"3:03 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3601","author":"anniecee","post":"Yes, I agree: I didn’t see anything in Colton’s book that contradicted the Bible. I think the writers of this book were careful not to apply interpretations or conclusions to anything, either. Mostly it’s just a testimony, and the Bible does say that our testimony is a good thing that God uses. I’m very wary of false teaching — I thought this book was a pure blessing to read and I couldn’t find anything to complain about..","date":"2011-08-13","mins":"9:44 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3719","author":"anniecee","post":"I read the book twice and I thought it lined up with scripture really well. Colton’s description of how Jesus went up and down is consistent with the Bible’s description of the Ascension. Colton said that his grandfather had really big wings… that’s where that comes from..","date":"2011-08-29","mins":"6:24 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5189","author":"anniecee","post":"Wow, that’s harsh. I read the same story, it’s on Akianne’s website..","date":"2011-12-03","mins":"2:41 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5190","author":"anniecee","post":"I’m not sure why there are skeptics in this world, either, Ann. God confirms his Love and care to those who do make the effort to believe… why would anyone want to live without God’s help in their lives? Your husband’s dream… how beautiful! What a special touch from God..","date":"2011-12-03","mins":"2:46 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5193","author":"anniecee","post":"Ah, I found it. The story of the carpenter is in the book about Akiane. Here is a link on Google books: http://books.google.com/books?id=wy 0 Ig Or OMMC&pg=PA27&lpg=PA27&dq=akiane's+painting+of+Jesus+Carpenter&source=bl&ots=7utl R Lpb MG&sig=j9knr T5sxk1 sz H5fj4 M Hf V3 KIY&hl=en&ei=ou DZ Ton DJ9 K9tgeihtjs AQ&sa=X&oi=book result&ct=result&resnum=1&ved=0 CDIQ6 A Ew AA#v=onepage&q&f=false.","date":"2011-12-03","mins":"4:44 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4526","author":"anniecee","post":"Why would heaven be anything less than earth? It will be so much more! All the animals that have been lost due to extinction, plus many more that we’ve never heard of. The Bible does mention a lion, lamb, and horses in heaven. Jesus comes back on a white horse. The Bible refers to animals as having the same “breath of life” as humans do, with the “breath of life” being spiritual in nature. And Noah’s covenant from God was promised to the animals as well as the humans. Animals will be judged for their deeds, the Bible says this, and how can they be judged if they are dead and gone? I wrote an article on this, with Bible verses etc. Http://waitingfortheword.com/index.php?option=com content&view=article&id=13&Itemid=5.","date":"2011-11-03","mins":"2:51 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4665","author":"anniecee","post":"Your comments are very thoughtful, MC. Jesus had a big problem with religion, too. In fact, it was the religious leaders who were determined to kill Him. I would like to suggest that you read the New Testament to find out more about Jesus. Sometimes when we go back to the Gospels as an adult, it opens up in a whole new way. Jesus was fascinating, his miracles were amazing, his teaching was mind boggling. Every time I read the gospels I see more that I hadn’t noticed before. For example, Jesus sent his 12 disciples out in teams of 2 to do ministry. He told them, “Don’t take any money, don’t take any food, don’t take an extra cloak.” Maybe they were allowed to take a change of clothes, but they carried very little if they did. That’s an incredible contrast with modern churches who need a million dollars before they can even begin the work that God has called them to do. Who teaches this kind of faith anymore? But Jesus wanted his original 12 to depend entirely on God. If we really want to cut to the chase and find out what Christianity is about, it helps to go back to the source: Jesus..","date":"2011-11-08","mins":"8:41 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4347","author":"anniecee","post":"This is a very moving testimony, thank you for sharing your amazing experience. I can feel the love of Jesus when I read it..","date":"2011-10-26","mins":"12:39 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4687","author":"anniecee","post":"Colton was four. It was more than a year before he started to tell his parents what he’d seen. I believe Colton’s story, but I think there some things became fuzzy in his thinking by the time he told his parents about it. He is a preacher’s kid after all, so he was in Sunday School all the time. Maybe some images and memories got a little confused in his mind..","date":"2011-11-09","mins":"3:23 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-4695","author":"anniecee","post":"It’s important to remember that our English Bible is a translation and some things are lost along the way. For example, the Hebrew language had no word for “Cousin”, I read that somewhere and they seemed to know what they were talking about. So the “brothers and sisters” of Christ might actually have been his cousins. The Catholic theory that Christ was an only child might be right, when we look at the original languages. James, the Lord’s brother, might have been a cousin instead. Another thing to consider: the reason why the nails were put through the wrists is because the nails won’t hold if they’re put through the palms of the hands. Think of a skeleton with the long long fingers: there’s nothing but soft tissue that holds our hands and finger bones together. So if nails were put through the palms, they ripped out as the body sagged on the nails. The Romans did put the nails through the wrist, for that reason… so the nails would hold the body up on the cross. If we knew more about the original languages, we might learn that hands and wrists were the same word or close enough that it didn’t matter. Or somebody translating Hebrew to Greek got confused and it’s been that way ever since… etc. Ultimately, I don’t think it matters much. It would be nice if we could solve some of these discrepancies but how is anyone going to actually prove anything? Jesus Himself would have to appear among us to settle the question..","date":"2011-11-10","mins":"1:34 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5004","author":"anniecee","post":"Yes, that link is interesting. I know that there were many MANY miraculous events worldwide during a period of time from 1967 68 to 1974 75: a period of approximately 7 years. Personally I have wondered if these events began happening after the 6 Day War in Israel when the Jews gained control of Jerusalem. The 6 Day War was June 5 10 in 1967. That’s the only significant event I can think of that might explain those 7 years. There were also a lot of miracles that happened during the 6 Day War..","date":"2011-11-25","mins":"4:04 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5011","author":"anniecee","post":"God spans all religions… Not sure what you mean by that. Mostly I’m annoyed that people want to make it out that there’s more than one Savior, and according to Jesus Himself, that’s just not true. Jesus is the only Way. In Colton’s book, the child is so adamant that people must know Jesus before they die! I love that part. If we try to figure out ahead of time how God will handle Judgment Day, our frail brains come up with all kinds of strange theories. I think we should leave it alone before we say something silly. We know God will be fair about it. God spans all religions… I can agree with this to a degree. Not that God represents or is part of all religions, but rather: that God is ABOVE all religions. And I say that in it’s most ironic sense. He is above it all, beyond it all… so far above and beyond that God has nothing to do with any of them. What God looks at is His Only Son and those who follow Him. Jesus didn’t come to start a Religion: Jesus said over and over that He wanted us to have a relationship with His Father. Even Christianity can become a mere “religion” if it’s followers engage in legalism instead of relationship..","date":"2011-11-25","mins":"2:32 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5016","author":"anniecee","post":"CJ Cinkole : I was equally moved by the testimony in “23 Minutes in Hell”. That sounds very interesting! I will look it up, thanks. And I agree with you: heaven looks better and better every day! :).","date":"2011-11-25","mins":"4:44 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5091","author":"anniecee","post":"Wow, that’s quite an experience, Michael. A vision, or a near death experience? I just have to ask if you went to see your doctor after that and got checked out..","date":"2011-11-29","mins":"7:35 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5082","author":"anniecee","post":"Yes, Jesus did say that “a little child will lead them.” Colton does provide the “basics” in this book… there were some things that he was particularly intent on saying. One thing that was especially important: we MUST know Jesus. Also, that Jesus REALLY loves the children! I’m not sure any of us can truly know what love is until we have made an effort to read about and know Jesus Christ. I hear people talking about Love and the need for more Love, but which of us even cracks our Bible open to find out what Jesus had to say about Love?.","date":"2011-11-29","mins":"12:27 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5092","author":"anniecee","post":"Yes, I’ve heard of Jesus appearing to Muslims in “closed” countries. I heard about an entire village becoming Christians because one of the elders in the village had a vision that Jesus visited him. This was reported by reputable missionaries, so it’s very exciting. I’ve had some problems in churches that I attended too. What happened was completely inexcusable. I left two churches because of bullies. And I’m really sick of the so called “prophets” too. Jesus wants us to know Him on our own, not rely on words that others think they have for us. And not all their prophecies come true, so what does that tell you? The Charismatic renewal started out as a true visitation of God in the late 60’s, and it was precious and it happened worldwide. I think it’s embarrassing that today’s Charismatics are associated with that sweet move of God in any way. My folks are elderly and it’s hard for them to get out, so we watch Pastor David Jeremiah’s “In Touch” program on tv now. I highly recommend it. He also has a website. I can’t see anything questionable about that ministry: the teaching is relevant, interesting and completely Bible based and it’s not weird. We’ve been very grateful to have “real” church right in our home. For fellowship, I get together with Christian friends. Of course it’s best if you can find a good church to attend but many people are alienated from church now. Christians can be awful, but we ARE a work in progress and it’s important to think of that and I try not to be bitter about the past. God is always faithful and I’m so grateful for that..","date":"2011-11-29","mins":"7:52 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5118","author":"anniecee","post":"Oops, my reply ended up in the wrong place. This page is getting confusing!! :) I think God is reaching out to you, too, Michelle. That’s why you are so convinced God is real, and He cares about you. One of my friends has a similar history, her life is a long series of tragedies and traumas and injuries. Her longing for love got her into several bad relationships, some of which she was lucky to survive. Two years ago she married a man who is very sweet and kind, a good Christian guy with a reputation for being steady and reliable. . I figured God would do this for her eventually because she really needs to know what it’s like to be in a decent family. And by the time she found this man, a lot of the ginger had been knocked out of her so she wasn’t looking for excitement anymore, she just wanted peace. I noticed that she didn’t know how to be “normal” because of the bizarre life she’d had. Now she’s very grateful for the peace of being in a quiet, normal relationship. When Adam & Eve ate from the Tree of the Knowledge of Good and Evil, the serpent was right about some things. He said they would become like God, knowing good and evil. I believe this is possibly our Quest in Life, the purpose for our existance. You have encountered evil and you know what it is. There is some wisdom in knowing this, especially if God helps to process those horrible experiences so they turn into wisdom. You also need to understand what Goodness is… and the word “good” is so much more rich than we realize it is. The Bible says that only God is good. The little bit we know about “goodness” is only the tip of the iceberg you might say: it’s only a teeny glimpse into the immense goodness of God. I found this website just now, because I love the book of Hebrews where it talks about how God does everything “Better.” A better Way, a better Covenant etc. Http://www.messianic literary.com/hebrews.htm That’s a messianic Jewish site which is kinda cool. I thought the outline he provided was a good start on reading Hebrews in light of knowing something BETTER. YES, God has a BETTER plan for your life!.","date":"2011-11-30","mins":"8:07 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5125","author":"anniecee","post":"Leina, thank you for your reply, I appreciate that. And I got the name of David Jeremiah’s ministry wrong: it’s “Turning Point”, thank you for correcting it. The “In Touch” ministry is Dr. Charles Stanley and I like him too. Both are good. I’ve been especially impressed with Dr. Jeremiah in the past year..","date":"2011-12-01","mins":"3:04 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5141","author":"anniecee","post":"I’ve been asking “Why?” a lot, myself, lately. Trying to make sense of a lot of things. I do think that people who have always had it good, always had the best, always been provided for: it seems that such people don’t have as much to offer those who are hurting. Jesus can identify with us in all our sorrows, because of the things he suffered. He can weep with those who weep. The cross we bear is possibly preparing us, training us to provide “first aid” for wounded souls too. Pain and loss are truly the fires God uses to refine the soul to greater luster. This is how God converts the past into treasure worth having. Emily Dickson wrote, “If I can say one word in season, or soothe one pain, or help one fainting robin into its nest again: I have not lived in vain.”.","date":"2011-12-01","mins":"3:25 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5149","author":"anniecee","post":"My Mom said exactly the same thing yesterday. She nearly died when she was 16, in a bad car wreck. It was a prayer group hundreds of miles away that prayed her through. Her parents got saved because of it, they knew the prayer group made all the difference. But Mom wishes she had some special vision or something for herself… she’s jealous of those who do. :) I heard recently that “normal” is only a setting on the washing machine… !.","date":"2011-12-01","mins":"7:12 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5232","author":"anniecee","post":"Little Colton was particularly adamant about two things in particular: 1. WE NEED TO KNOW JESUS and 2. JESUS LOVES THE CHILDREN I think these two things are certainly a good map to start with. The reason why I keep pointing to Jesus, waving people toward Jesus, talking about Jesus… is because everything starts with JESUS. Michele mentions all the wonderful things that we begin to understand, realize, the stuff that DAWNS on us, when we have had an encounter with God. It’s not possible to put it into words. Whatever happened to her, she’s STILL floating around on God’s love. Something similar happened to my father when he got saved, and he still can’t find the words to convey what he wants people to understand about God’s love! If we could have mystical experiences anytime we want, we’d probably all be camped out in church 24/7 because people want to know that joy all the time, every day. But the only real way to know the Joy and Peace is to press ON in knowing Jesus. Just as Colton was relentless in preaching his 2 little messages, so we should be relentless in pursuing what Jesus wants from us. From ME. To be relentless in what Jesus wants of ME..","date":"2011-12-04","mins":"5:38 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5148","author":"anniecee","post":"Well, he wasn’t actually completely dead yet so maybe that explains it. I try not to dismiss the testimony of others because it is, after all, their own testimony. Abraham made it clear to the rich man in hell that the testimony of the prophets was enough, if that didn’t convince the rich man’s brothers then nothing would. My point in mentioning that Bible story is this: Abraham told the rich man that the TESTIMONY of others was all that the Living would get, and it was ENOUGH. So I think a testimony is something that should be respected because God gives personal testimonies quite an endorsement in that story. Yes, we do need to discern for ourselves what is true or not, and if you’re not comfortable with it then that’s your choice too. And it’s better to err on the safe side I suppose, than be taken in by every con that comes down the pike..","date":"2011-12-01","mins":"7:04 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5207","author":"anniecee","post":"Michael Wilks : Annie~ I remember there was the most awesome gold color to the sky, yet the clouds were such beautiful shades of blue and white. I’ve been thinking about this, the gold color sky. It sounds so pretty! I was looking at clouds in the east yesterday; huge puffy white clouds and tinged with blue, with the sunset in the west making them pink and gold too. I don’t know why there would be clouds in heaven, but they are so beautiful maybe that’s enough reason. :).","date":"2011-12-03","mins":"4:14 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5321","author":"anniecee","post":"Yes, the Bible isn’t clear how things “work” after we die. Jesus told the thief on the cross that they would be together in Paradise, which is possibly the “holding place” that you mention… A “holding place” that you describe is supported by Scripture and it’s called Paradise. Jesus said that the rich man suffered in Torment after he died, whereas Lazarus was comforted at Abraham’s bosom (which some scholars think is the same as Paradise mentioned in other places in the Bible.) I also read in Revelation recently that Jesus tells most of the people who are waiting for Jesus to set up his eternal Kingdom that they must wait and REST until the Millenium is over– that’s when everything with the devil will be settled once and for all. Then we will all go with Jesus to wherever we are going. (A vacation of 1000 years in Paradise sounds really good to me.) One of the prophets also mentions being caught up to the 7th Heaven, which is apparently the very special place where God the Father is. So heavens has LEVELS? That’s interesting too. I think if anybody believes that they can truly figure out what’s happening over there on the other side, they would have to invent or fabricate a lot of it because the Bible is vague about the afterlife. And the Bible doesn’t spell out a clear picture of the End Times either — It can drive you crazy trying to understand what Revelation means. (But the Bible says that we do get a Blessing just for reading Revelation anyway!) — Basically, we can look forward to GOOD things if we know Jesus. — Basically, we know that hell and punishment and Hades are all very terrible and we want to do what we can to avoid them. — Basically: we know that Jesus wins because we’ve read the end of the Story. Apparently these are things God wants us to be sure of. The rest of the tidbits are “appetizers.” :).","date":"2011-12-07","mins":"5:42 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5233","author":"anniecee","post":"That’s an awesome story, Stephanie. Very amazing to think about. What a comfort for your family..","date":"2011-12-04","mins":"5:45 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5513","author":"anniecee","post":"That is a wonderful, dramatic testimony of your conversion! I am always interested in the testimony of others, because each of us has our own “proof” from God; it’s a real touch from Him, something that we know within ourselves truly happened. God is real, and He cares. This is why Jesus said that the testimony of Believers is all this world is going to get in the way of proof. (That, and nature itself which shouts of God’s glory.) If somebody truly wants proof, God will give it to them. But He ignores the fakers and the blasphemers who don’t mean it..","date":"2011-12-14","mins":"2:46 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5601","author":"anniecee","post":"Possibly because you’re not ready to die. Are you prepared to meet Jesus? Doesn’t seem as if you are yet. The thoughts that you struggle with are Doubts. Doubts about everything, most likely. Even doubts about yourself. This generation is very good at asking doubts, but they don’t know how to find answers. They can dig a hole, but don’t know what to fill it with. So all they’ve got is a hole. That’s what doubts do for us. Jesus got annoyed with people who doubted Him. He said many times, “Where is your faith?” He thought it was so easy, all we have to do is believe in Him so why is it so difficult? Jesus did a zillion miracles, but the Bible says that he couldn’t do many miracles when He was in Galilee because the people there didn’t have faith. I think that’s amazing: our faith is sooo important? Apparently it is. In the Bible book of Hebrews 11: 6 it says, “And without faith it is impossible to please God, because anyone who comes to him must believe that he exists and that he rewards those who earnestly seek him.” If you want to help your mind be more peaceful, I recommend reading the Bible books of Matthew, Mark, Luke and John. These tell the story of Jesus. He was such an awesome person, it’s peaceful just reading about Jesus. And John 3:16 tells us how to be Saved of course. So does Hebrews 11:6 (above)..","date":"2011-12-16","mins":"4:38 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5641","author":"anniecee","post":"I want to add that Jesus said He came to give us LIFE and to give it more abundantly. And I encourage you again to read the Bible, especially the New Testament. And I hope there is someone in your life you can talk to. Make an effort to find someone or go to a school counselor if you need to. You shouldn’t deal with your depression alone. You have a lot to live for, and life is good. This video by Pam Thum is very comforting, perhaps you will like it:.","date":"2011-12-17","mins":"4:25 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6080","author":"anniecee","post":"LOL… cute story indeed. I’d like to suggest that Mr. Ginn read the New Testament again. When we make up our own religion based on our own ideas, we can end up in left field. If we read the Bible often (a few verses every day, at least), it helps us stay more balanced. I like the ONE YEAR BIBLE because it lays out a daily reading of approximately 1 or 2 pages and is just right. In fact, the ONE YEAR BIBLE is a Facebook app now and I really like it: http://apps.facebook.com/oybonline/.","date":"2011-12-24","mins":"7:41 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6220","author":"anniecee","post":"James Ginn : “Think not that I am come to send peace on earth: I came not to send peace, but a sword. For I am come to set a man at variance against his father, and the daughter against her mother, and the daughter in law against her mother in law.” Mathew 10:34 When you can explain this verse you will understand what I am talking about. But you dont understand it… do you ? Actually, I do understand it. Being a Christian tends to separate to sheep from the goats, especially if a person is committed to walking a selfless life then I think they encounter even more opposition from surprisingly disappointing persons. The devil will stop at nothing to hinder a true believer, including turning family against family. But this is happening in the world too. I read about a child recently who killed his grandmother because she wouldn’t let him play his video game. Or a son who killed his parents because his cell phone was confiscated for punishment. These things are happening, it is good vs. Evil. The same conflict that began in the Garden of Eden. Your claim that there is no proof Jesus Christ existed is baffling. He was not a world leader and yet one of the ancient historians mentioned him. Jesus, a mere carpenter from a small village in a small country of slaves, a man who died as a common criminal among other nameless criminals… this man Jesus Christ attracted the attention of Josephus. It is quite remarkable that he is mentioned at all. And yet, our years and our calendars revolve around his birth. I think you’re making up your religion as you go along, I’ve never heard anything like it..","date":"2011-12-28","mins":"12:32 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6228","author":"anniecee","post":"James Ginn : He was the man whom Christianity is based upon. He performed miracles. Yet no one wrote about him. Highly unlikely. Um… I just told you that a secular historian, Josephus, mentioned him. Plus, you have the eyewitnesses of Matthew, Mark, Luke and John who wrote about Jesus’ life and death. There’s a lot that’s known about the life of Jesus Christ. Why do you have a problem with Him? I think that’s what you need to ask. You seem to be afraid of Jesus, and yet you’re drawn to Him. You don’t need to be afraid. Just get down on your knees and introduce yourself. Confess your need for Him as your Savior. I think you’re possibly very close to salvation. I will pray that you can overcome whatever it is that’s holding you back from knowing Jesus personally..","date":"2011-12-28","mins":"2:54 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6207","author":"anniecee","post":"I’ve never heard of someone who claimed to be a Christian and yet did not believe in Jesus Christ at all. You don’t seem to know much about the New Testament either. This is nonsense. You can’t believe in the Bible without believing in Jesus: he’s the main Subject from beginning to end, starting with the Fall of Man and the need for a Savior – to His return in Glory. And it’s not an allegory with hidden meaning. Jesus was real, his death was real (that’s what this Blog about the Shroud is partly all about.).","date":"2011-12-27","mins":"10:28 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6206","author":"anniecee","post":"For me, one of the main things that proves Christianity is different from all the rest is the music. No other religion has so much music, countless songs, choruses, anthems, always new music in every generation! Music that is joyful and full of celebration. Music that is full of worship and praise for God who is like none other. Worship that is full of Victory and Awe for what Christ accomplished while He was on earth. Music that is just plain fun and happy. Music for the children. Music for those who are sad and need comfort. Music, lots of it, pouring out of people who love to sing praise to the God they LOVE. The music alone sets Christianity far FAR apart. No religion on the planet takes even a remote second when it comes to the music. I don’t think anybody can explain away this phenomenon; why MUSIC just pours out of this religion in abundance. Maybe it’s because there is something very VERY special about Jesus Christ!.","date":"2011-12-27","mins":"10:16 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6291","author":"anniecee","post":"You’re kinder than I am able to be, Jeannie. I’m so tired of these atheists popping up everywhere to insult and bully. They are a minority, a small minority, but they’re loud, aggressive and they have very bad manners IMO. They’re also turning up the heat on their own future torment, and for that I really do feel very bad for them but it doesn’t seem as if there’s anyway to talk to them, to reach them. They have deliberately hardened their hearts against God..","date":"2011-12-30","mins":"10:01 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6292","author":"anniecee","post":"What an incredibly amazing story, Jeannie. A precious memory for all your family, and now for us as well. Thank you..","date":"2011-12-30","mins":"10:04 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6794","author":"anniecee","post":"That’s very beautiful, thank you. Especially for those of us who are single women and know what it’s like to depend on Jesus completely to pay the bills and even help with the daily frustrations of life. I had a situation today that was driving me crazy. I went out on errands and when I got home, it was all resolved as if Jesus Himself had stepped in and done it for me. (Which I kinda think he did.) I too had a lovely dream of Jesus, that helps me through the rough spots… so I appreciate yours. I know what it means to you..","date":"2012-01-10","mins":"6:31 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6941","author":"anniecee","post":"I really enjoy the personal stories on this blog; of miraculous intervention and divine encouragement. Jesus said, “My sheep hear my voice and know me.” I feel very sorry for those who don’t experience the personal touch of Jesus in their lives. It’s also very sad and frustrating when someone (like that unsaved brother) refuses to acknowledge God’s mercy in his life..","date":"2012-01-13","mins":"4:03 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6952","author":"anniecee","post":"Maria, a friend of mine had a similar experiences when she was a child. She learned to pray to Jesus and the demons would leave. Her family didn’t believe her, that she was seeing these things in her bedroom but Jesus helped her. She learned later that witches had lived on that property before her family did. Her father also apologized to her many years later for not believing her..","date":"2012-01-13","mins":"11:22 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7457","author":"anniecee","post":"Your son died with a smile on his face? His angels must have been there to help him so he wouldn’t be frightened. He must have seen something truly wonderful. Jesus pulled a small child into his lap and told his disciples, “In order to enter the Kingdom of Heaven, we must be like these little ones.” And, “Their angels in heaven always have access to the Father.” Those are such wonderful verses: they give us a little insight into heaven and God the Father. God really loves the children!!.","date":"2012-01-24","mins":"5:24 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7536","author":"anniecee","post":"The Egyptians aren’t very dark. In fact many of them are very light. I don’t understand the problems that people have with Jesus’ skin color. We know what his nationality was. And probably every last one of ’em was tanned to a dark brown, only the rich people had pale skin I suspect. Jesus spent a lot of time outdoors, ministering to people. I do think it’s laughable when Jesus and Mary are portrayed as BLONDE, I don’t like it. Even though I’m blonde. I just think people should try to be accurate, and blonde isn’t very likely..","date":"2012-01-25","mins":"6:04 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7688","author":"anniecee","post":"Yes, Richard, I know what you mean: He has been there in good and bad. There’s no doubt of it. He is the “One who sticks closer than a brother.”.","date":"2012-01-30","mins":"8:47 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7815","author":"anniecee","post":"Yes I’d really like to see your pix. I sent an email. :).","date":"2012-01-31","mins":"10:54 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7792","author":"anniecee","post":"Clear images of… what?? This sounds hinky, in my opinion. He doesn’t even say what he’s selling. Unpublished originals? And buy now or… what? Why is he in such a hurry. This has all the red flags. I wish somebody would remove it..","date":"2012-01-31","mins":"5:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7975","author":"anniecee","post":"Actually, we don’t know. He could have been just about any skincolor shade. There are dark jews and light ones, as Rebecca explained. And because he was outside a lot he was probably dark anyway. Just about anything is POSSIBLE, because the Bible doesn’t provide a description of him. Not even his haircolor, whether he was tall or short: NOTHING. And I think that’s deliberate, so no matter who we are, we can identify with WHO Jesus is rather than what he looked like. God doesn’t want it to be a hangup, so He skipped that part when He wrote the 4 Gospels. That’s my opinion. :) Michael the great archangel is bronze: what a skincolor that must be! In heaven we won’t be married, it won’t matter if we’re male or female, it won’t matter what color we are and we won’t care. I love Colton’s book but I’m careful to avoid accepting it completely because the story was told by a very young child. Perhaps heaven was presented to Colton in ways that his baby mind could accept and remember. So everything is most likely over simplified. I believe most or all of what Colton reported is true, it doesn’t conflict with the Bible at any rate. But it’s coming from a baby, none the less. And the Bible warns against adding to scripture, in fact there’s a curse for those who try to do that. So Colton’s book cannot and does not carry the same authority as the Bible does. But it sure is fun to read!! And very encouraging, for many reasons..","date":"2012-02-06","mins":"7:08 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7981","author":"anniecee","post":"Hi John, Yes, I thought your pictures were very interesting and I loved seeing them. Amazing! What a blessing God gave you. It sure looks like a real glory cloud to me! Here’s the link to John’s pictures on Flickr, too: http://www.flickr.com/photos/fortheking2010/sets/72157629142268803/with/6806276365/.","date":"2012-02-06","mins":"8:35 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-7979","author":"anniecee","post":"I think you’re missing the point of the question, Rebecca. Some people can’t identify with blonde and blue eyes… for very difficult reasons and it’s very understandable. And since the Bible does not SAY what Jesus looked like, we REALLY do not know. Jesus was only half Levite at the very most; the other half could have been any color that God picked out of a hat. The archangel Michael is bronze in color, God could have picked that if He’d wanted to. People make a mistake when they try to fit something into the Bible that isn’t there. Most of the time it’s not there for a reason. People all around the world need to identify with Christ, and if his appearance makes it harder for some people to identify with Him: then God simply didn’t tell us. He left it out. Akiane’s painting is not a photograph of God. Even Christ said, “The flesh is meaningless, it is the Spirit that gives life.” We need to seek Christ in Spirit and in Truth most of all. That is our common ground..","date":"2012-02-06","mins":"8:06 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8004","author":"anniecee","post":"I Corinthians 13, “For now we see through a glass darkly, but then we shall see face to face.” Be careful about enforcing your ideas… if it’s important to you to see him as blonde and blue eyed, then for YOU perhaps he is. But it’s equally as important to other people to be able to identify with Christ from their own perspective. Your eyes are faulty, so are mine, so are we all. That verse in I Corinthians 13 says we all need corrective lenses! Anything we might see here is going to be dull and different from what it’s like when we are with him. People who rely on visions or knowledge apart from Scripture are likely to get into error or at least off the beaten track. That’s one thing I liked about Colton’s book, they laid it out but allow the reader to decide for themselves. The story is told very gently, very kindly. If there’s truth in it, the Holy Spirit can use it. I have my own special little things that Jesus has given me for comfort and communion, but I don’t share it. It’s for me. Sometimes that’s the way these visions are meant: something personal between me and God, which makes it all the more precious. And I agree with you, the sooner the better when Christ returns! “John the Baptist” is out there telling people, warning people. He asked God for a witnessing tool, and God gave him a humdinger of a witnessing tool!!.","date":"2012-02-06","mins":"5:26 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8105","author":"anniecee","post":"Hi Rebecca, Yes I think your research is interesting. I like the explanation about Leah’s eyes. Although I’m not sure why blue eyes would be offensive, unless, like you say, it’s because they’re too sensitive in the arid desert regions. I have blue eyes and I’ve wondered what the ancients did without sunglasses. Or, if Leah was nearsighted I’m sure that would be detrimental too since they didn’t have corrective lenses back then. Our modern things sure do make life better for a lot of people. You’re right, it’s also possible Jesus was fair. But some people really have a problem with “white” Jesus. Here’s my collection of the Face of Jesus. There’s a lot of variety. Many like to portray him with very red hair:.","date":"2012-02-09","mins":"7:21 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8256","author":"anniecee","post":"Khanh, what an amazing story. I’ve already told other people who read that book. As the Bible says, “Out of the mouth of babes… ” Matthew 21:16. This is really FUN stuff, eh? And very encouraging..","date":"2012-02-14","mins":"11:26 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8253","author":"anniecee","post":"Diane, that’s an amazing vision. Quite a revelation… a comfort for people who have experienced extreme loss. The disciples expected Jesus to set up a Kingdom, which he certainly could have done with the power that he had. Instead, Christ deliberately challenged his disciples with words they couldn’t understand until only 12 were left. And then he deliberately gave himself over to the religious authorities who wanted to kill him. Why was “loss” and “failure” the path he chose? Why was the Cross such a gift for the Father? Why was blood necessary? And, where was the Love in such a hideous death? Your vision touches on a mystery that we can barely understand. Most of us just take it on faith because we don’t get it. You’ve had a very rare gift..","date":"2012-02-14","mins":"10:35 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8272","author":"anniecee","post":"There’s another kind of “understanding” that comes from brutal experience. Loss and failure are a very hard road, especially when there’s loss after loss and failure after failure. With 6 miscarriages, Dianne has known very deep grief. As a result, she can offer comfort for very deep wounds..","date":"2012-02-15","mins":"6:36 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8255","author":"anniecee","post":"Joni’s devotional this week says, “Like these saints, we experience the biting reality of suffering; but we also remember the enormously high price Jesus placed on a soul – suffering is bad, but a soul lost is worse (Matthew 16:26). We realize God is permitting something he hates (pain and persecution) so that something he prizes (more souls salvaged) could be achieved..","date":"2012-02-14","mins":"10:59 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8258","author":"anniecee","post":"If that’s what happened to you, to reassure you… I really wondered what happened to the stalker that night to make him stop completely. (I wonder what kind of NDE he might have had…).","date":"2012-02-15","mins":"2:06 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8302","author":"anniecee","post":"Your ex must have been so confused. What an amazing story of divine protection. It’s a wonder that you didn’t find a few fluffy feathers lying around the house… One time when I was traveling alone on a business trip, a car pulled out in front of me on a wet rainy road. There was no place to go or even time to think about it. Not even time to pray but my mind said, “Jesus!” and then the steering wheel kind of jerked hard and the car slid over one lane and squeezed in between two cars… and it was all ok. I was in so much shock I thought I needed to call the police or something BUT then I realized that nothing had happened. Everybody was ok, there was no accident. I’ve always been convinced that an angel grabbed the wheel. And wet roads in Florida are like driving on ice: the heat brings out the oil in the road so when it rains, it’s like ice and very slippery. There’s always accidents when it rains. So that sudden maneuver on the wet road, in my opinion that was impossible. I had been afraid to travel alone so much, but after that I knew I wasn’t really alone..","date":"2012-02-15","mins":"1:01 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8259","author":"anniecee","post":"Oh, whether you had an actual NDE? No, I suspect it was more like a vision. A spiritual experience, showing you the future that God had planned for you. We think the spiritual realm is a long ways away, but stop to think about it: the Bible says that to be absent from the Body is to be present with the Lord. So when Christians die we are immediately in the presence of God. That doesn’t sound like a far off place, to me! And we know that angels pop in and out all the time. Seen and unseen. The Bible says that we see through a glass darkly, but then we will see face to face… sometimes we can almost see what’s on the other side of that veil or darkened glass. When Jesus returns, the sky will be peeled back like a scroll… or you might say: like a piece of paper it will be ripped and thrown aside. Wow, we when think of ALL the Bible verses and ALL the spiritual experiences people have had the things we’ve seen… eternity is only a breath away. It’s all around us, it’s already here. EARTH is what’s temporary and fragile: the life to come is the one that’s REAL, which is why we should be INVESTING in that life. Also, the concept of Time is different in Eternity. In that place, Jesus already rules and reigns. He is already King of kings and Lord of all. It’s very comforting to know that Jesus is already in charge. It’s not a future event, it’s already a fact. Somehow, Jesus took care of your situation for you that night. And He also took the time to minister profound peace when you really needed it. Yours is a beautiful story and I would like to share it with a friend of mine who is dealing with a similar problem..","date":"2012-02-15","mins":"2:34 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8380","author":"anniecee","post":"In Colton’s story, the little boy did see Mary in heaven. Colton’s parents wanted to know what she was like. He said that she acts like a Mom. (His descriptions are so little boy CUTE.) I love his description of the Holy Spirit: well, he’s kinda… BLUE. (I love it!) Colton did say that Mary was right by the throne of Jesus, so she does have a very honored place in heaven..","date":"2012-02-17","mins":"12:34 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-8513","author":"anniecee","post":"Thank you for your life story, Lu. It is a blessing to read your words. ———————————————————————————— HERE is a translation (using Google translator, and I clarified some of the phrases that Google didn’t do very well with.) ———————————————————————————— When I was 18. I got pregnant from a boyfriend, and my mother said, “so you will continue living with me, to abort this child.” I tried everything to make this not happen, but it was impossible, because my family mistreated me. Reaching even physically attack me because of pregnancy. My mom then took me to a woman who did abortions. And she had already prepared me for the procedure, when I stood up and said she would not do. Arriving home, I was physically and verbally assaulted again. I thought the longer I stay pregnant, it would be easier for her to give up the idea, since I risking my life, if I aborted with more months of pregnancy. However did nothing to change his mind. To my surprise, since he was 4 months pregnant when she came to take me to a doctor who did abortions. This doctor told us, who performed abortions with no more than 4 months of gestation, and in that case I would need a micro cesarean. And this could only be done in larger cities. My mom then took me to a big city. There were hours and hours of travel. My heart was troubled. I do not want in any way to have an abortion, but was weak, very weak. There was nobody to help me. Even the father of the child, who had been transferred to another city to work, and had no further contact with him. My sister, with my mother, atrocities practiced with me, with the intention that I would miscarry. Beat me, called me names, and forbade me to eat. I had no outlet, and not forces. Arriving in the capital, we stayed, and my mother was the clinic that sent us, talk about the procedure. She paid her half of the service, and the other half would be paid the next day, the day he would do the abortion. The clinic was too far from where we stayed, so we would have to wake up very early. By dawn. And 7 am would have to already be there. That night then, I do not sleep. Lying in my bed, just crying, with the very troubled spirit. I cried and cried, and when I closed my eyes to wipe away the tears and opened them again, I saw a man standing near my bed. He was a tall man, dressed in white, a large waist belt black, and his voice had extreme authority. At no time did he “borrowed”. He ordered. And I will never forget his words. While raising my eyes, he raised his left arm, pointed his finger in my direction and ordered: “YOU WILL NOT DO IT! CHILD THAT YOU DO NOT BELONG! BELONG TO ME! I WENT ABOUT THIS CHILD ON EARTH sent! AND I NEED HER HERE. ” Along with this vision, I also came to a gallows excomunal. A power of decision that I had not until then. Along with vision, I felt a power come and go, knowing that God was with me. So, it was around 5 am. When we would go in right direction already the clinic. When I stood firmly in his voice saying: “Mother, get up, we go back home.” My mother reacted. Swore, challenged, but I was firm. I knew that nothing would make me change my mind. And she knew it. Complaining a lot, she followed me, because I was decidedly back home and nothing would make me change my mind. The Holy Spirit came over me in that decision so so great that a wall does not prevent me back ago. We returned to our city, and it was played at home. I sleep from 4 to 9 months of pregnancy, in toolshed in the backyard. NO ground, but I knew God was with me. Could not get inside the house to eat and was beaten if I did. I have a large scar on my forehead, because hungry at 7 months pregnant, walked into the house to ask for food. My sister broke a plate of glass in my face, at the behest of my mother. It took 13 stitches to close the wound. Back from the hospital, returned home toolshed. I fed the plants that had for her. I spent the night awake, afraid of darkness, rats, spiders and lizards. There was only a blanket to lie. There was no pillow or a mattress … but even I knew God was with me. He had told me this personally. When I felt the pain of childbirth. There was not anyone to help me. At the hospital did not receive any visits from my family, and when I got high was not anyone waiting for me. Was discharged at 7 AM and 11 o’clock at night, no one had gone to fetch me. Ja had no bed for me. The bed where I was was occupied by another mother. And I waited for long hours with my son on my lap, sitting on a bench in the hospital corridor. 11 hours of the night, a neighbor picked me up. When you get home from my mother, I found that all had traveled. The house was locked. The power was off, and had not locked the water, but I just had to stay there. I managed to open the door, and I got it in the dark, and hungry … very hungry … My son was growing and growing. Could, with time and after much crying, I did gain my independence. My son now has 25 years of age. He is a person with the purest soul I know. A great son, honest, and hardworking student. Beyond that, and my biggest and best earthly friend. My mother, who already has 80 years, lives with us for many years in my house. And it is this child, who takes care of it, who buys their medications, their canes. And this son takes care of everything..","date":"2012-02-20","mins":"6:22 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9032","author":"anniecee","post":"To know more about Jesus, it is good to read the Bible. But do not start at the beginning of the Bible: the part about Jesus begins in the sections of Matthew, Mark, Luke and John. And you can pray to Jesus. The Bible says that if you seek Jesus, you will find Him: but you must do it with all your heart. You must be serious about it..","date":"2012-03-07","mins":"3:22 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9548","author":"anniecee","post":"That’s a really cool picture! Thank you for sharing that. :).","date":"2012-03-23","mins":"3:13 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9561","author":"anniecee","post":"Yes, I can see a crown of thorns. But the picture is too grainy to see a dove. It looks more like a fish to me. :) It’s a cool photo and yet frustrating too, just like the grainy shadowy image on the Shroud of Turin. It makes me want to see MORE. I would like to link to your picture if I may. From my blog, which is on hold at the moment as I’ve been finishing a huge project. But I’m going to get back to writing soon… I love to see unusual things like this. What fun! And for those of us who believe, it’s like a kiss from the heavens..","date":"2012-03-23","mins":"10:09 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9687","author":"anniecee","post":"That’s a beautiful testimony, Michael. God has really touched you. My mother was miraculously delivered from cigarettes when she got saved, too. Not everyone who gets saved is blessed with such a sign. And I agree, the lives of the disciples speak volumes. I’ve only recently learned what happened to Thomas and it’s very exciting. The “doubting apostle” was actually known for amazing signs and miracles. He traveled more than Paul did, and went further. There’s an article on the National Geographic website (of all places) that tells about him. Here is a paragraph from that article: “Thomas is said to have raised the first cross in India and performed one of his earliest miracles: When he encountered a group of Brahmans throwing water into the air as part of a ritual, he asked why the water fell back to Earth if it was pleasing to their deity. My God, Thomas said, would accept such an offering. He then flung a great spray into the air, and the droplets hung there in the form of glistening white blossoms. Most onlookers converted on the spot; the rest fled.” Here’s the link to the entire article, but I loved that particular paragraph. Http://ngm.nationalgeographic.com/2012/03/apostles/todhunter text I also learned, just today, that when a Catholic monk/missionary arrived in India in the 1600’s he found a well established Christian community that claimed to have been founded by Thomas. That’s 1600 years later!! I think that certainly speaks of the power of God, because only the Holy Spirit could have kept them on track for 1600 years. If it was only a man made religion, those remote Christians would have evolved into something entirely different and unique by that time and it would not have resembled the rest of Christianity at all. God bless you! It’s wonderful to hear of how Jesus has touched your life. :).","date":"2012-03-27","mins":"7:17 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9682","author":"anniecee","post":"I believe that when God gets hold of a child, He does not let go but watches until He can bring that person back to Himself again later in life. Your love for Him was precious to Jesus, and still is. You can teach your child to learn to love Jesus now, and I think it will help your faith as well. My best friend was concerned that her grandchildren would be raised without Christ in their lives so she has been their babysitter for several years, since they were born almost. Her greatest joy is to hear them pray, and their prayers are so sincere and honest and caring. She has tried to teach them to love Jesus. She wasn’t able to do this for her own kids when they were small, because she was so very lost herself..","date":"2012-03-27","mins":"5:03 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9735","author":"anniecee","post":"Hi Angel, by that logic we could say that every vision since the time of Christ is false, including Paul on the Damascus Road. The Bible does say that in the end times there would be an increase in dreams and visions, so I think it’s OK. The reason for these things is to encourage unbelievers. Usually they are a sign for the unbeliever. Such as Paul: that vision knocked some sense into him on the Damascus road. I don’t think of Akiane’s painting as a photograph of Jesus. It’s more of an “appetizer” for what’s to come. I collect hundreds of images of Jesus and actually, I see a similarity in all of them. But what’s amusing is, each image is painted with the hairstyle of that age and sometimes the clothing too. This is a very modernized image of Jesus and perhaps THIS generation needs a more relevant image to relate to. We don’t worship the image of course. Here is a painting done by Harry Anderson around 1950, and I think it looks a lot like Akiane’s painting. This is one of my favorites: That’s my collection on Flickr. Here are more pictures of Jesus, lots more: http://www.flickr.com/photos/waitingfortheword/sets/72157626190637769/with/5570683856/ And this is my huge collection of THE PASSION, if anybody needs Easter images right now there are more than 700 pictures: http://www.flickr.com/photos/waitingfortheword/collections/72157626459470938/ I want people to share them and enjoy them. Use ’em on websites and church overheads too..","date":"2012-03-28","mins":"8:21 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9746","author":"anniecee","post":"It makes sense to me. Jesus did say “Of such is the Kingdom of Heaven.” And, “Blessed are the Pure in Heart, for they shall see God.” Maybe that’s why the testimony from these little ones is Extra Special, at least to me anyway..","date":"2012-03-29","mins":"8:10 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9736","author":"anniecee","post":"He was a baby, so I don’t get hung up on the little things. His memory might have been affected by being in Sunday School AFTER he had a visit in heaven. In other words, the things he learned SINCE his near death experience may have tainted his memory of it. But one thing that did impress on him strongly was the fact that Jesus DID have “markers” and he saw them and he knew it was really important, which it certainly is. Those scars are wounds of honor and proof of Jesus’ love for us. Anyway, I love the book so much and I think it’s doing a lot of good in the midst of a very unbelieving generation, so I figure whatever faults are there can probably be explained by Colton’s young age in some way. Children who have these experiences gradually lose the sharp memory of it as they get older. He didn’t even mention ANY of it until a year after it happened. Maybe he was too traumatized to want to talk about his time in the hospital – so he shut it all out until he felt secure enough to talk about any of it. And then he only talked about it as bits and pieces came back to him. And, I wonder how much he remembers now that he’s a young teenager..","date":"2012-03-28","mins":"8:34 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-5196","author":"anniecee","post":"Guideposts has a magazine called… “Angels Magazine.” :) We especially enjoyed it when they first started publishing it about 5 years ago. It doesn’t seem to be quite the same caliber anymore altho it’s still a nice magazine. They told real life stories of people who had seen or been helped by angels. There were some stories about small children who could see and talk to their angels. This isn’t too unusual, apparently, especially if the child has been ill. I believe in one case the child was retarded. The stories were very sweet. As your child gets older he will most likely outgrow the sensitivity that he has now. My nephew could see things when he was small, too, and he didn’t have any traumatic experiences. Well, yes he did come to think of it. They couldn’t get him to breathe when he was born. They very nearly lost mother AND child during delivery but everybody made it. I only found out about this recently. Apparently my brother, who was in the delivery room, was so traumatized he couldn’t tell us about it at the time. Anyway… you probably don’t need to be concerned about your son, IMO. It’s because he is at such a tender age that he can see the things he does. Most likely he will grow out of it. I do think it indicates a very sensitive heart in your child, and I do pray that he continues to be sensitive to the Lord all his life..","date":"2011-12-03","mins":"6:15 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-9763","author":"anniecee","post":"Well, when I think about it, it’s kind of like a warning to the reader that we can’t get TOO deeply involved in it. Some people would set up a statue of Colton and begin to worship it, you know what I mean? And, all Bible prophecies or visions leave stuff out or put something in that doesn’t make sense. The book of Revelation is so frustrating to read. So you just have to read it and take it for what it is. The Bible says we get a blessing just for reading the book of Revelation, and maybe God had to say that so we wouldn’t give up on it. Dreams and visions are like that: we want MORE, we want the ENTIRE picture! But it’s only a taste, not the entire meal. This book is so nearly perfect, maybe God had to throw in one thing just to remind us not to go overboard, but to enjoy it for what it is. And I do think the book, Colton’s story, is a gift from God. We live in a generation where it’s more difficult than ever to believe in what’s supernatural, and we are mocked for doing it. Colton’s astounding 3 minute vision is a very comforting reinforcement that we are not crazy to believe in Jesus. All we desire is truly just a breath away. Heaven is for real..","date":"2012-03-29","mins":"3:18 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-6974","author":"anniecee","post":"Yeah, I knew that. :D Thank you for explaining it. I knew that light had something to do with all colors….","date":"2012-01-14","mins":"4:05 pm","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3313","author":"anniecee","post":"I am glad to hear you’re feeling better. Your vision is awesome, how God gave you strength and encouragement when you most needed it..","date":"2011-07-04","mins":"10:43 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3260","author":"anniecee","post":"The Bible says in I Corinthians 13:12… “Now we see but a poor reflection as in a mirror; then we shall see face to face. Now I know in part; then I shall know fully, even as I am fully known.” So, I would interpret the shadow to mean that we can’t possibly understand all of the glory of Jesus and heaven while we are yet on this side of the darkened glass, or the veil, or the darkness of death that separates us from God. This image is only a hint of what is to come..","date":"2011-06-24","mins":"11:40 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3210","author":"anniecee","post":"I read today, in the Bible, that Nicodemus brought along 75 pounds of scented ointment to wrap the body in when he and Joseph of Arimethea put Christ’s body in the tomb. Seventy five pounds of scented ointment, WOW that’s a lot. I haven’t read up on the Shroud much but I have wondered if anybody took that into consideration when attempting to figure out how the image got transferred into the cloth. The ointment was made of myrhh and aloes. I would think it played a part..","date":"2011-06-01","mins":"5:09 am","url":"https://shroudstory.com/2011/02/23/akianes-jesus-heaven-is-for-real-and-the-man-in-the-turin-shroud/","cat":"akiane_kramarik","title":"Akiane’s Jesus, Heaven is for Real and the Man in the Turin Shroud"},{"id":"comment-3262","author":"anniecee","post":"As someone with an artist’s eye, I think there’s a very strong resemblance between Akiane’s Jesus and the one by Ariel Aggemian. I think the facial structure is VERY similar, it’s only the hair, beard and eyebrows that are different – and hair is changeable of course. I like Akiane’s heavy brows, it gives Jesus more of a rugged look. Akiane’s nose is straighter but it’s also not very realistic, I’ve thought for awhile that the nose is the only thing in the picture that’s not quite perfect, and if the nose was perfect too I wouldn’t believe that an 8 year old did it because the painting is just too sophisticated for such a young girl. When I looked at other pictures Akiane did when she was eight, none of them were up to this level, which makes me believe there is more of “inspiration” in that particular painting. Ariel Aggemian’s Jesus has the better nose. Akiane got the proportions right but not quite the shape of it. Akiane’s bold modern colors and modern haircut make Jesus look more handsome, but Ariel Aggemian’s Jesus would look just as good if he went to the barber first. :).","date":"2011-06-24","mins":"12:01 pm","url":"https://shroudstory.com/2011/02/24/more-on-akianes-jesus-heaven-is-for-real-and-the-man-in-the-shroud/","cat":"akiane_kramarik","title":"More on Akiane’s Jesus, Heaven is for Real and the Man in the Shroud"},{"id":"comment-5433","author":"anniecee","post":"Yes, I love that blog page. There are some very beautiful religious works there. The little girl with her prayer book is precious: it looks like a photo. I don’t think I’ve seen Ariel Agemian’s Christ from the Shroud, before. Or if I did, the JPG wasn’t very good quality. I do think he nailed it… I’m somewhat artistic myself so I can almost visualize the face of Christ by looking at photos of the shroud. Not that I could paint it, I don’t think I could. But I can “see” it, and his painting is very remarkable, IMO. Thank you for posting that. Whenever I googled for Ariel Agemian’s painting, all I ever got was images of the Shroud itself. So I’m very glad to see some of Agemian’s work..","date":"2011-12-11","mins":"6:44 am","url":"https://shroudstory.com/2011/12/11/ariel-agemians-christ-painting-based-on-the-shroud-of-turin/","cat":"art","title":"Ariel Agemian’s Christ Painting based on the Shroud of Turin"},{"id":"comment-8010","author":"anniecee","post":"That’s a very rough coin, overall. The letters fade in and out, which was either a problem with the original mold or the mold is getting old (over used) or the person minting it was very sloppy. So to make any attempt to derive such DETAILS or SIGNIFICANCE from such a sloppy coin is not a good idea in my opinion. I’m very very glad there are Shroud experts on this planet. But I think y’all are desperate for something to talk about, frankly..","date":"2012-02-06","mins":"7:49 pm","url":"https://shroudstory.com/2012/02/06/another-justinian-this-one-circa-652/","cat":"art","title":"Another Justinian, this one circa 652"},{"id":"comment-4755","author":"anniecee","post":"I look forward to seeing it! Not long to wait… I hope you will post the followup, since I’m not likely to run across the article unless it appears on CBS News.com … which it might..","date":"2011-11-12","mins":"10:10 am","url":"https://shroudstory.com/2011/11/11/new-bust-of-jesus-from-the-shroud-of-turin-soon/","cat":"art","title":"New Bust of Jesus from the Shroud of Turin. Soon."},{"id":"comment-8083","author":"anniecee","post":"That portrait certainly does resemble ancient icons, but it’s an improvement because the face is more gentle. Some of the ancient icons are really fascinating, but many of them are very intimidating. Or even angry and scary. In fact, I wonder why the Catholic Church used some of them at all, it’s shameful to portray Christ in such a bad mood, IMO. But this portrait is nice, I like it. The artist has a kind face, too. Looks like a sweet guy. He also wrote several books, including one on the dangers of Harry Potter..","date":"2012-02-09","mins":"5:29 am","url":"https://shroudstory.com/2012/02/09/michael-obriens-portraits-of-christ-often-a-likeness-to-the-shroud-of-turin/","cat":"art","title":"Michael O’Brien’s portraits of Christ often a likeness to the Shroud of Turin"},{"id":"comment-4701","author":"anniecee","post":"It’s a strange comment, isn’t it. Although I agree the image does remind me of the Shroud, I imagine a different scenario: perhaps Leonardo was asked to examine the Shroud and attempt a likeness. That’s more plausible than the outrageous theory that Leonardo created the Shroud somehow. I like this painting of the Salvador Mundi. It’s gentle and majestic, both. Christ is regal and yet approachable. This person seems to think that Da Vinci had a certain style in everything he did, but I don’t think that’s true of any artist I’ve known so why should it be true of the Old Masters? Artists are creative people who do enjoy experimenting, changing, creating, growing as artists. If Da Vinci wanted to create an icon, well… why not?.","date":"2011-11-10","mins":"12:38 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"},{"id":"comment-4756","author":"anniecee","post":"Eric, I agree that the plain glass Orb is unusual. Most of the time, the iconic image of Salvador Mundi (Savior of the World) is holding a globe or some other “ball” with bands and a cross on it: which apparently has meaning for Catholics, I just don’t know what that is. The plain glass orb is unusual, and beautiful. It looks as if there are stars in the orb… To ME, it looks as if Da Vinci is saying that Christ is more than the Savior of the World: He is the Savior and Creator of the entire Universe. If that is what the artist intended, I think it’s absolutely fabulous!!.","date":"2011-11-12","mins":"10:19 am","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"},{"id":"comment-4782","author":"anniecee","post":"Yes, the Savior of the World, Ruler, King. I don’t understand why it’s drawn the way it is sometimes, with the gold bands across the top and around the middle. This is a common thing, seen in these images: And I noticed that Da Vinci’s orb didn’t have the extra accessories. I like it that way, free of manmade additions, less bound and restricted… and so pure. Although we tend to think of crystal balls and witchcraft, this pure sparkling orb wouldn’t represent anything satanic – so I do wonder what Da Vinci had in mind as he depicted it this way, and whether his image preceded the others which it apparently did, because I looked up dates of some of those, above. Seems as if the “orb” has evolved down through the centuries. This is another, similar image also done by Leonardo Da Vinci: Which shows that the Salvator Mundi shown at the top of the page isn’t the only one that Da Vinci did. The orb is a little different in that second one..","date":"2011-11-13","mins":"6:59 am","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"},{"id":"comment-4792","author":"anniecee","post":"I found another painting by Fra Angelico and the child Christ is holding a glass orb with the cross bands on it. So this symbolism is really ancient because Fra Angelico lived… 1395 to 1455 AD. Da Vinci was born 1452 AD. Well, it doesn’t really matter. I’ve been a little curious about the meaning of the globe orb cross icon but it goes so far back into ancient history that perhaps nobody knows. Da Vinci’s plain glass orb is unusual, though. I believe I read somewhere that this recently discovered painting was unfinished? So maybe he wasn’t done with the orb..","date":"2011-11-13","mins":"8:24 pm","url":"https://shroudstory.com/2011/11/10/quote-for-today-did-leonardo-paint-this/","cat":"art","title":"Quote for Today: Did Leonardo Paint This"},{"id":"comment-3554","author":"anniecee","post":"Yes, to think of the Shroud as proof of Jesus’ resurrection… it makes sense that it would have happened the way you describe it. “God has chosen foolish things to confound the wise, and the weak things, and things which do not even exist in order to bring to nothing the things that do exist, so that no flesh may glory in His Presence.” …. I think it’s amazing and amusing that a piece of cloth is so controversial, so revealing, so enlightening about what happened during the time that Christ was entombed. It is a profound statement that He was really flesh and He was really dead. And yet, he is not dead anymore. The Shroud says all these things. The Shroud has a life of it’s own, a story to tell. If it was only a dirty piece of cloth that had been proclaimed a religious relic by the will of man, I don’t think these things would be happening. There is mystery in this cloth, a mystery that points directly to Christ..","date":"2011-08-09","mins":"5:00 pm","url":"https://shroudstory.com/2011/08/09/rembrandt-understanding-christ/","cat":"art","title":"Rembrandt Understanding Christ"},{"id":"comment-3552","author":"anniecee","post":"I’m glad you elevated this to a blog post. I thought it was beautiful. Thanks..","date":"2011-08-09","mins":"4:39 pm","url":"https://shroudstory.com/2011/08/09/rembrandt-understanding-christ/","cat":"art","title":"Rembrandt Understanding Christ"},{"id":"comment-4003","author":"anniecee","post":"Ah, it’s just the feminine point of view. I think it’s amusing and I believe she was trying to be amusing. If that’s the typical flavor of that blog, it’s probably not written for a male audience. :D.","date":"2011-09-22","mins":"8:26 pm","url":"https://shroudstory.com/2011/09/22/wimpy-catholic-on-what-jesus-should-look-like/","cat":"art","title":"Wimpy Catholic on What Jesus Should Look Like"}]
