[{"id":"comment-9859","author":"anniecee","post":"I think we need to consider the crucifixion more than we have. If the Shroud of Turin truly is the “Sign of Jonah” for this generation, then what message would that “sign” be trying to tell us? To me, it means that we need to consider the true basis of our Christianity. Modern Christians have invented clever doctrines that allow us to be sub standard disciples. The Shroud shames us into remembering the example Christ gave, and the example of the Apostles after Him. Early Christians laid the foundations of our faith in devotion, blood and forgiveness. I have been collecting images of Christ’s life. Recently I put 700 pictures of the Passion in my Flickr account. Looking at so MANY pictures from that most Holy Week made a strong impact on me. Easter this year is so much more meaningful for me than ever before. Christians really love the “pretty” images: the Good Shepherd and Jesus with the Children, and all the glowing Nativity pictures. But maybe we should spend more time looking at the Shroud instead. I think if we dwell on that, and what Christ’s Passion really means, we might live very differently..","date":"2012-04-02","mins":"6:37 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9883","author":"anniecee","post":"The Seventh Day Adventist writer Ellen White thought that the Revelation to John was probably to encourage HIM (John) because he was the last of the Apostles and Christ had not yet returned although Jesus did emphasize “soon.” I thought that was an interesting “take” on it. I am not 7th Day Adventist, but I’ve read a lot of their prophecy books because they are really into it and they use scripture to back it up. But their legalistic tendencies are a little off putting even though I can see they mean well. I read an article yesterday, or part of it anyway, on CNN about the same subject you brought up: that the book of Revelation was written to encourage the early church. And Revelation is addressed to seven churches, so that’s nothing new actually. It seems to me that the PURPOSE in bringing it up in such a way is to DIMINISH it’s purpose for the current Church. And that’s where I get very annoyed. Just because some people have made the serious Error of setting dates for Christ’s return, doesn’t mean we need to diminish any part of the Bible just to settle down the wackos. I don’t agree with the silliness of setting dates or even approximate dates: in fact the Bible specifically warns against it so WHY do these fools try it over and over again? They all think they’ve got an exclusive on hearing from God, or at least they would like people to THINK they do. There’s a long list of prophecies that seem to be in the process of being fulfilled now. One that I think is especially interesting: the Catholics have an ancient prophecy that lists our CURRENT Pope Benedict as the final Pope, with possibly an imposter coming after him. This “Benedictine” Pope will be martyred while in office, according to the prophecy. I think the Catholic prophecies are interesting even though I’m not Catholic, because it’s one more thing that points to THIS time and THIS era. Meanwhile I’m going about my usual work but I’m keeping an ear open for trumpets just in case. And, like John the Baptist I think it’s important to prepare the Way of the Lord, if this is indeed the approximate time. Jesus wants us to BELIEVE Him, and so that’s what I am trying to do. I don’t want to be another Thomas, making excuses. Yes, I know that Newton was a mystic. So was William Blake. These guys were a little weird in their religious views but their heart seemed to be in the right place. Besides, they were geniuses and geniuses are always a little weird..","date":"2012-04-02","mins":"9:36 pm","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9896","author":"anniecee","post":"Well, if you **Men** want to have a Guys Only forum, why don’t you just SAY so. Max Patrick Hamon’s jab, if it truly is aimed at ME, is inexcusable and shameful. That’s not debate, it’s pure unfounded insult. And one thing I don’t understand is why this new doctrine about the book of Revelation isn’t challenged. That’s twice in two days that I’ve bumped into it. All of you seem to be mad at me for challenging it. — SO, what you’re saying is you do NOT think the Book of Revelation is relevant for the modern Church and you agree with this new theory that it’s purpose ended in the First Century? The Shroud has nothing to do with the Second Coming? If it truly is the “Sign of Jonah” then it most certainly does. And if the Shroud is the “Sign of Jonah” then maybe this Shroud blog is more for God’s purposes than you apparently understand or even care to realize..","date":"2012-04-03","mins":"5:54 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9900","author":"anniecee","post":"How do you get that out of this conversation? That’s sort of a high brow dismissal. Condescending, disapproving. I’ve seen plenty of THAT tactic: it’s a control trick, and it works pretty good in religious cults or atheist forums. Something I said rubbed you the wrong way apparently..","date":"2012-04-03","mins":"6:14 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9901","author":"anniecee","post":"I’ve Un followed this blog now so y’all can relax. ‘Bye..","date":"2012-04-03","mins":"6:17 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9907","author":"anniecee","post":"Well I’m confused about what we’re talking about. But thank you..","date":"2012-04-03","mins":"7:30 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9867","author":"anniecee","post":"Oh yes, the people who try to figure out the date for Christ’s return have got all kinds of info like that. You have to sort out the various calendars for one thing, because the Jewish calendar is different from our Roman Calendar system. And then one of the Emperors decided to coordinate everybody and they actually put an extra month in there somehow in order to get everybody on the same page. I can’t remember WHERE I read all this stuff: I was doing a lot of research on the Second Coming for awhile and those people are really INTO dates. So was Sir Isaac Newton. He was a very religious man besides being a scientific genius. He was annoyed that people kept predicting the date for Christ’s return, and then it wouldn’t happen, and it kept the populace all stirred up. So he decided he was going to figure this out once and for ALL… and he determined that the world will not last beyond 2050. He really got into the math, using Daniel and Revelation to figure it out. His notes on this were recently discovered in the Smithsonian, tucked into one of Newton’s old books. The Bible says that for the sake of the elect, God will shorten the days so I think it will be before that because I don’t want to wait that long!! Anyway, it’s all on Google. Start doing searches and you’ll find alot of very interesting things. But you can find a lot of junk too because the weirdos really go for this stuff..","date":"2012-04-02","mins":"8:46 am","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"},{"id":"comment-9879","author":"anniecee","post":"I disagree entirely that the book of Revelation was written mainly for the early church. It was been a source of hope for all generations of believers. Without the book of Revelation, how would we know that Jesus wins? Without it, we would think, as every miserable century crawls by, that Jesus has forgotten us. Without Revelation, how would we know the Vision of Jesus’ ultimate victory and display of immense power at the end of the world? How would we know that God will indeed bring every work into judgment as we stand in the fearsome throne room of the Almighty? The visuals in Revelation lift us up beyond THIS life and give us a glimpse of the Glory that is to come, as well as a better idea of how great the struggle with satan truly is. The rest of the New Testament is WIMPY compared to Revelation, which breathes the fire of judgment and the Glory of our Almighty God. Jesus was so easily beaten on Calvary, but it was by his own submission. Revelation shows us who Christ really is, and what a privilege it is to know so Great a Person. One thing that was important to Jesus Christ, over and over again, was that we should BELIEVE. Read the Gospels with that ONE thought in mind, and pick up on it! He grieved when Mary failed to believe He could help Lazarus (who was VERY DEAD), but Martha still had a grain of Faith in her so he held her elbow, lead her up to the tomb of Lazarus and whispered to her, “If you believe, you will see the Glory of God.” And, Lazarus was raised from the dead, and apparently Martha played a part in that. **You never saw that in the scriptures, I bet.** Everybody remembers Martha for one thing only. When Jesus visited the disciples in the upper room, He rebuked them because they did not believe when Mary Magdalene told them she had seen the Lord. It wasn’t Thomas only who was the Doubter! Jesus was constantly going after his disciples for their Unbelief, even after the resurrection! I don’t think we can get solid answers out of the weird prophecies in Revelation, but the book says we get a blessing just for READING that book, so if you want a blessing today: GO AND READ IT. Even if I don’t understand it, the vivid word picture of a fire breathing Christ knocking all the enemies FLAT with one BLAST is very hard to forget, and I totally LOVE IT. Bethlehem? If the Bible says He was born in Bethlehem, and if the Old Testament prophecies said he was born in Bethlehem, then I guess I’m inclined to BELIEVE IT. Not because I’m cult blind, but because I don’t see much point in what Mr. Meier has to say. Why would Herod kill all the babies in Bethlehem, if the Christ Child was actually born in Nazareth? Our FAITH is in WHO we know, not what we know. Although the Bible is very helpful, the entire book can be as baffling as Revelation. It is the Holy Spirit who keeps us on track. I agree that Sir Isaac Newton can’t be taken too literally but he WAS a respected scientist and mathematician who really dug around in Daniel & Revelation, and tried to understand it so it’s worth looking at. Mainly, I think it’s VERY interesting that ALL prophecies converge on this (current) time period so I think people would do well to be ready. The Bible says we can’t know the day or the hour, but Jesus also commanded his Disciples to be able to read the Signs of the Times and don’t be stupid about what’s obvious. (That’s my paraphrase.) Jesus wants EVERY generation to believe He is coming again when anyone least expects it: because we do live differently if we believe it..","date":"2012-04-02","mins":"7:30 pm","url":"https://shroudstory.com/2012/04/02/it-seems-appropriate-to-reflect-on-this-image-of-a-scourged-blood-crowned-nailed-through-the-wrists-and-feet-lifted-up-and-pierced-crucified-man/","cat":"news_&_views","title":"It seems appropriate to reflect on this image of a scourged, blood crowned, nailed through the wrists and feet, lifted up and pierced crucified man"}]
