[{"id":"comment-4517","author":"anniecee","post":"I’ve had doubts about Carbon Dating all along, so I’m glad to hear that it is losing its authority as a reliable scientific method. I think the main reason I’ve had questions is because of the bizarre dates that scientists throw at us, based on carbon dating. Some dates go back tens of thousands of years. And then there’s a huge leap to millions of years. I cannot remember seeing any “carbon dating” numbers that go back to 20,000 years, 30,000, or 100,000, 200,000 years etc. It seems as if all the carbon dating reports I’ve heard about will SKIP from 10,000 to millions – and nothing in between. Some of us think the Flood could account for this. Noah’s flood throws carbon dating off. If they were to factor in the Flood, and how it could skew the numbers, then maybe (probably!!) the dates would end up being very different. They also don’t consider the “canopy” that many people believe existed before the flood, where all of the earth was protected from UV rays and other harmful environmental factors that we have now. The earth CHANGED after Noah’s flood, and it was a drastic change. But of course, scientists don’t consider any of that. Even though most ethnic groups on this planet have an ancient legend of a catastrophic world flood, scientists don’t consider it to be a possibility. So the flood and the canopy are not included in calculations. I don’t know if we could figure it out, anyway: we don’t know what the earth was like before the flood so how could we make adjustments for it? But I do think we could do better than ignoring the flood completely. Maybe Carbon Dating would retain it’s Authority, if Scientists used it with these factors in mind..","date":"2011-11-02","mins":"12:50 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","title":"A Reaction to Giulio Fanti’s Suggestion"},{"id":"comment-5814","author":"anniecee","post":"An awful lot of people are really bothered by the Shroud, aren’t they. This is an interesting phenomenon in itself..","date":"2011-12-21","mins":"5:06 am","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake."},{"id":"comment-3316","author":"anniecee","post":"I have noticed, with considerable chagrin, that God has not provided us with the kind of “proof” that many demand. It would be so much easier if the Ark were found on Ararat, and the mysteries of the Shroud could be nailed down, and the actual cross upon which Jesus died had been preserved from the very beginning, just to name a few artifacts that Christians would love to place in our historic museum of “Proof.” But we don’t have much. God is looking for more than this, apparently. He’s not willing to make it easy to find the spiritual path. Besides, things which are spiritual cannot be proven by natural means anyway. And this is the really HUGE point on which the skeptic and the athiests make their error. They demand proof of what is supernatural, but they require the proof to be in Natural terms. Ultimately it comes down to the leap of faith, every time. There’s no way to avoid it. Christianity is about faith in Jesus Christ. It is about bridging what it natural in order to obtain what is supernatural. And for those of us who have taken that leap, we are not left as fools. We know Him whom we have believed, so there are no doubts. This is why the scoffing of unbelievers is so astonishing: they really don’t know what they’re talking about. But we can’t “prove” it to them, because each of us needs to take the step of faith for ourselves, individually. The journey is a personal one..","date":"2011-07-05","mins":"11:56 am","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-3319","author":"anniecee","post":"That’s a truly unique point: I love it. Perhaps “Science” could learn more about the origins of Man from this Shroud than they can learn from their huge microblaster in Switzerland. It’s quite possible! Perhaps, by denying the reality of God they shun the very Clues that God is willing to give them. :).","date":"2011-07-06","mins":"9:32 am","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-3368","author":"anniecee","post":"As a Christian since childhood, I never gave the Shroud much thought until reading the comments here. I don’t need proof, so what does the Shroud matter to me? So I think it’s fascinating that God has used the Shroud as evidence for the unbeliever, to bring people to faith. What a fantastic witnessing tool, especially for those who are more concrete in their way of thinking… such as my brother who is an engineer and a math genius. Some people have a very difficult time making the “leap of faith” because it doesn’t make sense to them. I think they have difficulty believing that spiritual things exist at all, anywhere – since it’s not in their nature to be sensitive that way. I should learn more about the Shroud..","date":"2011-07-21","mins":"5:41 am","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-3369","author":"anniecee","post":"Frankly, if the Shroud has THIS kind of influence… in my mind, this is the “proof” that it is, indeed, very real..","date":"2011-07-21","mins":"6:13 am","url":"https://shroudstory.com/2011/07/05/crazy-talk-are-atheists-biased-or-just-uninformed/","cat":"carbon_14_dating","title":"Crazy Talk: Are Atheists biased or just uninformed?"},{"id":"comment-4537","author":"anniecee","post":"“Behold a (Greek) indeed, in whom there is no guile! ” The geiger counter is terrific. And, I like this guy’s straight talking honesty. :).","date":"2011-11-03","mins":"11:08 am","url":"https://shroudstory.com/2011/11/03/modified-geiger-counters-to-measure-holiness/","cat":"carbon_14_dating","title":"Modified Geiger Counters to Measure Holiness"}]
