[{"id":"comment-52908","author":"anniecee","post":"Is it because the Shroud is less mystical, that miracles are not associated with it? Or is it because the Shroud is apart from all of them, or above and beyond all other relics? It is one thing to worship before a saint. The saint is obviously a lesser being than Christ Himself, and actually so is the miracle. Works done in the flesh of mankind are of less value than those done in the spirit of mankind. And most documented miracles are healings of some kind. John 6:63 “The Spirit gives life; the flesh counts for nothing.” The Shroud represents a spiritual work. Nobody can truly understand why the Cross of Christ is as significant as it is, or even why it was so necessary: this is something we accept by faith. In accepting it, we acknowledge God’s greater wisdom that exists in the plan of Redemption – and accept that by faith too. Since the Shroud represents this great work of Redemption, something that can’t be understood but is the essential core of our Faith in Christ: then why in the world would we expect the Shroud to be associated with something of the flesh – such as a miraculous healing? Because that’s what most saintly miracles are about is healing of physical problems. The Shroud does not represent that kind of healing. It represents a far more significant healing and a far more significant power and a far more significant wisdom than looking after the cares of this earth. I didn’t know that the Shroud was not associated with any known miracles, but it didn’t surprise me when I read that. In fact, for me, this news is actually a possible validation that the Shroud may indeed be the real thing..","date":"2013-11-27","mins":"5:19 am","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","title":"The evidence of things not seen"},{"id":"comment-55243","author":"anniecee","post":"That’s a very good observation, thank you. I realize the science is important, and I’m glad that so many are interested in it – because there are some who have come to faith because of studying the Shroud. For me, the science is unnecessary and even a bit tedious at times. I do think it’s fascinating that the Shroud tantalizes the atheists the way it does. This is amusing, IMO. God seems to be mocking the mockers. While at the same time, God in His mercy reaches out to them through the message that’s imprinted on that ancient piece of cloth..","date":"2013-12-02","mins":"6:48 pm","url":"https://shroudstory.com/2013/11/23/the-evidence-of-things-not-seen/","cat":"event","title":"The evidence of things not seen"},{"id":"comment-8139","author":"anniecee","post":"Oh, it will travel the WORLD?? That really is exciting! I thought the exhibit was only in Spain. I don’t suppose there’s any chance the Shroud itself will be there? I really REALLY like what the scholar in South Africa said about the Shroud being “The Sign of Jonah” for our generation. That made a whole lot of sense, to me. How amazing that God would push it to the forefront in these final days, to more or less shove it in the face of those who blaspheme Him. This is an unbelieving generation. I know that every age has had it’s full share of sin and trials, but I really do think the blasphemers have ramped up to a new level. And just as they ramp it up, so does God. This Shroud of Turin shows His mercy, actually. God is reaching out to those who are the most blatantly skeptical. To enter the Kingdom of Heaven, we must have the faith and trust of a little child. That’s not a copout actually: it’s very difficult for intelligent, capable adults to let go and trust God. It’s a daily exercise, a daily discipline, a daily effort in prayer and Bible study. As well as being an enormous privilege: that we can lean on God to such a degree and find our comfort in Him..","date":"2012-02-11","mins":"6:25 am","url":"https://shroudstory.com/2012/02/11/upcoming-exciting-exhibition-on-the-shroud-of-turin-in-mlaga-spain/","cat":"event","title":"Upcoming, exciting exhibition on the Shroud of Turin in Málaga, Spain"}]
