[{"id":"comment-9287","author":"anniecee","post":"Also, by the time Christ died he was extremely dehydrated, almost depleted of blood entirely. From descriptions of the crucifixion, medical professionals have determined that he died of heart failure due to extreme blood and fluid loss. Basically, Christ bled out from His many wounds: which would have made his eyes very sunken due to the extreme dehydration. The gaunt appearance that is evident on the Shroud indicates more than just a man who was slender: it also confirms the description of Christ’s death in the Gospels. The Lamb who was slain… the sacrificial lamb of the Old Testament was drained of blood. The blood was the most significant part of the sacrifice, because it was the blood that was sprinkled on the Mercy Seat in the Holy of Holies. It seems that Christ gave every last drop for our atonement, He did not spare a bit of Himself but truly gave all so that His death would be the last and final sacrifice. Also, I feel as if I need to repeat this over and over in order to UNDO the damage done by the movie The Passion: Christ was not a victim. At no time was he ever a captive of the Romans or the Jews. The scriptures make it clear that He did this willingly, that He died when He decided it was time to die and that Christ raised Himself from the dead when the 3 days were completed. Christ was not a victim!! What we see on that Shroud was done in submission to the Father’s Will. The Shroud is a monument to Holy Obedience, and it should serve as an example for all true believers of what “discipleship” truly means..","date":"2012-03-13","mins":"4:34 pm","url":"https://shroudstory.com/2012/03/13/banding-maybe-jesus-looked-different/","cat":"history","title":"Banding: Maybe Jesus Looked Different"},{"id":"comment-9288","author":"anniecee","post":"I can’t remember now why I started on that tangent… Oh yes, it’s because the writer mentioned that Christ probably looked different once you eliminate the banding in the linen. I think the linen studies are very interesting and it’s great that they help to confirm the origin of the Shroud. But do I think it’s important to remember that Christ was definitely not at his best when that image was made. Although they’ve been able to extrapolate a computer generated image from the Shroud that is quite attractive, I think the image on the Shroud may not look anything like the Christ before he was so brutalized..","date":"2012-03-13","mins":"4:41 pm","url":"https://shroudstory.com/2012/03/13/banding-maybe-jesus-looked-different/","cat":"history","title":"Banding: Maybe Jesus Looked Different"},{"id":"comment-9313","author":"anniecee","post":"“Not one of a tortured victim, but one of accomplishment.” Yes, that’s true. I hadn’t thought about it but the face does have expression. He looks peaceful, not tormented. Perhaps even “satisfied”, as if he was thinking, “I’m glad that’s over with.” A job well done. The Shroud is truly amazing, in all that it conveys. Although I had not been very interested in the Shroud before I found this blog, it would be difficult now to convince me that it is NOT the real Shroud of Christ. There is so much about the image that is authentic. And the fact that it drives the atheists crazy: well that seems like God’s sense of humor, as well as his Mercy in trying to reach out to a bunch of hardheads..","date":"2012-03-14","mins":"3:20 pm","url":"https://shroudstory.com/2012/03/13/banding-maybe-jesus-looked-different/","cat":"history","title":"Banding: Maybe Jesus Looked Different"},{"id":"comment-6897","author":"anniecee","post":"Oh, there are soooo many possibilities that I don’t think we can draw firm conclusions from the little bits of info that are in the Bible. For one thing, we know that Mary Magdalene was there at the tomb BEFORE Peter and John looked into it. She might have taken the large shroud with her!! When the man in the garden asked why she was weeping, she asked the man if he knew where Jesus body was. Perhaps she had the shroud in her hands, looking for the body to wrap it with. That fabric was valuable (all fabric was valuable in those times) and so she was hanging onto it because she needed it – and could not afford to go buy another. And perhaps it is Mary Magdalene who ended up keeping that Shroud as a memento and memorial – which somehow was saved and preserved through the centuries. Because she is so prominently mentioned in the gospel accounts of the resurrection morning, I would not be surprised if she did indeed have something to do with the Shroud. I can see how it would have happened very naturally..","date":"2012-01-13","mins":"5:23 am","url":"https://shroudstory.com/2012/01/13/have-a-think-about-it-of-linen-strips-and-the-shroud-of-turin/","cat":"history","title":"Have a think about it. Of linen strips and the Shroud of Turin."},{"id":"comment-4969","author":"anniecee","post":"That’s very interesting! Who is sponsoring this I wonder… is it the Catholic Church? No, it’s a University Event… The Spanish Center is a cultural association Sindonology therefore non profit organization that aims to study the Shroud of Turin, but also that of other relics that may be or have been scientifically studied. Jorge Manuel Rodríguez Almenar Professor University of Valencia President of the Spanish Centre Sindonology (CES) Well, if the Catholic Church does not allow access to the Shroud, what is the point? Perhaps this group hopes to influence the Church with such an event?.","date":"2011-11-24","mins":"11:18 am","url":"https://shroudstory.com/2011/11/24/international-conference-on-the-shroud-of-turin-in-valencia-next-april/","cat":"history","title":"International Conference on The Shroud of Turin in Valencia Next April"},{"id":"comment-4798","author":"anniecee","post":"It is interesting that her article states: the practice of crucifixion was discontinued BECAUSE of Jesus Christ. Constantine abolished it in 337 A.D. When the Roman Empire is mentioned, what do we think of first? Slave revolts, crucifixions, gladiator events, executions of men and women in the Coliseum, and the terrible tortures of Nero and other heartless emperors. It seems that the Romans are remembered primarily for their extraordinary cruelty. I read recently that the Gladiator competitions were discontinued due to public outcry against them. Constantine abolished the games in 325 AD, but Emperor Honorius had to abolish them again less than 100 years later. Like cockfights or dogfights, apparently it’s very hard for some people to give up their taste for violence as entertainment..","date":"2011-11-14","mins":"12:34 am","url":"https://shroudstory.com/2011/11/13/more-than-you-want-to-know-about-crucifixion/","cat":"history","title":"More than you want to know about crucifixion"},{"id":"comment-14744","author":"anniecee","post":"Hello Yannick, Actually, I don’t care much if the Shroud is real or not. It doesn’t matter to me, even though I am intrigued by it. I was only commenting on the thought that God would have left a perfect image, if it was God that did it… and no, I don’t think that’s necessary. It’s not God’s way to leave a full and complete trail to any physical evidence. It would be NICE if He would provide solid proof now and then (it would make it easier for witnessing) but God prefers to drive us to Faith instead. I am inclined to believe that the Shroud probably is real, primarily because of the interest it raises, the questions it leaves unanswered and how it tantalizes the atheists: perhaps even mocks them. And, someone pointed out that the Shroud may be the “Sign of Jonah” predicted by Jesus. These things speak to me of authenticity as much as the physical characteristics of the Shroud. I thought you believed the Shroud was real: have you changed your mind on that? Perhaps I was mistaken..","date":"2012-08-10","mins":"10:15 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-14741","author":"anniecee","post":"Oh wow, thank you for that. I have often thought something similar: that deception is God’s mercy so that their judgment will be less. I am frustrated with deception when I encounter it, but I also realize that sometimes God leaves people entangled in their deceptions out of His mercy, because of their hardness of heart. Why force them to see Truth that they would ultimately reject and thus be responsible for more sins against God? The only thing we can do is speak the Truth anyway, but it was helpful for me to understand this. You put it in a nutshell, and with a little variation. May I borrow it?.","date":"2012-08-10","mins":"8:54 pm","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-14721","author":"anniecee","post":"Hebrews 11:6 “And without faith it is impossible to please God, because anyone who comes to him must believe that he exists and that he rewards those who earnestly seek him.” It is certainly OK, (to say the least) for Christians to believe in a “supra Quantum” event in connection with the Shroud: something miraculous, as part of the resurrection AND as a result of it, AND as evidence of it… It is most certainly OK to add “faith” to the mix… IN FACT, Jesus would be disappointed in anything LESS!! He was always scolding his disciples for their lack of faith. He couldn’t understand it, and at times their lack of faith deeply grieved Him. There are those who wish to cast Doubts on anyone who believes anything: they refuse to have faith in anything. They claim to have faith in “science” but that claim shows what hypocrites they are because science doesn’t represent anything in particular and science changes it’s mind constantly as new facts emerge. Science is as wishy washy as it gets. Today coffee is good for you, tomorrow it will kill you. Butter is bad for you, butter is good for you. Same with chocolate etc etc. And unfortunately, “science” is motivated too much by money, because money pays its bills. Those who claim science as their god are copping out on reality, IMO, because there’s plenty of “evidence” that supra natural is all around us. We must not get down to the level of the Doubters and be ashamed of Faith or ashamed of miracles. Of course, it is reasonable to answer reasonable questions from reasonable people who want real answers. But the people WITH the answers should not be ashamed to embrace FAITH as part of the answer. And THAT may well be part of the MESSAGE of the Shroud: that faith is an ESSENTIAL part of solving its mysteries..","date":"2012-08-10","mins":"10:41 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-14724","author":"anniecee","post":"Besides, our thinking about “supernatural” is all messed up. If God is real, then supernatural is completely natural. Real is real. So the question regarding what’s “real” and what’s not real, boils down to whether GOD is real or not. It’s as simple as that..","date":"2012-08-10","mins":"10:54 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-14726","author":"anniecee","post":"Yannick… “Seriously, do you see God makind miraculously an image on a linen cloth that wouldn’t be perfect and complete ??? : )” Yes, absolutely. The Bible is full of incomplete ness. The Birth of Christ fulfilled all the prophecies but also revealed how fragmented the prophecies were. The Bible says that now we see through a glass darkly, but THEN we shall see Face to Face. It is the very incomplete ness that makes FAITH necessary. We must jump over all those gaps and embrace Jesus ANYWAY. Jesus’ own life was incomplete, cut off in his prime, cut short of everything that the Messiah was predicted to be. We still wait for fulfillment of many incompleted prophecies regarding the Messiah, the coming King. His death doesn’t make any sense except to those who believe: to everyone else it was a tragic brutal waste. And that’s because the Story of Jesus Christ is not finished yet, it is not completed, even though the Bible TELLS us how the Christ Story will end, it has not happened yet. If the Story of Jesus ended at the cross and the grave, there would be absolutely no reason to be a Christian. But we know there’s MORE, that’s why we follow Him. Incompleteness is everywhere in Christianity. Would God give us only a partial image? Oh, you bet He would. That’s exactly how God does things. Because FAITH is essential in order to please God, and so it’s Faith that he’s digging around for, above all else..","date":"2012-08-10","mins":"11:16 am","url":"https://shroudstory.com/2012/08/10/imagine-the-image-as-part-of-the-resurrection-and-not-the-result-of-the-resurrection/","cat":"news_&_views","title":"Imagine the image as part of the resurrection and not the result of the resurrection"},{"id":"comment-3834","author":"anniecee","post":"I agree that there is Victory in Christ. But I think modern man is almost unable to perceive what that Victory actually is. Sullivan implies it’s all about feeling better about ourselves and our origins and our potential, which I think is way off the mark because it’s a humanistic reasoning. Man centered. I think Genesis chapters 1 3 are a poetic account of creation that provides almost no details. And yet there’s a lot that can be gleaned from it, not about the HOW but more about WHY. I believe God’s heart is revealed in those chapters but not His methods. I actually believe Evolution is a waste of time. How did our earth come into being? Nobody will ever know the answers to that until we get to heaven and we can watch the home videos of God actually doing it. I suspect that everybody’s theories are off the mark. What totally annoys me about secular evolutionists is how they try to pound their theories into every new discovery, instead of appreciating the discovery for what it is. An ancient skull is very interesting, there’s no doubt about it. And even if carbon dating isn’t very accurate (which I don’t think it is), there’s still no doubt whatsoever that scientists have found some incredibly old skeletons in recent years. So of course they are fascinating. Why ruin it with all the evolutionary stupid talk about millions and billions of year and how this skeleton is nearly almost the missing piece they’ve been looking for? That’s a bunch of malarky. Even Darwin knew that his theory would never be proven, there isn’t enough fossil evidence to do that. There are some things that can be proven and other things that never will be. I think we waste time and money on some sciences that could be better spent on other kinds of research. It’s important for us to STOP and consider what is knowable, and what isn’t. People don’t seem to think of that, however, and so these ENDLESS discussions go on and on. Calvinism vs. Arminianism for example: an ancient conflict that will always be a conflict. And it’s not even important to our faith. It’s another question of HOW God does things. God doesn’t always explain the HOW. What Martin Luther fought for, now THAT is an important discussion. The Apostle Paul was the one who fought for Grace first and then Luther had to fight for it all over again. Some things are essential to Christian faith. If Sullivan’s Christian doctrine is basically sound, I’m glad to hear it. He threw me off by saying that the Tower of Babel is a myth, and I still have my doubts about him. The Tower of Babel is actually on Google Earth, the spot is easy to find and investigate. So what’s the myth? That languages developed from then on? Well, he could be right about that… Another theory is that God made it more difficult for people to UNDERSTAND one another: even though they spoke the same language they could not come to agreement or understanding. The turmoil that resulted caused them to abandon their Tower of Babel project and people scattered in various directions with everybody mad at everybody else. That’s another possibility. Is there any way to prove exactly what happened? No. We weren’t there. The foundations of the Tower are still there, however, as testimony that the Tower of Babel did exist and God’s account must have some importance for us since it’s in the Bible. So I don’t think it’s right for Sullivan to call it a MYTH. I am not likely to trust anything he says if Mr. Sullivan can’t show more respect for the Bible than that. Whether the Shroud of Turin is the real deal or not: well, that’s not exactly essential either but it’s one of those things that is just really Cool. And it’s encouraging for Believers, whether it’s the real Shroud of Christ or not. Because Christ really DID have a Shroud, and the Shroud of Turin helps us see Christ in yet another light. Regarding the current Pope, he was in charge of analyzing and clarifying and defining Church doctrine for many years. I have admired everything I have read so far, which admittedly isn’t all that much, but I really have admired his work regarding Christian doctrine. I think he’s remarkably clear headed. Which shows that the heart of the man knows how to be in tune with the mind of God. I think he’s a good Pope, even though he’s not as charismatic as his predecessor. I’m not surprised the Cardinals selected him so quickly to be the new Pope, because his work was probably well known among them. (I’m not Catholic, by the way.).","date":"2011-09-12","mins":"7:45 pm","url":"https://shroudstory.com/2011/09/12/i-am-defeated-all-the-time-yet-to-victory-i-am-born/","cat":"history","title":"“I am defeated all the time; yet to Victory I am born.\""}]
