[{"id":"comment-5183","author":"anniecee","post":"Yes, reminds me of supercalifragilisticexpialadocious. If you say it loud enough you’ll always sound precocious. I bought a book for my brother for Christmas. It’s titled, “The Superior Person’s Book of Words.” This book is so amusing I might keep it for myself… :).","date":"2011-12-02","mins":"10:11 pm","url":"https://shroudstory.com/2011/12/02/archaeocryptologically-roflmao/","cat":"image_theory","title":"Archaeocryptologically ROFLMAO"},{"id":"comment-4951","author":"anniecee","post":"St. Catherine’s monastery in the Sinai?? Wow, a clue! Why does Da Vinci always get blamed for everything… it’s gotten to the point where, if Da Vinci’s name comes up, I really don’t want to hear it because this guy couldn’t possibly have done all the stuff he gets credit for. But this monastery… maybe they should be looking into that more. Maybe it was a monk at the monastery who made the shroud. That would be more likely: some hidden monastery in some remote place with some secret monk who used to be a mad scientist chemist magician before he converted. A place so remote that the REAL truth about the Shroud could be forever sealed. Da Vinci’s workshop was far too public: people would have known. But I think the conspiracy theorists should investigate this monastery. Who knows what other relics this mad scientist chemist magician monk was able to turn out; all in the name of promoting the faith? I should write a book, I think I’m onto something… :D.","date":"2011-11-23","mins":"12:20 pm","url":"https://shroudstory.com/2011/11/23/poor-leonardo-must-be-turning-over-in-his-grave/","cat":"image_theory","title":"Poor Leonardo must be turning over in his grave"},{"id":"comment-5301","author":"anniecee","post":"So you think I’m somewhat acerebral, eh? Well, the author of the “Superior Person’s Book of Words” says that only wire haired terriers are acerebral..","date":"2011-12-07","mins":"8:51 am","url":"https://shroudstory.com/2011/12/02/archaeocryptologically-roflmao/","cat":"image_theory","title":"Archaeocryptologically ROFLMAO"},{"id":"comment-6033","author":"anniecee","post":"Those poll results are better than I expected. If 80% think it’s either a holy relic or an unsolved mystery (leaving the door open)… those are phenomenal results IMO. Shows how the New Atheists may be loud and disruptive but they’re not anywhere close to being a majority. Of course, I am “assuming” that the 14% are mostly people who are prejudiced against Christian religion. I might be wrong about that..","date":"2011-12-23","mins":"12:18 pm","url":"https://shroudstory.com/2011/12/23/surprising-live-poll-on-the-shroud-of-turin/","cat":"image_theory","title":"Surprising Live Poll on the Shroud of Turin"},{"id":"comment-5177","author":"anniecee","post":"Your point #1, that the blood marks are not smeared: no, they would have been DRY by then. Jesus hung on the cross for a time after he died, before his followers got permission to take him down and bury him. The blood would have left an imprint but would not have been “runny” by that time. Also, his disciples and the women would most likely have wiped away the worst of it, the best they could, before they laid Christ in the tomb. This is why the women returned early on Sunday, so they could finish preparing the body. They probably covered up the body lightly on Friday, just enough for decency. And brought more supplies with them on Sunday morning, to finish the job. Also, there is some indication from the crucifixion account that Jesus had almost no blood left when he died. When the soldier pierced his side and blood mixed with water ran out: medical experts say this is an indication that his blood loss was very severe. So there wouldn’t have been enough blood left in his body to be able to run, spread or smear. It was more like he was spotted with whatever was remaining of his blood — rather than dripping with it. This is consistent with the idea of the animal sacrifice where the blood was drained from the animal. It’s a gross comparison, but there’s nothing about the crucifixion that is attractive. The point is, Jesus gave up every last DROP of blood, He gave it all… showing H Is followers that He was indeed a sacrifice, a complete sacrifice, an adequate sacrifice, and a totally committed sacrifice. Jesus gave absolutely everything He had, every last DROP, in order to fully complete his mission to END the need for ANY other atonement sacrifice. As for your other points, I always find it amusing that skeptics eliminate any supernatural cause for phenomena. As if there is no such thing as supernatural. In spite of the fact that people see things, hear things, sense things that are beyond the “natural” all the time, every day. Even animals have indicated they see, hear, sense these things too, when they are happening. The stories are so abundant that IMO, they MUST be considered as part of intelligent evaluation. But atheists refuse to consider the possibility of anything beyond what is natural even though they “believe” in other invisible things such as nutrinos and electrons etc. Which, IMO, is fulfilment of the Bible verse in Romans 1:21 22 which says, “For even though they knew God, they did not honor Him as God or give thanks, but they became futile in their speculations, and their foolish heart was darkened. Professing to be wise, they became fools.” Scientists are fascinated with the possibilities of light and sound… The Bible says that God is light, and in Him is no darkness at all. It’s easy for a Believer to assume that something supernatural happened to that Shroud. It may have been Infused and supercharged with light, energy, or the elusive element of LIFE, which scientists STILL do not know what LIFE is. And if science still does not understand why LIFE is what is IS, then why is it so hard to understand there is more on this earth than what merely “natural.”.","date":"2011-12-02","mins":"7:43 pm","url":"https://shroudstory.com/2011/12/02/was-the-shroud-of-turin-created-by-gnostics-continued/","cat":"image_theory","title":"Was the Shroud of Turin created by Gnostics? (Continued)"},{"id":"comment-5300","author":"anniecee","post":"Ahem… we think it’s Jesus because the legend about THAT particular cloth SAYS it’s Jesus. It’s not like somebody made this story up last week or last year. Also, it’s quite likely that the disciples DID keep the cloth. We know that three women and two men (at least) visited the tomb that first Easter morning. They might have taken the cloth with them. Fabric was very valuable. If Jesus was still dead and his body showed up again, they would NEED it. But they never did need it. But since they did have that stained cloth in their possession, and knowing what a fuss Jesus had made about his own blood in the weeks preceding his death, they might have kept it for all kinds of reasons. As they began to understand the value of what Jesus did on the cross, it most likely became very precious to them. So… who hung onto it? One of the women? Peter? John? In the hours after the resurrection, I’m sure they must have looked at the shroud and noticed how peculiar it was. Not exactly what you’d expect from a body that had just been crucified. Perhaps the shadowy image was quite sharp to begin with. Knowing how everything about Jesus was not “normal” or “usual” … he was constantly doing miracles, constantly saying strange things about God his Father… I would imagine that they viewed the shroud as just another strange thing in a long long list of strange things that were always happening when Jesus was around. His own mother was so accustomed to this, in fact, that when the hosts ran out of wine at a wedding she just ASSUMED Jesus could fix the problem. So he did, because she asked him to. Can you imagine what it must have been like to raise a son like THAT? Sometimes I am so jealous of Mary and what she must have seen and heard during the years of Jesus’ childhood and youth. I do hope there are lots of home movies because I’m anxious to see them when we get to heaven. I think I got off on a tangent… where were we?? Oh… We think it’s the Shroud of Jesus Christ because everybody said so. And because it’s a very strange object, which would have been typical of just about anything Jesus was involved with..","date":"2011-12-07","mins":"8:42 am","url":"https://shroudstory.com/2011/12/07/why-do-we-think-it-is-an-image-of-jesus-on-the-shroud-of-turin/","cat":"image_theory","title":"Why do we think it is an image of Jesus on the Shroud of Turin?"},{"id":"comment-5205","author":"anniecee","post":"It seems that any “expert” can have a few minutes of Fame if he publishes an opinion on the Shroud of Turin. I wonder why that is?.","date":"2011-12-03","mins":"3:57 pm","url":"https://shroudstory.com/2011/12/03/when-it-comes-to-the-shroud-of-turin-he-doesnt-know-his-backside-from-a-knight-in-shining-armor/","cat":"image_theory","title":"When it comes to the Shroud of Turin he doesn’t know his backside from a knight in shining armor"},{"id":"comment-8046","author":"anniecee","post":"“I’m more inclined to think the image is miraculous in ways that we have never even imagined,” YES!! I like that statement very much. What did Jesus tell the Rich Young Ruler? He said, “Go, sell all you have, give to the poor, and you will have treasure in heaven.” But how many Christians actually BELIEVE it, and live it? We are so very EARTH bound in our thinking. I don’t have much of anything of this earth. Not by choice, it’s just worked out that way, but as a result I look forward to heaven far more than most because earth has none of my treasures, not even a family of my own. Sometimes I resent it, but other times I realize I’m very privileged to understand more about heaven than most people do. I’ve made a concerted EFFORT to store up treasure in heaven, because there’s very little else that I can do anyway. And I’m convinced that Christians don’t think about heaven ENOUGH. If we did we’d live differently. We’d change our way of living. We’d become far more compassionate and extremely LESS materialistic. Heaven is not LESS than earth. Heaven is not EQUAL to earth. Heaven is FAR more in every way. Heaven is where Jesus came from, and He could do miracles and miracles and miracles. There was nobody, EVER, like Jesus Christ. Jesus said that He would raise HIMSELF from the dead. Jesus was not a victim, He voluntarily went through the awful ordeal on Good Friday. And I think his agony in Gethsemane was NOT because he was about to be subjected to it… No, his agony was because he didn’t know if he could control himself against such blasphemy or the onslaught of demons that he would be given over to. Apparently this ordeal he faced was worse than the temptations that satan put him through, 3 years earlier. James Tissot had something interesting to reveal in his art books “The Life of our Lord and Savior Jesus Christ.” (published 1899.) When Judas brought the Roman Soldiers to the Garden and betrayed the Christ, we know that Jesus stepped forward and knocked all the soldiers down with his power. That’s in the scriptures. BUT, Tissot said that the soldiers had intended to arrest Christ AND all his disciples: that’s why there were so many of them! However, Jesus did not allow it. Jesus only allowed the soldiers to arrest Himself. And when the disciples started to fight back, Jesus healed the man that Peter wounded and put a stop to what Peter was doing. So then the disciples scattered in confusion and the soldiers returned to Jerusalem with only Jesus, because that is all that Jesus allowed them to do. I realized Tissot was absolutely right. What power, what CONTROL Jesus had over that situation! He was not a victim. He was LORD! Even as they arrested Him, Christ easily sorted things out and took control. So, if we have FAILED to see even that much in the scriptures, how much else have we failed to see about the entire Passion? There was POWER at work here which we simply can’t wrap our heads around. Whatever happened to that Shroud is not likely to EVER be explained in natural terms. That’s my opinion anyway..","date":"2012-02-08","mins":"9:02 am","url":"https://shroudstory.com/2012/02/08/why-do-we-think-the-resurrection-was-a-process-what-if-it-was-not/","cat":"image_theory","title":"Why do we think the Resurrection was a process? What if it was not?"}]
