[{"id":"comment-7738","author":"anniecee","post":"Recently they discovered a new Da Vinci. Nobody knew it existed. So that makes it a fake, BECAUSE it wasn’t documented somewhere? The Shroud is an ancient artifact, same as any other artifact. Why does he demand a paper trail? I don’t see why he’s got a beef with the discovery of the Shroud. It was lost, now it’s found. What’s the big deal. This happens a lot, and people are usually very happy to find amazing ancient things rather than GRIPING about it. I still kinda suspect that God was saving the Shroud just for us. Obviously it causes the atheists a great deal of stress, since they bring it up so often. Noah’s flood stresses them out a whole lot, too. The resurrection makes them go bonkers as well. I think we should make a list of things that ESPECIALLY drive the atheists crazy. I like to know the things that punch their buttons. :D.","date":"2012-01-31","mins":"6:21 am","url":"https://shroudstory.com/2012/01/31/bent-spoon-article-on-the-shroud-of-turin/","cat":"news_&_views","title":"Bent Spoon Article on the Shroud of Turin"},{"id":"comment-7849","author":"anniecee","post":"“I fully realize that the Bible is not a very good history book, just as it is not a good science book.” That’s an interesting statement. I like it. What kind of book do you think the Bible is? It’s not a really good handbook for religion either because it swaps focus in midstream which is kinda bizarre when you think about it. First God teaches to observe religion one way, then God changes his mind and teaches how to do it another, better way. Pretty funny when you think about it. I think of the Bible as a biography, the story of Jesus Christ as told by Himself to others. But that’s not entirely it either. Maybe it’s the Story of Faith… the thread of Faith, the heroes of Faith… starting with Faithful Noah, then Abraham and ending with the Faithful Apostles, especially John who encouraged the Believers in the 7 Churches to be more Faithful than they already were. The Bible skips around so much, from one topic to another, that’s it’s very hard to classify. Mainly, the Bible is what it is. This is what God gave us to work with and He expects us to use it. That’s the main thing: ARE WE USING IT? READING IT? MEMORIZING IT? Jump in and make it PART of our lives, that’s what we’re supposed to do with it. Well, I’m just thinking out loud. Your statement got me to thinking…. :).","date":"2012-02-01","mins":"8:11 pm","url":"https://shroudstory.com/2012/02/01/burden-of-proof-on-the-shroud-of-turin/","cat":"books","title":"Burden of Proof on the Shroud of Turin"},{"id":"comment-9693","author":"anniecee","post":"Unbelievable. And they want to get it out before EASTER? Why, because it’s so SPECIAL or because three idiots at Penguin want to SHOVE this trash in the FACES of all Christian Believers and make them CHOKE on it? Right in the midst of the most Holy of all Christian holidays? This whole thing, every bit of it, could be labeled Blasphemy..","date":"2012-03-27","mins":"10:15 am","url":"https://shroudstory.com/2012/03/27/penguin-we-wanted-to-get-it-out-before-easter/","cat":"books","title":"Penguin: We wanted to get it out before Easter"},{"id":"comment-6259","author":"anniecee","post":"I like his introduction to Thomas, which is appropriate. I want to point out that it is BECAUSE Thomas doubted that all the rest of us who believe in Jesus Christ have received a blessing, “Blessed are those who have not seen and yet have believed.” (This could be added to the list of Beatitudes actually.) I also want to point out that those who dare to BELIEVE are more blessed than those who doubt. There are many who are very proud of their Doubts and work at inventing new ones, thinking that there is wisdom in this. But the Bible says that the “Fear of the Lord is beginning of wisdom.” And, “The Fool has said in his heart; there is not God.” Thomas corrected his mistakes and died for the Lord Jesus, holding fast to faith until his death as a martyr. We need to follow THIS example in Thomas, not the other one. Personally, I am challenged by the verse in Revelation 3 that says, “I know you have little faith and yet you have kept my Word and have not denied my Name.” It horrifies me to think that I might deny the Lord Jesus and disappoint Him in such a way. I need to read the entire PDF carefully but I did skip to the end, about the Quantum Christ. I don’t know where he’s headed with that, but I’ve encountered many false doctrines which attempt to strip away the physical humanity of Christ. One theory is that the entire Bible is only an allegory: a philosophy to learn from. Another theory is that it’s all about LOVE and we don’t need to fear judgment (or hell.) All these theories (also known as false doctrines) attempt to get rid of the Crucifixion. To get rid of a God of judgment. To get rid of the ugly images of Christ on the cross. To get rid of a God who requires sacrifice from us personally. The Shroud sends us hurtling back to reality! Christ was PHYSICAL. Christ died a horrible death. Christ did not keep that Shroud but for a very short time, after that He didn’t need it. The Shroud tells us that all those THEORIES are LIES. And the Shroud reminds us once again that it is better to BELIEVE than to doubt. I collect thousands of digital images of Jesus art, ancient and recent. One day I was thinking, “I wonder which images are the ones that Jesus likes?” Immediately I knew that the baby pictures are of no interest to Him. The story that Christ passionately wants to tell is the one of His death, burial and resurrection. That was why He came, that was His huge accomplishment: and we fail Jesus if we try to belittle that in any way..","date":"2011-12-29","mins":"11:19 am","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","title":"The Coming of the Quantum Christ"},{"id":"comment-6271","author":"anniecee","post":"Ok, I did read the whole chapter carefully and I liked the whole thing UNTIL I got to the part about the Quantum Christ. He’s looking for Universal Love apparently? By blending all these philosophies together into a magic cocktail? The Bible actually predicts what Mr. Klotz is hinting at, and the quantum christ is known as: the Antichrist, the one who is a fake and a fraud and a deceiver. The angels told the disciples at the Ascension that Jesus would return in the same way He left. This will be a physical event, not metaphysical or symbolic. When it happens there will be absolutely no doubt that this is it, the real thing..","date":"2011-12-29","mins":"8:17 pm","url":"https://shroudstory.com/2011/12/29/the-coming-of-the-quantum-christ/","cat":"books","title":"The Coming of the Quantum Christ"},{"id":"comment-3516","author":"anniecee","post":"I get daily email devotionals from Joni, another person who is a quadrapalegic and is, therefore, severely handicapped. Not that the handicaps of Joni or Hawkins qualifies them as an authority on God, but I find the contrast between these two personalities to be stark and opposite to the extreme. Joni is just as convinced of God’s existance as Hawkins is convinced of the opposite. Her daily messages not only encourage faith in God but they also strongly encourage Discipleship, which is the discipline of making your actions line up with the example of Christ. Joni is a hard core Believer, just as Hawkins is a hard core Unbeliever. Both people are famous. Both are respected. So, which one is right? IMO, I think it’s very sad that Hawkins has had to endure all these years of suffering without God’s help and comfort. I wonder if there is some bitterness that feeds his denial of God? Is there some resentment, is this how he lashes out at a God who so confined him to such an awful disease? I can’t help but wonder, because why does Hawkins need to bring it into the discussion at all? What does it MATTER, if God does not exist? Keep God out of it, if THAT is what you believe. It’s interesting, to me, that athiests seem to enjoy talking about God and the Bible even more than Christians do. I really doubt Hawkins is as dedicated to athiesm as he thinks, or he would not feel compelled to convince himself so often and so vehemently..","date":"2011-08-04","mins":"6:29 pm","url":"https://shroudstory.com/2011/08/04/hawking-to-appear-on-the-discovery-channel/","cat":"science","title":"Hawking to Appear on the Discovery Channel"},{"id":"comment-9742","author":"anniecee","post":"Thank you for that! We will put it on our calendar..","date":"2012-03-29","mins":"6:17 am","url":"https://shroudstory.com/2012/03/29/the-real-face-of-jesus-airs-good-friday/","cat":"video","title":"The Real Face of Jesus Airs Good Friday"},{"id":"comment-3865","author":"anniecee","post":"I found this video that explains about the Video. From Good Morning America: they took the image to the streets to find out what people thought about it. Maybe you’ve seen this already, but I’ll post it anyway. It’s kinda fun to watch: http://abcnews.go.com/GMA/video/face jesus revealed 10248139.","date":"2011-09-15","mins":"12:37 am","url":"https://shroudstory.com/2011/09/14/real-face-of-jesus-dvd-on-sale-at-the-history-channel-shop/","cat":"video","title":"Real Face of Jesus DVD on Sale at the History Channel Shop"},{"id":"comment-3429","author":"anniecee","post":"What I’ve noticed is there’s a whole bunch of young men in the current generation who want to style themselves as agnostics or athiests and think of themselves as philosophers. And they are incredibly BAD at it. They don’t have their facts straight. They are not actually interested in learning anything, they mostly like to swagger. That’s the way it seems to me, anyway. They think of themselves as superior because they question everything. However, they don’t have anything to offer. What they offer is a lot of Doubts about anything they don’t like. They’re skilled in offering criticisms and blasphemous doubts and that’s about all they’re good at. They’re not builders, they are destroyers. Catherine Marshall wrote an interesting phrase in her book, Christy. “Any fool can destroy but it takes a real man to build.” I think such young men should settle down and get real. If they are TRULY interested in finding TRUTH, then join those who are digging for it instead of scoffing and mocking on the sidelines. IMO..","date":"2011-07-26","mins":"2:53 pm","url":"https://shroudstory.com/2011/07/26/%e2%80%aaan-invitation-to-discuss-the-shroud-of-turin-youve-got-to-be-kidding/","cat":"video","title":"‪An invitation to discuss the Shroud of Turin. You’ve got to be kidding."}]
