[{"id":"comment-24280","author":"tom_devins","post":"We could argue forever over the Church’s response science. But, the cold hard fact remains, ordinary people have been able to avoid “returning to dust” , the last such incident taking place in September, 1998 in Tibet. The next most recent incident took place in 1955. Before that it was 1948. The Catholic Church, through Father Francis Tiso’s on site investigation, has confirmed the most recent incident. (See Father Tiso’s web site to learn of his substantial credentials). How come I don’t hear about it from the pulpit on Sunday morning? “…to dust thou shall return…..but only if you so choose.” The incident sends shock waves through the entirety of Christian thought, undermining the notion of Original Sin all the way to the Resurrection on the last day. If the Church is so progressive in dealing with new revelation, when can I expect a response? How much longer will this vital piece of salvation information continue to gather dust in the Vatican library?.","date":"2013-02-14","mins":"4:11 pm","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","title":"Ash Wednesday 2013"},{"id":"comment-24235","author":"tom_devins","post":"It is not inevitable that our earthly remains shall return to dust. The Rainbow Body adepts in the Buddhist tradition, the Tamil Siddhas in Hinduism and Enoch, Elijah, Moses, Jesus and Mary in the Christian tradition (not to mention over 100 accounts of incorrupt bodies) all avoided “return to dust.” How? They took lifestyles of love (promoting happiness), compassion (eliminating suffering) and ascetic values to the extreme. They walked the walk. The words on Ash Wednesday, “….to dust you shall return” need to be modified to say, “….to dust you shall return, provided you so choose.” We are all spiritual entities seeking a human experience and not the other way around. Death and decay are the result of the spiritual us being overly caught up in the material world causing us to lose our way. As it turns out, the Essenes and Gnostics were right after all. Today’s faithful would categorically reject that message because it tampers with otherwise plush and comfortable lifestyles and membership would decline as would the proceeds in the Sunday collection plate. But, the facts are the facts are the facts. We all have free will and can have an opinion about anything one wishes to opine about. But, you cannot have an opinion about fact. The human mind as a serious defect. It can’t take a joke. So, if you keep saying something over and over it will accept it as fact no matter how wrong it might be and the conscious self will act accordingly. Politicians have known about this defect for eons and fully take advantage of it at the peril of the unsuspecting. We need to stop accepting the certainty of death and decay. Death and decay are alternatives, not fate. Lets face it; Adam and Eve are corporate characters, it is not possible to build a boat that will hold two of every creature (let alone find two of every creature) and God is not a man that lives up in the sky, having a son but not being married, and he does not have a super computer that keeps track of every deed, good and bad, that his subjects commit. The sooner we admit to these things the better off the world will be. The first step is to stop saying it. The only way to cure a broken leg is to recognize that the leg is broken. And, while churches may be full from time to time, the fact is in the U.S. 30% of the people raised Catholic leave the Catholic faith before their late 20’s. My impression is that a similar thing is happening in Europe. Were it not for the influx of Mexican immigrants the US Catholic population would be in serious decline. On top of that, almost 50% of those who claim to be Catholic practice the “cafeteria” version of the religion. They freely choose their personal preference on a variety of key issues, such as Original Sin, abortion rights, gay marriage, Mary’s virginity, transubstantiation and even the divinity of Jesus. About 40% of U.S. Christians believe in reincarnation and another 25% remain open to the possibility. The notion of Jesus’ second coming and the faithful being raised on the last day has been relegated to myth and metaphor. The Church has lost control of the congregation. The faithful speak proudly of the way the Church has held steadfast to its 2,000 year old traditions. I stand disappointed, even embarrassed, in front of my non Catholic friends, that this powerful institution has arrogantly refused to update its teachings and bring them inline with modern advances in Biblical scholarship, archaeological discovery, quantum physics, East West dialogue and social understandings. Ask the Dali Lama what he would do if science proved Buddhist teaching to be in error and he would say “change the teaching”. Ask the Pope what he would do if science proved Catholic teaching to be in error and he would say, looking down his nose on the questionnaire, “Sonny (or young Lady) we are the truth, science is wrong.” Speaking of truth, truth be known, the Church is so culturally invested in what it says and does that it cannot change and preservation of its priestly structure has taken priority over propagation of the truth and mediating salvation. The new Pope has a lot of work to do..","date":"2013-02-14","mins":"11:05 am","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","title":"Ash Wednesday 2013"},{"id":"comment-24141","author":"tom_devins","post":"Ash Wednesday…..”and to dust you shall return”. In September, 1998 the Buddhist monk Khenpo A Chos passed from this world by dissolving his body into a stream of light leaving nothing behind except the burial clothes. Called the Rainbow Body, he followed in the footsteps of the thousands of practitioners, ordinary people like you and me, who preceded him, all of whom exemplified the ultimate in love, compassion and abstention from indulgences of all types in their earthly lives. Kind of adds new meaning to the words used at Ash Wednesday services. Perhaps the words should be amended to say “…..but only if you so choose.”.","date":"2013-02-13","mins":"8:41 am","url":"https://shroudstory.com/2013/02/13/ash-wednesday-2013/","cat":"event","title":"Ash Wednesday 2013"}]
