[{"id":"comment-118599","author":"tom_devins","post":"“Two revolutionaries were crucified with him, one on his right and the other on his left.” Matthew 27:38.","date":"2014-05-13","mins":"11:01 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118061","author":"tom_devins","post":"Point of order. The two men who were crucified with Jesus were not thieves. Romans didn’t crucify people for robbery; only insurrection. They were revolutionaries. The Greek word for robber is lestes but is also translated as brigand or insurrectionist. Interestingly, when Jesus is arrested in the Garden He asks if the mob came to seize him as a “lestes”. But here the word gets translated as robber. The same word, “lestes” is used to describe the two men, but here it gets translated as revolutionary. It appears that the Gospel writers sanitized the story of the arrest in order to gloss over the true reason as to why He was crucified..","date":"2014-05-12","mins":"5:15 pm","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118249","author":"tom_devins","post":"The were insurrectionists as was Jesus. Saying “The Kingdom at God is at hand” sends a clear message to Temple and Roman authorities that your days are numbered. A new king has arrived. I think he knew the consequence of His actions..","date":"2014-05-12","mins":"10:30 pm","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"},{"id":"comment-118562","author":"tom_devins","post":"Thanks. I didn’t know that. I just bought the book. I still think He met the test as a revolutionary, one who seeks to undermine authority. Non observance of the Sabbath, dining with the unacceptable, even healing, a job reserved for the Temple priests, set the tone for His ministry. He had a large following and taught them that this type of behavior was OK..","date":"2014-05-13","mins":"9:31 am","url":"https://shroudstory.com/2014/05/12/the-slanted-footrest-of-the-orthodox-cross/","cat":"history","title":"The Slanted Footrest of the Orthodox Cross"}]
