[{"id":"comment-24705","author":"tom_devins","post":"I have communicated to Father Tiso by e mail and hope to solicit his help in bringing the Rainbow Body phenomenon to light in the form of a video and/or book. He currently lives in Rome. The phenomenon is real and he most certainly confirms its authenticity. Other Rainbow Body adepts include; Dilgo Khyentze Rinpoche (1992), Togden Ugyen Tendzin (1962), Ayu Khandro Dorje Peldron (1953), Khenchen Tsewang Rigdzin (circa 1953), Yilunga Sonam Namgyel (1952), Pema Dudul (1872), Milarepa (1135), Padmasmbhava (8th century) and in later antiquity, dates uncertain: The Ancient Kings of Tibet, Mamkel Nyingpo and the Eighteen Tamil Siddhas (H Indu). There are more. Those identified were enough to satisfy my needs and I have researched their lives in enough depth to be able to correlate lifestyle with the strange deaths they incurred. I have interviewed a prominent Buddhist scholar who also confirms the phenomena. It is a real thing that happens to ordinary people who choose to walk the difficult walk and not just talk the talk as most of us everyday people do. It is time for the Church to fess up..","date":"2013-02-18","mins":"12:48 pm","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper"},{"id":"comment-24690","author":"tom_devins","post":"I have comment on this before but can’t seem to get recognition or rebuttal. In September, 1998 the Buddhist Monk Khenpo A Chos acquired Rainbow Body. At death (if in fact he ever stopped breathing) over a period of seven days his body proportionately shrunk to the point that it finally disappeared. The shrinkage was accompanied by the display of multi colored radiation, hence the name Rainbow Body. It is also referred to as the Light Body and the adepts, of which there are thousands, also have the ability to re materialize in the confines of space and time. The phenomena occurs also occurs in the Hindu tradition and reminds us too of the strange deaths of Enoch, Elijah, Moses, Mary and Jesus. Father Francis Tiso (who has impeccable scholarly credentials) visited Khenpo A Chos’ hermitage at which the disappearance took place and confirmed its authenticity. Google his name and read for yourself. All the adepts from contemporary to antiquity had one thing in common; lifestyle of love, compassion and asceticism taken to the extreme. These are virtues that we can also assign to the Old and New Testament figures who experienced Rainbow Body like deaths and are available to every living creature that chooses the path. These qualities, taken together, result in the absolute destruction of ego. Said another way, they indicate the cessation of observation of self. From quantum physics (i.e. The Thomas Young Double Slit Experiment) we know that in the atomic realm, when human consciousness ceases to observe something, that something ceases to exist. It returns to the realm of invisible wave, formless and everywhere at the same time, releasing the energy that it held when it existed in form and substance. The most plausible explanation for the image on the Shroud is that Jesus achieved Rainbow Body and the burst of radiation that followed produced a scorching effect on the burial cloth. This conclusion is a bitter pill to swallow as it sends shock waves through fundamental Christian thought, from the alpha to the omega, the story of creation to that of resurrection of the body. For sure, whether one imputes Rainbow Body to Jesus or not, the words in Genesis “to dust you shall return” need to be appended with the words, “but only if you so choose.” And once you do, it is all downhill from there for the Christian theologian..","date":"2013-02-18","mins":"10:46 am","url":"https://shroudstory.com/2013/02/18/one-handed-clapping-for-colin-berrys-criticism-of-the-colorado-paper/","cat":"image_theory","title":"One Handed Clapping for Colin Berry’s Criticism of the Colorado Paper"}]
