[{"id":"comment-127749","author":"tom_devins","post":"I find Barrie Schwortz’s defense against religious bias incredulous. Mentioning the religious representation on the team he says, “Never mind that our team included three Jewish members (Al Adler, Don Devan and me), one Mormon, one Evangelical, several Catholics, several Protestants and some avowed atheists and agnostics.” Notably absent on the team is the Buddhist Master. No matter, I guess, that Buddhists (and Hindu’s) have been vanishing from planet earth in a blast of radiation, all well documented, for thousands of years. It is a foundational article of their beliefs. The last incident occurred in September, 1998 and was thoroughly investigated and found authentic by the Catholic Church. The Buddhists have much to add in the matter of image formation yet the “team” steadfastly avoids soliciting their input. What is wrong with this picture?.","date":"2014-06-08","mins":"8:44 am","url":"https://shroudstory.com/2014/06/08/answering-charges-of-pseudoscience-bias-and-more/","cat":"news_&_views","title":"Answering Charges of Pseudoscience, Bias and More"},{"id":"comment-20361","author":"tom_devins","post":"The image on the Shroud was created when Jesus’ body dissolved into a stream of radiation, creating a photographic negative on the cloth. Called the Rainbow Body, it has occurred thousands of times in the past in the Tibetan Buddhist tradition, the most recent being in September, 1998 by the Buddhist monk Khenpo A Chos. Other examples of Rainbow Body in the Christian tradition are Enoch, Elijah and possibly Moses. The non cannonical reports of Mary’s death, called the Assumption, indicate that she too acquired Rainbow Body. In late August of 1998, A Chos told his disciples he was going to leave this world. Without signs of any illness he passed peacefully and comfortably while chanting a mantra. Following Buddhist tradition his body was covered in a yellow cloth whereupon it was noticed that his now unwrinkled skin had turned a soft, pinkish color. As days passed his body continually shrank to childlike proportions until finally, on the seventh day, it completely disappeared. During this seven day period outsiders noted a display of rainbow colored radiation coming from the burial hut. The truth is, something very significant and natural happens to the human body when it is exposed to a lifestyle of selflessness and love and compassion to others, all taken to the extreme and demonstrated in an unwavering commitment to a virtuous cause. Such a lifestyle is the common denominator among the Rainbow Body adepts. A human body that vanishes into mid air seems miraculous. However, when viewed from a quantum perspective it all makes sense. Quantum particles of which we (and everything else in the universe) are made cannot exist unless they are observed through human consciousness. Now, one can have an opinion about anything except one cannot have an opinion about fact. And, that atomic particles do not have an independent existence is a proven fact. So, if an atomic particle can be brought into existence by observing it then it necessarily follows that it can be made to disappear by not observing it. And that is exactly what the Rainbow Body adepts do; they stop observing (and catering) to self through extreme asceticism and compassion for others. Atomic particles are nothing more than vibrating energy. So, when they cease to exist the vibrating energy is released into the surrounding area. Jesus’ death was the most spectacular Rainbow Body of them all for his body dissolved in less than thirty six hours while most dissolutions take place in seven days. Thus, the energy that was released as H Is body dissolved was released in a much shorter period of time producing a high intensity radiation. Italian researches at the National Agency for New Technologies have confirmed that linen cloth is sensitive to high intensity radiation. The short nature of His release compared to other adepts confirms Him to be the greatest manifestation of the divine the world has ever seen. And the thing about it is, the Rainbow Body adepts have no special skills or traits. We all come from the factory with the same factory installed equipment. The adepts knew how to bring forth the spiritual component better than most. The question each person has to answer is, “how spiritual do I want to be”? “How much material lifestyle do I want to sacrifice in order to bring forth my innate spiritual nature”? Even though the Catholic Church has studied the strange death of Khenpo A Chos you don’t hear much about it. For its implications are far reaching. It questions the claim of divinity that early Church fathers made on Jesus. Without question the greatest human to ever live, the operative word is “human”. Human yes, divine no. And when that claim is removed the virginity of Mary comes under the microscope, then the notion of original sin and so forth. And the walls come tumbling down. As the Catholic Priest who conducted an on site investigation of Khenpo A Chos death said, “we may have done a number on the flock.” For sure, the words in Genesis, “…and to dust thou shalt return” need to be appended with the words “but only if you so choose.”.","date":"2012-12-13","mins":"11:15 am","url":"https://shroudstory.com/2012/12/13/livescience-goofs-again/","cat":"uncategorized","title":"LiveScience Goofs Again"},{"id":"comment-26894","author":"tom_devins","post":"The quinnipiac poll, like all other polls, failed to ask THE question. Do you believe in karma and reincarnation? Well over 1/2 the world does. The answer makes a huge difference in one’s life. Its one thing to commit a little indiscretion in the hear and now with the understanding that eventually an all loving merciful God will hold you responsible in the here after. It is another to realize that you will need to correct it the next time around in a worldly setting, hopefully in a human body suit. Belief in reincarnation would shut down the travel industry; the notion of a “bucket list”, so prevalent in the thoughts of the seniors who believe you only get one shot at this world, would disappear. Karma and reincarnation are trump cards in the game of human behavior. It is the only question that really needs to be asked..","date":"2013-03-09","mins":"10:25 am","url":"https://shroudstory.com/2013/03/09/but-they-didnt-ask-about-the-shroud-of-turin/","cat":"news_&_views","title":"But they didn’t ask about the Shroud of Turin"},{"id":"comment-69830","author":"tom_devins","post":"I’ve followed your blog for several years now and it seems to me you are unduly biased, to a fault, toward scientific inquiry. Three key disciplines are missing from the Shroud research teams; 1) a Buddhist Master who understands the practice of Dzogchen and the Buddha’s teachings on Emptiness and the Nature of Mind, 2) a bold, open minded, free thinking Christian theologian to reframe Jesus’ teachings in an Eastern context so that we will know truly who He was and what he taught, and 3) a cell biologist who can can explain why human cells dissolve into their atomic elements (emitting radiation) when exposed to a blood stream that is totally empty of emotion chemicals when all sensory experience ends. Human bodies have been disappearing in a burst of radiation for thousands of years. For sure we know that the words of Genesis 3:19, “You are dust and to dust you shall return” are wrong. They need to be appended with the words, “….unless you so choose.” And, with that change the doctrine of Original Sin and the walls of Christianity come tumbling down. A practicing Catholic for almost 74 years I fear for my religion. It is teetering on the precipice. For years now we have recognized the Shroud as the great evidence in support of Christian teaching. As it turns out, it is its undoing. And therein lies the true roadblock to understanding..","date":"2013-12-29","mins":"11:07 am","url":"https://shroudstory.com/2013/12/29/questions-questions-everywhere-and-not-one-on-the-shroud-of-turin/","cat":"news_&_views","title":"Questions, Questions Everywhere and not one on the Shroud of Turin"},{"id":"comment-79128","author":"tom_devins","post":"Dr. Paolo Di Lazzaro of Italy’s National Agency for New Technologies was able to create many of the Shroud’s body image characteristics by exposing a linen cloth to short, intense bursts of radiation. Most of the Rainbow Body events I know of involve a release of radiation in the visible spectrum; hence the word “Rainbow.” Shardza Gyalteson (1859 1935) died with a Rainbow Body. His followers, fearing loss of relics, interrupted the dissolution process only to find a body the size of a one year old child suspended three feet of the ground wrapped in an envelope of light. The Old Testament prophet Elijah left this world in a whirlwind accompanied by a flaming chariot. In Matthew 28:3 we read that an angel descended to Jesus’ tomb and his (the angel) appearance was like lightening. I think the radiation comes about as the atoms which make up the body revert to their native, low energy state in accordance with the laws of Quantum Mechanics. Atoms are in reality dense energy which gets released in the dissolution process..","date":"2014-02-13","mins":"6:53 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-78998","author":"tom_devins","post":"Google the name “Khenpo A Chos” and you will begin to understand the Shroud is not nearly as mysterious as it is made out to be. If my paper, “Beyond Contemporary Thought” gets accepted I will explain it to you this Fall at the St. Louis conference. An alternate title could be “Where East Meets West.”.","date":"2014-02-13","mins":"9:17 am","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79201","author":"tom_devins","post":"Elijah didn’t need a chariot. He vanished in a shower of radiation which the scripture writer described as a fiery chariot. Belief is a huge modifier of perception..","date":"2014-02-13","mins":"10:40 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79380","author":"tom_devins","post":"Indicative of what? Father Tiso told me (e mail) that funding dried up. As best I can tell, his initial inquiry was funded by the Institute of Noetic Sciences. IONS is the creation of former astronaut Edgar Mitchell to investigate the paranormal. It is Mitchell’s response to some pre planned clairvoyance experiments he was conducting in outer space. The people at IONS tell me their paranormal research program is floundering ( the retreat center is flourishing) because of an overall lack of interest by the public in general. There is a persistent “so what” attitude that is slowing them down. I can assure you Father Tiso is very much convinced of the reality of the Rainbow Body. As you might expect he is reluctant to compare it to Jesus’ resurrection as the phenomenon potentiality undermines fundamental Christian philosophy. A life long Catholic (73 years) I am not as inhibited. If it looks like a duck, walks like a duck and talks like a duck, then, in all probability, it is a duck. As a presenter, I am looking at the upcoming St Louis Shroud conference as my coming out party. In fact, I am considering organizing a Shroud conference on my own. It will be a joint Buddhist Christian endeavor called WHERE EAST MEETS WEST..","date":"2014-02-14","mins":"12:39 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"},{"id":"comment-79063","author":"tom_devins","post":"I’ve identified some 30 incidents of Rainbow Body in the Buddhist, Hindu and Taoist religions. When you study the Eastern doctrines of Emptiness and Nature of Mind and combine them with the core principles of quantum science you find an interesting connection. The Rainbow Body casts a cloud over the Christian doctrines of Original Sin and Resurrection. It is an accepted, matter of fact phenomenon in Himalayan countries. Lest we forget, Biblical heroes Enoch, Elijah, Moses and Mary, in addition to Jesus, all left the planet in very unusual ways. For whatever reason, lives filled with wisdom, love, compassion and detachment cause something strange to happen to human body cells. Witness the 250+ incorruptible bodies found in the Catholic tradition. Here’s hoping I get the opportunity to elaborate on all of this in St. Louis in October..","date":"2014-02-13","mins":"2:55 pm","url":"https://shroudstory.com/2014/02/13/what-things-would-not-be-known-until-800-years-into-the-future/","cat":"news_&_views","title":"What things would not be known until 800 years into the future?"}]
