[{"id":"comment-24274","author":"tom_devins","post":"I am strongly offended that anyone would summarily and insultingly dismiss another person’s ideas, calling them “goof ball”, in face of a large body of supporting evidence. It makes me wonder who is the real “goof ball” in the dialogue. I don’t know, nor does anyone know with certainty, where Jesus is buried… if He is buried at all. The connection between East and Christianity is a lot stronger than most people realize. In the East’s ancient structures we find an abundance of Greco Roman architecture. There are lot of people in the East who believe Jesus’ tomb is in Kashmir and have located and revere it. Murree beer in Pakistan is named after Mary. According to the Pakistanis her grave is located in their country. The names Abraham and Sara are curiously similar to the names of the Hindu God Brahma and his wife Sarasvati. Hebrews eat beef but do not worship cows. Hindu’s worship cows but do not eat beef. After all, the Messiah’s job description included the duties of gathering in the lost tribes and a trip to the East would be of necessity. The 4,000 mile Silk Road from China to Alexandria was an active avenue that blossomed with trade and cultural exchange. That is what traders do when the merchant deal is completed; they celebrate over a beer or two and exchange ideas. You know, Abraham did dispatch some of his sons to the East. St. John Chrysostom in his Homily 26 from The Homily of Hebrews tells us the bones of Moses were laid in a strange [East] land. The seraph used by Moses for healing (Numbers 221:8) is taken straight from the ancient Buddhist Hindu practice of Kundalini Yoga. What is “goof ball” is to believe that an unbelievably talented thirteen year old kid could stand toe to toe with Temple scholars debating scripture and then spend the next seventeen years of His life in the boon docks of Nazareth, “growing in strength and wisdom” while happily working away in his father’s carpenter shop; a whistle while you whittle kind of upbringing. If Jesus didn’t die in the East could he have spent time there? Occult skills, like food multiplication, healing and so forth are acquired and emerging skills available to saintly people and in the ancient East there were many schools for that purpose. The great Buddhist Saint Milarepa attended one and acquired magical skills which he used to extract revenge against his family’s enemies. Moses had them and used them effectively against the Pharaoh. What is equally “goof ball” is to not ask the question, if Jesus acquired the resurrected body He is said to have acquired, then why did the stone need to be rolled away from the tomb? Doors, walls and grave stones don’t mean anything to spirits. If the full Sanhedrin had voted on Jesus’ fate the vote would have been 69 to 2 in favor of executing him. The abstainers…..Nicodemus and Joseph of Arimathea. Did Joseph of Arimathea, wealthy and influential as he was, work a deal with Pilate? After all, Pilate’s wife advised against the guilty verdict because of a dream she had. Pilate did what He did, at least in part, in order to avoid a riot in a population that was swollen because of the Passover Feast. How come Jesus died so quickly on the cross? Death from crucifixion could take days. Why is it the two thieves were alive at the end of the day but not Jesus? Can blood gush from the wounds of a dead man? Why wasn’t His body dumped into a heap along with the bodies of the two thieves (and their broken legs) to be consumed by scavenging creatures as was the practice? Why weren’t His disciples and relatives rounded up, their wealth confiscated and then sold into slavery as was Roman practice? When one man and a small army revolted in Sepphoris in 6 AD, the then capital of Galilee with a population of 30,000, the Romans crucified 2,000 men, sold the residents into slavery and burned the city to the ground. The Romans were brutal. Perhaps a deal was struck between Joseph and Pilate. Just maybe, just maybe, Jesus wasn’t dead when taken from the cross. Maybe after all he didn’t refuse the soothing “medication” that was offered to Him at the outset. Maybe the image on the Shroud was created in the same fashion as the one He deposited on the veil of Veronica while He was alive. Maybe the gospel writers, in their enthusiasm for promoting their brand of Christianity, got carried away with their work. Who knows? Who will ever know? The facts and reasonable (but unanswered) questions at least suggest other possibilities for explaining Jesus’ death and resurrection. Where there is smoke there is usually fire. Lets be more accepting of the opinion of others and stop from calling “goof ball” those who have legitimate concerns and the courage to raise them..","date":"2013-02-14","mins":"3:50 pm","url":"https://shroudstory.com/2013/02/14/the-evidence-strongly-suggests-nothing-of-the-kind/","cat":"books","title":"The Evidence Strongly Suggests Nothing of the Kind"},{"id":"comment-24441","author":"tom_devins","post":"You know, I just don’t know. I have ordered Silvia’s book because I am interested in the subject. Last September I had the privilege of sitting next to a thirteen year old boy named Norpa Rinpoche at the Buddhist Drikung Monastery about 50 miles from Lhasa. He is said to be the reincarnate of the monastery’s abbott who passed away 30 years ago. Being the ignorant, uninformed Westerner that I am I asked his superior, “how do you know?” Reincarnation is such an accepted belief among Easterners that the question is just not asked. It is not a belief; it is a way of life. At age 3 Norpa Rinpoche identified the home in which the deceased abbott was born. At age 7 he picked out the abbott’s personal effects from an assortment of the personal effects of others, all mixed together randomly. I was told that a review of the deceased’s writings also pointed to Norpa Rinpoche as his reincarnate. The Tibetan Buddhists are closely monitored by the Chinese who, among other controls over Tibetan religious expression, require that all reincarnates be approved as such by the government. After documenting the case the Chinese approved Norpa Rinpoche as a reincarnate. For me personally, while I am not quiet sure if reincarnation is real of not, I can’t afford to be wrong. If I do return I want to bring as much of what I have learned in this life back with me and am living accordingly, making sure that I have sufficient mind control to deal with the barrage of thoughts that will hit me when that last breath is taken. My Christian belief that you get one and only one shot at life gave rise to a “bucket list” and the need to cram as much worldly experience as I can into my one and only lifetime. Needless to say, the first think to hit the trash can in my preparation for death(I am 72 years young) was my bucket list, replaced by meditation exercises. I am afraid the Western travel and entertainment industry would be devastated if everyone adopted reincarnation..","date":"2013-02-16","mins":"10:31 am","url":"https://shroudstory.com/2013/02/16/tinfoil-hats-all-around-quickly/","cat":"books","title":"Tinfoil Hats All Around, Quickly"}]
