[{"title":"430 Wikipedia Articles Mention the Shroud of Turin","post":"It seems to be placed in front of a sort of beginning for the “Encyclopedia of the Shroud”.\nBy the way: I remember the book of Dr. Mario Cappi that I bought many years ago (in Milan), he proposed a sort of dictionary, “La Sindone dalla A alla Z” = “The Shroud from A to Z” …\nIn any case those links lead to some very interesting information … \nBut I would go back to the problem previously reported …\nHow can you recognize an ancient linen fiber from a less ancient?\nFrom what you could start to try to solve that problem?\nEngineer Giulio Fanti indicated three methods…\nNow, going beyond the criticism about the “mechanical dating” model, I would like to point out a study: \n“Signature of ageing: correlations with behavior”, by Paul Wyeth \nlink:\nhttp://core.kmi.open.ac.uk/download/pdf/32055.pdf \nand then … it is important to understand the microstructural modifications\nthat can occur on natural fibers ageing …\nSee also : the controls on CNC (Cellulose Nano Crystals), on cellulosic DP (Degree of Polymerization), etc.\nIn short, I suggest you return to my old obsession: the SPM analysis (on linen fibrils\nand thin layers)…\nAny comment ?\n\n","date":"October 23, 2014 at 8:49 am","url":"https://shroudstory.com/2014/10/23/430-wikipedia-articles-mention-the-shroud-of-turin/","cat":"article","id":"comment-164865","author":"piero","site":"shroudstory"},{"title":"430 Wikipedia Articles Mention the Shroud of Turin","post":"In other words: we require a careful study designed to correlate (using SPM controls) the degree of polymerization (DP) [and CNC content / morphology of microfibrils] of the ancient linen fibrils with the epoch…\n\n","date":"October 23, 2014 at 9:28 am","url":"https://shroudstory.com/2014/10/23/430-wikipedia-articles-mention-the-shroud-of-turin/","cat":"article","id":"comment-164871","author":"piero","site":"shroudstory"},{"title":"430 Wikipedia Articles Mention the Shroud of Turin","post":"BIBLIOGRAPHY\nHere a bibliographic reference about the Metrology:\nDevelopment of the metrology and imaging of cellulose nanocrystals\nby\nMichael T Postek, András Vladár, John Dagata, Natalia Farkas, Bin Ming, Ryan Wagner,\nArvind Raman, Robert J Moon, Ronald Sabo, Theodore H Wegner and James Beecher\nAbstract:\nThe development of metrology for nanoparticles is a significant challenge. Cellulose nanocrystals (CNCs) are one group of nanoparticles that have high potential economic value but present substantial challenges to the development of the measurement science. Even the largest trees owe their strength to this newly appreciated class of nanomaterials. Cellulose is the world’s most abundant natural, renewable, biodegradable polymer. Cellulose occurs as whisker-like microfibrils that are biosynthesized and deposited in plant material in a continuous fashion. The nanocrystals are isolated by hydrolyzing away the amorphous segments leaving the acid resistant crystalline fragments. Therefore, the basic raw material for new nanomaterial products already abounds in nature and is available to be utilized in an array of future materials. However, commercialization requires the development of efficient manufacturing processes and nanometrology to monitor quality. This paper discusses some of the instrumentation, metrology and standards issues associated with the ramping up for production and use of CNCs.\nLink:\nhttp://iopscience.iop.org/0957-0233/22/2/024005\n— — — — — — — — — —\nHere other references… \n– about the Transverse Modulus:\nTransverse Elasticity of Cellulose\nNanocrystals Via Atomic Force Microscopy\nby\nRyan Wagner, Arvind Raman, and Robert Moon\n– bout cell walls:\nMicromechanics of Cell Walls\nby\nIngo Burgert and John W.C. Dunlop\nPlease: observe the cell wall assembly as a composite structure…\nand the elastic modulus as a function of cellulose microfibril angle in the secondary cell wall (for various species, included flax…) …\n— —\nDo you want to improve your knowledges on hierarchical materials ?\nPlease, read:\nNature’s hierarchical materials\nby\nPeter Fratzl, Richard Weinkamer\n(Max-Planck-Institute of Colloids and Interfaces, Department of Biomaterials, Potsdam, Germany)\na paper published in :\nProgress in Materials Science 52 (2007) 1263–1334\n— —\n.. the basic knowledges about \nMaterials with structural hierarchy\nlink:\nhttp://silver.neep.wisc.edu/~lakes/Hierarch.html\n— —\nThe hierarchical structure and mechanics of plant materials\nLorna J. Gibson\nDOI: 10.1098/rsif.2012.0341Published 7 November 2012\nAbstract\nThe cell walls in plants are made up of just four basic building blocks: cellulose (the main structural fibre of the plant kingdom) hemicellulose, lignin and pectin. Although the microstructure of plant cell walls varies in different types of plants, broadly speaking, cellulose fibres reinforce a matrix of hemicellulose and either pectin or lignin. The cellular structure of plants varies too, from the largely honeycomb-like cells of wood to the closed-cell, liquid-filled foam-like parenchyma cells of apples and potatoes and to composites of these two cellular structures, as in arborescent palm stems. The arrangement of the four basic building blocks in plant cell walls and the variations in cellular structure give rise to a remarkably wide range of mechanical properties: Young’s modulus varies from 0.3 MPa in parenchyma to 30 GPa in the densest palm, while the compressive strength varies from 0.3 MPa in parenchyma to over 300 MPa in dense palm. The moduli and compressive strength of plant materials span this entire range. This study reviews the composition and microstructure of the cell wall as well as the cellular structure in three plant materials (wood, parenchyma and arborescent palm stems) to explain the wide range in mechanical properties in plants as well as their remarkable mechanical efficiency.\nLink:\nhttp://royalsocietypublishing.org/content/9/76/2749\n… and there would still be many more studies to read!!!\n\n","date":"October 24, 2014 at 10:53 am","url":"https://shroudstory.com/2014/10/23/430-wikipedia-articles-mention-the-shroud-of-turin/","cat":"article","id":"comment-165182","author":"piero","site":"shroudstory"},{"title":"430 Wikipedia Articles Mention the Shroud of Turin","post":"But the sad thing is that the links both to the shroud.com and shroudstory.com have been removed from Wikipedia by someone obviously ‘knowing better’.\nhttp://en.wikipedia.org/wiki/Shroud_of_Turin#External_links\n\n","date":"October 23, 2014 at 11:54 am","url":"https://shroudstory.com/2014/10/23/430-wikipedia-articles-mention-the-shroud-of-turin/","cat":"article","id":"comment-164894","author":"O.K.","site":"shroudstory"},{"title":"430 Wikipedia Articles Mention the Shroud of Turin","post":"Shouldn’t Wikipedia be informed?\n\n","date":"October 24, 2014 at 2:08 am","url":"https://shroudstory.com/2014/10/23/430-wikipedia-articles-mention-the-shroud-of-turin/","cat":"article","id":"comment-165084","author":"clublu22014","site":"shroudstory"},{"title":"430 Wikipedia Articles Mention the Shroud of Turin","post":"Well, O.K., you know there are some who know better than everyone else.  I say let’s give ALL the information for & against and rack and stack and let people make their own determination.  I prefer honesty and openness to hiding some information to support one view over another.  The truth always comes out, I don’t want to be part of the obfuscation that sometimes happens naturally (nope, I have no one in mind and am blaming no one).\n\n","date":"October 24, 2014 at 1:55 pm","url":"https://shroudstory.com/2014/10/23/430-wikipedia-articles-mention-the-shroud-of-turin/","cat":"article","id":"comment-165227","author":"Andy","site":"shroudstory"}]
