[{"title":"Too Great to Be a Work of Art","post":"Ancient Anatomy remained speculative until the Alexandrian Medical school under the Greek Herophilus 300 BC began dissecting human cadavers, and placed it on a factual foundation.  Galen around 200 AD assembled and catalogued what was then thought to be known, but it was a curious mixture of fact and fancy.  Because of Church prohibitions on dissection, there was no further progress with Anatomy, and Galen’s work was the only authority available until Leonardo began his own dissections in the 16th century.  \nForensic pathologists have considered that the figure of the image is anatomically genuine, and given that the Shroud was first exhibited in the West in 1355, well before the time of Leonardo, it seems difficult to able to assert that sufficient anatomical knowledge was then available for it to be a work of human art.  The inference has to be that a real human body was involved in forming the image.  Even realistic classical Greek statuary was limited by its conventions, tending to rely on the Golden Ratio theory for its apparently realistic proportions.\n\n","date":"May 13, 2015 at 6:00 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199015","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"“Apparently realistic proportions.” Yes indeed. There has been quite a lot of complicated juggling with measurements, angles and cloth/body configurations to try to demonstrate that the apparently unrealistic proportions are, in fact, realistic. There have been all sorts of comments about the position of the eyes in the head, the arms crossed over the groin, the length of the legs and the difference in height between the front and back image, to the effect that the image as it lies is in fact not realistic at all. It has even been suggested that the deceased had Marfan’s syndrome. One wonders what Barbet, Delage, Vignon and the earlier commentators would make of that.\n\n","date":"May 13, 2015 at 7:13 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199016","author":"Hugh Farey","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"In order for this theory to be really considered, one would have to show that there was a popular knowledge of the Shroud that would give this desire to reproduce it the reason.  In other words, the theory does not start from a popular knowledge and then posit the theory, but does so out of the air, so to speak.\n\n","date":"May 13, 2015 at 7:17 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199017","author":"Andy","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"As this blogger has said previously on this site, there was in fact a credibility-seeking ‘w’indow of opportunity’ for the linen, but not as a burial shroud (nowhere does it say in the NT that Joseph of Arimathea’s linen was used or intended as such, quite the contrary in fact viz.John). It was for receiving the body straight from the cross for transport to tomb. Even if the latter were very close, the need for respectful and discreet transport may well have been what motivated J of A to provide fine linen.\nOnce one accepts or concedes the fact that the ‘shroud’ was not a burial shroud, but an impromptu stretcher, and indeed an up-and-over ‘body bag’ (if you will pardon the term) then straight away all the difficulties re wounds that re-open or clots that have to retract to release a serum exudate disappear immediately. The thought experiment that inspired the TS pictured the blood as still reasonably fresh, even if it was stretching credulity a little to imagine it was unclotted(especially as regards the earlier scourge marks).\nBody image? The use of linen to envelop a recently crucified corpse, one that leaves a negative imprint (as distinct from positive portrait), and one moreover with the double image interpretable immediately as a whole-body IMPRINT, should surely support the notion that the image was meant to to be seen by relic-seeking pilgrims as one formed by bodily perspiration, aka sweat. The concept of imprinting the body, or part of it, onto cloth had already been made familiar by the then fabled Veil of Veronica, Rome’s prize exhibit in the mid-14th century according to the recently-retired Director of the British Museum.\nFor further fleshing out details, see the 16 point summary of my two-step imprinting/chemical development model, placed this morning on my specialist TS site.\nhttps://shroudofturinwithoutallthehype.wordpress.com/2015/05/13/modelling-the-turin-shroud-forged-in-the-14th-century-as-a-white-flour-imprint-onto-linen-then-chemically-developed-with-nitric-acid-to-resemble-ancient-yellowed-sweat/\nI am now minded to think that the (alleged) peculiar shade of the TS sepia image represents nitrated aromatic amino acid side chains on gluten storage protein in white flour used as imprinting medium. There’s one reference, still to be cross-checked, that says that nitrated tyrosine side groups of wheat gluten are yellow, while nitrated tryptophan residues are red. Might the TS image be a mixture of the two, not necessarily in equal proportions? My nitration experiment yesterday with isolated wheat gluten produced an orange, rather than yellow product. I must try and dig out the reflectance spectra referred to in the STURP summary, and see how they compare with nitrated aromatic amino acids versus the claimed ‘dehydrated, oxidized, conjugated’ carbohydrates of linen. Nitric acid had scarcely any effect on the starch fraction separated from the same white flour, and a slight weakening and discoloration only of the linen, possibly due to attack on the lignin. That might account for Rogers’ finding less potential vanillin than expected for a 700 year artefact, and Fanti’s finding of mechanical weakening similarly greater than expected were the radiocarbon dated age to be taken at face value.\n\n","date":"May 13, 2015 at 8:02 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199021","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Stephen Jones is correct when it comes to one point: Many, though not all, anti-authenticists\naim at the Shroud together with Christianity. I have also seen this in people who have questioned me about the relic.\nIan Wilson, in response to an interview he granted me, published in a leading daily, gave the   best point of view about those who think that the image is a work of art. I will see if it will be possible to post the full-page interview online.\n\n","date":"May 13, 2015 at 7:57 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199020","author":"Louis","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Although I have some doubt regarding the definition\n(= “… the greatest artwork ever created”. Then we must\nremember that the linen cloth is full of blood and\nsins of men!), I believe that I can sing an old song:\n“Unforgettable\nthat’s what you are\nunforgettable …\n… …\nUnforgettable\nin every way\nand forever more\nthat’s how you’ll stay… “\n\n","date":"May 13, 2015 at 8:36 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199023","author":"piero","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Today I saw a book in a shop window of a library …\n Its title is: “Il Mondo che verrà” = “The world to come”\n(authors = EL Bartolini De Angeli, P. Fornaro, Lapis G., B. Nuti,\nG. Olivero, D. Vella. Introduction by Marina Sozzi).\nBetween anthropological illusion and religious revelation,\nthe idea of life after death has always accompanied the history\nand prehistory of humanity: from Neolithic graffiti to contemporary\nnew-age visions, every man, every society, every religion\nhas its own imaginary about the world that awaits us\nat the end of our time on earth.\nIn this book it is presented the main representations of “Underworld” (the ultramundane world), as they have been defined over centuries of thoughts and cultures (and fears).\nWill be the ancient Greek-Latin Ade, that we will reach on the boat of Charon. Or it will be the frozen and Hyperborean castle of Odin. Most probably, will be the Christian hells and heavens, or the Islamic Garden of Delights, or even the Isle of Pure Lands of Buddhist souls…\n— — —\nI believe that the Shroud can be the best compendium\n(a drawing of what happens to man in front of God and a\npossible spark of Hope) to investigate the fate of man\nand the meaning of his existence.\nIt is not possible  that in 2015 there is still a war between\nChristians in Europe (and here I refer to the terrible situation of Eastern Ukraine).\nThe Holy Shroud, perhaps, is similar to a discrete logarithm\nthat opens the possibility to encrypt Paradise.\nI would love to be able to understand well the relationship\nbetween the following story:\n– In the early 1990s was asked to a seer, point blank, in his home:\n“Is John Paul II the Pope who is going to do the Consecration of Russia ?”\nHe answered: “No, it’s not John Paul. It will not be his immediate successor\neither, but the one after that. He is the one who will consecrate Russia.”\n… and the Holy Shroud of Turin\n— — —\nThe Shroud is a relic that can unite Christians,\nbeyond the secular separations.\nWhat do you think?\nPerhaps we should celebrate this unity\non June 21 = the International Day of Yoga\n(but without falling into syncretism!).\n[The United Nations General Assembly adopted\nan India-led resolution declaring June 21 as ‘International Day of Yoga’.]\nThe same day (Sunday, June 21) Pope Francis will visit\nin Turin to venerate the Holy Shroud and to commemorate\nthe 200th anniversary of the birth of St. John Bosco….\n— — —\nSwami Yogananda Paramahansa (1893-1952) was a hindu yogi\nand guru and he stated that:\n“The ideals of Christ are the ideals of the scriptures of India….”\n(… but as I previously wrote we have to avoid to fall into syncretism!).\n\n","date":"May 13, 2015 at 9:31 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199026","author":"piero","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Errata corrige: \n>that opens the possibility to decrypt the Paradise.\nInstead of :\n>that opens the possibility to encrypt Paradise.\n— — —\nHere some word about the “discrete logarithm”…\n>In mathematics, a discrete logarithm is an integer k solving the equation bk = g, where b and g are elements of a finite group. Discrete logarithms are thus the finite-group-theoretic analogue of ordinary logarithms, which solve the same equation for real numbers b and g, where b is the base of the logarithm and g is the value whose logarithm is being taken.\n>Computing discrete logarithms is believed to be difficult.\n>No efficient general method for computing discrete logarithms\non conventional computers is known, and several important algorithms\nin public-key cryptography base their security on the assumption that\nthe discrete logarithm problem has no efficient solution.\nLinks:\nhttp://en.wikipedia.org/wiki/Discrete_logarithm\nhttp://cryptography.wikia.com/wiki/Discrete_logarithm\n— — —\nDiscrete logarithm and applications in Cryptography.\nDiscrete logarithms in finite fields and their cryptographic significance\nby\nA. M. Odlyzko \nHere some short excerpt from the abstract:\n>… … The well-known problem of computing discrete logarithms\nin finite fields has acquired additional importance in recent years\ndue to its applicability in cryptography.\n>Several cryptographic systems would become insecure\nif an efficient discrete logarithm algorithm were discovered. … etc. …\n>… Due in large part to recent discoveries, discrete logarithms\nin fields GF(2n) are much easier to compute than\nin fields GF(p) with p prime….\nLink:\nhttp://link.springer.com/chapter/10.1007%2F3-540-39757-4_20#\n\n","date":"May 13, 2015 at 9:44 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199028","author":"piero","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Discrete logarithm records are the best results achieved to date in solving the discrete logarithm problem …\nLink:\nhttp://en.wikipedia.org/wiki/Discrete_logarithm_records\n\n","date":"May 13, 2015 at 10:15 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199033","author":"piero","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Colin wrote: “Once one accepts or concedes the fact that the ‘shroud’ was not a burial shroud, but an impromptu stretcher, and indeed an up-and-over ‘body bag’ (if you will pardon the term) then straight away all the difficulties re wounds that re-open or clots that have to retract to release a serum exudate disappear immediately.”\nRe the TS i.e. a long NARROW piece of cloth being allegedly ‘used a body bag’ to transport the stiff rigid dead body from cross to tomb, and not being used as a final burial shroud, on January 29, 2015 at 7:16, 7:22 and 7:48 am, I wrote: \n“Could Colin account for an alleged “1325 CE± 65 monk” using an about 4,40 x 1,10m DOUBLY IMAGED cloth (implying it was wrapped around the body from head to toe) while the original size of the most famous representative relic of the Sindon Munda/Sindon Kathara (or Matthean “PURE/CLEAN cloth”, first kept in Aachen or Aix-la-Chapelle and then –after having been cut in two halves– Compiègne and Kornelimünster) was only about 2,10 x 1,80m and NON-IMAGED (implying it was wrapped around the body from one side to the other)? Why the sudden need to forge a “Sindon IMMunda”, an “unclean cloth” wrapped around from head to toe and not from side to side?\nReminder: To my knowledge, in the 13th-14th CE burials, the body sheet was folded over one of the deceased’s side (from right to left or left to right), then the other edge over his other side (from left to right or right to left) NOT wrapped around the deceased first over the head, then the feet. A short ladder, a large and WIDE blanket or sheet are better candidates to do the job as they are SAFER and more PRACTICAL ‘impromptu stretcher’ in terms of time and resources saving (they need no temporary ties absent the fact the corpse stiff rigid was with arms abducted and the same ladder could be used to take the body down from the cross) whereas a long NARROW (fine linen) sheet is a very poor candidate indeed! \nCould Colin refer us to another example of a long narrow piece of cloth being used as “an impromptu stretcher” in the Middle Ages, please? (On November 26, 2014 at 4:13 am I already asked him the same question but got no reply!)\n\n","date":"May 13, 2015 at 10:11 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199031","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"In a 14th century forgery scenario, the linen did not actually serve, or even need to serve,  as a stretcher of body bag. It merely had to be imprinted  in such a way as to look to a visiting pilgrim that it had functioned as such.\nWhile it might have been more practical to use a side-to-side folding of linen to envelop a corpse, an imprint showing that particular geometry would arguably not have the same immediate visual impact as that of the TS geometry. As I seem to recall saying on the earlier occasion this was discussed, the side-by-side configuration is arguably a little more difficult to interpret unambiguously, like are they imprints of the same person, or of two different people enveloped in the same cloth?  Having the unusual, some might say arresting head-to-head configuration on the same narrow  length of linen makes it clearer surely that one is looking at a double imprinting of the same man. One could go further and say that the TS head-to-head configuration is one of its iconic features. I can’t recall ever having seen it elsewhere. It was also important to get across the idea quickly that the image was an imprint, not an artist’s portrait. The head-to-head configuration was an important cue that one was looking at the ‘real’ (if faked) J of A linen, not some timid artistic re-creation. The uncompromising  negative image and realistic-looking bloodstains too would have reinforced that same message – real body imprint – not something cobbled together in an artist’s studio.\n\n","date":"May 13, 2015 at 10:44 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199034","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Colin you wrote: “In a 14th century forgery scenario, the linen did not actually serve, or even need to serve, as a stretcher of body bag. It merely had to be imprinted in such a way as to look to a visiting pilgrim that it had functioned as such.”\nMethinks this is just wishful thinking or fantasy by an agenda-driven arch-antiauthenticist (and TS novelist!) named Colin Berry. Your alleged ‘forgery scenario’ is too much convoluted to be credible (at one and the same time it is “INDEED” –your own word– AND actually it is not “an up-and-over ‘body bag’”(just a make-believe for people), it is AND it is not an ‘impromptu stretcher’… How can a medieval forger have taken the trouble for such ‘a make-believe’ when such an ‘impromptu stretcher’ was never heard of in whole history and people then were totally alien to such an idea (using a long NARROW piece of cloth to transport a dead body wrapped around the deceased first over the head, then the feet!) even though a short ladder, a wide blanket or sheet (wrapped around side-to -side would have done the job far better! It does not make much sense except to you as you desperately try to force a puzzle piece that isn’t made to fit in a credible medieval forger scenario.\n\n","date":"May 13, 2015 at 11:44 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199037","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Typo: “(wrapped around side-to -side” is to be deleted here.\n\n","date":"May 13, 2015 at 11:48 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199038","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"\nThere’s more, much more from the artistic record, that shows Joseph of Arimathea’s linen being used as a stretcher, and even as a body bag (albeit with head just visible – artistic licence no doubt). It requires no great stretch of the imagination today to see J of A’s linen being used as such, given the NT synoptic gospels’ account of it being deployed early at the deposition from the cross, with the rock tomb nearby.  I’m heartened  to see that artists pictured the scene the same way centuries ago. \nSee a posting I did early last December.\nhttps://shroudofturinwithoutallthehype.wordpress.com/2014/12/04/a-new-take-in-pictures-on-an-old-artefact-the-not-really-a-shroud-of-turin-more-an-imaginative-14th-century-marketing-wheeze/\nThat’s really all I have time to say on the matter, not caring for lengthy wrangles. I’ve stated my views. Kindly take it or leave it.There’s nothing to be gained from browbeating the opposition on web forums.\n\n","date":"May 13, 2015 at 12:05 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199039","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"There is no news about the Shroud conference held in Germany, with Friedhelm Hofmann, bishop of Würzburg, as patron:\nhttps://www.shroud.com/pdfs/wurzburgflyer.pdf\n\n","date":"May 13, 2015 at 11:04 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199035","author":"Louis","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Some recurrent topics in the sindonism that are false:\n1. If a painter made the Shroud he did it with the same appearance and properties we can see it today. False: the most common alternative is that a painter made it  and what we see now is the outcome of a degradation process (Nickell, Garlaschelli, Freeman…)\n2. “There was no further progress with Anatomy, and Galen’s work was the only authority available until Leonardo began his own dissections in the 16th century”. False: dissections were common in the end of Middle Ages. For example, see Gui de Chauliac, Grande Chirurgie. 1363.\n3. “It seems difficult to able to assert that sufficient anatomical knowledge was then available for it to be a work of human art”.\nNicola Pisano, Pisa Baptistery. Pulpit, 13th century. https://i1.wp.com/www.shafe.co.uk/crystal/images/lshafe/Pisano_Pisa_Baptistery_Pulpit.jpg\nGiotto. Lamentation. Capella degli Scrovegni. 1306.\n \nNo comment.\n4. About the “objectivity” of the sindonist forensic surgeons let us drop the matter. They say amazing things and have sometimes a “super view” more acute than Superman that allows them to do an autopsy with a blurred image and to arrive sometimes to contradictory conclusions.\n\n","date":"May 14, 2015 at 1:53 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199072","author":"David Mo","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Observe Joseph of Arimathea and (probably) Nicodemus on the right. J of A has his linen wrapped shawl-like around his shoulders. It looks narrow, as per TS, though whether single or double adult man length is difficult to tell. It’s obviously for immediate use, as per synoptic Gospels. If that’s Nicodemus, then note that he’s not carrying a “winding sheet” or 100lbs of aloes etc. They would have been delivered to the tomb, and used (probably) after J of A’s linen had been removed for final cleaning of the body, application of spices, ointments etc.\nSorry to have to repeat myself, but there’s really no biblical evidence to support the view that J of A’s linen was used or intended as a final burial shroud – quite the contrary in fact from the account in John. Ipso facto the Turin Shroud is not a shroud either. Oh those preconceptions!\n\n","date":"May 14, 2015 at 2:13 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199074","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Correction: …the Turin shroud is not a burial shroud either.\n\n","date":"May 14, 2015 at 2:19 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199075","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"I entirely agree Colin.\n\n","date":"May 14, 2015 at 2:51 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199076","author":"Thomas","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Thanks Thomas. The next step is to elevate you to role model for this site. Gradually, ever so gradually, I hope  to see everyone intoning your 4 superbly chosen words after each of my comments as if a mantra. ;-)\n\n","date":"May 14, 2015 at 2:57 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199077","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Today we know that the one who painted (scorched, chemist) the Image knew all the following information in 14th century:\n1. Photographic Negatives\n2. X-Ray like properties\n3. Nail was punched at wrist but not at the palm (innovation)\n4. How blood is flowing (knowledge of Fluid Mechanics)\n5. How to create the image only at top (thickness of 2nm) but blood has to penetrate first\n6.Not a 2D image but accurate measurement for a curved image (as sheet was covered the dead body)\n7. Three Dimensional coding\n8. Crown of thorn as a helmet like thing\n9. One leg bent over the other leg (one leg is short)\n10. To show 4 fingers (not the thumb) due to nailed the person from the wrist and not from the palm.\n11. What type instrument used the beat the person\n12. How to find suitable linen to create the image\nWhat a wonderful person is that painter (scorcher, chemist). If that person is born today he will do marvellous things as he can see many things which will come in the future. (What sort of innovator is he?\n\n","date":"May 14, 2015 at 4:55 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199123","author":"Sampath Fernando","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"This is a mixture of post hoc propter hoc and wishful thinking, Fernando. The artist need not have known anything about negatives and 3D, which effects are inevitable consequences of the visualisation of an image made by a body on a cloth. Even if the blood flows were realistic, all the artist needed was to trickle ‘blood’ down somebody’s arm. Knowledge of fluid mechanics was unnecessary. The blood mark representing the nail wound is on the back of the hand, not in the wrist. The flagrum was easily envisaged from medieval instruments (see the picture of Louis IX above) and the wounds do not have any archaeological verification.\nAnd so on.\n\n","date":"May 14, 2015 at 5:48 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199127","author":"Hugh Farey","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Mr Farey: Could you please explain how the image was created? Any idea?\n\n","date":"May 14, 2015 at 6:16 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199129","author":"Sampath Fernando","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"No, of course not. If anybody knew that there would be none of the exploration into the subject that has been going on for all this time. But I do not think that your ignorance is in itself a guarantee of non-authenticity. Do you think that my ignorance is a guarantee of authenticity?\n\n","date":"May 15, 2015 at 12:58 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199142","author":"Hugh Farey","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"“Photographic negatives”? “X-ray like properties”?\nWhy do folk continue to deploy such terms, as if the existence of a modern-day parallel makes the TS  image an anachronism?\nThe image is photograph-like (but only after tone-reversal as per Secondo Pia ) and arguably x-ray like too in places, but that’s as far as it goes.\nWhy? Because there are easy ways of demonstrating those properties that require neither light nor x-rays.\nPush one’s face into pillow and one sees a temporary indentation that is a transient image of oneself (and it’s a negative). One can make that a faint but permanent image by first smearing one’s face with oil.  One can develop that image further by finding something that attaches preferentially to the oil imprint . Soot, i.e. fine particles of carbon might do, as in dusting for fingerprints.\nRepeat the exercise with one’s fingers and they may well appear bony, and “x-ray-like”  if light pressure is used when pushing into the pillow. That’s because of the central hard non-compressible bone and the curvature of thin overlying flesh.\nThis is not modern photography or modern anything. It’s simple image-making technology  (“impactography”? )that could have been employed in medieval times, in biblical rimes, or arguably even in the Stone Age for that matter.\n\n","date":"May 15, 2015 at 1:50 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199146","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"But TS is the only one have those properties.\n\n","date":"May 16, 2015 at 2:51 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199256","author":"Sampath Fernando","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Colin Berry says:  “If that’s Nicodemus, then note that he’s not carrying a “winding sheet” or 100lbs of aloes etc. They would have been delivered to the tomb, and used (probably) after J of A’s linen had been removed for final cleaning of the body, application of spices, ointments etc.\n***Angel says:  Funny!   According to the artist’s rendition, Jesus’ body was not in need of a cleaning. \nNotice no blood, not even in the location of the nail mark on the right foot or the piercing mark from the Roman sword on His right side.  There is also no blood on the face from the crown of thorns.\n\n","date":"May 14, 2015 at 10:57 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199139","author":"Angel","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Artists were allowed to choose how much visual realism to include in their pictures of the crucifixion. Folk knew that manner of execution drew blood – they did not need to be reminded of it each time they viewed devotional art. Doubtless the concept of “suitable for family viewing” was a factor all those centuries ago.\n\n","date":"May 14, 2015 at 11:19 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199140","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Colin Berry says:  “…they did not need to be reminded of it each time they viewed devotional art…”\n***Angel says:  I wonder why, Colin?   Guilt, perhaps!  \nYet, what you have posited may have been the case for artists, but not so for man, in general.  \nSince Jesus died for the sins of mankind, we should always be reminded of the extent of the brutality Jesus experienced for our salvation (including the wounds and their flow of blood).  This is the reality of His death, enabling us to more fully comprehend repentance. \nWhat comes to mind are the following scriptures:\nZechariah 12:10\n“…and they shall look upon me whom they have pierced…”\nJohn 19:37\n“…They shall look on him whom they pierced.”\nRev 1:7 “…and every eye shall see Him, and they also which pierced Him…”\nThe paintings send the subliminal message, Christ’s suffering wasn’t as horrific as has been detailed in the Gospel accounts..\nAs well, Colin, I know you are an atheist, but I am merely giving an alternate perspective from the Christian viewpoint.\nThere is one other thing I fail to understand.  After reading other Gospel accounts (aside from the Canon) the view was a wreath of gold was to be placed upon saintly heads, rather than a halo, as is usually depicted.\nA wreath sits atop the head, where a halo is positioned high above the head.  Yet, I have never seen a wreath of gold on any of the paintings.  Wonder why?\nMaybe this is another that falls under the category “Give to Caesar what is Caesar’s and to God, what is God’s.  :) \nTake care!  \nBest,\n\n","date":"May 15, 2015 at 2:20 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199225","author":"Angel","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"I’m not sure I understand, Colin. This is a Trecento painting made with some pictorial conventions. The representation of the piece of linen on Joseph’s shoulders is so conventional as his own clothes. We can not conclude anything about the real cloths of the passion from Giotto’s painting. \nI agree with you, the Shroud has not the form of a shroud. It is too narrow. But nor it has the useful proportions to carry a corpse. It is too narrow also for this purpose.\n\n","date":"May 15, 2015 at 2:03 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199150","author":"David Mo","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Who says it is too narrow?\nYes, conventionally too narrow one would think. But what if it was all that could be laid hands on to transport the corpse?\n\n","date":"May 15, 2015 at 2:24 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199153","author":"Thomas","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Right. One must not read too much into any one picture. However, I maintain that the white cloth slung over the shoulders was the artist’s way of saying “That’s Joseph of Arimathea with his expensive linen” and his male companion right next to him was probably Nicodemus.\n\n","date":"May 15, 2015 at 2:32 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199154","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Oh indeed great one\n\n","date":"May 14, 2015 at 5:20 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199084","author":"Thomas","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Colin,\nDo you know the useful use of an electronic nose\n(in an adequate expeiment)?\nSee, for example: the Foodsniffer…\n>The Foodsniffer was invented by Lithuanian inventor\nAugustas Alesiunas who came up with the idea after\nfalling ill from food poisoning. …\nLinks:\nhttp://www.digitaltrends.com/home/foodsniffer-analyzes-chemicals-to-detect-food-spoilage/\nhttp://www.dailymail.co.uk/sciencetech/article-2937785/End-use-date-Foodsniffer-analyses-chemicals-emitted-food-tell-s-safe-eat.html\nhttp://www.ippinka.com/blog/peres-electronic-food-sniffer/\n\n","date":"May 14, 2015 at 7:58 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199094","author":"piero","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Errata corrige:\n>an adequate experiment\nInstead of:\n>an adequate expeiment\n— — —\nI thought that you (Colin)…\nYou want to continue in your scientific experiments … \nI found this electronic nose that has four types of sensors and\nI believed you can do something of useful … even if I did not share\nthe enthusiasm of some researchers who had read\nthe writings by Dr. Rogers in the past …\nThe electronic nose acts as a supplement to our natural nose\nby quickly processing data about freshness and quality.\nSo we can build the interesting tables starting\nfrom the results obtained during the experiments.\n\n","date":"May 14, 2015 at 8:14 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199095","author":"piero","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"FOODsniffer is the world’s first portable “electronic nose” – a unique and innovative device and mobile application which enables users to determine the quality and freshness … \nLink:\nhttp://beta.myfoodsniffer.com/\n\n","date":"May 14, 2015 at 8:22 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199098","author":"piero","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"The first nineteen hundred years, the positive image didn’t look too great not to be a work of art. After Secundo Pia photograph, suddenly its too great to be a work of art!\n\n","date":"May 14, 2015 at 4:19 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199120","author":"don","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"typo-positive image didn’t look too great to be a work of art. Got a little confused there!\n\n","date":"May 14, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199121","author":"don","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"To Sampath Fernando\nI read your May 14 comment and you’re absolutely right.\nAs it would be expected the reply from Dr. Hugh Farey is misleading.\nI wion’t discuss every issue but if it’s true that nailing in the wrist like the Shroud image has till now no archaeological back-up that’s easy to explain because carpal bones are small size and age effects namely separation and bone erosion would preclude or make very difficult to determine bone erosions due to nailing.\nNevertheless I read somewhere that archaelogists found remains of a forearm with bone aspects of nailing through the distal radius and ulna near the first range of carpal bones.\nAnd you should also remember that Dr. Pierre Barbet conducted experiences with amputated arms and cadavers and concluded that it’s impossible to sustain a body on the cross by nailing through the palms.\nIn my humble opinion as a medical doctor with anatomical knowledge the exit wound on the dorsal image of the left wrist matches the so called Destot’s space between lunate triquetrum capitatum and hamatum wrist bones(not the palm/metacarpal area)\n«The artist need not have known anything about negatives and 3D, which effects are inevitable consequences of the visualisation of an image made by a body on a cloth. »\nGimme a break….\nI think that when you wrote tridimensional coding you meant an image with volumetric/tridimensional encoding that when submitted to 3D computer analysis unveils a human body with reasonable anatomic accuracy ,\nThese image properties were verified in the Shroud Image by different image processing programs, not just with the VP-8.\nNotice that obtaining relief in relation with darker or lighter image areas IS NOT THE SAME AS 3D ANATOMOAL ACCURACY\nBurn holes appear different than surrrounding non burned areas of the Shroud in VP-8 image analysis as expected nevertheless this fact has nothing in common with the details and reasonable anatomical exactness of the body image.\nIf producing a Shroud like image by a «body on cloth» was that easy there would be «many shrouds»…. \nMy reply ends here because those other issues have already been studied by qualified experts as you know. \n                                                                              regards\n                                                              Antero de Frias Moreira\n                                                    Centro Português de Sindonologia\n\n","date":"May 15, 2015 at 11:00 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199212","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"The position of the wound in the back of the hand has been extensively explored, not least at https://shroudstory.com/2015/02/22/very-disturbing/#comment-191592 and https://shroudstory.com/2015/02/25/maybe-the-nails-didnt-go-through-the-wrists/. Expert forensic pathologists have differed from each other quite heatedly as to where the wound actually was, and at least five different positions have been suggested.\n“I read somewhere that archaeologists found remains of a forearm with bone aspects of nailing through the distal radius and ulna near the first range of carpal bones.”\nAnthropological Observations on the Skeletal Remains from Giv’at ha-Mivtar\nN. Haas, Israel Exploration Journal, Vol. 20, No. 1/2 (1970), pp. 38-59.\nThe injuries on the Shroud do not resemble the injuries present on the only crucifixion victim ever discovered from Roman Palestine.\n“Gimme a break…” Why? The comments of Fernando and yourself do not suggest that you have considered all the evidence and rejected the least convincing, but that you have made up your minds on the basis of some of the evidence and are unwilling even to look at anything new.\nHere’s something new. We are often told that the ‘crown’ of thorns was cap-like rather than a circlet, as if this gave some credence to the antiquity of the Shroud. Does anyone know what a 1st century crown looked like? Is there a coin with a picture of Herod, or Pilate, or anyone, with a crown on? Or a sculpture? Anybody?…\n\n","date":"May 15, 2015 at 1:05 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199218","author":"Hugh Farey","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"The crucial point surely is that there is no imaging of “wounds” or “injuries” as such on the sepia body image of the TS – absolutely none. The evidence for “wounds” and “injuries” rests entirely on the position of bloodstains at various locations. Even the “scourge marks” showing the dumb-bell shapes etc of skin-lacerating or indenting metal or bone tips are (we’re told) solely blood imprints – there’s no corroborating evidence in the body image.\nThe reliance on bloodstains alone to support the biblical narrative (scourging, crown of thorns, nails wounds, lance wound) with no supporting evidence whatsoever in the body image is entirely consistent with medieval forgery. Indeed, it’s hard to think of an alternative explanation – unless one’s view of the TS is “authentic until proven otherwise” (an authenticity-endorsing or promoting  ‘sindonological’ position, as distinct from one that is strictly neutral, dispassionately scientific).\n\n","date":"May 15, 2015 at 1:41 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199222","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Colin:\n” The crucial point surely is that there is no imaging of “wounds” or “injuries” as such on the sepia body image of the TS – absolutely none. The evidence for “wounds” and “injuries” rests entirely on the position of bloodstains at various locations. Even the “scourge marks” showing the dumb-bell shapes etc of skin-lacerating or indenting metal or bone tips are (we’re told) solely blood imprints – there’s no corroborating evidence in the body image.”\nI never understood what you mean by “imaging of wounds …”\nWhat do you expect to see on a linen on contact with a bloody wound?\nI would expect to see exactly what we see on the TS.\nCan you explain?\nTo all:\nDoes it exist a medieval painting depicting blood flows similar to that seen on the TS, like the “epsilon” blood stain, the other  bloodstains on the face, the “lance wound” bloodstain etc…\n\n","date":"May 15, 2015 at 2:10 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199224","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"“What do you expect to see on a linen on contact with a bloody wound?”\nMaybe nothing. But I’m not the one who constantly refers to “wounds” or “injuries” for which there’s no independent and corroborating evidence in the body image, merely blood that is in locations that fit the biblical narrative. It’s to do with the burden of proof.\nWhen someone is flayed with a Roman flagrum, one expects to see the skin ripped to shreds, with blood flows to match. One does not expect to see neat imprints correspondingly exactly with the shape of the metal or bone pellets, as if all they did was to produce contusions with just the right amount of weeping blood to “imprint” an image, with no surplus to obscure and thus ‘spoil’ the image. The scourge marks are frankly not credible, except as the work of a forger intent on creating over-simplified neat and geometric patterns that lack both realism and credibility.\n\n","date":"May 15, 2015 at 2:33 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199226","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Hugh Farey says:  :Here’s something new. We are often told that the ‘crown’ of thorns was cap-like rather than a circlet, as if this gave some credence to the antiquity of the Shroud. Does anyone know what a 1st century crown looked like? Is there a coin with a picture of Herod, or Pilate, or anyone, with a crown on? Or a sculpture? Anybody?…”\n***Angel says:  Hi, Hugh!\nTry Julius Caesar with  – “Laurel Wreath Crown.”\nCheck out the image.\nhttp://theweddingtiara.com/archives/julius-ceasar-and-emperor-napoleon-laurel-leaf-crowns\nBest,\n\n","date":"May 17, 2015 at 8:32 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199378","author":"Angel","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Just to say that this blogger is now nearing the end of his 40 month (approx) journey. There’s just one more posting that needs doing. It’s to generalize my currently preferred white flour/nitric acid model. It may or may not have been white flour used as imprinting medium. It may or may not have been nitric acid that was used to turn that faint off-white image into a more prominent yellow or yellow-brown colour. The key thing is the use of a two-stage model: initial imprinting of a proto- (‘ghost’) image followed by second stage development.  Note the parallel with pre-digital era photography, except my model is maybe better described as a mix of medieval impactography and chemography – no photons or neutrons needed.\nWhy use two stages, when one would suffice (e.g.Garlaschelli’s frottage or Accetta’s wood-block imprinting)? Answer: to permit fine-tuning of the end-result, so as to achieve that oh-so-subtle negative image – not too contrasty, not too ghostly. For example, a first stage imprint with flour could be softened around the edges by sponging with a damp cloth. The permutations are endless when one adopts a two-stage model.\nTime now to bow out from this site, both stimulating and infuriating by turns. All queries to do with the TS image per se addressed to me here will henceforth be answered on either my sciencebuzz or recently-reactivated specialist TS site.\nAdieu.\n\n","date":"May 17, 2015 at 1:52 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199317","author":"Colin Berry","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Re Rubens picture showing the Descent from the cross, Colin FIRST tells us “Joseph of Arimathea’s linen is being used as a chute or slide to assist removal of the body from the cross” then “as a brake” and ask us to “see the way it’s coiled around Jesus’s leg” and the way “others with outstretched hands helping ease the body down to the ground in a dignified manner”, THEN, in another picture (“albeit with Jesus’ head just visible”) he tells us Joseph of Arimathea’s linen aka “the ‘shroud’ was not a burial shroud, but an impromptu stretcher, and indeed an up-and-over ‘body bag’” as alleged ‘proofs’ “(…) the Turin shroud is not a burial shroud”(…)”!?\nFirstly, could Colin CLEARLY agree with himself on the real/fictive (?!) use of the TS before disagreeing with me?\nThe very fact of thinking such artistic (and most unrealistic) reconstructions of the Descent of the Cross and Transport to the Tomb are both valid and reliable in terms of forensic and/or archaeological reconstructions definitely does need MORE THAN JUST A STRETCH OF THE IMAGINATION! Such artistic reconstruction are in sharp contrast with bloodstain pattern analysis indeed. \nReminder for Colin: besides burial a SET OF SHROUDS, PRE-burial clothes could have been used (to soak up blood and so prevent excessive blood loss) and heavy sweating can account too for the wounds looking as if washed out neat and clean.\nMost obviously Colin just cannot discriminate between a state-of-the-art archaeological reconstruction (e.g. that of a Second Temple period wrapping in shrouds from the TS used as long narrow INNER winding burial sheet) and an artistically unrealistic rendering of Yeshua’s body Descent from te Cross and Transport to the Tomb!\nIs it having a hard time for Colin ‘thinking’ a long narrow zigzag-patterned winding sheet or himation/sindon might well have been used as an inner winding burial sheet along with several additional shrouds to tightly wrap up the TS man’s body in dignity? Reminder for him: to Judeans the zigzag weave pattern was symbolic of the living waters of the Torah and do fit well into… the (archaeological) picture. Now the zigzag weave pattern is not even shown in Colin’s most misleading POST-14th c. CE artistic unrealistic records…\n\n","date":"May 17, 2015 at 5:11 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199326","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Most likely Hakhamim (“Sages, wise men or members of the Sanhedrin) used to wear a zigzag weave-patterned himation/sindon symbolic of the living waters of the Torah. Most likely, in the hypothesis the TS is Yeshua’s, Yosseph ha-Ramathayim used the himation/sindon he had bought for himself to wrap Yeshua’s body and honour as an Hakham.\nIn the Testimony of Flavius Josephus, we can read: “About this time there lived Yeshu’a, a Hakam/a wise man, if indeed one ought to call him a man” and, in Hebrews 6:19-20: Yeshu’a, after his resurrection, is High Priest “after the order of Melchizedek” in other words he is a Sage par excellence.\n\n","date":"May 17, 2015 at 5:48 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199330","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Max patric Hamon says:  “Yeshu’a, after his resurrection, is High Priest “after the order of Melchizedek” in other words he is a Sage par excellence.”\n***Angel says:  And there are some who say He WAS Melchizedek (God in the flesh), who visited Abraham on the desert and blessed him.   Some also say He WAS the God in the flesh, who appeared before Abraham and Sarah at Mamre.  \nThree men visited, two went on to save Lot and his family and the 3rd (God in the flesh) destroyed Sodom and Gomorrah.\nAnd then there was God in the flesh, Yeshu’a (Yahoshua).\nAll three men were God in the flesh.  Seems logical, alpha and omega, the beginning and the end.  :) \nBest,\n\n","date":"May 17, 2015 at 8:48 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199380","author":"Angel","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Angels, \nActually, Hebrews 5:10 called Yeshu’a a High Priest after the order of Melchizedek and Hebrews 6:19-20 told us he was made an high priest forever after the order of Melchizedek”, not me… ;-)\n\n","date":"May 18, 2015 at 2:59 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199418","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Hi Max,\nYes, I am familiar with the scriptures you have mentioned in the New Testament. \nI was referencing the Old Testament and speaking  more along the lines of what was included in Genesis 14:18-20, Psalm 110, and  the Dead Sea Scroll (11Q13, Column 2).\nSee the Dead Sea Scroll entry on the link below:\nhttp://www.ad2004.com/Biblecodes/Hebrewmatrix/melchizedek.html\n\n","date":"May 18, 2015 at 7:25 pm","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199474","author":"Angel","site":"shroudstory"},{"title":"Too Great to Be a Work of Art","post":"Rephrasing and typo (sorry typing in haste as usual): \n“Most likely Hakhamim (“Sages, wise men or members of the Sanhedrin) used to wear a zigzag weave-patterned himation/sindon symbolic of the living waters of the Torah. Most likely, in the hypothesis the TS is Yeshua’s, Yosseph ha-Ramathayim used the himation/sindon he had bought for himself to wrap Yeshua’s body and honour HIS MASTER as an Hakham par excellence.\nIn the Testimony of Flavius Josephus, we can read: “About this time there lived Yeshu’a, a Hakham/a wise man, if indeed one ought to call him a man” and, in Hebrews 6:19-20: Yeshu’a, after his resurrection, is High Priest “after the order of Melchizedek” in other words he is the Messiah, the Sage par excellence.”\n\n","date":"May 17, 2015 at 6:01 am","url":"https://shroudstory.com/2015/05/13/too-great-to-be-a-work-of-art/","cat":"article","id":"comment-199332","author":"Max patrick Hamon","site":"shroudstory"}]
