[{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"I would hate to speed up time but can March the 1st get here any sooner ??  I can hardly wait for that series to start  I am a believer of the Shroud of Turin as being “The Shroud of Christ”.\n\n","date":"February 13, 2015 at 4:45 am","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-190915","author":"Emmett McMahon","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"I never knew that STURP concluded that it was genuine. I have certainly never seen the evidence to support this conclusion.\nWe still have to find evidence of an ancient loom capable of weaving a single cloth of this length. Normally the limit was two metres although away from Palestine an Egyptian ground loom could do more but the examples are a lot earlier.  Any ideas anyone??\n\n","date":"February 13, 2015 at 7:33 am","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-190926","author":"Charles Freeman","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"The article should probably read, “In 1978, Jackson led a team of scientists who spent five days intensely studying the Shroud for authenticity, before [personally himself] ultimately concluding it is genuine and not an artistic fake.”\n\n","date":"February 13, 2015 at 8:17 am","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-190928","author":"Dan","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"“Normally the limit was two metres although away from Palestine an Egyptian ground loom could do more but the examples are a lot earlier.”\nWhat the heck difference does it make that the Egyptian looms were a lot earlier?  [Let me answer this for you — “None”].  Any loom invented before 1st Century, according to all the rules of logic, could clearly exist in 1st Century Israel.   \nSo you invite comment, but prefer to disallow obvious examples.  You are disingenuous to the extreme….\n\n","date":"February 13, 2015 at 4:12 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-190962","author":"Nabber","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"Egypt was very isolated from the rest of the Mediterranean which is why Egyptian culture and art is instantly recognisable as distinct from that of other cultures and so far as I know there is no evidence of the  Palestinians using Egyptian artefacts from a thousand years before.\nThere are a few articles on the Shroud and the weave which sometimes assume that a herringbone weave is the same as a three-in-one herringbone  weave but search as much as you will and no one has raised the basic question- if the Shroud was authentic then what kind of known ancient loom was it made on. Its length really does need explaining for that period.\n\n","date":"February 14, 2015 at 2:36 am","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-191004","author":"Charles Freeman","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"The sole purpose of the tests performed by STURP was to determine the image formation mechanism of the Shroud. It was NEVER to prove it was “authentic” or even that it wrapped the body of Jesus. Had that been the case, many of the team members would not have participated. Any such comments made by individual team members after the fact do not necessarily represent the consensus of the STURP team.\n\n","date":"February 13, 2015 at 3:52 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-190957","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"The Shroud of Turin show on CNN is irresponsible journalism and bad science.  Where have you people been?  This issue was resolved a long time ago, shortly AFTER the first carbon dating tests.  There was a 2 part series (on PBS maybe? I’ve seen it twice) that first reported, like you just did, a 14th century dating.  The part 2 show (perhaps a year or so later), resolved the issue for good.  Most of the interviews were with one of the scientists who conducted the original carbon dating at the Arizona lab.  He admitted that the original results ignored basic science logic and protocols (probably because they were scientists and WANTED the shroud to be a forgery).  He indicated the 3 labs that ran the tests had returned dramatically different results, which should have been a BIG red flag.  Carbon dating cannot be that inaccurate, but they ignored it and took an AVERAGE (how stupid and unscientific) of the results to come up with the 14th century date.\nThen two university professors (Midwest husband and wife I think) suspected an error and submitted a paper on it.  The wife was an expert in medieval fabrics.  Her conclusions turned out to be correct.  It was a common medieval practice to repair fabrics by weaving in new fabric.  Carbon dating COUNTS carbon atoms.  Since we scientifically know at what rate carbon atoms decay, we can mathematically figure out a material’s age.  So each lab’s dramatically different results simply meant the swatch each one tested had varying amounts of original fabric versus repair fabric.\nThe Arizona lab first said they had scanned the shroud and didn’t see different fabrics, but oops, bad science again.  The scientist interviewed on the show realized they had only scanned the IMAGE, not the borders of the shroud where the swatches were cut from (Duh!).  They luckily had enough material to test again and showed a microscopic shot of the two fabric materials weaved together.  When the older fabric was separated it was dated at the time of Jesus.\nThe show also reported a previous challenge for anyone to recreate the shroud.  Artists, scientists, and doctors tried.  The only one who came remotely close was an artist.  We saw footage of how it looked similar to the naked eye, but under an electron microscope it was flat, while the real shroud clearly showed dimensional contours of the body.\nIf you consider yourself an ethical journalistic news source, to repair the incomplete/inaccurate conclusions implied in your telecast that perpetuates the falsehood of an important religious issue, you should air the Part 2 show I described.\n\n","date":"March 2, 2015 at 11:42 am","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-192198","author":"Steve Vitale","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"Steve, I lean towards authenticity. But as Hugh notes, there are many false assumptions in what you have posted. Spend some time reviewing this blog and you’ll see the nuances and grey areas that shroud the Shroud (for both sides of the debate).\n\n","date":"March 2, 2015 at 1:43 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-192214","author":"David Goulet","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"“Assumptions”?  What specific assumptions are you talking about?\n\n","date":"March 2, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-192229","author":"Steve Vitale","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"The assumption that there is any evidence that the linen has been tested under scientific peer-reviewed protocols and found to be 1st century. The repair hypothesis is still not proven (neither has it been disproven). And the three labs did not end up with dramatically different results which they averaged…where did you hear this?\n\n","date":"March 2, 2015 at 4:43 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-192230","author":"David Goulet","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"What I said in my post is from the 2 shows I mentioned, not my assumptions.  As I stated, one of the original scientists from Arizona was interviewed.  He told the story that I summarized: that after they reviewed the “error paper” I mentioned above, their lab found the repair fabrics weaved into the last sample they had.  When they separated the fabrics, the older swatch tested to the 1st century (and I think he also indicated the newer fabric was from the 16th century, but I can’t remember for sure).\nThat same scientist indicated the original results were “averaged” and commented that individually the differences were beyond acceptable tolerances.  He went on to say that should have alerted them to a problem, but they ignored it.  This might help, a report of the carbon dating results.  http://www.shroud.com/nature.htm \nIf you look toward the bottom, Table 3, the date ranges are all over the map.\nAlso, note the 2 other contributors, including the British Museum’s Research Laboratory.  And of the testing labs, the Research Laboratory for Archaeology and History of Art, University of Oxford.  Given what was at stake, it seems highly unlikely the Vatican would have given samples of a priceless relic to anything but reputable laboratories, so your comment about peer review, questioning the lab results, is not really valid.\nAs you can see, what you believed to be assumptions, were not assumptions on my part, they were reported by one of the original testing scientists from the Arizona lab.\n\n","date":"March 3, 2015 at 11:01 am","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-192290","author":"Steve Vitale","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"Almost nothing of the comment above is true, and little is even close to the truth.\n\n","date":"March 2, 2015 at 12:59 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-192208","author":"Hugh Farey","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"Has anyone else seen the Part 2 of the PBS special Steve mentions? I haven’t, so I don’t know the context of his claim that members of the original C-14 lab teams have admitted to botching the process. Also is anyone else aware of the testing he mentions of the ‘repaired swatch that got a 1st century date — this is news to me. Fanti?\n\n","date":"March 3, 2015 at 12:54 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-192292","author":"David Goulet","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"Well this has certainly been ridiculously more frustrating than I had bargained for.  I applied the date filter in YouTube to a Shroud of Turin search and there’s nothing older than 5 years.  The second time I saw the Part 2 show I mentioned was probably early 2000’s.  The carbon dating was done in 1988, so the two shows were probably produced in the 90’s.\nAlso, I said the show MAYBE PBS.  I searched on the PBS, Discovery, History Channel, KCET, websites and there’s nothing related to the shroud.  It’s not surprising they don’t have programing archives going back over 10 years.\nSo I guess I’m SOL.  I saw the show twice and I know what I heard.  Believe want you want.  The only other interesting tidbit I remember (but not really relevant to the results) is, the Arizona lab scientist interviewed on the show included a side story of a colleague (and shroud tester) who was adamant about the shroud being a fraud.  He’s the guy I mentioned that said they had scanned the shroud and didn’t see repair fabric, so he questioned that theory.  While they were studying their last testable shroud swatch and eventually testing it, the colleague contracted cancer.  He died after the testing was completed, but before he did, he made a plea to the interviewed scientist to make sure the new test results were made public and the truth be known (which admitted they had made errors in the original tests).   A bit of drama, I know, but an interesting side note.\n\n","date":"March 4, 2015 at 12:27 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-192400","author":"Steve Vitale","site":"shroudstory"},{"title":"Two More Articles About Upcoming CNN Series on Finding Jesus","post":"it would be nice if Steve remembers and provides a link.\n\n","date":"March 3, 2015 at 2:19 pm","url":"https://shroudstory.com/2015/02/13/two-more-articles-about-upcoming-cnn-series-on-finding-jesus/","cat":"press_coverage","id":"comment-192299","author":"Louis","site":"shroudstory"}]
