[{"title":"Wayne Phillips:  Hopes to create a small “Shroud Army”","post":">> they had better be prepared to stand their ground against the critics. For the 100 facts in the shroud’s defense, Linse says, “we can counter with 1 million that show it’s a fake.<<\nI'd like to know what those million facts are that show it to be a fake. I know of two: The D'Arcis Memorandum, and the 1988 C-14 test. Both are very problematic(the C-14 more than the memorandum), but I would think that the rest of the evidence is in favor of authenticity, or at least that it's not a work of art in any conventional sense.\n\n","date":"April 20, 2014 at 11:33 am","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","id":"comment-101676","author":"Chesterbelloc","site":"shroudstory"},{"title":"Wayne Phillips:  Hopes to create a small “Shroud Army”","post":"Dr. Phillips,  I appreciate your work and hope to hear more about it in the future.  In the 70’s I saw a mock-up of the man whose image is on the shroud.  The art piece was standing to the side of the entrance to the Chapel at the Air Force Academy in Colorado Springs.  I stood next to it and felt as though this was a true human form in perfect dimensions.   I’ve been curious ever since.  I want to believe it is real, but also being a scientist (Regis University a Jesuit school), I need that proof to substantiate my belief.  I do have a question of you that I’ve never seen discussed probably because it might seem indelicate to the general public.  My question is what is on the back side of the cloth?  All we ever see in photos are the front view but I know the 14′ length of cloth was used with the body laying on it then folded up and over the front.    My thoughts are that the backside should reveal pooling of blood and other materials as the man was dying and after he had died.  Is this the case?  Do these findings further substantiate the validity of the cloth?  Did the shroud fold over the man’s feet or the man’s head?  Why is only 1/2 of the cloth ever discussed?  I guess I had more than one question, ha!  Thanks for your time,  Ali\n\n","date":"April 20, 2014 at 12:21 pm","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","id":"comment-101685","author":"Ali Eleam","site":"shroudstory"},{"title":"Wayne Phillips:  Hopes to create a small “Shroud Army”","post":"Hi Ali. I’m sorry I’m not Dr Phillips, but I guess I can answer your question as well as any. By the “back” side, do you mean the side that wasn’t touching the body? Or the side that was touching the body, but lay underneath it so that the image of the back appeared on it?\nA quick Google search will give you the images of both halves of the cloth, with the front (face and arms) and the back (buttocks and footprints) sides. To find a picture of the outside of the cloth, which bears no image and less blood, try http://shroud.wikispaces.com/PROPERTIES.\nThis side, without the images, has very rarely been seen, so it is difficult to discuss. Since 1534 it has been hidden by backing cloths, and was only exposed briefly in 2002 when they were changed. Even so, some people have tried to analyse the photos that were taken and think they see a faint image of at least the face. More controversially, some people think the two images of the face (on opposite sides of the same area of cloth) show two slightly different positions of the features. It might be supposed that the half of this cloth that was in contact with the surface of the tomb would have stains or stone dust from the tomb on it, but this has not been confirmed.\nAs for the folding, if it covered a body, the sheet was folded over the head, which is why the two images of the heads are close together. It looks as if the body was laid on the cloth with a short distance over at the foot end, which was folded up over the toes, and a body’s length at the head end, which was draped back over the head and laid against the insteps, possibly even overlapping the bottom bit of cloth by an inch or two.\nI assure you that although the face and front half of the image is most discussed, the rest of the Shroud has been far from neglected!\n\n","date":"April 20, 2014 at 1:28 pm","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","id":"comment-101697","author":"Hugh Farey","site":"shroudstory"},{"title":"Wayne Phillips:  Hopes to create a small “Shroud Army”","post":"Hi Ali, please check out this clip From Dr. John Jackson from the US Airforce academy. It gives more insight about how the shroud wrapped the body specially with emphasis on the blood stains\nhttp://m.youtube.com/watch?v=UmYuI1qJMRU\n\n","date":"April 20, 2014 at 2:07 pm","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","id":"comment-101710","author":"Mike M","site":"shroudstory"},{"title":"Wayne Phillips:  Hopes to create a small “Shroud Army”","post":"Fact? Really?  “according to Phillips, most were in the group were agnostic, and only two were Catholics.”  Really?\n\n","date":"April 20, 2014 at 3:00 pm","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","id":"comment-101722","author":"Paulette","site":"shroudstory"},{"title":"Wayne Phillips:  Hopes to create a small “Shroud Army”","post":"Actually, there were 3 or 4 Catholics, 3 Jews, 1 Mormon, 1 Evangelical, some Protestants of various denominations in addition to some agnostics (and perhaps even some atheists). Since declaring one’s religious affiliation was never a prerequisite for membership in the STURP team, we don’t have an accurate list. Members were asked to join the team based solely on their scientific or technical skills and what they could contribute to the scientific examination of the Shroud.\n\n","date":"April 20, 2014 at 3:36 pm","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","id":"comment-101734","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Wayne Phillips:  Hopes to create a small “Shroud Army”","post":"Now we have a sceptic saying it is a “rubbing”. I tried the brass rubbing at the cloisters at Westminster Abbey many years ago but of course the two are far different things:\nhttp://www.inquisitr.com/1219540/shroud-of-turin-a-fake-like-bigfoot-says-skeptics-society-founder-on-easter-sunday/\n\n","date":"April 20, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","id":"comment-101746","author":"Louis","site":"shroudstory"},{"title":"Wayne Phillips:  Hopes to create a small “Shroud Army”","post":"“A highly stylized, somewhat amateur…” does anyone else find this nonsensical?\n\n","date":"April 22, 2014 at 12:00 pm","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","id":"comment-102393","author":"David Goulet","site":"shroudstory"},{"title":"Wayne Phillips:  Hopes to create a small “Shroud Army”","post":"A nice example about what happens when there is no interest in the TS, which can be forgiven, and there is no depth of thought, much less sufficient learning:\nhttp://ffrf.org/news/blog/item/20393-leave-no-stone-unturned-an-easter-challenge-for-christians\n\n","date":"April 22, 2014 at 12:42 pm","url":"https://shroudstory.com/2014/04/20/wayne-phillips-hopes-to-create-a-small-shroud-army/","cat":"press_coverage","id":"comment-102403","author":"Louis","site":"shroudstory"}]
