[{"title":"What Type of Person Are You?","post":"Do you know Maria Valtorta?\nIn Viareggio, next Saturday (17 October 2015),\nthere will be another meeting of studies (and\nresearch) on the familiar figure of Italian\nmystic: Maria Valtorta …\nLinks:\n\nhttp://www.fondazionemariavaltorta.it/it/conferenze.php\nhttp://www.fondazionemariavaltorta.it/it/news.php?idm=57-14-2015\n\n","date":"October 13, 2015 at 8:01 am","url":"https://shroudstory.com/2015/10/13/what-type-of-person-are-you/","cat":"article","id":"comment-212430","author":"piero","site":"shroudstory"},{"title":"What Type of Person Are You?","post":"Her book was placed on the Índex of Prohibited Books by the Holy See. Imagine Jesus dictating to her about his earthly life, to form a fifth gospel!\n\n","date":"October 13, 2015 at 8:30 am","url":"https://shroudstory.com/2015/10/13/what-type-of-person-are-you/","cat":"article","id":"comment-212432","author":"Louis","site":"shroudstory"},{"title":"What Type of Person Are You?","post":"It is important to remember that there are mystics and “mystics”. Gaddafi acted as though he was a mystic and a true one would be Meister Eckhart, who influenced C. G. Jung.\nThe Aleteia site to which Dan provided a link brings good news:\nThe Syrian Catholic priest Father Jacques Mourad was released by the IS this week. He was known to negotiate with other terrorists like the Al Nusra group, who respect him. It looks like the IS did too. Is it charisma? Is he another Francis of Assissi? Look at him:\nhttp://aleteia.org/2015/10/11/syrian-monk-abducted-by-isis-is-free-celebrates-first-mass/\nNow to the main topic. Dan says “And there there are for those of us who…”\nHe is right. I have met people in some cultures who live without thinking about the “whys”, why we are  here,to where we will go, what is the meaning of it all. They only think about building a house, eating well, getting married, having children, dividing the property (if possible peacefully) and then preparing to die, not bothering about religion. I have also met one religious person who goes to church every day and told me that life is “family and friends”!\nRock-bottom truth is not easy to find, the faith element is always there. Some have faith, others don’t:\n https://www.academia.edu/8424286/Book_Review_The_Future_of_Atheism_Alister_McGrath_and_Daniel_Dennett_in_Dialogue\nOthers died as agnostics, but encouraged science-theology dialogue:\nhttps://www.academia.edu/14727603/Why_Stephen_Jay_Gould_proposed_the_principle_of_Non-overlapping_Magisteria\nYet others shunned organised religion but were not atheists:\nhttps://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\n\n","date":"October 13, 2015 at 12:30 pm","url":"https://shroudstory.com/2015/10/13/what-type-of-person-are-you/","cat":"article","id":"comment-212443","author":"Louis","site":"shroudstory"},{"title":"What Type of Person Are You?","post":"Louis,\nI am curious about the opinion of\nC. G. Jung about “the case of Maria Valtorta”…\nI think there is nothing at all about\nMaria Valtorta in the papers by Jung.\nIsn’t it?\n— —\nHere the old news:\n>… … ISIS published a video consisting of still photos\nshowing the destruction of the Monastery of Mar Elian,\nin the central Syrian town of al-Qaryatain.\n>The jihadist group said it destroyed the monastery\nbecause it “is worshiped beside Allah,” according to\nthe UK-based Syrian Observatory for Human Rights,\nwhich reported the destruction Aug. 20.\n>The video also shows the exhumation of the remains\nof St. Elian (pictured), who was killed by his father, a\nRoman officer, for refusing to renounce Christianity.\n>Militants who carried out the destruction reportedly\ntook some residents of the town, including Christians,\nto their “capital,” the Syrian city of Raqqa, according\nto the Observatory.\n>Mar Elian Monastery is the home of Father Jacques\nMourad, who was kidnapped there in May.\n>Father Mourad worked for reconciliation in the local\ncommunity since the beginning of the civil conflict\nin Syria. … … \nSo… on one hand we can be happy for the liberation\nof Father Jacques, but on the other we have the\nsad ruins and horrific destruction of other\nhuman lives …\nHere the other informations (on the same webpage):\n>…The Assyrian International News Agency said\nthat Mar Elian was founded in the 5th century as\na Syriac Orthodox Monastery. In the 17th century\nit became Catholic. Ten years ago, it was renovated\nby the prior of the ancient Mar Moussa al-Habashi\n(St. Moses) monastery, Jesuit Father Paolo Dall’Oglio.\n>Father Dall’Oglio was kidnapped by ISIS in July, 2013. …\n\n","date":"October 14, 2015 at 8:48 am","url":"https://shroudstory.com/2015/10/13/what-type-of-person-are-you/","cat":"article","id":"comment-212479","author":"piero","site":"shroudstory"},{"title":"What Type of Person Are You?","post":"Piero\nAlthough he was a Catholic in mind and heart C.G. Jung did not bother about Maria Valtorta probably because she was not known. He was also very old at that time, unable to go to England to see his closest friend, the American Dominican monk Father Victor White, who was dying.\nChristianity is all but finished in Syria, thanks to Obama and Hilary Clinton.\n\n","date":"October 14, 2015 at 10:35 am","url":"https://shroudstory.com/2015/10/13/what-type-of-person-are-you/","cat":"article","id":"comment-212485","author":"Louis","site":"shroudstory"},{"title":"What Type of Person Are You?","post":"There is a correction to make;\nThe Syrian monk Father Jacques Mourad was not freed by the IS. He actually escaped with the help of a Muslim:\nhttp://aleteia.org/2015/10/15/father-jacques-mourad-i-felt-jesus-presence-in-isis-captivity/\nHe has been helping both Christian and Muslim communities hit by violence in the country.\n\n","date":"November 2, 2015 at 6:43 am","url":"https://shroudstory.com/2015/10/13/what-type-of-person-are-you/","cat":"article","id":"comment-214090","author":"Louis","site":"shroudstory"}]
