[{"title":"Windsor Star Story on Upcoming Shroud of Turin Exhibition","post":"Dan,\nDon’t be so hard on press hyperbole. Barrie can speak for himself but the facts, as he reported in the BSTS Journal and other places  are that as a Jew (whether observant or not) he was reluctant to get involved with a “Christian” relic. One colleague, who was also Jewish (Don Devan) convinced him that because they were Jewish and had no one would expect  them to have a bias toward authenticity. \n“So at Don’s [Devan’s] suggestion, I became a member of the STURP team, but I didn’t feel very comfortable about it. In fact, a few months into the project, I remember jokingly saying to Don Lynn at one of our many meetings, ‘”What’s a nice Jewish boy like me doing on a Christian Project like this?’\n“Don smiled and answered that perhaps I had forgotten that ‘the Man in question was also a Jew.’\n“’No, I knew that,’ I stated. So then Don gave me some of the best advice I’ve ever been given. He said, ‘God doesn’t tell us in advance what the plan is. Go to Turin and do the best job you can. Someday, you’ll know why.’ His words kept me on the team at that time when I was seriously considering quitting. And to make a long story short, he certainly was right!”\nBarrie’s lingering doubt was the issue of the blood evidence and its bright color. An explanation offered in a discussion with Al Adler in the 1990’s finally resolved that issue. In 1995, a friend called him told that the friend and his wife had seen a headline in a sensationalist magazine sold at supermarket checkout counters that revealed that the Shroud was “a photograph” created by Leonardo DaVinci.”  Schwortz decided that the resources, including his own photographs of the 1978 STURP examination which he had shared with numerous authors, needed a wider audience. He made a note in a file folder sitting on his desk: “Consider building a website.” A short time later he had a conversation with Don Lynn and reminded him of the advice he had received: :\n“Years ago, when you told me that someday I would know why I was on the Shroud team, well, you were right. I’ve finally figured it out and it only took eighteen years!”\nThere are a lot of things the press has gotten wrong about the Shroud at various times. Don’t be too hard on a reporter for a little hyperbole because the essence of what he was reporting is true: Barrie approached the Shroud as a skeptic and had lingering doubts  of authenticity for many years after. He was also a skeptic of the carbon dating because on thing h did know from the STURP examination: the Shroud was not a painting. \nI certainly hope the pseudo-skeptics who sometimes populate this blog don’t use your post as an excuse to launch any attack on Barrie or the press.\nBy the way, all of this is covered in detail my book Quantum Christ:  Chapter 11: “The Return of Ray Rogers.” See http://johnklotz.blogspot.com for details.\n\n","date":"February 19, 2015 at 7:55 am","url":"https://shroudstory.com/2015/02/19/windsor-star-story-on-upcoming-shroud-of-turin-exhibition/","cat":"press_coverage","id":"comment-191378","author":"John Klotz","site":"shroudstory"},{"title":"Windsor Star Story on Upcoming Shroud of Turin Exhibition","post":"The hyperbole hides the fact that Barrie always approached the subject of authenticity with admirable objectivity.\n\n","date":"February 19, 2015 at 9:02 am","url":"https://shroudstory.com/2015/02/19/windsor-star-story-on-upcoming-shroud-of-turin-exhibition/","cat":"press_coverage","id":"comment-191382","author":"Dan","site":"shroudstory"},{"title":"Windsor Star Story on Upcoming Shroud of Turin Exhibition","post":"Maybe I can be considered boring and out of tune\n(and certainly, often, I am reduced in these conditions! …).\nBut, unfortunately, the sanctity of the Precious Blood has not always been well regarded when in the past were performed examinations that were (if I remember well) destructive …\nThis is one of the reasons why I prefer nano-analyses non-destructive.\nPerhaps I should  reduce my negative claims that I made in this short note…\nBut I am perplexed (as usual) about the lack of advanced controls. See also the case of the presumed ancient balms (Marzia Boi, palynologist), the inherent technical level used to detect these interesting traces and the questions about the incontrovertible certification…\nReally an exhibition can raise awareness to be more reverent toward\nthe bloodstains of the Shroud by Jesus?\nDon’t we should perhaps really rely on the Medical Robots for future reverent (and high-tech) nano-analyses?\nWhen it comes to working at the nanometer level are more perfect\nnano-robots or men?\n\n","date":"February 19, 2015 at 12:49 pm","url":"https://shroudstory.com/2015/02/19/windsor-star-story-on-upcoming-shroud-of-turin-exhibition/","cat":"press_coverage","id":"comment-191391","author":"piero","site":"shroudstory"}]
