[{"title":"A Significant Article by Charles Freeman in History Today","post":"I don’t buy this. You know something? The d’Arcis memorandum keeps ringing in the ears of sceptics, but no painting could produce such a superficial image.\n\n","date":"October 17, 2014 at 3:57 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163202","author":"Louis","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Totally uncalled for ad hom attack which the moderator should remove!\n\n","date":"October 17, 2014 at 4:10 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163205","author":"David Goulet","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"David, have you read the entire article? I have. Strongly not recommended. In fact old McCrone rubbish once again.\n\n","date":"October 17, 2014 at 4:13 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163206","author":"O.K.","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I have no problem with a critical rebuttal to Charles. The link you provided as a good start. But unless you have the gift of telepathy you cannot accuse him of a deliberate attempt to deceive. It is quite possible Charles believes in his own theories and observations. If you can poke holes in his theory, please do. But unless you have evidence that his goal is to knowingly deceive others, please refrain from such accusations.\n\n","date":"October 17, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163207","author":"David Goulet","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I tend to agree with OK. There are a number of flaws with the article, including that which I point out above.\nI have little time for non-thinking authenticists. I also have little time for skeptics who have a close minded agenda.\n\n","date":"October 17, 2014 at 6:57 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163267","author":"Thomas","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"O.K. You know that there is an attempt now to keep the blog clean, avoiding character assassination. I like your work, and you have indeed done good and considerable research, but you should try and maintain the standards, however difficult it may be.\n\n","date":"October 21, 2014 at 3:42 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164407","author":"Louis","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Louis, I know what you mean, but this all is going into farce.\nYou know obviously that the Shroud is not a painting, for several reasons; no significant amount of paint, negative character, 3D-properties, extreme superficiality, no fiber cementation, no directionality, isotropic Fourier characteristics, etc, etc.  We  have discussed those issues many times. We know that STURP found no evidence for the Shroud being a painting, we have also excelllent Isabel Piczek presentation on the topic: http://www.shroud.com/piczek.htm and so on.\nSo you know obviously that Charles’ thesis is a nonsense -and so do Daveb, Mario, anoxie, Mike, Max, Thomas, Thibault, Yannick, everyone with some knowledge on the Shroud. And nevertheless we have pretend that we treat those absurd claims of Charles seriously. Isn’t it a little bit kidding? Of course it is well known to us that they have virtually no basis, and I don’t suspect that even Charles himself really believes they have. It seems he plays with us, challenging us on his terms to convince him he is wrong. What’s worse, although obviously bogus, this article was published in, as Charles claims, a “serious historical journal”, thus providing wrong perception of the Shroud to the readers. And what sounds even more cynical, Charles not only has knowingly (and probably intentional) published misleading, agenda-driven article, but also has received money for that. Is that really fair? How not get irritated by all of these issues? Shouldn’t someone rather say openly that Charles is delliberately deceiving people? That he indeed uses dishonest means, and his intentions are not really true, contrary to what we should have assumed?\n\n","date":"October 21, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164416","author":"O.K.","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"But one aim of my article is to show with evidence that STURP got it wrong on the painting, partly on the evidence that STURP found for large quantities of calcium carbonate, part of the gesso mixture  that , according to the medieval sources was put on the outer fibrils of a cloth with a knife to seal it before painting. No one on STURP had a clue about medieval painting and did not even bother to ask any specialist. They would have been told at once’ “Calcium carbonate just in the outer fibrils and no evidence of brushwork? Yes, that suggests a gesso applied as it should be with a knife to seal the cloth so that paint could be added.”\nYes, I do believe that- it makes good sense,not nonsense.\nThis posting was put up on this website and I have every right to respond to comments, abusive or otherwise on it but the quality of my argument will be tested on specialist websites, not here.\nI do not respond to abusive remarks. They make absolutely no contribution and simply degrade those who make them.\n\n","date":"October 22, 2014 at 12:29 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164498","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"(Comment displaced)\nRe calcium carbonate:\nLimestone is mainly calcium carbonate. In light of a Second Temple period burial, Jerusalem limestone-dust (+ Red heifer ashes? )mixed with water could have been used on the TS man’s burial in order to create an alkaline solution and soak in the large inner burial wrapping (aka TS). Once the body tightly wrapped up in additional dry shrouds and subjected to an aloetic fumigation, it could have purified the crucifixion’s shed innocent blood and kill flesh flies’ larvae and blow-flies’ eggs.\nBut methinks if heard through Charles’ ears-and-brain all this shall be ‘irrelevant’ since he just cannot imagine the real possibility for the TS to date back to the 1st c. CE.\nBesides:\n1/When “the wound and welts and open sores” (scourge marks included) are also symbolically represented as stylised flowers or palmettes painted all-over Yeshua’s himation/sindon in 1268 CE Armenian Iconography? an himation/sindon in the 1267-1268 CE Malatia Armenian Gospel Iconography\n2/When a Descent from the Cross miniature from the Bamberg Psalter, (ca 1255 CE, Melk, Stiftsbibliothek), depicts Yeshu’a with a transparent loincloth with scourge marks all over his body\n3/When Yeshu’a’s scourge marks are already represented as early the first quarter of the 9th c. CE in the Stuttgart Psalter flogging scene, and re the Psalter miniature and TS dorsal-frontal image Christ-like figure connection, to the astute observer:\n●Both are stark naked with long flow of hair in the back.\n●Both have arm(s) bound and/or crossed in front.\n●Both have bloodied furrow and/or scourged marks in conjunction with two whips with lashes each fitted with doubled pellets implying two executioners\nHow can Charles still believe and want us to believe along with him that “all-over flagellation marks as seen on the Shroud ONLY COME IN THE 1300s” (SIC! my upper cases)?\nHow can he still thinks it is “the clinching point for a 14th century iconography” as “the flagellation has to be from the crown of the head to the soles of the feet (SIC!) to fit with the link to Isaiah 1:6. that Marrow sees as the inspiration of the iconography.”\nReminder for Charles and Mr Marrow: Isaiah 1: 5-6 does NOT specifically refer to scourge-marks as it reads:\n“Your whole head is injured,\nyour whole heart afflicted.\n6 From the sole of your foot to the top of your head\nthere is no soundness—\nonly wounds and welts\nand open sores,\nnot cleansed or bandaged\nor soothed with olive oil.”\nCould Charles show us scourge-marks on the TS man’s ‘crown of the head” and “soles of the feet”, PLEASE? There are none in those specific body areas! Marrow’s forced interpretation and consequently Charles’ is biased as too reductive.\nRe the Constantinople Sindon, Charles also wrote: “there is NOT A SHRED OF EVIDENCE (my upper cases) that it is the Shroud that (944-1207 testimonies and eye-witness descriptions) are referring to”.\nFirstly, could he tell us then to which ‘non painted bloodstained sindon’ presented as Yeshua’s burial (and resurrection!) cloth, are the 944-1207 testimonies and eye-witness descriptions referring to?\nSecondly, could he refer us to the Medieval Art expertise positively concluding, as Charles peremptorily asserts, the image on the Turin Shroud results from pigments disintegration and can be compared to thousand of painted images on cloth of which pigment disintegrated with time?\n\n","date":"October 22, 2014 at 11:39 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164650","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Addendum: the presence of limestone all over the TS is also consistent with its placing as corporal on limestone altars.\n\n","date":"October 22, 2014 at 1:01 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164667","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"(Comment displaced)\nCharles, you wrote:\n“I know of NO CASE (my upper cases) where a depiction of the Shroud before 1563 had a loincloth on it and every depiction after 1578 does have a loincloth on it “.\nRe bare-handed ostension of the image of the Shroud man with and/or without loin cloth:\nEarly in the 16th c CE (that is definitely ‘before 1563′), a mural external fresco, cemetery church of Viverone in Piedmont, (phototograph by Massimo Centini), does show the Shroud man with a loin cloth\nWHILE\nIn the mid 16th century the detail of a miniature from the Turin Royal Library, does show the Shroud man ventral image with a loin cloth and dorsal image with no loin cloth!\nNow Charles do you make of the two cases where depictions of the Shroud just do not fit in your so-called ‘theory’?\n\n","date":"October 23, 2014 at 12:00 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164896","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles,\nI have your article.\nSome comments posted here are regrettable. \nI’ll post tomorrow my own critic of your paper.\n\n","date":"October 22, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164690","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"David:\nBut unless you have the gift of telepathy you cannot accuse him of a deliberate attempt to deceive.\nPerhaps I have such gift… or perhaps I have simply experience… We have discussed here many times many different issues with Charles and others, and I simply know what to expect from him, or several other frequent commentators. And I try not to be naive… Not everyone has good intentions…\n\n","date":"October 17, 2014 at 4:23 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163210","author":"O.K.","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I recall Charles suggesting that research be done into possible alternate historical routes for the shroud, from Jerusalem to Europe. Why we would he do that if he was not at least open to the possibility of authenticity? Can you point to actual postings where there is evidence of him deliberately providing misinformation? I’m not talking about debatable conjecture but clear examples where he provided misinformation and was called on it. I believe if you are going to accuse someone of conspiring to mislead you need to provide evidence. Again, I’m not an apologist for Charles, I’m not convinced by his theory — but neither am I convinced he is a wolf in sheep’s clothing….not until someone shows me some dog hair.\n\n","date":"October 17, 2014 at 4:41 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163213","author":"David Goulet","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"David, remember. I don’t accuse Charles of spreading lies. No. It’s too strong, and Charles does not lie, that means he does not say blatant lies. The problem is, call it, his “creative approach” to the truth. And then it is hard to prove someone’s bad will -even if it is evident to someone other…\n\n","date":"October 17, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163218","author":"O.K.","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I think the article goes off the rails when it mentions among the “loin cloth” as being among the details no longer seen today. Does Charles really believe that painted images of the loincloth were somehow rubbed off the Shroud, only to reveal buttocks underneath? Adding to that that other early paintings show circular crown of thorns, nail wounds in the palms,and other details that we know aren’t there, this is a fairly unconvincing article.\n\n","date":"October 17, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163212","author":"Chesterbelloc","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"The alleged “loin cloth” is simply the fact that the areas around hips are less pronounced, due to the cloth being raised a little bit (remember 3D properties!) where it’s going above the crossed hands on the crotch, no mystery here. But if the “loin cloth” fairy tale can be sold to a few uninformed people… why not?\nThe whole thing seems an incredibly cynical attempt to find out a few idiots who will buy it…\n\n","date":"October 17, 2014 at 4:44 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163214","author":"O.K.","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I certainly don’t think it’s a “deliberate attempt to deceive”; Dr. Freeman I’m sure believes what he writes. But the idea that St. Charles Borremeo had someone paint a loin cloth on the Shroud, and now it’s gone, is silly. I’m sure the Shroud that St. Charles saw had the same naked figure that it always has had, but an artist copying the Shroud painted the loincloth on for modesty’s sake. Likewise the circlet crown of thorns, and wounds in the palms, because this is what people expected to see based on the depictions of the Crucifixion in their own parish Churches.\n\n","date":"October 17, 2014 at 5:02 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163219","author":"Chesterbelloc","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"It is ironic that Charles Freeman complained in another thread that “The publication of Fanti’s dates was a classic case of how news operates today. ( See Nick Davies’ book Bad News.)” and we see this kind of article in the popular press.\nHow can the paint has vanished such that “There are features – the Crown of Thorns, the long hair on Christ’s neck, the space between the elbows and the body, the loincloth – that can no longer be seen today. “. How can a loincloth, that was there on the Shroud, would have completely vanished and let human body features appear under it? How can this have happened is beyond common sense and I can only conclude that you accidentally made an error.\nCharles, do you really believe that, or you made an error in your article?\nHow can the loincloth disappear and a pair of buttocks appear? Please explain.\nAlso, did you notice that today the blood is totally different than the image? How do you explain that from your theory that both comes from “paint” that mostly disappeared?\n\n","date":"October 17, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163222","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I would like to read Charles’ answer to this. Why would an artist spend so much time constructing such a detailed ‘buttocks’ just to (at least partially) cover it with a loincloth? The placing of the hands is deliberately trying to cover the genitalia, thus suggesting nudity.\n\n","date":"October 17, 2014 at 5:25 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163227","author":"Eric","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Eric. Read the article. The images were painted naked, c 1325-50 , they were only  covered with a loincloth two hundred years later  after the 1563 decree from the Council of  Trent – the same decree that led to the covering up of Michelangelo’s Sistine ChapelLast Judgement nudes – but it is all in the article with the specific links to the clergy who were associated with both the decree and the Shroud.\nBut there is no point in my having to point out these things when the article is clear but will be further enhanced in the digital edition with more illustrative back-up – sorry ,folks, but History Today have a pay wall, but you do get lots of other articles as well!\n\n","date":"October 17, 2014 at 5:35 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163232","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"But it is clear that you do believe that a loincloth could have been painted over the buttocks area and that it would have disappeared with time. I think this is unbelievable! How can this have happened is beyond comprehension! It is not even recorded historically (erasing the loincloth) and there is no physical explanation of how this could be done without leaving any trace.\n\n","date":"October 17, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163241","author":"latendre","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I wi take the time to read the original article later. At the time of asking the question I had only read the paragraph quoted due to a parallel conversation with Max in another topic.\nHowever, that still leaves the question of “why?” open… If an artist was trying to sell a painted shroud as a legit relic, painting it in line with the established depictions from the beginning would have secured an easier sell or, in the case that it was painted for a Church, would have avoided the possibility of it being rejected. \nAlso, if the shroud was regarded as authentic… Would painting over it not be considered desecration? I believe that your hypothesis depends on the idea that the owner of the shroud at the time of adding the loincloth was aware that it was a painting. Is this right?\n\n","date":"October 17, 2014 at 6:27 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163254","author":"Eric","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"* will\n\n","date":"October 17, 2014 at 6:29 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163255","author":"Eric","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"In case that the last paragraph is a bit ambiguous. My point is that regardless of the power of the ecumenical council (the Council of Trent as mentioned), I am hesitant to believe that anyone would dare to touch the shroud if there was at least a possibility that it is a legit relic. To paint over the original, the owner should have been absolutely certain that it was a forgery… At the same time that it was being displayed publicly. There are deeper implications to this argument.\n\n","date":"October 17, 2014 at 6:42 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163259","author":"Eric","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"In my opinion Charles’ argument is garbage. The artistic impressions of the Shroud show a loin cloth because that was the artistic convention, being highly distasteful to show Christ’s buttocks.\nAnd the fact that the earliest depiction of the Shroud – Lier in 1516 – does not show a loin cloth, is close to fatal for his theory.\n\n","date":"October 17, 2014 at 6:54 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163263","author":"Thomas","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"The Lier copy shows a nude figure but as this is pre-1563 that is what I would expect.\n\n","date":"October 18, 2014 at 2:30 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163361","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"The crown of thorns is highly likely to have been  “artistic embellishment”.\nIt’s an interesting question in itself as to why different artists did or did not represent certain features on the Shroud. Only a couple show the “blood belt”. Most don’t. Why?\nWho knows. Maybe because this was not seen to hold spiritual significance, like the “classic” Jesus wounds.\nSome show the “poker holes”, others do not. Interestingly, earlier (pre fire) depictions seem more likely to represent the poker holes. Quite possibly this is due to the fact that they would have been a most conspicuous feature prior to the fire.\nThis, I believe, provides a strong clue as to why they were shown in the Pray Manuscript – they were very prominent pre-fire and quite possibly attained symbolic significance.\n\n","date":"October 22, 2014 at 6:36 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164576","author":"Thomas","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I am happy to let this debate run.  I do believe I have a better hypothesis for the formation of the images than any others going but if you want an answer to how the image was formed you will need to paint a linen cloth according to the medieval manuals, as quoted in my articles, with a layer of gesso on the outer fibrils only, with paint on top of that. Then you need to apply some rough treatment, e.g. dramatic unfoldings, as in the Tempesta engraving I illustrate, over many decades, wait for five hundred years and you may have just the faded image left. As none of us are likely to be around in five hundred years time, the matter may never be resolved but I am putting out the call for conservationists who specialise in ancient painted linens to see if t hey have other examples with which to compare the image on the Shroud.\nThe fully illustrated article( I.e. with several more illustrations) will be in the digital edition of History Today next week with an accompanying podcast I recorded earlier today. I also have a full set of footnotes for which I will soon provide the link. (History Today do not do footnotes. But I felt that it was right to provide them)\nHistory Today is a well respected journal in which professional historians write for history buffs. This is my fifteenth article for them. I have no idea who peer- reviewed my article before acceptance but some of  Britain’s top historians are on the advisory board. Much of the article has been checked for me by specialists  in the areas I discuss and an Oxford professor in medieval church history has read and approved of the whole. My aim is to bring in experts who have not so far been involved in the Shroud to cover the many important areas  where serious research on the Shroud has not yet begun.\nCopyright in the articles is not mine but with History Today. All illustrations have been acknowledged and paid for by History Today.\nI am not intending to involve myself  further in the debate unless something. I have written has been misrepresented.  I would not expect a consensus among historians, art historians, weaving specialists and experts in medieval liturgy to have formed in less than a year so I shall sit back for a bit and see what happens.\nWhatever responses I get I am grateful for the interest and hope the  responses are directed at the evidence I provide. That is the only way to move forward.\n\n","date":"October 17, 2014 at 5:14 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163223","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"So I ‘ve had a closer read of the article. Sorry, Charles did not advocate that the shroud was painted on from the start and then wore off, or was removed. He proposes it was artisticaltly added on, and then wore off. But as Eric suggests, there are big problems with this theory in terms of the lack of physical evidence.\nFar more likely that the loin cloth was just added in to the artistic impressions of the Shroud.\nI think its also a huge assumption to say that because the artistic impressions show the image boldy that this means that the real Shroud image was much bolder. It may have been bolder, but “that much” bolder?\nFar more likely, again ,that the images are that bold because the artists wanted to clearly demonstate the image.  And again, the Lier image moderately successfully illustrates a faninter type of image  -evidence that it was always rather faint, rather than boldy painted.\n\n","date":"October 17, 2014 at 7:13 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163268","author":"Thomas","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Well, you can’t have read very far as I argue that the iconography of the painting , made probably just after the Shroud was woven, is typical of the first half of the fourteenth century. It was painted early on ,and if you read on in my article you will find that the best bet is that it was for the Quem Queritis ceremony on Easter morning.\n\n","date":"October 18, 2014 at 2:00 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163353","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I think you miss my point – maybe I didn’t express myself clearly.\nYou argue in the article that the artistic representations from the late 1500s – bold and clear as they are – suggest the Shroud image was much bolder at that time in the 1500s, and has since faded.\nMy point was that the Lier image – made in the early 1500s – is clearly suggestive of an artist trying to represent the faint image that we still see today.\nDo you disagree? If so why? I think its pretty clear that the Lier image is trying to represent the faint Shroud image, with its various accents. \nTherefore the much bolder images of latter dates are not bold because the Shroud image was once much bolder and clearer. Rather, they simply indicate a lack of skill- or interest on behalf of the artists- in trying to represent the faint image. \nie. it was the 16th century artist’s equivalent of us using digital enhancement today to better show the image.\n\n","date":"October 22, 2014 at 6:07 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164564","author":"Thomas","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Copies from 1568, 1634 AND IN PARTICULAR 1643 also strongly suggest that the image in the 1500s / 1600s was very faint even then\n\n","date":"October 22, 2014 at 6:18 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164569","author":"Thomas","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"At the conference in Würzburg, there was a very interesting presentation by Carolina Lutzka (‘die byzantinischen Hymnen auf das Mandylion’), on the Byzantine hymnes on the ‘mandylion’. In these hymnes, the image is characterized as having been imprinted (on a piece of textile) ‘without colour’ (achromastikon tuposas seautov) or with ‘strange colours’ (‘ksenois chromasin’). Arguably, the unknown authors of these hymnes tried to describe the unusual chromatic properties of the image on the mandylion. This suggests that the image was not perceived as being ‘painted’; paintwork implies the presence of ‘colour’ in the usual sense of that word.\nIncidentally, there are also numerous passages indicating that the image on the mandylion was not a face only, but a complete ‘gestalt’ (‘morphei’). That such was the case, was (on other grounds) also argued by  prof.Karlheinz Dietz (‘Das Abgardbild als Ganzkörperbild’)\n\n","date":"October 19, 2014 at 1:46 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163804","author":"Jos Verhulst","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Fascinating Jos\n\n","date":"October 22, 2014 at 6:24 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164571","author":"Thomas","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"“My research began with this engraving, as it demonstrated that the original images of the Shroud were much more prominent than they are now. The Shroud would not have made an impact on such large crowds if they had not been. There are features – the Crown of Thorns, the long hair on Christ’s neck, the space between the elbows and the body, the loincloth – that can no longer be seen today.”\nCharles Freeman\n“How can a loincloth, that was there on the Shroud, would have completely vanished and let human body features appear under it? How can this have happened is beyond common sense and I can only conclude that you accidentally made an error.”\nMario Latendresse\nMario, this is a classical, and absurd, argument used by zeteticians. Brice Perrier has pointed it in a book we’ve mentionned on this blog.\nAbsolutely no credit should be given to such a claim.\n\n","date":"October 17, 2014 at 5:38 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163233","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"On the HistoryToday web site we can read “We also accept short articles for the History Today blog. At the present time we are unable to pay for any article posted on the blog,…”.\nDoes it mean that some authors do get paid for their articles if it is not on the blog?\nDid Charles Freeman received money for his article? I guess he could answer.\n\n","date":"October 17, 2014 at 5:53 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163237","author":"latendre","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Yes, £200.\n\n","date":"October 18, 2014 at 2:01 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163355","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"That’s the typical fee of writing in a popular magazine.\n\n","date":"October 18, 2014 at 4:31 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163391","author":"latendre","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I think ‘popular’ could be misleading as you will see if you access the website and look at the advisory board.The aim of HT is to pass on the work of professional historians on  to those interested in history, provide a bridge as it were.  I had to wait for two months before my article was accepted although I have no idea what process was gone through before it was. I also had the whole or parts read by willing specialists.\nI know that the magazine is an excellent way of getting history news and ideas out in the wider world which is why I chose it for this article.\n\n","date":"October 18, 2014 at 10:42 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163478","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Please, let’s be honest, and let’s call a cat, a “cat”. History Today is a popular magazine and it is NOT misleading to call it that way. It is not a derogative appellation either, I do not see it that way. It describes the fact that History Today tends to a large audience (current readership is 50,000), pays some of its writers (which you never see in scientific publications) and may not stand to the scrutiny of professional historians. It is very similar to L’Histoire, the French counter-part. The major problem of this article is that you used erroneous arguments (e.g., expected physical appearances of what the real Shroud image should be, faulty physical measurements confusing length of images vs length of bodies) to try to disprove the Shroud as inauthentic. The same thing happened in the magazine L’Histoire, but I must say that Andrea Nicoletti was much more careful about physics when he was interviewed by L’Histoire: he was mute about it. Which somehow is better but still lacking: you cannot ignored the physical data that we have now when you try to prove that the Shroud is inauthentic. This you have done in some obvious way in your article.\n\n","date":"October 18, 2014 at 3:35 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163556","author":"latendre","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Latendre  “May not stand the scrutiny of professional historians” . But the advisory board of History Today is made up of highly prominent historians, many of them university professors. So are you saying that they have their names up there but don’t scrutinise the articles that are published?\nIn so far as History Today is ‘popular’, it is because it is highly respected by readers who want to be assured that the articles are of high quality. .if this is what you mean by ‘popular’ then I agree with you.\n\n","date":"October 18, 2014 at 5:52 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163590","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles, on its own website (http://www.historytoday.com/about-us), “History Today created the concept of popular history, mixing styles, genres and periods to achieve a fusion of intellectual excitement and readability.” Notice the word “popular” in that sentence. \nAs for my statement “May not stand the scrutiny of professional historians”, I do not base it on the advisory board of History Today. It is rather the general style of the magazine. To me, the articles appear as essays, not research papers. (On this matter, I am not the only one thinking so, see\nhttp://www.questia.com/library/p3647/history-today/i3061873/vol-56-no-7-july)\nI have not seen the final version of your article, but there are currently no references to many statements you made about the image of the Shroud. They are indeed misleading (e.g., the two bodies front and back have different lengths) and unsupported. I do not expect the reviewers of this magazine to analyze such statements. This is a major shortcoming.\nAnd, you have been dodging these questions on this blog. Where are your references for the statements about the “impossibilities” of the image of the Shroud? Where are the measurements? What theory of image formation are you basing your statement that the contour of the body MUST appear?\nIf it were a research paper, you would have taken the time to support these statements, but not having done so, you may now realize that they cannot be supported by any evidence or measurements.\nA letter to the Editor of History Today is my next step.\n\n","date":"October 19, 2014 at 12:37 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163655","author":"latendre","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Latendre. Do make sure in your letter that you make it quite clear what your own credibility as a historian is, if you want your letter to have a chance of publication.\n\n","date":"October 19, 2014 at 2:32 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163664","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Thirty pieces of silver for the Shroud…\n\n","date":"October 18, 2014 at 5:46 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163403","author":"O.K.","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"And by the way, has Charles Freeman quoted his sources, is the “loincloth” argument an original argument?\nDavid, i have another word stronger than misinformation in science: plagiarism.\n\n","date":"October 17, 2014 at 6:27 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163253","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"There was also a complaint about “how news operates today.” Much depends on what is transmitted and it is not always possible to filter what is true and what is false and what has deliberately been left out, particularly when time is running out. This paves the path for corrections later on and that is bad for whoever wanted to give a twisted version of something.\n\n","date":"October 17, 2014 at 7:30 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163274","author":"Louis","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"And maybe this kind of news should be deciphered. \nI’m French, when i read this article i think of Pr Henri Broch who raised the bogus loincloth issue years ago.\nGround breaking news? Significant article? Give me a break.\n\n","date":"October 17, 2014 at 8:02 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163283","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I can understand. Wait till next week and you will see what I meant..\n\n","date":"October 17, 2014 at 8:16 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163285","author":"Louis","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"At least Charles put his name on the document and is open to scrutiny. If he has plagiarized, it will be exposed no doubt. I appreciate that he doesn’t hide between pseudonyms.\n\n","date":"October 17, 2014 at 9:01 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163290","author":"David Goulet","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"So far as I know I am the first to propose that the loincloth was a later addition to a previously painted cloth. As you will see there were two important clerics, Francisco Lamberti, bishop of Nice, and Carlo Borromeo, who were clearly associated with the devotion to the Shroud and also were associated with the decree of 1563. As you will see from the fully illustrated article, there is an image of the Shroud with nude figures in 1559 and from 1578 onwards there is the loin cloth. I suspect that the visit of Carlo Borromeo to Turin where he welcomed the Shroud in 1578 has something to do with it.\nI had not expected publication of the article until this coming Thursday but the link to the footnotes is in preparation and I will see if I can get it out earlier. All sources I used are quoted in the footnotes.\nN.B. Accusations of plagiarism and other ad hominem attacks. The traditional methods work best. Make a wax effigy and put the name of the offender on it and then stick pins in it. I have a box of candles ready to  melt down..\nBut as it clear that very few, if any, of the commentators so far have read, let alone digested, the article so I shall leave it at that for the time being.\n\n","date":"October 18, 2014 at 2:12 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163358","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"The idea that the loincloth depictions and the counter-reformation might be related is not new. For example, it was mentioned in BSTS No 44 (1996). See https://www.shroud.com/bsts4409.htm\nYou do not cite such source in your article. You have never seen it?\nWhat you have added is speculation with no proof: that the loincloth was painted directly on the Shroud.\n\n","date":"October 20, 2014 at 12:26 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163924","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Yes, I have seen these lists. I go well beyond the brief mention by naming individuals who might be involved. What we need to do is find an art historians who will look ant all the  depictions of the loincloth,BY DIFFERENT ARTISTS at DIFFERENT TIMES, and see whether they are showing the same loincloth or making up their own.  My own research suggests that they were copying what they actually saw painted onto the Shroud.\nI am fascinated that this issue is the one that everyone is concentrating on when it is such a marginal part of my article.  It adds nothing to the overall argument of the article but I think it is an interesting part of the Shroud’s story that was worth mentioning. As I have stated in other posts, there were no taboos about dealing with relics in this way.\n\n","date":"October 20, 2014 at 1:54 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163939","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Why would someone paint a negative image? I would expect from a historian some examples (paint intact or not) that is in negative, with real blood, anatomically accurate, shows rigor Mortis, serum haloes, real dirt on the nose and feet and pollen grain from the region it depicts. Also, Apparently, the paint fell off and we saw the buttocks, yeah right. Is this why some people see the teeth and hand bones? Did the painted skin fall off to expose the skeleton that was painted first?\nI remember posting earlier the picture of fayoim portraits with paint falling off, Charles response was”what would be left after all the paint has fallen off? Well I can tell you for sure when the paint falls off a positive image you are not left with a negative image, you are not left with anything at all since the background is painted just like the body, both will fall off and you won’t be left with any form. I can’t believe the level skeptics go to to discredit the shroud and in the process expose their bias.\n\n","date":"October 17, 2014 at 6:46 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163261","author":"Mike M","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Again read the article. This was probably a stage prop in the Quem Queritis Easter ceremony when they brought a grave cloth out of a stage tomb to show the congregation that Christ was risen. They held it up in front of the tomb just as shown in the Lirey pilgrim badge. The artist here, and in the Besancon Shroud, recreated the idea of an image of Christ’s body having touched the Shroud and so a negative. I believe that the cloth was painted originally for this ceremony and later Jeanne de Charny had an unsuccessful go at claiming it was the real thing. But it is all there in the article!\n\n","date":"October 18, 2014 at 2:18 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163359","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"“a stage prop… to show the congregation that Christ was risen”\nWhy would such an artifacts prove the case for the resurrection? When seen in the Middle Ages it shows the sweat imprint of a dead, bloodied, best up human form.\n\n","date":"October 18, 2014 at 8:20 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163440","author":"Mike M","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Best=beat\n\n","date":"October 18, 2014 at 8:20 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163441","author":"Mike M","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Mike M It would not prove anything. – this is purely a re-enactment – in effect, the birth of medieval  drama- it leads on to the Passion plays. Priests pretending to be the three Mary’s in some versions, or Peter and ‘the disciple that Jesus loved’ in others ( if they adapt John’s gospel) act out the gospel story  but the liturgy requires them to bring out a grave cloth to show to the congregation that, in the tomb where Christ was buried,there is now nothing but the grave clothes. Some appear to be painted, here in garish detail to make the point at a time, the fourteenth century , when emphasising the blood of Christ was all the rage. What  makes the Shroud really important is that it seems to be the only survivor. ( After I wrote the article, I found some information that there may be similar surviving double images in Spain which have been misinterpreted as copies of the Shroud.)\nThe Lirey badge gives support to the hypothesis  that the Shroud was one of these in its original form, held up by two priests before an empty tomb as the ritual required .It appears to be Jeanne de Charny who  tried, unsuccessfully so far as Clement VII was concerned, to claim that this was the authentic burial cloth. As you will know Clement allowed continued expositions so long as her claim , she was by now dead,of course, was publicly announced not to be true. And so on to the present position of the pope, the dukes of Savoy and the Shroudies not withstanding.\n\n","date":"October 19, 2014 at 4:52 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163699","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Not sure why the off-on-off loincloth is such an issue. Paintings which are clearly copies of the Shroud show the body without, then with, then without. They are pretty variable about which hand crossed over which, the position of the feet, and the details of the bloodflows as well. Either the artists were relying on the reports or sketches of others, or these details were not important enough to be correctly reported, or sensibility to convention made them ‘get it wrong.’ I think Charles’s point here is that the loincloth only occurs at a particular time in the Shroud’s history, and then only (by coincidence) when there was a particular taboo against ecclesiastical nudity. Such temporary additions were quite common – the loincloth could have been deliberately made temporary and easy to remove – it could even have been a separate piece of material stitched on – or could have only appeared in artists’ copies and depictions of the expositions.\n“Why would someone paint a negative image?” This is a reasonable question and, as far as I know, there are no other negative images of this sort in existence today. There are also no other double portraits of Christ, head to head, on long thin sheets. However, as Charles has pointed out, there was at some point quite an extensive tradition of re-enactment of the Quem Quaeritis scene from the bible, numerous accounts of which survive, all of which involved a shroud which was taken from a symbolic tomb and exhibited to the congregation. There must have been dozens of shrouds, not one of which survives, except possibly the Shroud of Turin. Perhaps some of the others also depicted the image of Christ, and perhaps they too showed him as accurately as they could, leaving marks where his body touched the cloth, but not where it didn’t. Sure, it’s a guess, but it’s not an unreasonable one.\nSome years ago, Picknett and Prince published the idea that the Shroud was a photo by Leonardo da Vinci. They were mostly criticised, with similar abuse to that above, for being so stupid as to attribute a cloth well known in 1355, to a man who was born in 1452. Even a cursory glance at their research would have shown that they claimed the modern Shroud was a copy of the original, but few of their intemperate opponents seem to have read much more than the back cover. As it happens I think their theory is incorrect, but I did read it all the way through. Before anybody else starts usng words like “absurd,” “bad will,” and “plagiarism,” for Charles, might I suggest they respond to what his article says rather than what they think it might say based on an abstract.\nFor me, the value of Charles’s paper is that he suggests a context, with which I was not familiar, within which the Shroud could have fitted, and which must have involved numerous similar shrouds with which it could be compared. What we need to do now is to find some!\n\n","date":"October 18, 2014 at 3:31 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163374","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hugh, you misread Charles’ article because he wrote: “[..] who insisted that the naked buttocks of the image be covered up with a painted loincloth. Today the loincloth has vanished and only a lighter patch over the buttocks suggests its previous existence [..]”. Charles wrote “be covered up with a painted loincloth”. According to Charles, the loincloth is painted over, not as you wrote that “it could even have been a separate piece of material stitched on”. That’s the main point: the suggestion that it was painted over and then removed is quite fat fetched. Of course, the most probable case is what you wrote: “or could have only appeared in artists’ copies and depictions of the expositions”. Which appears the most likely situation. In such a case, such a statement is trivially possible and needs almost no mention.\n\n","date":"October 18, 2014 at 4:27 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163388","author":"latendre","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I also read Picknett and Prince’s book. In fact, I devoured it, more than once, because it was such a sensationalistic good read. But they rely on the Priory of Sion, phone calls from mysterious anonymous people, and that kind of nonsense to come to their conclusions. I can’t believe anyone would take their book seriously, other than as darn good fiction.\n\n","date":"October 18, 2014 at 12:40 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163510","author":"Chesterbelloc","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I fully agree Hugh,\nThe  “off-on-off loincloth” is just one of the many details of Charles’ paper.\nThere are some errors in Charles’paper but this paper must be read carefully. \nAt the first look, it seems that Charles has shown that the painted copies of the Shroud are very different, depending on the historical period.\nI think there is no better demonstration that those paintings were NOT actual reproductions of the Shroud in the past.\n\n","date":"October 18, 2014 at 3:27 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163553","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Thibault, Charles’ conclusion is the opposite, suggesting explicitly those paintings were actual reproductions of the Shroud. He writes:\n“…the loincloth was on it: an engraving of this exposition by Giovanni Testa shows it clearly. It continues to be shown in depictions of the next two centuries, with enough similarity between portrayals to suggest that artists were copying from the original.”\nBut I think you know he is not the first one to go on the presence of a loincloth,\n\n","date":"October 19, 2014 at 2:11 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163662","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Yes, Anoxie is right- that is my contention.\n\n","date":"October 19, 2014 at 2:37 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163666","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Ok, this is your contention.\nActually, this is not really an original contention, can you name someone who claimed there has been a loincloth on the Shroud?\nYes or No.\n\n","date":"October 19, 2014 at 3:05 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163671","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"As I have said before, I do not know anyone who has made this contention in the specific context  of the 1563 decree from the Council of Trent and linked it to Francesco Lamberti and Carlo Borromeo. You sound as if you do, when you say that this is not an original contention, so please give me the reference so I can make acknowledgement in my footnotes.and I will even give you an acknowledgement for pointing it out if you come out from behind your pseudonym!\n\n","date":"October 19, 2014 at 3:18 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163678","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Question is simple, still you seem extremely reluctant to answer directly, come on:\nDo you know someone who claimed there has been a loincloth on the Shroud?\nYes or No.\n\n","date":"October 19, 2014 at 3:25 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163681","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Doing your homework?\n\n","date":"October 19, 2014 at 3:32 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163684","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Unfortunately, Charles present the same (false) ideas that has been presented many times before: the Shroud loses paint has the time pass on. This is a complete unsupported statement because it is not based on any physical experiments proving that this is possible given the data that we have now on the Shroud. Such idea has been presented by McCrone, and more recently repeated in L’Histoire, a French popular magazine. Again, it is completely unproven. McCrone speculated that it was possibly the case and many others speculate about it. But repeating the speculation of some other researchers does not make it true, it remains a speculation.\n\n","date":"October 18, 2014 at 4:30 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163389","author":"latendre","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles Freeman makes the same major mistakes done by so many other skeptics before him by listing all kinds of features that he would expect to see if it were an image coming from a dead body. But we have no other examples to compare to! He assumes that things should appear in a certain way as he expects them. But this is a circular reasoning: If you say “I expect that the image coming from a dead body would look like X” but cannot provide other examples of such image formation then you are assuming your conclusion.\nHere are the list of supposed qualities we should see if Christ had left his image on a shroud:\n1)  “A cloth laid on a body would pick up its contours, but there is no sign of this.”\nSo we know that a body that leaves an image MUST do that? Charles has an example to show?\n2)  “Then again the heads do not meet, suggesting that this was not a cloth that was ever folded over an actual head.”\nWell, that’s not a problem since the contours are not shown. Charles did not see that observation 1 implies 2. There is no top of head shown (no contour), therefore the “two heads” should not touch. May be the artist was a bit more clever than Charles realized. The “artist” was completely consistent.\nAnd then the list of presumed “errors”, if the Shroud had an image coming from a real body, but without supporting these claims with any measurements:\n1)  “Again, the hair of the body would have fallen back if the figure had been lying down but the blood is as if it is trickling down the hair of a standing figure.”\nWell, what about somebody who had been standing up while being beaten: would the blood flow down, side ways, or up? Down appears to be the case. And did Charles note that the hair is away from the face as depicted on the Shroud, which is consistent with the fact that the cloth reached the hair as the cloth goes down towards the ground: the gap is proportional to the vertical distance from the cheek to the hair. The gap is consistent with the hair being lower than the cheek.\n2) “If you lie on the ground and place your elbows in the same position as those on the back image of the Shroud, you can quickly see that it is impossible to hold the position of the crossed arms in the front.”\nSorry, I cannot quickly see that. Any measurements that could be given to prove that point?\n3) “There is a difference of seven centimetres between the lengths of the two bodies.” \nIs it “lengths of the two bodies” or the lengths of the two images such that no consideration is given about the cloth placement, the feet not completely visible and so on?\nWhere are the measurements? I guess this is too complicated to give? Yes, it is complicated. So simply stating some differences in lengths of images prove nothing. Nobody has provided the measurements to support such claim that “the lengths of the two bodies” differ by seven centimeters. And none are given by Charles, so it is unproven.\n\n","date":"October 18, 2014 at 5:18 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163397","author":"latendre","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"3) “There is a difference of seven centimetres between the lengths of the two bodies.”\nIs it “lengths of the two bodies” or the lengths of the two images such that no consideration is given about the cloth placement, the feet not completely visible and so on?\nWhere are the measurements? I guess this is too complicated to give? Yes, it is complicated. So simply stating some differences in lengths of images prove nothing. Nobody has provided the measurements to support such claim that “the lengths of the two bodies” differ by seven centimeters. And none are given by Charles, so it is unproven.\nMario, with your Shroud Scope, simple tape measure and average human male refuting such LIES (let’s face it, those are delliberately spreaded lies) is extremely easy. So the more obvious is the barefaced and cynical attitude of those who repeat them.\n\n","date":"October 18, 2014 at 5:37 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163400","author":"O.K.","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Regarding the shoulders, I don’t think that the dislocations, inflammation, etc. that would follow crucifixion are being taken under consideration in the “floor” test. \nPD- That is just an observation, I’m not trying to take sides.\n\n","date":"October 19, 2014 at 2:32 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163663","author":"Eric","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"“So far as I know I am the first to propose that the loincloth was a later addition to a previously painted cloth. ”\nIs is a thiny veiled admission that you’re not the first to claim there has been a loincloth? And if you are aware of previous works dealing with the loincloth, why not mentionning them in your article?\n\n","date":"October 18, 2014 at 7:28 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163426","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"No, I only said that because in many years of Shroud research there may be someone who has claimed the same but I don’t know of  anyone who has made the specific link between the appearance of the the loincloth by1578, but not before 1563 and the specific association of Francesco Lamberti and Carlo Borromeo both of whom were linked to the decree of 1563 from the Council of Trent that banned lascivia in religious art. Lamberti was actually present to sign the decree, Borromeo was the link man between his uncle ,pope Pius 1V and the Council and he enforced the decree in Milan when he became archbishop there. There are engravings / depictions of both of them as the central figure holding up the Shroud. So the search should be on to find a depiction of the Shroud before 1563 that does show the loincloth and one from between 1578 and 1750 that  does not.\nThe obvious comparison is with Michelangelo’s  Last  Judgement in the  Sistine Chapel  that has clothes painted on after 1563 so we have a precedent. As Hugh says what is the big deal about painting a loincloth on? After all far worse things were done to relics, including cutting them up into smaller pieces. There was never any taboo about dividing  bodies and other relics up into smaller pieces so a loincloth added on is neither here or there. It is just an interesting episode in the history of the Shroud.\n\n","date":"October 18, 2014 at 8:00 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163434","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"“No, I only said that because in many years of Shroud research there may be someone who has claimed the same but I don’t know of anyone who has made…”\nCharles, you were “surprised by the lack of research” as said in the introduction. You now state there may have been someone who has claimed the same, but yet, still no name, no reference. \nI’m surprised by the lack of research.\n\n","date":"October 18, 2014 at 8:20 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163439","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"No, I did a great deal of research so can be fairly confident that no one has been there before me. You can’t be absolutely sure that some German or Polish or Spanish scholar ,for instance, has not proposed the same idea. However, we shall go live with the footnotes on Wednesday or Thursday at the same time as the fully illustrated article becomes available on the History Today website and if anyone can find someone who has made the point about the loincloth I will happily give the reference. So over to all of you to find one! If not I shall go on calling my work original.\n\n","date":"October 18, 2014 at 8:33 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163444","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"We have to wait for the footnotes, you don’t write your own footnotes???\nYou don’t know yourself if anyone has been on the presence of a loincloth before your work?\n\n","date":"October 18, 2014 at 8:42 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163445","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"The release date of the full article with illustrations is this coming Thursday and as the footnotes relate to that they will come out at the same time. There are four full pages of them so that anyone who is interested in knowing where my sources come from will be able to follow up the sources I give.\nThis debate is going nowhere. My own suggestion is that someone who has coherent objections to it that deal with the history aspects try and get something on the History Today blog where others can comment. It also appears that  an art history website will be doing something on it -( I will provide details when I have these confirmed) and no doubt those who wish to comment on the painting aspects and iconography will be able to provide comments. Perhaps our old friend Thomas de Wesselow will make an appearance.\nAs I said earlier, I would expect it will be at least a year before we know whether this article has advanced Shroud studies or not but as I have lots of other projects on, I am happy to wait .\n\n","date":"October 18, 2014 at 9:19 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163456","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Question is simple: are you aware of anyone who has been on the presence of a loincloth before your work?\nYes or No.\nIt’s up to you to answer or to go nowhere once again.\n\n","date":"October 18, 2014 at 9:27 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163457","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"http://www.historytoday.com/charles-freeman/origins-shroud-turin\naccess denied.\nneedless to say, i have the previous version in pdf.\n\n","date":"October 18, 2014 at 10:05 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163463","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Anoxic, Not in relationship to the decree of 1563, no. There have been general references to artists adding a loincloth to their pictures but I would argue instead that they were depicting the same loincloth although here, as in many areas ofShroud iconography, we still have lots of work to do. As anyone reading my article will see, I think that there is so much basic research to do on the Shroud and I hope that one result of my article will be to encourage specialists to do it.\n\n","date":"October 18, 2014 at 10:18 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163467","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles, the question was not in relationship to the decree of 1563. But obviously, you’ve repeatedly, carefully, avoided to answer directly.\nNow, could you provide a link to your article?\n\n","date":"October 18, 2014 at 10:29 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163469","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Anoxie. HT may have realised it was not a good idea to publish the article early when the illustrations that back the arguments were not all there. Remember, however, that History Today has the copyright of the article and that they can legitimately prevent its circulation other than under the normal rules of copyright. I think Dan spelled out what those were not long ago. I shall retain copyright of the footnotes. Being a well established and highly respected journal, HT will no doubt have a lawyer at hand.\nIt will be much better if those who wish to seriously engage with this article wait until they have seen the full text and the accompanying footnotes.\n\n","date":"October 18, 2014 at 10:31 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163470","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Anoxie As I have sold the copyright for the princely sum of £200 I have no greater right to the link than you have. You must approach the copyright owner directly. I have also failed to have access but as publication was not scheduled until the 23rd I can hardly complain. Just some of you have had a peek preview ,even if it has not been of the full article.\n\n","date":"October 18, 2014 at 10:34 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163471","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"And you may have realised it was not a good idea to answer directly to my question.\nI have the original article in pdf.\n\n","date":"October 18, 2014 at 10:39 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163473","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I think nothing contradicts the painting hypothesis more than the actual painted shroud copies that were produced over the ages. They demonstrate how ridiculously the artists of that age never really grasped the consept of negativity and thus came up with childish like images with no anatomic accuracy or realistic blood flows (even though they had the shroud to copy from). Also the fact that 33 scientists from top US institutions spent all this time poking and examining the cloth and came up with the conclusion that this is not a painting.\n\n","date":"October 18, 2014 at 10:48 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163480","author":"Mike M","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I note the so-called D’Arcis memorandum is given prominence early in the article as part of the author’s agenda to discredit authenticity.  This is a myth constructed by Ulysse Chevalier and Herbert Thurston.  Their efforts were amply discredited by Markwardt in 2001.  I am surprised it is still cited in what poses as an attempt at a scholarly paper.  \n“THE CONSPIRACY AGAINST THE SHROUD”; By Jack Markwardt;\nhttp://www.shroud.com/pdfs/n55part3.pdf\n\n","date":"October 18, 2014 at 2:39 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163542","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"David, the first comment in this thread refers to this. The memorandum has now become a mantra for some in the anti-authenticity camp.\n\n","date":"October 18, 2014 at 3:12 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163550","author":"Louis","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Contrary to what Jack Markwardt, a lawyer, not  a historian, implies, Thurston argued that the Shroud was not original but was created specifically for another purpose, display at the Quem Queritis ceremonies.  You can find Thurston’s view in the venerable 1907 Catholic  Encyclopedia., article on Shroud that he wrote for them. Once you have got towards the end of my article  you will find my acknowledgement of this as there is evidence to support him. So the implication that Chevalier and Thurston conspired to say that the Shroud was a fraud does not hold- has JM had this article peer reviewed or on what grounds is it accepted as scholarly?\nIt is quite clear that many of the commentators here have not read my article in detail . They will find when they do that I do not believe that the Shroud was a fake in the sense of a artefact designed to deceive – why would Clement VII have allowed it to be displayed with an indulgence attached if that had been the view in 1390? Rather it was one of many, objects of veneration given spiritual status by the Church but no more – the same position as today- at least the Church is consistent!\nUltimately for me, the success of my article will depend on whether professional historians, art historians, experts in weaving, etc, endorse my views as that is the world I work in. I give them lots of work that I would like them to do in areas where I am not a specialist. So we shall see.\nIf Shroudies wish to participate in the debate they must establish their own credibility as commentators so it is up to them. Please don’t expect to write letters, etc, to be published in academic journals unless you make it quite clear what your own academic status in these issues is. I have had a well- reviewed book on medieval relics published by a university press and that proved a good starting point to being taken seriously.\n\n","date":"October 19, 2014 at 2:57 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163668","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Addition to the sentence above  ‘ In the article itself, I give them lots of work to do . . . ‘  we do need lots more specialists to become involved in these issues!\n\n","date":"October 19, 2014 at 3:22 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163679","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Even if I highly respect Mr. Freeman for his professional contribution in debunking of the Mandylion propaganda of Wilson, Scavone and cie., I think he miss the target concerning the authenticity of the Shroud.\nI highly recommand him to read, among other things, my paper about the evidence of the bloodstains, which shows that concluding in the authenticity of the Shroud is the most rational thing to do in face of all the scientific data we got now and particular what concerns the blood and serum stains…  Here it is again: http://www.holyshroudguild.org/uploads/2/7/1/7/2717873/yannick_clment_shroud_of_turin_the_evidence_of_the_bloodstains.pdf\n\n","date":"October 18, 2014 at 4:56 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163573","author":"Yannick Clément","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"There are sweet dwellers who sometimes can tell you some truths and from whom you can learn even more. None of it is found in academic journals and books.\nJesus never wrote a book, he was a man of action.\n\n","date":"October 18, 2014 at 7:23 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163609","author":"Louis","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Louis: “David, the first comment in this thread refers to this. The memorandum has now become a mantra for some in the anti-authenticity camp.” \nRefers to author’s use of D’Arcis memorandum given prominence early in the article. \nThe objection goes beyond polemics.  The Chevalier – Thurston thesis on the so-called D’Arcis memorandum has been discredited as I pointed out.  No historian worth the money ought to resort attempting to use it any kind of authoritative way.  Consequently those who will, may draw their own conclusions as to the article’s merits and the author’s intent.\n\n","date":"October 18, 2014 at 10:32 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163632","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Come on Dave B! So far as I know JM’s article has never been given academic credibility – where has it been published? ,where has it been reviewed in the mainstream academic world? It does not make any kind of sense to me as it implies that Thurston claimed that the Shroud was a fraud when he quite clearly states otherwise in the famous Catholic Encyclopedia of 1907. So Markwardt starts with a fake premise and argues from there. Certainly not an article that proves anything and in fact it is irrelevant to my argument anyway as I state quite clearly that the Shroud was not a forgery but was painted for a specific purpose – the Easter ceremonies -without any intention to deceive anyone.\nJeanne de Charny had an unsuccessful attempt, in the eyes of the Church , to say it was authentic. The dukes of Savoy claimed the same thing and then there are the Shroudies today. Meanwhile the Catholic Church has, in fact, kept to the same stance established by Clement VII in 1390, , worthy of veneration ( probably because of miracles, alas unrecorded), but with no support for authenticity – as pope Francis has reaffirmed – presumably the exposition of 2015 follows the official Church line. There is nothing in my article that would offend the Church as nothing in it contradicts or challenges their official teaching on the Shroud. I can at least sleep easy on that one.\nThe Shroud is not a fake- the most probably hypothesis by far is that it is a typical medieval object of veneration, images painted on a cloth of c.1325, now sadly faded. Over to specialists in these fields of weaving, iconography, relic cults, medieval liturgies, and this ,of course, includes any Shroudies with the relevant expertise, to agree or disagree with me.\n\n","date":"October 19, 2014 at 3:37 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163686","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"At the time of writing his 2001 paper on the alleged Chevalier-Thurston conspiracy, Jack Markwardt was licensed to practice Law in four States, six federal districts and before the United States Supreme Court.  I would surmise he is well-enough versed in what constitutes fraud, and no less to write about particular cases, perhaps even more so than any historian.  \nThurston may have offered his own explanation for the origins of the Shroud, but it is Markwardt’s charge that it was Thurston and Chevalier who entered a conspiracy to deceive by impugning the Shroud’s reputation.  Part of his conclusion is as follows: \n“In order to defeat the conservative clergy, Chevalier and Thurston entered into a\ncivil conspiracy when, with knowledge of a plan by their progressive colleagues to cause\nserious injury to the reputation of the Shroud of Turin, they employed improper means\ndesigned to accomplish that end. Confronted by the truly confounding nature of the\nscientific evidence presented by Pia’s photographic negatives, they were forced to base\ntheir entire case against the authenticity of the Shroud upon the D’Arcis Memorandum.\nBy publishing a fictional transcription of that document and manufacturing a convenient\ndate for same, Chevalier effectively created the false illusion that the memorandum’s\ncharges of forgery were credible because they had been submitted to, and reviewed by,\nthe Pope in Avignon. By purposefully truncating his translation of that document, so as to\nexclude evidence that would have shown it to be a mere draft and would have\ncontradicted Chevalier’s arbitrary dating, Thurston effectively confirmed this false\nillusion.”  \nThere is more which can be read in Markwardt’s paper.  \n“Several years after publishing his abbreviated translation of the D’Arcis Memorandum, Thurston authored several articles for the Catholic Encyclopedia that labeled the Shroud a scandalous product of unscrupulous medieval miscreants and he steadfastly maintained this position for the rest of his life.” \nThe 1907 Catholic Encyclopedia article that Thurston wrote remains on line on the New Advent site today but is now merely of archival interest.  Despite the Pia negatives being available to him, Thurston’s article maintained that the image was painted, and made observations on the blood-stains that are patently false, as determined by the 1978 STURP project.  To rely on the D’Arcis memorandum, or to cite it as some kind of authority, in the face of the challenge which Markwardt has raised against it, specifically as based on the Chevalier-Thurston representation of it, is I consider irresponsible in an historian.\n\n","date":"October 19, 2014 at 5:08 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163706","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Daveb- the article by Thurston in the Encyclopedai can hardly be just of archival interest if it undermines Markwardt’s thesis as it does. Sometimes historians have to point these things out.\nAnyway, while I don’t  give  any credibility to  JM ‘s thesis ,it is irrelevant within the wider context of my article. Suppose Thurston had argued, as he does not, that the Shroud was a fraud, then there I would not go along with him as my article makes clear the Shroud was never a fraud and never intended to be one. It was openly created,I believe, for a totally different purpose, as a stage prop in an Easter drama to show congregations that Christ had indeed risen. The question of how it was misappropriated as a relic is a fascinating one but a completely separate story.\n\n","date":"October 19, 2014 at 5:24 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163713","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I suspect that you do not yet get it. \nBoth Thurston and Chevalier were highly respected scholars.  Both seemed to have had a liberal agenda, and seemed to be attracted by the new learning in German biblical studies.  The excesses of this movement was to relegate the scriptures to outright mythology, eventually leading to Pope Pius X condemning the error of “modernism”.  The theological conflict within the Church at this time was therefore between those who wished to modernise the Church for the twentieth century and those who wished to defend time-honoured religious traditions.  \nPia’s negative photographs of the Shroud appeared to support it as the authentic burial cloth of Christ and consequently the historical accuracy of the Passion as recorded in the gospels, and was therefore disconcerting to the progressive movement.   \nConsequently the progressive movement needed to discredit the Shroud in order to achieve their aims.  They did this by a misrepresentation of the D’Arcis memorandum as described by Markwardt.  \nTo claim that the Shroud was created as a stage prop in some kind of liturgical drama is a nonsense and cannot be sustained by any kind of scientific study of its properties which remain enigmatic.  It remains unique.  It appears that representations of the image of the Shroud were made in the form of the epitaphioi and so used.  But their fabrication was always in the conventional materials of their time.\n\n","date":"October 19, 2014 at 6:14 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163725","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Daveb. ‘To claim that the Shroud was created as a stage prop in some kind of liturgical drama is a nonsense and cannot be sustained by any kind of scientific study of its properties which remain enigmatic.’\nTo be discussed in a year’s time when the wider academic world has had its say.\n\n","date":"October 19, 2014 at 6:30 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163729","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Although neither Herbert Thurston nor Ulysse Chevalier thought that the Shroud was authentic, and both used the D’Arcis letters as evidence against authenticity, I think they differed quite sharply about what it actually was. Chevalier, I think, had an anti-relic agenda to foster, and was keen to prove that the Shroud had indeed been designed to deceive people into thinking it was genuine when it wasn’t, but Thurston was much more directed towards the use of artifacts in the Easter Liturgy, and, as Charles has suggested, thought the Shroud was one of those.\nHowever, I have thought of a bit of a problem with Charles’s thesis. If ‘shrouds’ were part of a common annual liturgy, stored in their dozens in sacristies across Europe, how come ‘our’ Shroud suddenly appears as an object of special reverence? Was it brought from an area where the ‘Quem Quaeritis’ ceremony was common to a place where it was wholly unknown? Or had the ritual declined for years, and most of the old impedimenta discarded, and the Shroud resurfaced after a period of dormancy? \nIf the Shroud was part of a ‘Quem Quaeritis’ ceremony, however, the famous ‘poker holes’ become much easier to understand. The ritual specifically states that three clergy, all swinging censors, go to the symbolic tomb, lift out the cloth, return it to the altar and unfold it for all to revere. The folding of the coth into four (to fit in the ‘tomb’), and the possibility of scattered charcoal, seem to fit this scenario rather well.\nI’m looking for Thomas’s and OK’s ‘number of flaws’ to Charles’s article, as this is how good scientists test their own, as well as others’, hypotheses. But what a pity. The most forceful of their arguments is that the article is ‘garbage,’ ‘rubbish,’ and deliberate lies (Or as OK puts it, LIES, and in bold too). I note that Thomas has ‘little time for non-thinking authenticists.’ Generous to a fault, I continued the search and I have found something less abusive. \nFirst there is the loincloth issue, as mentioned above. Charles is apparently attempting to reconcile the coincidence of a loincloth-enveloped shroud with eccesiastical views about nudity. If the loinclothed shroud and the prohibition are indeed contemporaneous, and if the shroud is always depicted nude outside the period of prohibition, then a valid connection can be made between them. If the actual Shroud were exhibited at that time, then it would have had to be covered itself, just as any representation of it would have to be. Furthermore, Thomas’s implication that copies of the exposition would have to have a loincoth (‘because that was the artistic convention, being highly distasteful to show Christ’s buttocks’) but not the Shroud itself, publicly exposed to thousands, is inconsistent. Thomas’s contention that “the fact that the earliest depiction of the Shroud – Lier in 1516 – does not show a loin cloth, is close to fatal for his theory” is clearly wrong, as it is entirely consistent with a loincloth being added later, and a clear demonstration that it was not always ‘highly distasteful to show Christ’s buttocks’.\nSecondly, Thomas queries the inconsistency between the very visible artistic representations of the image, and the near invisibility of the image itself. Is this because of artistry, and the difficulty of showing the true image on a painting/engraving, or because the image really was much clearer in earlier times? This is a difficult question. Some authenticists think that the image has actually got clearer over the years, ‘developing’ like a photograph, and some non-authenticists think that the image was clearly painted (or photographed), but that the paint or other medium has flaked off, leaving only the deteriorated linen behind. One way of finding out is to read what people said they saw, rather than looking at artistic representations.  As far as I can recall, almost all pre-20th century accounts say how clear and distinct the image is, adding some evidence in favour of Charles’s view. He quotes some of them in his article.\nO.K., eventually, having firmly nailed his colours to the ‘I don’t care what he says; I don’t like him so he must be wrong’ mast, finally gets round to disputing Charles description of the images on the shroud, which is a valid criticism. All the measurements of the images are imprecise, inconsistencies between the front and the back are variously accounted for the posture of the body and the wrapping of the cloth, and similar problems arise in attempting to correlate the measurements of the image with the measurements of the man who might have made it. Latendre, above, makes the point well. However, since the time of Vignon and Barbet, who saw only perfect proportions to the body, even the most ardent authenticists have found themselves having to account for observed inconsistencies, and those non-authenticists who think they can all be accounted for by clumsy artistry, have greatly enoyed watching them wriggle. It is not inconsistent with Charles’s argument to claim that the Shroud does not obviously show a perfectly proportioned body, or pair of bodies.\n\n","date":"October 19, 2014 at 6:36 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163731","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Yes, Hugh you have raised a good question as to why the Shroud was venerated when it was but one of many. Just one of the many areas where the artefact that ‘has been researched more fully than any other artefact in history’ needs much more research!! A clue might lie with the Besancon Shroud, now vanished, of course, but probably a single image grave cloth from the same ceremony. There is a report that it was associated with the revival of a dead body. This would give it the status to allow it to be preserved and venerated. So I suggest, and this is no more than a suggestion, that there was some miracle or miracles associated with our Shroud. There is some support given to this by the wording about the Shroud on the Lier copy that tells of the Shroud, then at Chambery, having miraculous properties.\nWe do have to explain how what was probably no more than a stage-prop got to the point where Clement VII was able to give an indulgence to those who visited it.  The next move, to suggest it was a genuine relic, is ,of course a different story and the line from Jeanne de Charny to the dukes of Savoy to the Shroudies is a history subject in itself, one which runs alongside but distinct from the official view of the Church ( other than perhaps a pope or two who did believe it was the real thing).\nAll grist to the historian’s mill!\n\n","date":"October 19, 2014 at 7:29 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163741","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"“Yes, Hugh you have raised a good question”\nI guess good questions are the one you’re willing to answer to.\nCharles, do you know someone who claimed there has been a loincloth on the Shroud?\nYes or No.\nAs long as you keep commenting on this thread, spreading mum-jumbo, i’ll keep asking.\n\n","date":"October 19, 2014 at 7:39 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163745","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"No, I don’t and I keep saying this but you don’t listen!! I may be the first as with all m y research I have not found anyone else proposing this, but I did make a study of this decree for my book Holy Bones and knew quite a lot about Carlo Borromeo so it may be that no other Shroud researcher knew about the background and spotted the connection.\nAgain, if you know someone who has written about the loincloth, please let me know and if you want to be acknowledged in my footnotes, you will have to reveal your real name!\n\n","date":"October 19, 2014 at 9:14 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163757","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Ok, question was clear, repeated over and over, about the presence of a loincloth, not the decree.\nTwo issues in a book:\n“1-And if Jesus presented on the Shroud was not naked?\nResponse in multiple representations of the Shroud of Turin through the centuries that many people posing as experts shroud seem curiously unaware … \n2-No, the Shroud of Turin is NOT a fake\nContrary to what you may read or hear very broadly, the Shroud is not a fake. This did not prevent him being really a hoax … for profit!”\nGreat news, this is a widely spread idea among skeptics.\n\n","date":"October 19, 2014 at 10:45 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163774","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hugh read my comment on 22 October. I referenced several early representations of the shroud that strongly suggest the image was faint back in the 1500s.\nWith several obvious attempts to depict the faintness I believe it is almost indisputable that the image was faint in the 1500s.\nAny view to the contrary is weak in light of tge historic artistic evidence.\nIf Freeman had done the proper historic analysis he would have found these images which are Obvious attempts to represent the faintness if image.\nlong live pseudo skepticism and arrogant and pompous english attitude\n\n","date":"October 25, 2014 at 7:53 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165438","author":"Thomas","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I did indeed read your comment, and those of others, especially Thibaut (at another post), and although I can’t agree that the early copies “strongly” suggest the image was faint, there is something in what you say. The copied images are, of course, much clearer than the image is now, which mght suggest that the image really was clearer, but their variety of different postures of hands and feet, depictions of the face and visibility or not of elbows and so on do suggest that the copiers did not have a clear idea of what the image actually looked like. On the other hand, eye-witness descriptions, by Cornelius Zantiflet, for instance, or the nuns who stitched the 1534 patches, all mention how clear the image is, and never how faint it is. They also mention how ‘fresh’ the blood looks, which, however pink its current colour, would be an absurd claim today, when the blood-stains are only a little clearer than the rest of the image. In short, I don’t know whether the image was brighter in the past than it is now, but I do not think that it is “almost indisputable” that it wasn’t, or that the evidence that it was is ‘weak.’\n\n","date":"October 25, 2014 at 8:48 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165445","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"“Several years after publishing his abbreviated translation of the D’Arcis Memorandum, Thurston authored several articles for the Catholic Encyclopedia that labeled the Shroud a scandalous product of unscrupulous medieval miscreants and he steadfastly maintained this position for the rest of his life.” Scandalous, unscrupulous, miscreants, note. Strong words, and wholly unsubstantiated by Thurston’s own writings. Only four of his articles for the Catholic Encyclopedia mention the Shroud, and although they all call it non-authentic, only one describes his ideas about it, where, as Charles says above, he makes it clear that he thinks it a liturgical object, ‘painted without fraudulent intent.’ I think Jack Markwardt is over-egging his pudding.\n\n","date":"October 19, 2014 at 6:56 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163735","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Markwardt is a lawyer and  I would not like to be prosecuted by him – he obviously has decided to be the prosecuting counsel in this case and uses language to suit. However, I am a historian and have to look at the facts and actually read what Thurston wrote, not what JM thinks he wrote to fit in with his prosecution case. Thurston is absolutely clear on what he believed, rightly or wrongly, the Shroud  to have been so there would have been no problem taking on his case as defence counsel and winning.\n\n","date":"October 19, 2014 at 9:20 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163758","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Treatise on Nonsense.\nFrom time to time I use the word nonsense in this blog, but generally spell it “non-sense” as I would like it to mean that even with the best will in the world, I cannot make head or tail of something. Spelt in the normal way, it generally means that the user disapproves of a statement but can’t, or can’t be bothered to, explain why. How interesting to be able to give examples of this here.\nDaveb says that the idea that the Shroud could be a stage prop is nonsense. Well it isn’t, is it? It may be wrong. It may be impossible – but it’s not non-sense. Now compare that with anoxie’s comment: “Two issues in a book:\n“1-And if Jesus presented on the Shroud was not naked?\nResponse in multiple representations of the Shroud of Turin through the centuries that many people posing as experts shroud seem curiously unaware …\n2-No, the Shroud of Turin is NOT a fake\nContrary to what you may read or hear very broadly, the Shroud is not a fake. This did not prevent him being really a hoax … for profit!”\nNow that’s nonsense!\n\n","date":"October 19, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163793","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hugh, these are two “original” points presented by Charles, in his article, in this thread:\n1- the loincloth\n2- the shroud is not a fake\nThe nonsense, is a standard google translation. But the points are made, and they are all but original.\n\n","date":"October 19, 2014 at 1:42 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163803","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Ah! I understand now.\n1) Charles is the first person I know to suggest that the loincloth seen in some representations of the Shroud is a direct result of the Council of Trent, and more particularly Charles Borromeo’s participation at it.\n2) Charles is not the first person to suggest that the Shroud is not authentic, nor that it was not created with the deliberate intentin to deceive, nor even that it was created to take part in some sort of ritual. However he is the first I know to connect it directly to specific rituals within the Easter liturgy. This ritual is similar to the Eastern one involving the epitaphios, but sufficiently different to require a different design, if any, on the ‘shroud,’ one which should not depict Jesus’ body lying on it, but which could bear something showing that his body had been in it a short time previously.\n\n","date":"October 19, 2014 at 2:07 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163810","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hugh, i’ve repeated the question over and over again, i’ve said over and over again it was not about the decree but about the loincloth. And he has systematically answered: no, three times.\nThe question was about the loincloth, not the council, re -re re-read the question and answers, why do you think i’ve asked the question n- times?\nTo avoid twisted answers as yours.\n\n","date":"October 19, 2014 at 2:20 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163813","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Anoxie, as you will see if you can wait for the full article and the footnotes any points I make that I do not think to be original are footnoted.\nNo one seems to be able to understand what you want.\nThe decree of 1653 attempted to deal with nudity that was a feature of much religious art and was causing offence in the sterner times of the Counter-Reformation.. So we have cases where a loincloth was put onto a nude body to comply with the decree.  The Last Judgement by Michelangelo in the Sistine Chapel is the example that most people know of- the figures have now been restored to the originals.\n i am simply arguing that as I know of no case where a depiction of the Shroud before 1563 had a loincloth on it and every depiction after 1578 does have a loincloth on it (until the pigments of the added paint fell off) then it is likely that the loincloth was added as a result of the decree.  When you discover that two devotees of the Shroud, both of whom appear in depictions as the presiding clergymen at an exposition of the Shroud, are known to have been directly associated with the decree, one of them actually being one of the signatories, then you put the evidence together and wait for someone to refute it.\nRelics suffered all kinds of fates, pieces were cut off, bodies were divided into many parts, there are many fragments of the True Cross and individual thorns from the Crown of Thorns or  relics were concealed in reliquaries. So there would have been no taboos about adding a loincloth to the Shroud whether it was/is authentic or not. I just added it as an interesting part of the story of the Shroud and I am not sure why you are making such a fuss about it!\n\n","date":"October 19, 2014 at 2:34 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163820","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Game is over Charles.\nQuestion was simple: are you aware of anyone who has been on the presence of a loincloth before your work?\nYou’ve answered no, no, no and finally: no.\n\n","date":"October 19, 2014 at 3:03 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163825","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Example of a nonsense:  “Daveb says that the idea that the Shroud could be a stage prop is nonsense. ”  That is a nonsense as that is not what I said!  There are several examples where the Shroud was used not only as a stage prop but as the main feature in its various expositions.  At one time it may well have been used as an altar cloth or even as the original harbinger of the “quem queritis?” ceremony, and perhaps the poker hole pattern did occur in that situation!  What I clearly stated was a nonsense is Charles’ assertion that the Shroud was deliberately created as some kind of artifact for that purpose, which is a different matter entirely!\n\n","date":"October 19, 2014 at 2:50 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163823","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"So I may be the first to have made this point about the loincloth.\nOver the next year or so as experts in religious art of this period read my article, we shall see if I am supported in my argument or not. It is not a question that has any relation to whether the Shroud is authentic or not, of course, and I still don’t understand why you are so worked up about it. It is after all an interesting but peripheral part of  the article.\n\n","date":"October 19, 2014 at 4:17 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163832","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"It peripheral, yet the off-on-off loincloth on the original Shroud is another unrealistic piece to the usual skeptical McCrone/C14 package.\n\n","date":"October 20, 2014 at 12:11 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164063","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Daveb. I am not sure how you can be quite so dogmatic about the creation of the cloth but perhaps you will favour us with the evidence against my hypothesis when you have read the full article and the footnotes.\nIt is obvious from the various pin-pricking comments that my article has not been properly digested as yet. I assume that more sophisticated challenges will be on their way but ,of course, after Thursday I am hoping to draw in specialists who so far have not applied their expertise to the Shroud.\n\n","date":"October 19, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-163833","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"It does seem Charles Freeman has never heard or read or totally overlook French medieval historian and archivist Emmanuel Poulle who argues convincingly in a peer-reviewed journal that Chevalier was intellectually dishonest (see .his article « Le linceul de Turin victime d’Ulysse Chevalier »).\n\n","date":"October 20, 2014 at 12:26 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164065","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Well, as you will see, I do not rely on Chevalier – my main argument rests on the iconography of the Shroud which, whatever Dr. De Wesselow may say ,is fourteenth century. In all his six years of research, he art historian does mot seem to have realised that all- over flagellation marks as seen on the Shroud  only come in the 1300s Had he never read the work of James Marrow who deals with this in depth?\n\n","date":"October 20, 2014 at 2:58 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164092","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I mean the James Marrow who is at Princeton- the great authority on Passion iconography . And I do acknowledge his work in my footnotes! He pins down the all – over flagellation iconography that confirms that the Shroud could not have been painted before 1300.\n\n","date":"October 20, 2014 at 3:05 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164093","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles you wrote: \n  “(T)he art historian does (n)ot seem to have realised that all-over flagellation marks as seen on the Shroud only come in the 1300s.” \n  E.G. what do you make of the scourge marks on an entirely naked Christ dating back to the first quarter of the 9th c. CE (see the Stuttgart Psalter flogging scene) and those symbolically represented as stylised flowers or palmettes in conjunction with an himation/sindon in 1268 CE Armenian Iconography?\n\n","date":"October 20, 2014 at 4:05 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164107","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"You also wrote: “James Marrow (…) deals with this in depth?” Had he, you should had revised your claim (“all- over flagellation marks as seen on the Shroud only come in the 1300s”). You can be wrong in your opinion not in your facts (on which you build up your so-called ‘theory’!).\n\n","date":"October 20, 2014 at 4:11 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164108","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"No, the Stuttgart Psalter does not work because the flagellation has to be from the crown of the head to the soles of the feet to fit with the link to Isaiah 1.6. that Marrow sees as the inspiration of the iconography.The Stuttgart flagellation hardly extends below the buttocks. \nThe Shroud flagellation marks also, as Barbara Faccini points out, are the result of three different instruments and, although she may not have realised this, this fits in with the three Old  Testament texts that Marrow pinpoints as the inspiration of flagellation scenes from 1300 onwards, each text describing a different instrument – see my article. It is the clinching point for a 14th century iconography.\n\n","date":"October 20, 2014 at 4:51 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164117","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles you wrote: “No, the Stuttgart Psalter does not work because the flagellation has to be from the crown of the head to the soles of the feet to fit with the link to Isaiah 1.6. that Marrow sees as the inspiration of the iconography.” \nFirstly, this is not a proven fact but just an opinion (“Marrow sees”).\nSecondly, the true fact is the Stuggart Psalter DOES work and everybody who has got eyes to see (but you and maybe Marrow) CAN SEE the flogging scene does link the flagellation of Christ’s entirely naked body to the TS image. \nCharles are you in bad faith or just blind?\n\n","date":"October 20, 2014 at 5:22 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164126","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"BTW\nIsaiah 1: 5-6. reads: “Your whole head is injured,\n    your whole heart afflicted.\n6 From the sole of your foot to the top of your head\n    there is no soundness—\nonly wounds and welts\n    and open sores,\nnot cleansed or bandaged\n    or soothed with olive oil.”\nIt is NOT referring JUST to scourge marks in particular but to “wounds and welts an open sores” that is to a devastated body (that of “the sinful nation”). Marrow’s forced interpretation and consequently yours is biased as too reductive.\n\n","date":"October 20, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164131","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"The TS man “from the sole of (his) feet to the top of (his) head … has wounds and welts and open sores”. The TS image is definitely in keeping with Isaiah 1: 5-6 and just confirms the prophecy.\n\n","date":"October 20, 2014 at 5:45 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164133","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles, cannot you SEE?\n\n","date":"October 20, 2014 at 5:53 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164136","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"…And what do you make of the all-over wound marks symbolically represented as stylised flowers or palmettes in conjunction with an himation/sindon in 1268 CE Armenian Iconography?\n\n","date":"October 20, 2014 at 6:02 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164139","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Beside methinks you rely too much on Herbert Thurston (1856–1939), English Jesuit, liturgical scholar, and spiritualist investigator (who alike Ulysse Chevalier) used the D’Arcis letters as evidence against authenticity Now Thurston and Chevalier’s anti-authenticity theory rested on biased ground. How can you take up from Thurston who took up on Chevalier? Did you really read Poulle’s article « Le linceul de Turin victime d’Ulysse Chevalier » that convincingly demonstrates Chevalier unashamedly manipulated the presentation of the documents?\n\n","date":"October 20, 2014 at 6:16 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164142","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Methinks Max has not read my article.\n\n","date":"October 21, 2014 at 12:28 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164239","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles I’m replying to YOUR comments on this blog. Are your comment TOTALLY IN CONTRADICTION with what you wrote in your book?\nRe Christ’s Passion iconography (as far as his body appears devastated with scourge marks) PRIOR TO THE 1300s, methinks you (and Marrow) missed a few iconographic evidence:\n1/In the first quarter of the 9th c. CE Stuttgart Psalter flogging scene, Yeshu’a’s scourge marks are already represented:\nOn October 21, 2013 at 7:15 am, I wrote:\n“Re the Psalter miniature and TS dorsal-frontal image Christ-like figure connection, to the astute observer:\n●Both are stark naked with long flow of hair in the back; a hair flow that originally was braid from top into a narrow pigtail but has come half undone. In the miniature, the whole pigtail can be made out from top to tip as it appears slightly darker and longer in the hair flow.\n●Both have arm(s) bound and/or crossed in front. Had both no scourged and/or furrow marks on the inner side arms? This cannot be checked today any longer.\n●Both have bloodied furrow and/or scourged marks in conjunction with two whips with lashes each fitted with doubled pellets implying two executioners.\n●Both have almost feminine curved left hip & thigh (later to be called “the Byzantine curve”). In the miniature the pelvis is shown three quarters as a mishmash of the TS frontal and dorsal images.\n●Both are/were tied at frontal tibiofibular level with left leg in front of right leg (TS man accurate Forensic description from both frontal and dorsal views: left leg in front of right leg with rope marking in the tibiofibular fleshes).\n●Both show a most unnatural/awkward feet position as the three-quarter back view stark naked Christ-like figure being flogged in the miniature combines the TS dorsal and frontal images to be readable.\n●And last but not least, by means of a very intriguing tailed-Epsilon hand sign each time formed with unnaturally curved fingers, the executioner on the left seem to point with his left hand index finger to his own head while the executioner on the right does point to Christ’s head with his left hand index finger too. Both left hand signs cryptically resemble the tailed-Epsilon-shaped like bloodstain pattern decal we can observe on TS man’s forehead, just above his left eyebrow.\nIn a Descent from the Cross miniature from the Bamberg Psalter, (ca 1255 CE, Melk, Stiftsbibliothek), Yeshu’a’s is depicted with a transparent loincloth with scourge marks all over his body.\n2/ “The wound and welts and open sores” (scourge marks included) are also symbolically represented as stylised flowers or palmettes in conjunction with an himation/sindon in 1267-1268 CE Malatia Armenian Gospel Iconography or red crosses see the Hungarian 1163-1195 Pray Ms bifolium folio 28r lower section.\n[paragraph removed by moderator]\nI have no need to read your book to tell you totally missed the series of evidence that ruins your alleged ‘theory’ (intellectual construction). I just have to reply to your last very cheap comment…\n\n","date":"October 21, 2014 at 5:41 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164294","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Reminder for Charles: • Just couple the Stuggart Psalter stark naked Christ back view and the Pray Hungarian MS stark naked front view and you shall get a fairly accurate medieval record of the TS Image as extrinsic proof the TS radiocarbon dating was skewed.\n\n","date":"October 21, 2014 at 6:19 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164300","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"My comment having been displaced on the thread, I repost it:\nIt does seem Charles Freeman has never heard or read or totally overlook French medieval historian and archivist Emmanuel Poulle who argues convincingly in a peer-reviewed journal that Chevalier was intellectually dishonest (see .his article « Le linceul de Turin victime d’Ulysse Chevalier »).\n\n","date":"October 20, 2014 at 12:28 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164067","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"And  you? Have you read both the Poulle’s article and the Chevalier’s writings?\nI have them in my bookcase and I think Poulle’s critic is biased and fails his target. I translate here a paragraph from my blog (http://sombraenelsudario.wordpress.com/2012/07/28/la-aparicion-del-sudario/):\nIn 2006 the historian and archivist Emmanuel Poulle made a very harsh criticism against Ulysse Chevalier, which sometimes falls into the insult. According to him, the renowned historian and canon had wilfully misrepresented the terms of the documentation in hiding the latest papal bulls (…). Without entering into the assessment of the deletions and other issues of documentary importance, we must recognize that Poulle’s position is not entirely consistent. Indeed, the same Chevalier in its 1903 text answer to similar allegations against him and highlights that you cannot question his honesty because he included the text of Jean of Naples’ correction [definitive redaction] (“Autour des origines du suaire de Lirey”, Paris, Alphonse Picard et Fils,  1903, p. 36, doc. K, in Latin). Moreover, he insists that this final document, though softened, is still conclusive about the lack of authenticity of the linen.\nI have to add to this:\nM. Poulle surely is an honest man, but his rabid attack against M. Chevalier ignores two relevant facts. First, although the final text of the papal bull omitted the expression “painted image” and similar still maintained it was a “figure or representation” and demanded that it be said out loud when exhibited “to avoid any fraud”. And it banned the paraphernalia that usually accompanied the exhibition of the accepted relics. Secondly, M. Poulle forgot that the investigation ordered by the bishop of Liege in 1449 confirmed the existence of this papal bull and accordingly ruled that the relic was not genuine but painted. \nSo we have to conclude that was M. Poulle who made some unfortunate omissions.\n\n","date":"October 21, 2014 at 3:54 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164277","author":"David Mo","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"David Mo wrote: “And you? Have you read both the Poulle’s article and the Chevalier’s writings?”\nYes I have (and more than once!). \nMethinks you totally missed Poulle’s main point re which Papal bulls are DRAFTS and which is THE FINAL OFFICIAL VERSION. Ulysse Chevalier DID misrepresent the terms of the documentation in hiding the latest papal BULL and putting in the forefront just ONE DRAFT OF IT to make his point in total disregard of the pope’s REAL official view on the Lirey Shroud.\n\n","date":"October 21, 2014 at 5:53 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164296","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Re Ulysse Chevalier’s document presentation: it was either incompetency or intellectual bias (if not dishonesty). Take your pick.\n\n","date":"October 21, 2014 at 7:33 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164313","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I’m afraid your French is not very good. In the p. 779 of “Les sources de l’histoire du linceul de Turin. Revue critique”, M Poulle should recognise that Chevalier gives the last version of papal bull. He only says M. Chevalier didn’t hold accountable of the last version in the corpus of his writting “en renvoyant à l’apparat critique les additions marginales…”. This is not correct because in the p. 13 Chevalier affirms: “On aurait pu reconnaître avec quelle loyauté scrupuleuse j’ai donné les variantes de la seconde édition, qui atténuaient un peu les expressions très défavorables de la première à l’authenticité. On ne fera jamais dire à cette bulle, même amendée, que le Suaire dont il y est question fût l’original. Il y reste ces mots topiques :Figuram seu  representationem non ostendunt ut verum Sudarium D. N. J. C” .\nAfter, Poulle repeats that the papal position was “neutral”.But he carefully avoids to completly quote this last version that clearly marks that the Shroud is not authentic: only quotes “figuram predictam non ostendunt ut verum sudarium, sed tanquam figuram dicti sudarii Domini” (Poulle’s version has the same sense than that of Chevalier). And not other precisions “omni fraude cessante”, etc.. You need a good deal of blindness  to call this “neutral”. \nNOTA BENE: I can provide you with translations if you have some problem.\n\n","date":"October 21, 2014 at 11:04 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164355","author":"David Mo","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"“M. Chevalier didn’t hold accountable of the last version in the corpus of his writting “en renvoyant à l’apparat critique les additions marginales…””\nYes. In 1903 M. Chevalier reproduced the same version he used in 1900, M. Poulle is right.\n “En renvoyant à l’apparat critique les additions marginales” M. Chevalier a trompé ses lecteurs, reproduisant la version initiale et assimilant les modificiations fondamentales de la version finale (non reproduite) à de simples variations.\n\n","date":"October 21, 2014 at 1:34 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164377","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"David Mo, most curiously you just missed:\n1/ The CRUCIAL FACT is “En renvoyant à l’apparat critique les additions marginales” M. Chevalier a trompé ses lecteurs, reproduisant la version initiale et assimilant les modifications fondamentales de la version finale (non reproduite) à de simples variations.” Most curiously you seem to have missed it!\n2/ Le pape Clément VII imposa à Pierre d’Arcis, évêque de Troyes,  « le silence perpétuel » sur le Suaire de Lirey sous peine d’excommunication. Then again most curiouly you seem to have missed it!\nCan you really read French?\n\n","date":"October 21, 2014 at 1:58 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164380","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Anoxie and Max:\nPlease, please. \nDoes M. Chevalier collect the last version of the papal bull of Clemente VII? Yes. Cf. Poulle 2009: 779.\nDoes M. Chevalier collect this last version in the critical apparatus (i.e. quotations and appendices)? No. He also makes reference in the text. Cf. Chevalier 1903:13.\nDoes the papal bull affirm the Shroud is not the true Shroud of Christ but a “representation” of it? Yes. See Poulle 2009:778 and Chevalier 1903:13\nDoes the papal bull oblige to pronounce aloud this point when the Shroud is exposed in order to avoid any fraud and heresy? Yes. CF. Chevalier 1903:14, 36.\nDo you have the Poulle’s article? or do you understand French and Latin? Sincerly, I doubt it\nWhat version of the Chevalier’s text are you reading if any?\n\n","date":"October 22, 2014 at 4:02 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164539","author":"David Mo","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"David Mo,\nI taught French language and Civilization for two years at the University of Riyadh (Faculty of Arts and College of Education). Thank you. I can read Modern French, Old French, a few Old French dialects, Classical Latin,  Medieval Latin and Ecclesiastical Latin all right, what about you?\nI photocopied and read the POULLE’s whole article in 2006, in the very semester it was published, which led me to read both Ulysse Chevalier articles’ 1900 and 1903 versions (in “Bulletin d’histoire et d’archéologie du diocèse de Valence”, t.20, p. 113-167 and in Memories of the Academy of Sciences, Great Literature and Arts of Lyon, 3rd series t.7, p. 237-312). \nI STILL think you just cannot read Emmanuel POULLE’s French correctly and totally missed Ulysse Chevalier’s manipulation of the documentary evidence.\nShall I remind you:\nRe the APPEARANCE of truth\nAs early as the end of the 14th c CE, it was agreed Clement VII took a position clear and cut against authenticity of the TS: it was indeed the obvious conclusion upon the reading the documents published by the canon Ulysse Chevalier more than a hundred years ago…\nRe the archivistic REALITY\n…till in 2006, Emmanuel POULLE published his work in a peer-reviewed journal (“Revue d’Histoire de l’Eglise de France, t.92, p.344-5358) and convincingly demonstrated the documents in question were falsified by the canon.\nJust in case you hadn’t read it (and methinks you hadn’t), here are a few excerpts from an article published in the RILT, n° 20,p. 10-15, June 2007 and entitled: \n“Examination of the file published by Ulysse Chevalier”\n(I do hope you’ll be able to understand what the article REALLY say in English since French language and Latin subtleties do seem just to elude you).\n“Emmanuel POULLE submitted a new examination of the file published by Ulysse Chevalier, and he dismantles the MECHANISM (upper cases mine) WHICH TRANSFORMED what should have been a serene and strictly scientific erudite work in a machine of (intellectual) war TO MAKE THE dug up DOCUMENTS SAY THE OPPOSITE OF WHAT IT SAID (upper cases\nmine”). \n“(In his 1900 article) Ulysse Chevalier had retained for his edition the first version (of the bull) ether becaus it was in better coherence with Pierrre d’Arcis’ report, or because it answeed better than the second on his own conviction (UC’s) about the attitude of the Church in front of the gullibility of ancient times. The textual variants of the qualified version with regards to the edited version were, according to practice followed for scientific edition of the historic sources, sent back in critical apparatus, thus printed in small characters, at the bottom of the page, so that the TEXT of this SECOND VERSION passed UNNOTICED; and actually, NOBODY SEEMS TO HAVE NOTICED that the VARIANTS of the critical apparatus were NOT OF PURE SHAPE, BUT PRODUCED A TEXT SOLEMNLY DIFFERENT from the published text.”\nRe the corrections to the first bull version:\n“The deletions and additions basically came down to two major corrections: \n– The first one consists of the abolition of part of bans formulated in the first version: no further mention of preventing the clergy from dressing in his priestly clothes during ostensions, only remains the limitation of the profusion of light to which ostensions gave place.\n-The second correction concerns the very question of authenticity of the shroud: while the first version ordered the clergy to assert peremptorily that the relic preserved at Lirey was a forgery, the second was content in asking that, during the solemnities of the ostension it was specified that these solemnities were due, not to the shroud itself, but to the presence of the image of Christ. \nThe correction was made by moving the “non significance” (“figura predicta non est verum sudarium”) became “figuram predictam non ostendunt ut verum sudarium”), by getting rid of the almost offensive name of the shroud “pictura seu tabula” and by playing on the sense of neutrality of (the Latin phrase) “figura seu representatio”, WHICH DOES NOT FORSEE THE NATURE OF THE “FIGURE” IN QUESTION, first appeared as painted, then for which the presence of the image on the shroud is simply noted.\nAs A MATTER OF FACT, the Pope contented himself to recommend to proceed with caution during ostensions of the relic.”\nThe fact remains there are strong yet subtle differences in both versions: \n“THE FIRST VERSION THAT ULYSSE CHEVALIER WANTED TO PASS, AND THE SECOND (and definite version) WHICH SHOULD HAVE BEEN THE ONLY VERSION TO BE HELD BUT WHICH HE DELIBERATELY MADE UNRECOGNISABLE.”\n(for the two different versions one uncorrected and the other corrected see ib. p.13)\n“Thus the conclusion is VITAL: the Papal chancellery had AT FIRST intended to make his position which Pierre d’Arcis had expressed in his report, which remember, is only known by a copy and it had asserted the falseness of the shroud and forbidden ostensions be made in solemnity; THEN, investigation made, it had appreciably (re)qualified his instructions. Moreover, we will note that in the part of the bull of general reach which was not the object of corrections,  therefore from its first version (it was the object of that of the four bulls which was specifically sent to him), about the question of the public ostensions of the shroud which took place at Lirey, a perpetuum silentium, which looks like an invitation to be quiet.”\nReminder here: re pilgrimage making and money making, Pierre d’Arcis was in conflict of interest with Geoffroy de Charny II.\n“What’s more, confirming this change of point of view on the shroud (investigation made), the Pope, at that same time as he was having the bull of general reach corrected inearly JUne 1390, another bull was being written to ENCOURAGE THE PILGRIMAGE TO LIREY, bull which formulated NO RESERVE OF ANY KIND EITHER ON THE RELIC OR IN ITS OSTENTIONS: it is the “L” document of the file of 1903, that Ulysse Chevalier had not heard of in 1900 and that he discovered four years later when recording in the Registers of Avignon.\nThe 1903 file, containing the new version of the published bulls four years later as well as this “L” document, could thus appear as A REHABILITATION OF THE SHROUD which the 1900 file had rather manhandled; unfortunately it was not the case BECAUSE OF THE UNSPEAKABLE BEHAVIOUR OF ITS PUBLISHER (aka ULYSSE CHEVALIER). Denied, in a sense, by the versions of the bulls found in the Avignonnais Registers, dressed in more authenticity than the copies devoid of any sign of (official) validity” which he has used in 1900, Ulysse Chevalier should have, in all honesty, recognised that he had made the bad choice and he should have published in “Autour des Origines”, the version that he had primitively rejected. Not only did did he not do so but he repeated in 1903, STRICTLY UNCHANGED, the already published FALSE VERSION, but, by continuing to relegate the right one in a harmless critical apparatus, he was careful not to indicate that the difference between the two versions was based on a series of deletions and corrections; whilst the first version was henceforth non longer, as in 1900? an option which no one would have been able to continue to consider defensible, he sinned by omission, and by grave omission, by abstaining from mentioning that it had formally been rejected by the office of the Pope, otherwise by the Pope himself.”\nUlysse Chevalier’s stubbornness (to maintain the first version of the bull of January 1390, while he had it followed by the text of the June bull the same year, which contradicted it, ending up as a file of incoherence), disqualified him definitively.\n“Clement VII took by no means the responsibility of the assertions hurled without proof by Pierre d’Arcis, to say the shroud, then kept at Lirey was false, a painting made by an individual who has been identified and who has recognized his work. (The true fact is the Pope) encourages the believers (the “L” file) to continue to come and honour the shroud of Christ.”\n\n","date":"October 22, 2014 at 8:55 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164606","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"M. Poulle’s work is crystal clear, perfectly documented and argued, and proved as i’ve said:\n” “En renvoyant à l’apparat critique les additions marginales” M. Chevalier a trompé ses lecteurs, reproduisant la version initiale et assimilant les modifications fondamentales de la version finale (non reproduite) à de simples variations.”\nI think that’s why Dan has written in his faq about Chevalier’s work:\n“His analysis has been largely rejected by modern historians. Nonetheless, skeptics of authenticity often refer to his works.”\nThis is just another obvious illustration of the skeptical bias.\n\n","date":"October 22, 2014 at 10:03 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164617","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"You had not read the Poulle’s article I quoted (2009) as I have supposed. You only mention a precedent article of Poulle (2006) and copy some paragraphs from other article of the Revue Internationale du Linceul de Turin. I don’t know who the author is. Of course, he is not M. Poulle and it doesn’t add nothing to the points I marked above.\nIf you have much time to lose with disgressions I have not.\n\n","date":"October 22, 2014 at 11:28 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164647","author":"David Mo","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"David Mo,\n Could you tell what is the EXACT/CRUCIAL difference between POULLE’s articles:\nE. Poulle, « Le linceul de Turin victime d’Ulysse Chevalier », Revue d’histoire de l’Eglise de France, vol. 92, n° 229, 2006, pp. 343-358. \nAnd\nE. Poulle, “Les sources de l’histoire du linceul. Revue critique”, Revue d’histoire ecclésiastique, vol. 104, n° 3-4, 2009 , pp. 747-782\nPLEASE?\nRe your main point, methinks you STILL don’t understand or don’t want to understand the CRUCIAL FACT that:\nThe first version (not to be held) reads:\n“(…) The one who makes the ostensions warns the people and says publicly, loudly and clearly, when the influx is strongest, all fraud ceasing, that this “figure” or representation is not the real shroud of Christ, but a painting or picture of the figure or a representation of the shroud that is said having been Christ’s (…)”\nThe second and definite version (to be held) reads:\n“(…) the one who makes ostensions, every time there is a sermon, at least, warns the people and says publicly, loudly and clearly, when the influx is strongest, all fraud ceasing, that we don’t show the figure or representation as being the true Shroud of Christ, but as figure or representation of the shroud which is said to be Christ’s (…)”\nNow this last sentence can also be translated, considering the balanced use of “ut in front of “tanquam” and of the double function, subjective and objective of the genitive “dicti sudarii” that “we don’t show the figure or representation because it is the true Shroud of Christ but because of the figure or representation which it carries that is said to have been that of Christ’s”\nNope if your mind is set and you STILL cannot/do not want to understand…\n\n","date":"October 22, 2014 at 12:36 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164662","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Don’t deconstruct the text, please. Poulle and Chevalier agree on believing the last version of the papal bull is softened. But there is a big difference of interpretation. Poulle claims the last version is neutral. Chevalier affirms that some conditions for the ostension are defused but the main content is the same. I agree with Chevalier. The clue is some words ignored by Poulle: omni fraude cessante, i.e. to avoid any fraud. If the last bull imposes some conditions to the ostension (the Srhoud of Lirey is not shown as the authentic Shroud, no candles, etc.), it is in order to avoid any fraud. And what is the only fraud thinkable in this case? Obviously one: to show the sheet as the authentic shroud of the Christ. \nMy conclusion: both Chevalier and Poulle have a biased point of view, but Chevalier’s conclusion is more accurate. The last version of the papal bull just is a usual exercise of euphemistic ecclesial language. Making confuse what is clear.  \nP.S.: Can I get your academic bibliography? I am curious. Thank you.\n\n","date":"October 23, 2014 at 3:36 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164794","author":"David Mo","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"DaM,\nYou wrote: “Don’t deconstruct the text, please”… \n… when I was just quoting the passage in Latin \n“figuram predictam non ostendunt ut verum sudarium, sed tanquam figuram dicti sudarii Domini” \nyou clearly misunderstood and therefore addressing your main point ! This is what I would call “bad faith” (in Latin FRAUDO)\nIn a NOTA BENE your wrote: “I can provide you with translations if you have some problem.”\nOK GO AHEAD give YOUR OWN translation along with hermeneutic comments if you dare.\nYou also wrote: “The clue is some words ignored by Poulle: omni fraude cessante, i.e. to avoid any fraud.”\nMethinks you haven’t the foggiest idea what the Medieval Ecclesiastical Latin word fraudo means here in this definite context!\nIn Latin the substantive fraudis can mean “bad faith”, “deceit”, “fraud” etc, AND “misrepresentation”, “error”, “mistake”.\nHere it just means “misrepresentation ceasing” since, investigation made, nobody could really tell for sure whether the shroud was painted or not, the true shroud of Christ or not. This is indeed a neutral stand from the Church. And Emmanuel POULLE’s hermeneutics as both Medieval Historian and Archivist is right. Yours is wrong.\nMethinks POULLE’s knowledge of Medieval Latin and French (and eventually mine) are far more reliable than yours.\nDon’t you read the Medieval Ecclesiastical Latin fraudo with your preconceived 21th mind, PLEASE!\nNope if you STILL STILL STILL cannot/don’t want to understand.\nPS: Don’t you play the game of distracting people from the main subject. I just thought you hated  “disgressions” that make you “waste your time”. Don’t you waste mine.\n\n","date":"October 23, 2014 at 7:21 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164840","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Note: FRAUDO (= MALFOY) as name derived from the verb FRAUDO and synonym of FRAUS, FRAUDIS\n\n","date":"October 23, 2014 at 7:32 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164845","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Typo: “ALL misrepresentation ceasing” (omni fraude cessante)\n\n","date":"October 23, 2014 at 7:52 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164851","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"BTW, who are you to assert POULLE’s hermeneutic is wrong?\n\n","date":"October 23, 2014 at 8:00 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164854","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"More typo:  Don’t you read the Medieval Ecclesiastical Latin fraudo/fraudis with your preconceived 21st c. CE  mind, PLEASE!\n\n","date":"October 23, 2014 at 8:14 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164856","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Reminder: \nOmni fraude cessante here can also be rendered by “all false assertion ceasing” (whether for or against authenticity) as a misrepresentation may be made fraudulently, negligently, or non‐negligently (innocently). In other words, it refers here to any false assertion (of fact, opinion or intention) made whether for or against authenticity in the state of knowledge of the time.\n\n","date":"October 23, 2014 at 9:32 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164874","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"BTW I am still waiting for you to answer my previous question:\nCould you tell us what is the EXACT/CRUCIAL difference between POULLE’s two articles:\nE. Poulle, « Le linceul de Turin victime d’Ulysse Chevalier », Revue d’histoire de l’Eglise de France, vol. 92, n° 229, 2006, pp. 343-358.\nAnd\nE. Poulle, “Les sources de l’histoire du linceul. Revue critique”, Revue d’histoire ecclésiastique, vol. 104, n° 3-4, 2009 , pp. 747-782\nPLEASE?\nYou read the 2009 article OK but have you read his 2006 article (the first on the issue he published)? Methinks you just haven’t.\n\n","date":"October 23, 2014 at 9:51 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164877","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"What a silly game; but if you like… These are the last words of the second paragraph:  “R.P. Vittorio Marcozzi”. OK?\nI have not the original issue but a reprint in a French Review devoted to the Shroud. Fortunately it is in my P.C.\nThe first meaning of “fraus- fraudis” is fraud, cheating, etc. And this fits perfectly with the text of the papal bull because it speaks about how avoid a fraud. \nI’m waiting for your bibliography. I think it will be very interesting. University of Riyhad. It sounds exotic.\nI’m not at home, but I will continue this “exciting” game tomorrow.\n\n","date":"October 23, 2014 at 11:06 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164887","author":"David Mo","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Still waiting for you telling me what is the exact/crucial difference between Poulle’s two articles.\nStill waiting for you to provide me with your own translation of the passage in question with your authoritative hermeneutical comments.\nBTW Have you ever heard of Latin polysemy? Contextuality? Ecclesiastical convoluted/ambiguous prose? Medieval Latin? FIRST do you home work before indulging in your silly game. \nRe the main issues (Ulysse Chevalier’s misrepresentation of the Papal bull + translation and polysemy of the key passages, my comments have been detailed and substantive ones so far. Not yours, far from it.\nMethinks you’re just trying to elude THE REAL ISSUES and just cannot discredit my viewpoint all the more so as it is consistent with Poulle’s.\nWhere are your hermeneutical trump cards? I have seen NONE so far just unsubstantiated claims based on a very poor knowledge of both Medieval Latin and Modern French language.\n\n","date":"October 23, 2014 at 11:40 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164893","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Subsidiary question for DaM: \nCould he tell why would Clement VII have allowed and even encourage the Lirey Shroud to be displayed with an indulgence attached if his view in June 1390 was the Shroud was a fake/hoax/forgery?\n\n","date":"October 23, 2014 at 1:06 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164910","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Can Charles tell us what as a Roman Historian what he REALLY makes of the literary synthesis  of several corroborating 944-1207 CE testimonies and eyewitness descriptions (from Gregory Referendarius’, Archdeacon of Hagia Sophia, to Nicholas Mesarites’, overseer of the treasuries in the Pharos Chapel of the Boucoleon Palace of the emperors via Robert de Clari’s, Fourth Crusade Picard knight, and a few others): a literary synthesis that builds a strong if not crucial evidence the Turin Shroud  and Constantinople Sindon could be one and the same object?  Here are the literary synthesis:\n“[In the church of My Lady Saint Mary of the Pharos (“lighthouse”) in the Golden Imperial Palace of the Boucoleon in Constantinople and another church called My Lady Saint Mary of Blachernae], Christ ‘rise[d] again’ [then], and the sindon(1) with the burial linens [was] the clear proof. [This sindon] as white as snow from antiquity, [was] of linen, of easily obtainable material, remained uncorrupted and smell[ed] fragrant of myrrh. [It] def[ied] decay because, after the Passion, it [had] wrapped the elusive(2) dead naked body.\n[When] raised upright, not only the image of the glorious features of the Saviour’s face with dripping drops of blood shine[d] out but also the form and most noble stature of his entire body hanging down from the cross and embellished with drops of blood and water that make the liquid flow from his own side, could be plainly seen. This [was] not the art of the painter and the various beautiful colours, which provide a door for the mind to consider the original and depict images [that could possibly have depicted] the reflection of his appearance and size imprinted on [his sindon]. [So much so] the ‘not-made-by-hand’ image of Christ and G-od, draped with a white/pure linen cloth he had worn, was sufficiently in lieu of the vision of the Lord coming into the flesh to those who had not corporally seen him.\nAfter the city was taken, the French partitioned the relics of the saints and the most sacred of all, the sindon in which our Lord Jesus Christ was wrapped after his death and before his resurrection. We know the sacred sindon in Athens. [In this city] we saw with our own eyes the burial linen cloths found in the sepulchre.”\nDoesn’t it reads as strong historical evidence indeed and tends to prove the presence of the most famous contact-and-blood relic of Christianity at Constantinople prior to 1204?\nNotes: (1). – Also called sydoine and synne1 in old French; the latter for “sign” (Latin signum; Greek symbulos). (2). – Greek aperilepton, i.e. consistent both on one hand with G-od’s “un-circumscribed”, non coercive and loving, divine nature that has no shapes, is beyond description and the binds of Death cannot contain and, on the other hand, Yeshua’s “un-outlined”, evanescent nature of his own image on his sindon.\nHope English Roman Historian, Charles Freeman can arguably reply with more than a mere wave of the hand declaring ‘irrelevant’ any testimonies and eyewitness descriptions of the Shroud (now kept in Turin) prior to HIS ‘1300s. Are literary, iconographic and archaeological pieces of evidence prior to 1300s  REALLY irrelevant because they are in blatant contradiction with Mr Freeman’s alleged ‘theory’ and he just doesn’t want to hear about them?\n\n","date":"October 21, 2014 at 6:48 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164306","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I can’t tell you much, Max ,because there is not a shred of evidence that it is the Shroud that they are referring to. Surely in all your researches you have come across inventories of monasteries and cathedrals that were once full of painted images on cloth ,many of them specifically mentioning that they are of the risen Lord. The misconception of many Shroudies is to assume that if there is a mention of an image of Christ on a linen ,it must be the Shroud.\nThe Shroud is important as , even with its pigments disintegrated, it is a rare survivor of the thousands of painted images on linen that were once documented, especially for use Lent and Easter hence images of the risen Lord.\nAnd your admittance that you have not read my book ( actually an article in a serious history journal)but can still comment on it  really shows you up.!!\n\n","date":"October 21, 2014 at 12:47 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164369","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles you wrote: “there is NOT A SHRED OF EVIDENCE that it is the Shroud that they are referring to”. Are you kidding? \nFirstly, could you tell me then to which ‘non painted bloodstained sindon’ presented as Yeshu’a burial (and resurrection!) sheet are they referring to and what about you own misconception?\nSecondly, could you refer me to the conclusive Medieval Art expertise claiming the image on the Turin Shroud results from pigments disintegration and can be compared to thousand of painted images on cloth of which pigment disintegrated with time?  \nThere’s none so deaf AND blind as an English anti-authenticist Roman historian speaking outsid his field of professional expertise who will not hear AND see and most sadly is not only deceivingly himself but unashamedly poisoning the well.\nRe ‘your literature’ you want me to read, just your stand on the issue speaks volumes.\n\n","date":"October 21, 2014 at 2:30 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164390","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I knew form the begining that discussing this obviously anti-shroud propaganda article makes no sense, and Charles’ approach there was not honest at all. But does he even care about that? I don’t believe that. Anyway, he just have earned £200 writing this nonsense.\n\n","date":"October 21, 2014 at 2:39 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164394","author":"O.K.","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"O.K. It is easy to agree with what you say in the first paragraph.\nAs for the second, I think receiving payment for an article in an historical journal is fine and it is only 200 pounds sterling, almost chicken feed. What can you do with that in England? The big problem is that not all historical journals are fair, they can be very biased. I am constantly queried by people about sources, and have to tell them not to rely on TV and to be careful with what they read, whether these be magazines, journals or books, turning down requests to give talks.\nIt would be helpful if Charles tells us in what he believes, whether he belongs to any religious denomination.\nYou know that slander, character assassination, vicious personal attacks, insults were seen on this blog with much more frequency and began with “Shroudies”. The non-“Shroudies” learnt from them. If “Shroudies” show no respect, the non-“Shroudies” will not respect them.\nThere has to be change for the better and Dan is on the way.\n\n","date":"October 21, 2014 at 5:07 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164421","author":"Louis","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Re calcium carbonate: \nLimestone is mainly calcium carbonate. In light of a Second Temple period burial, Jerusalem limestone-dust (+ Red heifer ashes? )mixed with water could have been used on the TS man’s burial in order to create an alkaline solution and soak in the large inner burial wrapping (aka TS). Once the body tightly wrapped up in additional dry shrouds and subjected to an aloetic fumigation, it could have purified the crucifixion’s shed innocent blood and kill flesh flies’ larvae and blow-flies’ eggs. \nBut methinks if heard through Charles’ ears-and-brain all this shall be ‘irrelevant’ since he just cannot imagine the real possibility for the TS to date back to the 1st c. CE. \nBesides:\n1/When “the wound and welts and open sores” (scourge marks included) are also symbolically represented as stylised flowers or palmettes  painted all-over Yeshua’s himation/sindon in 1268 CE Armenian Iconography? an himation/sindon in the 1267-1268 CE Malatia Armenian Gospel Iconography \n2/When a Descent from the Cross miniature from the Bamberg Psalter, (ca 1255 CE, Melk, Stiftsbibliothek), depicts Yeshu’a with a transparent loincloth with scourge marks all over his body.\n3/When Yeshu’a’s scourge marks are already represented as early the first quarter of the 9th c. CE in the Stuttgart Psalter flogging scene, and re the Psalter miniature and TS dorsal-frontal image Christ-like figure connection, to the astute observer:\n●Both are stark naked with long flow of hair in the back.\n●Both have arm(s) bound and/or crossed in front.\n●Both have bloodied furrow and/or scourged marks in conjunction with two whips with lashes each fitted with doubled pellets implying two executioners.\nHow can Charles still  believe and want us to believe along with him that “all-over flagellation marks as seen on the Shroud ONLY COME IN THE 1300s” (SIC! my upper cases)? How can he still thinks it is “the clinching point for a 14th century iconography” as “the flagellation has to be from the crown of the head to the soles of the feet (SIC!) to fit with the link to Isaiah 1:6. that Marrow sees as the inspiration of the iconography.” \nReminder for Charles and Mr Marrow: Isaiah 1: 5-6 does NOT specifically refer to scourge-marks  as it reads:\n“Your whole head is injured,\nyour whole heart afflicted.\n6 From the sole of your foot to the top of your head\nthere is no soundness—\nonly wounds and welts\nand open sores,\nnot cleansed or bandaged\nor soothed with olive oil.”\nCould Charles show us scourge-marks on the TS man’s ‘crown of the head” and “soles of the feet”, PLEASE? There are none in those specific body areas! Marrow’s forced interpretation and consequently Charles’ is biased as too reductive.\nRe the Constantinople Sindon, Charles also wrote: “there is NOT A SHRED OF EVIDENCE (my upper cases) that it is the Shroud that (944-1207 testimonies and eye-witness descriptions) are referring to”. \nFirstly, could he tell us then to which ‘non painted bloodstained sindon’ presented as Yeshua’s burial (and resurrection!) cloth, are the 944-1207 testimonies and eye-witness descriptions referring to? \nSecondly, could he refer us to the Medieval Art expertise positively concluding, as Charles peremptorily asserts, the image on the Turin Shroud results from pigments disintegration and can be compared to thousand of painted images on cloth of which pigment disintegrated with time?\n\n","date":"October 22, 2014 at 11:37 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164649","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"“and copy some paragraphs from other article of the Revue Internationale du Linceul de Turin.”\ngrostesque.\n“I don’t know who the author is.”\nanoxie, it was just my own comment!\nthis should stop, any serious archivist (and M. Poulle graduated and was eventually directeur de l’école des Chartes…) reading French would reach the same conclusion.\n\n","date":"October 22, 2014 at 12:29 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164660","author":"anoxie","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Max, the article will be online tomorrow at History Today. You haven’t even read it yet. Don’t waste everyone’s time until you know what you are talking about and if you wish to comment as you are free to do, make sure your comments relate to the article and are written in a form that is comprehensible. Thanks.\n\n","date":"October 22, 2014 at 12:38 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164663","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"il buongiorno si vede dal mattino…\n\n","date":"October 22, 2014 at 1:06 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164668","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hi Max\nMy doubt is whether the TS would have been used as a corporal. See:\nhttp://www.greatshroudofturinfaq.com/Science/limestone.html\nIt is true that the corporal is made of linen, but to have used the relic for this purpose?\nhttp://www.spc.rs/eng/metropolitan_hilarion_leads_worship_shroud_turinhttp://www.spc.rs/eng/metropolitan_hilarion_leads_worship_shroud_turin\n\n","date":"October 22, 2014 at 6:12 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164708","author":"Louis","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"If the second link above does not open, try the one below and click on the third ilustration on the left\n http://www.spc.rs/eng/metropolitan_hilarion_leads_worship_shroud_turin\n\n","date":"October 22, 2014 at 6:17 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164709","author":"Louis","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hi Louis,\nMethinks Jerusalem limestone dust is the most likely yet no one can totally exclude the Shroud could also have been used at one point in time as a corporal on a limestone altar.\nReminder: the meleke — also transliterated melekeh or mal(a)ki —  fine and pure limestone/royal lime stone of Jerusalem can be very closed to Travertine, a form of limestone that the Romans called lapis Tiburtinus. The word was derived from an old Roman name for the town of Tivoli, Tibur, about 20 Km from Rome, Italy.\n\n","date":"October 22, 2014 at 6:37 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164715","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Could be, but no one found any sign of bread or wine till today. Ian Wilson detected what he saw as a stain on the unbound “pigtail”, which he interpreted as hair oil used to keep it bound. He had suggested that Scotland Yard could examine the stain.\n\n","date":"October 22, 2014 at 6:45 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164717","author":"Louis","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"There would seem to be several possible explanations for presence of limestone.  There is said to be aragonite present on the nose, a knee and on the soles of the feet.  There is a persuasive argument that this is Jerusalem road dust from the TSM walking to the place of execution and from a fall during this journey.  \nAs to any other limestone present, it will depend on whether it is in the form of dust or has merely been shown to be optically present.  If in the form of dust it would be desirable to know if it is CaCO3 or aragonite, the two different minerals indicating separate sources.  If it has been only shown to be merely optically present, it is easily explained by absorption during the retting process of the flax in a limestone environment, which would include the environs of Jerusalem;  retting would also explain the presence of iron, quantification of trace minerals such as strontium potentially indicating a specific site.  \nThe pattern of the poker holes would suggest it may have then been folded to match the size of an altar table.  It has been argued that the holes may have been formed by grains of incense when the cloth may have been used as an altar cloth or even a corporal as Max suggests.  The ancient historical sources equating the altar cloths with the burial cloths is at least suggestive that it may have been used at some type of special liturgy for this purpose. \nIf the limestone is dust, it may have adhered to the cloth from the tomb or else from a limestone altar table.  \nCharles’ argument that gesso priming for painting the cloth is in my view a very weak one, as it is necessary to know the form of which the additional limestone occurs, CaCO3 or aragonite dust or merely optical lime.\n\n","date":"October 22, 2014 at 7:27 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164724","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles wrote: “I know of NO CASE (my upper cases) where a depiction of the Shroud before 1563 had a loincloth on it and every depiction after 1578 does have a loincloth on it “.\nRe bare-handed ostension of the image of the Shroud man with and/or without loin cloth:\nEarly in the 16th c CE (that is definitely ‘before 1563’), a mural external fresco, cemetery church of Viverone in Piedmont, (phototograph by Massimo Centini), does show the Shroud man with a loin cloth \nWHILE\nIn the mid 16th century the detail of a miniature  from the Turin Royal Library, does show the Shroud man ventral image with a loin cloth and dorsal image with no loin cloth!\nNow Charles will know there at least two cases where depictions of the Shroud just do not fit in his so-called ‘theory’.\n\n","date":"October 23, 2014 at 10:45 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164884","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"There are any number of pictures of Jesus lying on the Shroud, wearing a loincloth before 1563, but that’s not what Charles was saying, if I read him correctly. He specifically mentions “a depiction of the Shroud” itself. That narrows the field somewhat, but I daresay he’s right that such as they are (the Lier shroud and the pilgrim medal are all I can think of), they show a naked Jesus.\n\n","date":"October 23, 2014 at 12:13 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164899","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"And there is the Margerite de Valois prayer book of 1559 that is shown in the illustrated version of my article. So three out of three.\n\n","date":"October 23, 2014 at 12:53 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164906","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hugh, do your home work before passing comment. The two depictions I referred you to are of the Shroud itself with loin cloth and are totally unknown both to you and Charles\nThe two I mentioned are from my 2007 unpublished paper in French “LINCEUL DE TURIN : FAUSSE RELIQUE OU FAUSSE DATATION Carbone 14 ? (Contre-enquête sur un fiasco scientifique et archéologique)\n\n","date":"October 23, 2014 at 1:19 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164912","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"How can Hugh do his homework if the references you noted are unpublished?\n\n","date":"October 23, 2014 at 1:44 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164918","author":"David Goulet","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"David, just guess how I found them and put them as illustrations in my paper? Are you so naive that you ignore what Shroud RESEARCH is all about?\n\n","date":"October 23, 2014 at 1:48 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164921","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Let me guess, you found them at the public library. If one is naïve then one cannot ignore, i.e. you cannot ignore that which you do not know about.\n\n","date":"October 23, 2014 at 1:57 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164923","author":"David Goulet","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Just blabla…\n\n","date":"October 23, 2014 at 2:19 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164927","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"My thoughts exactly. We are in agreement at last.\n\n","date":"October 23, 2014 at 2:20 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164929","author":"David Goulet","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Nice to hear you agree with yourself and incidentally with me…\n\n","date":"October 23, 2014 at 2:24 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164932","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"I concede a touché on that one, Max. :)\n\n","date":"October 23, 2014 at 2:47 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164935","author":"David Goulet","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"No Max, I should not have to go hunting for your sources any more than you should have to go hunting for mine; that’s not how research works. In the absence of your references, I do not consider your allegations substantiated, and neither need anyone else. Charles’s statement remains unrefuted.\n\n","date":"October 23, 2014 at 4:03 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164951","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"My thoughts about Charles’paper.\nFIRST PART.\n1) “No one appears to have investigated the kinds of loom, ancient or medieval, on which a cloth of this size may have been woven”\nAll the textile experts discussed this point and the kind of loom with which the TS has been woven is consistent with an ancient origin. The size is not at all a problem.\n2) The 1613 Tempesta engraving. As Charles wrote it shows several features very different from what we see today on the TS: the Crown of thorns, the loincloth etc.\nThere are other obvious features Charles failed to comment. For example, the fact that the shoulders of the TS man are visible on the engraving despite the fact that after the 1532 fire, the shoulders were missing.\nIt’s enough to conclude that this engraving can not be the exact reproduction of the Shroud in 1613.\nThe same is true for many reproductions of the Shroud. There are even post 1532 paintings that do not show the marks of the fire! See:\nhttp://www.shroud.com/pdfs/ssi12part4.pdf\nWhen Charles writes: “Texts describing the Shroud confirm the accuracy of the Tempera engraving”, I ask: show the texts.\n3) Charles basic hypothesis is that the reproductions of the TS were accurate. More precisely the loincloth which was not present in the previous reproductions of the shroud has been painted ON the Shroud after the Council of Trent in 1563 and then disappeared with time.\nThis is not true.\nThere are at least two dated reproductions made AFTER the Council of Trent showing absolutely NO loincloth.\nSee the 1643 Rome painting and the 1634 Moncalieri painting in:\nhttp://www.shroud.com/pdfs/ssi12part4.pdf\nThere is also at least one post 1563 painting without evidence of a loincloth: the 1571 Alcoy painting.\n4) The other features are also very variable. The crown of thorns is obvious in some paintings, not clearly seen in others and absent in the 1652 Naples reproduction. The “blood belt” is not seen in most of the paintings (or perhaps included in the loincloth), or depicted as a chain, or clearly shown as blood in the 1634 Moncalieri painting. The image seems to be painted as a faint image in the 1634 and 1643 paintings, more or less faint in the 1516 Lier painting as well as in the 1571 Alloy, 1653 Cuneo and 1678 imperia paintings while in many other pictures it is not faint at all.\nConclusion:\nThe reproductions of the Shroud are very variable.\nObviously, none of them can be seen as accurate representations of the Shroud whatever the epoch.\nRegarding the loincloth, it is possible that the 1563 Council of Trent plaid a role in the REPRESENTATIONS of the TS image. In any case, the fact that there are some paintings made before 1563 with a loincloth and some paintings made after 1563 without a loincloth shows that the loincloth could not have been painted on the Shroud because of the Council.\nInterestingly, when there is a loincloth, it is generally painted on the buttocks but not on the front (except for the 1653 Cuneo reproduction).\nThis strongly suggests that the loincloth was an interpretation of the more or less rectangular area of the buttock’s image.\nThe loincloth can not have been painted on the shroud itself.\nMore later.\n\n","date":"October 23, 2014 at 5:13 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164966","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"One of the first tasks of future research into the Shroud (the object that ‘ has had more research in it than any other artefact in history’ ( lol)) is to make a data base of all early depictions of it. These must be divided into the depictions of expositions, such as in Tempesta’s engraving, and copies of it found in other contexts. We must be careful with copies- those in churches in Piedmont are surely inspired by the Shroud even if they do not have the fire marks – other so- called copies, those in Spain , may not be direct copies of the Shroud at all but actually similar clothes used in the Spanish Easter ceremonies. For me the major remaining  mystery of the Shroud is why it has two images on it when others have only one. ( Of course,  in Byzantine art double images are common.)\nOnly when we have all the depictions can we begin to make a final assessment. Were the marks more vivid in the fifteenth and sixteenth centuries?  Were some features such as the Crown of Thorns and thumbs on the hands shown consistently across the decades by different artists portraying the expositions.?Can we say that the figures were naked before 1563 but with a loincloth afterwards? With the loincloth are the artists each painting their own loincloth or are they portraying the loincloth they can see on the Shroud.?\nSo there is a great deal of basic work that has not yet been done. I am concentrating on working with those who accept that the Shroud is fourteenth century but realise that there is still so much work to be done on it.\nI have to say that I find it ridiculous when I read that in some way I really know the Shroud is authentic but that I  want fame and fortune by pretending that it is not. I really do believe that the evidence is overwhelming that the shroud comes from the fourteenth century. As I can see from the worldwide publicity a single article in the Guardian shows that  a new debate can begin on other websites that deal with medieval iconography, ancient weaving and medieval liturgy. This is where I will be working. Who knows where we will be in a year’s time in research on the Shroud once these specialists become involved?\n\n","date":"October 26, 2014 at 9:50 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165777","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles Freeman wrote:\n“Only when we have all the depictions can we begin to make a final assessment. Were the marks more vivid in the fifteenth and sixteenth centuries? Were some features such as the Crown of Thorns and thumbs on the hands shown consistently across the decades by different artists portraying the expositions.?Can we say that the figures were naked before 1563 but with a loincloth afterwards? With the loincloth are the artists each painting their own loincloth or are they portraying the loincloth they can see on the Shroud.?”\nSo, Charles, if I read you well, your final answer is that you are no longer really sure if there was a loincloth painted on the Shroud in the 16th or 17th century. Neither are you sure if the marks on the Shroud were more vivid in the 15th and 16th centuries when compared to today. So, you are retracting most of what you wrote in your History Today article.\n\n","date":"October 28, 2014 at 2:17 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-166090","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"No, I am retracting nothing. I am simply saying that for completeness sake we should assemble a full data base. That is just standard research which, in the case of the Shroud ,has never been done and I am pleased to find that on the web, among the many reactions to my article, some of which have ,of course come to me personally, people are beginning to say this. So this is a positive outcome  of my article.\n  If we get a  full data base I think we will build up a great deal more evidence about how the Shroud looked when it was first painted. I think the evidence, on the depictions of Shroud expositions I have seen, will support me in the loin cloth but there  is still so much to be done. For instance, I found , in the British Museum print section, a depiction of an exposition I had never seen before and then when I asked the Royal Library in Turin for a particular depiction showing  Carlo Borromeo which they have they sent me a completely different one, which again I had never seen. So there is a lot of work to be done here, possibly for a Master’s dissertation or even a PhD.\nBut we come back to the first issue. What does it matter if there was a loincloth added or not? It is just an interesting part of th e Shroud!’s history that has nothing to do with whether it is authentic or not. Much more crUcial is the ‘all-over’ flagellation that Is so prominent on the Shroud but not known in medieval iconography before 1290-1300.and yet no one has raised this at all!\nWe need to date the Viverone depiction, which is an independent copy, of course, and not an actual depiction of an exposition. I think the the latter should take precedence for sh owing what people actually saw on the Shroud. The way the clergy are holding the Shroud is more typical of the later sixteenth  and seventeenth century but I am glad at this issue is being raised as it is typical of those what will make more sense when we have a full data base to make a comparative study.\n\n","date":"October 28, 2014 at 3:30 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-166109","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Regarding the posting made on “October 28, 2014 at 3:30 am” by Charles Freeman.\nCharles, with all respect, you are not writing with precision. \nYou wrote such a sentence as “Only when we have all the depictions can we begin to make a final assessment.” Notice that this sentence says “we”, then “begin” and then “make a final assessment”. That means that you have made no final assessment on the points you mentioned (e.g., loincloth, the Shroud lost paints so that the crow of thorns is no longer visible, and more).  Right or not? But, you did write, in your History Today article, definite statements about the disappearance, on the Shroud, of various images (e.g., loincloth). Right or not? \nPerhaps, what you are saying is that that you are suggesting these possibilities. But your article does not say that at all, it states that these are proven.\nYou wrote “What does it matter if there was a loincloth added or not?”\nI point out the loincloth because you mention it extensively in your article of an image that would have been painted over on the Shroud and then disappeared (erase or not intentionally). You made definite statements about these, but there is absolutely no proof of these statements. Do you understand that? No proof?\nThis repeated suggestion, I insist on “suggestion”, that major amount of paint (or gesso) disappeared from the Shroud is speculation. There is no physical proof of that. Simply look at high definition photos of the Shroud and the photomicrographs. You are aware that they are readily accessible on the web, see for example the following http://goo.gl/93Pp7t. You have many such photomicrographs available and none show any gesso or paint left. Then you have the simple observation that for 400 years there was a backing cloth for the Shroud (so that backing cloth was there during the last 4 centuries covering the period these images would have disappeared according to you), removed in 2002. Did we find any substantial amount of paint in the backing cloth? No. Therefore, any statement saying that major amount of paint disappear from the Shroud has to be explained. How did it happen?\nTake another example of statement without proof you made in your article (still related to the loincloth): “I have explained how Carlo Borromeo (and/or Francesco Lamberti) had insisted that the nakedness of the man on the Shroud should be painted over with a loincloth.”\nNote the word “insisted”. Did you prove that statement in your article? Did you reference any document proving this statement? I see no reference or proof in your article related to that statement.\nMy conclusion, is that you do not make a difference between suggested hypotheses and solid proof.\n\n","date":"October 28, 2014 at 12:18 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-166227","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"So what was the large amount of calcium carbonate found by STURP on the Shroud? Even today it is an essential component of the gesso used to seal cloth before you paint on it.\nMy belief is that once we have all the depictions together we will be able to find a lot more about the Shroud without even asking the Vatican to release it (although this would be best of all). I am resting my findings on the research I have done so far which shows that there are many features- the Crown of Thorns is an obvious example- that are clearly shown to be there on many of the depictions. The leaving of the Crown of Thorns on the body of Christ after he is taken down from the Cross appears in the late thirteenth / early fourteenth century, together with the over-all flagellation marks that result from the adoption of Isaiah 1.6.  as  a premonition of the flagellation. (This is not my idea but that of the top expert on Passion iconography , Professor James Marrow – let’s admit there are experts around who have better things to do than study the Shroud but whose work offers important information.)\nMy article, as you will see if you have the time to read it, builds up a lot of circumstantial and more than circumstantial evidence  to make a coherent argument for the weaving and painting of the Shroud in the first half of the fourteenth century and it was so vivid that people were overwhelmed by the power of images, especially the bloodstains, that have now  faded.\n\n","date":"October 28, 2014 at 12:57 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-166237","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles Freeman posting on October 28, 2014 at 12:57 pm: “So what was the large amount of calcium carbonate found by STURP on the Shroud? Even today it is an essential component of the gesso used to seal cloth before you paint on it.”\nLarge amount? What large amount? Micrograms you mean.\nAnd you have changed the subject by the way.\n\n","date":"October 28, 2014 at 8:32 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-166360","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Why have all those with scientific knowledge about the Shroud kept quiet? Is there any sign of scraping with a knife on the Shroud image?\n\n","date":"October 28, 2014 at 8:42 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-166361","author":"Louis","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"‘ large’ was the word used in the STURP  1982 paper for the calcium carbonate. I have not got it to hand but perhaps in a footnote they have attempted to quantify it – otherwise I agree that it does seem rather vague. But where are the tapes from 1978 to quantify it?\n\n","date":"October 29, 2014 at 4:03 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-166474","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles wrote: “‘ large’ was the word used in the STURP 1982 paper for the calcium carbonate. I have not got it to hand but perhaps in a footnote they have attempted to quantify it – otherwise I agree that it does seem rather vague. But where are the tapes from 1978 to quantify it?”\nI cannot see at all how you can reliably quantify trace amount of calcium carbonate for the entire Shroud by using the 1978 tapes. Can you explain how such quantification could be done?\nYour hypothesis that gesso was used on the Shroud is as mysterious as the entire Shroud story itself. It would take a miracle to have this gesso disappear without obvious visible traces on the Shroud. As you know, gesso is glue-like. It is used to fill the interstices between the threads. Also, a backing cloth was present without interruption for 400 years attached to the Shroud. It was removed in 2002 and no visible such material was found on the backing cloth, which should have received some of it if some add detached from the Shroud.\nCan you explain how all this gesso would leave no visible traces on the Shroud? Have you attempted of applying gesso on cloth, then try to remove it such that no visible (microscopic) traces is left? All of this without any traces on the back side of the cloth?  \nThe presence of traces of calcium carbonate on the Shroud has more obvious sources: water used to extinguished the fire that damaged the Shroud, or when it was washed during the fabrication of the cloth, or limestone present around the Shroud when it was in the tomb or even coming from the body itself.\n\n","date":"October 29, 2014 at 11:52 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-166578","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"You need to remember that the gesso layer is designed to be very thin so as to rest only on the outside of the fibrils( this is why STURP found the image was only on the very outside). Medieval gesso as found north of the Alps was a mixture of calcium carbonate and rabbit skin glue ( collagen) although different mixes were possible. Once the surface of the  Shroud came under pressure , the gesso would have fallen outwards not inwards.\nObviously I would like clarification of what STURP meant by ‘ large’ . It seems that there were significant amounts of calcium carbonate and when I am in my office I shall go back to the original report to see whether they have provided any further information beyond, as I recall ‘ accumulations of dust’\nYour  alternative explanations seem very speculative. It underestimates the very rough handling of the Shroud that is documented in the seventeenth century expositions when dust and limestone fragments would certainly have been shaken off while one would expect some elements of a glue gesso to still be sticking there.\nWhen I submitted all the so – called  blood reports I could find to a Professor of Physiology he read them and said he was totally unconvinced that this was blood but more indicative of collagen. So we have evidence,still to be confirmed, of the ingredients of gesso on the Shroud.\nAs you will know STURP specifically said that they had not examined any medieval linen paintings so they had nothing to go on. This was an extraordinary omission. If they had bothered to do some basic research on painted linens before they set out to Turin they would have been in a much stronger position to make credible claims about painting.\nAs you will see from my article and the podcast just issued by HT, I keep making the point that there is so much basic research on iconography and medieval linen paintings that has not yet been started. I am working hard to involve more specialists such as the professor mentIoned above. I don’ t know of any Shroudies with the relevant expertise in so many areas of research I am interested in.\n\n","date":"October 29, 2014 at 1:14 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-166602","author":"Charles Freeman","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles wrote:\n“Medieval gesso as found north of the Alps was a mixture of calcium carbonate and rabbit skin glue ( collagen) although different mixes were possible. Once the surface of the Shroud came under pressure , the gesso would have fallen outwards not inwards.”\nAbsolutely no collagen/protein (even at nanogram to picogram level) has been found on fibers from the background or from the image (highly sensitive fluorescamine test by Heller and Adler).\nNo collagen/protein binder=no gesso.\nThere are many possible explanations for calcium being more or less present in all parts of the Shroud. It is not an evidence for gesso or anything else.\nLack of collagen/protein IS an evidence against the gesso hypothesis. \nCharles wrote:\n” When I submitted all the so – called blood reports I could find to a Professor of Physiology he read them and said he was totally unconvinced that this was blood but more indicative of collagen.”\nI wonder what are these “so-called blood reports”.\nParticularly, I would like to know how a collagen-based paint could match the immunological tests performed on the blood? \nMore tomorrow.\n\n","date":"October 29, 2014 at 5:10 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-166678","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Charles,\nYou wrote:\n“You need to remember that the gesso layer is designed to be very thin so as to rest only on the outside of the fibrils( this is why STURP found the image was only on the very outside).”\nIt is useless to apply gesso if it is not sealing the cloth, that is, gesso must go down the interstices between the threads and covering them enough to avoid paint to seep through the cloth. It contradicts the notion that it can only covers the outer fibrils of the threads. Again, the fibrils between the threads are not even damaged or colored in most places when looking at the photomicrographs. Simply look at the photomicropraphs. You cannot ignored them.\n“Once the surface of the Shroud came under pressure , the gesso would have fallen outwards not inwards.”\nFor centuries, the Shroud was folded or rolled, so the image surface was inside the cloth. It was not kept flat for centuries. \n“As you will know STURP specifically said that they had not examined any medieval linen paintings so they had nothing to go on. This was an extraordinary omission. If they had bothered to do some basic research on painted linens before they set out to Turin they would have been in a much stronger position to make credible claims about painting.”\nThis is irrelevant: we have scientific data, photomicrographs, and more from STURP  and from other sources. This data cannot be ignored.\n“I am working hard to involve more specialists such as the professor mentIoned above. I don’ t know of any Shroudies with the relevant expertise in so many areas of research I am interested in.”\nI do not know which professor you are referring to. \nI wish you well, but it is clear to me that your hypothesis about gesso beeing used on the Shroud does not match the known data.\n\n","date":"October 30, 2014 at 12:48 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-166775","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Max Patrick Hamon, inviting other people, as usual, to do “home work before passing comment”, wrote:\n«I can read Modern French, Old French, a few Old French dialects, Classical Latin, Medieval Latin and Ecclesiastical Latin all right, what about you?»\n[…]\n«This is what I would call “bad faith” (in Latin FRAUDO)»\n[…]\n«Ecclesiastical Latin word fraudo means… »\n[…]\n«Don’t you read the Medieval Ecclesiastical Latin fraudo…»\n….. and after some minutes, when realizes that the word “fraudo” does not exist in Latin…\n« Note: FRAUDO (= MALFOY) as name derived from the verb FRAUDO and synonym of FRAUS, FRAUDIS »\nThis demonstrates again to me, as just happened before, that Max Patrick Hamon does not know Latin, be it classical, medieval or ecclesiastical.\n\n","date":"October 23, 2014 at 6:16 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-164983","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Mr Nicolotti, the Latin verb fraudo  DOES exist in Latin and could even be used as a substantive or even nickname for Malfoi/Malfoy = “Bad faith”!\nMethinks you also (DELIBERATEDLY?) missed my typo on October 23, 2014 at 8:14 am, I wrote:\n“More typo: Don’t you read the Medieval Ecclesiastical Latin fraudo/fraudis with your preconceived 21st c. CE mind, PLEASE!” There I give the Latin verb fraudo, “to mispresent”, “to mistate”+ its substantive fraudis, “misrepresentation”, “mistatemeent”.\nMr Nicolotti could you DO YOUROWN HOMEWORK (that is check your Latin dictionaries)  before passing comment and MISREPRESENT what I wrote de facto? Thank you.\n\n","date":"October 24, 2014 at 4:18 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165097","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hi Thibault; thanks for your references which effectively counter Charles’s hypothesis that the Shroud once had a loincloth painted on. It seems a little rude, but as Max never provides sources for any of his allegations, are you familiar with his “mural external fresco, cemetery church of Viverone in Piedmont, (phototograph by Massimo Centini)”, which he thinks is also pre-1560, or the “miniature from the Turin Royal Library” from mid 16th century?\nAnd Max, do you not feel that your arguments would be more compelling if you provided sources yourself? For instance, in the case of the Latin verb “fraudo,” I agree with you. However surely there is nothing in your previous post likely to have changed Andrea’s mind. Had you suggested, for example, http://www.perseus.tufts.edu/hopper/morph?l=fraudo&la=la#lexicon, (click on ‘Show Lexicon Entry’ for full details) then the matter would have been settled.\n\n","date":"October 24, 2014 at 4:43 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165101","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hugh, you wrote:\n“Max never provides sources for any of his allegations”.  \nMy sources are my own unpublished RESEARCH papers! I do assure you the iconographic documents DO EXIST, I saw them with my own eyes and they illustrat one of my papers yet the issue then was not wether the “Shroud itself” had or hadn’t a loincloth!\n\n","date":"October 24, 2014 at 5:54 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165117","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hugh; I don’t know why Max almost never provide his references and he have not any article published. I don’t know and I don’t mind. This is not my problem, but it is a problem when we intend to have a productive debate. In any case, he cannot use the lexicon you provide because fraudo has the same meaning that fraus, fraudis: to cheat, beguile, defraud, etc. I can provide other Medieval Latin Dictionaries in the same sense. Furthermore, omni fraude isa noun inablative without any doubt. There is not any reason to give up a primary meaning when it is so evidently fitting.\nFor the rest, see the  comment by Nicolotti infra.\n\n","date":"October 24, 2014 at 12:17 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165208","author":"David Mo","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Typo: a form in ablative\n\n","date":"October 24, 2014 at 12:20 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165210","author":"David Mo","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Typo; “Provides” ad “has” This is not my hour. I go to watch TV\n\n","date":"October 24, 2014 at 12:28 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165212","author":"David Mo","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Yes, quite right, of course. It wasn’t really in answer to Andrea that I mentioned the online dictionary, but to show Max that a single URL is worth more than pages of bluster.\n\n","date":"October 24, 2014 at 12:41 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165213","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hugh, this is a picture (not made by Centini) of the mural external fresco in the cemetery church of Viverone. I do not know if dates before or after the trasnfer of the Shroud in Turin (1578).","date":"October 25, 2014 at 8:42 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165444","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"That’s brilliant, Andrea, thank you. The absence of the 1532 scorch marks suggest that these loincloths are indeed pre-Tridentine, and constitute evidence that undermines Charles’s hypothesis about them.\nNow why couldn’t Max do that?\n\n","date":"October 25, 2014 at 8:52 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165446","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"If I well understand, Hugh, you believe that the fresco is older than 1534 because it has not the scorch marks. If it is so, the argument is inconclusive, because there are many paintings of the shroud AFTER the 1532 without the scorch marks, until XIX century.\n\n","date":"October 25, 2014 at 9:00 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165449","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Very true. It was just a suggestion. Perhaps the style of the bishops’ clothes could date it more accurately?\n\n","date":"October 25, 2014 at 9:03 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165450","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"No, the paraments did’nt change their shape in a significant way\n\n","date":"October 25, 2014 at 9:13 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165453","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hugh wrote: “Now why couldn’t Max do that?”\nI am not much time to currently spoon-feed you with iconographic evidence. Besides my research paper was written away on a PC and at the moment I’m typing on a Mac (I still have got a compatibility problem between Macs and PCs as far as my Powerpoint softwear is concerned.\n\n","date":"October 26, 2014 at 4:22 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165712","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Mr. Max Patrick Hamon,\nplease, do not make a fool of me. And I do not need to see dictionaries to solve such a simple question.\nYou wrote: «This is what I would call “bad faith” (in Latin FRAUDO)». No, “fraudo” is a verb (“to cheat”), and “bad faith” is a substantive (with adjective).\nYou wrote: «In Latin the substantive fraudis can mean “bad faith”, “deceit”, “fraud” etc, AND “misrepresentation”, “error”, “mistake”.». No, the substantive “fraudis” does not exist. “Fraudis” is a genitive of the substantive “fraus”.\nYou wrote: «Don’t you read the Medieval Ecclesiastical Latin fraudo/fraudis with your preconceived». No, “fraudo/fraudis” does not exist in Latin.\nYou wrote: «Mr Nicolotti, the Latin verb fraudo DOES exist in Latin and could even be used as a substantive». No, a verb is a verb and cannot be used as substantive. “Omni fraude cessante” = adjective + substantive + verb. Stop. No way.\nI taught Latin and Greek for many years, and I am able to see if someone knows or do not knows them. And this is not the first time you make grammatical errors. You are not obliged to know them: but please, before repeatedly saying “do your home work before passing comments”, look at yourself.\n\n","date":"October 24, 2014 at 11:38 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165201","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"EGGREGGIO signore Nicolotti (or shall I call you FRAUDO?), I just appreciate your “BAD FAITH” to its real value.\n[edited by Dan] Now you’re telling me it exists as a verb and I was wrong and you were right. [edited by Dan]\nThank you I DO know the word fraudis is genitive singular of fraus (noun) and fraudo is a verb. This no breaking news to me!\nNow you STILL persist and write “fraudo/fraudis” does not exist in Latin when I JUST COUPLED here the verb/ (and the genetive singular of the NOUN fraus,) fraudis just for sake of echoing with the word fraude (I love wordplays ON ETYMOLOGIES) for the maximum people to follow me without getting into all the technicality of Latin and keep what was the most relevant here. \nBesides shall I remind you I wrote in haste and in live, (I am even used to make typos) and such details are secondary as far as the main issues here were concerned? \nFRAUDO/fraudis, don’t you make TOO MUCH of a SLASH! \nRe the etymology of the English word fraud: It is recorded since 1345, from Old French fraude, from Latin fraus AND fraudis.\n\n","date":"October 24, 2014 at 12:19 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165209","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Egregio (not “egreggio”) Hamon, with your blabla you can make a fool of people who does not know the matter. With me you can not. The discussion for me is closed.\n\n","date":"October 24, 2014 at 1:46 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165226","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"[Comment content removed]\n\n","date":"October 25, 2014 at 3:35 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165364","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Max. This part of the discussion is over. No reply is necessary and no, you don’t get the last word.\n\n","date":"October 25, 2014 at 3:55 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165370","author":"Dan","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"….. and after some minutes, when realizes that the word “fraudo” does not exist in Latin…\nAccording to Google Translator it exists.\n\n","date":"October 24, 2014 at 5:44 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165113","author":"O.K.","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Hugh, you wrote:\n“Max never provides sources for any of his allegations”.\nMy sources are my own unpublished RESEARCH papers! I do assure you the iconographic documents DO EXIST, I saw them with my own eyes and they illustrat one of my papers yet the issue then was not wether the “Shroud itself” had or hadn’t a loincloth!\nSo why not publish them?\n\n","date":"October 24, 2014 at 6:33 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165124","author":"O.K.","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"OK, when I’ll get more time and be more at rest, I’ll publish them. Besides, Time may be the best of referee as far as research is concerned.\n\n","date":"October 24, 2014 at 6:44 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165126","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"You don’t need time, Max. Either email the pictures to Dan, if they’re online, or photograph them and then send them. We don’t need the entire opus.\n\n","date":"October 24, 2014 at 6:51 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165128","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"They are not on line…\n\n","date":"October 24, 2014 at 8:13 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165145","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"[Insulting Content Removed]\n\n","date":"October 25, 2014 at 5:45 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165396","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Max, that’s it. I need to pre-moderate your comments which is a pain for both of us.\n\n","date":"October 25, 2014 at 5:51 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165400","author":"Dan","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"dan, how long will you apply your double standard at my expense and promote untruths?\n\n","date":"October 26, 2014 at 4:46 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165721","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"This conversation is over.\n\n","date":"October 26, 2014 at 4:49 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165723","author":"Dan","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Moving forward from Charles’s idea that the Shroud could have started life as a prop in the Easter ‘Quem Quaeritis’ trope, it seems to me that before long this kind of re-enactment escaped from the Church and became the Mystery Play, produced all over Europe in increasingly elaborate style until the 16th century. The secularity of these plays seems to have been stimulated by Pope Innocent III’s edict against clergy acting on a public stage in 1210. For these, there were any number of props, from the mouth of Hell to the jaws of Jonah’s whale, and, for the passion, spears, crowns of thorns, tombs, shrouds, hammers, nails and pincers, to name but a few. I wonder where they all went? I wonder, too, what the zeitgeist was regarding the difference between sacred relics preserved in a church, taken out for exhibition on holy days, and secular props kept in cupboards, taken out for (dramatic) exhibition on holidays.\n\n","date":"October 27, 2014 at 5:45 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-165880","author":"Hugh Farey","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Reblogged this on Best of Shroud Story.\n\n","date":"November 4, 2014 at 10:39 am","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-168623","author":"Dan","site":"shroudstory"},{"title":"A Significant Article by Charles Freeman in History Today","post":"Viverone: I was there today. The fresco is completely disappeared\n\n","date":"January 31, 2015 at 1:15 pm","url":"https://shroudstory.com/2014/10/17/a-significant-article-by-charles-freeman-in-history-today/","cat":"paper_chase","id":"comment-187798","author":"Andrea Nicolotti","site":"shroudstory"}]
