[{"title":"Barrie Schwortz to Speak at 49th Annual Jalsa Salana UK Convention in Hampshire, England","post":"One wonders if it is worth it going to England. There is a way to cut the story short and go directly to the source, where it is possible to learn from Hindus (in India) and mainstream Muslims (In Pakistan and India) that Jesus is not buried in Kashmir:\n    https://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nIslam has a special eschatological role for Jesus to play at the end of time.\nJesus was also not buried in Talpiot:\n https://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nRecently, however, there have been attempts to link the James ossuary to the Talpiot tomb and thus authenticate it as the “Jesus family tomb”. The Israel Antiquites Authority dismissed the second part of the inscription as a forgery and returned the bone box to its owner. Some three months before this verdict, in 2003, Joe Marino ran this article on his email list:\nhttps://www.academia.edu/13960422/The_James_Ossuary_Much_Ado_About_Nothing\nWe are in the midst of so much evil, the Nazi holocaust being just one recent example, that a lot of rethinking is going on, even in the field of literature:\nhttps://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\nThing have gone even further, and the very concept of monotheism is being questioned. Other than all the literature contesting the NT accounts, we also have Jan Asmann’s “Moses the Egyptian” and studies questioning the origin of the Quran:\n http://www.nytimes.com/2002/03/02/arts/scholars-are-quietly-offering-new-theories-of-the-koran.html?pagewanted=2\nYears ago Arnold Toynbee expressed his doubts about the Bible (OT and NT) as revelation and today we have RD, who has posed an even bigger challenge.\n\n","date":"July 24, 2015 at 9:31 am","url":"https://shroudstory.com/2015/07/24/barrie-schwortz-to-speak-at-49th-annual-jalsa-salana-uk-convention-in-hampshire-england/","cat":"article","id":"comment-206460","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz to Speak at 49th Annual Jalsa Salana UK Convention in Hampshire, England","post":"Trying to post a comment.\n\n","date":"July 24, 2015 at 9:42 am","url":"https://shroudstory.com/2015/07/24/barrie-schwortz-to-speak-at-49th-annual-jalsa-salana-uk-convention-in-hampshire-england/","cat":"article","id":"comment-206462","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz to Speak at 49th Annual Jalsa Salana UK Convention in Hampshire, England","post":"It is sad to see that there is a lack of general knowledge when it comes to many issues, including religion. Which is what makes one wonder if it is worthwhile going to England. Why not go directly to the source (India, to learn from the Hindus as well as Muslims) and Pakistan (to hear what the Muslims have to say)? They will say that Jesus is not buried in Kashmir, and that is not only because Hindus in general also worship Jesus as “avatar” (incarnation of God with special powers) and there dozens of Hindu temples with sculptures or pictures of both Jesus and the Virgin Mary. Mainstream Islam also has an eschatological role for Jesus to play at the end of time.\nWhat proof is there that Jesus is not buried in Kashmir?\n   https://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nThe Muslim caretakers of the tomb say that Yuz Asaf was a Muslim and that the place just serves as a tourist attraction, but not because Jesus is really buried there.\nJesus was also not buried in Talpiot:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nRecently, however the theory that the James ossuary was taken from the Talpiot tomb was  proposed again. The Israel Antiquities Authority dismissed the second part of the inscription as a forgery and returned the bone box to the owner. Some three months before this verdict (2003) Joe Marino ran this aricle on his email list:\n https://www.academia.edu/13960422/The_James_Ossuary_Much_Ado_About_Nothing\nThe latest news we have is that the owner does not believe that the ossuary came from the Talpiot tomb.\nThere is so much evil in the world, the Nazi holocaust being just one example, that the topic has even reached literature:\nhttps://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\nEven the very concept of monotheism is being questioned, and the questions go much beyong Arnold Toynbee’s rejection of the Bible (both OT and NT) as revelation. Beyond the attacks on the NT, we now have Jan Assmann’s “Moses the Egyptian” and questions about the origin of the Quran:\nhttp://www.nytimes.com/2002/03/02/arts/scholars-are-quietly-offering-new-theories-of-the-koran.html?pagewanted=2\nBefore concentrating only on scripture, why not read the points RD has raised? Here is material to be tackled.\n\n","date":"July 24, 2015 at 10:13 am","url":"https://shroudstory.com/2015/07/24/barrie-schwortz-to-speak-at-49th-annual-jalsa-salana-uk-convention-in-hampshire-england/","cat":"article","id":"comment-206464","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz to Speak at 49th Annual Jalsa Salana UK Convention in Hampshire, England","post":"The religious idea of resurrection was already known in ancient Egypt.\nOsiris was the Resurrected Savior-God of life and of death.\n>…Osiris was the hope of everyman. His resurrection from the dead proved beyond doubt that there was life after death just as there was a new flood every year, a new heliacal rising of Soped, Sirius (the Greek Sothis), the brightest stationary star of Isis at the heel of the constellation Orion, symbolic of Osiris and bringer of the New Year and the new grain.\n>In the Old Kingdom, only the divine king was certain to survive physical death. He rose to the sky and sat together with his father Re in the latter’s golden bark, merging with Re as a god. …\n>…All human or divine miscreants capable of harming the resurrection of Osiris, had to be kept at a distance, and especially the followers of Seth, who never gave up trying to make incursions, or other malevolent intruders were kept at bay.\n>…identification with Osiris in the Duat & resurrection : in the Duat, the ecstatic king embraces the ritual “sah” (mummy), the second transformation of the “body” of Osiris, and undergoes the stages of the Osirian drama (culminating in his consumption of the Eye of Horus and his resurrection) …\nLinks:\nhttp://www.maat.sofiatopia.org/osiris.htm\nhttps://en.wikipedia.org/wiki/Osiris_myth\nSo…\nWhere are the differences with the Faith of Christianity?\nSee, for example:\n>The Egyptians personified Horus and Osiris as the sun, just as The Rg Veda personifies the spirit of the Soma plant, which also yielded a divine elixir, as a luminous, solar deity …\n>The Egyptians claimed that the Eye of Horus could confer immortality on those who consumed it, or an elixir made from it, just as the Rg Veda describes the Soma plant and its elixir as having the ability to confer immortality on those who consumed it …\netc., … etc. …\nLink:\nhttp://www.ambrosiasociety.org/osiris__horus.html\nThe Christian rite of Communion seems to be quite different …\nAm I wrong?\n\n","date":"July 25, 2015 at 9:46 am","url":"https://shroudstory.com/2015/07/24/barrie-schwortz-to-speak-at-49th-annual-jalsa-salana-uk-convention-in-hampshire-england/","cat":"article","id":"comment-206518","author":"piero","site":"shroudstory"},{"title":"Barrie Schwortz to Speak at 49th Annual Jalsa Salana UK Convention in Hampshire, England","post":"The idea of the annual resurrection of the god is very ancient, is pervasive throughout very many cultures, is tied in with the several fertility cults, was seen as essential for the crops and the sustenance of the peoples, their flocks and herds.  It tended to develop with the rise of the individual agricultural revolutions following the hunting and foraging periods of the several civilisations.  Probably one of the earliest alphabetic script of about 1400 BCE concerns an epic of the Phoenician god Baal-Hadad, a young virile god who dies in the autumn but is resurrected in the spring.  The cult had an attraction for the early agricultural Israelites, and was often condemned by the prophets, notably Ezekiel.  A feature of such fertility cults sometimes involved human sacrifice in order to fertilise the soil.  Following the return of the exiles, many of those who had married non-Jewish spouses were forbidden to return to Jerusalem and there was a strong Jewish settlement in Alexandria, eventually giving rise to the Greek Septuagint.  I have sometimes wondered whether their exposure to Egyptian funerary practices, together with the philosophy of Alexandrian Greek Platonism may have influenced the maturing development of resurrection theology from about 200 BCE.  This developing pattern seems evident in some of the later deutero-canonical works of the Septuagint.\n\n","date":"July 25, 2015 at 3:53 pm","url":"https://shroudstory.com/2015/07/24/barrie-schwortz-to-speak-at-49th-annual-jalsa-salana-uk-convention-in-hampshire-england/","cat":"article","id":"comment-206542","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz to Speak at 49th Annual Jalsa Salana UK Convention in Hampshire, England","post":"It is not difficult to detect the nonsense one sees in the realm of Shroud studies. This generation of “Shroudies” is largely responsible for no new hands on examination of the Shroud. No one expected Pope Francis to swing a thurible at the exposition, but he did not even kneel in front of it.\nWe will all be dead and gone by the time something gets done and since some people, including scientists, speak about survival after death in the context of the relic what they are left to think about is whether they will be resurrected, reincarnated or just turned to dust.\n\n","date":"July 25, 2015 at 4:52 pm","url":"https://shroudstory.com/2015/07/24/barrie-schwortz-to-speak-at-49th-annual-jalsa-salana-uk-convention-in-hampshire-england/","cat":"article","id":"comment-206548","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz to Speak at 49th Annual Jalsa Salana UK Convention in Hampshire, England","post":"I think one of the reasons for the nonsense is that the relic remains off-limits for further investigation.  Many are genuinely interested in the enigma of the image, but in the continuing absence of availability, speculation needs thrive.  It must be this, or it must be that.  \nWhat I wrote above, I suspect is all part of the deity’s plan in revealing himself by eventually taking on our humanity, and revealing himself through the person, crucifixion and resurrection of his Son.\n\n","date":"July 25, 2015 at 9:40 pm","url":"https://shroudstory.com/2015/07/24/barrie-schwortz-to-speak-at-49th-annual-jalsa-salana-uk-convention-in-hampshire-england/","cat":"article","id":"comment-206564","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Barrie Schwortz to Speak at 49th Annual Jalsa Salana UK Convention in Hampshire, England","post":"Correct to an extent because the nonsense had begun before the relic became off limits, with the result that serious scholars and scientists also paid the price for the rubbish that others had published and the clashes occurred in newsletters and websites.\nThe Son had his own views about God, Moses and Scripture. Biblical scholars and theologians are slowly beginning to chance their approach because they have to. That way they can also grasp what Jesus really meant and contribute to a more convincing systematic theology.\n\n","date":"July 26, 2015 at 4:41 pm","url":"https://shroudstory.com/2015/07/24/barrie-schwortz-to-speak-at-49th-annual-jalsa-salana-uk-convention-in-hampshire-england/","cat":"article","id":"comment-206616","author":"Louis","site":"shroudstory"}]
