[{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Nice to read now Colin is no longer literally referring to a/his ‘scorch theory’ but ‘a near-scorch theory’ or ‘mordanting theory’, which BTW is mine from 1994!\nOn February 16, 2013 at 12:50 pm, I wrote:\n“NATURAL CLOTH-TO-CORPSE ARCHAEOLOGICAL THERMAL CHEMICAL PRINTING”\n“Reminder for Colin Berry et al:\nArchaeo(crypto)logically speaking, in the most likely hypothesis the TSM is Yeshu’a, a natural cloth-to-corpse thermal chemical imprinting should account in turn for a high resolution superficial body image, undisturbed bloodstains and a two thousand years’ old degraded blood still looking fresh on the cloth. To trigger up such an accidental/providential image formation process, it requires:\n1/pre-mordanting conditions (i.e. burial linen cloth in-soaked with aqueous alkaline solution such as the Red Heifer waters and/or Jerusalem limestone/Malky dust mixed with waters + ammonia present in urea residues)\n2/auto-collimation (body covered with “opaques” present in the Judean desert and/or Jerusalem limestone/Malakystone dust + long inner burial linen cloth first tautly wrapped lengthwise and then compressed widthwise around body + next to skin-to-cloth contact followed by gradual loss of next to skin-to-cloth contact through burial inner sheet shrinkage and relative loosening as it gets sort of taut again front and back and gradually unstuck from deceased’s body the latter resting in extra height and being laid first on its left side and then right side while drying out \n3/heating source such as corpse in hyperthermia and/or fumigation as a purifying and drying-out ritual.\n4/ low temperature alkali gelatinisation of starch residuals present in ancient linen cloth is also a possible factor as printing paste to be taken into account in the Shroud image formation process.\nNaturally pre-mordanted linen once naturally mordanted, the mordanting looks like a very light\nscorch or “pre-scorch.”\n\n","date":"November 4, 2014 at 10:48 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168626","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"But Max it would seem that this reaction you theorize would have happened to more Second Temple burial shrouds than just Yeshua’s. Why is this phenomenon not seen elsewhere? And why can’t we replicate it with modern methods – which seem available to be tested with.\n\n","date":"November 4, 2014 at 1:54 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168665","author":"David Goulet","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Not at all. Yeshua’s  return to life/resurrection and his shed innocent blood make all the difference here.\n\n","date":"November 4, 2014 at 5:52 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168711","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I went as far as thought experiment allowed me to go. Methinks it can be replicated. Methinks alkali-water solution vapor/fumigation in conjunction with linen textile substrate can reveal bodyprint all right (in the no-air-gaps areas)\n\n","date":"November 4, 2014 at 5:57 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168713","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Speaking of “terrific comments”, Stephen E. Jones now claims that Satan is using those who post comments on shroudstory.com  to silence him. Well I go on shroudstory.com website daily and don’t have the impression that there’s possessed souls haunting it !\n\n","date":"November 4, 2014 at 11:05 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168628","author":"PHPL","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I’d like to question an assumption both Colin and Charles have, and that is that the TS image was darker/clearer originally than it is today. If the ‘invisible ink’ properties were in play (naturally rather than man-made) then it’s quite possible the TS image was originally much less dark/clear than it is now. It could have gone, however, from ‘invisible’ to dark to faded over time as well. Food for thought.\n\n","date":"November 4, 2014 at 1:31 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168655","author":"David Goulet","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"The sort of time-course you suggest, David, is one that which has been described as ‘naturalistic’. \nAs you know, it was advocated first by Rogers, but has now been further developed by Fazio and Mandaglio (with a cheerleader among the commentators on this site!) . \nIt envisages an initial fast priming reaction of some kind that creates a latent image that is not initially visible, which then develops colour slowly over a long period (variously estimated to be months, years or even longer), \nIt’s a pro-authenticity position needless to say, one that seems keen to be rooted in conventional physics and chemistry  distancing itself from any mechanism that relies on ‘magical’ radiation.\nBut there’s a problem. While superficially more ‘scientific’, it does not lend itself to experimental testing, given the indefinite time scales and obscure undefined reaction.pathways.\nSo is it really more scientific, or merely a hypothesis that is marginally (and arguably) less unscientific?\nIs slow, sluggish chemistry with irritating latency and pacing-up-and-down-waiting-for-something-to-happen  much of an advance on fast physics? I’m relieved to say it’s their problem, not mine…  ;-)\n\n","date":"November 4, 2014 at 2:00 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168667","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I don’t think we can mix things up this way.\nRogers had an hypothesis the basis on which he has suggested contrast would have appeared progressively.\nFazio et al. worked upside down, leading to a fuzzy, arbitrary claim:\n“For us, on the Shroud, there are latent body images\n(ventral and dorsal), yielded by the action of a stochastic process that is triggered by a little quantity of energy, without threshold to appear, with effects that have a time of latency of the order of many years”\nThis is science versus pseudo science. But we’ve already commented their article.\n\n","date":"November 4, 2014 at 4:09 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168696","author":"anoxie","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Just as well that the value of my article is not being decided here but instead within the academic community of people who actually work with medieval artefacts and liturgy!  in fact I got an e-mail this morning from a Catholic specialist saying thank goodness we have moved on from the sterile ‘is authentic or not?’ to actually looking at  the Shroud within a medieval context.\nI am not at liberty to disclose private e-mails I have had but it looks as if my article is going down well with those who know and whose credentials I respect. No doubt I will be able to,publicise some of these in the next couple of months. I t seems that I will eventually bypass Shroud Story and leave you all in peace.\n\n","date":"November 4, 2014 at 1:48 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168661","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"As vexing as Shroudstory can be, for all sides, it is currently the best site for rigorous debate on the various Shroud topics. Take a break, but do come back and bring your friends and their credentials with them.\n\n","date":"November 4, 2014 at 1:57 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168666","author":"David Goulet","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Can we get a thread to discuss the flagellation tangeant that is building parallel to the main discussion?\n\n","date":"November 4, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168663","author":"Eric","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"A few years ago I did a presentation for the American Chemical society called “The Battle of the Chemists.”  In it I compared McCrone’s findings and his methodology with the findings of Dr’s Alan Adler and John Heller using the same instruments (SEM) but with a different and more thorough methodology and consequently found something quite different.  \nNow it appears we have the battle of the historians.  Enter Thomas de Wesselow, Postdoctoral Research Associate at Cambridge University, studied art history at Edinburgh University and was a research scholar at the British School in Rome—seems to have all the academic credentials one would need to have a legitimate dog in the fight. \nHere is the take away quote from his book, The Sign (2012):  “Accepting the carbon-date (as true), art historians should have leaped on the Shroud as on of the most fascinating visual creations of the medieval period, a true masterpiece of devotional imagery.  Strangely though, they have remained almost entirely silent. The reason is simple: the negative photo of the cloth is an unmistakable sign that the Shroud’s famous image could not have been created by a medieval artist. Technically, conceptually and stylistically the Shroud makes no sense as a medieval artwork. The field of art history has had over a century to study the Shroud since it was first photographed.  And in all that time no art historian has ever ventured to attribute it to a medieval artist.”  End quote.\nSo I guess kudos are in order for Charles Freeman in that he has gone where no art historian has yet to venture–however he has yet to address de Wesselow’s key assertion that “technically, conceptually, and stylistically the Shroud makes no sense as a medieval artwork.”  As a personal comment, It does seem rather bizarre that the Shroud is a perfect negative which means the reverse positive image we see through photography would have been a complete accident–totally unknown to the alleged artist who crafted the image.  That seems to stretch credulity to the breaking point.\n\n","date":"November 4, 2014 at 3:47 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168693","author":"Russ Breault","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Well said, Russ. My feelings precisely, especially re that tone-inverted image. No one PAINTS a tone-inverted image, incorporating all the right gradients of image-intensity to ensure not only the sudden appearance of a gobsmackingly modern-looking photograph  600 years later  but also an exceptional 3D response yet another 80 years later when uploaded to late 20th century computer software. \nCharles has failed to address the ICONIC nature of the TS. He’s focused too much on the blood – and neglected the body image.\n\n","date":"November 4, 2014 at 4:27 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168700","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I’m sorry Colin, but the “exceptional 3D response” is a sindonistic myth. (Also the “negative image”).\nFirst: because the “exceptional 3D response” only results whenit is done by sindonists. Other not sindonists works get 3D images of the Shroud, but not “exceptional” at all. For example, the face profile is flat and the moustache stands largely out of the nose (Perhaps the Man of the Shroud was a Nietzschean!)\nSecond: A regular artist can obtain a similar or better 3D effect with simple technics. I am not precisely a great draftsman but in 5’ with a pencil and a finger I have done my contribution to the sindonist theory of “exceptional 3D” by heart. La voilà!\n\nI am sure that a true artist can modulate the image much better than I did only with a softer pencil and a blending stump. This is a question of technic and ability. \nIf these are your reasons to reject the pictorial hypothesis they seem too weak to me.\n\n","date":"November 5, 2014 at 4:18 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168815","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David. No matter you can imitate (roughly) the negative image of the Shroud face (imitating also roughly its 3D properties), as it obviously doesn’t look like a face of a real man -and has no such photographic quality. Those primitive tricks doesn’t work here. Besides the traces of the pencil moves are obvious here -contrary to the Shroud, which has no directional characteristics in the FFT spectrum. No traces of human hand actvity. I will return to this topic later.\n\n","date":"November 5, 2014 at 5:23 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168835","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Here is 3D plot of your clownish pencil drawing compared with the plot of the Shroud face. The settings are the same.Complete failure, David Mo!\n\n","date":"November 5, 2014 at 5:37 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168839","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David Mo’s quick sketch works very well from both the negative and the 3D point of view (on imageJ, for example). It does look like the face of a real man, but obviously, the pencil lines show that it is not a photograph. I’ve no doubt, though, that a proper artist, with a smudge or dabbing technique, who took maybe ten minutes instead of five, could improve on it immensely.\nHowever, David is too well acquainted with the Shroud not to let his work be in some ways simply a copy of it, rather than, as presumaby the original imager did, having to work entirely from observation or imagination of a body covered with a sheet. I do not know if there is anybody in the world sufficiently unfamilar with the shroud, but sufficiently skilled in imagery, to be set the test of imagining what might happen if something were covered with a sheet, and left an image whose intensity was related either to cloth/body distance (the radiation/gas emission hypothesis) or to cloth/body pressure (the contact hypothesis). Such a task need not even involve a human body; a bunch of flowers or a teapot would do just as well for the experiment!\n\n","date":"November 5, 2014 at 5:41 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168841","author":"Hugh Farey","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Sorry DavidM, but it IS an exceptional response, and NOT a  “sindonistic” myth. But note I said “exceptional”, not “unique”. It may seem at first glance like splitting hairs, but one has to consider not only the response to 3D imaging, but the nature of what one is uploading to that software – bold/high contrast/high colour saturation images on the one hand versus the scarcely visible  “as is” TS image.\nI’m preoccupied with another science project at the moment, prompted by a news item this morning and non-TS related, so will have to keep this brief.\nIf you take, say, Irene Corgiat’s passable pyrograph copy of the TS and put it into ImageJ you get very little 3D response. If you make a bold charcoal copy like yours, the 3D response is better. If you take a contact scorch off a bas relief etc it’s better still, comparable if not better than the TS.  I for one have never agreed with those who were saying back in 1980 that the 3D response of the TS was unique and unobtainable with modern photographs or drawings etc.\nBut I still say it’s exceptional. Why is that? Answer: because you can start with a photograph of the TS, like that I talked about recently on the BBC’s site (Halta Defiizione image), one that is scarcely visible against background (realistic!) and without any further adjustment of contrast, brightness etc upload it to ImageJ and get a very reasonable response.\nI’ve just this minute done that exercise. Here’s the result:\n\nWhat price the idea that the TS image is all that’s left of a painting from which ALL detectable pigment has flaked off?\nAs I said earlier, that idea is a total NON-STARTER, one that places the TS outside the remit of conventional art history and art historians.\n\n","date":"November 5, 2014 at 5:54 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168849","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Sorry, I missed OK’s pictures while writing the above. Firstly, I don’t think a fair comparison can be made between the two faces by keeping the settings the same, especially if the settings chosen favour the Shroud. It would be necesssary to show the two pictures again, both set to the most favourable to David Mo’s picture, to complete the comparison.\nSecondly, I don’t think either of OK’s images are at all satisfactory as representations of a human face. While they are unrealistic in different ways, I think they are both ‘complete failures’ from that point of view.\n\n","date":"November 5, 2014 at 6:56 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168876","author":"Hugh Farey","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“Technically, conceptually, and stylistically the Shroud makes no sense as a medieval artwork.”\nBig mistake. The Shroud is not a “medieval artwork” in the usual sense of a portrait or a pictorial scene. The Shroud is the image of the trace of a corpse on a sheet as imagined by a medieval artist. As other medieval shrouds have been disappeared, we have not the possibility to make a comparative study. We can say it is different from other Holy Faces we know, Manoppello included, that are simple portraits. But we make a big mistake if, as Wessellow does, we compare it with the usual medieval art. \nPS: I be grateful if someone explains me what are the stylistic features of the Shroud that  do not correspond to the Gothic style. We can say the schools of Firenze or Siena, for example. Or the Franc-Flemish style, if you like. I see many coincidences. And M. Vignon et al. found a lot with the byzantine art. What now then?\n\n","date":"November 5, 2014 at 3:43 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168806","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Are you an art historian?\nI think de wesselow is very qualified to make that judgement.\n\n","date":"November 5, 2014 at 3:58 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168811","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"But de Wesselow did not look at the original depictions of the expositions. He discredited himself as a serious scholar with his Resurrection Shroud scenario which was stupid of him, as he blew his other credentials when he did not need to. I am amazed that he turned his back on conventional art history by not saying ‘ what did this cloth look like seven hundred years ago?’ That is and always should be the first question to ask and lots of people are happy that I am asking it.\nI am in Lucca, looking at the relic cults in the churches there. There is nothing like immersing yourself in the medieval world to get the vibes of the cults.\nWhy is David Mo.s comments not  up there among the ‘terrific’ ones- it is just as valid as the others- to my mind he is asking the right questions, questions that should have been asked years ago.\n\n","date":"November 5, 2014 at 4:34 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168817","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Charles\nWhat did the Shroud look like 700 years ago?\nMuch like today!\nRefer several depictions from the 1500s that clearly show the image was “ghostly” and ephemeral even then.\nThis is indisputable\n\n","date":"November 5, 2014 at 4:38 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168819","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"refer for example (there are more) to the 1516 and 1568 copies.\nhttp://greatshroudofturinfaq.com/History/Western-European/manycopies.html\nI challenge you to argue that these are not trying to depict the faint nature of the Shroud image\n\n","date":"November 5, 2014 at 4:42 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168822","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"If the shroud is a painting why is the side wound in the totally atypical left hand side?????\n\n","date":"November 5, 2014 at 4:47 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168823","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David: “but some deformations imply an ulterior retouch”. This is just what Garlaschelli has done. He has used a real body for the general proportions and has completed the details with retouching by free hand. However some alteration in the proportions may be due to the draping of the cloth and to any slight shifts of the cloth while working. Once I tried (or let somebody try) the execution of the hands by rubbing over the real hands (of a subject with long fingers) and the result was ratehr good even without retouching.\n“… the legs are extended but this is incompatible with the mark of the sole”. Put a man prone (lying face-down) on a bed with the feet extended and one over the other. The cloth can follow any curves of the legs so that it might produce a contact, if any, everywhere along them. The cloth envelops the exposed sole, which is face-up, and the resulting imprint is similar to the Shroud’s. I once tried also with the real feet.\n\n","date":"November 5, 2014 at 7:52 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168891","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Gian Marco: “the result was rather good even without retouching”. I am sorry but I am more incredulous than Saint Thomas. I would like to see how much the result is “rather good”, particularly the index finger longer than annular. I don’t think those effects might be produced by deformations of the cloth because these deformations would had also  produced wrinkles in the cloth. Retouching is the most simpler hypothesis. Perhaps Garlaschelli may explain us how he got this effect.\nI wasn’t thinking that the body has been turned around. I was imagining the resurrection scene. But your answer to the problem of the sole seems convincing. It is obviously contradictory with the resurrection framework.\n\n","date":"November 6, 2014 at 4:12 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169143","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David: “Perhaps Garlaschelli may explain us how he got this effect.” As I said, Garlaschelli did retouch. From his report in JIST (July-August 2010):\n“The image obtained can then be completed freehand and improved in a few spots by adding some more pigment, after removing the cloth from the volunteer’s body. This procedure also allows one to rub the pigment more evenly and more easily than when the cloth is resting over a 3D human body. In particular, the “covered,” partially visible hand is a difficult feature to reproduce by rubbing, possibly because the stiff fabric cannot adequately conform to the sharp relief of this spot. Therefore, we completed the prints of the fingers by painting them subsequently with ochre and a small brush. If the mediaeval artist, too, had this problem and solved it in our same way, this would finally explain why the fingers look so puzzlingly unnatural and anatomically unconvincing.”\n\n","date":"November 6, 2014 at 5:15 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169158","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“Therefore, we completed the prints of the fingers by painting them subsequently with ochre and a small brush.”\nAha. I supposed this.\n\n","date":"November 6, 2014 at 5:23 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169170","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David: “The Shroud is not a “medieval artwork” in the usual sense of a portrait or a pictorial scene.” I agree. Indeed I have little doubt that the figure was produced, for the face, with a rubbing method on a basrelief as first proposed time ago by Joe Nickell. For the body, at least partially a similar method was used but with the aid of a real human body, not a basrelief, as recently performed by Luigi Garlaschelli. Therefore it is not even necessary to think that a painter or an artist had a role in the work (a basrelif of a face could easily be found already completed). The “blood” could have been added by anybody, even lacking an artist hand. Any stylistical considerations can only be applied to the sculpture of the face that was used for the rubbing, as far as we can now imagine its appearance. For the rest of the body, apart from the face, there is no artistic style. For example, an artist should have put the long hair also on the dorsal image, where we see only what may well be the imprint of a real human head. Also the feet have no correspondence with any representation ever made by an artist, but can be obtained from the feet of a real body.\n\n","date":"November 5, 2014 at 4:36 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168818","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Indeed I have little doubt that the figure was produced, for the face, with a rubbing method on a basrelief as first proposed time ago by Joe Nickell. For the body, at least partially a similar method was used but with the aid of a real human body, not a basrelief, as recently performed by Luigi Garlaschelli.\nGian Marco:\nDo you REALLY believe the Shroud was made with the use of Garlaschelli’s method, after it has been completely devastated by Thibault Heimburger and Giulio Fanti ( http://www.acheiropoietos.info/proceedings/HeimburgerWeb.pdf )? You DO???\n\n","date":"November 5, 2014 at 5:13 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168829","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Gian Marco: Perhaps a real body was used for the image, but some deformations imply an ulterior retouch because they are not natural. For example:  there are not nipples, the index finger is longer than annular finger, the legs are extended but this is  incompatible with the mark of the sole, the fingers and the arms are abnormally long, etc. Some of these features are typical of the late gothic painting and Trecento as the disproportionate index finger (see the madonne and child of Duccio, Cimabue, etc. Also the byzantine tradition: http://www.fordham.edu/halsall/ikon/top-bvm.gif .\n\n","date":"November 5, 2014 at 6:35 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168869","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"One complaint that Charles has mentioned from time to time is that there was no expert in the history of art on the STURP team, nor incidentally of textiles.  A frequent like complaint against his article expressed by several on this web-site, including authenticity sceptic Colin, is that it is utterly unsupported by any scientific evidence, and in the opinion of many is actually contradicted by such scientific evidence as there is.  Touche! \nOf particular value in the ongoing debate in my view is the several fascinating related art works that have come to light as a result, which many of us were utterly unaware of.  The existence of these works is a significant phenomenon, but it is in the interpretation of their significance which remains elusive.  Which influenced what?  Charles’ advocates seem to be taking the position that the Shroud falls within the genre.  Contrariwise, his opponents might tend to take the position that it was the revelation of the authentic burial cloth of Christ that produced and influenced the genre and the consequential art works. \nOne significant criticism I think is that the article is highly speculative, relying as it does on the ‘flaky paint’ idea which remains utterly unsubstantiated, and cannot explain the particular properties of the image.  Whether the approach would satisfy the “historical critical” method mentioned by Andrea Nicoletti from time to time is a matter I am not qualified to comment, but I would say that it does not seem to be particularly evident here. \nCharles has mentioned that he has been in contact with various experts concerning his thesis and has claimed to have won some support.  I would guess that they are of a like mind to his own, no doubt art experts in their various field, and unsympathetic to any pro-authenticity argument.  I would wonder how well they understand what work has been achieved in the scientific investigations of the Shroud, how little they might actually know about it, and if any of them have anything resembling a scientific qualification of any kind. \nThe whole business underscores the necessity of a multi-disciplinary approach in evaluating the object.  Specialists locked in their own little world by themselves may be able to shed some light on singular aspects of the Shroud, but left to themselves will not give the answers that many of us crave and seek concerning this fascinating topic.  Whether it is a matter of textiles, artistic significance, historic documentation, the cloth’s origins, how the image may have been produced, its properties, corroborating evidence, forensics, botany, chemistry or physics, burial rites, significant contaminations, liturgical significance, there is plenty here that needs be considered.  Only a holistic approach to the problem is likely to produce a satisfying answer.  Each must consider how work by others in related and unrelated fields must be weighed against one’s own endeavours.  This too often seems to be sadly lacking, with the inevitable result that it takes us all into blind alleys!\n\n","date":"November 4, 2014 at 4:15 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168698","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I agree , multi-disciplinary approach is the way to go. So I have the following disciplines to offer from my articles, iconography of the fourteenth century, blood  cults of the fourteenth century, weaving techniques e.g the treadle loom as the  most likely loom for the Shroud, background history to relic cults in the medieval period, medieval liturgies and ceremonies – in addition I have consulted Mike Spyer a professor of physiology, on the blood stains and, from the STURP articles he cannot see how the STURP team could say that they had found human blood.He took the conventional view, that all forensic scientists I have consulted have taken, that the blood stains are too red to be real blood. Heller or Adler’s hypothesis of stress and bright red blood has never been replicated or taken seriously by anyone other than Barrie Schwortz. Can you imagine how different criminal trials with bloodstain evidence would be if it were true?\nI did do an earlier post from my IPhone that I asked people to read in my article the observations of the fifteenth and sixteenth century of the blood stains ( please don’t comment back if you have not read and absorbed them- I am entitled to be judged on what I have actually written) and then defend the view that the Shroud looked then as it does now. Why did one observer described the  stains as ‘admirably painted’ (not the D’Arcis memorandum- another source) and another describes the bloodstains as so bright that it was if they were recent. I am taking this as primary evidence that the Shroud looked very differently to these observers in that they could not possibly be describing the bloodstains as we see them today. So once you accept that the Shroud did look differently, the search is on to reconstruct as far as possible how it did actually look and work from there. This is conventional art history and I am not sure how de Wesselow missed out on his training here.\nNews from one of my numerous contacts in the publishing world is that de Wesselow has a new book on the Shroud on the way – so perhaps he will elaborate on his inadequate dismissal of the ‘ this is not a painting ‘ there.  ( The person concerned acted totally correctly in not letting me see the proposal- perhaps just as well that I was not asked to be one of the peer reviewers!)\n\n","date":"November 5, 2014 at 10:12 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168934","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"P.S . Might I add that if I had been asked to peer review de Wesselow’s new book, I would have said no, even though I would have remained anonymous. He is entitled to have it looked at by peers who have had nothing to do with him and his ideas before. (That is the ideal, of course!) Each book is a fresh start and presumably he has something new to say or he would not be putting in a new proposal. So we shall see what emerges.\n\n","date":"November 5, 2014 at 11:15 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168951","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"HT article: ” One of the first independent descriptions of the Shroud comes from 1449, when a Benedictine monk at the abbey of Saint-Jacques in Liège, who saw the Shroud at one of Margaret’s expositions, reported that it was miro artificio depicta (‘admirably painted’), with the wounds on the side, hands and feet as bloody as if they had been recent. ”\nMr Freeman, please, the name of this monk?\n\n","date":"November 6, 2014 at 6:39 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169192","author":"domics","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Yes. As we all know, the Shroud is highly complex in many ways. Hence the likelihood that any expert in a particular field comes in afresh and does not understand the various complexities.\nTheir opinion may make sense in isolation, but when married up against other evidence from other disciplines it falls away\n\n","date":"November 5, 2014 at 2:11 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168790","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I think one argument in favour of the faintness of the image being there from the start is in the fact that all the copies and pictures of expositions are not only innacurate, but that all their inaccuracies are different, in terms of crown of thorns, blood, position of wrists, feet and so on.  It’s difficult to tell which of the illustrations are eye-witness copies, and which are copies of copies (in which case the inaccuracies could be accurately preserved) but some of them were presumably made by people who sketched the image in front of them, or from sketches made by people who were looking at it as they sketched. It seems that, even with the shroud freshly before them, nobody could quite remember what they saw, something which would be more understandable if the image were barely detectable anyway.\nSome of the grosser inaccuracies, like how many priests it took to hold the Shroud up, or whether there was one image or two, or even whether to include the burn holes, or a loincloth, might be attributed to sylistic licence, but some details such as whether the feet were crossed or not seem simply a matter of not really being able to see.\n\n","date":"November 5, 2014 at 5:24 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168836","author":"Hugh Farey","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Hugh, there is almost zero doubt that the image was always faint.\nFreeman is obstinate and always seems to ignore this point of mine.\nIt is actually quite pathetic.\n\n","date":"November 5, 2014 at 5:41 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168840","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Forgive me, Thomas, if you have already explained all this, but I don’t think it’s enough simply to claim that there is zero doubt, which is perhaps why Freeman did not contradict your claim. You have to explain why there is zero doubt. The fact that the Shroud is faded and a copy of it is not can be explained in several ways, one of which is that the Shroud was once clearer (Freeman), and another is that the copyist wanted to show it clearer than it was (Thomas). To distinguish between these two hypotheses, further evidence must be adduced. I think the suggestions I made above contribute to your hypothesis and challenge his.\n\n","date":"November 5, 2014 at 5:50 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168846","author":"Hugh Farey","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Please read  the original descriptions of the impact of the blood on fifteenth and sixteenth century observers in my article and then defend your view that the Shroud is unchanged from 1449.\n\n","date":"November 5, 2014 at 7:20 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168883","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Secondly, I don’t think either of OK’s images are at all satisfactory as representations of a human face. While they are unrealistic in different ways, I think they are both ‘complete failures’ from that point of view.\nHugh, during my studies on the Shroud I have never seen a reproduction of Shroud face that looked realistically. All of them were obviously artificial, and suitable at most to scary kids. Contrary, the Shroud face looks realistic -watching it you have (I think correct) impression you look at the real human face. Of course, in the 3D view it can be distorted in many ways, as 3D representation of the Shroud man is not the 100 % accurate representation of the 3D form that was once within the Shroud. To avoid misunderstanding, there are two things important here. First, the fact that the 3rd dimension (Z axis ) is referenced not to some arbitrary plane parallel tothe XY axis, but to the surface of the Shroud, which (although being flat surface as well) wrapped somehow the body. For the second: scale factor place important role here. As it is a little bit arbitrary, the Z axis will be usually rescaled compared to objective XY scale -which adds additional visual distortions.\nIt needs a little bit practice to accurately perceive the 3D representations of the body of Shroud Man -and then to compare it with artificial copies. However, gaining a little bit of experience, you know that the Shroud is quite unique in this characteristic, as it reflects the shape of the body wrapped in the Shroud very faithully.\n\n","date":"November 5, 2014 at 7:36 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168885","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“However, gaining a little bit of experience, you know that the Shroud is quite unique in this characteristic, as it reflects the shape of the body wrapped in the Shroud very faithfully.” \nTrouble is, O.K. one doesn’t know what the shape was – that being dependent on one’s modelling assumptions re the geometry of linen relative to subject or other preconceptions.\nI once did a posting where I  “normalized” against a contact-scorch model. In other words, I adjusted the controls on ImageJ to get the closest match with an actual 3D template (a bas-relief horse brass) and then applied the same settings to the Shroud Scope image. \nResult:\nhttp://strawshredder.files.wordpress.com/2012/03/x11-cropped-final-x2.png?w=410&h=462\nThough I say it myself, it’s arguably one of the more life-like 3D-enhanced images that one can find on the internet (second only to the host’s – but I suspect he had help from his grandchildren, giving him an unfair advantage).\nhttps://shroudstory.com/2011/12/22/do-your-own-vp8-like-3d-images-of-the-shroud-of-turin/\nBack now to the latest crazy meme to hit the web – that coeliac disease (gluten intolerance) is an autoimmune disease. It even says so in wiki so has to be true (!). Does it heck. Any views, Kelly Kearse? I’d say it was exacerbated by auto-immune over-reaction, but then so is HIV/AIDS. That doesn’t exonerate the virus.\n\n","date":"November 5, 2014 at 8:00 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168894","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Collin: \nTrouble is, O.K. one doesn’t know what the shape was – that being dependent on one’s modelling assumptions re the geometry of linen relative to subject or other preconceptions.\nOf course it involves a little bit guessing -so the answer cannot be totally unequivocal -but with a little bit of common sense and reasonable constraints you can get the response fairly close to the reality.\nResult:\nhttp://strawshredder.files.wordpress.com/2012/03/x11-cropped-final-x2.png?w=410&h=462\nI think you have used too much smoothing Collin -thus much distorting the image, which then starts resembling gaussian bell. This is NOT what we want to obtain.\nThough I say it myself, it’s arguably one of the more life-like 3D-enhanced images that one can find on the internet (second only to the host’s – but I suspect he had help from his grandchildren, giving him an unfair advantage).\nhttps://shroudstory.com/2011/12/22/do-your-own-vp8-like-3d-images-of-the-shroud-of-turin/ \nSorry, I don’t want to be modest here -but although I think Dan’s is good, mine is much better: ","date":"November 5, 2014 at 8:10 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168900","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“.. mine is much better: ”\nOnly if you think the events described in the NT that proto-Easter weekend were the equivalent of going a full 12 rounds in the ring against Muhammad Ali…\n\n","date":"November 5, 2014 at 8:23 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168901","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David Mo:\nPerhaps a real body was used for the image, but some deformations imply an ulterior retouch because they are not natural. For example: there are not nipples, the index finger is longer than annular finger, the legs are extended but this is incompatible with the mark of the sole, the fingers and the arms are abnormally long, etc.\nIt is an old false melody of the sceptics, that the Shroud image has some “unnatural” deformations: thus the Shroud must be false. But this melody shows only lack of imagination and bad will of the sceptics. All those claims about unnatural deformations can be easily refuted with Shroud Scope, tape measure and ordinary average human male at disposal. For example: too long fingers – I have rebutted this myth here: https://shroudofturin.files.wordpress.com/2013/11/on-the-allegedly-long-fingers-of-ts-man.pdf\n\n","date":"November 5, 2014 at 7:50 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168887","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"” For example: too long fingers – I have rebutted this myth here: https://shroudofturin.files.wordpress.com/2013/11/on-the-allegedly-long-fingers-of-ts-man.pdf“.\nMasterful! I am totally… stupefied.\n\n","date":"November 5, 2014 at 10:56 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168945","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Look at the early depictions of the Shroud- on the dorsal image they all ( any exceptions?) show a gap between the elbows and the body that can’t be seen today. Now, in the privacy of your own home, lie down on your back and put yours arms down so that there is a gap between the  elbows and the body. Then see how far your arms will reach in front. You can then see that the two images on the shroud are not simultaneous representations of the same body. In fact, the artist has not even tried to make them match as his aim was simply to create images that could be seen by a congregation.\n\n","date":"November 5, 2014 at 11:33 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168955","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"At most the artists on the old copies didn’t make them match -and nothing all. On today’s Shroud we don’t see elbows, as there are burnholes in those places. Charles, your desperate attempts to rescue your bogus hypothesis do not interest me – I have no time to deal with every pseudo-rationalist nonsense they invent.\n\n","date":"November 5, 2014 at 12:12 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168960","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"O.K. Please don’t confuse copies of the Shroud with depictions of the expositions. The expositions are\nIikely to be more accurate – they certainly correlate with each better.\n Anyone able to find one that does not show a gap between the elbows  and the body and follow up my point from there?\n‘Desperate attempts’ and ‘ bogus hypotheses ‘ . Oh dear, another sleepless night, tossing and turning now that O. K  has exposed my mendacity yet again. How can I show my face, etc,etc?\n\n","date":"November 5, 2014 at 1:50 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168979","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Only if you think the events described in the NT that proto-Easter weekend were the equivalent of going a full 12 rounds in the ring against Muhammad Ali…\nTruly, it was something like that.\n\n","date":"November 5, 2014 at 8:31 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168906","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Respect for Colin and Hugh for their stance on this paper.\n\n","date":"November 5, 2014 at 8:41 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168912","author":"Mike M","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Thank you Mike. I was discussing the Shroud with a non-scientific colleague recently and getting frustrated by his airy dismissal of the radiocarbon dates, when I realised that in some ways I was guilty of the same thing in reverse – perhaps not quite so airily, but each of us, I expect, is biased towards the reliability of his own field. Just as I know very well the importance of a radiocarbon date and its reliabilty in different circumstances, my colleague was far more experienced than I in Byzantine iconography, and the reliability of its witness, and was frustrated by my – to him – airy dismissal of the Vignon markings. It wasn’t that we hadn’t read all the arguments for and against on both sides, just that we placed more trust in our own home ground. Needless to say we neither persuaded the other of our case, but perhaps we understood each other’s reluctance to change slightly better!\n\n","date":"November 5, 2014 at 9:03 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168919","author":"Hugh Farey","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"To those who claim «A regular artist can obtain a similar or better 3D effect with simple technics. I am not precisely a great draftsman but in 5’ with a pencil and a finger I have done my contribution to the sindonist theory of “exceptional 3D” by heart. La voilà!\nMy advice is before doing such claims they should first read what image processing experts concluded, namely Engineer Christophe Mignot(studying Joe Nickell’s «shroud» face and the Shadow Shroud face and comparing their alleged 3D encoding to the original Shroud face) and the conclusions achieved by Professor Fanti and Dr Thibault Heimburger on Professor Garlaschelli’s replica of the Shroud, as O.K.nicely pointed out.\nMy personal congratulations to O.K. for his(or her) comments.\nNevertheless I think it is worthless discussing these issues with skeptics because they are not open minded persons and their aim is just try to debunk the Shroud whatever it costs even hiding objective facts and distorting information to misinform who may read their comments. \n                                                                                     regards\n                                                                      Antero de Frias Moreira\n                                                           Centro Português de Sindonologia\n\n","date":"November 5, 2014 at 2:22 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-168987","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Antero. This is just silly. You can read my biography on the Yale University Press site- easily found if you put my name into a Google search and you can see that  I have  a great deal of experience as a historian and am widely accepted as such with a book on medieval relic cults that is published by a university press and has been well received by Catholic reviewers.\ni am merely interested in finding the truth about the Shroud and I promise you that if you find any evidence to place the Shroud conclusively within the period AD 1-30 then I will take it seriously.\nIt is because I have never seen any such evidence and because I know a great deal about medieval relic cults that I think that the Shroud is better placed within the medieval era and more closely ,due to its iconography, to the first half of the fourteenth century. That is an honest opinion based on what evidence we have.\nI have placed the Shroud within a very important medieval ceremony taking place on a day when Christians traditionally rejoice at the Resurrection. It is quite understandable that the Shroud should have been venerated for over seven hundred years and I think that anyone should be satisfied that that it the case. After all, I am not saying that it is a forgery or a hoax but a cloth that was created for a sacred ceremony. I don’t think I should be denounced for saying that. It is hardly ‘debunking’ the Shroud by giving it a sacred function. The chances that it was the burial cloth of Christ were always remote and I think  pope Francis is right in not encouraging that belief.\n\n","date":"November 5, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169017","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"CF: “The chances that it was the burial cloth of Christ were always remote and I think pope Francis is right in not encouraging that belief.”\nQuote from following thread,  ‘Papa Francesco’ Wire Service quoting Pope Francis:\n“I’m pleased to announce that, God willing, I will go on a pilgrimage to Turin on June 21 to venerate the Holy Shroud and honour Saint John Bosco on the 200th anniversary of his birth.”  \nCharles responded to Antero’s comments on skeptics’ attitude by citing his credentials, which is fair enough, but continues to refrain from responding to the evidence from Science.  I gather that is because he makes no claim for competence to do so.  But I don’t see that it can be an excuse to ignore it. \nHe mentions the various liturgical ceremonies, which is the phenomenon, but it is in the interpretation of the phenomenon which I believe is astray.  The question is, “Which influenced what?”  He sees the production of the Shroud for the purpose of a convenient prop in the celebration of the ceremonies.  It is no less likely that it was the increasing awareness of the existence of the Shroud which influenced the rubrics of the liturgies!  I think he needs to show a greater flexibility in his attitude towards the question of historical interpretation and significance as distinct from the events themselves.\n\n","date":"November 5, 2014 at 6:46 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169024","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"What evidence from science places the Shroud within the period AD1-30? I  am not ignoring science that I have never seen.\n\n","date":"November 6, 2014 at 2:19 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169108","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Senhor de Frias Moreira. Do you think that some lines and circles arbitrarily placed on some very bad quality photographs are worthy of congratulations? Truly?  \nI surprised to know that M. Heimburger and il dottore Fanti had answer to my objections. Can you give us a quotation, please?\nSo far as I know, no sindonist had ever answered to this kind of objections. They are simple questions that need simple answers. It is easier to elaborate confuse and complicated theories with showy scientific devices that nobody can appropriately understand. Do you know what Richard Feynman said about simplicity in science?\n\n","date":"November 6, 2014 at 4:43 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169152","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Charles\nI am very interested to know why you seemingly ignore my evidence (November 5, 4.42 am)of early depictions of the Shroud indicating obvious attempts on the part of the artists to depict the image’s faintness.\nI assume you are ignoring it because it is somewhat  inconvenient for the credibility of your case?\nI’ll take it as a victory\n\n","date":"November 6, 2014 at 12:44 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169086","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Good link on the 1516 Lier copy.\nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/The_Lier_Shroud_and_Lucas_Cranach_the_Elder_files/LC%20and%20the%20Lier%20Shroud%20using%20draft.pdf\nGood luck to you if you want to argue this earliest depiction is not trying to replicate the faint image of the Shroud.\n\n","date":"November 6, 2014 at 1:02 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169091","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"The copies are not good enough. They may have faded too. Count your victory when you have explained the intensity of the bloodstains as seen by the observers I quote. They cannot possibly be seeing the same Shroud as we see today. Do you think the Crown of Thorns could be seen clearly on the original Shroud?\n\n","date":"November 6, 2014 at 2:17 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169106","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"OMG!\nyou are embarrassing yourself!\nThe writing and “poker holes” on the 1516 depiction are still very clear. So the painted image faded but the other things didn’t???\n Look at the damn image! The artist does a pretty good job representing all the darker and lighter areas of the Shroud.\nHow about you show some humility and admit some of your theories are probably wrong!\nHey, some of them might be right, too\nTunnel vision fundamentalists on either side of this debate – S Jones or C Freeman – frustrating!\n\n","date":"November 6, 2014 at 3:16 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169125","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Hugh Farey is usually pretty fair on these matters, being somewhat on the anti-authenticity side but still fairly open minded.\nSo, what do you think Hugh? Was the image faint in the 1500s as I argue, or much darker and much more apparent as Freeman argues?\nHope you are enjoying your breakfast\n\n","date":"November 6, 2014 at 3:29 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169127","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Thanks Thomas. My answer, as you probably expected, is that I have no idea what the image was like, as the evidence, as so often with the Shroud, is conflicting! Charles is certainly correct to say that contemporary accounts go on and on about how fresh the bloodstains are, in particular, and how clearly the image is depicted, which, if they are to be taken at face value, simply cannot correspond with the image as we see it today. However, as I have suggested above, actual copies of the Shroud, however sharply depicted, are so different that it is difficult to believe that the artists had actually discerned anything clearly at all. I think what it will come down to is not a pile of actual eveidence – descriptions and paintings – on each side of the argument, but a more nuanced discussion as to what each describer or artist was putting into his recreation.\nThe Lier copy is often considered one of the oldest and one of the most accurate depictions of the Shroud pre-1532. Some details are more accurate than many other copies or depictions from much later – so why did the artist get the shape of the head so wrong, miss out most of the very visible bloodstains altogether, draw three clear strands of hair spreading over the back of the head, and over-accentuate the darkness of the hair and buttocks. Is that what he saw?\nPeople who think the Shroud was as it is now, and quote the Lier copy as their ‘proof’ have an obligation to explain these anomalies. Perhaps the Lier painter saw, but omitted the blood for reasons of his own. People who use the Lier copy to suggest that the Shroud was different still have to account for alterations, such as the shape of the head or the absence of blood, which cannot be due to the paint falling off. The much derided Picknett and Prince used the Lier shroud to ‘prove’ that the one we see now cannot have been the one the Lier artist painted, which was destroyed and replaced, much later, by Leonardo da Vinci. On the basis of that evidence alone it would be difficult to gainsay them.\nSimilarly, pious descriptions of the Shroud can either be taken as forensically accurate or imaginative reconstructions. Anyone who saw what he believed was really his saviour’s face on a cloth, in contrast to the many paintings he had seen, might well feel, quite sincerely, that it was brighter than it was, but on the other hand it is strange that nobody at all seems to have recorded that the image was actually barely visible – a strange case of the emperor’s new clothes!\nNow, what was the question? (Sorry if there are toast and marmalade crumbs over my comment!)\n\n","date":"November 6, 2014 at 4:23 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169146","author":"Hugh Farey","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"1568?\n\n","date":"November 6, 2014 at 4:38 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169150","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Hugh which contemporary accounts refer to a prominent image?  In Freeman’s article there are only quotes on the prominent bloid.\n\n","date":"November 6, 2014 at 5:43 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169162","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Antoine de Lalaing, Lord of Montigny. Ostension of the Shroud for Phlippe le Beau. Bourg-en-Bresse,  The 14th April 1503, Good Friday.\nC´est la rice syndont et noble Suaire acheté par Joseph d´Arimathie, long de seize à dixsept pieds, large de sept pieds ou environ, où il l´ensepvelist avec Nycodesme quand ils le eurent ostet de la croix. On le voidt clérement ensanglenté du trés précieux sang de Jhesus, nostre Rédempteur, comme se la chose avoit esté faicte aujourd´hui. On y voidt l´imprimure de tout son trés sainct corpz, teste, viaire, bouce, yeulx, nez, corps, mains, pieds et ses chinq playes: espécialement celle du costé, longue environ d´ung bon demi piedt, est fort ensanglentée; et de l´autre part, comme il estoit couvert et redoublé dudict linchoel, on voidt le vestige et figure de son dos, teste, chevelure, coronne et espaules(…) ».\n« On le voit »= One can see him , Jesus our Redemptor « all his very holy body » as “if the thing was made today”. \nFurthermore, the comission designated by the Bishop of Liège, also concluded that the image was painted. (1449)\n\n","date":"November 6, 2014 at 9:43 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169235","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“In it was painted, in a subtle way, the double portrait of a man”\nMemorandom of Pierre de Arcis, 1389\nThe issue is not whether some thought the image was painted but rather if it always has been considered to be subtle. A recently left imprint can still be subtle.\nNo references to a clear image?\n\n","date":"November 6, 2014 at 11:12 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169264","author":"Henrik","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Davd Mo, you misleadingly wrote: \n« On le voit »= One can see him , Jesus our Redemptor « all his very holy body » as “if the thing was made today”.\nThen AGAIN (as usual!) you are misrepresenting what the author (Antoine de Lalaing, Lord of Montigny) really wrote in Middle Old French! He actually wrote:\n“On le voidt clérement ensanglenté du trés précieux sang de Jhesus, nostre Rédempteur, comme se la chose avoit esté faicte aujourd´hui.” \nTHAT IS:\n“You can clearly see IT (= the Shroud, my upper cases)  covered in the most precious blood of Jesus Our Redemptor as if the thing had happened today”.\nThe above sentence refers to Jesus’s blood only not to “him”!\nStill today, observers find the intensity of the bloodstains quite surprising  as if the TS man’s blood had been shed just the day before…\n\n","date":"November 6, 2014 at 12:04 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169285","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Max: “Le” is refered to the nearest pronoun: this is to say:  l´ensepvelist avec Nycodesme quand ils le eurent ostet de la croix . Who was “enseveli” et “descendu de la Croix”  The Shroud? Not at all. This is the body of Jesus which is immediately described after. The global sense of the paragraph implies an easy sight of the body with some features that we cannot see today. As we cannot see the blood as “faicte” today. The fresh blood has a different colour than the Shroud now in Turin.\n\n","date":"November 7, 2014 at 11:07 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169600","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David Mo, you just cannot correctly read (and translate) Middle French!\nIt does read: “C´est la rice syndont et noble Suaire acheté par Joseph d´Arimathie, long de seize à dixsept pieds, large de sept pieds ou environ, où il l´ensepvelist avec Nycodesme quand ils le eurent ostet de la croix. On le voidt clérement ensanglenté du trés précieux sang de Jhesus (…)”\nOn le voit = On voit le rice syndont et noble Suaire (clérement ensanglenté du trés précieux sang de\nJhesus). \nHere “le” as pronoun refers to ” le rice syndont et noble Suaire” NOT to Jesus!.\nYou can see it  =  You can see the rich sindon and noble Shroud (clearly covered in the most precious blood of\nJesus)\nSorry, your translation is totally biased and does misrepresent the author’s opinion. Period.\n\n","date":"November 7, 2014 at 11:28 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169606","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Henrik said: ““In it was painted, in a subtle way, the double portrait of a man”\nMemorandom of Pierre de Arcis, 1389\nThe issue is not whether some thought the image was painted but rather if it always has been considered to be subtle. A recently left imprint can still be subtle.”\nI’m sorry Henrik, but the memorandum uses “subtili” twice. “Subtili modo depicta” and “subtili ingenio”. In both cases “subtili” is used in the sense of  penetrating, acute. This is the usual translation in this case. Remember that “subtle” has also the same meaning in English: clever, ingenious.\n\n","date":"November 7, 2014 at 10:39 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169588","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I’m still waiting to hear of the so called contemporary accounts of a clear image.\nThe prominence of the bloodstains? Actually entirely consistent with the shroud today.\nI’ve seen the shroud in the flesh and without digital enhancement as per images online the image is faint and the blood prominent.\nHas Freeman seen the image in the flesh? Does he realise how faint the image is and how prominent the blood is when the image is viewed without digital enhancement?\n\n","date":"November 6, 2014 at 5:43 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169177","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Hugh,  you wrote \n“[…] contemporary accounts go on and on about how fresh the bloodstains are, in particular, and how clearly the image is depicted, which, if they are to be taken at face value, simply cannot correspond with the image as we see it today.”\nBut have you ever seen the Shroud at one of the Ostensions in Turin? \nI saw it several times and took several pictures of the Shroud you can see at sindonology.org. In the dark with a reduced amount of light you can prominently see the bloodstains and the image. The descriptions I read from the  past centuries correspond to what I saw on the Shroud and that I still can see on these photos. The bloodstains are vivid, the images are prominent. I invite you, and the readers of this blog, to look at several of the photos taken at the 2010 Ostension, accessible at http://www.sindonology.org (http://goo.gl/FEXpFF) (you can enlarge these photos by clicking on them). In particular, please look at the close ups such as the back http://goo.gl/FEXpFF. \nWhat is so different from what we see on these photos and the descriptions of past centuries?\nSome specific points about these descriptions should be stated to support such a statement as “[…] simply cannot correspond with the image as we see it today”.\n\n","date":"November 7, 2014 at 12:02 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169457","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“People who think the Shroud was as it is now, and quote the Lier copy as their ‘proof’ have an obligation to explain these anomalies.”\nHaving earlier expressed the view that the Shroud was fairly faint to start with, I feel obliged to respond to Hugh’s challenge, albeit briefly. having a new bit between the teeth right now (the new orthodoxy that claims gluten intolerance to be an autoimmune disease).\nThe TS was designed (or adapted from something else) to simulate a whole body sweat imprint that would rival, indeed exceed the Veil of Veronica as a draw for pilgrims. That’s why its first recorded appearance in Lirey coincides with the release of the Lirey medal, and why I don’t buy into Charles’ idea that it was intended ‘merely’ as a prop for an Easter ritual.\nEveryone who viewed the early TS, the Lier artist included, was told it was the dried residue of a sweat imprint left behind on a burial shroud, and that would have coloured the way they viewed it (needing all the help they could get, given not just the faintness of the image but its unhelpful negative character, a necessary concomitant of it being a contact imprint).\nSo why is the hair the way it is, seemingly glued to the skin? Because that’s the way that sweat-laden hair might look. Why are the buttocks so prominent? Because that’s where there’s a large area of contact between subcutaneous fat and skin that traps perspiration, preventing it from evaporating quickly. \nI could go on re blood etc, or initial lack thereof,  suggesting that Charles’ ‘over-flagellation’ was the remedy for making the image easier to make out at a distance, but hopefully there’s enough here  to give some pointers as to why the Lier copy is the way that it is.\n\n","date":"November 6, 2014 at 4:48 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169153","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"‘ everyone who viewed the Shroud was told it was the residue of sweat.’ Colin, I have never comes across this before so,please give the quotes from ‘ everyone’ and I will add them to my notes.\nI would love to know from Colin how he knows that the images were as faint or almost as faint in the fourteenth century as they are today. It assumes that the chemistry of the Shroud has remained unchanged for seven hundred years despite the many expositions that we know were pretty turbulent affairs – as the nuns caught by the customs  officers with brandy in their bottles labelled ‘Holy Water’ put it – Good Lord, another miracle’.\nDavid has dug up yet another quotation that shows beyond reasonable doubt that the Shroud looked very differently in the sixteenth century . I have seen the two exact replicas of the Shroud in Turin and I can’t see bloodstains ‘as if they were recent,’ even though Thomas can, and, as David reminds us, the Shroud was described in 1449 as painted.\nAs a historian I have to make a judgement and in the end I give up on those who really do believe that the Shroud was the same in1350 as it is now ,although I am giving Colin a last chance to provide his evidence.\nJust as I can’t see the Shroud in the Pray Codex as it shows Christ being laid out without the bloodstains on his body when anyone seeing the Shroud would put the bloodstains on the body, in the end one just has to accept that one has the wrong spectacles and continue on one’s way trying to find the truth about the Shroud.\nI have been in Pistoia looking at the wonderful 1260 Crucifix with scenes of the Passion they have in the cathedral there. There is blood flowing from the five wounds, but no marks of any flagellation and the panel with the flagellation scene shows no blood at all. Christ has a halo, not the Crown of Thorns. The change in iconography over the next eighty years is indeed dramatic. The flagellation marks are shown covering the whole body, the halo becomes the Crown of Thorns, and the blood becomes more prominent – the Shroud is so typical,of this change.\nI am keeping my mind open to which of the bloggers here have closed minds!\n\n","date":"November 6, 2014 at 11:35 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169273","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":" I am giving Colin a last chance to provide his evidence.\nOh dear. Seems I’m in the Last Chance Saloon at the Freeman Arms. Time then to pull out all the stops.\nI can’t provide you or this site with a single piece of rock-hard evidence for my thinking the TS was intended  as a sweat imprint to trump the Veil of Veronica, Charles. If I could, It would be my still unwritten piece for the New Scientist or similar that we’d be discussing right now instead of your historico-religious version of events.\nHere, off the top of my head, are some of the points I have made over the last 3 years in well over 200 blog postings. I don’t expect a point-by-point critique, but challenge you to provide a single damning objection:\n1.  The failure of STURP to detect paint, suggesting something other than a painted image.\n2.  The precedent of the Veil of  Veronica, reputed according to legend to be a sweat imprint.\n3.  The visual evidence from the Lier copy of the image being faint, and other visual cues it was formed in sweat (sodden-looking hair, prominent imprint from buttocks)\n4.  The negative image and 3D properties, suggesting some kind of contact imprint.\n5. The double image, to convey the idea of an imprint left by a corpse, probably/likely as bodily secretion that would been profuse due to events preceding a traumatic death.\n6. The nudity, suggestive of a body imprint that made no concessions to finer sensibilities.\n7. The present faintness of the image, with nothing except conjecture to suggest it was ever significantly more prominent.\n8. The over-flagellation etc that can be interpreted as means of making a faint body image more prominent.\n9.  The various blank regions in the body image that imply the image was intended to be seen as a contact imprint, with failure to imprint in places, thus not a painting.\n10. The sole use of blood to mark the sites of wounds, with no imprinting of open wounds per se, suggestive of a simple “incomplete” template to simulate a sweat imprint.\n11. The Veil of Veronica-like motif added to the Machy mould with the word “SUAIRE”, that might simply mean facecloth, but has connotations of sweat too.\n12. Frances de Sales letter to his mother after seeing the TS,  displaying a fixation not just with blood, but sweat stains too.\nAs you see, no killer points, just an accumulation of suggestive evidence. All 12 points accrued purely from reading and photographs, with no opportunity to lay eyes on the TS itself, not even through plate glass – so there’s bound to be an element of tendentiousness.\n\n","date":"November 6, 2014 at 1:10 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169302","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Hi Colin\nFrancis de Sales himself sweated profusely while holding up the Shroud during an exposition. He also had a “guilty conscience” when it came to this, drops of sweat fell on the relic.\nI think the STURP examination does rule out painting..\n\n","date":"November 6, 2014 at 1:54 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169309","author":"Louis","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Hello Louis. \nGlad we agree about the STURP conclusions, assuming Walter McCrone had given up on good old-fashioned objectivity as seems to be the case.\nYes, Frances de Sales starts with references to his own sweat, but it doesn’t end there – see the full letter with four references to that of the victim’s sweat, then that of his own father. Sweat did seem something of a preoccupation. Why? Because he had been told by the curator that he was viewing an image that had been left by evaporated sweat?\nAnnecy, 4 May 1614\nWhilst waiting to see you, my very dear Mother, my soul greets yours with a thousand greetings. May God fill your whole soul with the life and death of His Son Our Lord! At about this time, a year ago, I was in Turin, and, while pointing out the Holy Shroud among such a great crowd of people, a few drops of sweat fell from my face on to this Holy Shroud itself. Whereupon, our heart made this wish: May it please You, Saviour of my life, to mingle my unworthy sweat with Yours, and let my blood, my life, my affections merge with the merits of Your sacred sweat! My very dear Mother, the Prince Cardinal was\nsomewhat annoyed that my sweat dripped onto the Holy Shroud of my Saviour; but it came to my heart to tell him that Our Lord was not so delicate, and that He only shed His sweat and His blood for them to be mingled with ours, in order to give us the price of eternal life. And so, may our sighs be joined with His, so that they may ascend in an odour of sweetness before the Eternal Father.\nBut what am I going to recall? I saw that when my brothers were ill in their childhood, my mother would make them sleep in a shirt of my father’s, saying that the sweat of fathers was salutary for children. Oh, may our heart sleep, on this holy day, in the Shroud of our divine Father, wrapped in His sweat and in His blood; and there may it be, as if at the very death of this divine Saviour, buried in the sepulchre, with a constant resolution to remain always dead to itself until it rises again to eternal glory. We are buried, says the Apostle, with Jesus Christ in death here below, so that we may no more live according to the old life, but according to the new. Amen.\nFrancis, Bishop of Geneva\nThe 4th of May 1614\n\n","date":"November 6, 2014 at 2:07 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169313","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Colin, Thanks for the above. Did you note that Francis writes “wrapped in His sweat and in His blood”?\n\n","date":"November 6, 2014 at 2:48 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169323","author":"Louis","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"‘ everyone who saw the Shroud was told…’ Well, Colin, you have not provided a single example of anyone who was told. Francis de Sales imagined sweat, along with the blood, but that does not mean much.\n I cannot see anything credible you can provide for your case of faint images to set against the mass of primary evidence that everyone was shocked by the prominence of the blood in the fifteenth and sixteenth centuries.\n\n","date":"November 6, 2014 at 4:20 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169347","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Chrales wrote:\n“(…) because I know a great deal about medieval relic cults that I think that the Shroud is better placed within the medieval era and more closely ,due to its iconography, to the first half of the fourteenth century. That is an honest opinion based on what evidence we have.”\nJust to paraphrase him or actually it should read: (…) because Charles knows very little about Edessenian and Byzantine Christ image cult, Paleochristian, Coptic, Syriac, Carolingian, Byzantine and Benedictine iconography that he thinks that the Shroud is better placed within the medieval era and more closely, due to the sole iconography he is familiar with, to the first half of the fourteenth century. That is a most partial opinion based on  what very incomplete evidence HE has.\n\n","date":"November 6, 2014 at 5:27 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169172","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"As a Historian, he won’t have gotten his PhD on this.\n\n","date":"November 6, 2014 at 7:02 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169200","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Reminder: according to its Greek etymology, ‘historia’ means investigation. Charles’ is not reliable at all as very partial.\n\n","date":"November 6, 2014 at 7:07 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169201","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"dear bloggers,\nYou should write the name CRAIG in your long discussions …\nYears ago Emily Craig proposed a new technique to produce an image\nlike the Shroud of Turin and prepared some experimental results that\nyou should consider in comparison with the data obtained from the TS… \nHere the reference:\nEmily A. Craig, Ph.D., and Randall R. Bresee, Ph.D.\n “ Image Formation and the Shroud of Turin”,\nJournal of Imaging Science and Technology,\nVolume 38, No. 1, p.59-67, 1994.\nLink:\nhttps://www.shroud.com/pdfs/craig.pdf\n— —\nAnd see also (in this blog):                                                                                    Did a medieval artist use Emily Craig’s technique to create the Shroud’s image? (April 18, 2012)\n— —\nSo…\nTry to produce something using the dry dust drawing technique Craig and Bresee described in 1994!\nYou can use dry powdered Ferric Oxide (because Fe203\nwas reportedly found in significant amounts in image areas\non the Shroud as reported by Heller, Adler, and Pellicori). \nHere a question connected with a phenomenon…\nI have read that color intensity of Ferric Oxide can change\nin direct proportion to changes in atmospheric humidity.\nDo you agree on that?\nAnother question connected with the previous fact:\nAccetta and Baumgart noted variations in the spectrum on the TS\nwhen they conducted their infrared reflectance spectroscopy and thermographic\ninvestigations. (Applied Optics, 1980)…”Of particular note during the course\nof the experiment was the relatively large fluctuations in atmospheric absorption,\nespecially on those days when local precipitation caused high relative humidity.”\nDid you knew that story?\nHave you taken into account inherent differences (for your work)?\n———————————–\nIt was Craig’s opinion that the image was man-made and any attempt to duplicate the image\nis only limited by one illustrator’s ability to copy the artwork of the original illustrator. Her hypothesis was that the “dust drawing” technique can be utilized to produce an image which has all of the physical characteristics of the image on the Shroud cloth.\nBut (… and in any case …) the technique proposed by E. Craig,\neven if very interesting and capable to reproduce many of the\nphysico-chemical characteristics of the Shroud of Turin,\nwas not able to reproduce some typical characteristics of\nthe Shroud detectable at microscopic level!!!\nHere my simple conclusion:\nThe idea to work in a similar manner seems to be an useless attempt to discredit the Shroud !!!\nAm I wrong in my claim?\nTry to work using iron oxide, raw sienna, gelatin transferred to clean dry linen…\nand observe the results obtained (at macro and micro-levels [= observations with a microscope]).\nObserve also the effects from the experiments with water stains…\n—————————————————-\nOther references:\nhttps://www.shroud.com/comment2.htm\n= Comments From Previous Years 1996-2000\nREACTIONS to the Emily A. Craig and Randall R. Bresee paper…\n… Isabel Piczek has written the classic rebuttal of this article. …\n<>\nin this blog:\nThe Biggest Shroud of Turin Mystery (November 30, 2011)\nLink:\nhttps://shroudstory.com/2011/11/30/the-biggest-shroud-of-turin-mystery/#comments\n\n","date":"November 6, 2014 at 8:28 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169221","author":"piero","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Analyses on linen fibrils treated with iron oxides,\nmake use of instrumental color matching is an important step …\n>Colour analysis of blends containing iron oxide can be conducted through use of a\ncolorimeter, which measures that reflectance pattern of electromagnetic radiation emanating\nfrom the powder sample using a particular light source …\n>The colour values of iron oxide pigment have been observed to be sensitive to relative\nhumidity (during mixing) and post-mixing storage conditions (relative humidity, temperature)\nand time. …\nSource:\nAnalysis of dry Powder Mixing Processes  using a FINE COHESIVE PIGMENT\nDavid Barling, Assoc. Prof David Morton, Assoc. Prof Karen Hapgood\nLink:\nhttp://www.conference.net.au/chemeca2012/papers/321.pdf\n\n","date":"November 6, 2014 at 8:41 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169224","author":"piero","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Freeman said: “all forensic scientists I have consulted have taken, that the blood stains are too red to be real blood. Heller or Adler’s hypothesis of stress and bright red blood has never been replicated or taken seriously by anyone other than Barrie Schwortz,”\nAnd what of Ray Rogers’ Los Alamos colleague Diane Soran’s experiment with Saponaria-washed cloth, where 25-year-old samples stil showed red blood, while the control samples were black?  And what of Molecular Biologist/Archaeologist Thomas Loy noting that he has seen red blood marks on artifacts that are thousands of years old?\nAll forensic scientists you consulted say blood stains are too red?  Nice job of picking your consultants! How many consultants?  Did they know jack-all about archaeology?\n\n","date":"November 6, 2014 at 10:11 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169248","author":"Nabber","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Nabber:\nAnd what of Molecular Biologist/Archaeologist Thomas Loy noting that he has seen red blood marks on artifacts that are thousands of years old?\nDo you have some references?\n\n","date":"November 6, 2014 at 10:18 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169250","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Well, I just ask Emeritus Professors and give them every paper I can find on the Shroud bloodstains- I think there was only one of the Heller Adler papers that I was not able to find. Are you suggesting that they will change their professional opinion to suit me?\nI sometimes wonder whether some of the contributors to this blog have ever worked directly with academic specialists- in my experience they give their professional opinion independently of what I might want to hear and several trails I have started along  have been closed off as a result.\n\n","date":"November 6, 2014 at 11:42 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169274","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"As it happens I now have a supply of saponaria washed cloth, having grown my own saponaria officinalis and ground up a plant in water to produce a very authentic looking soapy liquid. Now I’m just waiting for a good supply of fresh blood to see if I can confirm Ms Soran’s observation.\n\n","date":"November 6, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169284","author":"Hugh Farey","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"The red blood is said to have something to do with traumatic death.\n\n","date":"November 6, 2014 at 11:54 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169280","author":"Louis","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"As early as March 16, 2013 at 7:35 pm, I already wrote:\n“I said it once I say it twice for Hugh et al as far as the archaeological bloodstain pattern analysis is concerned:\nNatural mordanting of dry blood remoistened with aqueous alkaline solution along with drying through myrrhic-aloetic (wood aloe) fumigation could account for:\n– The aged bloodstains still looking fresh today on the long inner burial cloth as if the blood had just been shed the day before. Mordant is known to be used for INTENSIFYING STAINS e.g. in cell or tissue preparations\n– Potassium giving only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) giving strong signal. Now it is well known gelatine is a breakdown product of collagen. The true fact is low temperature (55°-85° C) alkali gelatinisation of starch residuals present in the ancient linen cloth could be a possible factor as bubbling printing paste to be taken into account in the Shroud image formation process.\n– Bilirubin is neither the problem nor the solution, just probably one part of the whole equation.\n\n","date":"November 6, 2014 at 12:28 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169290","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"To all commenters who think the Shroud was a mediaeval masterpiece and claim it’s very easy to reproduce it’s 3D encoded information I adress these two challenges:\n1-Show us just ONE known mediaeval masterpiece having image characteristics just like the Shroud.\n2-Try to produce by any means you choose an image just like the Shroud image whith ALL macroscopic, microscopic and 3D encoding properties.\nI’d be delighted to see  someone accomplish these challenges.\nTo Professor Charles Freeman.\nI have no doubt you are a qualified historian but all historical data about the Shroud I gathered from other historians as qualified as you makes me have a different point of view concerning the dating of the Shroud, and besides science has already discredited 1988 radiocarbon  tests ( I won’t repeat all bla bla bla about that….)\nTo Mr. David Mo:\nI’m sorry if I’ve not made myself clear concerning Shroud image 3D encoding.\nI meant the comparison between Professor Garlaschelli’s face and the Shroud face which was an aspect analyzed by Dr. Thibault Heimburger and Professor Giulio Fanti in their paper «Scientific comparison between the Turin Shroud and the first hand made copy» Procedings of the International Workshop on the Scientific approach to the Acheiropoietos Images, ENEA Frascati Italy 4-6 May, 2010- You’ll find it in http://www.shroud.com\nThe other paper by Engineer Christophe Mignot you’ll find it entitled « De l’aspect tridimensionel comparé du Linceul de Turin et des faux suaires realisés experimentalement» in french website http://www.suaire-science.com\nNevertheless I don’t expect you’ll change your mind.\nI’ve learned one thing-Shroud skeptics will always remain like that, no matter what kind of evidence pointing otherwise will be presented.\nAlthough they claim to be searching the truth, the only« truth» for them are their own claims\n                                                                  regards\n                                                      Antero de Frias Moreira\n                                               Centro Português de Sindonologia.\n\n","date":"November 6, 2014 at 12:34 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169293","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Antero. If you can find a print copy of History Today , where we have the illustrations in full,  you will find that the blood flows on the Holkham Bible of 1330 are almost identical with those on the Shroud\n\n","date":"November 6, 2014 at 4:22 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169349","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Senhor de Frias Moreira; Don’t  lectured me, please. I have read all the articles (?) that you link  here and more. The effect 3D depends of some contingencies:\na) The device and its adjustments. In this case the software -or its adjusment- used by O.K. was as bad as their photographs.\nb) The suitability of the image. Here it enters the ability of the artist or the direction and  quality of thelight if we are talking about a photogrpoh.. \nAll the sindonists works manipulate this data pro domo sua. Those I know, at least.\n\n","date":"November 7, 2014 at 7:29 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169561","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I’m still waiting to see an exact replica of the shroud. What’s taking so long? Come on, with all the technology we have today, should have had the replica by now. But seriously, that’s not going to happen. This blog will be the oldest, longest continuous blog on the internet.\n\n","date":"November 6, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169299","author":"Don","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Don. First you have to create a medieval linen  weave. The medieval experts tell us that it has to be quite a thick weave of linen ( just as the Shroud is) if it is to be a suitable surface to paint on. Then you seal it ,usually with a gesso of collagen derived from rabbit skin boiled up and mixed with calcium carbonate ( as found in large quantities by STURP). But as Ceninno Ceninni advises, in the fifteenth century, you must cover only the outer fibrils of the cloth( as again STURP found on the Shroud).  If it goes under the surface you will not be able to fold and unfold the cloth. Then in top of the gesso once it has dried, you can paint an image. If you need bloodstains ( as the early observers of the Shroud reported there to be in vivid colours ) then probably you need vermilion even if it does not dry like real blood.\nNow you have your painted linen. You need to keep,it very carefully because even with a sealed surface it remains vulnerable to damp and decay and the vast majority of the painted linens that we know, from church and monastic inventories, to have existed have long since perished.\nThe problem is if you expose it, especially in Turin in May when it is the month of the heaviest rainfall, and unfurl it dramatically  year after year in front of the enormous crowds that get to see it, the surface begins to fragment . It may take four or five hundred years before almost all, or perhaps all, the pigments have dropped off and there are only a few remnants of the calcium carbonate to be found by later researchers, although here is at least one report that some of the vermilion was still there in 1978.\nBut in the end after six hundred years, the bright colours of the blood and images that were once said to be there, have faded and one can hardly make out what is still left. The Crown of Thorns has gone, the loincloth, that was painted on by 1578 in accordance with the decrees of the Council of Trent against lascivia in religious imagery, has long gone and you can no longer see that there was once a gap on the dorsal image between the elbows and the body, making it clear that the front and the back image could not have been created simultaneously as the arms would not have reached in the front to cover the pubic area.\nAnd although this is hard to believe, there are some people who still think that the faded images of today are still the same as they were In 1350 and perhaps even in AD 30 but they must be left to their own fantasies and the rest of us must move on in the real world.\nThe problem is that we have not got five or six hundred years to paint a linen cloth according to the medieval methods and wait until the images are faded. So perhaps the Shroudies will win after all.\n\n","date":"November 6, 2014 at 4:10 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169341","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“So perhaps the Shroudies will win after all.”   It saddens me that we have to speak in terms of winning or losing on this matter. The search for, and finding of, the truth should be a ‘win’ for everyone. If it isn’t then we probably have more invested in this debate than we can personally admit.\n\n","date":"November 6, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169345","author":"David Goulet","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"The search for, and finding of, the truth should be a ‘win’ for everyone.\nExcept for those who want to distract us from the truth, remember about that.\n\n","date":"November 6, 2014 at 4:20 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169348","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David G  . Well from my perspective I sometimes get the feeling that someone out there is out to defeat me!\n\n","date":"November 7, 2014 at 12:54 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169464","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I find it hard to believe that most of the paint flaked off the shroud. A shroud thread contain many fibers (I don’t know the approximate number of fibers per thread), there would have been paint residues between fibers. It would have been very difficult to remove the all residues even if you try. If it did flake off, wouldn’t there be damage to the fibers at microscopic level? Like a slight pull from the body of the thread?\n\n","date":"November 6, 2014 at 8:10 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169396","author":"Don","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Possibly not if they follow the medieval instructions that the gesso and paint should be only in the outer fibrils of the cloth ( ring a bell anyone?). It must have been one of those skills that took years to perfect as Cennini says you have to be careful to create a layer that does not penetrate. Remember many painted linens were flags and banners and they wanted them to flutter just as a flag does nowadays. That is why they aimed for a very light covering with the excess scraped off with a knife ( lack of brush strokes ring a bell with anyone?)\n\n","date":"November 7, 2014 at 1:00 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169467","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"The problem is that we have not got five or six hundred years to paint a linen cloth according to the medieval methods and wait until the images are faded. So perhaps the Shroudies will win after all.\nCharles, I have a challenge for you.\nGive me one example of one medieval linen cloth, that had once some image painted onto it, and then after all paint had flaked off, it preserved the residual of original image with 3D qualities comparable with those on the Shroud:\n\nThat’s absolutely a starting point. Unless you provide one, we have absolutely nothing to talk about. Until you do so, your claims in History Today article are absolutely worthless pseudo-historical fantasies (if not simply a garbage). You know, they say that ‘paper will accept anything’, and despite you can write whatever you want, it is absolutely meaningless if you cannot provide examples backing your view. If you cannot show that encoding 3D information in the painting, and what’s more -preserving it after the paint has totally eroded is even possible at all is even possible, then your ‘theories’ do not deserve any scientific attention.\n\n","date":"November 6, 2014 at 4:40 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169354","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I think that anyone can create a three-D image if they want to.  I really don’t think your argument has any mileage.\nPerhaps you should write to the Editor of History Today complaining of the low level of articles he and his peer reviewers accept. You need to cut out personal abuse and concentrate on facts if you are to be taken seriously. I don’t think using the words ‘ absolutely worthless pseudo- historical fantasies ” will help unless you raise your intellectual game!\n\n","date":"November 7, 2014 at 1:08 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169468","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"” … unless you raise your intellectual game”\nSo you as a historian start with the premise that the TS body image (forget blood for now) is just another medieval painting, in spite of reams of evidence to the contrary (yes, including the 3D properties but a lot more besides) and then suggest to the world of Shroudology that you yourself are applying intellect.\nThat’s rich I must say.\n\n","date":"November 7, 2014 at 1:35 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169473","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Its more than rich. Why don’t we roll out the adjectives- arrogant, deluded, tunnel visioned…pension time?\n\n","date":"November 7, 2014 at 1:47 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169477","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"While I hesitate to say it, Thomas, each of your three unflattering adjectives is absolutely ‘spot on’, as we Brits are wont to saying.\n\n","date":"November 7, 2014 at 1:55 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169480","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Colin – not ‘start’ with the premise , ‘ conclude on the mass of interlocking evidence as laid out in my article’ would  put it better.\nPerhaps I have missed the reply to my question asking for the scientific evidence that places the date of the Shroud within the narrow period AD 1-30.\n\n","date":"November 7, 2014 at 3:22 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169492","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I don’t think that’s a valid argument, OK (and Antero, and Don, who say much the same), if I may say so. There is no dispute that the Shroud is unique, from whatever century it comes. If I were to say that the Shroud could not possibly be accepted as 1st century unless you could provide another one, you would be rightly indignant. This is a variant on the “if you don’t know how it was done then I must be right” argument, which, as we have seen many times before, works equally well for both sides.\nSimilarly, a statement like this: “I’ve learned one thing – Shroud skeptics will always remain like that, no matter what kind of evidence pointing otherwise will be presented. Although they claim to be searching the truth, the only «truth» for them are their own claims,” is surely a two edged sword and benefits nobody. If I were to reword it slightly as follows: “I’ve learned one thing – Shroud authenticists will always remain like that, no matter what kind of evidence pointing otherwise will be presented. Although they claim to be searching the truth, the only «truth» for them are their own claims,” would I be any less correct? I believe that if the radiocarbon dating were ever seriously challenged, non-authenticists in droves would change their minds (and I mean seriously challenged in the minds of the non-authenticists, not in the minds of those who didn’t believe in it anyway).\nAnd what about this: “those who want to distract us from the truth”? Who are these people? How do they know what the truth is, so they can distract people from it? Some of the most passionate discussions on this site have been between fellow authenticists – is the Shroud the same as the Mandylion or not? Which of these groups wants to distract us from the truth?\n\n","date":"November 6, 2014 at 5:56 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169367","author":"Hugh Farey","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"It’s not about that, Hugh.\nCharles claims that the Shroud was once a painted easter prop, from which all the paint has flaked off. Then I ask: could you provide any other example of medieval painting that retained its 3D properties after losing all pigment? Could you? Is that even possible.\nIf you cannot show this, then this theory is worthy no more than theory that Egyptian pyramids were built by aliens. Pseudo-theories with no basis have no place in modern science. And that’s all. \nAnd about “those who want to distract us from the truth” – I leave for myself their names. In fact you can easily guess who they are. And in the such a controversial topic as the Shroud -it is hard to imagine had there be no such people.\n\n","date":"November 6, 2014 at 6:08 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169372","author":"O.K.","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"The debate becomes contentious because of the difficulties of access.  The Shroud is iconic, is considered to be more than religiously significant, it is at least a stimulus to meditation on the sufferings of Christ, but it may be more than this.  All popes at least from the time of Pius XI, who was astounded at Barbet’s revelations, have considered it so, regardless of whether they may have thought it the authentic burial cloth or not;  most of them without actually saying so seem to have thought so.  \nDifficulties of access are the same with any iconic and religious item, e.g. the Manopello Veil.  Try some scientific investigations on deciding on whether the Islamic Black Stone of the Ka’aba is a meteorite or a lava, and see how far you might get with that one.  Meantime the debates continue, because nobody knows.\n\n","date":"November 6, 2014 at 8:36 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169401","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“The debate becomes contentious because of the difficulties of access.”\nI agree.\n\n","date":"November 6, 2014 at 10:19 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169430","author":"PHPL","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Linen-gesso-paint(detailed/3D/negative)\nPlus (Years and years)\n=Linen-fragmented gesso(no cementing of fibres as demonstrated by transmitted light photography) – paint(detailed/3D/negative) how does the paint stick to linen and still remains detailed and 3D?\nIf this theory is not preposterous, I don’t know what is?\n\n","date":"November 6, 2014 at 10:38 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169435","author":"Mike M","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"the Clare nuns in the 1500s referred to the Shroud: “The traces of a face all bruised”\nTrace of a face? Sounds like a faint image, to me\n\n","date":"November 6, 2014 at 11:41 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169454","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Have you read my comment November 6?\nI repeat: \n“Antoine de Lalaing, Lord of Montigny. Ostension of the Shroud for Phlippe le Beau. Bourg-en-Bresse, The 14th April 1503, Good Friday.\nC´est la rice syndont et noble Suaire acheté par Joseph d´Arimathie, long de seize à dixsept pieds, large de sept pieds ou environ, où il l´ensepvelist avec Nycodesme quand ils le eurent ostet de la croix. On le voidt clérement ensanglenté du trés précieux sang de Jhesus, nostre Rédempteur, comme se la chose avoit esté faicte aujourd´hui. On y voidt l´imprimure de tout son trés sainct corpz, teste, viaire, bouce, yeulx, nez, corps, mains, pieds et ses chinq playes: espécialement celle du costé, longue environ d´ung bon demi piedt, est fort ensanglentée; et de l´autre part, comme il estoit couvert et redoublé dudict linchoel, on voidt le vestige et figure de son dos, teste, chevelure, coronne et espaules(…) ».\n« On le voit »= One can see him , “Jesus our Redemptor” « all his very holy body » as “if the thing was made today”.\nFurthermore, the comission designated by the Bishop of Liège, also concluded that the image was painted. (1449)”\n\n","date":"November 7, 2014 at 3:10 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169490","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"It must have been a very special kind of paint to have caused all those pilgrims to flock to Lirey in 1355 – to the consternation of the local bishop – to say nothing of warranting a commemorative medallion.\nLuminous paint? Or maybe just day-glo fluorescent paint? Shame there’s none of it still around on today’s Shroud for scientific analysis – thus leaving the field wide open for uninformed speculation (first on our magazine newstands and now national newspapers no less).\n\n","date":"November 7, 2014 at 3:26 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169494","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Very special indeed to attract the flocks. Oh so easily fooled by a simple painting those 14th century fools!\n\n","date":"November 7, 2014 at 3:44 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169508","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I wouldn’t bet a rupee to the rationality of the relics fans … in the Middle Age.\n\n","date":"November 7, 2014 at 7:04 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169553","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David, so what if the Bishop concluded the image was painted?\nMcCrone thought it was painted. Freeman thinks it was painted. Doesn’t mean it is / was.\nGiven the complexity of the image characteristics and its mysterious nature, and the fact that a lot of very intelligent people still struggle to find a compelling image creation theory, is it really any surprise that someone in the 15th century might have concluded – possibly wrongly – that the image was “painted”???\nAssuming it was created by an artist / artisan (rather than being Christ’s burial cloth) then painting is the easy “out”.  \nI favour authenticity, but in the event that it was a 14th century creation then I think Colin Berry is much closer to the answer.\n\n","date":"November 7, 2014 at 4:24 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169522","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"You have asked who had said that the image was highly coloured and I answered you. All the expressions of de Lalaing and the Liege’s comission imply that the image was more visible, it is to say, more enhanced of colour than now is. No one spoke about “mysterious nature”, “fainted” or similar, but as “made today”. \nI think this is what you questioned.\n\n","date":"November 7, 2014 at 7:13 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169555","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“I favour authenticity, but in the event that it was a 14th century creation then I think Colin Berry is much closer to the answer.”\nNow steady on old chap. Let’s not get carried away …\n\n","date":"November 7, 2014 at 4:31 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169525","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Colin- I don’t know how far your study of fourteenth century art has gone.\nIn my article I give two examples of linens whose images have faded since they were painted in the fifteenth century. They survive because half the image is still intact. In most cases when the images are faded altogether they will have been thrown away.\nSo we know beyond any doubt that linens painted in the medieval period can fade. When I read the many accounts that describe a painting vivid in blood, one that was even thought to be recent ,I have no problems in suggesting that the Shroud was one of these now faded linens. This is a hypothesis that I leave you and anyone else to challenge. It is the best fit explanation of the Shroud we have today- the one that is closest to the documentary evidence.\nI think that some of the contributors here do not know much about medieval art. I would suggest an I.introduction such as the Oxford History Of Art which has excellent reproductions that show that those paintings that have not faded are amazingly Bright. This morning I was viewing a Giotto Madonna and Child – early fourteenth century no less. It comes from the Uffizi gallery in Florence but it was damaged in a terrorist attack in 1993 but has now been restored. It is travelling around Italy being shown off  and it looks wonderful although they have left one hole in the canvas as a record of the attack on it. The colours are bright and the Virgin Mary sits on a bright red cushion. It this had been blood it would have been shocking but because it just a cushion we just admired the vivid redness of what is probably vermilion.\nWhat I find extraordinary, indeed incomprehensible, is why you think that the Shroud was not originally painted as richly as this. I have read a lot about medieval art as I have to lecture to groups on it in front of paintings and I have never heard of anyone creating a painting with scorches ,etc. Why would they want to when there were so many painters around who would create the real thing for observers to see.\nSome posters seem to think it was extraordinary that people came to see the Shroud at Lirey but in the years after the Black Death with half the population dead there was a frenzied rush towards new relic cults. It does not seem that the Lirey cult lasted very long before the bishop closed it down and, as we know, when expositions began again in 1390 it was made clear that this was not the authentic grave cloth but could still be venerated. Pope Francis is following in this same tradition.\nIf Francis’s face had left an imprint on the cloth, what would it have looked like. Certainly not like the face of the man on the Shroud!!\n\n","date":"November 7, 2014 at 8:07 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169568","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"From wiki: (my bolding)\n“In 1389, the image was denounced as a fraud by Bishop Pierre D’Arcis in a letter to the Avignon Antipope Clement VII, mentioning that the image had previously been denounced by his predecessor Henri de Poitiers, who had been concerned that no such image was mentioned in scripture Bishop D’Arcis continued, “Eventually, after diligent inquiry and examination, he discovered how the said cloth had been cunningly painted the truth being attested by the artist who had painted it, to wit, that it was a work of human skill and not miraculously wrought or bestowed.” (In German:. The artist is not named in the letter.”\nAll that controversy, all those references to fraud, especially  “cunning” work, for a bog-standard painting on linen, that was perceived at the time as anything but bog-standard. \nGet real.  Like the image itself – a  real-looking negative  IMPRINT – not a mere positive painting, and thus seen by  some in the Church as a blasphemous attempt to pass it off as the real bodily imprint?\nAs the Wimbledon whinger once said:  “You CANNOT be serious”.\nWhere the TS is concerned, forget about the then extant trends in art – except maybe for blood additions, or ‘touching up’ that may well have used applied paint. The body image itself cannot be claimed to be paint unless you have compelling scientific evidence to back that up (which you don’t).  It didn’t need to be paint, if the aim had been to trump the Veil of Veronica with a simulated negative sweat imprint.\nOh, and please see what wiki says about that Veil, a major icon of the era (wiki)  that curiously receives not a single mention in your article. That’s despite art historian Neil Macgregor writing that “from the 14th century on, wherever the Roman Church went, the Veronica accompanied it.” \n14th century note. Ring any bells?\n\n","date":"November 7, 2014 at 8:38 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169575","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Colin, Amazingly some people will believe anything and the traumatised 1350s were full of relics that had no relation with the gospel accounts of the objects involved. No one who originally created the Shroud would have expected anyone to think it was the real burial cloth and would have been amazed and probably embarrassed when he heard that some pilgrims had been conned into believing it was.\nI can trace an acceptable journey for the Shroud from say1325 as seen by many as having bright colours of blood, painted on the outer fibrils as advised and woven on a medieval treadle loom. All this is supported by experts and when you have other faded linens then there is a plausible scenario to explain the present state if the Shroud.\nThe ball us in your court to set out an alternative method of creating the images, which explains why these images were created as they were and why a totally unrecorded method of making images, one that could remain chemically unchanged for seven hundred years, was used, probably uniquely in this particular case. I simply cannot understand why anyone would have done this so look forward to your reply.\nThousands of fourteenth century art works survive, many much decayed and faded, thousands of art historians have been working in them so your researches if successful will surely make your name.\nIn contrast , people are simply saying to me ‘aren’t you stating the obvious?’ And I won’t  get any prizes. So grasp your chance to become famous in the medieval  art history world while you can!\n\n","date":"November 7, 2014 at 11:11 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169602","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Charles: having sired two sons, both of whom read history at University (St.Andrews/Nottingham)  both of whom when asked questions re history reply with “Sorry, not my period”, you must forgive me for saying I’m no longer intimidated by historians.\nAs for “making my name”, I had a brief taste of that in the 80s, including a feature  on my resistant starch work in the Independent ‘s weekly Page 2 science slot, penned by resident science writer John Emsley after being invited for interview at his home base  (Kings College London). \nSeventy years on this planet, 55 of them captivated by the quirky scientific method, has taught me one thing Charles. There is no substitute for the gradualist approach, regardless of the time factor, regardless of fickle mass media interest. The important thing is to get things right, albeit with what some might consider slow, methodical snail-like progress. \nWho’s in a hurry for results? I’m not. Plenty of fresh air, exercise, sunshine, good diet, a loving wife makes it probable I’ll still be be taking potshots at the TS simplifiers like (dare I say) the Charles Freemans of Shroudology for quite a few years to come.\n\n","date":"November 7, 2014 at 11:45 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169611","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“It must have been a very special kind of paint to have caused all those pilgrims to flock to Lirey in 1355.” Not necessarily. I would need an expert on relics to confirm this (with referenced examples, of course), but I don’t get the feeling that the appearance of a relic had much to do with its credibility until well into the Age of Enlightenment. After all, if God wanted to make an image of himself miraculously, he could just as easily have produced an obvious painting as the faint image we see today. In some ways, indeed, the less probable the outcome, the more credible the miracle. Healing someone with a slight cold, or the feeding of the five people, or producing a barely discernible image on a cloth doesn’t seem quite as potent as resuscitating a corpse, feeding a small city, or producing a brightly painted picture. No, what mattered was ecclesiastical approval, the more bishops the better.\n\n","date":"November 7, 2014 at 8:02 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169567","author":"Hugh Farey","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David Mo you most misleadingly wrote: \n“All the expressions of de Lalaing and the Liege’s comission imply that the image was more visible, it is to say, more enhanced of colour than now is.” \nTOTALLY FALSE!\nDavid Mo have you ever read my correction of ‘your November 6 2014 comment’? You should have.\nOn November 6, 2014 at 12:04 pm, I wrote: \n“Davd Mo, you misleadingly wrote:\n« On le voit »= One can see him , Jesus our Redemptor « all his very holy body » as “if the thing was made today”.\nThen AGAIN (as usual!) you are misrepresenting what the author (here Antoine de Lalaing, Lord of Montigny) really wrote in Middle French! He actually wrote:\n“On le voidt clérement ensanglenté du trés précieux sang de Jhesus, nostre Rédempteur, comme se la chose avoit esté faicte aujourd´hui.”\nTHAT IS:\n“You can clearly see IT (= the Shroud, my upper cases, NOT ‘HIM’!?) covered in the most precious blood of Jesus Our Redemptor as if the thing had happened today”.\nThe above sentence doesn’t refer to Jesus’s whole imprint of his most holy body (l´imprimure de tout son trés sainct corpz) but to his blood on his Shroud!\nJust because you cannot correctly read Middle French you consequently misrepresent the author’s opinion to have him say what he actually didn’t say in order back up Charles’s TS man’s body flaking-off paint pseudo-theory!\nSTILL TODAY, observers do find the intensity of the bloodstains quite surprising as if the TS man’s blood had been shed just the day before…”\nRe how blood can have been kept red on a two thousand years’ cloth, I repeat:\nNatural mordanting of dried off blood and urea residues — resulting from tightly wrapped-up bloodied corpse remoistened via  aqueous alkaline solution in-soaked long narrow inner shroud and subjected to (myrrhic-?)aloetic (wood aloe) fumigation to dry out in extra height — could account for theTS aged bloodstains’ surprising intensity (i.e. still looking fresh today on the long inner burial cloth as if the blood had just been shed the day before) since: \n– Mordant is well known to be used for INTENSIFYING STAINS e.g. in cell or tissue preparations \n– It is well known too gelatine is a breakdown product of collagen. Now potassium gives only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) is giving strong signal. The true fact is low temperature (55°-85° C) alkali gelatinisation of starch residuals present in the ancient linen cloth could be a possible factor  to be taken into account in the Shroud image formation process in terms of bubbling printing paste\n– Bilirubin is neither the problem nor the solution here, just probably one part of the whole equation.\nReminder: The evanescent nature of the body image of Christ on his sindon was known more than eight centuries ago at least! In 1207 CE, the Sindon of Christ that was kept in Constantinople and had got stolen is said to “[have] wrapped the elusive (= un-outlined) dead naked body (of Christ).\n\n","date":"November 7, 2014 at 10:39 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169589","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Just in case David Mo could miss it:\nOn November 7, 2014 at 11:28 am, I wrote:\nDavid Mo,\nyou just cannot correctly read (and translate) Middle French!\nThe two sentences read: \n“C´est la rice syndont et noble Suaire acheté par Joseph d´Arimathie, long de seize à dixsept pieds, large de sept pieds ou environ, où il l´ensepvelist avec Nycodesme quand ils le eurent ostet de la croix. \nOn le voidt clérement ensanglenté du trés précieux sang de Jhesus (…)”\nYou can see it = You can see the rich sindon and noble Shroud (clearly covered in the most precious blood of Jesus)\nHere “On le voit” = On voit le rice syndont et noble Suaire (clérement ensanglenté du trés précieux sang de Jhesus).\nHere “le” as pronoun refers to ” le rice syndont et noble Suaire” NOT to Jesus!.\nSorry, your translation is totally biased and does misrepresent the author’s opinion. Period.\n\n","date":"November 7, 2014 at 11:34 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169608","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Reminder:\nRe the physical development of marks on a linen fabric, the aqueous alkali solution fumigation is the simplest technique for the development e.g. of latent coinprints (originally smeared with blood) and body imprints on textile substrates providing the linen fabric are first in-soaked with the said solution. There is no need at all of painting or paint flaking off!\n\n","date":"November 7, 2014 at 11:45 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169612","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"You know what? I’m inclined to follow Max’s translation, but not for the reasons he gives. It seems to me that if the contentious “le” in “On le voidt clérement ensanglenté du trés précieux sang de Jhesus” referred to Jesus, then it would not be necessary to use the phrase “de Jhesus” after “très precieux sang.” The wording of the sentence would more likely be: “On le voidt clérement ensanglenté de son trés précieux sang.”\nOn this point then, I think I must reply Thomas’s request for clear contempory written evidence that the shroud was brighter than it is now by saying that although some are indicative, none that I have seen yet are unequivocal.\n\n","date":"November 7, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169625","author":"Hugh Farey","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“On le voidt clérement ensanglenté du trés précieux sang de Jhesus” referred to Jesus, then it would not be necessary to use the phrase “de Jhesus” after “très precieux sang.”\nProbably you are right, Hugh. But I think we have been setting the problem out badly.\nImagine you read this: \n In the cover of the first edition of the book a vampire is painted. A flood of bright blood is running from his sharp canines. The vampire is a handsome man. We can also see that he is dark-haired, his eyes are awfully opened and he holds in his left hand a silver crucifix.\nCan you think that the vampire is a black man? Of course, not. I have selected the most relevant features of the portrait of the vampire. If he were black skinned I would have said this. \nNow, your attention, please. One of the most relevant features of the current aspect of the Shroud is its faded colour and the unnatural colour of blood. No witnesses of the early years of the Shroud mentions it. They spoke of the bright colour of the blood (as painted) and then mention some visible features of the body. \nSo, we mustn’t demand for an explicit mention of the coloured body, but for a mention to the faded aspect of it. And we have no reference of it!\nThe sindonist fellows of this forum are subtly inverting the proceeding with a typically incorrect sindonist way of thinking. \n“He said there was a dog. He didn’t say the dog wasn’t green. Then, the dog was probably green”. A fallacy.\nWhat we ought to questioning is why the early testimonies spoke about some features that now are invisible. The five wounds of the body, for example. This raises a problem and two possible answers: \n-The witnesses don’t say what they are actually seeing but what they remember or think they are seeing… In sum, they are not reliable.\n– In the early times of his wandering in Europe the shroud was retouched. \nI think very difficult to discern which of the two answers is more plausible. Perhaps a mixture.\n\n","date":"November 8, 2014 at 2:35 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169750","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Clare nuns, 1500s:\n‘Traces of a face…’\n\n","date":"November 8, 2014 at 2:58 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169755","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Trace: Copy (a drawing, map, or design) by drawing over its lines on a superimposed piece of transparent paper.\nYes,\n\n","date":"November 8, 2014 at 3:10 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169759","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Collins concise:\nTrace: a mark or other sign that something has been in a place; vestige,\nYes.\n\n","date":"November 8, 2014 at 3:13 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169761","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David\nWhat is your point?\nI and most people here know what a trace is.\nIn the context of the Shroud, it is again suggestive of a facial image that is faint, rather than prominent.\n\n","date":"November 8, 2014 at 3:20 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169765","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I don’t know what do you men with “in the context of the Shroud”, but I can imagine it.\nI’m sorry but the main meaning of “trace” doesn’t implies any “faint”. This is your particular invention. Or better said “the context of the Shroud” invention.\n\n","date":"November 8, 2014 at 5:31 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169794","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Thanks Hugh.\nAnd so, do you think that two of the earliest depictions (1516, 1568) which show the Shroud as a faint image – like today – are in fact attempts to depict the faint image?\nOr do you think their faintness results from their paint flaking off / fading, as Freeman does?\nNo fence sitting please!\n\n","date":"November 7, 2014 at 3:25 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169648","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“No fence sitting please!” Ooh, you know me better than that! I have already discussed some of the evidence which casts doubt on the idea that the Shroud’s image was ever clearly defintiive, in the form of the hopelessly variable inaccuracies of the numerous depictions of it (November 6, 2014 at 4:23 am). However I don’t go along with the idea that the blood is as clear now as it ever was. It is obvious to me that most of it has flaked off, leaving minute fragments jammed into the interstices of the threads. It’s pinkness is another unusual feature that I have not found adequately explained by any natural phenomenon. The ‘red bilirubin’ hypotheses or the idea that blood stays red when applied to saponaria are currently unconvincing, partially because although easy to confirm, no photos of the many experiments claimed to have been carried out seem to have been taken, which I would have thought were a sine qua non.\nSo if blood can flake off, why not paint? Well, I find it odd that not a single flake remains, but then I wonder what we’re looking for? Walter McCrone painted a variety of cloths with iron oxide, which, as I have found out for myself, doesn’t form flakes. Nor, I suppose would other pigments. They are minutely particulate. If they were, by accident or design, inadequately fixed because of inappropriate binder, then, like the blood, they might be reduced to a rather thin covering, mostly jammed between the fibres or threads, rather as McCrone claimed to have discovered. I would need someone experienced in medieval art to help before I speculate much further down that line of exploration. Another reason why all the paint could have fallen off would be that it formed really big flakes (glued together by gesso?) maybe the size of a fingernail. After a fair number of these had fallen off with age, rendering the Shroud distictly patchy but with an unforseen under-image, it would be a simple job to complete the job with a fingernail!\nSo, what do I think? What did you expect? I really don’t know!\n\n","date":"November 7, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169654","author":"Hugh Farey","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Come on Hugh! The 1516 and 1568 depictions clearly try to portray the Shroud’s faint image!\n\n","date":"November 8, 2014 at 1:33 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169738","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Relatively fainted. More fainted the 1568 than the 1516 copy, but lees than now. Both with five bounds, as de Lalaing and the clarisses said. The hair falls till the shoulders (also clarisses).\nBut the clarisses sisters said some parts of the body (nose and hands) were clearly marked.\nSlippery slope for sindonism.\n\n","date":"November 8, 2014 at 3:05 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169757","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"why?\nthese early images clearly show the Shroud image as faint in the 1500s. Albeit with features quite evident, as they are now despite faintness!\nTotally defeat Freeman’s theory of a once prominent painted image.\nNot a slippery slope at all!\nThe later more prominent painted depictions were clearly an effort to show the detail of the Shroud image. The equivalent of today’s digital enhancement!!!!\n\n","date":"November 8, 2014 at 3:12 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169760","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Typo: Clarisse sisters. “Clarisses” is catalan.\n\n","date":"November 8, 2014 at 3:24 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169767","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"“Totally defeat Freeman’s theory of a once prominent painted image.”\nWhat a triumphalism!\n\n","date":"November 8, 2014 at 3:20 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169764","author":"David Mo","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"yessssssssssssssssssss\n\n","date":"November 8, 2014 at 3:34 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169768","author":"Thomas","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"I believe that the descriptions of the Shroud by observers and the depictions that show features such as the Crown of Thorns on the head, now faded leaving the top of the head rather fuzzy looking, are convincing evidence, enough for me to work from there and  begin researching other aspects of the Shroud’s history to see if any contradict this approach. None found so far .\nAnyone who has been lucky to see some of the great medieval art of the fourteenth century will not have any problem in recognising the bright colours of paintings of that period( well certainly the ones that have been lucky enough to have been preserved over seven hundred years without fading!)\nThis morning back home after several days of total self-indulgence ( without a tour group to lecture to)  in Lucca and Pistoia looking at medieval paintings in their original settings, I began to think how would one ,as a historian, START exploring they over – hyped ( by STURP and the National Geographic as well as others)  ‘ mystery ‘ of  the Shroud.\nFirst things first. How is it woven? It must have been woven first before we even get onto to the images – unless the images existed as a sort of holograph onto which a cloth drifted and held them down! There is absolutely no problem  in making the Shroud on a medieval treadle loom , first known in Europe from about AD 1000. The width is typical as the weaver could not stretch further than about 130 cms. The length is fine as these looms allowed the cloth to be rolled around a rod at the top and certainly could go further than 430 cms. The use of treadles to manipulate the shuttles to create a three-in-one herringbone is also possible and certainly much easier to effect than in any known ancient loom.\nSo if you want to challenge this please provide an ancient loom that can weave a cloth similar to the Shroud.\n And then there is the issue of the Z spin of the yarn that places the linen into the  Western Mediterranean…\nSo one STARTS  with the hypothesis that is a medieval cloth . It is important to establish such hypotheses that are fairly basic and then challenge people to overthrow them.\nAnd all this BEFORE we have got round to putting the images on . . .\nI leave it to the surviving members of the disbanded STURP to make their defence  but my point is that they did not sit down and start with asking the basic questions that one needs to START with and so have misled us all by making the Shroud  a totally unnecessary  mystery.\nNow that people are talking to me about this, I simply say I am not taking any credit for taking the approach that any professional historian/ archaeologists/ art historian  would have taken start with the basics – in this case the weave – from which all else follows.\nMeanwhile whatever is happening on this site, life moves on as others are beginning to become involved.\n\n","date":"November 8, 2014 at 3:55 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169772","author":"Charles Freeman","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Hugh, \nwhat do you make of  Mesarites’s 1207 CE  eyewitness description? He said the Sindon of Christ that was kept in Constantinople and had got stolen \n“[had] wrapped the elusive (= un-outlined) dead naked body (of Christ)” (meaning the latter had blurred outlines)?\nNOTHING! I\nWhat do make of this literary synthesis of eyewitness descriptions prior to the 12th c. CE: \n“[When] raised upright, not only the image of the glorious features of the Saviour’s face with dripping drops of blood shine[d] out but also the form and most noble stature of his entire body hanging down from the cross and embellished with drops of blood and water that make the liquid flow from his own side, could be plainly seen. This [was] not the art of the painter and the various beautiful colours, which provide a door for the mind to consider the original and depict images [that could possibly have depicted] the reflection of his appearance and size imprinted on [his sindon]. [So much so] the ‘not-made-by-hand’ image of Christ and G-od, draped with a white/pure linen cloth he had worn, was sufficiently in lieu of the vision of the Lord coming into the flesh to those who had not corporally seen him.”\nNOTHING!\n\n","date":"November 7, 2014 at 6:10 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169668","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Yeshua’s body imprint was and is STILL ghostlike.\n\n","date":"November 7, 2014 at 6:12 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169669","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"…while his blood STILL looks a if it had been shed just the day before…\n\n","date":"November 7, 2014 at 6:30 pm","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169671","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"David Mo, as self-proclaimed hermeneutist of Late Medieval and Middle French Shroud literature who TOTALLY keeps overlooking pre-1207 CE Shroud literature, wants us to believe the TS man’s body image originally was neither faint nor evanescent when he just cannot correctly read both Late Medieval Latin (see June 1390 CE final version of the Papal bull) and Middle French! This is not serious! Could Mr David Mo do his your homework before passing comments, PLEASE?\n\n","date":"November 8, 2014 at 4:19 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169779","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Reminder:  pre-1207 CE eyewitness descriptions read: “not only the image of the glorious features of the Saviour’s face with dripping drops of blood shine[d] out but also the form and most noble stature of his entire body”. Now one of the TS body image characteristic is definitely its translucent straw yellow coloration…\nOn September 25, 2014 at 4:16 am, I wrote:\n“Hugh (and Charles)’s so-called “medieval painter” was “painting” with stuctural colour (see the TS fairly transluscent volumetric body image), limestone-dust (Jerusalem/meleke or malky/royal limestone?), a crucifixion victim’s sweat (see the TS body image straw yellow coloration) and blood (as if shed from the day before)… HOOOOOOOOw clever! \nHugh (and Charles) methinks you just cannot discriminate between real crucifixion victim and\ncrucifiction…\n\n","date":"November 8, 2014 at 4:34 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169782","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Could Hugh and Charles tell me how many medieval ‘paintings’  of Christ Shroud or copies do show translucent straw yellow colored Christ volumetric face and body image that can ‘shine out’ on ostensions?\n\n","date":"November 8, 2014 at 4:45 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169785","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Hugh and Charles,\nJust guess why a 1200s CE and 1300 CE Greek threnoi epitaphioi (symbolic of Christ Shroud) are gold-thread embroidered and showed a herringbone pattern? Why threnoi epitaphioi depict both a lying and upright Christ? Guess why two giants among Byzantine scholars, namely Kitzinger and Belting, claimed the TS had influenced the threnoi epitaphioi composition as early as the 1200 CE?\n\n","date":"November 8, 2014 at 5:15 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169788","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Just guess why the Grandson altar frontal two archangels wear a long narrow herringbone weave patterned robe as loros BOTH symbolic of Christ’s Shroud AND evocative of the long narrow herringbone weave patterned burial cloth now kept in Turin?\nCan you account for this most intringuing departure of the traditional depiction of the Byzantine imperial ceremonial robe that used to be lavisly adorned with precious gems and pearls? Why all of a sudden (in the 1270s C) such an austerity and simplification in its depiction?\n\n","date":"November 8, 2014 at 5:27 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169792","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Typo: crypto-volumetric\n\n","date":"November 8, 2014 at 5:18 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169789","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Charles and Hugh, where are you when it comes to meet and give a substantiated answer to those questions?\n\n","date":"November 8, 2014 at 5:33 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169795","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Charles and Hugh’s ostrich policy as far as the Constantinople Sindon is concerned and David Mo’s misrepresentation of the Late Medieval and Early Renaissance literary evidence as far as the TS is concerned are just appalling!\n\n","date":"November 8, 2014 at 6:23 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169812","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"The TS is NOT to be seen as a painting, given its negative character.  It’s to be seen as an IMPRINT, almost certainly a CONTACT IMPRINT. In a non-authenticity model that does not necessarily mean it was produced as a contact imprint, e.g. off some kind of applied bas-relief template (though it may well have been, given its 3D properties. It’s just conceivable that it was painted freehand in a manner as to make the image SEEM like an imprint. But there again, the artisans would not have considered themselves restricted to classical artists’ pigments, if as seems probable the aim was to produce an image that would not be instantly regarded (and just as quickly dismissed) as merely a flight-of-fancy painting on linen. \nSo whichever way you look at it, there’s no justification whatsoever for making any assumption, either a priori or from Charles’s post hoc review of  what he terms “interlocking” evidence, that the image was painted. \nIn any case, it’s grossly unscientific to assume (without independent evidence) the present image is what’s left when the paint has ENTIRELY flaked off. Why the survival of 3D properties if that had been the case? Why the STURP evidence based on diimide-bleaching, reflectance spectroscopy etc that the body image comprises dehydrated linen carbohydrates? Why should a coating of gesso and paint have produced chemical changes that in the laboratory require elevated temperature or dehydrating acids such as H2SO4. Why all the focus on blood, which may well have been partly or totally paint when the real challenge, not to be ducked, is the subtle BODY IMAGE aka IMPRINT that caused consternation when first displayed at Lirey? \nThis entire paint thing is an attempt to bury well over a century of image analysis, starting with Secondo Pia’s amazing photographic ‘negatives’ that restored the TS ‘positive’. Classical paintings do not do that, not even faded or flaked-off ones, correction least of all leaving scarcely-visible (when viewed up close) low-contrast remains.\nIt’s getting on for 9  months since I first floated the idea that the TS was fabricated as a simulated sweat imprint, a whole-body front-and-back version of the then celebrated Veil of Veronica. I don’t recall hearing any significant objections to that proposal, not from Charles Freeman nor anyone else for that matter.  I hesitate to say this, but what’s the point of posting one’s ideas to a specialist web forum if one gets absolutely no detailed feedback, either positive or negative?\n\n","date":"November 8, 2014 at 5:38 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169796","author":"Colin Berry","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"See new posting Colin Berry Wants Feedback\n\n","date":"November 8, 2014 at 6:05 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169802","author":"Dan","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"The TS image does look like a light scorch or pre-scorch yet it is not a scorch per se. Most likely It is a natural mordanting of remoistened dried off urea residues and remoistened freshly dried or half dried blood (via use of an alkali solution to soak in the linen fabric and followed by fumigation of the tightly wrapped up corpse placed in extra height first on its left and then right side).\n\n","date":"November 8, 2014 at 6:07 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169806","author":"Max patrick Hamon","site":"shroudstory"},{"title":"A Couple of Terrific Comments About Charles Freeman’s Article","post":"Re the use of the word traces or stains in conjunction with the TS bloodied body imprint whether these can be qualified as faint or clearly visible, had David Mo seen either sub vitro in situ cathedralis torinensis or without glass interposition and in full light, he just could not have missed the fact the body traces or stains are faint while the blood traces or stains are more visible and whether you stand closer or farther, the dorsal and ventral body images can fade out completely.\nHere’s the eye-testimony of Barbet, he wrote: “in full daylight, without any glass interposition, at a distance of less than one meter (it looked like) a dried blood that had soaked the cloth. It wasn’t like it for the rest (of the image), brownish STAINS (upper cases mine) on the Shroud reproducing the relief of a corpse.”\nThe visual fact is traces or stains whether of blood or body can be more or less visible depending on lighting conditions and observation distance.\n\n","date":"November 8, 2014 at 7:06 am","url":"https://shroudstory.com/2014/11/04/a-couple-of-terrific-comments-about-charles-freemans-article/","cat":"article","id":"comment-169819","author":"Max patrick Hamon","site":"shroudstory"}]
