[{"title":"BBC News Magazine:  The Perplexing Image","post":"“…its authenticity. The Catholic Church takes no official position on that….  Ever since radiocarbon dating in 1989 proclaimed the linen to be roughly 700 years old, the Church has avoided claiming that it is anything more than an icon…”\nThis is absolutely untrue, as I have quoted the last 7 Popes in threads here before: \nPope Pius XI:  “… certainly not the work of any human hand.”\nPope Pius XII:  “The linen in which Joseph of Arimathea enveloped the sacred remains of our Lord Jesus Christ.”\nPope John XXIII:  “This can only be the Lord’s own doing.”\nPope Paul VI:  “…The image from the Holy Shroud reveals to us the human and divine personality of Christ.”\nPope John Paul II: “The Holy Shroud is the most splendid relic of the Passion and Resurrection.”\nPope Benedict XVI:  “…should be seen as a photographic document of the darkest mystery of faith — that of Christ’s crucifixion and resurrection.”\nPope Francis I:  “By means of the Holy Shroud, the unique and supreme Word of God comes to us.”\nThe RC Church is an absolute monarchy, in no uncertain terms.  The Popes speak for the Church on matters of Faith.  The Popes have spoken on the Shroud. \nLet the skeptics at BBC chew on that for a while….\n\n","date":"June 19, 2015 at 7:41 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202777","author":"Nabber","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"Good quotes, but the Pope certainly does not speak for the Catholic Church except in very rare circumstances, and although the first four Popes you quote I believe did personally believe that the shroud is authentic, I am less certain about the last three (including Pope Francis), and do not feel that that their public pronouncements are as clear regarding their personal opinions as you think. In fact, I think they have been carefully worded not to. They all, of course, thought the Shroud to be a very important artefact with significant relevance to the revelations of Christ, but that is not the same thing as pronouncing on its authenticity.\n\n","date":"June 19, 2015 at 8:19 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202782","author":"Hugh Farey","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"I completely agree with Hugh. Excellent summary Mr Farey.\n\n","date":"June 19, 2015 at 10:09 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202803","author":"PHPL","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"Well it was John Paul II who authorised the publication of the radiocarbon results( according to Gove).\nOne also has to remember that in earlier times any pope who ddeclared the Shroud authentic was also saying that the many other contenders were not authentic- unless you believe in the two Shroud theory. This is one reason why the popes tended to be ambivalent , allow indulgences, talk about veneration as a reminder of the Passion, etc, without actually saying this is the real thing!\nIn 1460 the Holy Blood of Mantua was given an authenticity certificate by the pope . That was hardly a problem as you had lots of relics claiming to be the blood of Christ in the fifteenth century and declaring one authentic did not necessarily diminish the authenticity of the others- there was enough blood to go around. The Shroud is in a different category  and the more work I do on relic cults the more I think it unlikely that the popes were prepared to go further than an indulgence, feast day, etc in line with many other sacred objects.\n\n","date":"June 19, 2015 at 10:18 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202804","author":"Charles Freeman","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"Probably several years ago the Christian Faith told you that the heritage of original sin is universal (apart the Mother of God) … and then also the Popes are not excluded from this sad heritage.\n— —\nBut such kind of arguments don’t solve our concrete problems of Materials Science.\nFor example:\nDo you know what is the difference about the elastic deformation (a near instantaneous phenomenon) and the viscoelastic deformation?\n— —\nInstead I think we have to deal with degree of polimerization of cellulose, with mechanical properties of linen fibrils, etc.\nThe mechanical properties of materials are determined experimentally.\nSo, we have to be skilled in Applied Microscopy, in Structural Mechanics, in Applied Statistics.\nThen…\nDo you know what are the AFM controls?\nDo you know what are the “AFM bending tests”?\nDo you know what is the normal elastic modulus (Young’s modulus)?\nDo you know what is the Probability Calculus?\n— — — —\nLinks:\nhttps://en.wikipedia.org/wiki/Viscoelasticity\nhttps://en.wikipedia.org/wiki/Dynamic_mechanical_analysis\n— —\nSee also the interesting possibility to improve the past study by Fanti Giulio and Malfi Pierandrea:\n“A new cyclic-loads machine for the measurement of micro-mechanical properties of single linen fibers coming from the Turin Shroud”\nLink:\nhttp://www.aimetatorino2013.it/cdrom/cdrom_pdf_fullpaper/001200008502.pdf\nDo you know what is the Loss Factor relative to the last complete loading cycle representing the dissipated energy?\nWe have read the meaning for the ratio eta where D and U are respectively the dissipated and stored energies during a whole loading cycle.\nDo you know what is the Loss Factor relative to the last complete loading cycle representing the dissipated energy?\nThen I believe you can also try to consider the ancient tapestry (…and your interesting ancient paintings…) and the proper methods for measurements of their mechanical properties during cycle loading …\n— — —\nIn any case I hope you want to use the experimental paintings (see also: How to solve the problem for the choice of adequate ageing treatments?) and then you do not go to ruin ancient and valuable paintings …\nBut You must keep in mind that I am always quite contrary to destructive tests. Then see also the problem: How to modify the cycles of failure used by Prof. Fanti … without breaking the material?\nThen I think we have to choose another way in order to avoid the breakings and save the precious material.\n\n","date":"June 19, 2015 at 11:33 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202813","author":"piero","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"HF:  “the Pope certainly does not speak for the Catholic Church except in very rare circumstances”.  \nThis is absolutely, positively WRONG.  \nYour statement only refers to the Pope speaking “ex cathedra” on matters of Church dogma, which are rare.\n“The Church’s magisterium is exercised in cases not having the solemnity of “ex cathedra” statements by Popes, in written documents such as Papal catechisms, encyclicals and pastoral letters, or orally, as in homilies. These statements are part of the ordinary magisterium of the Church.”\n“the response called for from Catholics, to this ordinary magisterium, is that of the Religious Submission of Will and Intellect. This kind of response cannot be simply exterior or disciplinary, but must be understood within the logic of faith and under the impulse of obedience to the faith.”\nHF: “[the Popes’ words that] …the Shroud to be a very important artefact with significant relevance to the revelations of Christ, but that is not the same thing as pronouncing on its authenticity.”\nIf the Popes’ words were “carefully worded” and “not the same thing” then how do you square the words of the last 3 Popes with that?\nPope John Paul II: “The Holy Shroud is the Most Splendid Relic of the Passion and Resurrection.”\nPope Benedict XVI:  “…should be seen as a Photographic Document of the Darkest Mystery of Faith — that of Christ’s Crucifixion and Resurrection.”\nPope Francis I: “By means of the Holy Shroud, the Unique and Supreme Word of God comes to us.” \nVery, very definitive except to the most blind and deaf of skeptics…..\n\n","date":"June 20, 2015 at 9:00 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202924","author":"Nabber","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"Quite so, Nabber. Perhaps I took your words too literally. However, the ‘ordinary magisterium’ to which you refer, quite properly, calls for a response “of the Religious Submission of Will and Intellect. This kind of response cannot be simply exterior or disciplinary, but must be understood within the logic of faith and under the impulse of obedience to the faith.” This does not mean that the Pope’s pronouncements about the Shroud are the teachings of the Church, nor that any Catholic is required to believe them. As for your quotes, John Paul’s use of the word ‘relic’ would, I agree, imply that he personally thought that the Shroud was authentic, so before I go on, could you refresh my memory as to when he said it?\n\n","date":"June 20, 2015 at 10:06 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202930","author":"Hugh Farey","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"When the popes speak about the Shroud it is their personal opinion and these are not ex cathedra statements. Canonisation is more important to the Church.\nThe BBC report is outdated in some ways and failed to take all recent research into account. It is even biased. Only those statements by Ray Rogers that were convenient to them were cited.\n\n","date":"June 19, 2015 at 11:26 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202812","author":"Louis","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"You are quite wrong.  Read my statement about the ordinary magisterium above.\n\n","date":"June 20, 2015 at 9:01 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202925","author":"Nabber","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"Are “Shroudies” afraid of the dark or have found the light?\nhttps://www.yahoo.com/tech/s/stephen-hawking-waxes-dismal-time-134642584.html\n\n","date":"June 19, 2015 at 3:32 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202832","author":"Louis","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"I’m sure someone, not so very long ago, would have likewise thought human travel to the moon would be impossible, same for computers in our phones, or video chats with someone in real time across the globe, or 3D printers. What seems impossible today may be possible in a generation. Earth isn’t just our home, it’s our home base.\n\n","date":"June 19, 2015 at 3:49 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202837","author":"David Goulet","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"Buland Darwaza, the “Gate of Magnificence”, the highest gateway in the world, was built by Akbar, the Moghul (Muslim) emperor of India in 1576.\n\nIt has an inscription at the entrance, which reads:\n “Isa (Jesus), son of Mary said: ‘The world is a Bridge, pass over it, but build no houses upon it. He who hopes for a day, may hope for eternity; but the World endures but an hour. Spend it in prayer for the rest is unseen.'”\n\n","date":"June 19, 2015 at 4:40 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202840","author":"Louis","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"Thank you Louis. I went to Agra but I couldn’t go to see this monument. One day Stephen Hawking will reincarnate. Then he will realise that there is a after life. Actually I have met 3 people who remembered their past life.\nI hope that one day Catholic Church  will certify that Shroud of Turin is a genuine burial cloth of Jesus or before that scientists will confirm it.\n\n","date":"June 19, 2015 at 5:42 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202846","author":"Sampath Fernando","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"Hi Sampath\nYou’re welcome. Akbar had three wives, one was an Armenian Christian, and he was an “ecumenical-minded” Muslim emperor in a largely Hindu country. That is why he began mixing beliefs. These “words of Jesus” sound as though they came from an apocryphal Gospel, but they didn’t. They were probably made up after some discussion in the royal court because although “the world is a bridge, pass over it” would be in keeping with what Jesus said, “for the rest is unseen” is not.\nI’m sorry I have to disagree with you about “past lives”. In one of the courses I did in Parapsychology there was a demonstration using hypnotism. The parapsychologist was a very serious scholar, a Catholic priest who was awarded a gold medal for helping parents who had a child with down syndrome.\nHe asked volunteers to come to the stage, but no one beyond 25 as heart problems could develop during the process. He chose some 7 out of the 25 volunteers after they turned their backs to him. This was done mentally, and the 7 fell on the floor in an instant. This is called regression.\nIn one case he took the unconscious of a 15-year-old girl right upto her grandfather in minutes and she could “see” him sitting in the middle of trees and reading a newspaper.\nHe asked her to tell him what he was reading, but she couldn’t, perhaps because a lot of mental force was required and she was very young. He then asked the audience if her parents were around and they were there. Her father confirmed that his father (and her grandfather) was a landowner and liked to read. This example is in keeping with what we learn from the Bible, not reincarnation.\nPeople sometimes talk about “past lives”, but they are actually mental images stored in the subconscious/unconscious. There was a very interesting discussion about this topic when Dr. C.T.K. Chari (Madras Christian College, India) challenged Professor Ian Stevenson (University of Virginia, USA), who was writing in favour of reincarnation but was suspected of “stage managing” cases in Sri Lanka.\n\n","date":"June 19, 2015 at 6:22 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202849","author":"Louis","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"I’ve often wondered if the ‘past lives’ phenomenon is some form of memory transferred through the genes. We inherit certain characteristics from our parents and grandparents, why not pieces of memories as well – microbits hidden in the DNA? There is so little we know about our brains, I suspect one day we’ll find these memory genes that link us more than we’d realized to our forbearers.\n\n","date":"June 19, 2015 at 9:15 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202867","author":"David Goulet","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"We inherit talents, tendencies, traits and só on from our ancestors.\n\n","date":"June 20, 2015 at 7:15 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202915","author":"Louis","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"Thank you Louis. I am not agreeing or disagreeing with you. To understand Miracles, Resurrection, Creation of image on Turin Shroud, NDE, reincarnation we need some sort of divine inspiration.\n\n","date":"June 19, 2015 at 9:39 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202870","author":"Sampath Fernando","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"You’re welcome, Sampath. If you believe in Jesus’ resurrection it will help in your quest for the truth and also in understanding what is being saíd in the realm of Shroud studies. Reincarnation is a vast topic, we can’t discuss it here. But, surely, as a Methodist you understand that the belief is not compatible with the NT?\n\n","date":"June 20, 2015 at 7:47 am","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202917","author":"Louis","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"What we do know is back when King Henry VIII was in charge, he wanted some changes so e got rid of the RCC and made the Ecc.  This way he could easily divorce and get a new wife(s).  Had that not happened, then the world would be thinking of the King as a whore monger, no a fitting title for an English King.   As a non-RCC he had – – what was it  –  6 different wives ?\n\n","date":"June 19, 2015 at 8:01 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-202863","author":"Emmett McMahon","site":"shroudstory"},{"title":"BBC News Magazine:  The Perplexing Image","post":"Reblogged this on Best of Shroud Story.\n\n","date":"July 11, 2015 at 6:20 pm","url":"https://shroudstory.com/2015/06/19/bbc-news-magazine-the-perplexing-image/","cat":"article","id":"comment-205311","author":"Dan","site":"shroudstory"}]
