[{"title":"Because If It Looks Unbelievable","post":"Why are some people so anti-fact.  They draw up a conclusion then regardless of the facts that show the error of that conclusion, they Nay Nay Nay the facts.\n\n","date":"July 23, 2015 at 3:02 am","url":"https://shroudstory.com/2015/07/23/because-if-it-looks-unbelievable/","cat":"article","id":"comment-206359","author":"ekmcmahon","site":"shroudstory"},{"title":"Because If It Looks Unbelievable","post":"So an anti-hoaxer has been hoaxed into believing that the Shroud of Turin is a hoax, the victim of his own anti-hoaxing smugness!  In identifying hoaxes, it is essential that the anti-hoaxer first ascertain the true facts of the case and not be hoaxed by mere skeptics’ received wisdom!\n\n","date":"July 23, 2015 at 5:19 am","url":"https://shroudstory.com/2015/07/23/because-if-it-looks-unbelievable/","cat":"article","id":"comment-206366","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Because If It Looks Unbelievable","post":"How interesting. (I’ve been Googling) From newspaper reports, it is usually very difficult to tell whether a ‘scientific discovery’ is anything of the sort, and a couple of articles entitled ‘Noah’s Ark found in Turkey’ or ‘Shroud is genuine say scientists’ are equally likely to be so clumsily reported that to rely on them to formulate one’s opinion is extremely unwise. The reader is more likely to be persuaded by previous prejudice or the reputation of the media than anything claimed in the article. So, what to do? I turn to things like Google Scholar to see what I can find. For “Turin Shroud” the first dozen or so entries include papers from Applied Optics, the Journal of Optics, Accounts of Chemical Research, and the Journal of Imaging Science and Technology. For “Noah’s Ark” there is virtually nothing. Nearly all the ‘science’ of the Shroud can be found online, in accounts by its researchers and discoverers. All the ‘science’ of Noah’s Ark is second hand and primary sources are very difficult to track down.\nBe that as it may, I discovered something else, which is that the discovery of Noah’s Ark has been the subject of a court case. How often have books on the Shroud, or comments on this blog, included fanciful ideas involving ‘trials’, ‘judgements’ or ‘verdicts’? Well, in 1997, Noah’s Ark was actually subject to judicial proceedings. A professor of geology sued a lecturer for misrepresenting the discovery of Noah’s Ark as fact, when it was no such thing. Sadly, in spite of various arguments for and against, the lecturer’s lectures were not considered as “Trading” under the provisions of the “Fair Trade Act,” so he was not able to have breached it, regardless of the content of what he said, although the judge did say that the lecturer has used “misleading and deceptive conduct” in claiming various scientific truths which were no such thing.\n\n","date":"July 23, 2015 at 7:03 am","url":"https://shroudstory.com/2015/07/23/because-if-it-looks-unbelievable/","cat":"article","id":"comment-206375","author":"Hugh Farey","site":"shroudstory"},{"title":"Because If It Looks Unbelievable","post":"Majority of people living on this earth are like Martin Saunders, They can mis- guide many ignorant Christians. How can he condemned Shroud based on Carbon dating results. This ignorant guy knew only about the results but did not know how and from where the sample was taken to test. Also he did not know sample was contaminated or not. What a fool.\nTodate no one has given any conclusive idea how the image was formed on the Shroud of Turin.\nPeople like Martin Sauders write these articles only to earn money and also for the popularity. \nWhen you analyse 3 temptations Jesus overcame you can uderstand that how Jesus denied Popularity, Pride, Corruption, Material desires and Material Wealth.\n\n","date":"July 23, 2015 at 4:54 pm","url":"https://shroudstory.com/2015/07/23/because-if-it-looks-unbelievable/","cat":"article","id":"comment-206427","author":"Sampath Fernando","site":"shroudstory"},{"title":"Because If It Looks Unbelievable","post":"There were several “world-wide” flood stories in the Middle East that predated the Genesis story of Noah.  It is typical of civilisations subject to random flooding bringing disaster that they will produce flood stories, and they even extend to India and other widely scattered locations.  In ancient Egypt, there were no such flood stories, presumably because the annual flooding of the Nile was predictable, and seen as benign and essential for maintaining soil fertility.  \nThe most notable story, was included as the eleventh tablet in the Epic of Gilgamesh, which dates from the third millenium, and was introduced subsequently, and is known from the library of Assurbanipal.  Following the death of his companion Enkidu. Gilgamesh goes on a quest to search for the secret of immortality. The secret is held by Utnapishtim, who dwells at the mouth of the rivers, and had been saved from the disastrous flood wrought by the gods.  In this story, the flood is seen as a deliberate spontaneous but erratic act to destroy humanity.  Utnapishtim as a protege of Ea is saved by means of an ark he builds, as in the Noah story.   In some other versions, he goes under the name Ziusudra or Atrahasis which date from the second millenium.  \nThe writers of the Noah story evidently became acquainted with such stories during the Babylonian exile, so that it is a fairly late inclusion in Genesis.  However the Judaic authors have their own agenda and interpretation, seeing the Lord their God as just and merciful, that man is perverse, and that God saves his faithful ones, and so design the moral of the story to suit their own purpose.  Although the Utnapishtim story remains as the best known, the Noah story is best seen against a general background of such flood stories, rather than any particular one. \nThe original concept of an ark, may have been suggested by a peculiar rock formation such as that apparently in the neighbourhood of Mt Ararat, and is an aetiological component of the story, designed to explain its origin, and also to provide the saving transport in the story.  The ark is a potent symbol both in Judaism and in later Christianity.  A peculiar salt pillar formation is probably behind the story of Lot’s wife.  Such aetiology is a common feature of ancient and primal myths.  \nSource “Epic of Gilgamesh”, N K Sanders, Penguin, my copy 1982\n\n","date":"July 23, 2015 at 5:38 pm","url":"https://shroudstory.com/2015/07/23/because-if-it-looks-unbelievable/","cat":"article","id":"comment-206429","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Because If It Looks Unbelievable","post":"The ark is of course more than just transport.  It is the sole place of refuge which provides salvation to Noah and his family while the rest of humanity is doomed to perish in the flood.  A place of refuge from various threats is a recurring theme in the OT.  The vessel carrying the tablets of stone given to Moses was called an ark, was carried through the desert by the ancient Israelites, and is finally placed in the Holy of Holies in Solomon’s temple.  In New Testament Christianity, the Church will be seen as a type of the ark, outside of which there is no salvation.  On the Sea of Galilee, the lives of the apostles are threatened by the storm, and by drowning, but Jesus comes towards them across the stormy waters, or in another version of a similar story he is with them in the boat but is asleep, and they wake him to calm the storm.  It is in the creation of a powerful symbol of salvation, which is more significant in such stories, than any queries about the literary truth of camp-fire tales told with  some other purpose in mind.\n\n","date":"July 23, 2015 at 6:54 pm","url":"https://shroudstory.com/2015/07/23/because-if-it-looks-unbelievable/","cat":"article","id":"comment-206431","author":"daveb of wellington nz","site":"shroudstory"}]
