[{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"Watch Mel Gibson’s “Passion of the Christ”, both scourging and crucfixion scenes\n\n","date":"May 8, 2014 at 7:59 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-114968","author":"Louis","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"Important work. And important it is reviewed by experts. If the conclusions are considered reasonable it certainly supports the notion that the Shroud covered a crucified man.\n\n","date":"May 8, 2014 at 8:36 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-114991","author":"Thomas","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"Regardless of the content of the paper. When was the last time an artwork depicting an injury was published on injury?\n\n","date":"May 8, 2014 at 9:41 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-115037","author":"Mike M","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"This may also go someway towards explaining why Jesus did not survive long on the cross. If He was partially paralysised He would not have been able to pull Himself up to breath.\nLouis, that movie over did it. The scourging scene does not reflect the the injuries visible on the TS. I believe, except for the crown of thorns & spear wound, Jesus got the standard Roman crucifiction, horrible as it was.\n\n","date":"May 8, 2014 at 11:24 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-115091","author":"Gerard","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"Hi Gerard, that’s right, there was some exaggeration in the scourging scene, but something tells me that there was severe damage to one of Jesus’ shoulders.\n\n","date":"May 9, 2014 at 8:14 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-115720","author":"Louis","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"My instinct as to the claim of a dislocation is one of caution.  Certainly Prof Fanti has no known medical forensic pathology qualifications enabling him to make such a judgement. The caution is based on Pierre Barbet’s insistence that a dislocation will result in a shortening of the arm, not a lengthening.  Barbet has the arms stretched out at right angles to the body for nailing to the patibulum lying on the ground.  On elevation, the body sag results in the arms taking a position at 65deg to the vertical.  He writes: “… there has been a good deal of talk about the arms being lengthened by dislocation, and I have had some difficulty in convincing good friends of the shroud who are not, however, versed in anatomy; this is a matter that need some understanding. Dislocation could only take place in the joints of the shoulder and the elbow. A dislocation of one or the other would shorten the arm and would not lengthen it.” A shortening is not what is seen on the Shroud image.  The result of suspension from the wrists can result in an elongation of four or five centimetres at the most, and this conforms to the geometry of the arm taking up the position from horizontal to 65deg as the hypoteneuse of the triangulation.  “Doctor at Calvary” Pierre Barbet, 1963; ‘The Wounds of the Hands, p.107. Barbet had his original French work published in 1950; It would seem that the Padua and Palermo medical authorities have yet to be aware of it. Unless of course they can claim that Barbet was mistaken, or unless they have experimental evidence to be able to claim the contrary. The paper may benefit from a peer review.\n\n","date":"May 9, 2014 at 12:00 am","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-115103","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"“The right eye is retracted in the orbit” because of the paralysis of the entire arm”\nThinking of CBH ? But no real retraction of the eye in the orbit.\nI can’t see the right shoulder.\nI can cross my hands over my pubis.\nAnd Fanti was the image expert ?\nI don’t buy it.\n\n","date":"May 9, 2014 at 2:13 am","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-115176","author":"anoxie","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"Dan, it’s not new at all, the study (at least its first part) has been published online in 2013 and mentioned in your blog.\nA letter to the editor, by spanish experts in orthopaedics and traumatology, has already been published. For example, on the right shoulder dislocation, they write : “The image of both the shoulders on the Shroud is destroyed due to burn damage. So, any deductions made about the shoulders are based upon the angle formed by the upper edge of the trapezius muscle as compared to the contralateral side. In addition, it does not deﬁne the exact placement of the humeral head centre. The authors proposed an alternative interpretation of an anterior dislocation that could be consistent with an indirect mechanism of dislocation (as provoked by a fall during which the right hand came into contact with the ﬂoor). It could be argued that the movements, traction needed, and position in cruciﬁxion could reduce the dislocation if it was present. Alternatively, it also could be stated that the traction exerted during cruciﬁxion could dislocate the shoulder due to body weight as well. However, in this case, the dislocation would be inferior”\nCaja VL, Reverte-Vinaixa MM. ‘‘Do we really need new medical information about the Turin Shroud?’’ published in Injury journal (Injury 2014; 45: 460–4) by Bevilacqua M, Fanti G, D’Arienzo M, and De Caro R. Injury (2014).\nhttp://www.injuryjournal.com/article/S0020-1383(14)00115-6/abstract\n\n","date":"May 9, 2014 at 2:33 am","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-115185","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"I have this paper.\nI have to say that I am not convinced. \nHowever, there is something very interesting based on the infra-red picture that clearly shows a difference between the right and the left orbit. Looking at the IR picture, the “right eye retraction” is obvious.\nDan, can you show this IR picture ?\nI do not think that it comes from a Claude-Bernard-Horner (CBH) syndrome. I don’t think that the retraction (pseudo-enophtalmos) can occur so quickly in the case of  CBH syndrome in a traumatic context (maybe I am wrong).\nHowever, enophtalmos (eye retraction) can occur immediately in the case of fracture of the jugal (or zygomatic) bone. This is basic medicine.  \nOn the TS we have an extraordinary consistent set of proofs: the oedema of the right cheekbone, the right eye retraction (IR image) and the fracture of the nose.\n\n","date":"May 9, 2014 at 4:53 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-115627","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"However, enophtalmos (eye retraction) can occur immediately in the case of fracture of the jugal (or zygomatic) bone. This is basic medicine.\nOn the TS we have an extraordinary consistent set of proofs: the oedema of the right cheekbone, the right eye retraction (IR image) and the fracture of the nose.\nAnd Thibault, aside from any medical evidence, what about the prophecy?\n John 19: 36 (NIV):  These things happened so that the scripture would be fulfilled: “Not one of his bones will be broken,\n\n","date":"May 9, 2014 at 5:03 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-115630","author":"O.K.","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"As you write Thibault, this is basic medecine, in a post traumatic or post operative CBH syndrome you can see a pseudo enophtalmy (no retraction of the eye).\nAnd as you note, there is a direct trauma on the right eye/orbit…\n\n","date":"May 10, 2014 at 5:04 am","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-115938","author":"anoxie","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"Just now I have some time to comment on this issue…\nThe theory of right shoulder dislocation is not new but I was surprised by the possibility of associated brachial pexus palsy.\nThe most prevalent variety of shoulder dislocation-the anterior- often occurs when patients fall sustaining  their weigth by hand contact with the ground in external rotation/extension of the arm, or by a sudden movement of extreme arm abduction-extension-external rotation of the shoulder.\nIf the Man of the Shroud had His superior limbs in an abducted shoulder position due to «rigor mortis» i before being removed from the cross, an applied force to put them in an adduction position as we see on the Shroud would  hardly result in anterior shoulder dislocation it would rather produce perhaps a frature of the superior part of the Humerus or the Glenoid cavity.\nThe inferior  shoulder dislocation variety is extremely rare and  before orthopedic reduction, the patient presents with an irreductible elevated arm.(I have  observed it once only in my 33 year medical practice in a patient for rehabilitation…) so this situation is easily discarded by observing superior limbs position of Shroud image.\nConcerning the second pathological condition mentioned- Brachial Plexus Injury- a trauma involving a violent stretch of the cervical spine and scapular girdle  as it could happen in a fall without hand protection, or a torture aggression,  could in theory be responsible for a lesion  involving superior roots of the Brachial  Plexus maybe including the seventh cervical root, but complete Brachial Plexus injuries are characteristic of high velocity/high impact trauma as the ones in motor vehicle accidents namely motorcycles.\nThe condition known as Claude-Bernard-Horner syndrome may be present only in complete (C5-C6-C7-C8-D1) lesions of the Brachial Plexus, and results from sympahetic cervical nervous system injury clinically producing a reduced ocular opening by ptosis of superior eyelid and apparent enophtalmos  and a reduced pupilar diameter.(myosis).\nBearing in mind all this and observing the Shroud Image my opinion as a medical doctor dealing with injured patients is as follows:\nIf the Man of the Shroud suffered traumatic injuries from torture and falling to the ground without hand protection an anterior dislocation of the right or left shoulder is a plausible possibility,the same applies to injury of the Brachial Plexus, but it would be extremely uncommon a complete paralysis of the superior limb, and Claude Bernard Horner syndrome does not immediatly appear and besides as far as I know it is a condition observed in the living person and not in a corpse.\nNow let’s analyze the Shroud Image:\nWe’re facing a real problem because there is no shoulder or  arm image on both sides because those areas were destroyed by Chambery’s 1532 fire.\nEven if the right shoulder area was there I think we could hardly discern the clinical signs of anterior shoulder dislocation.\nThe fact that right forearm is longer than letft and has a length apparently out of proportion with anatomy does not necessarily mean that the shoulder is dislocated.\nThis observation can be explained by the position of right superior limb relative to the left and the way image was produced on the cloth, perhaps tensile forces applied to the fabric and unknown factors- image experts advice on this issue would be welcome.\nNow ,looking at right eye area ,we observe a closed eyelid ,periorbital oedema and swelling of the cheek area of the face. all these findings can be explained by the severity of blunt traumas the Man of the Shroud endured and I agree with Dr. Thibault Heimburger that a fracture of the orbital part of the malar bone could produce such an aspect, so Claude Bernard Horner syndrome is perhaps a far fetched possibility.\nTo summarize ,and with due respect to the authors of the paper under comment , my humble opinion is that stating that the Man of the Shroud had a dislocated right shoulder  and a paralysis of the brachial plexus is very hard to prove indeed  based  only on visual image analysis, and pathophysiology of those injuries.\n                                                                regards\n                                                           Antero de Frias Moreira\n                                             (Centro Português de Sindonologia)\n\n","date":"May 12, 2014 at 9:43 am","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-117785","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"“The condition known as Claude-Bernard-Horner syndrome may be present only in complete (C5-C6-C7-C8-D1) lesions of the Brachial Plexus”\nor an irritation/compression/driect trauma of the sympathetic chain beyond the brachial plexus (http://www.jaypeejournals.com/eJournals/ShowText.aspx?ID=4342&Type=FREE&TYP=TOP&IN=~/eJournals/images/JPLOGO.gif&IID=338&isPDF=YES) \nAnyway, this is just another “i think i see” paper.\n\n","date":"May 12, 2014 at 11:13 am","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-117834","author":"anoxie","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"Thank you Antero for your highly detailed analysis. It would seem to corroborate what Pierre Barbet had to say about unlikely claims of shoulder dislocation.\n\n","date":"May 12, 2014 at 4:19 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-118027","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"It seems to me to be surprising that my estimated medical, expert and not expert colleagues, have not used the precious INFORMATION that there provide to us 4 existing copies of the Holy Sheet that are previous to the fire of 1532, showing po so much the shoulders and the unharmed elbows of the Man of the Sheet. Of having done it I believe that his diagnosis had been UNDOUBTED of luxation glenoidea.\n4 copies of the Sheet are:\n 1.-Xabregas’s Sheet (Lisbon, Portugal) c.1506\n2.-Lier’s Sheet (Belgium) 1516\n3 and 4.-Sheets of I Nonremove (Jaen, Spain) 1527 4\nSheets show the evident ASYMMETRY of the shoulders in form, “length” and height, and show the evident DIFFERENT LENGTH of the arms (of the anatomical segment arm or the segment understood between the shoulder and the elbow).\n4 Sheets are COINCIDENTAL!\n The LUXATION GLENOIDEA is evident.\nhttp://lasabanaylosescepticos.blogspot.com.es/\nCarlos\n\n","date":"May 13, 2014 at 5:17 am","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-118459","author":"Carlos","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"Esta es una buena informacion, sin embargo, la duda es si cualquier diagnóstico pude ser hecho a través de este medio.\n\n","date":"May 13, 2014 at 1:06 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-118657","author":"Louis","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"(Correcciones. Perdón por mi inglés que es el automático de Google)\nIt seems to me to be surprising that my estimated medical, expert and not expert colleagues, have not used the precious INFORMATION that there provide to us 4 existing copies of the Holy Sheet that are previous to the fire of 1532, showing po so much the shoulders and the unharmed elbows of the Man of the Shroud of having done it I believe that his diagnosis had been UNDOUBTED of luxation glenoidea. \n4 copies of the Shroud are:\n \n1.-Xabregas’s Shroud (Lisbon, Portugal) c.1506\n2.-Lier’s Shroud (Belgium) 1516\n3 and 4.-Shrouds of  Noalejo (Jaen, Spain) 1527\n4 Shrouds show the evident ASYMMETRY of the shoulders in form, “length” and height, and show the evident DIFFERENT LENGTH of the arms (of the anatomical segment arm or the segment understood between the shoulder and the elbow).\n4 Shrouds are COINCIDENTAL!\n \nThe LUXATION GLENOIDEA is evident. \nhttp://lasabanaylosescepticos.blogspot.com.es/ \nCarlos\n*************************************\nEn español:\nMe parece sorprendente que mis estimados colegas médicos, expertos y no expertos, no hayan hecho uso de la preciosa INFORMACIÓN que nos proporcionan las 4 copias existentes de la Sábana Santa que son anteriores al incendio de 1532, mostrando po lo tanto los hombros y los codos indemnes del Hombre de la Sábana.\nDe haberlo hecho creo que su diagnóstico hubiera sido INDUDABLE de luxación glenoidea.\nLas 4 copias de la Sabana son:\n1.- Sábana de Xabregas (Lisboa, Portugal) c.1506\n2.- Sábana de Lier ( Bélgica) 1516\n3 y 4.- Sábanas de Noalejo (Jaen, España) 1527\nLas 4 Sábanas muestran la evidente ASIMETRÍA  de los hombros en forma, “largura” y altura, y muestran la evidente DIFERENTE LONGITUD de los brazos ( del segmento anatómico brazo o sea el segmento comprendido entre el hombro y el codo).\n¡Las 4 Sábanas son COINCIDENTES!\nLa  LUXACIÓN GLENOIDEA es evidente.\nhttp://lasabanaylosescepticos.blogspot.com.es/ \nCarlos\n\n","date":"May 13, 2014 at 5:35 am","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-118471","author":"Carlos","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"Dear colleague Dr. Carlos\nI respect your opinion and I’m aware of the existence of Shroud copies painted before 1532 Chambery’s fire, namely the one of Xabregas in my country, nevertheless just by observing these paintings frankly I don’t find enough criteria to make a diagnosis of right anterior shoulder dislocation.( what you called «luxation glenoidea» ).\nActually the assimetry in shape of the shoulders and arm lenght is probably a technical painting imperfection and I think those bizarre depictions of the Shroud of Turin could never express the details of the original and ,much less show the clinical signs of shoulder dislocation.\nAs you know the diagnosis of shoulder dislocation although with high accuracy clinical suspicion, can only be surely stated by radiograph exam and we do not have an X-Ray exam of the Man of the Shroud’s right shoulder….\nI did not deny  categorically the possibility that the Man of the Shroud suffered a dislocation of the right shoulder what I meant is there is no evidence of such condition on the Shroud of Turin.\nDon’t get me wrong,, this is just a medical and technical detail that does not harm the authenticity of the Shroud I guess different opinions of Shroud researchers are welcome.\nCongratulations on your interesting website «La Sanana y los escépticos» I can read spanish quite easily I apologize for writing in english but I can’t write español.correctly.\n                                                                         regards\n                                                       Antero de Frias Moreira\n                                                Centro Português de Sindonologia\n\n","date":"May 13, 2014 at 12:46 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-118646","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Breaking News:  New Injury Details Seen on the Shroud of Turin","post":"Dan:\nHe would be grateful to you that you were publishing in your blog the photography of the Sanlúcar de Barrameda´s Shroud (Spain) .c.1650.\nhttp://lasabanaylosescepticos.blogspot.com.es/\nThe artist, instead of showing like was the habitual thing in the copies, the negative stamp that shows the Shroud of Turin, it interprets the stamp and paints Jesus’ image that would correspond with this stamp.\nI believe that it cannot fit doubt that the artist was gathering a tradition or knowledge of the ASYMMETRY of the shoulders and of them brazos* of the image of the Shroud of Turin…. asymmetry (and not technical blemish) that it can appreciate in 4 Sheets previous to the fire of 1532 that today they last, Xabregas, Lier and the 2 of Noalejo, he above mentioned of extraordinary quality in the criterion of the investigators Cesar Barta and Alfonso V.Carrascosa, (” The Shroud of Turin and its ancient copy “).\nOnly the copies of very bad quality show SYMMETRY in the shoulders and in them brazos*\n*(the anatomical segment that goes from the shoulder to the elbow and which skeleton is constituted by the bone named humerus).\nCarlos\n(traducción automática del español))\n***************************************************************************\nDan:\nTe agradecería que publicaras en tu blog la fotografía de la Sabana de Sanlúcar de Barrameda (España).c.1650.\nhttp://lasabanaylosescepticos.blogspot.com.es/\nEl artista, en vez de mostrar como era lo habitual en las copias, la impronta negativa que muestra la Sabana Santa, interpreta la impronta y pinta la imagen de Jesús que se correspondería con esa impronta.\nCreo que no puede caber duda de que el artista recogía una tradición o conocimiento de la ASIMETRÍA de los hombros y de los brazos* de la imagen de la Sábana Santa….asimetría (y no imperfección técnica) que puede apreciarse en las 4 Sábanas anteriores al incendio de 1532 que hoy perduran, Xabregas, Lier y las 2 de Noalejo, estas últimas de extraordinaria calidad en el criterio de los investigadores Cesar Barta y Alfonso V.Carrascosa, ( “The Shroud of Turin and its ancient copies”).\nSólo las copias de muy mala calidad muestran SIMETRÍA en los hombros y en los brazos*\n*(el segmento anatómico que va del hombro al codo y cuyo esqueleto está constituido por el hueso denominado húmero).\nCarlos\n\n","date":"May 15, 2014 at 6:45 pm","url":"https://shroudstory.com/2014/05/08/breaking-news-new-injury-details-seen-on-the-shroud-of-turin/","cat":"article","id":"comment-120151","author":"Carlos","site":"shroudstory"}]
