[{"title":"Christian Faith Eroded to the Very Core?","post":"Very interesting post, Dan.\nIt does seem that Paul Badde has the best of intentions, having detected how much faith in Jesus’ resurrection there is today, however it is also hard to believe that Manoppello will change the scenario. There are many doubts when it comes to this image, but that is not so with scripture.\nIt is evident that Badde is somewhat outdated when it comes to biblical studies. He refers to Bultmann, who is a thing of the past. Functions did not determine the forms, as the form critics with their “formesgeschicte” said.They put a great distance between eyewitnesses and gospels (1Cor, 15:6:  five hundred believers, “many of whom are stll alive.”). The gospel writers were composers of oral history and the continuity between Jesus traditions in oral form do resemble the continuity between eyewitnesses and historiographical sources. As Vincent Taylor wrote, if the form critics were right eyewitnesses must have ascended into heaven soon after Jesus’ resurrection.\nThe empty tomb would mean absolutely nothing for faith if there were no appearances. That is why the Jesus movement was a “Resurrection movement”, not an “empty tomb”movement.\nNo “bones of Jesus” were found in Jerusalem, whatever Bultmann may have thought.\nhttps://www.academia.edu/7471287/Book_Review_The_Tomb_of_Jesus_and_His_Family_Exploring_Ancient_Jewish_Tombs_Near_Jerusalems_Walls\nBultmann(Lutheran) was influenced by Heidegger(Catholic) and both did not give up their faith.\nBadde is right when he says that most theologians have long been convinced that the reporting in the gospels cannot generally be considered reliable. He only exaggerated when he said “most” and one can bet that the scepticism he refers to is partly the result of Bultmann’s influence on biblical studies for a century. As Father Joseph A. Fitzmyer wrote, Scripture is the soul of theology. So, theologians will have to reconsider their theology, which will have to be based on what is being said about scripture today, which is not as Bultmann understood it.\n\n","date":"July 4, 2015 at 9:19 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204505","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"In my opinion we can’t take all reporting in the gospels as reliable.\nI think there were certain central historical truths that were elaborated on, so that the gospels represent an amalgam of historical fact and fable.\nFor me, the resurrection really did happen, but there’s a number of elements in the gospels which I think are fable.\n\n","date":"July 5, 2015 at 12:26 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204575","author":"Thomas","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"It is worth going to the link to read not only the full text of Badde’s article, but to read some of the comments and Badde’s responses to them.  I would concur with Louis that there are too many doubts about the Manopello image, but Badde has his two witnesses with the Oviedo relic, and of course there are many more independent witnesses in the New Testament and even a few in the contemporary secular literature.  \nJ P Meier’s response to criticisms of the alleged unreliability of the NT seems to have been to have adopted a minimalist approach in his attempts to deal with the historical questions. \nBultmann’s legacy still survives, even though he is now considered passe.  He was correct in asserting that Jesus survived in the kerygma, in the proclamation of the apostles, but wrong in asserting that his bones were somewhere in Palestine.  That apostolic proclamation was that Jesus did indeed survive death and was resurrected in body and spirit, not merely in his teaching.  \nThe legacy of Bultmann is pervasive.  Within the last year or so a posting here confirmed that many clergymen (even a majority) in England rejected the bodily resurrection as a literal truth.  It also seemed to influence Hans Kung.  The Jesus Seminar remains an influential movement. \nIn 1967 here in NZ, a Presbyterian theologian, Lloyd Geering, gained a high profile when he was arraigned before the General Assembly for denying the resurrection and disturbing the peace and unity of the Presbyterian church.  The charges were brought by a conservative group of laymen and a conservative minister, but were dismissed without being much discussed.  Geering became a highly influential spokesman in the NZ religious scene.  Googling on his name will reveal a highly prolific literary output on religious themes, all of course denying the resurrection, and denying the notion that God is a real supernatural being who created and continues to look over the world.  \nAged now 97, he has until recently continued to have a high outspoken and controversial profile.  He was honoured in 1988 as a Commander of the Order of the British Empire and in 2001 as Principal Companion of the New Zealand Order of Merit. In the 2007 New Year Honours List he was made a Member of the Order of New Zealand. In 2009, his status as a Principal Companion of the New Zealand Order of Merit was re-designated to that of Knight Grand Companion of the New Zealand Order of Merit. \nMy own personal belief is that God wills that all shall be saved (c.f. Lumen Gentium).  However rejecting God in the certain knowledge of his existence would be a sin for which there could be no forgiveness.  Consequently He wills that belief shall remain a matter of faith only.  That is why I suspect that there will never be a certain authentication of the Shroud as the true burial cloth of Christ.\n\n","date":"July 4, 2015 at 3:43 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204529","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Daveb I live in Queenstown, NZ, and have long thought Geering a very odd individual\n( although he’s clearly a clever man) .\nI believe he still professes to being a ‘Christian’ even though it has been clear for a long time that he doesn’t believe in God (beyond some sort of metaphorical symbolism).\nI have much more respect for Atheists than Geering and his ilk.\nSuch protestant liberal nonsense is one of the reasons  I converted to Catholicism about 5 years ago ( I grew up very loosely as an Anglican).\n\n","date":"July 5, 2015 at 12:22 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204574","author":"Thomas","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Thomas, make no mistake, Lloyd Geering has been an intellectual giant in his time.  He has been extremely influential here in NZ and also elsewhere, in the development of Religious Studies and particularly so in the Jesus Seminar.  An acquaintance mentioned his father was on the New Plymouth vestry when Geering was first arraigned, and had thought him rather pitiful.  That is not what I found either in personal conversation with him, nor during his many lectures and broadcasts.  I believe he has come to his views honestly enough, but I do find his continuing association with the NZ religious establishment rather odd.  He is something of a white ant, eating away at the inside, and very plausible.  Until recently he was still associated with St Matthew’s on the Terrace in Wellington, a sort of all-inclusive “cafeteria” parish.  Believe me, he still has a large following.\n\n","date":"July 5, 2015 at 2:16 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204586","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Although the discussion is now going off the track with comments about Lloyd Geering something must now be said about why exactly he finds fertile ground in New Zealand.\nThe Anglican Church in England had many freemasons as prelates and archbishop Rowan Williams wanted to bring this to an end, saying that he would not nominate freemasons as bishops. He referred to “satanic” influence in the secret society.\nIn general, therefore, it is not hard find Anglicans who will believe anything under the sun in England, and Williams himself was criticised for taking part in a Druid ritual.\nIt is this sort of “broad mindedness” that, naturally, will be seen in NZ. I doubt any Catholic parish in England would throw its doors open to Geering.\n\n","date":"July 5, 2015 at 12:48 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204626","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Sorry, I meant Catholic parish in New Zealand.\n\n","date":"July 5, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204628","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Louis, it’s all probably tied in with our colonial past.  The first missionaries here were English Anglican led by Samuel Marsden in the early 1800s.  Irish goldminers, and ex-convicts from Australia gave a Catholic presence, and Bishop Pompallier with his French Marists arrived here in 1837.  The colony’s founding document was the Treaty of Waitangi signed by most of the Maori chiefs from about 1840, after which there was extensive British immigration.  Many of the settlers had been familiar with the religious dissensions and strife in their home countries.  Some were glad to leave them behind, others brought their dissension with them.  In 1870 the NZ Parliament passed the Education Act which made education free, compulsory and secular.  The secular clause had a profound effect on the NZ religious outlook.  Heavy NZ involvement in two World Wars on the other side of the globe, and subsequently in the Pacific also had their effect in forming the NZ psyche.   \nWe are led to believe that NZ is fundamentally now a secular society, but there is still a strong Christian presence, and for the most part there are good relations between the several denominations.  There are about eight universities in New Zealand from Auckland in the north to Dunedin in the south, a few of which have Religious Studies departments.  Geering was a significant forming influence in the founding of these departments.  The Presbyterian Church in NZ has had a reputation for heresy trials, and consequently Geering was arraigned before the General Assembly as a result of promulgating his beliefs.  \nAs I mentioned above, he has had a prodigious literary output, and in his time was the darling of religious broadcasters, and a favourite of lecture circuits.  Several of the Protestant churches combined to form a Union Church, and Geering has been active in this realm.  Apart from the churches, there is now a strong secular outlook in NZ society, resulting in a national spiritual void, which the likes of Geering have been able to exploit. \nOther NZers may have a different perspective from my rather terse analysis.\n\n","date":"July 5, 2015 at 3:43 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204643","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"I think your analysis is good, daveb. I would choose the “colonial past” you refer to as including the “broad mindedness” I mentioned above and therefore the influence it had in NZ.\nThere seem to be several “union churches” in NZ, with heavy Maori influence and following traditional Christian teaching. Which leaves me wondering what the Union Church you  mention is up to, since L. Geering is active in this realm.\nI really don’t see why it has to be a church in the first place if he is “preaching” there.\nPerhaps it would be more appropriate for them to borrow RDs motto. See the bus in the image:\nhttp://kasarik.com/rational-belief-in-god/why-dawkins-was-right/\nIt would then become a social club.\nYet, it would be correct to add that it does seem that both RD and Hawking have not entirely ruled God out of the picture. Even Dennett is open-minded to some extent, but in his case he seems to have studied Catholicism deeply.\n\n","date":"July 5, 2015 at 4:22 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204651","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"As elsewhere, the Religious dimension in NZ is complex.  It seems to be in the abstract nature of religion to fragment, it has always been thus, from earliest times and in all religions, as mankind seeks to explore the ineffable.   \nThe genius of conservatism is to promote stability, while the genius of radicalism is to push the boundaries in its attempts to make religion and philosophy relevant to the times.  And of course, both have their singular negative attributes. \nProbably the seminal document for NZ is “Religion in New Zealand Society” edited by Brian Colless and Peter Donovan, my former professors at Massey U, and at the time a set text, Dunmore Press 1980:\nhttps://books.google.co.nz/books/about/Religion_in_New_Zealand_society.html?id=gaAIAQAAIAAJ&hl=en  \nIt may now be out of print, and it may be difficult to find a copy outside of NZ.  Some 205 pages, authors of the several chapters are diverse, and coverage of contributions includes: History, Maori, Catholic, Protestant, Ecumenism, Charismatic, Sectarian, Judaism, Indian, Pluralism and Academic.  Since 1980 there has been extensive South-East Asian, Chinese and Pacifica immigration and others, all having an impact on the religious dimension of NZ society, and of course on the various secular dimensions too.  \nGoogling on ‘Religion in New Zealand Society’, I found several other different sources as well.\n\n","date":"July 5, 2015 at 5:46 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204657","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Alright, I understand. But what I want to know is what L.Geering is saying in the “Union Church” because you said several Protestant churches combined to form it. Is it Christian or non-Christian in orientation?\n\n","date":"July 5, 2015 at 5:58 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204658","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"The Union Church in NZ was a combination of the Methodist, Presbyterian and Church of Christ.  Some may also include former Congregationalist churches.  Fundamentally I think it fair to say that most of them are Christian in orientation.  Some of them have diverse worship services, catering to particular sections of their parish communities, traditional, progressive, and in some places ethnic.  Some vary in their general approach according to the make-up of their congregation.  \nIt seems that the parent bodies of the earlier churches are still in existence and I have heard that among some Union Churches there is some feeling of isolation from their various parent churches who seem reluctant to acknowledge them.  Whether this is a matter of finance, access to common resources, a sense of communion, or doctrinal separation I cannot say. \nOne example I am familiar with is a particular Union Church, which has a diverse congregation.  I have heard Lloyd Geering give lectures in this church and I am aware that a former pastor there was an early protege.\nhttp://tawaunionchurch.org.nz/\nIt now caters for a broad spectrum congregation, and I think most would claim to be Christian, some possibly as post-Christian. \nThere was a typo in an earlier comment I made.  Lloyd Geering has been active in St Andrews on the Terrace in Wellington (incorrectly referred to as St Matthews).\nhttp://standrews.org.nz/  \nThis is a very broad spectrum church and claims to be all-inclusive.  I suggest you may get the flavour by perusing its web-site.\n\n","date":"July 5, 2015 at 7:17 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204665","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"There seems to have been so little progress in studying the Manoppello image after my two-hour interview with Father Heinrich Pfeiffer more than ten years ago that Paul Badde, despite his good intentions, has been far from convinving. All we can say with certainty today is that the cloth is linen and not byssus.\nAs daveb pointed out, the legacy of Bultmann is pervasive, but that is because it will take time for the new research to become more known. As for Msgr. J.P. Meier, his mistake was to say that he was writing on the basic details about Jesus that would be acceptable to Catholics, Protestants, Jews and Agnostics. His latest book says that only four parables can be attributed to Jesus, so then what are we left with when scholars in general are unanimous in agreeing that the sayings are more reliable than the narratives?\nIt does seem that scepticism is becoming very pervasive, partly the result of the fact that even the Old Testament narratives have been questioned.\nWe have I.Finkelstein denying the historicity of the story of the Patriarchs, the Exodus and a lot more. I could even sense that some biblical scholars were unsure about so many things while interviewing Professor Geza Vermes, who shunned organised religion but was accused of being “obsessed with Jesus” in Israel. He did indeed give the impression of being guided by an existential spiritual legacy left by Jesus:\nhttps://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\nHe was also one of the top scholars who dismissed the “Jesus family tomb” book/documentary. He did not believe that the “bones of Jesus” had been found.\n\n","date":"July 4, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204535","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Dan’s title is “Christian faith eroded to the very core?” and he is correct in the context. If we go beyond the context we will notice that faith can be eroded beyond Christianity to even reach another Bible-based religion, Judaism.\nIt has also reached literature, going beyond Norman Mailer to Harold Bloom:\nhttps://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\nIt is like saying that something is wrong somewhere and we have to find out what that is.\n\n","date":"July 5, 2015 at 1:02 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204627","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Faith is also being eroded in other circles, and the effects can be felt in the pockets. Heythrop College will be closing its doors — after 400 years. Perhaps the English Catholics need a new Cardinal Manning and a more active Duke of Norfolk?\nhttp://www.catholicherald.co.uk/issues/july-3rd-2015/have-posh-catholics-had-their-day/\n\n","date":"July 5, 2015 at 4:53 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204654","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Change of tack, and reverting to the main theme of the posting! \nLet us suppose that I am unable to accept the literal truth of the resurrection of Jesus as expressed in the gospels and in the preaching of Paul.  I may for instance find reasons why the apostles were mistaken, that the evangelists in proclaiming the message of Jesus iced the cake by introducing a mythic element of bodily resurrection, or that their message really meant something else and that the myth has been perpetuated in the church, and that we have failed to understand what was really meant.  \nHowever I am impressed by the social teaching of Jesus, his message of brotherly love, his sense of liberation from the fetters of the past, his sense of justice, of what constitutes true religion in the works of mercy, of doing good to others, even one’s enemy.  I may see this as a message that needs whatever it takes to survive, and to be embraced by all mankind.  \nI might then see the resurrection of Christ as present in spirit in the body of the church, or present in a sense of fellowship, or present in the persons of the suffering.  I reach out to this Christ as if he himself were truly present in these ways. \nIs this not a better way than that of the atheist who rejects any sense of the divine or any sense of mystery?  Is it fair to cast the stones of judgment against those who have honestly come to such a decision, for there are many of them?  Perhaps they follow more closely to the teachings of Jesus than those who prefer to rely on tired old doctrinal formulae. \nThat is the challenge and decision point for the Christian to make.  I think it is fairly close to the interpretation of Hans Kung who was prohibited from teaching in Catholic seminaries and universities on this account.\n\n","date":"July 6, 2015 at 2:01 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204696","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"There is really nothing new in this, it is something like what the Unitarians believe, but the bodily resurrection of Jesus is central to traditional Christian belief.\nIn Rom 1:3-4 there is double use of “Son”, the first may refer to Jesus as pre-existent, while the second speaks of (his) constituted or appointed “Son of God in power” as of his resurrection from the dead. The Pauline references to Jesus show that it did not take long for Christians to recognise Jesus’ relationship to Yahveh. In Rom 1:3-4 there is a double use of “Son”. The first refers to to Jesus as God’s “Son”, as in Galatians 1:16, 4:6, 1 Cor 15:28, Romans  8:32. Martin Hengel argues ( “The Son of God”, Philadelphia: Fortress) that this belief emerged between AD 30 and 50.\nWhile Father Hans Küng has said a number of correct things, about evolution for example, if we use him as a guide there will be nothing left for Christians to believe in. He is a systematic theologian who has raised doubts but not completed the story. New studies are being made. I am working on this and hope to publish it shortly.\nIn the review of “The Sign” there is something about why Jesus’ body could not have been stolen:\n https://www.academia.edu/10819998/Book_Review_The_Sign_by_Thomas_de_Wesselow\nWas Jesus buried in Talpiot? It doesn’t seem so:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nDid he go to Kashmir? No,he didn’t;\n https://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nWas Jesus’ body eaten by wild dogs, as J.D.Crossan would have us believe?\nMy response: Would there be a New Testament — for him to study and misinterpret — if this is true?\nChristianity would not go beyond Jerusalem if the NT accounts are myths.\n\n","date":"July 6, 2015 at 9:33 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204744","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Louis – there are valid alternatives to skeptical theories such as Jesus’s body was stolen, eaten by dogs etc.\nOne of those valid theories is that the empty tomb elements of the gospels were in fact mythical.\nBut one counter to that is why then employ women as the witnesses? Although I sometimes wonder if this point is overplayed by apologists.\n\n","date":"July 7, 2015 at 12:50 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204819","author":"Thomas","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Thomas, you know that women in general care about things that men will not bother about. That said, the women would worry about Jesus not having being given a proper burial, the men thinking about their crucified master and therefore becoming defeatists overnight. They would probably think, “Everything is finished, it was all an illusion”, so why bother about how he was buried in the proper manner?\nThe temple priests were spreading the rumour that the body had been stolen, which must have reached\nthe ears of the disciples, Just an empty tomb was not enough, although there was a clue about what exactly may have happened: what did they see which made them believe? It was the way the cloth was found fallen that gave the impression that the body had not left the cloth by normal means. \nAs for J. D. Crossan, no serious scholar or archaeologist that I know of, including Jewish ones, would ever believe that Jesus would not have been buried in a tomb. After the Jesus family tomb documentary with accompanying book was launched, many people began to ask Which tomb and Where?\nYou will find some lines about the views of the well-known scholars Petr Pokorny and Lee Martin McDonald here, which also have something about the tomb:\n https://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nIf you are interested in such topics you will like a book that I can recommend; “The Real Jesus”, by a top American NT scholar, Luke Timothy Johnson.\n\n","date":"July 7, 2015 at 10:22 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204851","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"I agree.\nThe “very core” of the Christian faith was, is and remains the Resurrection.\nThe empty tomb is just a sign.\nThe faith is based and only based on the testimony of the apostles: the “appearances” of Jesus after his death.\nThe key point, from a historical point of view, is connected to the historical fact that something new, unexpected, happened after the death of Jesus.\nThis “something” is unique in the History.\nThose who were in despair, suddenly confessed Jesus as “Christ”, “Lord” (in the context, this can only mean “God”), and “Son of God”.\n\n","date":"July 7, 2015 at 3:34 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204874","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Two of the world’s topmost biblical scholars, both American Catholic priests, Joseph A. Fitzmyer and John P. Meier, have some differences when it comes to when exactly Jesus was recognised as “Lord”.\nIf you go to the response in question 9 below you will see the differences:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nJ.P. Meier says that the Aramaic word Maré (Dead Sea Scrolls, Tarqum of Jacob) used of Jahveh stands behind the Kyrios of the Greek New Testament and was used of Jesus.\nJ.A. Fitzmyer does not agree, saying that the Jesus of history walked the roads of Palestine, the Christ of faith came after the Resurrection.\nIn the context you are writing the latter’s view makes more sense.\n\n","date":"July 7, 2015 at 3:57 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204878","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"I believe the point I was attempting to make in my above comment was the all too frequent paradox: \n“Who is following Christ more closely?  The one who cannot get his head around the literal reality of His resurrection, but follows his teaching of brotherly love?  Or the one who says his prayers, is doctrinally sound, but is lax when it comes to his duties towards others?”  \nThere’a a phrase for it, “All piety and no charity!”\n\n","date":"July 6, 2015 at 3:06 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204770","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"That is what we see everyday, but that is going the point of the post “Christian faith eroded to the very core”.\nDid you find out about what L. Geering is “preaching”?\n\n","date":"July 6, 2015 at 3:46 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204772","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Sorry, I meant beyond the point.\n\n","date":"July 6, 2015 at 3:46 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204773","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Louis, I don’t see that it is going beyond the point at all.  Badde correctly complains that many clergymen no longer believe in the Resurrection.  I contrast the situation where a good person who follows the teaching of Jesus but in his heart cannot accept the resurrection as a literal truth, with that of a person who is doctrinally sound but fails in many ways to follow his teaching.  You’ll recall that James’ Epistle had something to say about this matter, to the effect that his good works demonstrate his faith. \nRegarding Geering.  I’m reasonably familiar with much of what he has to say on a wide variety of topics, having heard several of his broadcasts, attended some of his lectures, in personal conversation with him, and read some of his work.  I don’t really need any more.  Google on “Lloyd Geering Lectures” and you’ll see there that anyone would be impressed with the prodigious output of the man on a wide variety of topics. \nFor a succinct but comprehensive summary I recommend a NZ Listener interview of 15 August 2013, when at the age of 95 he had published his most recent work, “From the Big Bang to God”.  You might note there that he was greatly impressed with Teilhard’s “Phenomenon of Man” which he read in the 1960s.  The interview covers a lot of ground, some of his biography, and the development of his thought.\nhttp://www.listener.co.nz/culture/books/lloyd-geering-the-great-story/  \nOne additional comment that I have sometimes heard:  That Loyd Geering has always seemed to have been reluctant to engage in any kind of public debate against his intellectual equals who happen to have opposing views.  It is always a ‘one-man show’, discussion yes, but with no sense of real dialogue or engagement.\n\n","date":"July 6, 2015 at 5:40 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204786","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Thank you for the link, daveb. I found it amusing to see Sir Anand Satyanand, former Governor General of New Zealand, and a Catholic of Indo-Fijian origin — I don’t know whether he is a convert from Hinduism — knighting L.Geering. The orders may have come from England. I will google the rest, as you suggested.\nIt does seem seem that L. Geering is reluctant to engage in real dialogue or engagement because he knows that he does not have answers to everything he talks about. It is said that Buddha, who denied the existence of a deity, told followers who raised questions he could not answer to concentrate on how to get out of the carmic cycle instead of engaging in speculation. \nI think he could not explain “nothingness”, that is, why we go to “nothing”. Not even scientist Stephen Hawking has any defined opinion on that topic.\nThe West seems to subscribe to Nietzsche’s “God is dead” more and more as time goes by. Even those who were brought up with some religious training seem to face the dilemma. But there are cases where nihilism is not accepted and important people try to derive a “covert theology” from the Bible;\n https://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\n\n","date":"July 7, 2015 at 9:30 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204847","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"The office of Governor-General in a constitutional monarchy can appear to be somewhat paradoxical to those more familiar with republican establishments.  The Queen’s assent as exercised by a G-G is required before a bill passed by Parliament can pass into the statute books.  If a government can obtain supply, then this is usually no more than a matter of routine, and it would be exceeding rare for a G-G to withhold the Queen’s assent, even if he had personal or conscience objections to the bill.  \nThe most notable case of a G-G acting against the wishes of Parliament was in 1975 when Governor-General Kerr dismissed Australian Labour Prime MInister Gough Whitlam, as Whitlam was unable to get his legislation past the Opposition dominated Senate.  Kerr dissolved Parliament by proclamation, declared Opposition leader Malcolm Fraser as interim Prime Minister on condition that supply would be granted, and then called for a general election which Fraser won by a land-slide.  \nThe situation would hardly arise in New Zealand which has a single House of Representatives, and Parliament only requires a simple majority to guarantee supply.  \nSir Anand Satyanand attended Sacred Heart secondary boy’s college in Auckland, an acquaintance mentioned that he was prominent in the schools G&S annual productions, and he was well-known as a prominent Catholic layman.  \nIn NZ, candidates for the Queen’s honours may be recommended by various informed lobby groups, these go forward to the Prime Minister’s office, and the G-G would bestow the honour as advised by the Prime Minister.  Any personal feelings which the G-G might have about bestowing an honour is a matter private to himself and does  not enter into the question.\n\n","date":"July 7, 2015 at 4:25 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204880","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Beautifully put. For me the most likely alternative explanation is your mythic icing of the cake. But for a number of reasons I find this hard to accept.\n\n","date":"July 6, 2015 at 5:19 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204709","author":"Thomas","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"I found an author that is new to me, Fr  Richard Rohr and his newest book is, “What The Mystics Know- Seven Pathways to Your Deeper Self” He writes about enlightment, getting into a higher consciousness and finding the real Self. \nHe is a Christain and believes in the bodily resurrection of Jesus, but he sounds a lot like another subject I’m studying, consciousness and Kashmir Shaivism.\nAfter finishing his latest book I went back on Amazon and ordered a few more of his book(he writes a lot), he has a very interest point of view.\n\n","date":"July 6, 2015 at 8:14 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204732","author":"John Green","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Daveb I have been reading a bit of Kung and others recently. And was prompted to this theory which is probably not novel at all….Jesus’s followers really did experience the resurrected Christ as a real vision. A form of apparition if you like. I’m not talking hallucination.\nThen created the empty tomb stories etc to account for the fact that Jews viewed resurrection in a bodily manner. Visions would be too wishy washy\nSo there’s truth at the heart of it all but mythic elaboration on top of the events that inspired it all.\n\n","date":"July 6, 2015 at 5:47 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204713","author":"Thomas","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Thomas, I might be considered a liberal on some matters, but my views on the resurrection are strictly orthodox.  For the last several years, even decades, I have had the duty and privilege of narrating the Passion and Easter readings, so by now I’m very familiar with them.  \nMuch of the core Passion story seems due to Mark, which a strong tradition says he had from Peter.  However both Matthew and Luke also introduce new material, which they know about independently of Mark and of each other.  John also seems to take Mark as the core story, but introduces a lot more.  So far that’s four very nearly independent witnesses.  However John goes further, and stymies any apparition fable that may have developed by introducing the story of Thomas, the reluctant believer, and Thomas is told to touch the wounds in the hands and the sides.  You can’t touch an apparition, nor a ghost!  \nIn the Acts of the Apostles, Luke has some disciples on the way to Emmaus and they encounter the Lord, at first unrecognised.  He eats with them, as he did when he first appeared in the upper room.  Ghosts and apparitions don’t eat, nor do they need food.  Mary Magdalen mistook him for the gardener.  Could she mistake an apparition for a gardener?  Paul an avid persecutor of the first followers, and a well educated man (a Pharisee), was so overwhelmed by his encounter that he became the greatest missionary the church has known.  \nA resurrection from the dead is completely outside the norm of human experience, and this is the reason and obstacle why so many have difficulty accepting it.  However on the strength of such evidence, I am unable to reject it!  Why, we even have an empty burial cloth without a single smudge caused by removal of the body!\n\n","date":"July 7, 2015 at 5:46 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204833","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Daveb. Yes. But… My point was perhaps there is a whole lot of fable built into the gospel stories. I have unwavering faith in a resurrection event, but not unwavering confidence in what the resurrection really was. Of course if one can believe in visions or apparitions then it’s not a big jump to a more corporeal resurrected body (albeit not resuscitated corpse).\nThe resurrection stories seem to get more “physical” as they get chronologically later and to me there seems to be a developing tradition that represents increasing “mythologizing”. We can go back to Paul and his descriptions of the resurrection are really quite ethereal.\nultimately, although really interesting, it’s all somewhat speculative, and I personally don’t think whether one believes in a more ethereal resurrection versus a more ‘physical’ resurrection is that critical.\n\n","date":"July 7, 2015 at 3:54 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204877","author":"Thomas","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Actually methinks the Christian faith was eroded to the very core as early as the 4th c. CE.  since John Chrysostom (c.347CE–c.407 CE), archbishop of Constantinople and Augustine (354 CE– 430 CE), Bishop of Hippo, totally disagreed on John’s  famous verse re what the other disciple “saw and believed”.\n\n","date":"July 6, 2015 at 11:42 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204755","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Re “the many contradictions of the Gospels”, they are so much due to the Four Evengelists as to the alleged “(heavyweight?) Biblical scholars” who indeed are far from truly reliable or infallible historical hermeneuts. Yes indeed, in the land of the blind, the one-eyed man can be king as far as the NT hermeneutics is concerned.\n\n","date":"July 6, 2015 at 11:54 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204756","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Typo: they are NOT so much due to the Four Evangelists as to…\n\n","date":"July 6, 2015 at 12:17 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204757","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Correction: RE “THE EMPTY TOMB SCENE”, actually methinks, the Christian faith is based on a BIASED interpretation of  John’s famous verse re what the other disciple REALLY “saw and believed”. Reminder: as early as the 4th c. CE John Chrysostom (c.347CE–c.407 CE), archbishop of Constantinople and Augustine (354 CE– 430 CE), bishop of Hippo totally disagreed on its interpretation.\nMost unfortunately, the exegesis bias came in with John Chrysostom who misunderstood and overtranslated (for liturgical purposes?) the said scene. Today most if not all Christians (Catholics et al) ONLY rely on Chrysostom’s faulty/expanded translation and a male dominated Paulinistic Christianism promoting John Chrysostome’s exegesis focusing on Peter & John’s discovery of the empty tomb at the expense of Mary Magdalene’s testimony and Augustine’s most likely correct understanding of the famous verse (in Jn 20:40, the other disciple NOW just believed in what the women had told them namely: Yeshu’a had been taken away from the tomb. Period. To infer John was the sole to understand Yeshua was risen from the dead in the empty tomb scene is plain inaccuracy of translation or overtranslation (i.e. to infer much more than what John actually witnessed then).\nReminder, on January 3, 2013 at 1:00 pm, I wrote: \nIn Joannis Evangelium Tractatus CXXIV) Augustine of Hippo wrote:\n“And he saw, and believed.” Here some, BY NO GIVING DUE ATTENTION  (upper cases mine), suppose that John believed that Jesus had risen again; but there is no indication of this from the words that follow. For what does he mean by immediately adding, “For as yet they knew not the scripture, that He must rise again from the dead”? He could not then have believed that He had risen again, when he did not know that it behoved Him to rise again. What then did he see? what was it that he believed? What but this, that he saw the sepulchre empty, and believed what the woman had said, that He had been taken away from the tomb?”\n…and further on in the following tractate:\n“Mary Magdalene had brought the news to His disciples, Peter and John, that the Lord was taken away from the sepulchre; and they, when they came thither, found only the linen clothes wherewith the body had been shrouded; and what else could they believe but what she had told them, and what she had herself also believed?”\n(As early as 1994 and as far as the empty tomb scene exegesis is concerned, I came to the same conclusion as Augustine of Hippo’s without even having previously heard of it. So did William Meacham, see http://freepages.religions.rootsweb.ancestry.com/~wmeacham/ton)\nAccording to the Gospels, Yeshu’a had to open his disciples’ mind to the scriptures… AFTER his death. And in this regard, John is in no really better off than Peter since THEY (i.e. John included) had  NOT YET understood Yeshu’a’s was actually to rise from the dead according to the scripture.\nHow long will this MISTAKEN VIEW (John was the first to perceive the real significance of Yeshua’s empty tomb on that very morning) be dominant among Christians? How long will this myth will prevail and totally biase sindonology (see the archmiraculists’ agenda)?\n\n","date":"July 7, 2015 at 10:30 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204852","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Your Meacham link doesn’t work. Can you summarize what you believe? You seem to be saying that yes the tomb was empty but only because the body had been removed. So did Jesus – personally – return from the dead at some point or not?\n\n","date":"July 7, 2015 at 2:58 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204873","author":"David Goulet","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"David, you wrote: “You seem to be saying that yes the tomb was empty but only because the body had been removed.”\nNot at all. THEY FIRST THOUGHT Yeshua’s body had been taken away “for as yet they knew not the scripture, that he must rise again from the dead”.\n\n","date":"July 7, 2015 at 5:59 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204886","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"I have found some lines about an interesting\nmiracle: the “Painted By Angels” (1754)…\n= Colombia’s Miracle Portrait of Virgin & Child…\n>…The Gothic-style church is considered one of the architectural wonders of the world, and according to the testimonials that line the walkways leading to the church, Las Lajas is rich in miraculous cures.\n>Most miraculous of all, however, is the portrait of Our Lady and Child, along with St. Francis and St. Dominic, which appears to be painted on rock.\n>But German scientists, after boring through various parts of the “painting,”\ndiscovered that the rich surface colors are not paint, but are the\nactual colors of the rock, which run several feet deep.\n>Indeed, no one has ever come up with an explanation for the phenomenal painting. …\nLink:\nhttp://www.catholicculture.org/culture/library/view.cfm?recnum=7471\nUntil now I have not yet seen the inherent scientific controls…\nHave you tried to find some scientific news about\nthe “German scientists” ?\nI ask because they discovered that “the rich surface colors are not paint,\nbut are the actual colors of the rock”…\n> Geologists from Germany bored core samples from several spots in the image.\n>There is no paint, no dye, nor any other pigment on the surface of the rock.\n>The colors are the colors of the rock itself.\n>Even more incredible, the rock is perfectly colored to a depth of several feet!…\nIs that Image a sort of another kind of “acheropita”?\n\n","date":"July 7, 2015 at 11:14 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204859","author":"piero","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Here other links:\nhttps://en.wikipedia.org/wiki/Las_Lajas_Sanctuary\nhttp://ipitimes.com/lle.htm\n[  IpiTimes   P. O. BOX 8411   Manhattan, NY 10116 ]\nhttps://www.americaneedsfatima.org/Our-Blessed-Mother/our-lady-of-las-lajas-a-continuous-miracle.html\n>En 2007 el Santuario de las Lajas es considerado una de las 7 maravillas de Colombia al obtener la segunda votación más alta; solo superada por la Catedral de Sal de Zipaquirá, en un concurso convocado por el periódico colombiano “El tiempo” \nLink:\nhttp://www.oblatos.com/dematovelle/index.php?option=com_content&id=1235:16-de-septiembre-fiesta-de-nuestra-senora-de-las-lajas&Itemid=166\nGeological samples collected have proven that the color\nactually permeates the rock, for, as impossible as it may sound,\nthe colors of the image are perfectly evenly distributed and\nreach several feet into the face of the cliff.\nScientists cannot explain it …\n… Laudato Si … Yes.\nBut…\nWhere are the papers of the scientific controls ?\nAny news?\n\n","date":"July 7, 2015 at 11:43 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204861","author":"piero","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Methinks archmiraculists’ theories are a positive disservice to the credibility of the Turin Shroud Image.\n\n","date":"July 7, 2015 at 11:48 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204862","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"(Irrespective of their potential to mislead Christians away from a really enlightened faith such as Augustine of Hippo’s)\n\n","date":"July 7, 2015 at 11:59 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204864","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Often I have several doubts about “archmiraculists’ theories”…\nWhat I wanted to underline is the lack of inherent rigorous\nscientific documentation (about the “Colombia’s Miracle Portrait\nof Virgin & Child”) and this seems to be similar for what happened\nin the case of Manoppello’s Face, if I am right…\n(because [for that particular Holy Face imprinted on presumed\nsilkmarine byssus] we have not yet seen the data obtained\nfrom a transmission spectrography!!! …and why?).\n\n","date":"July 8, 2015 at 10:26 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204933","author":"piero","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Buonasera, Piero\nI know, but I can’t tell you. In any case, a lot more needs to be done. The cloth is not byssus, it is linen.\n\n","date":"July 8, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204953","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"First of all there are two arguments: nested one into the other…\nSo, now I can only answer about the main: the Holy Face of Manoppello, because I don’t know where are the exact scientific proofs (and not the interesting but generic claims made by “german scientists”) for the other repert/miracle (= the strange miraculous image on the rocks, in Las Lajas).\nYou wrote:\n>…The cloth is not byssus, it is linen.\nInstead I have some doubt because we have not yet seen what are the results from the inherent very simple experiments (we can try using “Transmission Spectroscopy” on veils covered with a glass [=a glass properly made, namely: with the same composition of that of the reliquary or a similar composition…]: one  made with Silkmarine byssus and the other with a simple thin linen cloth… and that only to start with the experiments).\nSo…\nWhere is the proof for your “assertive claim”?\nI am curious to read your answer …\n— —\nIn any case, please …\nSee in this blog my past messages:\n1 – (September 4, 2014 at 6:27 am)\n>… First of all, as first step, we have to distinguish byssus from linen!\n… and typical spectrum of proteins is different with respect lignocellulosic materials !…\n>All protein fibres – and so all animal fibres – show a similar IR spectrum: at 3300 cm-1 and the amino and hydroxyl peaks at 2800cm-1 CH vibrations at 1650 cm-1, the characteristic vibrations of the amide groups of proteins. In this they differ markedly from the natural fibres of cellulose, which do not have amide groups. …\n2 – (September 8, 2014 at 9:38 am)\n>…Jaworski indicated the presence of melanin (= “Properties of byssal threads, the chemical nature of their colors and the Veil of Manoppello”. IWSAI 2010), but (if I am right) he doesn’t indicated the spectral answer of melanin because the scientific tools used (in that study) were HPLC and PLM. … etc. …\nand\nthen try to consider also an\n“Absorption spectrum of melanin”\nunder the following address:\nhttp://www.cl.cam.ac.uk/~jgd1000/melanin.html\n\n","date":"July 13, 2015 at 10:12 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205500","author":"piero","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"At first: The term Byssus is also used for normal linen in ancient time. Today the oldest fragment is from the 14th century. Maybe there was one from the 4th century, but the fragment and all scientific notice was destroyd during World War II. At second: It is not possible to identify see-silk without making a physical cross-section. Please consult: http://www.muschelseide.ch/en.html\n\n","date":"July 18, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-206105","author":"Frau Bo","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"It does seem as early as the 4th c. CE John Chrysostom knew about Yeshua’s bloodstained linens and overtranslated John 20:4 since there is no indication at all of this from the empty tomb scene as related by the evangelist. Indeed it is completely without NT foundation at all to think/translate the other disciple who saw the said linens/shrouds, was the first disciple to understand the scripture Yeshu’a was to rise from the dead. At that point in time, the said disciple just believed the women who had told him and Peter, Yeshu’a had been taken away from the tomb. To infer “the other disciple “saw the bloodstained linens (especially Yeshua’s long inner burial winding sheet  and believed his master had risen from the dead” is really to go over the top as far as correct hermeneutics is concerned. Now many an Archmiraculist Shroudie cannot care less.\n\n","date":"July 7, 2015 at 6:59 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204890","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Typo: At that point in time, the said disciple just believed WHAT the women had told him and Peter, namely Yeshu’a had been taken away from the tomb. Period.\nAddenda: Re the empty tomb PRE-scene, the apocryphal “Gospel of Peter” describes two men carrying a third (i.e. taking away Yeshu’a) out of the tomb while in the empty tomb scene, Luke 24:12 doesn’t even mention “the other disciple”. It only mentions Peter, which is in sharp contrast with alleged Biblical scholars wanting us to believe “the other disciple” was the FIRST among all the disciples to know the scripture and have faith in his master’s rising from the dead…\n\n","date":"July 8, 2015 at 2:01 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204909","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"I am open minded to the possibility of Yeshua’s return to life and even rising from the dead BUT NOT at the expense of the Gospel accounts’ good hermeneutics and Turin Shroud’s (and Christ’s contact relics’) good archaeology in terms of conclusive evidence and/or alternative solution.\n\n","date":"July 8, 2015 at 5:09 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204918","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"What, in your opinion, occurred to Jesus after his death and burial — according to your studies in hermeneutics and archeology?\n\n","date":"July 8, 2015 at 8:07 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204925","author":"David Goulet","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Another way of eroding faith, both in the Middle East and Europe:\nhttp://cnsnews.com/blog/michael-w-chapman/syrian-catholic-bishop-church-turning-last-page-her-history-middle-east\n\n","date":"July 9, 2015 at 8:10 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-204990","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Thanks for this link Louis, which everyone should read if they want to know what’s really going on in the Middle East.  The whole text, including the contributions from other prelates makes sad and tragic reading.\n\n","date":"July 9, 2015 at 3:23 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205010","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"You’re welcome, Daveb. I have spoken to Arab priests of the Orthodox Church and they told me that Syria is sort of isolated, and the Assad regime, like that of General al-Sissi of Egypt, protects the Christians. Not even the House of Lords paid attention last month to an Orthodox prelate’s pleas when he addressed a session there. We know that 91 churches have been destroyed in the Middle East, so one can imagine how many priceless icons and documents have been lost forever.\n\n","date":"July 9, 2015 at 5:19 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205021","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Syrian Orthodox Patriarch Mor Ignatius Aphrem II Karim more out of Syria because of this:\n https://www.facebook.com/HisHolinessPatriarchMoranMorIgnatiusAphrem2nd\n\n","date":"July 10, 2015 at 11:38 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205148","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"David, re Yeshu’a apparition to Mary Magdalene for instance:\nReminder Zero: Second Temple period gardeners used to wear a sindon next to the skin sort of “himation fashion” i.e. wrapped around the left shoulder, torso yet above knees as outer work wear. Besides to be recognisable from afar (since gardeners handled manure and Jerusalem Temple priests had to avoid defilement) the former were hairless (no moustaches and no beard) and either bald or half bald (See Joachim Jeremias’s Jerusalem in the Time of Jesus and the Talmudic literature).\nReminder One: In Hebrew, “the gardener” can be rendered either by ha-gahnahn (to be connected with ha-Gan Eden) or ha-bigvay that most curiously also means “in my bodies”. \nReminder Two: In Hebrew, the feminine form adamah designates the “earth’s soil” and connects it with adom, “red”, which indicates adam was formed from red soil and literarily can mean “(one made of) red soil” or in other words “red soil man”. Besides red soil is excellent to grow fruits and vegetables.\nWhence Mary Magdalene mistaking Yeshu’a the Son of Adam for the gardener (i.e. an everyday man with flesh and bones; see Luke 24:39), STRONGLY suggests the latter appeared to her not as a heavenly messenger in a glorious body but simply wearing a red soil-like stained sindon (or piece of linen cloth) wrapped (himation/achiton fashion) around his left shoulder, torso and lower thighs, above knees with his legs, hands, arms (as if relatively smeared with the said ‘red-soil’, actually his own blood), head half draped and hairless face visible (no moustaches and no beard = unrecognisable).\n\n","date":"July 9, 2015 at 3:04 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205008","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Besides Yeshu’a had been beaten about his face, which made him all the more unrecognisable to Mary Magdalene.\n\n","date":"July 9, 2015 at 3:10 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205009","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Typo:\nSecond Temple period gardeners were HAIRLESS so that Judeans and especially priests on their way to the Jerusalem Temple andin their preoccupation with the Halakah laws of impurity and defilement, could easily recognize them from afar and avoid impurity and defilement. The former had a hairless face (no moustaches and no beard) and either bald or half bald since they had to specifically shave their head (See Joachim Jeremias’s Jerusalem in the Time of Jesus and the Talmudic literature).\n\n","date":"July 9, 2015 at 3:41 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205013","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"The very facts John and Peter JUST saw the empty tomb and believed what the women had told them namely Yeshua’s tomb was empty (and NOT their master had risen from the dead!) could not be part of the kerygma indeed as far as faith in Yeshua’s rising from the dead is concerned. \nBesides  Yeshua’s bloodstained sindon aka his long inner burial winding sheet aka the Turin Shroud  was no longer within the tomb since most likely Yeshu’a had wrapped it around his body, which caused  Mary Magdalene to mistake him for the gardener; a gardener with flesh and bones (NOT a heavenly messenger with a glorified/glorious body unless one thinks the two angels could have been part and parcel of Yeshua’s ‘heavenly bodies’ left behind him as messengers since in Hebrew bigvay, “gardener” can mean “in my bodies” as well, which is quite another story to substantiate!).\nNo wonder then all the faith archimiraculist shroudies placed in “the empty tomb scene” had to be eroded to the core in spite of all their endless attempts to forcefully have the long inner burial winding sheet aka Turin Shroud aka sindon ‘get back into’ the empty tomb scene at all costs and ‘prove’ John saw (and understood) sthg Peter didn’t and was the first of the disciples to have faith in Yeshua’s resurrection.\nYes, most likely Yeshu’a was draped in the said sindon when he appeared to Mary Magdalene. According to a  fragment from the Gospel of the Hebrews, he finally gave it to the servant/auxiliary of the (high?) priest (Hanan?). (Here the two best candidates at identification with the (high) priest’s servant/auxiliary are John Mark and Joseph of Arimathea).\n\n","date":"July 10, 2015 at 5:40 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205115","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"I’m confused, Max. When and where do you think the image was formed on the Shroud? And if Jesus was alive on Easter Sunday, having been dead Friday, is that not a miracle?\n\n","date":"July 10, 2015 at 7:58 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205133","author":"David Goulet","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"David, \nmost likely the image was formed on burial (during drying procedure as the body (in hyperthermia?) was compressed in shrouds and subjected (in extra height) to a (myrrhic?) aloetic fumigation (the long inner burial winding sheet aka TS being in-soaked with an alkaline water based solution, first sticking front and back to the body and then gradually unsticking front and back).\nThere are many a story of people thought to be really dead and indeed having been buried alive. Ever heard of the story of the woman that was buried alive twice (in the 20th c. CE) and twice came back to life? A supernatural event just cannot be totally ruled out though. \nMiracles or no miracles, I have investigated the Yeshu’a case as far as hermeneutics and archaeology (along with science) make it possible to understand and reconstruct what really happen.\n\n","date":"July 10, 2015 at 9:09 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205136","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Typo: what really happenED\n\n","date":"July 10, 2015 at 9:12 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205137","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Max, quit correcting your typos; it’s annoying and makes you look OCD….\n\n","date":"July 10, 2015 at 4:38 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205173","author":"Nabber","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"This is of course provocative, but it is also food for thought.\nSome Evangelical Christians are against the building of a Mormon temple:\nhttp://www.usatoday.com/story/news/nation/2015/07/14/mormon-temple-christian-opponents/30167063/\nThe allegation is that the Mormons are not really Christian, but who is really Christian in  places where there are separate churches for blacks and whites?\nGalatians 3:28 says:\n“There is neither Jew nor Gentile, neither slave nor free, nor is there male and female, for you are all one in Christ Jesus.”\nSo there is no Jew nor Gentile, but there can be black and white.\nThere are various ways to erode Christian faith.\n\n","date":"July 15, 2015 at 7:08 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-205916","author":"Louis","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"Why…why is here an articel about Badde and the Veil of Manoppello? There were some strange things about the “sientific” examinations. Some fibres were taken from the frame by Sr. Blandina Schlömer. If there was ever an examinination, then they didn´t make it public. Badde gave the information,that these fibers are given to Benedikt XVI as a gift. If you want more information about Byssus, please consult: http://www.muschelseide.ch/en.html .There are also many hints, that this is only a picture. And sorry, but no good artist made it. It´s not an acheiropoietos and the only link to the shroud could be, that the painter tried to construct the face from the shroud…maybe. The hype about the Veil of Manoppello is really dubious.\n\n","date":"July 18, 2015 at 5:19 pm","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-206104","author":"Frau Bo","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"It only requires a single fibre to determine if the Manoppello is made from true byssus or not, the test is very simple, and if a fibre has been taken as reported, then whoever examined it ought to have known immediately.  Byssus is the only known fibre with an elliptical cross-section, easily determined with no more than an optical microscope.  Spectral information would provide supplementary evidence. \nAll known byssus artefacts are uncoloured and undyed, but some have been brightened.  The conventional wisdom is that byssus won’t take colour.  I should think that the only way that the Manoppello could have byssus content is that if it were woven with other non-byssus yarns.  I am unaware if there are any known hybrid textiles involving byssus. \nI find it so frustrating that we have all these remarkable relics, even though some may well be dubious, there are so many NDT techniques available, yet they remain untested, like wall-flowers in a dance-hall.\n\n","date":"July 19, 2015 at 2:41 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-206128","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Christian Faith Eroded to the Very Core?","post":"O.K. They had fibres and it was also in discussion to analyse these by an institute in Berlin (Bundesanstalt für Materialforschung). It was 2007, when Blandina Schlömer made a microscopical comparing between her fibers, which she took from the frame on Black Friday 2007. Her comparing material were 1. see-silk from Antiochia (year 2000), 2. see-silk from Taranto (year 1840), 3. see-silk from a mummy (1000 B.C.). And – blessed be the Lord – all four fibres were see-silk! The Problem ist, that a see-silk fragment from 1000 B.C. would be a scientific sensation. In 2010 a German community (Penuel e.V.) asked Badde about a scientific result an got the answer, that it was taken into a ostensorium and given to Benedeikt XVI by Paul Badde (sic!). Great! Since 2006, when the pope visited Manoppello,  there was “no return”. On the example of Manoppelo we can examine, how relic fakes are made today and were made in older times :-).\nMy problem with Manoppello is, that this event make it harder, to realize that there, could be true relics. And the Shroud of Turin is the most fascinating of all.\n\n","date":"July 19, 2015 at 10:22 am","url":"https://shroudstory.com/2015/07/04/christian-faith-eroded-to-the-very-core/","cat":"article","id":"comment-206155","author":"Frau Bo","site":"shroudstory"}]
