[{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I can and, in fact, DID explain how the image was formed in my book THIRTEENTH APOSTLE: THE COMING TRANSUBSTANTIATION. When I wrote about it,  I had heard of the Shroud but a few days before. The nature and measure of information I wrote up until that time was so comprehensive the idea of how the image was formed took on the role of being a mere footnote, the logical conclusion in a divine syllogism\n\n","date":"April 30, 2015 at 6:06 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-197991","author":"Michael Jude","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"A very close reading of Luigi Garlaschelli would seem to show he was moving towards a two-step model – imprinting followed by development of the primary image to make a more distinct secondary image. I say “seem” because he was not very clear about what his second oven heating was supposed to achieve (I asked him in an email after he kindly sent me his paper but elicited  no reply). He said in the paper that his imprinting medium (artist’s ochre, iron (III) oxide) may have been contaminated with sulphuric acid, picking up on an idea first proposed by Joe Nickell, but did not say why he needed incubation with his modern ochre.\nIt was that reference to sulphuric acid that got me exploring high concentrations of sulphuric acid as an agent able to chemically “scorch” linen, but I was not convinced, given that the acid needed to be both hot and fairly concentrated to discolor linen. Thus the switch to nitric acid that works in the cold, even as a vapour,\nWhen I resume experimentation in a few days tome, i shall try a hybrid system, one in which I imprint with wheat flour and/or other organic materials that are susceptible to chemical change and discoloration, but substitute an oven heating stage for nitric acid vapour treatment.\nAs stated before, the two stage process has a lot going for it, allowing a real person to be used at the imprintingstage, leaving the heat and/or harsh chemicals to a second totally separatedevelopment stage applied to the linen, not the subject.\n\n","date":"April 30, 2015 at 6:07 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-197992","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Good morning, Dan\nI’m sorry to tell you that we will have to cut a long story short. It doesn’t seem that Barrie Schwortz’s statement is stale and he was on the STURP team. He is as qualified in his field as Dr. Paolo Di Lazzaro is in his. My suggestion is that a life size image should be produced, as suggested by Dr. Di Lazzaro, with all the necessary details:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\nI have also detected the tendency to ignore the latest research on the Sudarium of Oviedo:\nhttps://www.academia.edu/11804110/Is_the_Sudarium_of_Oviedo_the_key_to_unraveling_the_mystery_of_the_Shroud_of_Turin\nprepared by someone who also has a PhD.\nRemember, there are anti-Catholic agenda-pushers, obviously those who believe that to get at the Turin Shroud is also to get at the Catholic Church. The relic is not an article of Faith.\n\n","date":"April 30, 2015 at 6:35 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-197994","author":"Louis","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Interesting post raising several ideas.\n1) Joe Nickell: “Proponents lack any viable hypothesis for the image formation.” This of course is true of both sides, although usually used by authenticists to discredit artifiical attempts. However it must be said that various full size sheets with at least some resemblance to the Shroud have been produced by painting (Nickell himself), photography (Allen and Wilson) and acid degradation (Garlaschelli), while nothing more than a couple of centimetres has been produced by vaporography (Vignon), lasers (di Lazzaro), or coronal discharge (Fanti). Attempts to upscale these experiments have either failed completely, or not attempted because the energy required would be outside the realm of science.\n2) “The Rev. Andrew Dalton, a Legionaries of Christ priest who’s a shroud expert.” Why? What makes one a Shroud Expert? What makes Dalton’s suggestions more credible than anybody else’s? I’m not just carping; it’s important, because this is what he says:\n3) “There are details that simply couldn’t have been forged centuries ago. Dalton describes the shroud as the ‘natural effect of a supernatural event.’ ” On what evidence? Just being an Expert?\n4) “Dalton also insists that the samples dating to the Middle Ages were taken from patches added to the cloth after it was damaged by a fire, and he said that other experts caution that ancient cloths often date later in radiocarbon analysis than their actual origins due to bacterial contamination.” This could just be clumsy reporting, but I do hope Dalton insists no such thing.\nHowever I like the way the reporter has summarised both Nickell’s and Barrie Schwortz’s points, especially:\nNickell: “The “blood” has failed a battery of tests by internationally known forensic serologists.”\nSchwortz: “The bloodstains were chemically tested and determined to be actual blood.”\nBoth, of course, perfectly true statements, and wholly contradictory, like so much of the evidence of the Shroud. I thank Dan so much for this blog, where these contradictions can be discussed and analysed, rather than reduced to “I’m right; you’re wrong” attitudes.\n\n","date":"April 30, 2015 at 6:28 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-197993","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"And yet the fact remains, every attempt to reproduce it is missing many details of the Shroud image.  Any impartial judge would simply ignore the blathering.\n\n","date":"April 30, 2015 at 7:09 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-197997","author":"Andy","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Any attempt by you or I to reproduce the Mona Lisa would almost certainly “miss many important details”, Andy. But one could still demonstrate that the lady with the enigmatic smile need not have appeared as if by magic.  \n I cannot speak for others, but in my case it is not the entire panoply of details that one is trying to reproduce. It’s simply that concise checklist of supposedly defining characteristics that some describe as enigmatic, and others describe as “impossible to achieve with conventional physics and chemistry”.\nMaybe we need an updated checklist. I could suggest a few (negative character, 200nm superficiality,  3D properties, mechanical weakening of entire image-bearing fibres, no reverse side image, ease of image detachability, and a collection of somewhat poorly documented and/or ill-defined microscopic properties (notably half-tone effect, discontinuities, striations etc).\nWho needs goalposts (soccer ones that is) that are forever on the move?\n“Blathering” is not an attractive term to use on an open-access website.\n\n","date":"April 30, 2015 at 7:34 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198000","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Back from Turin.\nAs in 2010, it was a wonderful experience.\nColin: “Maybe we need an updated checklist.” of the defining details, the “details” that any kind of model must share with the TS. Yes, we need it otherwise we could discuss endless.\nIn this discussion, we have to face at least two challenges.\n1) The image is necessarily the result of the interaction between the Body Image Formation (BIF) Process and the linen.\n2) The effect of ageing.\nThere are some properties of the image which are directly related to the BIF process: negativity, superficiality at fabric and thread level, 3D properties.\nIn my opinion we can add: high resolution, fuzziness of the contours, “no patch” (the image is continuous in a given image area at macro level).\nBut there are also some properties for which point 1) and or point 2) could be more or less important (or not):\n– The banding effect\n– Narrow range of optical densities\n– No saturation, no “hot point”\n– Faintness\n– Half-tone\n– Discontinuities at micro level\n– Superficiality at fiber level\n– Mechanical weakening of entire image-bearing fibres\n– ….\nIn other words, is it possible to find a rational method to decide that a given model is compatible with the TS image (or not), taking into account Points 1 and 2 ?\n\n","date":"May 3, 2015 at 3:56 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198220","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The problem remains of context even if one does eventually replicate the characteristics. The Mona Lisa may be a superb painting and difficult to replicate but it fits within the historical context. There is a difference between a masterpiece and an enigma.\nIf the Shroud is a medieval creation then I suspect it was a happy accident; that whoever made it was playing around with a few techniques and landed upon one that he/she could not replicate – because the mechanical process was not documented or understood sufficiently to enable a second successful attempt.\nWhat is a miracle? There are many cases of people being spontaneously cured of a terrible disease (like cancer) which stumps the doctors — but is not a paranormal event. It’s not as if the person suddenly grew back a missing limb. That a medieval artisan could create a unique image with the equally unique characteristics we see with the Shroud is not beyond the realm of reason — it doesn’t require a paranormal event. But it would require circumstances that may stump the doctor.\n\n","date":"April 30, 2015 at 9:04 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198005","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"There is a big difference between paranormal and extranormal phenomena, which are human, and supranormal, which could be described as a force from beyond acting in our world. The Austrian Redemptorist priest Prof. Dr. P. Andreas Resch, C.Ss.R., has been studying these for decades in his institute:\n http://www.igw-resch-verlag.at/index.html\n\n","date":"April 30, 2015 at 12:38 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198034","author":"Louis","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I don’t get your point.\n\n","date":"April 30, 2015 at 1:58 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198038","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Telepathy, clairvoyance, poltergeist and so on are human abilities, supranormal would be what Catholicism describes as miracles, what occasionally happens in Lourdes, for example. This also depends on whether one believes in miracles or not, but there is a good book on Pope John Paul II written by the German journalist and author Andreas Englisch, who was the “Die Welt” Vatican correspondent for 20 years. He had lost his Catholic faith as a youngster and regained it later on:\n http://andreasenglisch.de/paepste.php\nThere might be an English translation of his book.\n\n","date":"April 30, 2015 at 5:09 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198047","author":"Louis","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Something I found at Ignatius Press:\nhttp://www.ignatius.com/Products/MJP-H/miracles-of-john-paul-ii.aspx\n\n","date":"April 30, 2015 at 5:47 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198050","author":"Louis","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Directed to David Goulet:\nNot exactly something new, but close to you:\nhttp://blogs.vancouversun.com/2012/02/27/b-c-scholar-studies-mystical-visions/\n\n","date":"May 1, 2015 at 11:36 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198088","author":"Louis","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Thx Louis. Interesting article.\n\n","date":"May 1, 2015 at 11:48 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198090","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"You’re welcome, David. You may have not read or do not remember what a Danish physician and Shroud scholar wrote about a  personal experience in response to question no. 10:\nhttp://www.shroud.com/pdfs/Svensson-refl.pdf\nOccasionally some extraordinary happening is also reported in the media:\nhttp://www.telegraph.co.uk/news/worldnews/europe/italy/1487608/Pope-miraculously-cured-Jewish-millionaire.html\n\n","date":"May 1, 2015 at 1:28 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198091","author":"Louis","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Quite possibly.\n\n","date":"April 30, 2015 at 9:34 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198008","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"““Defining characteristic” must not turned into a trail (trial?) with no ending.”\nSays Mr. Scorch.\n\n","date":"April 30, 2015 at 9:36 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198009","author":"anoxie","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The arguments go back and forth and beyond due to the fact that, except, perhaps, one or two people were meant to understand the ‘miracle’ of the Shroud from day one of their birth\n\n","date":"April 30, 2015 at 9:37 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198011","author":"Michael Jude","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"and so it continues…………..\n\n","date":"April 30, 2015 at 9:38 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198012","author":"Michael Jude","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"One’s models evolve. The very first “scorch” model I proposed, back in December 2011 was a radiation scorch (“thermostencilling”)\nhttp://colinb-sciencebuzz.blogspot.gr/2011/12/turin-shroud-could-it-have-been.html\nThe difference between that and the one proposed by the pro-authenticity ENEA group with its uv excimer lasers was that mine worked with radiation from an ordinary incandescent light bulb, ie. a mix of visible and infrared (i.e. ordinary everyday light and heat).  The ‘trick’ if one may call it such, was to paint the linen with a slurry of charcoal, the latter acting as a trap for electromagnetic radiation that was so efficient that the temperature rise was rapid enough to scorch the linen in immediate contact with the charcoal. The charcoal could then be washed out to leave the scorched-in image. \nHowever, there was one enormous drawback with that model, namely that the artist would have needed to have painted the image as a negative, and a medieval artist who had never laid eyes on a photographic negative would probably not have thought of doing that. Thus the move to contact scorching.  It automatically produces a negative imprint off a heated template whether one wants it or not.  \nBut that model too always had some unsatisfactory features, like working only with inanimate templates, not real human subjects.  But it was pursued for a while for the opportunities it offered to explore 3D-properties. First I could show that contact scorches produced 3D-images as good if not better than the TS, and finally that computer-generated 2D images  (Microsoft Paint!) with no 3D-history could also be 3D-rendered.\nThe switch from thermal contact scorching came about through reading the work of Garlaschelli, with its hints that acids could produce “etching” effects, i.e. chemical scorching, later reinforced by Joe Accetta’s woodblock imprinting model, with its  references to inks and iron mordants, possibly to dyes and alum mordants too. Alum solutions hydrolyse partially to sulphuric acid. Might the H2SO4 be the real imprinting medium?  Abandon contact scorching: let’s try acid scorching. Let’s not allow ourselves to be permanently wed to yesterday’s model.\nSo yes, things have moved on from contact scorches, as they moved on from 2011-vintage radiation scorches. It’s in the nature of science to move on from one model to another, constantly testing strengths and weakness, constantly attempting to refine existing models, but always being ready to dump if a new and better model suggests itself, relying on inspiration from other researchers. That’s science bizz!  It’s essentially collegiate in nature. Don’t tell anyone I told you so.\nAs I say, models evolve. There’s no shame in abandoning a model that has outlived its initial attractiveness. Scientists are essentially love-you-and-leave-you where models are concerned.\n\n","date":"April 30, 2015 at 10:25 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198020","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Colin, you’re doing an excellent job in your attempt to reproduce the Shroud image chemically, using scientific methodology.  This is a difficult project and you are to be congratulated.    Good luck!\nBest,\n\n","date":"May 1, 2015 at 4:50 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198099","author":"Angel","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Thank you Angel. Maybe you and the other members (?) of your nascent Colin Berry fan club would like posters of me for their bedrooms. They will be rolling of the printing press any time soon, available in a range of sizes up to 4.4 x 1.1 m, in a tasteful monochrome colour (sepia). Please be patient: there are one or two small technical details that have first to be attended to.\n\n","date":"May 2, 2015 at 12:23 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198116","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"You’re welcome, Colin.  \nWish I could accept your posters; however, I just shredded 20 years of pharmaceutical research notes.  I’ve no more room in my condo for papers and books.\nTake care!     :)\nBest,\n\n","date":"May 4, 2015 at 6:46 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198314","author":"Angel","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“Despite being the most studied artifact in history …  modern science is still unable to explain the image or how it was made.”\nTwo problems with that statement;\n1. You assume that, “modern science” is really trying to solve it. Other than a few people I don’t see that.\n2. They can’t get at it to do more test. Today’s science is not the same as 1978’s or 1988’s science. We know more on what to look for now.\nHere’s the way I see it.\nDaveb came up with a good idea to do new C14 test, but I don’t think that the church is ready for that. How about new blood test? Right now I’m 50-50 on the Shroud, but if there is real human blood than  I would be 90-10 that’s it’s the real deal. I bet there are a lot of people like me.\nReal Human blood is very powerful evidence for me.\nWhat does the church have to lose? Most Christain I came across believe because of the Bible,not the Shroud. Other that don’t believe may take a new look at that Bible. It’s a win-win.\n\n","date":"May 2, 2015 at 9:01 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198139","author":"John Green","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Dan,\nI have just posted a comment in this thread but it does not appear ??\n\n","date":"May 3, 2015 at 4:11 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198222","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Dan,\nI have just posted a comment in this thread but it does not appear ?? \nTrying again, I got: “Duplicate comment detected; it looks as though you’ve already said that!”\n\n","date":"May 3, 2015 at 4:15 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198223","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"It happened to me a few times before.\n\n","date":"May 3, 2015 at 5:07 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198227","author":"O.K.","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I’ll look into it. Unfortunately, I’m not at my computer. I am just posting this from my iPhone. I will let you know.\n\n","date":"May 3, 2015 at 5:18 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198229","author":"Dan","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Back from Turin.\nAs in 2010, it was a wonderful experience.\nColin: “Maybe we need an updated checklist.” of the defining details, the “details” that any kind of model must share with the TS. Yes, we need it otherwise we could discuss endless.\nIn this discussion, we have to face at least two challenges.\n1) The image is necessarily the result of the interaction between the Body Image Formation (BIF) Process and the linen.\n2) The effect of ageing.\nThere are some properties of the image which are directly related to the BIF process: negativity, superficiality at fabric and thread level, 3D properties.\nIn my opinion we can add: high resolution, fuzziness of the contours, “no patch” (the image is continuous in a given image area at macro level).\nBut there are also some properties for which point 1) and or point 2) could be more or less important (or not):\n– The banding effect\n– Narrow range of optical densities\n– No saturation, no “hot point”\n– Faintness\n– Half-tone\n– Discontinuities at micro level\n– Superficiality at fiber level\n– Mechanical weakening of entire image-bearing fibres\n– ….\nIn other words, is it possible to find a rational method to decide that a given model is compatible with the TS image (or not), taking into account Points 1 and 2 ?\n\n","date":"May 3, 2015 at 4:24 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198224","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Miraculously my lost comment is here above.\nSince the subject is the “details”, I would be very interested in your answer to the question at the end of my post. \nThanks.\n\n","date":"May 4, 2015 at 1:50 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198300","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The crux of the problem, surely, is the reason for there being a negative image on the cloth that converts to a positive of near-photograph-like quality, how that initial image could have been formed, pre-photography, how it appears to be intrinsic to the top 200nm of thereabouts of the linen fibres, with the spectral characteristics of degraded carbohydrates,\nI’m trying to package up the ones that make the TS image “iconic” or “enigmatic”, not because it’s about pro- versus anti-authenticity, not for this blogger at any rate, but because we’re told the crucial set of unique characteristics make the TS inexplicable in terms of conventional science.\nCan you or someone else, TH, name a single scientist with original and significant discoveries to his or her name outside of TS studies who has ever endorsed the view that the TS or indeed any physical artefact, is beyond science? It’s almost a matter of definition that scientists – real ones who pursue open-ended research – never give up on the conventional science. Each new day brings a new angle, a new insight. There’s always something new to try, provided one operates with a minimum of preconceptions. Preconceptions (as distinct from provisional models) are the death of science.\n\n","date":"May 4, 2015 at 2:14 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198302","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“In other words, is it possible to find a rational method to decide that a given model is compatible with the TS image?” Well, yes, as you more or less described above. First, the image must be sufficiently ‘negative’ and shaded to be able to produce an approximate 3D image, second the image must be confined to the upper fibres of the cloth and to be transparent to transmitted light, thirdly, the image must be achievable by conventional medieval science or conventional dead body/cloth interaction. To omit any one of these areas scientifically in favour of miraculous intervention is a bit of a cop out.\nJust recently I have been pleased and surprised to read Pope Francis’s recent speech to the Pontifical Academy of Sciences, where he emphasised the rationality of the Catholic faith (something dear to Pope Benedict too), saying “God is not a demiurge or a magician” and encouraging their work on evolution and the origin of the universe. Whether he believes the Shroud is authentic or not, I bet he doesn’t believe it is supernatural.\n\n","date":"May 4, 2015 at 3:06 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198303","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hello again folks. Have today found that the results with the new model can be obtained using a thin slurry of white flour with COLD water with a consistency intermediate between that of milk and single cream. Have today posted 18 new photos.\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/05/modelling-turin-shroud-my-flournitric.html\nWhile I had predicted earlier on theoretical grounds that native wheat endosperm cells, such as exist in uncooked white flour, would bond well to linen fibres (due to like-for-like attraction of primary cell walls of similar chemical composition) I never for a moment imagined just how well.  Not only does the flour dispersion behave like an instant adhesive, bonding the linen to skin, but it also makes the linen conform closely to body relief:\n\nIsn’t that amazing?\nIt then took a bit of effort tearing the linen away from my hand for Stage 2 development (nitric acid vapour, as before).  Superficial linen fibres were broken in the process, creating a kind of fleece. Might a similar bonding at the imprinting stage have contributed to the ‘iconic’ nature of the TS image (i.e.fuzzy, ghostly quality) one wonders?\nI’m thinking of doing  a facial selfie using the new technology,  but may have to cut the imprint into quarters for separate development, given the limited capacity of my developing tank (the size and shape of a goldfish bowl).\n\n","date":"May 3, 2015 at 5:24 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198231","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Paper mache? I too am amazed at the result of your experiment but we aren’t looking for a 3 dimensional image model, just one that photographs that way. Or is this merely a stage which leads to that model later?\n\n","date":"May 3, 2015 at 8:04 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198234","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Oh dear. Methinks you need to visit my site, DavidG, and remind yourself of how the new (old?) technology  works. ;-)\nIn brief: paint a portion of one’s own or someone else’s anatomy with a milky-white suspension of white wheat flour in water. Press the painted part of that anatomy into linen to leave a very faint, indeed near-invisible imprint. Leave the imprint to dry, then suspend the linen above conc. nitric acid taking all the necessary precautions (gloves, eye protection, face mask, ventilation, lab technician training etc etc). The HNO3 vapour reacts chemically with flour constituents (proteins, carbohydrates etc) to ‘develop’ the latent image. Not for nothing do I call it “chemography” which, like pre-digital photography, is a two-step procedure: capture of latent image, followed by chemical development. \nI say that 13th/14th century alchemists (especially) had the technology, given that flour was a dietary staple, and Pseudo-Geber/?Paul of Taranto had described the preparation of nitric acid vapour by heating a mixture of  saltpetre (potassium nitrate), Cyprus vitriol (copper sulphate) and  alum (potassium aluminium sulphate). The imprinted linen could have been suspended in the hot vapour to get rapid yellowing and image development. Alternatively, the vapour could have been condensed in a cooled collecting vessel to get conc. nitric acid, and the linen suspended in the cold vapour above the liquid to get slow colour development as in my procedure, which takes several hours.\n\n","date":"May 3, 2015 at 11:20 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198240","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“Methinks…” I thought it was Max replying for a second. :)\nThanks for the Chemography for Dummies recap. That was helpful.\n\n","date":"May 4, 2015 at 8:04 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198280","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hmmm. Dummies… like shop dummies.  You’ve just given me an idea, DavidG …\nTo whom it may concern. I  have been loyal customer of your splendid menswear for many years, and been especially impressed by your shop window displays. I was wondering…,\n\n","date":"May 4, 2015 at 8:14 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198281","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Colin, Have you any idea as to why anyone would want to carry this bizarre operation?\nI think you are still hooked on the idea that the images today are the same as the images were when they were created and that the Shroud was somehow unique in its own day rather than today’s ( almost) lone survivor of the hundreds of thousands of painted linens of its own day. \nThe answer is only going to come from a new intensive examination of the surface of the Shroud. Flury- Lemberg got as far as ruling out the reweaving hypothesis, I wish they had gone further in 2002. But pope Francis, if you are reading this, why not give the go- ahead for a top Italian textile conservation lab to examine the Shroud? The expertise in medieval ( or earlier) textiles is out there and the technology is many times more sophisticated than anything available in 1978 or even 2002.\n\n","date":"May 4, 2015 at 1:24 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198246","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“Colin, Have you any idea as to why anyone would want to carry this bizarre operation?”\nPerhaps you’ll find your answer here, Charles: it’s something I’ve copied/pasted from an earlier posting on my own site, one that has your name in the title. I’ve bolded up the English translation (enhanced Google).\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/02/might-shroud-of-turin-properly-be.html\n Extrait de la lettre de l’évêque Pierre d’Arcis, au pape Clément VII, résidant en Avignon (Lettre écrite en 1389) :\nFrom the letter of Bishop Pierre d’Arcis, addressed to Pope Clement VII, residing in Avignon (Letter written in 1389):\nhttp://andreadicaffa02.unblog.fr/2011/08/05/\n« L’affaire, Saint Père, se présente ainsi. Depuis quelque temps dans ce diocèse de Troyes, le doyen \n“The case, Holy Father, is as follows. For some time in the diocese of Troyes, the dean \nd’une certaine église collégiale, à savoir celle de Lirey, faussement et mensongèrement, consumé par la\nof a certain collegiate church, namely that of Lirey, falsely and untruthfully,  consumed by the \npassion de l’avarice, animé non par quelque motif de dévotion mais uniquement de profit, s’est procuré \n passion of avarice, driven not by any reason of devotion but only of profit, procured\n pour son église un certain linge habilement peint sur lequel, par une adroite prestidigitation, était la \nfor his church a certain cloth cleverly/cunningly painted on which, by a clever sleight of hand, was  \n représentée la double image d’un homme, c’est-à-dire le dos et le devant, le doyen déclarant et  \nshown the double image of a man, that is to say the back and the front,  the dean declaring and\nprétendant menteusement que c’était le véritable suaire dans lequel notre Sauveur Jésus-Christ avait \nclaiming untruthfully that it was the true burial shroud in which our Saviour Jesus Christ had\n été enveloppé dans le tombeau, et sur lequel le portrait de Sauveur était resté imprimé avec les plaies \nbeen wrapped inside the tomb, on which the Saviour’s portrait had been imprinted with the wounds \nqu’il portait.\nthat he bore.\n […] En outre, pour attirer les foules afin de leur extorquer sournoisement de l’argent,    \nIn addition, to draw crowds for the purpose of extorting money slyly, \n de prétendus miracles ont eu lieu, certains hommes étant loués afin de se donner pour guéris \n so as to claim that miracles have occurred, using hired men as to make it appear they had \n lors de l’exposition du suaire, dont chacun croit qu’il est le suaire de Notre-Seigneur. \n been cured upon exposure of the shroud, each convinced it is the shroud of Our Lord.\nMgr Henri de  Poitiers  de pieuse mémoire, alors évêque de Troyes, étant mis au courant de ces faits\n Bishop Henri de Poitiers of pious renown, then bishop of Troyes, being made aware of these facts \n et pressé d’agir par de nombreuses personnes prudentes, comme c’était en effet son devoir\n and urged to act by many responsible people, as was indeed his duty \nsa juridiction ordinaire, se mit à l’oeuvre pour découvrir la vérité dans cette affaire.\nin the exercise of his ordinary jurisdiction, set to work to uncover the truth in this matter.\nCar beaucoup de théologiens et de personnes visées déclaraient qu’il ne pouvait s’agir\n For many theologians and persons who were consulted (had) declared that it could not be\n du suaire authentique de Notre-Seigneur dont le portrait se serait ainsi imprimé dessus,\nthe authentic shroud of Our Lord whose likeness had been imprinted upon it, \npuisque les saints Evangiles faisaient pas mention d’une telle impression, alors que si elle s’était produite,\nas holy Gospels did not mention such an impression, whereas if it had occurred,\nil semblait bien évident que les saints évangélistes n’auraient pas omis de le rapporter,\nit seemed obvious that the Evangelists would not have omitted to report it,\n  En fin de compte, après avoir déployé une grande diligence dans son enquête et ses interrogatoires,\nIn the end, after a thorough investigation  and interrogation, \net que le fait ne serait pas demeuré  caché jusqu’à nos jours.\nand that the fact would not remained hidden until today.\nil a découvert la fraude et comment ledit linge avait été astucieusement peint,\nhe discovered the fraud and how the said cloth had been cunningly painted, \n la vérité étant attestée par l’artiste qui l’a peint, autrement dit que c’était une oeuvre due au talent d’un \n the truth being attested by the artist who painted it, namely that it was the talented work of said\nhomme, et non point miraculeusement forgée ou octroyée par grâce divine»\nman, and not miraculously wrought or bestowed by divine grace “\n(Texte latin reproduit par U. Chevalier, Etude critique sur l’origine du Saint Suaire de Lirey-Chambéry-Turin, 1900, Annexe, document G, p. VII-VIII).\n(Latin text reproduced by U. Chevalier, Critical study on the origin of the Shroud of Lirey-Chambéry-Turin, 1900 Annex G, p. VII-VIII).\n\n","date":"May 4, 2015 at 2:00 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198249","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"There is nothing here that is incompatible with a linen painted according to the usual medieval craft traditions but, like many other such relics, passed off as something  else.\nThe difference is that it was quickly spotted as a scam by ‘responsible people ‘  who urged the bishop to act and dealt with. Eventually a compromise position was adopted ( in 1390 by Clement VII) that this cloth had some spiritual significance – probably there had been some alleged miracles or visions associated with it- that allowed Clement to gIve it indulgence status but reaffirming that it could not be the  real thing. There were thousands of  spiritual objects, etc, that  had this status.\nTheologians made the point that remains relevant today that no gospel mentions images. Personally I think this rules out a forgery as any forger would have known that this obvious response to an imaged cloth would have proved fatal to his attempted deceit. \nI think there is a good case for the Vatican to follow within this tradition.\nI think that if there had been anything unusual about the Shroud’s images these would have been mentioned. This report suggests that it was a run of the mill linen painting job.\n\n","date":"May 4, 2015 at 2:51 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198251","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"My advice to those who are new to this debate is to read carefully Charles’s brief account of what Bishop Henri de Poitiers thought about the Shroud of Lirey, as set out in his successor’s memorandum. \n“No one has found any significant evidence of the Shroud’s existence before 1355, when it appeared in a chapel at Lirey, in the diocese of Troyes, supposedly advertised there as the burial shroud of Christ. Such sudden appearances of cults were common in a Europe recovering from the trauma of the Black Death. They caused a great deal of frustration for a Church hierarchy anxious to preserve its own status. The bishop of Troyes, Henry of Poitiers, whose responsibility it was to monitor such claims in his diocese, investigated the shrine and reported that, not only were the images painted on the cloth, but that he had actually tracked down the painter. After this clerical onslaught, the Shroud was hidden away for more than 30 years. Yet the Church accepted that it was not a deliberate forgery and in January 1390 the (anti-)pope Clement VII allowed its renewed exposure in Lirey. This suggests that the Shroud may have been credited with unrecorded miracles, thereby acquiring the spiritual status to make it worthy of veneration. Doubtless aware of the earlier claims by the Lirey clergy, Clement insisted that it was publicly announced before each exposition that this was NOT the burial shroud of Christ.”\nAsk yourself this question: does it accurately convey the sense of the original? Look to see how Charles dealt with terms like “cunningly” and “sleight of hand”\nIf it doesn’t, then ask yourself this question: is Charles’s “History Today” piece a work of  detached and objective scholarship, or merely a spin-doctored re-hash of a crucial historical document, unworthy of a true academic?\n\n","date":"May 4, 2015 at 3:20 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198252","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I am not sure what your point is, Colin. If you want to make these ad hominen attacks you need to substantiate them, especially as the original texts are in Latin and/or medieval French.\n I am sure that those who read my full article will make up their minds on it, thought sadly we have not been able to afford the copyright costs of the illustrations I need to give it its full impact.\nThe point is that the major documents talk of an artist not an alchemist and words such as ‘depinxerat’ from ‘depingo’, I paint’, in the Latin original are used .\nRemember we also have the 1449 description of the Shroud by the Benedictine monk in Liege who describes it as ‘miro artificio depicta’, ‘admirably painted’, again using the verb depingo.\nSo let’s apply Occam’s Razor here and assume that the word depingo is used in its normal sense of ‘to paint’.\nYou can put away the flour and the chemicals and enjoy the spring May holiday! I am quite worried that you might suffocate yourself with the potions you are concocting.\n\n","date":"May 4, 2015 at 4:51 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198259","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Don’t give me that poppycock about original Latin texts, Charles. If you were the genuine academic historian you claim to be (which you are not) then you would have taken the trouble to acquire the Latin text and get it translated directly into English..\nThere is nothing in the least bit ad hom about for pointing out sloppy scholarship. I’ve made my case, over and over again on this site, and NEVER had a cogent response from you. Go write some more pop history Charles, – but kindly don’t waste my time with your trivializing and dogma.\nOn the subject of sound scholarship, there’s  a world of difference between saying\n(a)  that something is just a painting, and is immediately obvious as such, \nas distinct from saying:\n(b)  it’s an exceedingly clever forgery, one that most people mistake for a real burial shroud, but the work of a clever painter who set out deliberately  to deceive. \nIf the historical record makes it clear that it’s meaning (b), then to present it as (a) might also be seen as an attempt to mislead, or deceive. \nLet the historian believe it to be “just a painting” if he wants, but there’s no excuse for distorting the historical record to make it seem as if everyone viewing the Lirey shroud, a life-size IMPRINT, frontal and dorsal  as might be left by  a REAL bloodied victim of crucifixion,  thought the same way, when it’s abundantly clear they did not. The two bishops would not have fired off memos if everyone had immediately dismissed the Lirey shroud as “just a painting”. The historical record says otherwise.\n\n","date":"May 4, 2015 at 5:06 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198262","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I have the original Latin  text with me and my 2,000 page, three columns a page Lewis and Short Latin dictionary to help me out when i am stuck!\nIn the 1350s, after the trauma of the Black Death, we know that there many false cults that sprang up in the emotional chaos that followed. One can imagine the same thing happening in an African village where half the population had died of Ebola. it was a very unusual period. \nThe important thing is how quickly ‘responsible people’ spotted the scam and reported it to the bishop who makes it quite clear that he thought the Shroud was painted. Do you think he never tracked down the painter?\n\n","date":"May 4, 2015 at 5:22 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198264","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"P.S. Surely your biggest problem,Colin, is that once you have found the right chemical formula for the original  creation of the image in whenever, you have also to be sure that it will remain stable for the next several hundred years so that  it matches what we have today.\nI am playing safe with my discoloured after the pigments have fallen off linen hypothesis. At least I don’t have to go out and order more medieval flour.\n\n","date":"May 4, 2015 at 1:50 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198248","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"This is definitely a grey area. Charles says on the one hand that no one one would have accepted an imaged cloth as a forgery, but on the other hand that as a painted Shroud it would have been perfectly acceptable. I don’t really follow the reasoning behind that. If the Shroud was not “supposed” to have anything on it, then surely painting anything on one, even a theatrical prop, would have been unnecessary and confusing.\nOn the other hand, a Shroud with a smudgy, vague image would not have been considered particularly miraculous, but simply a possible result of a body lying in it. That would do well as a stage prop, and transfer well, I think, to being considered original, if there was some extraneous reason to do so. I don’t think the image itself was considered particularly miraculous, especially as the various Veils of Veronica were so much more impressive. But as Charles says, there may have been a healing miracle or some such associated with it.\nOn the other hand….\n(Lots of hands…)\nIf Henry of Poitiers did not denounce the Shroud as a fraud, why was it put away for 20 or 30 years before re-emerging in the 1380s?\n\n","date":"May 4, 2015 at 4:49 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198258","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, I think the distinction here is between  an object deliberately created to deceive pilgrims into thinking it was the real grave cloth and an object representing the rising of Christ which no one would originally have considered to be authentic ( a view confirmed for the Shroud by Clement VII).\nIf you imagine what a medieval church, with no artificial lighting, would have been like in the early Easter morning light (when  we know the Quem Queritis ceremony took place), then the idea of putting dramatic pictures on a cloth makes some sense. In my article I quote a French Bible dictionary of 1912 which specifically mentions that the Easter cloths were painted on. I am cautious about using such a late source but there are also the early Mozarbic rites for Easter that describe how ‘Peter ran with John to the tomb and saw the recent imprints of the dead and risen man on the linens’. This certainly suggests that linens with images on them were associated with the Easter rituals.\nWhat often happened, and I have come across many documented examples, is that an object that no one believed for a moment to be authentic, suddenly achieved a status by becoming associated with a miracle. So at Prato, there was a perfectly ordinary fresco of the Virgin and Child. An eight year old boy reported that the Virgin had come down from the picture, dumped the baby Jesus on the ground, gone into the local prison, cleaned it out, came back, picked up the babe and popped back into the fresco. He was believed and there is a lovely Greek cross church on the site and if you go in the original fresco is in a prominent place on the altar. I suspect that some such happened with the Shroud but the problem is when.\nAs all too often with the Shroud, real rseearch on these issues has hardly begun.\n\n","date":"May 4, 2015 at 5:14 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198263","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Re the alleged ‘fraud’ the Avignon Antipope Clement VII would have officially acknowledged, this is an anti-shroudies’ myth.  Reminder for anti-shroudies: they are BOTH shroudies AND anti-shroudies myths!\n\n","date":"May 4, 2015 at 6:04 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198267","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Typo: THERE ARE\n\n","date":"May 4, 2015 at 6:07 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198268","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Reminder for Colin: \nThe TS distorted hand images does show both orthogonal and non-orthogonal properties, which your ‘impeccable’ physical model does not explain at all.  E.g. at the TS man’s four-fingered hand level, there are slight shifts and displacements gradually recorded too. Most likely, the recording of the stiff rigid seemingly long dislocated arms and seemingly long fingers on the right hand imply:\n– at least both tight-fit wet linen cloth pressure and disclocated arm counter-pressure as the said arms tended to lift up all by themselves above body level\n– the tautly stretched AND moulded around linen cloth didn’t quite return to its natural size and shape as it got sort of taut again through shrinking.\nWet linen fabric can both be stretched tightly (almost like a drum), and shrink when subjected to an external and/or internal heating source. To make imprints in parts is one thing and a uniform imprint of the whole bloodied body back and front quite another.\n\n","date":"May 4, 2015 at 4:54 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198260","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The two gentlemen are mistaken as to the status of the alleged memorandum said to have been dispatched by Bishop Pierre D’Arcis of Troyes to Avignon Antipope Clement VII.  \nThe myth owes its origins to a conspiracy perpetrated by those two worthy(?) churchmen, Ulysse Chevalier & Herbert Thurston.  \nThe matter, including reasons for the fraud, is fully dealt with in a paper to be found at:\nhttp://www.shroud.com/pdfs/n55part3.pdf   \nThe author is well-practised in prosecuting perpetrators of fraud within USA jurisdictions.\n\n","date":"May 4, 2015 at 5:02 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198261","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"As I’ve said before, my interest in the TS has little or nothing to do with authenticity, my being reasonably content with the 88 dating, despite the restricted sampling (let those who reject the dating petition the Vatican or Turin for a repeat, if only to dismiss the silly notion of “invisible reweaving”).\nMy beef is with those so-called scientists (better described as engineers and technologists in most instances) who say that the TS image characteristics are unexplainable with conventional science, who for the most part have done scarcely any scientific research in the lives, who handle things and applications, not ideas, not concepts, not experimental models.\nThey even attend and/or give papers workshops that have provocative titles like “INTERNATIONAL WORKSHOP ON THE SCIENTIFIC APPROACH TO THE ACHEIROPOIETOS IMAGES “.\nYes,unbelievable, isn’t it, that they assume the TS has a supernatural origin (“not made by human hand”), despite that not being the position of all adherents to authenticity, yet maintain  they are adopting a scientific approach. When was a supposed supernatural event ever reproduced in the laboratory? What are the specific signatures of a supernatural event? Is there a manual on the subject?\nMy aim is simply stated: to show that a faint and superficial negative image can be imprinted onto linen, using contact with a real person or effigy. I see absolutely no difficulty re the 200nm visible image thickness, that being the approx thickness of the flax PCW. There is almost certainly chemical change at a deeper level, probably less visible, due to damage to the hemicelluloses that cross-link cellulose microfibrils within the SCW core of the fibre.\nThis morning, I took my first imprint off my own face using white flour slurry as imprinting medium. I used LUWU  geometry for starters, it being simpler and more predictable\n( LUWU = Linen Underneath, With Underlay). Image capture in LUWU is determined largely by the ease of  deformability (i.e. degree of ‘give’)  of the underlay. The linen is presently in nitric acid vapour, with the sepia image just starting to appear. I’ll hoik it out the chamber late afternoon to see how it looks, It can always go back if not sufficiently developed. Might this be the very first chemographical selfie?\n\n","date":"May 4, 2015 at 6:24 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198270","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Er… no… No gentleman has made any reference as to the status of the d’Arcis memorandum, nor claimed that it was dispatched at all. It may not have been, as Jack Markwardt has so ably pointed out. However I find it curious that daveb refers to it as an ‘alleged’ memorandum, as I am not aware that even Markwardt denies that it exists, and that it is by d’Arcis.\nAssuming that it does exist and that it is by d’Arcis, it seems to express his feelings about the Shroud. Does daveb think it is all lies? Does he think that Henry of Poitiers did not suppress the exhibition of the Shroud? Does he think that Bishop Henry, or Bishop d’Arcis, was lying?\nThe evidence that either bishop was lying is that a hundred years later the same Shroud was now claimed to be genuine (and all the evidence since 1900 so interpreted).\nThe evidence that the bishops were not lying comes from the fact that as soon as both of them had made their investigations, exhibition of the Shroud was, indeed, suppressed, as they wished (and all the evidence since 1900 so interpreted).\n\n","date":"May 4, 2015 at 6:37 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198272","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Historians are often much more interested in documents that have not been sent on the grounds that they have not been ‘spun’ before sending and thus more likely to reflect what the writer actually believed. So if the d’Arcis memorandum was never sent this might be a point in favour of its fundamental accuracy. Hard to see why it should not be accurate.\nClement VII must have got his view that the Shroud was not authentic from somewhere- so if not the D’Arcis Memorandum perhaps there are lost documents- usually the case sadly.\nI rather like the status of ‘pop historian’  (quote C.Berry)- might give me some credibility with my children.\nBut there i was wishing Colin well when I am afraid he might poison himself with his alchemy or frighten off his pets with his flour-whitened face and all i get in return is unsubstantiated attacks on my professionalism!!\n\n","date":"May 4, 2015 at 7:03 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198274","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"In fact one needs only the faintest smear of flour paste to get an imprint onto linen.\n\nThat’s me in the mirror this morning, self-painted, ready to press face into linen.\n\nEven before development, there’s a recognizable image (no photoediting). But I don’t have a beard or moustache. Hmmm.\nI’ll let that image sit in nitric acid vapour for a few more hours.\n\n","date":"May 4, 2015 at 7:55 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198279","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Just the fact that the Shroud was described as a painting disqualifies that whole discussion.  Already in the Sixth Century learned men could tell it was not a painting, as it was described more than once as not made by human hands.\n\n","date":"May 4, 2015 at 7:40 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198278","author":"Nabber","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"No, Nabber that was not the Shroud – it was the Image of Edessa, something quite different.\n\n","date":"May 4, 2015 at 8:47 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198286","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I don’t think that “not made by human hands” described a technique, rather than an artist. I’m certain the Image of Edessa looked very much as if it could have been made by human hands, but it was generally believed that it was made supernaturally.\n\n","date":"May 4, 2015 at 9:56 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198289","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"One wonders why the Image of Edessa was judged to have made supernaturally if it was made by human hands. Were the people then cockeyed, half blind? There were many paintings around during the period, so why was this particular image considered to be unique? What made them reach such a judgment?\n\n","date":"May 4, 2015 at 10:45 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198294","author":"Louis","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Having worked for some time on relic cults, it is impossible to predict which ones fall and which ones rise. Some relics of the blood of Christ had enormous success, others failed to attract anyone. Why was the piece of the True Cross I was shown in Lucca some weeks  ago have hardly any followers while just down the road in the cathedral, the Volto Santo – the holy face of Christ on a wooden cross – has an enormous following.\nThe ‘not made by human hands’ relics are often linked to the campaign  to show that Christ wished to be shown in images.\n\n","date":"May 4, 2015 at 10:59 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198295","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"People in general probably don’t believe that any pieces of the “True Cross” are really extant, however that attitude will change a little when a wooden cross has a holy face of Christ. I have had even non-Christian friends who wondered what Jesus looked like and  have even poked fun at long-haired young men by telling them that they tried to look like Jesus.  \nOne doubt is raised when it comes to the campaign to show that Christ wished to be shown in images. If that was what they thought, why didn’t they just paint faces of Christ? Would anyone paint such an image and claim that it was not made by human hands?\n\n","date":"May 4, 2015 at 2:08 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198301","author":"Louis","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"HF: “…  However I find it curious that daveb refers to it as an ‘alleged memorandum’, as I am not aware that even Markwardt denies that it exists, and that it is by d’Arcis.\nAssuming that it does exist and that it is by d’Arcis, it seems to express his feelings about the Shroud. Does daveb think it is all lies? Does he think that Henry of Poitiers did not suppress the exhibition of the Shroud? Does he think that Bishop Henry, or Bishop d’Arcis, was lying?”  \nChevalier created the impression that the memorandum was in fact dispatched to Clement VII.  My recollection of Markwardt’s paper is that he asserts that it was a final draft sent to a specialist scrivener expert in preparing formal documents addressed to the papacy, but there is no evidence that it went any further than this.  Markwardt’s reasons for stating this are Chevalier’s deliberate omissions, subsequently compounded by Thurston.  Hence it is an ‘alleged memorandum’.   \nThere is no evidence that D’Arcis’ predecessor, Bishop Henry objected to the expositions except the claim made by D’Arcis, who was unable to cite any document by Henry or provide any reference in his draft, nor even a definite date when it was supposed to have been sent, nor is there any present extant archived document by Henry to the purpose.  \nContrariwise, Bishop Henry is known to have been effusive in his praise for Geoffrey de Charney’s efforts and character.  \nThere are several possible reasons why D’Arcis objected to the expositions and prepared his draft.  D’Arcis was financially strapped for much needed maintenance and repairs to his own cathedral, whereas pilgrims who might have been expected to support it, were flocking to the small village church at Lirey for the expositions, so he made the best case he could in raising his objections.  He may have truly believed that the Shroud was a forgery, or else he may have been mistaken in what was in fact painted.  The Latin verb “depingere” can also have the meaning of “copy”, whereas “pingere” is more usual in describing something painted.   One explanation is that Jeanne de Vergy may have commissioned such a painting to replace the cloth taken from Besancon, and this is the actual cloth mistakenly referred to by D’Arcis some 35 years later.  \nIn view of any local ecclesial objections to the expositions, it is not surprising that they went into abeyance.  However the English defeats of the French, resulted in De Charnay’s widow and family being somewhat pauperised and deprived of much needed finance.  Hence the subsequent decisions of Geoffrey II and Margaret de Charney to renew the expositions, resulting in the D’Arcis’ objections.  An additional factor for caution in asserting authenticity, was the possibility of the Shroud being one of the many pillaged relics from Constantinople, with the implied threat of possible excommunication of those still involved.\n\n","date":"May 4, 2015 at 3:45 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198304","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“Domum pinxit” = “He painted the house” = maintenance work. \n“Domum depinxit” = “He painted a picture of his house” = “a landscape depiction”.\n\n","date":"May 4, 2015 at 5:09 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198309","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“Iesum pinxit” = “He painted Jesus” = Face painter.\n“Iesum depinxit” = “He painted a picture of Jesus” = “a portrait”.\n\n","date":"May 5, 2015 at 1:30 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198330","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Daveb you wrote: “The Latin verb “depingere” can also have the meaning of “copy”, whereas “pingere” is more usual in describing something painted.” \n100% agree. As early as 1988,the following was my personal translation in French of the AM key passage:\n“(…) finalement elle fut trouvée la fraude et comment le linge avait été peint avec art ( = l’art d’un peintre copiste) ; preuve fut même donnée par un artiste qui l’avait copié que de main humaine il n’avait pas été fait (et) non point par miracle réalisé ou bien accordé (…)”\nAnd here is my comment in one of my early 1990 memos entitled  (Drap Mortuaire de Turin: Vers une Nouvelle Solution Archéologique de l’Enigme ?)\nUNE COPIE DE “MAIN HUMAINE” ?\n“Le document fondateur de la thèse du faux moyenâgeux, — d’où est extrait ce passage-clé (du memorandum attribué à Pierre D’ARCIS, évèque de Troyes (1375-1390 de l’è.c.) — s’avère être le mémoire — non daté, non signé, non scellé — d’une lettre inconnue des archives officielles — et dénonçant à Clément VII, antipape d’Avignon, le Drap Mortuaire exposé à Lirey, en Champagne, come une fausse relique, ce sur la foi du témoignage introuvable et unique d’un peintre-copiste non identifié qui aurait été consulté sur la question…”\n“La valeur testimoniale de ce document est d’autant plus surestimée (par les opposants à l’authenticité de la relique) que, par toute une série d’expertises et de contre-expertises, il a été dûment constaté que l’absence de pigments constitutifs d’une telle ‘peinture de haute définition’ et, en chaque point du linge, de tout tracé directionnel — que n’aurait pas manqué de laisser une “main humaine” –, la stabilité hydrothermique et le caratère chimiquement pur de l’image du corps, la perspective apparente de la double effigie faciale et dorsale — sans source lumineuse et sans aucun contour — qui jaillit du seul constraste qui oppose les fibres d’images aux fibres de fond sans image, sa conception inversée dans l’espace — inincorporable dans une telle ‘peinture’ grandeur nature et comme projetée à distance sur plan écran –, la surinformation de ses détails, la parfaite conformité de ses tâches de sang avec l’anatomie, la physiologie de la circulation et de la coagulation sanguine, avec la neurophysiologie et les phénomènes de conduction nerveuse, son double caractère tridimentionnel et “esthétiquement” singulier… infirment une telle accusation !”\n\n","date":"May 5, 2015 at 4:36 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198336","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Typo: évêque\n\n","date":"May 5, 2015 at 4:38 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198337","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Off-track, but worth reading. Its about how memorandums,documents, scriptures are interpreted from time to time. A rabbi has reached the conclusion that there is no God and no life after death after rethinking Torah:\nhttp://chicago.suntimes.com/news/7/71/569467/rabbi-herman-schaalman-reassessment\n\n","date":"May 4, 2015 at 4:38 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198307","author":"Louis","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Mr Berry and Mr Freeman are helping us to believe in Shroud of Turin as a genuine one.\nI like Mr. Berry’s experiments. Still he struggling to achieve the features of Shroud of Turin.\nFurthermore Mr. Freeman’s hypothesis is very interesting. His painted image became a photographic Negative with 3D coding. (painted pigments flaked off miraculously giving us a negative image). What sort of miracle is it.\n\n","date":"May 4, 2015 at 6:04 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198312","author":"Sampath Fernando","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Markwardt’s paper makes the,to me, fatal mistake of assuming that if the D’Arcis memorandum was not sent, then it was all lies. In fact, if it were not sent, it is more likely to be a true representation of what happened. With such a major misconception I dislike the insinuations that Markwardt makes about Chevalier’s character. They are unwarranted.\nLewis and Short do not mention that ‘depingo’ can be translated as ‘copy’ and it is certainly the fullest Latin dictionary i know and is my mainstay in such things. I have the copy belonging to my great uncle Kenneth Freeman who was Senior Classic at Cambridge so I assumed he had only the best! We have the 1449 reference to painting (‘depicta’) as well.\nI have repeatedly said that the Shroud surface needs to be examined with the latest technology by experts who are used to dealing with ancient linens, painted and otherwise. None were on the STURP team, as their failure to recognise that an image just on the surface of the cloth was just what the medieval craftsmen’s manuals advised ( in order to let painted flags flutter in the breeze).\nI am happy to rely on the findings of specialists. I suspect that the so-called negative image is the result of the different thicknesses of the original paint/pigments  before they disintegrated but I await the expert examination. The important thing will be to focus on the hypothesis to rule it in or out (as the Oxford lab helpfully did for John Jackson’s carbon monoxide affecting the dating hypothesis which they ruled out).\nEven if the images on the Shroud remain  unexplained ,there is no logical reason why this makes the Shroud authentic. It just makes it one of thousands of objects in a similar state waiting for science to advance enough to provide an explanation for them..\nI await a single piece of scientific evidence that is replicable and so acceptable to the scientific community as a whole that the Shroud dates to before- well I was going to say AD 50 but I shall be generous and say AD1000 as that would take it into a different context from that of the medieval period which is where my own ( limited) investigations are focussed.\n\n","date":"May 5, 2015 at 4:29 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198335","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"” I suspect that the so-called negative image is the result of the different thicknesses of the original paint/pigments before they disintegrated but I await the expert examination.”\nAnd Charles has the cheek to describe my imprinting procedure as “bizarre”. Imprinting ALWAYS gives a negative image, something that Charles was unable at least initially on this site to get his head around, having Dan and others constantly telling him that a negative image was not simply the same as a mirror image.\nImprinting is not painting, unless an artist were trying to fake the appearance of an imprint. But most here, trusting mainly to plain old commonsense I suspect, will have realized that a faked, i.e. painted-in-the-negative  imprint could never have produced anything as photograph-like as the Secondo Pia negative.\nYou might not like my nitric acid step (but did you ever stop to consider the advanced state of European 13/14th century alchemy, i.e. proto-chemistry, with roots in Persia and Arabia in your research for ‘History Today’ before deciding it was all about ART history. (Nope, it ain’t, which is why there’s only one iconic and enigmatic TS).\nMy imprinting is NOT bizarre, far from it.  It’s a solidly-scientific mainstream approach, one that has far better underpinning in science  in my humble opinion than any other hypothesis that attempts to account for a negative image. It’s yielding results by the hour that to me at any rate make the TS a little less enigmatic, but a remarkable appliance all the same of science and technology to create a faith-reinforcing  illusion (as it continues to do so to this day).\nAs for your suggestion that I (and others, notable Hugh Farey) have not considered ageing effects, words fail me. Would you like links to my postings that go back to 2012? Flaking blood? Image fibre attrition? These were just some of the things that we were discussing here when you were totally preoccupied with your spat with Ian Wilson over how many times a tetradiplon had been folded. I would go further and suggest you don’t know the half of it where the enigmatic characteristics of the TS are concerned, except that as vulgar fractions go, 1/2 would be conceding far too much.\n\n","date":"May 5, 2015 at 5:07 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198339","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I totally agree with you, Colin. I don’t know half of it, perhaps even less (although I think a lot of the limited amount I know may be quite relevant), which is why I am happy to leave it to specialists in ancient painted linens to decide when,if ever, there is a new examination of the surface of the Shroud.\nI am not going to plough back into your extended posts especially as you keep changing your mind and starting again, but I think ‘bizarre’ is a fair summary of your attempts at recreating medieval alchemy. They seem unnecessarily complicated especially as there is no reason to suggest that the original creation of the Shroud was out of the ordinary within the context of its own day.\nThe tetradiplon issue was important for two reasons. First, Wilson gave a misleading summary of the  text he was relying on by implying that the cloth had been folded tetradiplon AFTER Christ had wiped his face on it while the text clearly says that it was folded tetradiplon BEFORE it was handed to Christ with no evidence that it refolded as such afterwards.\nSecondly, we have the interesting  depiction of the cloth used in the Parthenon ceremonies, that went on into the fourth century AD, that shows that the cloth there was indeed folded double four times. Again Wilson gives a misleading illustration that shows only three double foldings- if he had the fourth it would have cut through the face and ruined his argument!\nI think it is best to leave it at that and not discuss further why Wilson made these apparently elementary errors.I don’t have Jack Markwardt’s killer instinct in these matters!\n\n","date":"May 5, 2015 at 6:06 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198342","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“I am happy to leave it to specialists in ancient painted linens to decide when,if ever, there is a new examination of the surface of the Shroud.”\nLeaving it to specialists is a doubtful strategy at the best of times. What kind of time scale are we looking at? Years? Decades?  Meanwhile, untested hypotheses litter the literature.\nYes, I’m on my 9th model. So what? That’s the way science operates – embracing models, then (probably) dumping them for another. At least we don’t expect “specialists”, least of all illusory ones, to do our work for us. All my first 8 hypotheses were tested experimentally by myself and found wanting. Maybe the same fate awaits the 9th. So what?  Nobody is forced to read my blog, and you don’t anyway.\nAs it happens, Model 9, “bizarre” or otherwise,  is looking quite promising, though I say it myself.\n\n","date":"May 5, 2015 at 6:18 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198345","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"There is no harm in your continuing your work to the nth model, Colin, but what is the rush? Neither of us have any specific expertise in ancient or medieval  textiles, neither of us have worked in a laboratory that specialises in the conservation of such things-so what we can say is,as you say, limited.\nBetter to get it right through specialist help rather than waste time following up false paths. The focus should be on getting these specialists to take an interest and the pope to support them.\n\n","date":"May 5, 2015 at 6:50 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198350","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"2nd attempt at sending (from email inbox):\n“Neither of us have any specific expertise in ancient or medieval textiles|”\nWrong. I do Charles. The chemical composition of cell walls, whether of flax or other flowering plants, in terms of celluloses, hemicelluloses and pectins has been essentially constant for millennia. Nature is very conservative in these matters. Hemicelluloses cross-link and thus stiffen cellulose microfibrils via hydrogen-bonding interactions. It works. Why change it?   Hemicelluloses may well be the key to understanding the TS image and probably the mechanical weakening of image-bearing fibres as well, due to their disruption in the PCW and SCW  by the image-making process (regardless of mechanism). Pectins are an essential component of the middle lamellae that separate bast fibres in flax. They bind calcium too (probably the source of your “gesso”).There are no grounds for thinking that the more fragile (relative to cellulose) hemicelluloses and pectins are different in modern v medieval linen. \nIt’s hard to say what’s worse: blinding with science, or blinding with inappropriate art history.  Science seeks to enlighten. Are you trying to enlighten with your tendentious art history narrative, Charles? Or simply intent on debunking the science?\n\n","date":"May 5, 2015 at 7:24 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198358","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I am sorry, Colin, but i have obviously missed your references to ancient textiles that you have worked on. Thats the trouble with your writing such long posts- one misses the important points.\n\n","date":"May 5, 2015 at 12:10 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198395","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Given our historian’s belief that ancient works of art gradually shed their pigments over the centuries till nothing remains except a ‘negative shadow’ (make of that what you will folks) one wonders what age he would give to the following:\n\nLet’s make it a multiple choice:\nSame age as the Shroud, if a 14th century “painting”?\n500 years younger?\n500 years older?\n\n","date":"May 5, 2015 at 1:20 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198402","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Painted linens were very vulnerable as the pigments were only just on the surface of the cloth which is why we have so few left. The Shroud received a lot of rough treatment as it was folded, unfolded and refolded many times especially In the seventeenth century.  In fact it was remarkable in that the pigments seem to have lasted until the nineteenth century. A lithograph of 1868 shows that by then one of the images seems to have disintegrated and it was just this exposition that saw the Shroud placed in a frame for the first time. \nThis illustration looks as if it is five hundred years earlier and it will probably have survived because it will have been kept out of the lights and have  a vellum base but I can’t say more than that. It certainly will have a better base than linen and won’t have been folded. It will have been kept shut up for much of its life. The linens that have survived with their images intact have usually been pasted onto wooden backing.\nI did an adult course at Cambridge University on medieval illustrated manuscripts and there are wonderful ones surviving from as early as the fifth century because they have been kept out of the light. No such luck for the Shroud.\n\n","date":"May 5, 2015 at 1:46 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198405","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Certainly older but may be as late as the twelfth century- although there are similar columned lists like this which go back to the ninth century and perhaps, Rabbala Gospels, ,even earlier. No obvious comparison with a linen painting ,of course so this is not a very good attempt to prove your case.\n\n","date":"May 5, 2015 at 2:03 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198406","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Well, there’s a challenge then. Practically the entire classical corpus is available on the internet, so can Max or daveb find one single instance of depingere meaning to copy? That whole canard is a red herring. (I bet that’s difficult to translate into French!)\n\n","date":"May 5, 2015 at 5:02 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198338","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Much as I would like to refresh my at one-time excellent school-boy Latin, I don’t really have the time to search the entire classical corpus to find a specific use of a particular word which might or might not satisfy the challenger. \nHowever “depingere” would seem to be derived from the verb “pingere” = ‘to paint’ and the preposition “de” used as a prefix meaning ‘from’; thus strictly, “depingere” would mean ‘to paint from’ that is, ‘to copy’.  \nSome on-line dictionary meanings: \nhttp://legal-dictionary.thefreedictionary.com/depingere\n“depingere:  See also: delineate, depict, describe, portray\nBurton’s Legal Thesaurus, 4E. Copyright © 2007 by William C. Burton. Used with permission of The McGraw-Hill Companies, Inc.  ”\nhttps://glosbe.com/la/en/depingere\n“We don’t have straight translations, but we think one of translations given below may be right. Be careful.”\nSeveral possible meanings given including:\n“depict, put, to describe, portray, to paint, to picture, to lacquer, to paint a picture, …\nplus several more.  Automatic Google “paint”  “. \nIan Wilson also has asserted that it may mean “to copy”. \nFrom the form of the word I should say that applying paint to an object, one ought to use the word “pingere” but if one were to depict an impression of an object on a canvas, one ought to use the word “depingere” (thus past perfect = “depictum”.  \nVerbs that more specifically mean to copy include:  transcribo (transcribe), imitor (imitate), sequor (to follow), none of which really convey the idea of copying a picture, and clearly Pierre D’Arcis was of a similar mind.  But he did not use “pingere”, and despite Charles strange hypothesis, there is no sign of any residual remnant of paint remaining on the Shroud cloth!\n\n","date":"May 5, 2015 at 6:50 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198348","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“However “depingere” would seem to be derived from the verb “pingere” = ‘to paint’ and the preposition “de” used as a prefix meaning ‘from’; thus strictly, “depingere” would mean ‘to paint from’ that is, ‘to copy’.”\nGood try, but absolutely no cigar. Lewis and Short, those heroes of our youth, very helpfully give dozens of references for the two words, many of which can be checked in context.\nWhile depingere almost certainly means to “paint from,” the sense of “copy” as of one image to another, is wholly absent in all them. It means, as its derivation does now, “depict.” If representing a person or scene onto a flat surface is copying, then I am happy for you to use the word in that sense, but it is some way removed from the idea that the Shroud complained about by d’Arcis was a copy of another Shroud.\n\n","date":"May 5, 2015 at 7:07 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198353","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"‘Ian Wilson has also asserted that it may mean to copy’ ,\nWell, that settles it then- we don’t need a Lewis and Short to guide us.\nWilson admitted to Averial Cameron, the great Byzantine expert, that he did not know any Byzantine Greek ( despite his authoritative interpretations of  documents in Greek) but perhaps his Latin is better.\n\n","date":"May 5, 2015 at 7:22 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198357","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I do hope that DaveB has a better source for his translation of depingere than Ian Wilson who is not a classicist. Perhaps DaveB can tell us where he did get the idea that depingere means to copy as no one else seems to be able to find one .\nHaving told us (The Shroud, 2010,p.145) that depingere can mean ‘to copy’, Wilson goes on to translate the passage as ‘the truth being attested by an artist who had copied it’  which seems special pleading to me unless we have some academic support for depingere meaning to copy. \nAnd as yet we haven’t. I hope that it is not just an invention by Wilson.\nI do find the way people follow anything Wilson says like sheep really extraordinary. It has completely closed down research into other links between Jerusalem and western Europe/Constantinople that provide much more promising routes to the west for the Shroud if it does prove to be authentic.\n\n","date":"May 5, 2015 at 12:45 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198399","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Reminder for Charles: the verb copio, “to copy, to reproduce” (as far as painting is concerned) has NO Perfect and Pluperfect Active Indicative in Medieval Latin, which could account for the use by Pierrre D’Arcis of depinxerat, “he had painted”, actually to mean no so much “he had painted” as “he had copied/reproduced”. No philologist worth his/her salt should rule out here the possibility.\n\n","date":"May 5, 2015 at 1:11 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198401","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"BTW as early as 1988, I first thought the D’Arcis memorandum depinxerat could be rendered by “he had copied” too. In his 1991 translation, French Shroud scholar, Bruno Bonnet-Eymard rendered it by “he had reproduced”. This was well before “(Wilson) told us (The Shroud, 2010,p.145) that depingere can mean ‘to copy’.”\n\n","date":"May 5, 2015 at 1:25 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198403","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"From a non-expert.\nHugh wrote:\n“Well, there’s a challenge then. Practically the entire classical corpus is available on the internet, so can Max or daveb find one single instance of depingere meaning to copy? That whole canard is a red herring. (I bet that’s difficult to translate into French!)”\nDepingere.\nIn French we have the verb “peindre”: to paint and the verb “dépeindre”: to depict, to picture, to describe. Very different from “to copy”.\nThe preposition “de” does not necessarily mean “from”.\nIt seems that it is the same for Latin, including medieval Latin.\nSee for example:\nhttp://gallicalabs.bnf.fr/ark:/12148/bpt6k6219058z/f248.zoom.r=depingere\n” Depingere: Ce verbe est utilisé dans l’antiquité et au Moyen-Âge à des reproductions par la mosaïque, le tissage des étofes et les émaux”\nMy translation: “Depingere: this verb was used in ancient times and in the Middle Ages for reproductions using mosaics …”\nIn this context, the term “reproductions” (in French) does not mean a copy but a product able to represent something.\nI agree with Hugh.\nDepingere does not mean “to copy”.\n\n","date":"May 5, 2015 at 3:27 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198413","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Thibault, BTW in English as in French, “copier” (e.g. to copy a text, a miniature) and “reproduire” (e.g. to reproduce a text, a miniature) are synonymous. \nMethinks Thilbault totally missed the implication re the linguistic fact medieval Latin verb copio had no perfect and pluperfect active indicative in other words Pierre d’Arcis (who was not even speaking or writing Thibault’s modern French!) just could use at best one Latin word here (the word depinxerat) to mean the artist had made a painted copy or reproduction (reminder the latter words are synonymous!) of the Shroud of Christ. \nHad Pierre d’Arcis really meant the artist had painted the Lirey Shroud (that was not a painting btw and the latter fact was already known from old then!) or made a more elaborate/original painted copy with fresh-looking blood of the Besançon shroud (a copy of a copy), a threnos-epitaphios-like Christ lying back on his shroud  or any other Christ Shroud copy/reproduction, could Thibault tell us which medieval Latin verb was best suited if depinxerat wasn’t?\nCan now Thibault tells us what Pierre d’Arcis really meant by “he had painted it”? What was he referring to?  Was he referring to an artist that painted the Lirey Shroud or did Henry de Poitier just consulted an artist who once copied/reproduced the Besançon or another Christ Shroud… painted copy (as imitation of an imitation) in terms of susbtitute relic? If the word depinxerat only mean “he had painted” how come then the word could be most ill-suited to describe the LIrey Shroud aka Turin Shroud? Was Pierre d’Arcy deliberately/unconsciouly misrepresenting the case to the pope? How come Henry de Poitier’s expert artist mistook the Lirey Shroud image for a painting when most obviously (except for Charles) it was not as far the relic’s aesthetic singularity is concerned? \nActually through the eye of a medieval observer, the fully displayed dorsal and frontal image could look more like “an embalmed skin of an old bearded man with four legs, two at the front and two at the back” than a painting (see e.g. the Knights Templar testimonies). \nBruno Bonnet-Eymard (who is far more familiar with Latin than both Thibault and Hugh put together), translated depinxerat as “He had reproduced (= copied”). And so did I before I even knew about his translation. Actually I kept the three most relevant acceptions “painted/reproduced/ copied” here involved.\n\n","date":"May 5, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198420","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Charles, \nHow can you tell for sure Pierre D’Arcis did NOT misrepresent the Lirey Shroud case to the pope and/or wrongly thought the said Shroud to be just a more elaborate painted copy of a threnos-epitaphios-like painting of Christ ‘lying on his back’?\nHow then will you translate into MEDIEVAL Latin the French verb “copier” in reference to a medieval copyist-painter who would have painted it after a then extant or known but lost template?\nHow can you account for a medieval super-genius forger-painter who would have painted a fine linen shroud to oddly feature (for the first time ever in history!) Christ’s burial sheet with the latter’s ‘bloodied body’ dorsal AND frontal  images in head-to-head discontinuity along with four geometrical series of burn-holes implying the cloth was folded in four, inner/image side down/hidden, and used as an altar cloth to celebrate the Eucharist?\nE.g. how can you account for the following bloodstain pattern analysis fact: in terms of CHAIN-LIKE SHAPED crests and valleys, anatomically speaking, the very shape of the back of the TS right forearm blood flow is TOTALLY consistent with the chain-like shaped extensor carpis ulnaris and digiti minimi muscles of the back of the right forearm bulging in conjunction with its veinous network (see below ‘bulging right forearm’ to the left of the observer)?","date":"May 5, 2015 at 6:12 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198343","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Can Hugh TOO answer the above question, PLEASE?\n\n","date":"May 5, 2015 at 6:17 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198344","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Yes, of course I can, Max; it’s a pleasure. The random trickles on the Shroud in no way whatever match the hills and valleys of the musculature they cover, as a moment’s observation of the back of your arm will show. Thus there is nothing to account for; there is no chain-like pattern of crests and valleys; and the flow is totally inconsistent with the musculature you describe. How’s that?\nNo, I thought you wouldn’t like it; so find a good muscly photograph of the back of an arm, draw on it the blood flow from the Shroud, and show that your idea has some kind of substance. Otherwise, Max, well I’m afraid the word ‘fantasy’ can’t help creeping into my mind.\n\n","date":"May 5, 2015 at 6:50 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198349","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, My fault, I should have known you have not the sight-and-brain coordination system to correctly decipher an archeological bloodstain pattern when you see one.\n\n","date":"May 5, 2015 at 6:59 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198352","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, besides I do think you most obviously just cannot accurately placed the extensor carpis ulnaris and digiti minimi muscles of the back of the right forearm in conjunction with the venous network.\n\n","date":"May 5, 2015 at 7:32 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198361","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Can Hugh translate into medieval Latin then:\n“preuve fut même donnée par un artiste(-peintre) qui l’avait copié que de main humaine il n’avait pas été fait” \nIn my translation of the D’ARCIS memo, I FIRSTused BOTH copié ET peint since BOTH translations are relevant within the specific context: \n“(…) finalement elle fut trouvée la fraude et comment le linge avait habilement été peint ; preuve fut même donnée par un artiste qui l’avait peint/copié que de main humaine il n’avait pas été fait (et) non point par miracle réalisé ou bien accordé (…)”\nAnd then I found the whole passage made a lot more sense if Henri de Troyes’ one and unknown artist called as expert was BOTH a copyist and painter not just a painter.\n\n","date":"May 5, 2015 at 6:56 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198351","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Typo: “finalement elle fut trouvée la fraude et comment le linge avait habilement été peint ; preuve fut même donnée par un artiste qui l’avait peint/copié que de main humaine il avait été fait (et) non point par miracle réalisé ou bien accordé (…)”\n\n","date":"May 5, 2015 at 8:58 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198373","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Most likely the one unknown artist (Henri de Troyes consulted) had copied/painted the Besançon Shroud or another allegedly ‘Shroud of Christ’ and thought the Lirey Shroud to be just another copy of a threnos-epitaphios-like Christ lying on his back.\n\n","date":"May 5, 2015 at 6:37 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198346","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The Henry of Troyes’s artist might well have even thought the Lirey Shroud was nothing but a clever/cunning reproduction/copy of the Besançon Shroud!\n\n","date":"May 5, 2015 at 7:18 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198355","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"…or another alleged ‘Christ’s shroud’.\n\n","date":"May 5, 2015 at 7:25 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198359","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Indeed, there is a world of difference between the TS and its copies!\n\n","date":"May 5, 2015 at 7:39 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198362","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The true fraud (or biased presentation) was to assert the Lirey Shroud WAS “the true burial shroud in which our Saviour Jesus Christ had been wrapped inside the tomb, on which the Saviour’s portrait had been imprinted with the wounds” when actually NOBODY could TELL FOR SURE WHETHER IT WAS OR WASN’T.\n\n","date":"May 5, 2015 at 8:08 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198365","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"As usual, Max, your last seven posts contain not a shred of actual evidence. I don’t know what to make of your translation as I cannot find the Latin text – perhaps someone could assist here? – but it differs from other translations.\n\n","date":"May 5, 2015 at 7:56 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198364","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh re substance, I ask you AGAIN: could YOU translate into medieval Latin:\n“preuve fut même donnée par un artiste(-peintre) qui l’avait copié que de main humaine il n’avait pas été fait” \nor couldn’t you? Still waiting.\nRe the bloodstain pattern evidence I gave you, most obviously, I repeat, you just cannot accurately place the extensor carpis ulnaris and digiti minimi muscles of the back of the right forearm bulging in conjunction with the venous network to really detect a fairly good and even striking match with the CHAIN-LIKE SHAPED blood flow/trail on the back of the TS right forearm. Since a picture is worth a thousand words and If I got time, I’d enhance (use of red as a false colour) the chain-like shaped extensor carpis ulnaris and digiti minimi muscles of the back of the right forearm bulging in conjunction with its venous network as shown in the above illustration.\n\n","date":"May 5, 2015 at 8:22 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198367","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, \nHow strange for an alleged Shroud scholar debating the transalation entropy of the D’ARCY memorandum you haven’t even got the Latin text!\nLatin key sentence: (…) probatum fuit etiam per artificem qui illum depinxerat, ipsum humano ope factum, nonmiraculose confectum vel concessum (…)\nMy translation in French (with relevant /acceptions/) : “(…)  preuve fut même donnée par un artiste qui l’avait peint/reproduit/copié que de main humaine il avait été fait et non point par miracle réalisé ou bien accordé (…)”\nWhat medieval latin word would you use instead depinxerat to translate “copié/reproduit”, “copied/reproduced”?\n\n","date":"May 5, 2015 at 8:50 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198370","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Typo: Instead of depinxerat, which medieval latin word would you use to translate “copié/reproduit”, “copied/reproduced”?\n\n","date":"May 5, 2015 at 8:53 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198371","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Of course I could, Max, but I don’t choose to. Why not? Because it is a complete red herring. We should be translating from d’Arcis’ Latin memorandum into modern languages, not the other way about. I’ve no doubt that you would disagree with whatever I came up with anyway, which would simply be petty and irrelevant. And why should anyone re-translate your rather free translation (que de main humaine il n’avait pas été fait) anyway? What purpose would it serve?\n“You just cannot accurately place the extensor carpis ulnaris and digiti minimi muscles of the back of the right forearm bulging in conjunction with the venous network to really detect a fairly good and even striking match with the CHAIN-LIKE SHAPED blood flow/trail on the back of the TS right forearm.” Yes, I can. No, you can’t. Pics or it ain’t so.\n\n","date":"May 5, 2015 at 8:54 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198372","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, if you really could accurately place it, as you MOST misleadingly claim, you just could not have missed the chain-like apect of the bulging muscles and venous network of the back of right forearm specific area. \nSince you don’t want to/cannot translate the whole sentence I gave you to translate, AT LEAST can you tell me what’s exactly the medieval Latin word for “copied/reproduced” as far as painting is concerned?\n\n","date":"May 5, 2015 at 9:10 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198375","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The back of right forearm is here to the right of the observer (whereas, in my previous illustration, it is to the left)\nhttps://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS3P396lbn6l0MT_t3MabCYFM4eAYYxZP-iI_kxOrDgdqOg3XVF\n\n","date":"May 5, 2015 at 9:41 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198377","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"There are none so blind as those who will not see\n\n","date":"May 5, 2015 at 9:48 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198378","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"BTW my translation in French is (with relevant /acceptions/): \n“(…) preuve fut même donnée par un artiste qui l’avait peint/reproduit/copié que de main humaine IL AVAIT ETE FAIT et non point par miracle réalisé ou bien accordé (…)”\nDon’t you reproduce a typo, please!\n\n","date":"May 5, 2015 at 9:14 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198376","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“Don’t you reproduce a typo, please!” I copied and pasted your own words, Max. Try not to make these errors in the first place if you don’t want them reproduced.\nAs for your request about the Latin for making a copy of an existing painting, try the letter of Pliny the Younger to Vibius Severus, where he is trying to find an artist who can copy paintings. A relevant passage is: ” Nam cum est arduum similitudinem effingere ex vero, tum longe difficillima est imitationis imitatio” translated as “So I beg you to find as careful a painter as you can, for while it is hard to paint a portrait from an original, it is far more difficult to make a good imitation of an imitation.”\n\n","date":"May 5, 2015 at 9:52 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198379","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, BTW what’s exactly that makes you think Pierre d’Arcy is referring here to the very artist that painted the Lirey Shroud and not an artist just consulted as expert?\n\n","date":"May 5, 2015 at 10:14 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198381","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, I asked you: “Since you don’t want to/cannot translate the whole sentence I gave you to translate, AT LEAST can you tell me what’s exactly the medieval Latin word for “copied/reproduced” as far as painting is concerned?”\nYour ‘reply’:\n“As for your request about the Latin for making a copy of an existing painting, try the letter of Pliny the Younger to Vibius Severus, where he is trying to find an artist who can copy paintings. A relevant passage is: ” Nam cum est arduum similitudinem effingere ex vero, tum longe difficillima est imitationis imitatio” translated as “So I beg you to find as careful a painter as you can, for while it is hard to paint a portrait from an original, it is far more difficult to make a good imitation of an imitation.””\nFirstly: was Pliny living in the Middle Ages and practicing Medieval Latin? Are you kidding or this is news indeed!\nSecondly: imitatio, “imitation” as a noun is NOT the Medieval Latin word for “COPIED”, a conjugated verb not even for the word copy that is copia!? \nActually, it just mean that you just do not know or cannot translate “copied/reproduced” in MEDIEVAL Latin as far as painting is concerned.\n\n","date":"May 5, 2015 at 10:29 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198382","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The Medieval Latin verb copo, to copy”, has NO Perfect Active Indicative!\n\n","date":"May 5, 2015 at 10:44 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198385","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"…, which could account for the use by Pierrre D’Arci of depinxerat actually to mean no so much “painted” as “copied/reproduced”.\n\n","date":"May 5, 2015 at 10:47 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198386","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh wrote: “Practically the entire classical corpus is available on the internet, so can Max or daveb find one single instance of depingere meaning to copy? That whole canard is a red herring. (I bet that’s difficult to translate into French!)”\nNow allow me to ask you to give me the third person of the singular ithe n perfect and/or pluperfect active indicative of the Medieval Latin verb copio, “to copy”, ‘to reproduce”, “to transcript” …if you can (I bet that’s difficult to find for an Englishman).\n\n","date":"May 5, 2015 at 11:40 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198391","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Typo (typing in haste sorry):The Medieval Latin verb copio, “to copy”, “to reproduce”, “to transcript” has niether Perfect Active Indicative nor Pluperfect Active Indicative!\n\n","date":"May 5, 2015 at 11:19 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198388","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, methinks your lack of prerequisite knowledge of Medieval Latin verbs and archaeological bloodstain pattern analysis dramatically is no fantasy at all!\n\n","date":"May 5, 2015 at 12:00 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198392","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Your lack of prerequisite knowledge of translation entropy too is no fantsy at all!\n\n","date":"May 5, 2015 at 12:08 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198394","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"See link at:\nhttp://www.google.fr/url?source=imglanding&ct=img&q=http://image.slidesharecdn.com/basic-intravenous-therapy-1-anatomy-1264132415-phpapp02/95/basic-intravenous-therapy-1-anatomy-18-728.jpg?cb=1264111960&sa=X&ei=Q_tIVbHoCLCP7AbPu4CwCA&ved=0CAkQ8wc&usg=AFQjCNGns_d8cwFZp611uMPEyc8SKF3R5Q\n\n","date":"May 5, 2015 at 12:19 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198397","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"For the paradim of copio see link at:\nhttps://www.google.fr/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0CCQQFjAA&url=http%3A%2F%2Flatinlexicon.org%2Fparadigms.php%3Fp1%3D4000763&ei=8vxIVeu3B4P8UsrlgZgO&usg=AFQjCNExHTxrxtiJj8o-7_cbUxKA6eVTTg&sig2=thQ9Oc-eYP3h3v-Rqr6yEA\n\n","date":"May 5, 2015 at 12:26 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198398","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Etymologically speaking, copio (as far as painting is concerned) via Medieval Latin copia (from ops, opis, “power, ability, resources”) can mean TO PAINT with resources, ability and power.\n\n","date":"May 5, 2015 at 12:46 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198400","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"For a painter to reproduce antomically accurate bloodstain patterns of a blood flow running along the back of the TS man’s right forearm, resources, ability and power are really needed indeed!\n\n","date":"May 5, 2015 at 1:43 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198404","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"According to Pliny, “while it is hard to paint a portrait from an original, it is far more difficult to make a good imitation of an imitation.” What about painting/reproducing a 3D encoded high resolution realistic about-two-meter-high dorsal and about-two- meter-high frontal bloodied body negative image on a long winding sheet?\n\n","date":"May 5, 2015 at 3:09 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198411","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Max, reminder: please try to avoid all the short posts. You were doing really well on this until today. I know it’s hard for you, but it makes following the various threads more difficult.\n\n","date":"May 5, 2015 at 2:10 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198407","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The tunnel vision on display here, months after that deluded magazine article, is simply woeful. Note how it’s always “paint”, never “ink”, despite the major difference in the way they attach to cloth, parchment or paper (physical v chemical bonding respectively). The illustrations in that 9th century Gospel are of course inks, highly permanent inks, not paint, inks being soluble pigments that penetrate the fibres and thus cannot delaminate.\nNor do we see any mention or recognition of first hand reports such as this one, a mere 150 years or so post the Lirey display, where there was clearly no possibility that the courtier regarded the Shroud as a “painting”.\nFrom shroud.com site (History): \nApril 14, 1503\n“Savoy courtier Antoine de Lalaing records of the events of that day: “The day of the great and holy Friday, the Passion was preached in Monsignor’s chapel by his confessor, the duke and duchess attending. Then they went with great devotion to the market halls of the town, where a great number of people heard the Passion preached by a Cordeilier. After that three bishops showed to the public the Holy Shroud of Our Lord Jesus Christ, and after the service it was shown in Monsignor’s chapel.” Lalaing adds that the Shroud’s authenticity has been confirmed by its having been tried by fire, boiled in oil, laundered many times ‘but it was not possible to efface or remove the imprint and image.’ \n\n","date":"May 5, 2015 at 2:13 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198408","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Where did I say that the illustration I correctly dated from my own study of such things was painted? Come on, Colin, you provided an illustration that has absolutely no relevance to the painting on the Shroud and I did not even comment on how it was coloured.\nIf you want to turn the question to illuminated medieval manuscripts, usually on vellum before paper came in, then I shall  be delighted as the quality of art to be found is way beyond anything to be found on the Shroud and full of interest. I am a great fan which is why I chose to do a specialist course at Cambridge on them.\nPerhaps you are letting the vapours get to you, Colin. Why not take a break until we have more specialist findings on the images on the Shroud. I agree that it is frustrating especially when there is the expertise on painted linens out there and it just has to be brought into contact with the Shroud itself!\n It is extraordinarily unlikely that without any known experience of examining painted medieval linens ( STURP had the same problem) that you will get there first and may well poison yourself in the process.\n\n","date":"May 5, 2015 at 3:17 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198412","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"My theory is that the Shroud was created by leprechauns, commissioned to make it exchange for gold. Just wait until the relevant experts in leprechaun handicrafts can be brought in contact with the Shroud. Then you’ll all see I’m right. Faith and begorrah.\n\n","date":"May 5, 2015 at 3:59 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198416","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I must say that your leprechauns sound marginally more relevant to the TS, DavidG, than anything that’s come thus far from the misdirected iconoclasm of Charles Freeman. One’s reminded of Saddam Hussein’s Scud missiles aimed at Tel Aviv that landed in the wrong country.\n\n","date":"May 5, 2015 at 4:50 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198419","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"So that less than 200 years after the “Quem quaeritis?” cloth had been painted, not a vestige of the paint remained, but only the underlying image in all its entirety could be seen.  And even of Cardinal Bellarmine’s loin cloth there was no sign nor mention.  \nThe word “depingere” = ‘to paint from’ conveys well enough the idea of ‘depiction’ rather than ‘to apply paint’ as does “pingere”.  \nThere are several possible reasons why Pierre D’Arcis might be motivated against the expositions at Lirey.  He would not know of the Byzantine traditions of images “not made by human hands”, the gospel Passion narratives omit any reference to an imaged cloth, and he would see it as his episcopal duty to suppress any new superstitious cults from arising.  Pilgrims were flocking to this small country village, whereas his own cathedral was languishing in a state of disrepair.  \nAs for the alleged artist, he remains unnamed, unidentified, and would seem to be a figment of hearsay.  In citing Bishop Henry’s objections, no evidence is produced, not a single document, not even a date, but only a vague time lapse of about 35 years ago.  \nIn making a case against Chevalier’s and Thurston’s misrepresentation of the memo, the duties of prosecuting counsel are to state a motive and to cite the evidence, and this Markwardt does.  He can be expected to find fault with their actions, and to impugn such deceit.  It is the contrary duty of defence counsel to defend their character, not that of the prosecution’s.\n\n","date":"May 5, 2015 at 3:57 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198415","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Max, my problem is that I have no idea whether you have any better idea about medieval Latin than anybody else. Simply announcing how right you are and how wrong I am demonstrates nothing, and as for pontificating that copio had no perfect – how can you know? You may never have come across one, but that’s a far cry from it actually being the case. By 1755 I can can find examples of both perfect and pluperfect of copiare.\nYou last dozen or so posts boil down to a statement that d’Arcis used the word ‘depinxit’ to mean ‘copied from another painting’, because ‘copiavit’ was not available to him. Well, I think that’s unbelievably far-fetched, wholly unsubstantiated, and… oops… fanciful in the extreme.\n\n","date":"May 5, 2015 at 4:16 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198418","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"You can misrepresent my opinion, you can even mix medieval and 18th c. CE Latin to misleadingly have us believe the perfect and pluperfect active indicatives of the miedeval Latin verb copio existed in the 14th c. CE, you’re first and foremost lying to yourelf.\nThe paradigm of copio is NOT just me announcing how right I am; it’s just substantiating how wrong you are!\n\n","date":"May 5, 2015 at 5:40 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198421","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"At link http://www.dicolatin.fr/EN/LAK/0/COPIARE/index.htm\nthe modern Latin verb copiare has neither perfect nor pluperfect indicatives.\n\n","date":"May 5, 2015 at 5:56 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198422","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hughe, can you refer me to the late MEDIEVAL verb copiare with its perfect and pluperfect active indicatives, PLEASE or CAN’T YOU?\n\n","date":"May 5, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198423","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"And if you can, I’d revise my opinion willingly. Till then your Medieval Latin if anything sounds more like… oops a linguistic fantasy..\n\n","date":"May 5, 2015 at 6:07 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198424","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Let’s take the  common sense approach that depingere means what is usually does unless someone can come up with an alternative meaning that is more likely in the context. We don’t know where Wilson got his idea of copying from but clearly he is not a source here to rely on.\nIn the world in which I work, we do rely heavily on specialists opinions- and we are not afraid of asking for them. There is a curious do-it-yourself approach here with home laboratories very much at the fore- at least Colin is continuing in the revered tradition of Raymond Rogers.\n\n","date":"May 6, 2015 at 1:25 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198442","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“There is a curious do-it-yourself approach here with home laboratories very much at the fore – at least Colin is continuing in the revered tradition of Raymond Rogers.”\nThe only thing curious in that comment is the notion that science has to be done by remote specialists working in laboratories. I was initially self-taught in chemistry, working in a home laboratory, with virtually any chemical I requested, interesting/dangerous ones included,  being supplied by the friendly local pharmacist.\nModel 9 (probably 4 if one excludes variants) is simplicity itself. One paints the subject with a dispersion of flour in water, possibly with minor additives (egg yolk etc), then presses onto linen to obtain a negative imprint. One dries the imprint, then suspends in nitric acid vapour.  The physics, the chemistry and probably the biology too (allowing for minor differences in flax retting etc) should work roughly the same in my garage as it does in a laboratory. More to the point, it would have given the same results (roughly) some 7 centuries ago if carried out in an alchemist’s workshop.\n\n","date":"May 6, 2015 at 2:58 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198449","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Well,Colin. I do have the Boy Scout badge in Philately, won when I was twelve. How did you guess?\n\n","date":"May 6, 2015 at 4:36 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198452","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh you wrote: “You last dozen or so posts boil down to a statement that d’Arcis used the word ‘depinxit’”.\nTOTALLY WRONG! I never mentioned ‘depinxit’ but ‘depinxerat’. Cannot you even discriminate between Latin perfect and pluperfect active indicatives?\n\n","date":"May 5, 2015 at 6:17 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198425","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Oh, dearie me, Max, now you’re confusing the deponent verb copior (to equip oneself with) with the medieval Latin copio (to copy). You’ll have to do better than that to demonstrate any superior knowledge. Still, at least you made some attempt, at last, to produce evidence rather that bombast. Keep trying!\n\n","date":"May 5, 2015 at 6:18 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198426","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Methinks you just ignored the medieval Latin verb copio (synonym of late medieval Latin verb copiare)  before I even mention it . Keep misrepresenting my opinion and put words in my mouth to mislead, keep lying to yourself and others if you will.\n\n","date":"May 5, 2015 at 7:06 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198430","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“I never mentioned ‘depinxit’ but ‘depinxerat’.” So you did, Max, so you did, and you were quite correct. I don’t think it matters very much, do you?\n\n","date":"May 5, 2015 at 6:22 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198427","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Quotations please.\n\n","date":"May 5, 2015 at 7:01 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198429","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Actually I only met a few occurences of copiavi, “I copied” and copiavit, “he copied” (as conjugated form of the late  Medieval Latin verb copiare (then a neologism in the 14th C.E.) and only in conjunction with pope Urban the fifth. NO pluperfect active indicative of the verb copiare, NO perfect and pluperfect active indicatives of the medieval Latin verb copio, “to reproduce, to copy” appears then. Reminder: Pierre d’Arcy used the pluperfect active indicative of the verb depingere to mean either “to paint”, “to reproduce/copy”.\n\n","date":"May 5, 2015 at 7:01 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198428","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Oh dear me Hugh, actually YOU are confusion the Latin verb copio with copior! The Latin verb copio, “to copy” as synonym of copiare does exist, see e.g. link at \nhttp://latinlexicon.org/definition.php?p1=4000763\n\n","date":"May 5, 2015 at 7:13 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198431","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"See too link at: \nhttp://latinlexicon.org/paradigms.php?p1=4000763\n\n","date":"May 5, 2015 at 7:16 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198432","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Getting really tired…\n\n","date":"May 5, 2015 at 7:22 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198433","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Is there are a Latin verb meaning “to be totally and utterly impervious to plain commonsense”? You know, like being totally and utterly impervious to the self-evident truth that the TS of Lirey was seen either as the real burial shroud of Jesus,OR a very clever forgery thereof (whether produced by an artist or craftsman or, as I now, believe an alchemist).  \nTo maintain as Freeman does that a bishop’s belief that a forgery was the work of an artist means that the image was ipso facto produced by standard artistic methods, applying classical pigments – and indeed a less probable option – paints instead of inks/dyes- is frankly astonishing, given the fanfare write-up in ‘History Today’.  It has to be one of the most egregious errors of logic I have encountered in a lifetime spent almost entirely in education and research. Why? Because Freeman has taken that bishop’s brief reference to “painted”, omitting to mention that it was “cunningly” painted, omitting to mention the “sleight of hand”, and omitting references to the end-result as an “impression” or “imprint”, and omitting all the commonsense, to say nothing of supporting science, that says a negative image is an imprint, not a free-hand painting.\nWhat leads someone not in his first flush of youth to inflict this dud thesis on us all?\nNot knowing the gentleman personally,one can only speculate. Here, for what it’s worth, is my opinion. Freeman is suffering from “stamp collectors  syndrome”. He had an album devoted entirely to forged stamps, a minority interest, but valid. His forged stamps were  holy relics of the early Christian Church, all faux by his reckoning, collected in the course of his Mediterranean tour guide duties (“day job” it would seem unless a man of private means).\n But there was one prize that eluded him –  in philatelic terms the 1 cent British Guiana (of which there is one and only one).   It would be like me with my 60 year old stamp collection, put together from buying largely low-value stamps “on approval”, driven by a desire to ‘complete sets’,  and lusting for a particualr ‘out-of-financial reach’  trophy stamp on auction at Stanley Gibbons, one costing not shillings or pounds, but hundreds of thousands or millions.\nI personally gave up stamp collecting when I realized it was an obsession, indeed a disease. Becoming a teenager and discovering the opposite sex helped too. “You must come and see my stamp collection” never did the trick.\nCharles should just accept that the 1 cent British Guiana is not for his collection, at least not in the album devoted to “painted relics”. He has ceased to see the wood for the trees.  He’s over-reached himself and can’t or won’t admit it. Let’s leave it at that.\nProgress update on ‘Model 9’. \nI have a faster way of checking out variables now in a semi-realistic model system. It’s also arguably an opposite-extremity version of the TS.  I paint the topside and underside of my toes with each new imprinting medium, step onto the lower half of a strip of  linen placed horizontally on the floor to get first a LUWU imprint. I then fold the surplus back onto the top surface to capture the LOTTO imprint.\n Varying degrees of manual moulding can be applied with LOTTO, not with LUWU, with more or less imaging of side contours, more or less risk of lateral distortion. A compact package can be made of the dual up-and-over imprint that fits nicely into its own jar for Stage 2 chemical development (nitric acid vapour). \nResults from the first footie session are drying on the radiator as I write. I compared (1) flour (2) egg tempera and (3) a mixture of flour and egg tempera  The egg tempera was simply beaten egg yolk, as used as a vehicle for pigments by medieval artists before oil paints became available.  I am NOT using pigments, needless to say, but Stage 2 chemical development to intensify colour  (yellow or brown).\nNo, CF, using egg tempera should NOT be taken to mean that this blogger subscribes to your eccentric ideas, regardless of what drives them. Egg tempera was simply available in the 14th century as an agent that sticks well to canvas, linen etc. It’s also the right colour from the word go for simulating an ancient sweat imprint. I’ll photograph and post the results later in the day, probably as a new posting.  Yes, I know my posts are too long, but let’s recall that a blog was originally conceived as a continuous diary (web log), new entries being added at the top, i.e. reverse chronological order, not as a series of discrete postings.\n\n","date":"May 6, 2015 at 1:36 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198443","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Max. you’re drifting further and further away from sense, let alone truth. Let’s recap.\n1) Your hypothesis is that Bishop d’Arcis used the word ‘depinxerat’ to mean ‘he had copied from one image to another’ even though there is no instance of the word ever being used in that sense elsewhere.\n2) Your hypothesis is that Bishop d’Arcis used the word in that unique sense because an available word; ‘copio, copiare’ had no perfect or pluperfect form in 1390. However your evidence for this was a reference to a different word altogether, the deponent verb ‘copior, copiari.’\nI understood that, and found your hypothesis fanciful and your evidence erroneous.\nNow I get confused. First you say you have found ‘copiavi’ and ‘copiavit’, forms of the perfect tense of ‘copio’ in connection with the 14th century Pope Urban V, and in the following sentence “NO pluperfect active indicative of the verb copiare, NO perfect and pluperfect active indicatives of the medieval Latin verb copio, “to reproduce, to copy” appears then.” Surely ‘copiavi’ and ‘copiavit’ are indeed forms of the perfect active indicative of the verb ‘copio, copiare, copiavi, copiatum’.\nFinally, you say: “The Latin verb copio, “to copy” as synonym of copiare does exist”, and link to a page about the verb ‘copio, copiare’ as if you thought the two words were synonyms, rather than different forms of the same word, ‘copio’ being the 1st person present indicative and ‘copiare’ the present infinitive. ‘Copio’ means ‘I copy’ and ‘copiare’ means ‘to copy’.\nI think the bottom line is that if d’Arcis had wished to say that one shroud was a copy of another there were conventional ways of doing so other than the unique use of the word ‘depinxerat’, and the fact that he did use the word ‘depinxerat’ indicates that he did not wish to say any such thing.\n\n","date":"May 6, 2015 at 1:47 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198445","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"And I’ve just checked your last link, which conjugates the verb ‘copio’ without its ‘i’ throughout as ‘copo, copas, copat’ etc. This is because the endings of the verb have been calculated by a computer, and cannot be relied upon as accurate reflections of usage.\n\n","date":"May 6, 2015 at 1:53 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198446","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, \nRe my “drifting further and further away from sense, let alone truth”: \nYes, let’s recap (not in your own words, if you don’t mind as I must confess I was really getting very tired with all your errors (your anachronical quote of Pliny the Younger –61-112 B.C.E.– to account for the non-use of the pluperfect active indicative of the verb copio, copiare –you went as far as mistaking for a noun–  that appears not until the 12th c. CE as if  Pliny was living in the Middle Ages and practicing Medieval Latin; your use of depinxit instead of depinxerat; your unability to figure out the chain-like crest-and-valley configuration of the back of a muscular and venous right forearm bulging and your additional unability to get the very idea depinxerat in Pierre D’Arcy memorandum could mean the artist had not only ‘painted’ but cunningly reproduced/copied” what Christ Shroud could have been like whether making a more elaborate copy/reproduction of a threnos-epitaphios-like Shroud or another then existing Shroud painted copy). This was a bit too much!\n– Re Late Antique and Medieval Latin verb copio, copiare. You are right. I did mix all my links up and got totally confused here. No question the Latin 1st singular person present indicative copio, “I copy” is not a synonym of copiare, “to copy”, but the present infinitive. I also mixed up most of my links. It does happen at times when I am really overworked and harassed by a long-winded commentator who has an unfair discourse, keeps putting words in my mouth and  deliberately/unconsciously  misrepresent my real opinion! In sum, yes I confess I got really tired and confused!\n-In 1988, as a relevant ALTERNATIVE translation to depinxerat, I first thought Pierre d’Arcy could have used the Latin conjugated verb (pluperfect active indicative) depinxerat (not depinxit, perfect active indicative, as you most erroneously stated) to mean the artist HAD not so much “painted” as “made a painted copy/reproduction” or to put it differently “copied/reproduced” the Lirey Shroud or a Christ Shroud. \n– In 1991, French scholar Bruno Bonnet-Eymard (who BTW is far more familiar with Latin than both Thibault, Hugh and me put together!), translated depinxerat as “He had reproduced (= copied” since both in English and French “copier/to copy” and “reproduire/to reproduce” are synonymous as far as text transcription and miniature depiction are concerned, which Thibault (a French native speaker who can write in English, most oddly does seem to ignore!). \n– Taking into account BBE’s acception of depinxerat as “il avait reproduit” (“he had reproduced” I kept the three most relevant acceptions “painted/reproduced/copied” here most likely involved. I am not telling you depinxerat can ONLY translate “he had reproduced/copied”! I am perfectly aware it first and foremost means “he had painted”! \n STILL the fact remains the medieval/late Medieval Latin copio copiare has no known occurrences in the pluperfect active indicative prior to the second third of the 14th c. CE and there are just a few occurrences of the its perfect active indicative (e.g. copiavi and ciopiavit), all in conjunction with pope Uban the fifth. My question to you is what EXACTLY is the pluperfect active indicative of the medieval/late medieval verb copio, copiare? SO FAR you have just failed to answer it (STILL waiting for your reply!). I do think, most likely Pierre D’arcy was as ignorant as yourself of the pluperfect active indicative of the medieval/late medieval verb copio, copiare and had to use depinxerat instead. All the more so as he was aware that the Lirey Shroud CUNNINGLY REPRODUCED Christ Shroud!\nMethinks BBE’s translation is the best suited here.Whence my personal translation of the key passage:\nLatin key sentence: (…) probatum fuit etiam per artificem qui illum depinxerat, ipsum humano ope factum, nonmiraculose confectum vel concessum (…)\nMy translation in French (with relevant /acceptions/ BBE’s included) : “(…) preuve fut même donnée par un artiste qui l’avait peint/reproduit/copié que de main humaine il avait été fait et non point par miracle réalisé ou bien accordé (…)”\nSTILL another fact remains, etymologically speaking, copio, copiare (as far as painting NOT writing is concerned) via medieval/late medieval Latin verb copiare from copia (from ops, opis, “power, ability, resources”) can mean TO PAINT with resources, ability and power (while multiplying  images/illustrations/copies/reproductions) or in other words TO CUNNINGLY PAINT (not just ‘to paint’).\n\n","date":"May 6, 2015 at 5:40 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198454","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"What is the third singular person pluperfect active indicative of the late Latin verb copio, copiare? Answer: copiaverat, “he had copied”. The only snag is,  it does not appear at all in Latin document prior to 1380 CE. There are only very sporadic occurrences in the mid-18th c. CE.\n\n","date":"May 6, 2015 at 6:50 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198458","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"End note \nHere is BBE’s translation in French of the passage under study:\n“Il fut même prouvé, grâce à un artiste qu’il l’avait reproduit, qu’il était fait de main d’homme et non confectionné ou accordé miraculeusement”.\nTo (cunningly) paint a shroud that could/should look like the Shroud of Christ is to reproduce.\nRe Pierre D’Arcy’s late medieval Latin, BBE wrote: \n“Pour rendre le texte lisible, nous avons délibérément amélioré UN STYLE ORIGINEL SOUVENT INCORRECT (my upper cases) et fait de formules elliptiques intraduisibles littéralement”\n(See BBE, CRC n° 271, Le Saint Suaire “C’est l’Etendrd de Notre salut”, p. 11)\n\n","date":"May 6, 2015 at 6:02 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198455","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I consider this discussion has gone wildly astray, and one should focus on what Bishop D’Arcis was in fact reporting.  It suffices more or less to refer to the text in the comment above provided by Colin on May 4 at 2:00 am.  \nFirstly, D’Arcis himself had not spoken with the alleged artist.  He is reporting what he believes the investigations of Bishop Henri found some 34 years previously, and he was writing in Latin.  He is claiming that Bishop Henri inquired into the matter, and who did Henri consult?    D’Arcis says that Henri was urged by many “responsible people” to investigate it, and that Henri consulted “many theologians and (others)” who declared it could not be the true Shroud of Christ.  Why?  Because the gospels did not mention it, and if it had occurred then the evangelists would have done so!  That is a fairly specious kind of reasoning,  In the situation of the early Church there were excellent grounds for not mentioning certain matters that needed to be kept secret (disciplina arcana).  Note that no names of specific theologians who Henri is said to have consulted are mentioned. \nD’Arcis then continues:\n“In the end, after a thorough investigation and interrogation, and that the fact would not remained hidden until today, he discovered the fraud and how the said cloth had been cunningly painted, the truth being attested by (the?) artist who painted(?) it, namely that it was the talented work of said man, and not miraculously wrought or bestowed by divine grace “\nNote that this artist remains unnamed, unknown, and Latin having no definite article, it could have been anyone who painted any cloth like the Shroud some 35 years previously.  Does Bishop D’Arcis provide any corroboration for his allegation?  Not a citation, no reference from his episcopal archives, no quotation from what Bishop Henri had written, all indirect reporting.  Furthermore no document has ever been found or identified written by Bishop Henri that would corroborate anything that D’Arcis claims about Henri’s investigations. \nContrariwise, it is known that Bishop Henri was effusive in his praise for the De Charney’s efforts in founding the Lirey Church with its canons, and had nothing to say against their character, which would hardly be the case if there were any suspicion of fraud.  D’Arcis’ claims appear to be reduced to hearsay, and what he believed to be the case from what he had heard.  He may well be a hostile witness, as his cathedral is losing pilgrims to a tiny village church, and is badly in need of cash for major repairs.  \nWhat we know of D’Arcis’ writing is mainly due to Chevalier and Thurston, writing about 1905 and who had their own agenda, in following the developing Germanic theology, which sought to mythologise the Passion and Resurrection narratives in the scriptures, whereas Pia’s photography and Delage’s forensics had given them a more literal likelihood and challenged this direction.  This situation in the Church at the time prompted Pope Pius X to write his well-known encyclical against Modernism, “Pascendi Dominici gregis” on Sep 8, 1907.  A reading of this encyclical will demonstrate the directions that many churchmen of the time sought to achieve.  \nSkeptics who cite the D’Arcis memorandum as evidence against the authenticity of the Shroud are on swampy ground!  If Bishop Henri solis ever discovered how the Shroud “was cunningly painted” then no-one else ever since has yet been able to deduce this secret!\n\n","date":"May 6, 2015 at 6:26 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198457","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Excellent. Quite a lot of what Max, has to say, and most of what daveb has to say, is comprehensible, coherent, and even cogent, in its way.\nThe pluperfect of copio is copiaveram, copiaveras, copiaverat, etc. \nBonnet-Eymard knew very well that the kind of reproduction or copy suggested by depinxerat is not a depiction of a depiction (imitatio), but a depiction of a person or scene. He was grasping at straws in an effort to reconcile d’Arcis’ memorandum with another version of the Shroud, which was entirely speculative.\nNot mentioning dates and times, witnesses, theologians, artists etc. and not having documents one way or the other is not good evidence for anything, but daveb is right that the praise we do have by Henri of Poitiers of Geoffroy de Charnay does seem incongruous. Does anyone have the text of the whole letter, or is that single out-of-context little snippet all we have?\n\n","date":"May 6, 2015 at 7:02 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198459","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I have the whole text of the D’Arcy memorandum both in Latin (facsimile copy of the Champagne ms 154, folio 137) and Bonnet-Eymard’s translation in French.\nRe BBE “grasping at straws”, it does seem you STILL fail to understand that to (cunningly) paint a shroud that could/should look like the Shroud of Christ is to reproduce an artefact that is thought to have really existed.\n\n","date":"May 6, 2015 at 7:25 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198461","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The fact is BBE based his translation on the draft (Champagne ms 154, folio 138) and not on its editing (Champagne ms 154, folio 137).\n\n","date":"May 6, 2015 at 7:40 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198465","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The version BBE translated is the longer one.\n\n","date":"May 6, 2015 at 8:01 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198470","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, now could you refer me to occurrences of the pluperfect active indicative of the verb copio, copiare prior to the estimated date of the D’Arcy memorandum, PLEASE?\n\n","date":"May 6, 2015 at 7:32 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198463","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"…occurrences of copiaverat for instance…\n\n","date":"May 6, 2015 at 7:33 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198464","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The TS image is neither ‘a-sleight-of-man’s-hand’ image nor a miraculous one and the Shroud sphere is still held hostage of the same limitative polarizing logic as was medieval France nearly 630 years ago, namely it is a medieval fake or a supernatural image. Methinks it is a providential image resulting from a dynamic process (the Second Temple period Halakha) that was influenced by the sacred texts of the Judean tradition as interpreted by generations of rabbis.\n\n","date":"May 6, 2015 at 8:51 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198471","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"In the key passage, as translated in the both texts (one in French — U. Chevalier’s translation and another in English) provided by Colin, the pluperfect depinxerat is incorrectly translated into ‘painted’/’a peint’: \n“(…) the truth being attested by the/AN (my alternative translation in upper cases) artist who HAD (my correction in upper cases) painted/REPRODUCED/COPIED (Bonnet-Eymard’s alternative translation + mine in upper cases) it (the Lirey Shroud? Another Christ shroud? comments mine), namely that it was the talented work of said man, and not miraculously wrought or bestowed by divine grace.”\n“(…) la vérité étant attestée par l’/UN (my alternative translation in upper cases) artiste qui l’(le Suaire de Lirey? Un autre suaire? comments mine) aVAIT (my correction in upper cases) peint/REPRODUIT/COPIE (Bonnet-Eymard’s alternative translation + mine in upper cases) autrement dit que c’était une oeuvre due au talent d’un homme, et non point miraculeusement forgée ou octroyée par grâce divine”\n\n","date":"May 6, 2015 at 7:17 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198460","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"What we are left with (if we take into account the translation entropy of both the longer and shorter versions in terms of draft and editing, is the following:\n        (Latin version 1) “probatum fuit etiam per artificem qui illum depinxerat”\n  (English translation) “the truth being attested by an artist who had painted/reproduced/copied it.”\n  (French translation) “preuve fut même donné par un artiste qui l’avait peint”\nOr\n    (Latin version 2)     “probatum fuit etiam per artificem qui illum depinxit”\n  (English translation) “the truth being attested by the artist who painted/reproduced/copied it.”\n  (French translation)  “preuve fut même donnée par l’artiste qui le peignit”\n\n","date":"May 6, 2015 at 9:26 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198476","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Typo: “preuve fut même donnée par un artiste qui l’avait peint”\n\n","date":"May 6, 2015 at 9:30 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198477","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"\nEl pomposamente llamado Memorandum D`Arcis, es el borrador de una carta de autor y fecha desconocidos, de traducción incierta en cuanto al tema de la reliquia, absolutamente contradictorio con los documentos históricos que sí están fechados y sí están firmados e incongruente con la “tabla de restar” que aprendemos en la tierna infancia si se fecha en 1389(fecha esta y no otra que necesitan obligadamente falsarios “oficiales” y falsarios “camuflados”).\nAl obispo Pierre D´Arcis, detractor de la reliquia, se le había impuesto por el Papa “SILENCIO PERPETUO” y  pretender que el borrador de carta a él atribuido, el Memorandum, sea en efecto una carta envíada al Papa Clemente VII en 1389 y que el contenido de ese borrador sea la verdad absoluta de los hechos que narra es un patético acto de Fe.\n \nNi siquiera la incongruencia de la fechas, tal como se pone de manifiesto, debilita su posición dogmática.\n¡No saben restar!.\n¿Haría falta el recordar que si a 1389 le restamos 34 años nos referimos al año1355?\n El supuesto como obispo Pierre D´Arcis, narra que el predecesor de su predecesor, el obispo Henri de Poitiers había descubierto 34 años atrás que la Sábana era un fraude y había prohibido su ostensión por lo que los monjes de Lirey la habían mantenido escondida hasta prácticamente la fecha en que se escribe este documento, motivado por que recientemente los monjes habían vuelto a exponerla a la veneración de los fieles.\n“…..Contra el antedicho decano y sus cómplices con el fin de extirpar al antedicho engaño. Ésos, cuando vieron su astucia calada de parte a parte, eliminaron y ocultaron la susodicha sábana para que escapara a las investigaciones del ordinario; después, no la sacaron más de su escondite durante treinta y cuatro años, o más o menos, hasta este año…..”.\n[They, seeing their wickedness discovered, hid away the said cloth so that the Ordinary could not find it, and they kept it hidden afterwards for thirty-four years or thereabouts down to the present year]\n \n¿Se da cuenta de lo que está narrando?.\nSi el Memorandum es de 1389 y en él se dice que 34 años antes el obispo Henri de Poitiers había hecho públicos sus recelos por lo que los monjes escondieron la reliquia durante esos 34 años ¿cómo podían los monjes atraer a los peregrinos, no sólo del reino de Francia sino de todo el mundo, como cuenta el documento, vender recuerdos y convertir la Sábana en un buen negocio a partir de 1357 , cuando tuvieron la reliquia escondida desde 1355 hasta 1389….?.\n[“This story was put about not only in the kingdom of France, but so to speak, throughout the world, so that from all parts people came together to view it. And further to attract the multitude so that money might cunningly be wrung from them, pretended miracles were worked, certain men being hired to represent themselves as healed at the moment of the exhibition of the shroud, which all believed to be the shroud of our Lord.”\nLos Escéptico eluden además citar el título o encabezado del documento pomposamente llamado Memorandum d´Arcis, que es el siguiente:\n “La verdad sobre la sábana de Lirey que, después de haber sido expuesta mucho tiempo en una época anterior, viene a ser de nuevo, respecto a lo cual pienso escribirle a nuestro señor Papa en los términos que siguen y tan brevemente como sea posible”. (Paris, Bibliothèque nationale, Collection de Çhampagne, v. 154, fol. 138).\n[“Vérité sur le linge de Lirey qui, après avoir été longtemps exposé à une époque antérieure, vient de l’être derechef, au sujet duquel j’entends écrire à notre seigneur pape dans les termes qui suivent et aussi brièvement que possible.”]\nCarta del obispo Henri de Poitiers de 28 de mayo de 1356 aprobando con su “asentimiento, autoridad y decisión” el culto en Lirey estando “bien informado por legítimos documentos”:\n« Universis presentes litteras inspecturis Henricus Dei et Apostolicœ sedis gratia electus confirrnatus Trecensis salutem in Domino sempitemam. Noveritis quod nos visis et auditis litteris nobilis viri D. Gauffridi de Chameyo Domini de Sauuosyo et de Lireyo militis, in quibus et per quas hœ nostre presentes littere sunt annexœ , ac earum tenore attento diligenter, attentis etiam devotione et affectu dicti militis, quoserga divinum cultum hactenus habuit et habet de die in diem. Volentesque huiusmodi cultum in quantum possumus ampliare divinum, dictas litteras ac omnia et singulain eisdem contenta, declarata, et narrata tamquam rite et canonice prout per legitima documenta fuimus et sumus inforrnati, acta dataque et concessa ac etiam ordinata fuisse, laudamus, ratificamus, approbamus, ac in et super eisdem nostrum prebemus consensum, auctoritatem et decretum. ln cujus rei testimonium sigillum nostrum litteris presentibus ad perpetuam rei memoriam duximus apponendum. Datum et actum in domo nostra de aquis nostrre diœcesis, Anno Domini 1356, die sabbati 28. Mensis maii.» (Archives de l’Aube, 1 17. Nicolas Camuzat, Promptuarium, f° 422 v°.\nTraducción del “Memorandum” del latín a francés de Bonnet-Eymard:\n \n“Vérité sur le linge de Lirey qui, après avoir été longtemps exposé à une époque antérieure, vient de l’être derechef, au sujet duquel j’entends écrire à notre seigneur pape dans les termes qui suivent et aussi brièvement que possible.\n \nSpontanément aux pieds de Sa Sainteté pour les baiser dévotement avec toute la promptitude de l’obéissance requise. Très Saint Père, puisque les causes majeures, celles surtout où il s’agit du péril des âmes et dans lesquelles l’opposition de puissances supérieures rend malaisée l’application des mesures nécessaires, doivent être soumises au Saint – Siège apostolique, dont la prévoyance attentive prend toujours les dispositions les plus utiles à la gloire de Dieu et au salut de ses sujets, à ces motifs, je viens porter à la connaissance de Votre Sainteté un fait gros de dangers et pernicieux par l’exemple qu’il donne, qui s’est produit naguère dans le diocèse de Troyes, afin que par la prudence de Votre Sainteté, qui, avec sollicitude, ne cesse de veiller au bien de ses sujets et de les préserver des périls, il y soit porté un prompt remède, pour la gloire de Dieu, l’honneur de l’Église et le salut de ses sujets.\nIl y a quelque temps, en effet, Très Saint Père, dans le diocèse de Troyes, le doyen d’une église collégiale, celle de Lirey, brûlant d’avarice et de cupidité, usa de procédés iniques et dolosifs pour posséder dans son église, par motif de lucre, non de dévotion, un linge artificieusement peint sur lequel avait été délicatement représentée la double effigie d’un même homme, de face et de dos. Il soutenait faussement et feignait de croire que c’était le Suaire même avec lequel notre Sauveur Jésus-Christ avait été enveloppé dans le sépulcre et sur lequel l’image entière de ce même Sauveur, avec les blessures qu’il avait reçues, était restée imprimée de cette façon; loin de se limiter au royaume de France, cela fut répandu pour ainsi dire dans le monde entier, tellement que, de tous les points de l’univers, les peuples affluaient en masse. Pour séduire ces multitudes et leur extorquer leur or par astuce, on forgeait là des miracles en faisant mentir certains individus payés à cet effet: ils feignaient d’avoir été guéris lors d’une ostension dudit suaire, que la croyance universelle attribuait au Seigneur. Ce que voyant, Mgr Henri de Poitiers, d’heureuse mémoire, alors évêque de Troyes, persuadé par nombre de sages conseillers qu’il convenait d’intervenir, tout autant d’ailleurs qu’il lui incombait selon le devoir de sa juridiction ordinaire, mit tous ses soins à rechercher la vérité dans cette affaire: bien des théologiens et d’autres personnes avisées affirmaient que ” cet objet ” ne pouvait être véritablement le Suaire du Seigneur qui porterait imprimée l’effigie du Sauveur lui-même, puisque le saint Évangile ne faisait nulle mention de semblable impression, puisque enfin, à supposer que cela fût vrai, il n’est pas vraisemblable que les saints Évangélistes l’eussent passé sous silence ou omis, ni qu’on l’eût tenu secret ou dissimulé jusqu’à notre époque. Finalement, après avoir sur ” cet objet ” mené adroite et diligente enquête, il en vint à découvrir la fraude et comment ce fameux linge avait été peint par un procédé artistique; qui plus est, il fut prouvé, grâce à un artiste qui l’avait reproduit, qu’il avait été fait de main d’homme, et non confectionné ou accordé miraculeusement. C’est ce qui le détermina, après avoir longuement consulté maints théologiens et juristes compétents et s’être convaincu qu’il ne devait ni ne pouvait admettre pareille affaire ni faire semblant d’y donner son crédit, à engager selon les devoirs de sa charge une procédure contre le susdit doyen et ses complices afin d’extirper la susdite tromperie. Ceux-là, quand ils virent leur ruse percée à jour, firent disparaître et recelèrent ledit linge pour qu’il échappât aux investigations de l’ordinaire; depuis, ils ne l’ont plus sorti de sa cachette pendant trente-quatre ans, ou à peu près, jusqu’à cette année.\nOr, à ce qu’on dit, voici qu’à présent l’actuel doyen de ladite église, dans l’intention frauduleuse d’y trouver profit!’ vient de suggérer au sire Geoffroy de Charny, chevalier et seigneur temporel du lieu, de faire replacer ledit linge dans là susdite église afin que, les pèlerinages reprenant leur cours, celle-ci s’enrichit d’abondants revenus. Poussé par ledit doyen, qui marche sur les traces de son prédécesseur, ce chevalier se rendit auprès de Mgr le cardinal de Thury, nonce et légat de Votre Sainteté en France. Se gardant bien de rappeler qu’à l’époque évoquée plus haut, on donnait ledit linge pour le Suaire du Sauveur dont il aurait gardé l’empreinte, que l’ordinaire avait engagé une poursuite contre pareil désordre, tâchant d’extirper l’erreur à laquelle il donnait jour, qu’enfin, par crainte du même ordinaire, on avait fait disparaître ledit linge, qu’on l’avait même, assure-t-on, emporté hors du diocèse, le chevalier insinua au seigneur cardinal déjà nommé que ledit linge était une représentation ou image du Suaire, à laquelle la dévotion conduisait les multitudes, qu’en d’autres temps, déjà, il avait été l’objet, dans ladite église, d’une extrême vénération et avait reçu les hommages assidus de la plus vive piété, mais que, à cause des guerres qui ravageaient le royaume et pour d’autres raisons encore et, ajoutait-il, par mandement de l’ordinaire du lieu, il avait été pendant longtemps placé et conservé sous meilleure garde; il priait instamment qu’on lui donnât licence de placer dans ladite église ladite représentation ou image du Suaire, vers laquelle la dévotion portait les foules désireuses de la contempler, afin qu’on pût la produire et en faire l’ostension devant le peuple et qu’il fût loisible aux fidèles de la vénérer. Le seigneur cardinal ne donna pas une totale approbation à la requête, mais vraisemblablement de propos délibéré et avec la prudence requise, il concéda au requérant, par l’autorité apostolique, la faculté de placer et disposer cette représentation ou image du Suaire du Seigneur dans ladite église ou en quelque autre endroit convenable, sans avoir à demander l’autorisation à l’ordinaire du lieu ni à quiconque.\nPrenant prétexte de cette lettre, l’on sortit et présenta au peuple, dans ladite église, ledit suaire, souvent lors de cérémonies et de fêtes, et parfois ouvertement, avec la plus grande solennité, plus grande même qu’on en use en cet endroit pour exposer le Corps de Notre- Seigneur Jésus-Christ: sur une estrade spécialement édifiée pour ce seul usage, au milieu des flambeaux allumés, deux prêtres revêtus de l’aube, portant l’étole et le manipule, présentent le suaire avec toute la révérence possible. On peut bien, en public, ne point affirmer qu’il s’agisse du vrai Suaire du Christ, en privé toutefois on l’affirme, on le prêche, et beaucoup le croient tel; d’autant, surtout, qu’il fut un temps où, comme il est déclaré plus haut, on disait que c’était le vrai Suaire du Christ, et qu’à présent, par un artifice de langage en usage dans ladite église, on ne l’appelle plus Sudarium mais Sanctuarium [Relique], ce qui sonne identiquement aux oreilles du peuple, qui ne fait point de telles distinctions; aussi y accourt-il en foule chaque fois qu’on fait l’ostension ou qu’on espère qu’elle sera faite, croyant, je dirais plus justement, s’imaginant par erreur que c’est le vrai Suaire; enfin, le bruit court parmi le public que ce culte a reçu l’approbation du Siège apostolique par le moyen de la lettre du. sus nommé seigneur cardinal.\nCe n’est pas tout, Très Saint Père: voyant que dans le peuple se renouvelait un si grand scandale et qu’une telle tromperie reprenait vigueur, pour le péril et la séduction des âmes, observant aussi que le doyen de ladite église ne s’était pas tenu aux termes de la lettre du seigneur cardinal, lettre qu’il avait pourtant obtenue, comme déclaré ci-dessus, en taisant le vrai et en suggérant le faux, je résolus de prévenir, autant que faire se pouvait, les dangers qui menaçaient les âmes, d’ôter et d’extirper du troupeau confié à mes soins une erreur si détestable. Conseil longuement pris encore sur cette question auprès de maints personnages compétents, j’interdis audit doyen, sous peine d’excommunication portée contre sa personne, de faire paraître et d’exposer ledit suaire devant le peuple aussi longtemps que de nouvelles dispositions n’auraient pas été prises à ce sujet. Or, refusant d’obéir, il se porta en appel et, au mépris de l’interdiction, continua les ostensions comme auparavant; qui plus est, le chevalier en personne apporta son soutien et sa protection en cette affaire, tenant de ses propres mains ledit linge lors d’une fête solennelle et le présentant publiquement aux fidèles avec toute la solennité que nous avons dite; il s’est fait, grâce à une sauvegarde du roi, mettre en possession et saisine pour exercer le droit d’exposer ce linge, et il m’a fait signifier cette sauvegarde.\nAinsi, sous le couvert tant du pourvoi que de ladite sauvegarde, cette funeste erreur est protégée, elle s’établit, elle prévaut, cause de mépris pour l’Église, de scandale pour le peuple, de danger pour les âmes, contre quoi, du fait des opposants susnommés, je ne puis prendre de mesures; c’est aussi l’opprobre jeté sur mon prédécesseur déjà nommé qui, de son temps, avait poursuivi ces agissements, sur moi enfin qui, désirant à mon tour, après examen, prendre, selon qu’il m’est imparti, les mesures que requièrent de tels agissements, les vois – oh douleur! – protégés, soutenus. Bien plus, ceux qui les soutiennent font répandre dans le peuple le bruit que c’est l’envie, ou bien la cupidité, l’avarice, le désir de posséder ce linge qui m’animent à les poursuivre, soupçons que jadis on fit peser aussi sur mon prédécesseur susnommé, tandis que d’autres répètent que mon action est trop modérée et que je m’exposerais à faire rire de moi si je tolérais plus longtemps ce scandale.\nJ’eus beau faire sommer et requérir instamment, mais avec humilité, ledit chevalier de mettre fin momentanément et de surseoir aux ostensions dudit linge, le temps que Votre Sainteté fût consultée là-dessus et qu’elle prit une décision, bien loin d’en avoir cure, il fit exposer, à mon insu, à Votre Sainteté ce qu’il avait exposé audit seigneur cardinal, ajoutant que, refusant de me conformer à la lettre de celui-ci et même faisant fi de l’appel, je ne suspendais ni les interdictions ni les sentences d’excommunication portées contre ceux qui exposaient ce linge et contre les foules qui se pressaient en ces lieux pour le vénérer. Seulement, avec tout le respect dû au requérant, je ferai remarquer qu’en procédant contre les personnes qui exposent ce linge de la manière susdite et contre ceux qui le vénèrent, je n’ai nullement cherché à infirmer la lettre du susnommé seigneur cardinal, encore qu’elle eût été obtenue par surprise: le prélat n’y avait en aucune façon concédé la faculté de le montrer aux fidèles, encore moins de le vénérer, tout au plus celle de le replacer et serrer dans ladite église ou ailleurs, en quelque endroit convenable. Vu qu’ils ne s’étaient pas limités aux autorisations du susnommé seigneur cardinal, j’ai procédé contre ces personnes suivant le droit ordinaire, non sans avoir beaucoup consulté, et selon qu’il incombe à ma charge, afin d’ôter le scandale et d’extirper pareille tromperie, pensant qu’il y aurait pour moi faute grave à passer sur de telles pratiques en fermant les yeux.\nToutefois, songeant aussi à moi-même en cette affaire, fort, toujours, du conseil de gens éclairés, je me vis contraint d’avoir recours, malgré tout, à l’appui du bras séculier, attendu surtout que le chevalier avait lui-même entrepris de remettre sa cause aux mains du pouvoir séculier en se faisant mettre en possession et saisine, comme nous l’avons relaté plus haut, par ladite sauvegarde royale, pour exercer le droit d’exposer et de montrer au peuple ledit linge, ce qui semble pour le moins incongru. Je me suis donc employé à remettre ce linge au pouvoir royal, toujours dans l’unique dessein de faire surseoir à la susdite ostension, au moins le temps que j’instruisisse Votre Sainteté de l’enchaînement des faits; on me l’accorda volontiers et sans la moindre difficulté, la cour du Parlement royal dans son ensemble étant parfaitement informée de l’invention superstitieuse de ce suaire et de l’abus qu’on en fait, ainsi que de la tromperie et du scandale dont nous avons déjà parlé. Ils sont unanimes à s’étonner,. sachant le fond des choses, que ce soit l’Église qui m’empêche dans une telle poursuite, quand elle devrait me soutenir avec vigueur, que dis-je? me châtier avec sévérité si je m’y montrais négligent ou indifférent.\nToutefois, le chevalier susnommé me devançant et exposant les faits marqués plus haut tels qu’on les explique, finit par rapporter d’auprès de .votre Sainteté une lettre par laquelle – à ce qu’on raconte en effet -, confirmation faite en connaissance de cause de la lettre du susnommé cardinal, il est accordé audit chevalier, nonobstant toutes les interdictions et tous les appels, licence de produire et d’exposer ledit linge devant le peuple et de l’offrir à la vénération des fidèles, cela en m’imposant un silence perpétuel, si j’en crois ce qu’on m’en dit, car je n’ai pu obtenir copie de cette lettre. Les canons, pourtant, ne me prescrivent-ils pas d’empêcher qu’on abuse les gens pour un motif de lucre, au moyen d’images diverses ou de faux documents? Or je n’ai point de doute là-dessus: ce ne fut qu’en suggérant le faux et en passant sous silence la vérité qu’on a pu se faire donner une telle lettre, qu’on n’eût pas obtenue autrement; je n’ai été ni appelé ni entendu. Surtout – ne doit-on pas le présumer en ma faveur? – aurais-je pu vouloir sans motif mettre un terme à cette affaire ou troubler en quelque façon les gens dans une dévotion juste et bien réglée? J’ai la ferme confiance que Votre Sainteté souffrira, dans sa bienveillance, que je continue à m’opposer à ladite ostension, vu les faits ci-dessus mentionnés, jusqu’à ce que je tienne de Votre Sainteté elle-même, plus amplement informée des faits véritables, d’autres instructions.\nDaigne donc Votre Sainteté, Très Saint Père, considérer avec attention les faits que je lui ai exposés et prendre à leur sujet des mesures telles qu’une supercherie et un scandale de cette sorte, une superstition aussi abominable dans son fond que dans sa forme, soient, par la prévoyance de Votre Sainteté, extirpés jusqu’à la racine: c’est-à-dire qu’on ne montre plus ce linge aux fidèles, à plus forte raison qu’il ne soit plus vénéré ni comme le Suaire, ni comme une relique [sanctuarium], ni comme une représentation ou image du Suaire du Seigneur (puisque le Suaire du Seigneur n’était pas ainsi), ni sous quelque autre dénomination ou de quelque façon qu’on veuille imaginer; qu’au contraire, après avoir révoqué, ou, plus justement, déclaré nulle la lettre obtenue subrepticement et dont il a été fait mention plus haut, condamnation publique soit portée dudit linge en signe de réprobation de cette superstition, de peur que les pouvoirs rivaux, persécuteurs de l’Église et les envieux détracteurs du gouvernement ecclésiastique, dans leurs injures irrévérencieuses, ne viennent à dire que l’on trouve dans les tribunaux séculiers un remède plus prompt et plus salutaire contre les scandales et les supercheries que dans les tribunaux de l’Église. En fait, je me tiens prêt, ici, à donner incontinent les éclaircissements suffisants et indubitables, par voix publique et autrement, sur tout ce que j’ai avancé plus haut, afin de me justifier et de décharger ma conscience au sujet de cette affaire qui me tient fort à cœur; j’ajoute que, n’était ma mauvaise santé, je serais venu spécialement en personne exposer mes griefs, comme il convient, devant Votre Sainteté, considérant que je ne puis par écrit exprimer entièrement et bien suffisamment la gravité du scandale, le déshonneur encouru par l’Église et la juridiction ecclésiastique, ainsi que le péril où sont exposées les âmes. Je fais toutefois mon possible pour mériter d’être excusé, principalement devant Dieu, laissant le reste à la décision de Votre Sainteté, à qui daigne le Tout- Puissant conserver prospérité et longue vie pour l’avantage et les besoins du gouvernement de son Église sainte. Écrit..”\n \n \nTraducción del “Memorandum” del latín al inglés de Herbert Thurston:\n(¡¡OMITE EL PREÁMBULO!!)\n \n“The case, Holy Father, stands thus. Some time since in this diocese of Troyes the Dean of a certain collegiate church, to wit, that of Lirey, falsely and deceitfully, being consumed with the passion of avarice, and not from any motive of devotion but only of gain, procured for his church a certain cloth cunningly painted, upon which by a clever sleight of hand was depicted the twofold image of one man, that is to say, the back and the front, he falsely declaring and pretending that this was the actual shroud in which our Savior Jesus Christ was enfolded in the tomb, and upon which the whole likeness of the Savior had remained thus impressed with the wounds which he bore.\nThis story was put about not only in the kingdom of France, but so to speak, throughout the world, so that from all parts people came together to view it. And further to attract the multitude so that money might cunningly be wrung from them, pretended miracles were worked, certain men being hired to represent themselves as healed at the moment of the exhibition of the shroud, which all believed to be the shroud of our Lord.\nThe Lord Henry of Poitiers, of pious memory, then Bishop of Troyes, becoming aware of this, and urged by many prudent persons to take action, as indeed was his duty in the exercise of his ordinary jurisdiction, set himself earnestly to work to fathom the truth of this matter. For many theologians and other wise persons declared that this could not be the real shroud of our Lord having the Savior’s likeness thus imprinted upon it, since the holy Gospel made no mention of any such imprint, while, if it had been true, it was quite unlikely that the holy Evangelists would have omitted to record it, or that the fact should have remained hidden until the present time.\nEventually, after diligent inquiry and examination, he discovered the fraud and how the said cloth had been cunningly painted, the truth being attested by the artist who had painted it, to wit, that it was a work of human skill and not miraculously wrought or bestowed. Accordingly, after taking mature counsel with wise theologians and men of the law, seeing that he neither ought nor could allow the matter to pass, he began to institute formal proceedings against the said Dean and his accomplices in order to root out this false persuasion.\nThey, seeing their wickedness discovered, hid away the said cloth so that the Ordinary could not find it, and they kept it hidden afterwards for thirty-four years or thereabouts down to the present year. And now again the present Dean of the said church with fraudulent intent and for the purpose of gain, suggested, as it is reported, to the Lord Geoffrey de Charny, Knight, and the temporal lord of the place, to have the said cloth replaced in the said church, that by a renewal of the pilgrimage the church might be enriched with the offerings made by the faithful.\nActing upon the Dean’s suggestion, who was thus treading in the footsteps of his predecessor, the Knight went to the Cardinal de Thury, your Holiness’ Nuncio and Legate in French territory, and suppressing the facts that the said cloth at the time above referred to was asserted to be the shroud of our Savior, and that it bore the Savior’s likeness imprinted upon it, and that the Ordinary had taken action against the canons in order to stamp out the error which had arisen, and that the said cloth for fear of the Ordinary had been hidden away, nay even, it is said, conveyed out of the diocese, he represented to the Cardinal that the said cloth was a picture or figure of the shroud, which many people came to visit out of devotion and which had previously been much venerated and resorted to in that church, but on account of the war and other causes, by the command of the Ordinary, had been placed for a long time in safer keeping, petitioning that he might be allowed to set up in the said church this picture or figure of the shroud which so many out of devotion desired to see, so that it might there be shown to the people and venerated by the faithful.\nThen the said Lord Cardinal, without entirely approving the petition, but probably acting on the facts before him and so far prudently, granted to the petitioner by Apostolic authority that without asking leave of the Ordinary or of any other person he might set up this picture or figure of the shroud of our Lord in the said church or in any other decent place.\nAnd under cover of this written authority the cloth was openly exhibited and shown to the people in the church aforesaid on great holidays, and frequently on feasts and at other times, with the utmost solemnity, even more than when the Body of Christ our Lord is exposed; to wit, by two priests vested in albs with stoles and maniples and using the greatest possible reverence, with lighted torches and upon a lofty platform constructed for this special purpose; and although it is not publicly stated to be the true shroud of Christ, nevertheless this is given out and noised abroad in private, and so it is believed by many, the more so, because, as stated above, it was on the previous occasion declared to be the true shroud of Christ, and by a certain ingenious manner of speech it is now in the said church styled not the sudarium but the sanctuarium, which to the ears of the common folk, who are not keen to observe distinctions sounds much the same thing, and crowds of people resort there as often as it is shown or is expected to be shown, under the belief, or more truly the delusion, that it is the true shroud. Moreover, it is currently reported amongst them that it has been approved by the Apostolic See by means of the letters of the said Lord Cardinal.\nAccordingly, most Holy Father, perceiving this great scandal renewed amongst the people and the delusion growing to the peril of souls, observing also that the Dean of the said church did not keep within the terms of the Cardinal’s letters, obtained though they were by the suppression of the truth and the suggestion of what is false, as already explained, desiring to meet the danger as well as I could and to root out this false persuasion from the flock committed to me, after consultation with many prudent advisers, I prohibited the said Dean under pain of excommunication, by the very act sufficiently published [eo ipso latae], from exhibiting this cloth to the people until otherwise might be determined.\nHe, however, refusing obedience and lodging an appeal, in defiance of the prohibition went on with the exhibition as before. Moreover, the knight, maintaining and defending this behavior, by holding the said cloth with his own hands on a certain solemn feast, and showing it to the people with the observances above described, caused himself, by a royal warrant [salvagardia], to be put in formal possession and occupation of the said cloth and of the right of exhibiting it, and had this notified to me; and so under cover of the appeal as well as of the said royal warrant this delusion is shielded and propagated, to the contempt of the Church, scandal of the people, and peril of souls—all of which I am powerless to remedy—nay more, to the defamation of my above-named predecessor who denounced the abuse in his time, and of myself who to the best of my poor ability am also anxious to take such prudent action as I may.\nBut, alas! The scandal is upheld and defended and its supporters cause it to be spread abroad among the people that I am acting through jealousy and cupidity and to obtain possession of the cloth for myself, just as similar reports were circulated before against my predecessor; while, on the other hand, others aver that I move too half-heartedly in the matter and that I make myself a laughing-stock by allowing the abuse to continue.\nBut though I have earnestly and humbly cited the said knight and besought him that he would for a time suspend the exhibition of the cloth until your Holiness could be consulted and should pronounce upon the matter, he paid no attention, or rather without my knowledge he had representations made to your Holiness in the same sense as those already made to the said Lord Cardinal, adding that I refused to defer to the said Cardinal’s letters, that I disregarded the appeal and went on launching inhibitions and sentences of excommunication against those who exhibited the cloth and against the people who came to venerate it.\nBut with all deference to the author of these representations, my action in thus proceeding against those who exhibited and venerated the cloth was in no wise derogatory to the said Lord Cardinal’s letters, obtained though they were surreptitiously. This authorization of his by no means conceded that the cloth could be exposed with publicity or venerated, but only that it might be restored to or lodged in the said church or some other decent place.\nAnd because they would not keep to the terms of the Cardinal’s permit therefore it was that I proceeded against them according to the ordinary forms of law, as in my duty I am bound, and not without much asking of counsel, with the view of removing the scandal and the said popular delusion, believing that I should be gravely in fault if I connived at such abuses. Moreover, having to look to my own security in this matter, I was compelled, acting always upon the advice of prudent counselors, to have recourse to the aid of the secular arm, and this more particularly because the said knight in the first instance had begun to place the matter in the hands of the civil authorities by causing himself to be put in formal possession of the right of exhibiting the cloth by the King’s warrant, as said above, which seems a sufficiently absurd proceeding.\nAccordingly I took measures to have the cloth placed in the custody of the King’s officers, always with the same end in view, viz., that at least until I could bring the whole story to the notice of your Holiness there might for the time being be an end of these exhibitions. And in this request I prevailed without any difficulty with the court of the King’s Parliament when once they were fully info rmed of the superstitious origin of this shroud, of the use to which it was put, and of the delusion and scandal to which I have called attention. Indeed it is a wonder to all who know the facts of the case that the opposition which hampers me in these proceedings comes from the Church, from which quarter I should have looked for vigorous support, nay, rather have expected punishment if I had shown myself slothful or remiss.\nHowever, the knight above mentioned has been beforehand with me, and, having represented the matter as I have explained, has obtained from your Holiness a Brief in which the said Lord Cardinal’s letters are substantially confirmed ex certa scientia and permission is granted that in spite of all prohibitions and appeals, the said cloth may be shown and exposed for the veneration of the faithful; while, as I hear— for I have not been able to procure a copy of the said Brief–perpetual silence is enjoined upon myself.\nBut whereas the canon law requires me to see that no man be imposed upon by false representations and documents for purposes of gain, and because I am certain that this Brief was obtained by suggestion of what is false and suppression of the truth, and that otherwise it would never have been issued, while I was neither cited nor heard, especially as the resumption ought to stand in my favor that I would not interfere in such a cause without reason, or disturb any man in any practice of devotion which was harmless and free from extravagance, I do most confidently trust that your Holiness will bear with me if in view of the foregoing facts I still oppose the said exposition until I have fuller instructions from your Holiness yourself, now better informed of the truth of the case.\nI would ask you then, most blessed Father, to vouchsafe to bestow your attention upon the foregoing statement and to take measures that such scandal and delusion and abominable superstition may be put an end to both in fact and seeming, in such wise that this cloth be held neither for sudarium nor sanctuarium, nor for an image or figure of our Lord’s sudarium, since our Lord’s sudarium was nothing of the kind, nor, in fine, under any other ingenious pretext be exhibited to the people or exposed for veneration, but that to express horror of superstition it be publicly condemned, the surreptitious letters above spoken of being recalled, or more truly declared null and void [for fear that the keen-eyed persecutors and detractors of the Church should rail at the Church’s discipline and say that a more prompt and efficacious remedy against scandals and impostures is found in the secular tribunals than in those of ecclesiastical authority].\nI offer myself here as ready to supply all information sufficient to remove any doubt concerning the facts alleged both from public report and otherwise, in order to exonerate myself and also to discharge my conscience in a matter which I have greatly at heart. Moreover, if health had allowed I should have presented myself personally to your\nHoliness to state my complaint to the best of my poor ability, for I am convinced that I cannot fully or sufficiently express in writing the grievous nature of the scandal, the contempt brought upon the Church and ecclesiastical jurisdiction, and the danger to souls; still I do what I can, chiefly that I may be guiltless before God, leaving all else to the disposition of your Holiness, whom may the Almighty long preserve, &c.”\nCarlos\n \n\n","date":"May 6, 2015 at 11:00 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198485","author":"Carlos","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Terrific, Carlos; thank you very much indeed.\n\n","date":"May 6, 2015 at 11:28 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198486","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, I have previously asked you if now you could refer me to occurrences of the (perfect and) pluperfect active indicative of the verb copio, copiare prior to the estimated date of the D’Arcy memorandum. Radio silence!\nHonestly, just tell me, how many occurrences could you find in the whole Latin corpus prior to 1389 CE (as estimated date of the D’Arcy memorandum? \nMost oddly, copiaverat, “he had copied” does seem indeed NOT to appear till mid-18th c. CE, which likely means in the 14th c. CE, the verbs transcribo, transcrivere (for a text) and depingo, depingere or even depicto, depictere (for an image) were most currently used in the perfect and pluperfect  active indicatives NOT the verb copio, copiare. Thus –and till proven otherwise– the verb depingo, depingere could have been used instead of copio, copiare and thus the former verb meant “to reproduce/to copy”.\n\n","date":"May 6, 2015 at 4:44 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198500","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Methinks just because, when seen in full daylight,  the aged bloodstains would look ‘fresh’ on the long inner burial cloth as if the blood had just been shed the day before, Henri de Poitiers’s ‘expert artist’ could have thought it was a painting while considering the body image as an imprint/ipression on cloth, whence the phrases “cloth cunningly painted and the dorsal and frontal images of one man depicted as if “by a clever sleight of hand”. Most obviously, the expert artist view the Lirey Shroud bearing the double image of the bloodied body much more as a cunning reproduction/forgery of Chist Shroud unless Pierre d’Arcy really meant the artist depinxit/”painted”/depinxerat/”had painted” the Lirey Shroud and the bishop deliberately or unconsciously mispresented the case to pope Clement VII.\n\n","date":"May 6, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198501","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"No Max. There are no instances of depingo meaning copy in the sense required. There may be no instances of anything else meaning copy either, but that is not evidence that depingo was a substitute. Anything is possible, but if you want more than mere possibility, you’ll have to provide better evidence than that.\n\n","date":"May 6, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198502","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, could you or could not you really take up my challenge? \nI CHALLENGE YOU AGAIN (THIRD TIME!): \n“Could you find in the whole medieval and late medievalLatin corpus PRIOR TO 1389 CE (as estimated date of the D’Arcy memorandum) one single OCCURRENCE of both the perfect and pluperfect active indicative of the verb copio, copiare prior to the estimated date of the D’Arcy memorandum?”\nIf YOU JUST CANNOT, most obviously it just means the verb copio, copiare, “to reproduce, to copy”, was NOT AVAILABLE AT ALL in the 14th c. CE, and my point does stand correct: IN CONJUNCTION WITH the adverb CUNNINGLY, the verbs depingo, depingere and depicto, depictere were the fittest (for lack of a better Latin verb available then) to convey then the meaning of copiare, “to reproduce, to copy” as far as painting an image is concerned, which is precisely what ‘your’ Lewis and Short’s Latin Dictionary most precisely DOES FAIL to tell us.\nAll the more so as the very infinitive present copiare (“to copy/reproduce”)  comes from coopia > co, “together (with)” + opis, “resources/ability/power”, and thus etymologically speaking and in reference to a cleverly/cunningly painted reproduction or copy, can mean “to paint with resources (in terms of creativity)/ability (in terms of talent or even genius)/power (in terms of impressive rendering)” or in other words “to cunningly paint”, which is EXACTLY what is implied in the memorandum passage under study (Reperit fraudem et quomodo pannus ille artificialiter depictus fuerat, probatum fuit etiam per artificem qui illum depinxerat). Do note how artificialiter depictus, “cunningly painted” echoes depinxerat, “(an/the artist) had painted”.\nUsing the singular third person perfect/pluperfect active indicative depinxit/depinxerat, Pierre d’Arcy did refer to the Lirey Shroud as an artefact “AN/THE artist (had) (CUNNINGLY) painted. The bishop of Troyes was referring to the Lirey Shroud as a CLEVER reproduction/copy of the Shroud of Christ to be used during the liturgies of Easter Week as a liturgical shroud or “cloth of the Resurrection” not unlike the 13th-14th CE Besançon Shroud, a more grossly painted reproduction/copy of the said cloth (most likely a painted reproduction/copy of the one Othon de la Roche sent from Athens to the Besançon Archbishop, Amédée de Tramelai via his own father, Ponce de la Roche as the old legend –dating back at least to the 16th c. CE– has it re the disappearance of “the cloth of the Resurrection” in the Besançon fire of the church of saint stephens and its sudden reappearance in the same church about two years later (1349 CE) on Easter.\n\n","date":"May 7, 2015 at 12:28 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198546","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I think we can safely rule out ‘copy’. Someone please tell Ian Wilson so that he can revise his text for any new edition of the Shroud. This should go along with his correction of the illustration of tetradiplon as you cannot translate it as’doubled in four’ alongside an illustration showing it doubled to make eight ( alas a mistake repeated in the video that Barrine has just posted).\nBetter leave out the tetradiplon issue altogether as it only refers to the cloth BEFORE Christ wiped his face with it and there is no indication in the text that it was refolded as such afterwards. Having ploughed my way through 150 examples of Greek words where tetra was added, the most likely translation  is doubled four times- which is exactly the way they folded the Parthenon cloth  as seen in the Parthenon frieze in The British Museum. But that would cut through the face of the Man on the Shroud and so would destroy Wilson’s argument. Better just to edit all this out to save Wilson further loss of credibility among the Byzantine experts.\n\n","date":"May 7, 2015 at 1:57 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198511","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Just who are all these “Byzantine Experts” Charles?\nOne of them should write a book debunking the Shroud – could be a good seller.\n\n","date":"May 7, 2015 at 3:46 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198520","author":"Thomas","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Thomas. Quite frankly they cannot be bothered as none of them think that it is remotely important in comparison to other artefacts that they deal with and none of them that I have had contact with consider that the Shroud is pre-medieval anyway.\nSampath- there does not have to be an order in which we get rid of hypotheses. You only have to compare the illustration of Wilson’s tetradiplon cloth with any possible translation of tetradiplon to see that while a cloth folded double four times is a possible translation (and backed by the visual evidence of the Parthenon cloth)  and so is a cloth doubled (twice) to make four sections is another , but less likely, possible translation, Wilson shows a cloth doubled three times but labels it as a cloth doubled in four which cannot possibly fit with the illustration as his makes up eight! This kind of thing should be simple to sort out because it is so obviously wrong.\nThe painting issue is much more difficult to disprove as we have the 1449 description of the Shroud being painted to put alongside the 1389 text and we have lots of depictions which show the images much more powerful than they are now and it is hard to know any other way of producing such strong images other than paint as documented in the medieval manuals. We also know that painted surfaces on linens disintegrated very easily and so the question, which I leave to experts in conservation of textiles to sort out, is what is left on the linen when the pigments fall off a painted cloth after many centuries. This is the key question to focus on.\nThe solution to the so- called mystery of the Shroud will eventually be sorted out with an up-to-date examination of the surface of the Shroud again so let’s all push for that. Meanwhile  my own work involves trying to put out articles which will arouse debate on the Shroud with the  hope of at least getting some specialists involved on matters such as the weave and the iconography of the images.\n\n","date":"May 7, 2015 at 5:08 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198526","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Before destroying Mr Wilson’s argument we can destroy the Paint hypothesis of Mr. Freemans. How painted image became a Negative Image after flaking off the pigments? Shroud of Turin image is not a painted one.\n\n","date":"May 7, 2015 at 4:48 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198525","author":"Sampath Fernando","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":" “Not a citation, no reference from his episcopal archives, no quotation from what Bishop Henri had written, all indirect reporting. Furthermore no document has ever been found or identified written by Bishop Henri that would corroborate anything that D’Arcis claims about Henri’s investigations”.\nHistory is based on documents. And there are different kinds of documents.  Some are more reliable than others and each epoch has their own levels of reliability. In the Ancient world there were not notarial records or videotapes of every relevant event. In addition, a massive amount of documents have been lost and the majority of data are known by copies of copies. With Daveb’s criteria we should to put in the wastepaper basket the letters of Saint Paul or Plato, for example. \n“Disciplina arcana” are magic words to justify anything. There is not a single reason why the evangelists have to conceal the existence of this marvellous legacy of their Lord, the Holly Shroud. There is not a single reason why the cloth continued to be an “arcanus” with the triumph of Christian Empire when other legends, such as Abgar’s episode, were widely widespread and a multitude of relics arose from beneath the stones. \nThere is not a single reason why this marvellous relic was not registered in the inventory of the relics when the chapel of Lirey was consecrated. \nThe Papal bulls of Clemente VII implied a pre-existent document from Bishop d’Arcis in similar terms to the copy that Chevalier discovered. There is not any reason to doubt of the authenticity of this letter. It reflects the polemic origin of the Shroud of Lirey. Another different thing is the reliability of d’Arcis’ claims for forgery. This is a more debatable subject.\n\n","date":"May 7, 2015 at 2:22 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198514","author":"David Mo","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Why Canonical Gospels have not mentioned anything about the Shroud. (also about the other disciples of Jesus)?\nAccording to Gospel of John we know that Peter and John saw the burial clothes of Jesus at the Tomb. But John did not write that they took the burial clothes with them. Why?  Most probably they did not want to steal the clothes which were belonging to Joseph of Arimathea. \nDuring the last 3 months 3 reformed Christians (born again) condemned the Shroud of Turin because it is an image. They did so because they believe that Scriptures (Bible) are inspired by God.  \nSo is this the same reason Gospel writers did not want to mention the image on the burial cloth of Jesus? They may have thought their eye witness record (of resurrection) is more important than the image on the burial cloth. \nHowever according to Gospel of Hebrews Jesus gave the Linen Cloth to the Servant of Priest. Who is this servant? Most probably this servant is one of the other disciples not mentioned in the canonical Gospels (after Jesus death). \nFour canonical gospels are not giving any information about the other disciples after the death of Jesus.  We can read only about Peter, John and Thomas before the ascension. There some names in John 21:1-3. We can’t read anything about Thomas who preached in India.\nGospel of Hebrews was written in middle of the second century and the writer of this Gospel knew about the linen cloth. May the writers of canonical gospels did not know about it or just ignored it.\n\n","date":"May 7, 2015 at 6:43 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198567","author":"Sampath Fernando","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"In 1344 Geoffrey I de Charney had already won a hero’s reputation for his part in capturing the harbour fortress at Smyrna.  Back in France in 1349, he petitioned Pope Clement VI to found a collegiate church in his home village of Lirey with six canons.  On 1350, Jan 1 in an unsuccessful attempt to regain Calais, he is captured by the English and taken prisoner, not being released until 1354 when he now petitions Avignon Pope Innocent VI for his church.  In the meantime he is credited with having written a manual on the ideals of knightly chivalry.  His epaulettes were decorated with the motto “Honour conquers all!”  Hardly the character of a person given to any kind of fraud!  \nHe is so highly thought of, that he is appointed to the coveted role of porte-oriflamme, and is killed defending his king at the Battle of Poitiers 1356, 19 Sept.  He leaves a widow and a young son Geoffrey II, who is still a boy.  It is likely that the Shroud was displayed in Lirey during his life-time, probably in 1355, as the medallion struck for the event shows his arms on the dexter side while those of his wife are displayed on the sinister.  The year would match the date implied by the D’Arcis memorandum.  \nBishop Henri of Poitiers was appointed to the See of Troyes in 1350, having previously been Bishop of Gap.  He survived until 1370, some 14 years after the death of Geoffrey I.  He was succeeded by two short-term bishops before Pierre D’Arcis.  It seems that Troyes remained relatively untouched by the wars, and there would seem to be little that would have imperilled the diocesan archives during this time.  \nIn 1356, 28 May, only a few months before the disastrous Battle of Poitiers, Bishop Henri goes on record as praising Geoffrey I for his founding of the Lirey Church.  There seems no suggestion that the Lirey expositions are a reason for any caution in this regard, and they do not seem to be mentioned.  At some subsequent date, Geoffrey II marries Margaret de Poitiers, niece of Bishop Henri through his brother Charles de Poitiers.  They have two daughters, Margaret de Charny and Henriette.  \nClearly the relationship between Bishop Henri and the de Charnay family were rather more cordial than the Bishop D’Arcis’ letter would allow.  There is no reference to Henri’s investigations, nor his consulting with unnamed theologians, nor of some chat with an unknown artist, nor is any such evidence cited by D’Arcis.  \nBishop D’Arcis received little sympathy from the Papal Legate on the substance of his complaint, and was twice enjoined by Pope Clement VII to perpetual silence on the matter under pain of excommunication.  If there was any evidence he could quote to bolster his case, it was readily available to him in the diocesan archives, but the best he can do is only to give a vague time lapse of 34 years as to its timing.  There is no quotation or citing of any text from Bishop Henri’s alleged investigations.   \nThe document is redolent of hearsay, misguided zealotry, and not a little self-interest.   During the Christmas of 1389, a disaster overtook D’Arcis’ Troyes cathedral which had been under construction for the past century.  The entire nave collapsed because of the failure of one of the arches, and the rose window of the north transept fell out.  Decades of fund-raising had gone to waste and he had a cathedral filled with rubble and broken glass.  He had to hire 30 labourors merely to clear the mess.  \nIn the meantime, thousands of pilgrims who might have provided the funds for his much-needed remedial work, were flocking to a tiny village church within his diocese, but over which he had no control because of its collegial status.  How galling it must have been for him.  \nOf the paint that he claims was so cunningly applied by his unknown artist, there remains not a vestige.  If Bishop Henri ever discovered the secret of the image as alleged, then he imparted it to no-one, nor was it known to his successor Bishop D’Arcis, nor has anyone else since ever discovered this marvelous secret.\n\n","date":"May 7, 2015 at 6:43 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198531","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I see that now you don’t call anymore into question the authenticity of the d’Arcis memorandum. Now you are trying to call into doubt the content. \nBut your arguments are mostly fantastic. They are stories of “cordial” feelings and jealous hates: the basis for a good TV series but to a bad book of history. \nLet us come back to the facts.\nThe facts are the statements that we can substantiate on the basis of the documents that are preserved. And you are right. We have several documents about the founding of the Lirey’s collegiate. One of them is the confirmation by the Bishop Henry de Poitiers. It is a laudatory text and, you are right, there is not any disapproval of the public ostensions of the Shroud, but… nor is there any reference to the Shroud or its exhibitions. As in the other documents. The most direct explanation for this is that the shroud wasn’t in Lirey at this time or it wasn’t considered a relic. This is also consistent with  d’Arcis’ claims that the upset of Henry de Poitiers was due to the public exhibition of the Shroud as an authentic relic. And it would be unthinkable that the public exhibitions of the Shroud were known by Henry without any mention to it either laudatory or condemnatory. And this is also consistent with the lack of mention to the Shroud in the list of relics when the foundation of the chapel.  \n“Of the paint that he claims was so cunningly applied by his unknown artist, there remains not a vestige. If Bishop Henri ever discovered the secret of the image as alleged, then he imparted it to no-one, nor was it known to his successor Bishop D’Arcis, nor has anyone else since ever discovered this marvelous secret”.\nPerhaps there was not any “secret”. The painted cloth is the Shroud of Turin. You know, the Bishops don’t usually made handbooks of painting.\n\n","date":"May 8, 2015 at 4:23 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198587","author":"David Mo","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“I see that now you don’t call anymore into question the authenticity of the d’Arcis memorandum. Now you are trying to call into doubt the content.”  No, both!  \nMarkwardt I think makes an excellent case, substantiated by citations.  Some of his conclusions: \n“The progressive clerical conspiracy against the Shroud successfully suppressed the simple truth that Pierre D’Arcis, sentenced to perpetual silence and fearing that a papal investigation would prove his charges baseless, thought better of having his draft memorandum transcribed and then prudently discarded it. … The conspiracy’s enduring influence is attributable both to the estimable standing and reputation of its participants and also to the false premise that they had conducted thorough research, amassed numerous authentic and corroborating documents, and based their conclusions upon hard documentary evidence.” \n“In 1903, Herbert Thurston confidently pronounced the Shroud a fraud and sanctimoniously proclaimed that “…the probability of an error in the verdict of history must be accounted…as infinitesimal”. A review of the complete record, however, persuasively establishes the ultimate irony that an inauthentic document and an inauthentic translation were used to undermine the case for the Shroud’s authenticity and that Chevalier and Thurston’s “verdict of history” was procured with manufactured evidence, withheld material facts, and false testimony.”  \nMy comments above addressed what substance there might be in the draft, and found it seriously deficient.  D’Arcis would have had complete and free access to all and any evidence in Bishop Henri’s archives, but provides not a single document, not a single fact, not a single phrase from Bishop Henri against the expositions.  It is all hearsay.  It is even suggestive of malicious motives, because of his own problems.  The best that can be said is that perhaps he honestly believed that survival of the burial cloths were too improbable and saw it as his duty to protest against what he saw as an abuse of a relic cult.  And so he made the best case he could, but his apparent inability to cite anything from Bishop Henri’s archives indicates that he had no real evidence.  The Papal Legate remained unimpressed, likewise Pope Clement VII. \nThe cordial relations between Bishop Henri and the De Charnay family are relevant, as it is unthinkable that Henri would be so effusive in his praise if he had any real objections to the expositions which would have occurred at an earlier date.  His status as bishop would have been a weighty consideration in allowing the marriage of his niece to Geoffrey II some years later.  \nYou appear to have swallowed the Charles Freeman flaky paint origins of the Shroud.  If you insist on pursuing a skeptical agenda in the matter, you may find Colin Berry’s enquiries more fruitful and more to the point.\n\n","date":"May 8, 2015 at 6:30 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198594","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I don’t care about the gratuitous disqualifications that Mr. Markwardt  or you dedicate to Chevalier or Thurston. Their interpretation of the d’Arcis memorandum is not the subject now. We are speaking about its authenticity and reliability. \nOn this matter you have not say anything except that the manuscript is a copy and that no textual quotation is made. These objections are irrelevant. They only show that you (and Markwardt) ignore the basic features of the palaeography. A big amount of ancient texts are copies and they have not textual quotations, footnotes or consulted bibliography. And nobody call them “hearsay”.\nNot to mention the famous conspiracy. \nWhat do you know about the rol of Henri de Poitiers in the alliance policy of the family of Charny? The matrimonial policy in the Middle Ages was a very complex matter that had nothing to do with “effusive” or “cordial” feelings. Or was he satisfied with the suspension of exhibitions after his interdiction  (cf. d’Arcis)?  You continue with your TV series. But your characters are too anachronistic. Do you like the Sopranos?\nIf the praised of the merits of the Lirey’s chapel by Henri de Poitier was so “effusive” (sic) why he doesn’t dedicate one single word to such great relic as the Shroud was and its multitudinous  (d’Arcy dixit)  exhibitions? Only two possibilities: or the Shroud was not in Lirey or it was not considered a relic and there weren’t any exhibition in 1356. The first possibility points to a forgery made by the monks of Lirey. This is consistent with the Papal bull that states that the  cloth is not the real Shroud. The second possibility points to Freeman’s theory. I refrain my judgement on this point because I think we have not enough serious hints in any direction.\n\n","date":"May 9, 2015 at 1:08 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198675","author":"David Mo","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"On the question of the authenticity of the d’Arcis memorandum I think it is interesting the footnote 6, p. 26 of Chevalier’s Étude critique sur l’origine du saint suaire de Lirey-Chambéry-Turin , Paris, 1900.\n“This historic document, of capital importance and precious for more than one reason, deserves to be integrally read. Its authenticity is beyond doubt because I have found the minutes, once lost in the Archive of the diocese of Troyes. In order to establish the homogeneity of the copies that survive there, I have given together with the original text the strict collation of a contemporary transcription (Appendix, letter G) and I have duplicated an analysis (App. H) and two summaries (App. I and J) conserved in diverse places”. (Personal translation).\n\n","date":"May 9, 2015 at 9:52 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198712","author":"David Mo","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Charles misleadingly (as usual) wrote: “none of them (the Byzantine Experts) that I have had contact with consider that the Shroud is pre-medieval anyway.”\nHe should have asked Kitzinger and Belting instead in the early and even late seventies: both of the latter (along with several others) would have told him then the Constantinople and Turin Sindons were the same.\n\n","date":"May 7, 2015 at 12:38 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198548","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I believe Belting thought is was a later copy but the iconography of the Shroud with its bloodstains is all wrong for Byzantine imagery which doesn’t do blood..\n\n","date":"May 7, 2015 at 12:49 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198550","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"No blood = no Constantinople sindon as the true burial winding sheet of Yeshu’a? Oh really?\n\n","date":"May 7, 2015 at 1:09 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198553","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Byzantine Imagery is one thing, Byzantine Christic relic quite another. \nHow can you seriously want us to believe you as a ‘relic expert’, there was not a single relic of the precious blood in the Imperial Palace at Constantinople just because Byzantine imagery doesn’t do blood. Are you kidding?\n\n","date":"May 7, 2015 at 1:44 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198556","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"…and then come the allegedly ‘most scientific and conclusive’ 1988 radiocarbon dating and all the Byzantine Experts remained silent as they shied away from the TS…\n\n","date":"May 7, 2015 at 1:08 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198552","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Out of the natural kindness of my heart, I shall recommend that Colin reads Spike Bucklow’s The Alchemy of Paint, Art, Science and Secrets from the Middle Ages. It might give him some ideas with which to launch his new attempt to recreate an image on discoloured linens.\n\n","date":"May 7, 2015 at 12:47 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198549","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hilarious Charles. You missed your vocation (stand-up comedian).\nThe problem I have right now is not lack of ideas, but time and energy to test them all. Chemical development, the essence of my new model (still looking good, see below ) takes time – some 6 hours typically. Yes, I can  simply steep the imprints in nitric acid solution for a 5 minute development, as discovered just an hour ago – but it’s messy and somewhat hazardous. I’ll probably stick with the vapour in my sealed jars.\nAs I say, the model is still looking good. Indeed, it’s looking better with each passing minute. Here’s one I made earlier, imprinting the sole of my foot with a mixture of white flour, egg tempera and a little milk, followed by development in nitric acid vapour.\n\nThat’s the negative image top left, a Secondo Pia type tone reversal lower right, and the 3D-rendered version in ImageJ on the right. Do you seriously imagine you could reproduce my results with your  flaked-off paintings Charles? \nToday’s posting sets out approaches to improving still further on the 3D imaging. It’s now less about science, more about fine-tuning the technology.\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/05/the-chemical-principles-behind-iconic.html\n\n","date":"May 7, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198555","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I still don’t understand how even if you recreate an image today, you can be sure that it will exist in the same chemical state in seven hundred years time. \nThe issue for recreating the Shroud, and it is a challenging one, is working out how it looked seven hundred( or some would argue even more) years ago. That is what you have to recreate,not how the Shroud looks today when the linen will inevitably have degraded somewhat from its original state.\nAs I am not a scientist,  rather a comedian, tour guide, etc,etc, – you can find my biog under Charles Freeman, Yale University Press – I would like an explanation of how linen and discolourations on it can remain in the same chemical state over  hundreds of years. This  seems to be the assumption by all Shroud researchers but they never explain why this should be the case. It seems an obvious question to a historian who deals with the problems of understanding ancient objects on a daily basis and seldom, unless  they are in gold or similar materials, have existed unchanged.\n\n","date":"May 7, 2015 at 2:38 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198560","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"It’s the same old circular argument, repeated over and over, with ears closed to replies. \nIf you start with the assumption that the TS is a painting, then yes one expects more or less serious deterioration. \nBut it’s not a painting because it’s a negative image and thus an imprint. What’s more it was deliberately made to look like a faint imprint from the word go, because it was intended to resemble the REAL imprint left by a crucified man on linen, and real imprints would be faint after 1300 years (33 to 1350 AD) so the forgery HAD to be faint from the word go. There’s also the small matter of the image being  life-size AND showing both frontal and dorsal views of the man but without sides. That should ;leave absolutely no shred of doubt in most [people’s minds that the TS was intended to be seen as an IMPRINT, not a work of art. It was faint at the start, faint when the Lier copy was made, and even fainter today, but reproducing modest ageing changes is not part of this researcher’s checklist of priorities. My chief objective is to address the claim that the image characteristics are not explainable with conventional science. I say they are, and have a model for doing so that is yielding fresh insights by the day, by the hour. \nThat’s all I have to say, Charles. Recycling old comments threads is not my idea of making productive use of time.\n\n","date":"May 7, 2015 at 3:03 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198561","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Colin, I still think you need to do some work on medieval craftsmen’s techniques and the mass of work on painted linens before you spend more money on flour and nitrates. I have recommended you a book to get started with.\nIf you were examining how the Mona Lisa was painted would you get started without reading anything about painting of the era? You would not have any credibility and would simply be laughed at.- you take the same risk here but perhaps you are quite happy with that.\nI am happy to wait around until at last we get some specialists involved. They are there and the focus must be on getting the Shroud and medievalists of various disciplines together as was done in 1973.  I think the dating of Noemi Gabrielli, originally Director of the Art Galleries of the Piedmont, was, iconographically, a century too late but she did examine the Shroud close-up as an art historian and considered that the images were ‘drawn by the artist directly onto a wet cloth stretched on a frame, using a compound of sepia-coloured clay and yellow ochre diluted in a resinous liquid’ and she goes on toe describe the technique. Since then there has been an immense amount of work done on painted linens of which she would not have been aware but it is high time it was exploited. Disregard it if you want.\nI am happy to debate here but my focus is on a completely different sort of specialists, those who actually know something about what paint has or has not done to medieval linens seven hundred years on. They may end up rubbishing me but at least we might break the log-jam of stagnation in Shroud studies.\n\n","date":"May 8, 2015 at 4:12 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198586","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"“… at least we might break the log-jam of stagnation in Shroud studies.”\nSpeak for yourself Charles. There is no log-jam or stagnation in my chosen and highly focused area of research. \n My plan of action, sustained through some 300 postings over 3 years, recognized from the outset that a dual front and back NEGATIVE image of a life size man on quality linen, with real or look-alike blood and a backing biblical narrative, was an IMPRINT, not a painting. You have consistently chosen to ignore or misrepresent both the implications of an imprint AND curiously the written historical record, starting with the D’Arcis memorandum.\nI shall now get back to Model 9, one that ticks far more boxes than its predecessors.- like giving negative images with 3D properties, as did thermal scorches, but also imprinting off real people, not just metal templates, like being more prominent initially than would be the case decades or centuries later, like fitting the chemical and spectral characteristics of oxidized carbohydrates, not medieval paint pigments etc \nI have a working model, Charles, immediately testable by me  (in progress) or anyone else for that matter, either in a garage or a well-equipped laboratory? What do you have?\n\n","date":"May 8, 2015 at 4:50 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198589","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I have to admit that Colin’s work is very interesting.\nIn fact, it is the best work (still in progress) I ever seen, based on the “chemical imprint” hypothesis.\nThe fact is that the TS image is an “imprint”, not a paint, is obvious.\nThe fact that the TS image is a contact-only imprint rather than a contact+non-contact imprint is still undecidable.\nHopefully, at the end, we will see if the best contact-only hypothesis (the “chemical imprint”) can match or not at least the macro properties of the TS image.\nColin wrote (see his blog): “The task: produce a contact image that could be claimed to be that left by the crucified Jesus on Joseph of Arimathea’s ‘fine linen’.\nNot only that.\nThe TS IS such an image. But this image has some fundamental properties.\nSo, we will see.\nSincerely, good luck.\n\n","date":"May 8, 2015 at 4:52 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198657","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Thanks Thibault. Your comment is most gratifying, and shows true generosity of spirit, given our differences in the past.\nIn an earlier comment here yesterday, I was deliberating on what should be the ideal consistency of the imprinting medium in order to achieve best 3D effects. I said it should be paint-like, i.e. tacky and viscous, so as to stay where applied on the 3D subject, since if runny, it would flow off the highest points of the relief down into the hollows and mess up the 3D rendering.\nOops. I was forgetting that gravity can be made to work for one. If you want a liquid imprinting medium to stay put on the highest relief, and indeed concentrate at the highest points, then turn the subject (or template) upside down before imprinting, and press it DOWN into linen.\nThere are two types of subject-to-linen presentation  one can use when imprinting, what I have previously called LUWU (Linen Underneath, With Underlay) and LOTTO (Linen On Top, Then Overlay).\n Use the LUWU configuration(even if easier said that done where real people are concerned).  That requires painting the subject with imprinting material, then lying face DOWN into the linen to imprint the FRONTAL surface. If the medium is fairly runny and mobile, then in the brief time the subject positions himself face DOWN, the medium runs to the LOWEST points of the relief, due to gravity, which would have been the HIGHEST points when face up. It is the concentration of medium at the new lowest relief that might generate most if not all of the negative and 3D properties of the final 2D imprint.\nOK, so it might be tricky to get a clean imprint via LUWU. However, the purpose in hinting at a gravity-aided model is not to suggest this was how imprinting was actually achieved, but simply to flag up the wealth of options on offer. Yes, one risks attracting unflattering references to Occam’s Razor. But having a range of options for modelling is not the same as needing to attach a host of qualifying assumptions to a model through having a limited range of options.\n\n","date":"May 9, 2015 at 12:07 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198674","author":"Colin Berry","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Just in case Hugh could miss it, I rep:ost one of my previous posts:\nHugh, could you or could not you really take up my challenge?\nI CHALLENGE YOU AGAIN (THIRD TIME!):\n“Could you find in the whole medieval and late medievalLatin corpus PRIOR TO 1389 CE (as estimated date of the D’Arcy memorandum) one single OCCURRENCE of both the perfect and pluperfect active indicative of the verb copio, copiare prior to the estimated date of the D’Arcy memorandum?”\nIf YOU JUST CANNOT, most obviously it just means the verb copio, copiare, “to reproduce, to copy”, was NOT AVAILABLE AT ALL in the 14th c. CE, and my point does stand correct: IN CONJUNCTION WITH the adverb CUNNINGLY, the verbs depingo, depingere and depicto, depictere were the fittest (for lack of a better Latin verb available then) to convey then the meaning of copiare, “to reproduce, to copy” as far as painting an image is concerned, which is precisely what ‘your’ Lewis and Short’s Latin Dictionary most precisely DOES FAIL to tell us.\nAll the more so as the very infinitive present copiare (“to copy/reproduce”) comes from coopia > co, “together (with)” + opis, “resources/ability/power”, and thus etymologically speaking and in reference to a cleverly/cunningly painted reproduction or copy, can mean “to paint with resources (in terms of creativity)/ability (in terms of talent or even genius)/power (in terms of impressive rendering)” or in other words “to cunningly paint”, which is EXACTLY what is implied in the memorandum passage under study (Reperit fraudem et quomodo pannus ille artificialiter depictus fuerat, probatum fuit etiam per artificem qui illum depinxerat). Do note how artificialiter depictus, “cunningly painted” echoes depinxerat, “(an/the artist) had painted”.\nUsing the singular third person perfect/pluperfect active indicative depinxit/depinxerat, Pierre d’Arcy did refer to the Lirey Shroud as an artefact “AN/THE artist (had) (CUNNINGLY) painted. The bishop of Troyes was referring to the Lirey Shroud as a CLEVER reproduction/copy of the Shroud of Christ to be used during the liturgies of Easter Week as a liturgical shroud or “cloth of the Resurrection” not unlike the 13th-14th CE Besançon Shroud, a more grossly painted reproduction/copy of the said cloth (most likely a painted reproduction/copy of the one Othon de la Roche sent from Athens to the Besançon Archbishop, Amédée de Tramelai via his own father, Ponce de la Roche as the old legend –dating back at least to the 16th c. CE– has it re the disappearance of “the cloth of the Resurrection” in the Besançon fire of the church of saint stephens and its sudden reappearance in the same church about two years later (1349 CE) on Easter.\n\n","date":"May 7, 2015 at 1:47 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198557","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"No, Max. Your challenge is meaningless. I do not care even to look for a medieval copiaverat. The word was indisputably available, even if there is no actual instance extant today. Even if it wasn’t, the idea that therefore Bishop d’Arcis thought the Shroud was a copy from another is illogical and unsubstantiated.\n\n","date":"May 7, 2015 at 10:02 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198574","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh’s comment suggests that he has missed the point.  Disregarding whatever the contemporary currency of Latin past perfects and pluperfects might have been, the issue is more fundamental.  I don’t know that It can be argued that D’Arcis believed that the Lirey Shroud was a copy of another of more substantial reputation.  He makes it clear enough that he believes that the original burial cloths did not have an image, otherwise he claims the evangelists would have mentioned it.  He gives the impression that any burial cloths showing an image are necessarily of human origin and skill.  \nIt is known that copies of the Shroud were made, such as that at Besancon and others, perhaps Bishop D’Arcis has heard of such work, knows that an apparently convincing image can be manufactured, and jumped to a conclusion that it necessarily applies to the one in his diocese, and over which he is otherwise powerless to prevent.  \nSee also my comments at May 7, 6:43 am, and my response to David Mo at May 8, 6:30 am, both of which I believe make a strong case against the D’Arcis memorandum.\n\n","date":"May 8, 2015 at 6:55 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198596","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, you misleadingly (as usual) wrote:\n“The word (copiare) was indisputably available, even if there is no actual instance extant today”. Can you really re-read yourself?\nYOUR answer is TOTALLY unsubstantiated not mine as I mean facts! \nRe FACTS, how come there is no one single occurrence of the verb copio, copiare (e.g. in the perfect and pluperfect active indicatives) prior to the mid 18th c. CE whereas it should have been of extremely current use? \nBesides, had you read the medieval Historian, Victor Saxer’s research paper, “Le Suaire de Turin aux Prises avec l’Histoire” you SHOULD have been aware he HIMSELF uses the word “copie” many a time to describe the Lirey Shroud e.g. twice on p. 31, we can read:  \n“En public ils (les chanoines, precision mine pun intended) le (le Suaire de Lirey, precision mine pun intended) présentaient comme une COPIE (upper cases mine) du Suaire (du Christ, precision mine pun intended)” ; en privé ils disaient que c’était le vrai.”\n“(…) les channoines continuaient à agir frauduleusement puisuq’is tenaient deux languages en public et en privé et qu’ils vénéraient et faisaient vénérer une COPIE (upper cases mine) à l’égal de l’original”.\nHow come Saxer himself used the very word copie to describe the Lire Shroud if Pierre d’Arcis had not seen the Lirey Shroud as a COPY?! Do you seriously think your medieval Latin is far better than the medieval historian Victor Saxer and/or Frère Bruno Bonnet-Aymard?\nEven pope Clement VII in his bulle (final version) described the Lirey Shroud as pannum fore Sudarii representacionem seu figuram, “une représentation figurée du Suaire (du Christ)”. Now  in French language, la représentaiton figurée d’un objet –such as the Shroud of Christ– is une reproduction, une copie/a reproduction, a copy since both words are synonymous both in French and in English!\nYour BAD FAITH (again!) is flabbergasting. I do mean facts, YOU mean FANTASY!\n\n","date":"May 8, 2015 at 7:07 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198599","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Typo: les channoines continuaient à agir frauduleusement puisqu’il tenaient deux languages (double-dealing)\n\n","date":"May 8, 2015 at 7:11 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198600","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Oops: chanoines\n\n","date":"May 8, 2015 at 7:12 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198601","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Additional typos (sorry): “Do you seriously think your medieval Latin is far better than the medieval historian’s, Victor Saxer and/or Frère Bruno Bonnet-Aymard’s?\n\n","date":"May 8, 2015 at 7:26 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198602","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"In sum, Pierre d’Arcy thought an artist had depicted/painted the Lirey Shroud by artifice. Through his eyes, it was not and could not possibly be the true burial Shroud of Christ since it had a figure of the latter on it; It was but a reproduction/copy of it with a double effigy. Period.\n\n","date":"May 8, 2015 at 7:50 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198605","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Can Hugh tell us what is exactly a representacio seu figura of the Shroud of Christ if not a an attempt by an artist to precisely copy or reproduce the original or a copy or reproduction of the original Shroud of Christ?\n\n","date":"May 8, 2015 at 8:11 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198607","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"(Just in case Hugh, has missed it, I re-post my reply to him)\nHugh, you misleadingly (as usual) wrote:\n“The word (copiare) was indisputably available, even if there is no actual instance extant today”. Can you really re-read yourself?\nYOUR answer is TOTALLY unsubstantiated not mine as I mean facts!\nRe FACTS, how come there is no one single occurrence of the verb copio, copiare (e.g. in the perfect and pluperfect active indicatives) prior to the mid 18th c. CE whereas it should have been of extremely current use?\nBesides, had you read the medieval Historian, Victor Saxer’s research paper, “Le Suaire de Turin aux Prises avec l’Histoire” you SHOULD have been aware he HIMSELF uses the word “copie” many a time to describe the Lirey Shroud e.g. twice on p. 31, we can read (about the Lirey collegiate canons’ double-dealing:\n“En public ils (les chanoines, precision mine pun intended) le (le Suaire de Lirey, precision mine pun intended) présentaient comme une COPIE (upper cases mine) du Suaire (du Christ, precision mine pun intended)” ; en privé ils disaient que c’était le vrai.”\n“(…) les chanoines continuaient à agir frauduleusement puisqu’ils tenaient deux languages en public et en privé et qu’ils vénéraient et faisaient vénérer une COPIE (upper cases mine) à l’égal de l’original”.\nHow come then Saxer himself used the very word copie to describe the Lirey Shroud if he reallly thought Pierre d’Arcis had not seen the Lirey Shroud as a COPY?! Do you seriously think your medieval Latin is far better than the medieval historian’s, Victor Saxer, and/or Frère Bruno Bonnet-Aymard’s?\nEven pope Clement VII in his bulle (final version) described the Lirey Shroud as pannum fore Sudarii representacionem seu figuram, “une représentation figurée du Suaire (du Christ)”. Now in French language, la représentation figurée d’un objet –such as the Shroud of Christ– is une reproduction, une copie/a reproduction, a copy since both words are synonymous both in French and in English!\nYour BAD FAITH (again!) is flabbergasting. I do mean facts, YOU mean FANTASY!\nIn sum, Pierre d’Arcy thought an artist had depicted/painted the Lirey Shroud by artifice. Through his eyes, it was not and could not possibly be the true burial Shroud of Christ since it had a double effigy of the latter on it. He vehemently claimed it could only be a reproduction/copy of it. Period.\nCan now Hugh tell us what is exactly a representacio seu figura of the Shroud of Christ if not a an attempt by an artist to precisely copy/reproduce the original or a copy/reproduction of the original Shroud of Christ? Looking forward for his answer in good faith.\n\n","date":"May 8, 2015 at 9:59 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198626","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"No Max, you misunderstand the conjugatability of a word. It is apparent, as I think you agree, that copio, copiare, copiavi, copiatum existed as a regular verb in medieval times. The perfect stem ‘copiav-‘ has been attested by yourself in connection with Pope Urban V, an Avignon Pope approximately contemoprary to the correspondence between d’Arcis and another Avignon Pope a few years later. It is not necessary to find an actual example of every form of a verb for it to be ‘available’ for use if required. In the entire internet, nobody has ever used the form “we will have Googled”, but the form has been listed several times in computer-generated lists of possible forms of the verb to Google.\nI do not agree that “he had copied” was of “extremely current use” nor that it should necessarily have been. If people had wanted to say “he had copied” they would have said it, in one way or another, either using copiaverat or some other word, but in fact neither alternative is found. In all medieval Latin literature there is no reference to a painting having been copied by a copyist using any translation of “he had copied”.\nYour last post is muddled. D’Arcis and the Pope thought the Shroud of Lirey was a representation of the true shroud of Christ, not the actual thing. It was not a copy or a reproduction of the real shroud, as there was no original from which to copy it, but an reconstruction of what the real shroud might have been like.\nYou are misleading in claiming that the Latin word ‘representatio’ means ‘copy’ or reproduction,’ without recognising its primary meaning as ‘representation.’ The first two imply a physical original from which a copy or reproduction may be made, but the primary meaning does not require such an original, and may as well derive from a description. I believe Victor Saxer knew that perfectly well.\n\n","date":"May 8, 2015 at 10:52 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198632","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Reminder for Hugh (who has failed tlll now to do his homework)\nThe Latin verb copiare use in the figurative sense of “to imitate, to copy a painting, an artefact” is attested NOT PRIOR TO THE 1640S, which does confirm Pierre d’Arcy (who was writing in the late 14th c. CE) just could not use the verb copiare perfect and pluperfect active indicatives to mean an/the artist had copied (copiaverat) the Shroud of Christ.\nSee link at: \n\n“copy (n.) Look up copy at Dictionary.com\nearly 14c., “written account or record,” from Old French copie (13c.), from Medieval Latin copia “reproduction, transcript,” from Latin copia “plenty, means” (see copious). \nSENSE EXTENDED 15C. (ONLY) TO any specimen of writing (especially MS for a printer) and ANY REPRODUCTION OR IMITATION. Related: Copyist.\ncopy (v.) Look up copy at Dictionary.com\nlate 14c., from Old French copier (14c.), from Medieval Latin copiare “to transcribe,” originally “to write in plenty,” from Latin copia (see copy (n.)). Hence, “to write an original text many times.” Related: Copied; copying. FIGURATIVE SENSE OF “TO IMITATE” IS ATTESTED (ONLY) FROM 1640S.”\nThe verb copiare meaning “to imitate, to reproduce, to copy” an ARTEFACT, a PAINTING, a PAINTED COPY etc was NOT AVAILABLE till the 1640S! \nHugh, in other wordsYOU were wrong and finally I was right.\n\n","date":"May 8, 2015 at 11:08 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198635","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Reminder for Hugh (who has failed tlll now to do his homework)\nThe Latin verb copiare use in the figurative sense of “to imitate, to copy a painting, an artefact” is attested NOT PRIOR TO THE 1640S, which does confirm Pierre d’Arcy (who was writing in the late 14th c. CE) just could not use the verb copiare perfect and pluperfect active indicatives to mean an/the artist had copied (copiaverat) the Shroud of Christ.\nSee link at:\n“copy (n.) Look up copy at Dictionary.com\nearly 14c., “written account or record,” from Old French copie (13c.), from Medieval Latin copia “reproduction, transcript,” from Latin copia “plenty, means” (see copious).\nSENSE EXTENDED 15C. (ONLY) TO any specimen of writing (especially MS for a printer) and ANY REPRODUCTION OR IMITATION. Related: Copyist.\ncopy (v.) Look up copy at Dictionary.com\nlate 14c., from Old French copier (14c.), from Medieval Latin copiare “to transcribe,” originally “to write in plenty,” from Latin copia (see copy (n.)). Hence, “to write an original text many times.” Related: Copied; copying. FIGURATIVE SENSE OF “TO IMITATE” IS ATTESTED (ONLY) FROM 1640S.”\nThe verb copiare meaning “to imitate, to reproduce, to copy” an ARTEFACT, a PAINTING, a PAINTED COPY etc was NOT AVAILABLE till the 1640S!\nHugh, in other wordsYOU were wrong and finally I was right.\n\n","date":"May 8, 2015 at 11:09 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198636","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Reminder for Hugh (who has failed tlll now to do his homework)\nThe Latin verb copiare use in the figurative sense of “to imitate, to copy a painting, an artefact” is attested NOT PRIOR TO THE 1640S, which does confirm Pierre d’Arcy (who was writing in the late 14th c. CE) just could not use the verb copiare perfect and pluperfect active indicatives to mean an/the artist had copied (copiaverat) the Shroud of Christ.\nSee link at:\n\n“copy (n.) Look up copy at Dictionary.com\nearly 14c., “written account or record,” from Old French copie (13c.), from Medieval Latin copia “reproduction, transcript,” from Latin copia “plenty, means” (see copious).\nSENSE EXTENDED 15C. (ONLY) TO any specimen of writing (especially MS for a printer) and ANY REPRODUCTION OR IMITATION. Related: Copyist.\ncopy (v.) Look up copy at Dictionary.com\nlate 14c., from Old French copier (14c.), from Medieval Latin COPIARE “to transcribe,” originally “to write in plenty,” from Latin copia (see copy (n.)). Hence, “to write an original text many times.” Related: Copied; copying. FIGURATIVE SENSE OF “TO IMITATE” IS ATTESTED (ONLY) FROM 1640S.”\nThus, the verb copiare meaning “to imitate, to reproduce, to copy” an ARTEFACT, a PAINTING, a PAINTED COPY etc was NOT AVAILABLE till the 1640S (or at best the 15C)!\nHugh, in other wordsYOU were wrong and finally I was right.\n\n","date":"May 8, 2015 at 11:11 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198637","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Reminder for Hugh (who has failed tlll now to do his homework):\nThe Latin verb copiare use in the figurative sense of “to imitate, to copy a painting, an artefact” is attested NOT PRIOR TO THE 1640S, which does confirm Pierre d’Arcy (who was writing in the late 14th c. CE) just could not use the verb copiare perfect and pluperfect active indicatives to mean an/the artist had copied (copiaverat) the Shroud of Christ.\nSee link at:\n\n“copy (n.) Look up copy at Dictionary.com\nearly 14c., “written account or record,” from Old French copie (13c.), from Medieval Latin copia “reproduction, transcript,” from Latin copia “plenty, means” (see copious).\nSENSE EXTENDED 15C. (ONLY) TO any specimen of writing (especially MS for a printer) and ANY REPRODUCTION OR IMITATION. Related: Copyist.\ncopy (v.) Look up copy at Dictionary.com\nlate 14c., from Old French copier (14c.), from Medieval Latin COPIARE “to transcribe,” originally “to write in plenty,” from Latin copia (see copy (n.)). Hence, “to write an original text many times.” Related: Copied; copying. \nFIGURATIVE SENSE OF “TO IMITATE” IS ATTESTED (ONLY) FROM 1640S.”\nThus, the verb copiare meaning “to imitate, to reproduce, to copy” an ARTEFACT, a PAINTING, a PAINTED COPY etc was NOT AVAILABLE till the 1640S (or at best the 15C)!\nHugh, in other wordsYOU were wrong and finally I was right.\n\n","date":"May 8, 2015 at 11:13 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198638","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"My exegesis is no fantasy at all. YOUR opinion WAS!\n\n","date":"May 8, 2015 at 11:16 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198639","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Reminder: Pierre d’Arcy did think an/the artist had reproduced/copy a liturgical shroud with a figure that was used on Easter week (most likely the Shroud copy/reproduction Othon de la Roche had his father hand over to Amédée de Tramlai and that was kept in the Cathedral of Saint Etienne (St. Stephen), the cathedral church of Besançon until in 1347 CE, it was struck by lightning and it burned to the ground along with the Shroud copy.\n\n","date":"May 8, 2015 at 12:02 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198641","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Was the unknown artist (to whom Henry of Poitiers and Piere d’Arcis refer), the artist who had made a substitute painted copy/reproduction of the former liturgical Shroud that used to be kept in the cathedral church of Besançon but disappeared in the 1347 fire? It could be. According to the old legend, the “drap de la Résurrection” is reported to have disappeared in the fire an suddely/miracuously reappeared nearly two years later on Easter!\n\n","date":"May 8, 2015 at 12:17 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198643","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"The Besancon Shroud is quite clearly not a copy of the Shroud of Turin. End of story.\n\n","date":"May 8, 2015 at 2:02 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198648","author":"Charles Freeman","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Well this is weird, Max. Having spent dozens of posts denying that copio had a perfect tense, you’re now saying that the word didn’t exist at all! But so what? Depingo doesn’t mean ‘copy’, representatio doesn’t mean ‘copy’, d’Arcis didn’t mean ‘copy’. No doubt words for ‘copy’ were available, perhaps words for ‘copy’ were actually used in medieval literature. But depingo wasn’t one of them.\n\n","date":"May 8, 2015 at 2:57 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198651","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Reminder for both of you (Charles and Hugh) who are in denial of facts: \nBOTH Victor Saxer, a medieval historian and anti-shroudie familiar with medieval Latin AND Frère Bonnet-Aymard a pro-shroudie who is well versed in Latin too, AGREED the Lirey Shroud was thought by Pierre d’Arcis a “COPIE”/COPY or REPRODUCTION of the Shroud of Christ! \nNEITHER the medieval verb copio, copiare was used in the figurative sense of “to imitate, to copy, to reproduce” an artefact, painting prior to the 1640s CE (not one single occurrence known!) NOR the sense of the medieval word copia, “copy” extended prior to the 15 c. CE (not one single occurrence known!) to mean ANY reproduction or imitation, whence we can LOGICALLY deduced, copio, copiare, copia were indisputably NOT available in their FIGURATIVE OR EXTENDED sense in the 14th c. CE. Philological period.\nHugh and Charles, you can be wrong in your (unsubstantiated) opinion not in your facts!\nReminder for Daveb: when it comes to the D’ARCY memorandum exegesis, medieval words/phrases with both their explicit and implicit meanings/polysemy is relevant. All the more so as shroudies and anti-shroudies (in their limitative polarising either fake/or supernatural image logic) are all to prone to read what they want to read and discard RELEVANT ALTERNATIVE READINGS.\n(Latin versions of one of the two key sentences) “(…) reperit fraudem et quomodo pannus ille artificialiter depictus fuerat, probatum fuit etiam per artificem qui illum depinxerat/depinxit, ipsum humano ope factum, nonmiraculose confectum vel concessum.”\n(My English translations) “(…) eventually the fraud was discovered and how the said cloth had been depicted by cunning artifice, the truth being attested by \n-AN artist who had painted/reproduced/copied it\n-THE artist who painted/reproduced/copied it,\nto wit, that it was man made and not miraculously wrought or bestowed.”\n(My French translations) “(…) finalement la fraude fut trouvée  et comment ledit linge avait été peint/reproduit/copié par un habile artifice, preuve fut même donné \n-par UN artiste qui l’avait peint/reprodui/copié/\n-par L’artiste qui le peignit \nque de main humaine il avait été fait et non point par miracle réalisé ou bien accordé.”\n\n","date":"May 9, 2015 at 6:40 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198696","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Typo: preuve fut même donneE\n\n","date":"May 9, 2015 at 6:54 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198699","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"add. typo (sorry typing in haste):\npreuve fut même donnée\n-par UN artiste qui l’avait peint/reprodui/copié/\n-par L’artiste qui le peignit/reproduisit/copia\n\n","date":"May 9, 2015 at 7:00 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198700","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hi Hugh,\n                  If I remember well you were in Kathmandu last year ? You surely must have felt great sadness for the Nepalese people following this tragedy.\n                   Warm regards\n                   Patrick\n\n","date":"May 9, 2015 at 10:27 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198718","author":"PHPL","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"How kind of you to inquire. The two families with whom I am best acquainted were unharmed, but of course their wider circle suffered as much as anyone else, and one of their home villages (Langtang) was totally devastated. It’s always a shame when a country which is pretty poor anyway is made even poorer by natural disasters. Thank you very much for your concern.\n\n","date":"May 9, 2015 at 11:46 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198720","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"I consider this whole point-scoring fiddling argument concerning Latin verbiology is irrelevant, unimportant, unnecessary, and a most unfortunate distraction from the more fundamental issue that there is nothing of substance in the D’Arcis memorandum, relied on so heavily by skeptics to discredit the Shroud.  See my comments and other references to them at May 8, 6:55 am.\n\n","date":"May 8, 2015 at 3:23 pm","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198655","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Hugh, you misleadingly (AGAIN!) wrote (putting words in my mouth as usual!): “Having spent dozens of posts denying that copio had a perfect tense, you’re now saying that the word didn’t exist at all!”\nBOTH EXPLICITLY AND IMPLICITLY I have kept referring not so much to the common acception of the Latin verb copio, copiare as far as text writing is concerned as to its FIGUTATIVE and EXTENDED SENSE as far as PAINTING is concerned.\nPhilologically speaking YOU are wrong, and I am right, don’t you try to misrepresent AGAIN my opinion and use your usually unfair discourse at my expense, PLEASE!\n\n","date":"May 9, 2015 at 6:49 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-198698","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Colin Berry: Yes, it’s vitally important to match every tiny detail","post":"Reblogged this on Best of Shroud Story.\n\n","date":"July 15, 2015 at 5:16 am","url":"https://shroudstory.com/2015/04/30/colin-berry-yes-its-vitally-important-to-match-every-tiny-detail/","cat":"article","id":"comment-205822","author":"Dan","site":"shroudstory"}]
