[{"title":"Also Because of the Shroud of Turin","post":"Hi Mike, I feel the same way.\n\n","date":"June 13, 2015 at 5:41 am","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","id":"comment-201775","author":"Emmett McMahon","site":"shroudstory"},{"title":"Also Because of the Shroud of Turin","post":"Very nice.  I agree.\n\n","date":"June 13, 2015 at 8:55 am","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","id":"comment-201789","author":"Dcn Andy","site":"shroudstory"},{"title":"Also Because of the Shroud of Turin","post":"I became Christian based on entirely unexpected conversion experience from usual scientific skepticism as an adult, then became Catholic based on reading the “Apostolic” tradition of the early Church Fathers, whose experience and teaching seemed to confirm my own experience. This was furthered confirmed by early Jewish tradition of the Second Temple era about how Jews understood revelation. Paul’s experience (reported by Luke or Paul) about summarizes this as the earliest and only NT account of conversion. This is a supernatural thing.\nThis does not persuade me one way or another about the reality of the Shroud. It simply makes me wonder about the possibilities. (I have to say that many commentators here about the Shroud have no scientific competence beyond having a degree however advanced in mostly irrelevant subjects. They are lousy engineers with a target. But they simply don’t have the data or competence. Neither do I. I wish the Vatican would allow another study, one which is more carefully considered in methodology. (I have proposed this.) I have no prejudice about the outcome and it would not change my faith, which is based on other things. No matter what the Shroud image may be, it is at least a remarkable and faithful image.\nI have an open mind, because first of all, I have sufficient faith already.\n\n","date":"June 13, 2015 at 8:44 pm","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","id":"comment-201829","author":"David","site":"shroudstory"},{"title":"Also Because of the Shroud of Turin","post":"“the Gospels as the most trustworthy ancient documents we possess (with 25,000 existing manuscripts to check and cross-check for accuracy and authenticity)”\nHow can documents that sometimes don’t even agree with one another  be described as accurate in the first place ?\n\n","date":"June 14, 2015 at 2:37 am","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","id":"comment-201915","author":"PHPL","site":"shroudstory"},{"title":"Also Because of the Shroud of Turin","post":"PHPL: How can documents that sometimes don’t even agree with one another be described as accurate in the first place ?\nThank you PHPL. I am having the same difficulty with the books of NT.  But one day Shroud of Turin will reveal that Jesus died for fighting the injustice of the world (some say sins of the world) and the resurrection (created image on the shroud) will show that God sent the perfect human being to us to believe the message of Love and also  to reveal God is in full control over the Universe.\n\n","date":"June 14, 2015 at 4:29 am","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","id":"comment-201935","author":"Sampath Fernando","site":"shroudstory"},{"title":"Also Because of the Shroud of Turin","post":"don’t have time to respond to the old “documents don’t agree with one another argument”..suggest you search catholic sites for explanation on this tired old issue\n\n","date":"June 14, 2015 at 10:28 am","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","id":"comment-202034","author":"rick","site":"shroudstory"},{"title":"Also Because of the Shroud of Turin","post":"Sampath & Patrick:  I wonder if either of you have ever had to give a funeral oration or eulogy.  For it is the common experience of those who have done, to be challenged afterwards by the deceased’s friends and relations.   “It wasn’t like that at all” and “You had the facts completely wrong” are common enough retorts from close family members who thought they knew better.  Even after giving eulogies at my own parents’ funerals, I was challenged by siblings and others, but I had delivered what I felt was true to my own experience of both of them.  Others would have a different perspective. \nI think the Gospels and the Acts of the Apostles are a little bit like that.  Written by different followers, each with their own particular perspective and each with their own purpose.  The NT exegetes see a development from primitive Mark, through Matthew and Luke, and finally John.  Although they have a historical basis, they are not intended to be history in the style of Heredotus or Josephus, but rather as proclamations.  The second half of Luke’s Acts deals with his journeys with Paul, yet they often seem not consistent with some of Paul’s theology expressed in the epistles. \nA particular perspective:  Matthew is concerned to portray Jesus as the new Moses, and his gospel is directed at a gentile community.  So he arranges to bring the infant Jesus out of Egypt, based on what may be a fictional massacre by Herod.  He has Jesus preach his sermon from a mountain (like Moses) whereas Luke has him preaching from level ground,  And there are other pointers to this Mosaic interpretation by Matthew.  At the birth of Jesus, Matthew brings in gentile wise men from the east, whereas Luke has Jewish shepherds.  Matthew is even concerned to include a few gentiles in his genealogy of Jesus, and even one or two disreputable women,  \nEach of the evangelists have their own proclamatory purpose in what they write.  But there remains an adequate integrity of consistency among all four of them.\n\n","date":"June 14, 2015 at 4:21 pm","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","id":"comment-202079","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Also Because of the Shroud of Turin","post":"Thank you Daveb. As engineer like you I have some difficulty between the teaching of Jesus and some theology of Paul. That is why I quote NT but not the Gospels.\n\n","date":"June 14, 2015 at 4:25 pm","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","id":"comment-202080","author":"Sampath Fernando","site":"shroudstory"},{"title":"Also Because of the Shroud of Turin","post":"Matthew actually directed his gospel to the Jewish Christians, that is why this particular gospel was used by Jacob Neusner to write his book on Jesus and to reject the Judaeo-Christian tradition in favour of two different traditions. When it comes to studies, R.A. Burridge has correctly demonstrated that the gospels should be classified as Graeco-Roman biographies, as contemporary biographies, written within living memory of their subject. The form critics, with their “Sitz im Liben” are not supported by our general knowledge of oral tradition and are generaly rejected by the best scholars.\nThere are many ways to interpret the gospels, the historical-critical being the most promising, when used with other methods:\n   https://www.academia.edu/12850351/Book_Review_The_Interpretation_of_Scripture_In_Defence_of_the_Historical-Critical_Method\nIt has been and criticised and defended:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nMike Stechschulte (above) mentions incorruption as one of the things that help him maintain his Catholic faith. The issue is being studied by the Church. There is true and false incorruption. False incorruption can be due to bodies that are hermetically sealed but begin to decay the instant the coffins are opened, others because the bodies were dried in the sun after being preserved in fat, also due to things like mummification, embalming, freezing, saponification. There are also bodies that have been buried in sand or dried by the bacteria “Hifa Pombicina Pers”, others affected by lighning, radioactivity etc. Other factors that have to be taken into consideration are those found in lands with deposits of calcium, climate and so on.\nThere are around 500 bodies in varying states of incorruption in Catholic environments. Francis Xavier’s body is in a cardboard-like state, still preserved in Goa. The best examples of incorruption are: Philip Neri, Isabel, Queen of Portugal, Bernard of Sienna, Carlo Borromeo, Raymond Penaforte, Teresa of Jesus and Bernadette Sobirous (Lourdes).\n\n","date":"June 14, 2015 at 6:19 pm","url":"https://shroudstory.com/2015/06/13/also-because-of-the-shroud-of-turin/","cat":"press_coverage","id":"comment-202130","author":"Louis","site":"shroudstory"}]
