[{"title":"Correcting an article about the Shroud of Turin","post":"“But ignorance loves ignorance just as money loves money”…How true and well said, and I must agree with most all of Annette’s rebuttal….One wonders though how all these sceptics of the Shroud can be so ignorant of the facts, do they not read? Do they not research the topic at hand, fully? and if they do, why are they so blind to the truth? …It’s a mystery too me, more so then the Shroud can ever be.\nR\n\n","date":"January 22, 2012 at 7:43 am","url":"https://shroudstory.com/2012/01/22/correcting-an-article-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-7322","author":"Ron","site":"shroudstory"},{"title":"Correcting an article about the Shroud of Turin","post":"It may be that they arrived at the answer they had striven for.\n\n","date":"January 22, 2012 at 2:43 pm","url":"https://shroudstory.com/2012/01/22/correcting-an-article-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-7371","author":"Chris","site":"shroudstory"},{"title":"Correcting an article about the Shroud of Turin","post":">It concludes:\n>\n>Perhaps one day the Father will exact an answer from many to this question: “How is it that you tried to shroud the glorified One in a medieval cloth? (26). (emphasis mine)\nThe point is that we who believe in the authenticity of the Shroud are merely accepting the evidence that God the Father has provided us.\nEspecially evangelical Protestant Christians like me, who believe in the Reformation doctrine of Sola Scriptura (the Bible alone), and have an inherent distrust of Roman Catholic relics, have every reason to reject the Shroud. \nThe only reason I came to accept the authenticity of the Shroud is that in 2005, after nearly 40 years a Christian, and to the extent I thought about the Shroud at all, I assumed it was just another fake medieval relic, I became aware of the evidence for its authenticity in Stevenson & Habermas’ book, Verdict on the Shroud (1981), that I bought for $3.00 in a second-hand bookstore. I only bought the book because: 1) it was co-authored by evangelical theologian Gary Habermas whose writings I was familiar with as sound and evidence-based; and 2) it cost only $3.00.\nI note that Anderson has a PhD Philosophy of Evolutionary Biology. He should then appreciate that if the Shroud is a fake, yet God has allowed it to come into existence, complete with all the evidence for its authenticity, then God would be a “cosmic deceiver.” \nAnd then Anderson could not logically reject the extreme Young-Earth Creationist “Appearance of Age” argument that God allowed the Universe to come into existence, complete with a fake history of it being billions of years old, when in reality it is only tens of thousands of years old.\n\n","date":"January 22, 2012 at 10:04 am","url":"https://shroudstory.com/2012/01/22/correcting-an-article-about-the-shroud-of-turin/","cat":"news_&_views","id":"comment-7332","author":"Stephen E. Jones","site":"shroudstory"}]
