[{"title":"Daily Beast Review of CNN’s Shroud of Turin Episode","post":"Absolutely incredible that the CNN program did not mention the follow:\n-Raymond Rogers, an atheist,  and his independent research – now deceased, Rogers was one of the scientists involved in the carbon-dating tests of which the results were published in 1988 saying the Shroud dates back tom the 14th century. At the behest of someone who contacted Rogers and asked him to take another look: Here’s what he found:\n   -The sample provided for the carbon-dating test was taken from a patch sewn into the cloth in the 14th century following a fire which damaged it.\n  -A cloth purported to be the Shroud was kept in Jerusalem, Edessa and finally in Constantinople from the time of the death of Christ until it was taken  from Constantinople by Crusaders.\n  -Christos Pantokratur – a Byzantine painting that goes back to the 5th century. Rogers overlaid the head on the Shroud onto this painting and clearly demonstrates that it’s the same person – exact forehead, nose, chin, hair-line, size, etc. Rogers concludes that the early Christians were familiar wit the Shroud,  although not many had access to it due to the fear that enemies of Christianity would destroy it, and that the face on the Shroud was used as a model for early Christian artists. Just take a look at some of the ancient art depicting Christ. It’s the same face as on the Shroud. I saw it for myself in a church in Greece that goes back 1,500 years.\nRogers concluded that the Shroud is the burial cloth of Christ.\nAnother item missed – an Israel scientist found pollen on the Shroud from plants growing only in Jerusalem which pollinate only in the Spring. Christ was crucified in the Spring. There is also pollen from plants found only in Edessa and Constantinople. How, in God’s name, would a forger from 14th century Europe even think about getting pollen from Jerusalem? It’s invisible to the naked eye!\nThere is also residue on the Shroud where the knees made contact containing dust and particles from dirt and stone found only in  Jerusalem.\nOn a final note, getting back to Rogers, he does not know how the image got on the Shroud (and neither does anyone else), but he did add that it would have had to appear within the first 4 or 5 days of death, because at the time liquids would begin to ooze from the body creating an unrecognizable mess, not a clear, concise, detailed image that we have.\n\n","date":"March 2, 2015 at 1:11 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","id":"comment-192209","author":"leon ward","site":"shroudstory"},{"title":"Daily Beast Review of CNN’s Shroud of Turin Episode","post":"Leon, some of the points you mention are assumptions and not established facts (such as the pollen). If you spend some time reviewing this blog you’ll find that much that we have assumed to be true about the Shroud are in fact theories and not facts substantiated by clear evidence.\n\n","date":"March 2, 2015 at 1:41 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","id":"comment-192213","author":"David Goulet","site":"shroudstory"},{"title":"Daily Beast Review of CNN’s Shroud of Turin Episode","post":"“some of the points you mention are assumptions and not established facts (such as the pollen)”\nThe skeptics are now saying that the piece of cloth does not have any pollen? How is that so?\n\n","date":"March 2, 2015 at 7:46 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","id":"comment-192250","author":"El Gayo","site":"shroudstory"},{"title":"Daily Beast Review of CNN’s Shroud of Turin Episode","post":"There is pollen on the linen, but there is contention on what kinds of pollen and how they might have gotten there.\n\n","date":"March 3, 2015 at 4:51 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","id":"comment-192318","author":"David Goulet","site":"shroudstory"},{"title":"Daily Beast Review of CNN’s Shroud of Turin Episode","post":"Sadly this was just another media event to sensationalize a story, by omitting the scientific peer reviewed facts, in order to have a perpetual money making show.\nL.J.\n\n","date":"March 2, 2015 at 2:55 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","id":"comment-192222","author":"L.J. Williams","site":"shroudstory"},{"title":"Daily Beast Review of CNN’s Shroud of Turin Episode","post":"Let’s try to avoid cross-commenting. It frustrates others.\n\n","date":"March 2, 2015 at 3:49 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","id":"comment-192226","author":"Dan","site":"shroudstory"},{"title":"Daily Beast Review of CNN’s Shroud of Turin Episode","post":"Leon, from where did you get the information that Ray Rogers was an atheist?\n\n","date":"March 2, 2015 at 7:07 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","id":"comment-192245","author":"Louis","site":"shroudstory"},{"title":"Daily Beast Review of CNN’s Shroud of Turin Episode","post":"Another review:\nhttp://www.huffingtonpost.com/paul-n-anderson/i-didnt-know-jesus-was-lo_b_6781650.html\n\n","date":"March 3, 2015 at 4:41 pm","url":"https://shroudstory.com/2015/03/02/daily-beast-review-of-cnns-shroud-of-turin-episode/","cat":"press_coverage","id":"comment-192316","author":"Louis","site":"shroudstory"}]
