[{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"For the record, none of the above refers to Charles’ ‘History Today’ article. Not a word. the criticism is of his 2012 article ‘The Shroud of Turin and the Image of Edessa: A Misguided Journey.’\n\n","date":"October 28, 2014 at 7:40 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166164","author":"Hugh Farey","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"I’m quite surprised that neither Dan S. nor Dan P. noticed this. Sufficiently surprised to want to inquire whether either of them have actually read Charles’s article. Tut tut…\n\n","date":"October 28, 2014 at 7:48 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166167","author":"Hugh Farey","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"I should not be editing at 4:00 am. \n\n","date":"October 28, 2014 at 7:59 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166171","author":"Dan","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"This is not a commentary on my History Today article but a completely different article i wrote some time ago!  The History Today article is online but regrettably without the full set of illustrations that show how the blood stains on the Shroud echo those of the fourteenth century iconography – on the Holkham Bible Christ for instance. To see the illustrations you have to buy the print version and it may not be easily available outside the UK. it was apparently too expensive to get picture rights to show them online throughout the world.\n    I am not suggesting in my History Today article that the Shroud of Turin was a run of the mill relic. Bearing in mind that the only information anyone would have had on the burial cloth of Jesus is what they would have read in the gospels (lintemina, sudarium), no medieval forger would ever have produced single cloth with images on it and hoped to have deceived anyone at all. No, it was clearly produced for some other purpose and I suggest that the Easter Quem Queritis  ceremony is the most likely original context for it. So far the experts on medieval drama at Cambridge I have consulted think i may well be right  but I am getting them to ask around other specialists. It is as this specialist level that my article will stand or fall, not on the Shroud Story website.\nThe grant of an indulgence by Clement VII suggests that the cloth became associated with miracles. We have hundreds of recorded examples of artefacts that were clearly not relics,and no one believed them to be, but which still had spiritual significance. My own guess is that Jeanne de Charny (an Italian professor has been in touch already to say I should actually refer to her as Jeanne de Vergy) was responsible for converting what was an object of spiritual status into a relic. She was quickly slapped down and to avoid any ‘fraud’ her son was told he could not expose it again without  explicitly saying that it was NOT the real thing. The Dukes of Savoy were able to get away with it more easily.\nI think it is exciting that we have what appears to be the only surviving example of a cloth associated with the most joyous ceremonies of all, those held at Easter, and I am completely perplexed by those who appear to be arguing that there is anything anti-Christian in my approach!\nStill, most of my discussions are with academics in the fields covered because, at the risk of repeating myself, it will be here that the issue will be decided. The feedback so far has been very positive. ‘Game,set and match’ was the response to me of one Oxford Professor of church history.\n\n","date":"October 28, 2014 at 7:59 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166170","author":"Charles Freeman","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"I know. Ill be pulling it. \n\n","date":"October 28, 2014 at 8:00 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166172","author":"Dan","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Dan, go slow. People are forgetting the sermon by archdeacon Gregory in Constantinople found by Gino Zaninotto in the Vatican Archives.\n\n","date":"October 28, 2014 at 2:27 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166258","author":"Louis","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"The sermon was not found by Gino Zaninotto in the Vatican Archives. This is a sindonological legend\n\n","date":"October 28, 2014 at 5:48 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166305","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Can you explain further? It would be helpful.\n\n","date":"October 28, 2014 at 6:03 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166311","author":"Louis","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"The Sermon of Gregory and its position in the Vatican Library (not Vatican “archives”) was well known and published in the catalogue of manuscript since the beginnning of XX century. Von Dobschuetz wrote something about it in 1899 and 1905. So nothing was “discovered” after, by anyone. Simply Zaninotto, who lives in Rome, saw the codex (or he bought a copy of it), asked someone to transcript it and translated/was helped in translating some parts. After, Pier Angelo Gramaglia made a transcription more accurate of some parts. At the end, Dubarle asked Paramelle to make a transcription of all the manuscript, and published it.\nI explain all, and also the text contained in the manuscript, in my book “From the Mandylion of Edessa to the Turin Shroud”, pages 43-66.\n\n","date":"October 28, 2014 at 6:15 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166314","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Yes, I remember that now. Can you tell me how you interpret the sermon in a few words?\n\n","date":"October 28, 2014 at 6:19 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166315","author":"Louis","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"In a few words? i think it is impossible…. but if your question is “Do you believe that the Sermon of Gregory Referendarius could be used to prove the identity between shroud and Mandylion, in any part?”, the answer is obviously not, as all scholars (except some sindonologist) do know, and as the reading of ALL treatise demonstrates without doubt.\n\n","date":"October 28, 2014 at 6:25 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166317","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"I read the sermon somewhere some years ago and will try to find it and get back to you.\n\n","date":"October 28, 2014 at 6:35 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166324","author":"Louis","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"I just want to reply to the statement “He has simply ignored Ian’s great arguments.”\nIan’s great arguments have left aside a lot of FACTS, which does not fit at all with his preconcieve idea.  The most obvious and important is this: From the Acts of Thaddeus, the very text in which we found the “tetradiplon” word (6th Century), up until the 12th Century (including Robert de Clari’s eyewitness testimony), there are numerous texts that make a clear distinction between the Image of Edessa (or Mandylion) and the burial cloth(s) of Christ and I’m not aware of any ancient text (not one!) that refers to the Image of Edessa (or Mandylion) as being a burial cloth that would have been used for Jesus entombment. \nAnd if this isn’t enough for you, I suggest you to read once again my paper about this topic: https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf\nI also suggest you to read carefully the long personal note I have written concerning quote #70 of my paper about Rogers’ work: http://www.holyshroudguild.org/uploads/2/7/1/7/2717873/2014-06-29-yannick-clement-reflections-on-ray-rogers-shroud-work.pdf\nMake no mistake about it: I would like the Mandylion to be the Shroud folded in 8, because that would answer a lot of questions concerning the Shroud’s obscure past, but in face of all the known data available for anyone’s interested by the topic, I simply cannot accept such a wrong hypothesis.  \nAnd here’s what I said in another place: I want to conclude this comment by saying that, nevertheless, to me, and based on the surviving copies of the Mandylion, I think that this false relic (which was certainly a painted portrait of the face of the living Christ) that appeared sometimes during the Fifth Century A.D. in Edessa (and which was considered and presented as a painted portrait of the face of the living Christ back then) is another interesting piece of evidence, along with the Pantocrator icons (which started to appear at the very beginning of the Sixth Century A.D.), to think that, at that time (probably during the second half of the Fifth Century A.D.), there were at least some members of the Byzantine Church who were aware of the presence in the Middle East of a Shroud of Christ bearing his body image, which leads them to produce some religious artworks of the face of the living Christ based on the facial image of that Shroud (like the Mandylion, the Pantocrator icons and most probably some others artworks like the Image of Kamouliana) in order to consolidate their power over the crowds and also to help them to fight against what they considered to be heretical movements in that region (which were numerous and flourishing at that time). \nWhen I say this, there are always some skeptics (mostly partisans of Wilson’s ludicrous ideas) to ask me why then there is no artworks from that period showing a bloody and beaten Christ like we see on the Shroud if that Shroud was at the origin of all these religious artworks. My answer is always the same : it’s simply due to the fact that, at that time and in that part of the world, it would have been a total scandal for the crowds to venerate that kind of suffering Christ… Effectively, it is a known historical fact that the first depictions of a suffering Christ only appeared many centuries after that time, at a moment in history when these kinds of artworks had become slowly « acceptable » for the Christians. That’s probably the main reason why there is no solid testimony of any public exhibition of a body image of Christ that would have been present on his burial shroud prior to the one given by Robert de Clari who, in 1203 in Constantinople (some months before the sack of the city), saw with his own eyes not only this particular Shroud, but also the body image that was on it in a public exhibition done at the Church of Our Lady of Blachernes. De Clari said that this Shroud was shown there every Friday (most probably in reference to Holy Friday) in that Church. Personally, I would not be surprise at all if that weekly public exhibition of that particular Shroud was the very first one in history. If that’s true, this would help understanding why there are no ancient sources that makes a direct and clear reference to the presence of a Shroud of Christ bearing a body image and/or bloodstains on it prior to the testimony of Robert de Clari… The inner part of the Shroud of Turin (which shows his body image and bloodstains that are much more evident) would simply haven’t been publicly showed before that era, which was a time of great trouble in Constantinople, with the Latin crusaders surrounding and threatening the imperial city. It’s interesting to note that it’s also around that time that we see appearing the first known depictions of a suffering Christ like, for example, the Man of Sorrows or the epitaphios icons.\nOf course, this last statement of mine is a simple assumption, but an assumption based on solid historical facts (i.e. the fact that, prior to Robert de Clari’s testimony, there is absolutely none who talks specifically of a Shroud of Christ bearing a body image and/or bloodstains on it, along with the fact that this is around that same time that we see appearing some artworks showing a suffering Christ). Because of this, that kind of assumption is not what we can call « wild » assumption, on the contrary to a bunch of others that we find in the « Tomb of Christ » documentary or many others that have been made in recent years in order to make believe the Shroud was present in some particular cities of the Middle East (like Antioch for example) or that it was truly the Mandylion folded in 8 parts… These are assumptions that do not rest on serious archaeological findings or serious ancient testimonies, but much more on the wild imagination of those who publicly propose them. Taking this into account, it’s not at all surprising to note that none of these proposals have been accepted by the vast majority of the international scientific community…\n\n","date":"October 28, 2014 at 10:47 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166205","author":"Yannick Clément","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"There is guesswork going on here. Jeanne de Vergy was the great-great-great- grand daughter of Otho de la Roche, who had been with the Fourth Crusade, acquiring the lordship of Athens in 1205. The link does say something.\nIt makes no sense why the di Savoia family had to hide a fake for a hundred years.\n https://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\n\n","date":"October 28, 2014 at 10:49 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166207","author":"Louis","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Scavone: «[…] it is firmly documented as coming from Constantinople to Besancon to Geoffroy de Charny».\nFirmly documented????  Simply RIDICULOUS\n\n","date":"October 28, 2014 at 5:47 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166304","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"My goodness! For once I agree with Nicolotti: the Besancon connexion is not ‘firmly documented’. Irrespective of the late 14th c. CE painted copy of the original Besancon Shroud, can  Daniel really demonstrate the original Besancon Shroud kept in the Cathedral was the Constantinople Shroud and NOT a copy?  He just cannot. One must be very cautious here.\n\n","date":"October 28, 2014 at 6:00 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166310","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"But I do not agree with you, Max. On XIII and XVI or XV century no Shroud existed in Besançon. So the problem is not how the Scavone’s hypothesis is reliable or proved, but how can exixt such hypothesis.\n\n","date":"October 29, 2014 at 1:38 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166613","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"XIII, XIV, and XV\n\n","date":"October 29, 2014 at 1:39 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166614","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"On XIII and XVI or XV century no Shroud existed in Besançon.\nCan you be sure of that?\n\n","date":"October 29, 2014 at 5:40 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166685","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Better explained: the shroud with the image in Besançon did not exit on XIII, XIV, and XV century. A white linen for the rite of the “Quem quaeritis” was present there in the middle age, as in many other churches.\n\n","date":"October 31, 2014 at 1:44 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167293","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"In a few words? i think it is impossible…. but if your question is “Do you believe that the Sermon of Gregory Referendarius could be used to prove the identity between shroud and Mandylion, in any part?”, the answer is obviously not, as all scholars (except some sindonologist) do know, and as the reading of ALL treatise demonstrates without doubt.\nTo the point, Andrea.\nCan you deny that Sermon is authentic?\n\n","date":"October 28, 2014 at 6:29 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166319","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"I guess that this starting conversation between you and I will finish in nothing….  :-)\n\n","date":"October 28, 2014 at 6:39 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166326","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"I guess that this starting conversation between you and I will finish in nothing…. :-) \nYou have already finished with nothing, why do you run away Andrea? I just before asked you a simple question; can you deny authenticity of the Sermon?\n\n","date":"October 28, 2014 at 6:44 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166329","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"It is not question of “running away”. Only I know how conversation with you always finish. Your question is simple, yes. I do not deny anything. Why I have to “deny” authenticity of the Sermon?\n\n","date":"October 28, 2014 at 6:59 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166333","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Louis:\nI read the sermon somewhere some years ago and will try to find it and get back to you.\nhttp://www.shroud.com/pdfs/guscin3.pdf\n\n","date":"October 28, 2014 at 6:39 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166325","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"I do not like this translation….. Anyway, if you wanto to read Guscin you must add also http://www.shroud.com/pdfs/guscin3a.pdf\n\n","date":"October 28, 2014 at 6:45 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166330","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Thanks Andrea and O.K.\nAndrea, do you know at which point this sermon was delivered? I don’t have the material at hand now.\n\n","date":"October 28, 2014 at 7:00 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166334","author":"Louis","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"the sermon was delivered on the evening of August 16, 944, at the imperial palace, perhaps yes, perhaps not\n\n","date":"October 28, 2014 at 7:07 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166337","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Thanks. Assuming that the Image of Edessa and the Shroud are one and the same object it is possible that Gregory delivered the sermon before the relic was “unfolded”. Robert de Clari is more clear.\n\n","date":"October 28, 2014 at 7:19 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166341","author":"Louis","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"We cannot assume anything without proofs. That the mandylion is a shroud folded is an invention of Mr. Wilson in the XX century, not a conclusion taken form the texts. So, as historian, I cannot discuss about fantasies and conjectures. The mandylion is a a towel used to paint the face of Jesus, or to clean the face of Jesus sweating or blooding, this says all tradition (obviously, is a legend). Stop. Robert de Clary is not more clear, because in any part he says that the mandylion is something different.\n\n","date":"October 28, 2014 at 8:03 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166353","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"I wouldn’t call it an invention of Wilson; he has always admitted that there are gaps in the hypothesis. Knight Robert de Clari of Picardy referred to the cloth “where the body of our Lord was wrapped”.\nObjection can then be raised to say that it is only one source. God knows how many documents were lost during the sack of Constantinople. What did those uncouth ruffians, those mercenaries care about? Stealing relics and the payment by the Doge of Venice. \nSome of the documents looted by Napoleon from the Vatican Archives are said to have fallen on the roadside in France when carts were broken and found their way to shops where the owners used these precious papers to wrap their goods.\nWilson does mention one tell-tale sign: A completely new image of Christ appeared on the bezants after year 944. Elongated nose, the angle of the eyebrows etc., just as they are seen on the Shroud.\n\n","date":"October 28, 2014 at 8:58 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166364","author":"Louis","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Andrea, I thought you would comment further. I have not read your book and am involved in some research trying to get rid of at least one gap to establish an Image of Edessa/Turin Shroud link\n\n","date":"October 29, 2014 at 5:17 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166680","author":"Louis","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Your question is simple, yes. I do not deny anything. Why I have to “deny” authenticity of the Sermon?\nFine, that was just the first step.\nNext:\nDo you deny that the translation of the fragment  of  #9 “But Jesus, undergoing the passion of his own free will, believing that human nature fears death – indeed death comes upon the very nature that was made to live – taking this linen cloth he wiped the sweat that was falling down his face like drops of blood in his agony. And miraculously, just as he made everything from nothing in his divine strength, he imprinted the reflection11 of his form on the linen.” is reliable, in patricular references about “the sweat” and “drops of blood”?\n\n","date":"October 28, 2014 at 7:04 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166336","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"so?\n\n","date":"October 28, 2014 at 7:14 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166339","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"So do you answer, or not?\n\n","date":"October 28, 2014 at 7:16 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166340","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Please, go on. I am not here to answer a series of questions like in a tribunal. Say what you want to say without questions or “steps”.\n\n","date":"October 28, 2014 at 7:21 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166342","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Please, go on. I am not here to answer a series of questions like in a tribunal. Say what you want to say without questions or “steps”.\nDon’t hurry, Andrea, instead just answer my simple questions. We are going into deductive reasoning.\n\n","date":"October 28, 2014 at 7:25 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166343","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"I am going to sleep, continuation tomorrow.\n\n","date":"October 28, 2014 at 7:53 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166349","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Message to O.K. : focussing on that kind of religious sermon (which was obviously full of theological imageries instead of being a close physical description of the relic), while putting aside all the very solid pieces of evidence showing that the Mandylion was not a burial cloth used during the emtombment of Jesus is the same bad way to analyze a subject than focussing only on the highly questionable C14 dating of 88, while leaving aside all the good pieces of evidence showing that the Shroud is a real burial cloth of a real crucified man looking like Christ of the Gospels…\n\n","date":"October 29, 2014 at 1:02 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-166601","author":"Yannick Clément","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Better explained: the shroud with the image in Besançon did not exit on XIII, XIV, and XV century. A white linen for the rite of the “Quem quaeritis” was present there in the middle age, as in many other churches. \nAndrea, can you be sure of that? The lack of documentation (presumably lost during fire in 1349 and in other accidents) does not prove non-existence of the Besancon Shroud in 13th-15th century. Absence of evidence is not evidence of absence.\nhttp://www.acheiropoietos.info/proceedings/PianaMYHSWeb.pdf\nAs you presumably know, Andrea, in the Ray-sur-Saône, castle of de la Roche family, there is a casket, in which, according to the local tradition, the Shroud of Besancon was brought there in the 13th century by Otto de la Roche. This may signify material evidence for the claim. What about that, Andrea?\n\n","date":"October 31, 2014 at 2:01 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167307","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"O.K. Your last paragraph is exactly what I told C. Freeman, that is, to remind him of the family link between Jeanne de Vergy and Otho de la Roche. The casket is indeed material evidence.\n\n","date":"October 31, 2014 at 2:18 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167319","author":"Louis","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"P.S. The family link between Jeanne de Vergy and Otho de la Roche is false. (my book “I templari e la sindone”, p. 120 ss.)\n\n","date":"October 31, 2014 at 2:25 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167324","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Do you claim that Jeanne was not descendant of Otho?\n\n","date":"October 31, 2014 at 2:36 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167330","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Yes, I am sure. We know that the Besançon shroud was made on 1523 or some years before. We have medieval documents and they were not distroyed on the fire (forgers like fires, they use them to justify their forgeries). Piana-Scavone theories are funny: they use false legends created on XVIII century to explain presumed facts occurred on middle age. “Local tradition” means nothing: it was also a “local tradition” that in my town sleeped Napoleon, but it is false. The story of Othon de la Roche was a lie invented on XVIII century. This is well known. Obviously, they fabricated also false “material evidence”, this is normal. So, yes, I am sure.\n(P.S.  Absence of evidence is not evidence of absence: it is true, but only sometimes. But is ALWAYS true that you must demonstrate that something existed, if you think that it exixted, and not asking me to demonstrate that somethng did not exist).\n\n","date":"October 31, 2014 at 2:19 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167321","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"We know that the Besançon shroud was made on 1523 or some years before. We have medieval documents and they were not distroyed on the fire (forgers like fires, they use them to justify their forgeries).\nIs there in those documents specified exactly that the Shroud of Besançon was made in 1523 or shortly before? Or do they are just the earliest mention in the surviving documents, without giving information when and where exactly the Shroud of Besançon was made?\nThat’s key detail here.\nThe story of Othon de la Roche was a lie invented on XVIII century. This is well known.\nBy whom?\nObviously, they fabricated also false “material evidence”, this is normal.\nDo you have any evidence to back this claim?\nAbsence of evidence is not evidence of absence: it is true, but only sometimes. But is ALWAYS true that you must demonstrate that something existed, if you think that it exixted, and not asking me to demonstrate that somethng did not exist\nSo far, on this stage, we do not want to establish whether something (the so called ‘Shroud of Besancon’ in the 13th century) existed or not for certain. So far we are interested only whether it might have existed.\n\n","date":"October 31, 2014 at 2:34 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167327","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"O.K, the first study of this question was Paul Vignon 100 years ago. After, you can read the article of Zaccone printed in the acts of the the Congress of sindonology of Nice (1997, I guess). In the fututre I’ll publish something more accurate, but this is enough. So, go on. I cannot make here all the history. I use this blog only for short suggestions, it is not the place to write articles. For Jeanne and Otho, the same. I explain all in my book.\n\n","date":"October 31, 2014 at 2:42 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167334","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Andrea, I don’t have your book, all I have are short excerpts you released + Emanuella Marinelli’s review. I just asked a simple question, were they (Jeanne and Otho) related or not. Truly, it is irrelevant to me as I don’t believe the Shroud (of Turin) simply passed throught the way of inheritance from Otho to Jeanne, but I am just checking whether or not you are trying to play some misleading ‘games’ with me. You voiced several categorical statements, but your argumentation has been totally unconvincing so far.\n\n","date":"October 31, 2014 at 2:55 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167340","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"BTW, I have Zaccone’s book (La Sindone – Storia di un’immagine, in polish edition of course), and although Zaccone does not favor Besançon hypothesis, he does not exclude it completely. Nor Vignon arguments in his 1902 book (see http://www.holyshroudguild.org/weuenshel-collection-provided-by-google.html pg 61-76) exclude the possibility that the Shroud of Besançon (whatever it was) existed in the 13th century. And i think the relation between the two (the Shroud of Turin and of Besançon are a little bit more complex than most researchers assume.\n\n","date":"October 31, 2014 at 3:33 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167358","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"OK, I try to be more clear. I do several categorical statements, yes. I seem sometimes insufferable, perhaps. But understand me: I do not want to argumentate here, because a blog is not a a place to make serious history with documents and argumentations. It is a place to spend time, make simple discussion, know people, and share informations. I share informations. I have not time, possibility and desire to explain here the results of my researches. History is a serious work, difficult an complicated, and needs the correct place and the correct way to be explained. So often I make fast statements, only because I know that some people could be interested in knowing what I have to say. If someone wants to go deeper, he must read my books or articles, and study himself. So, for me, my statements are a little help for the readers that know me, and that know that I work seriously and professionaly,… and that I do not invent or manipulate sources. \nVignon: his second book, not the first.\nZaccone: the article on Besançon, not the book.\nJeanne: no games, she is not descendant of Otho.\n\n","date":"October 31, 2014 at 7:32 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167397","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Wilson, Bantam Press 2010, Fig 31 De Charnay Family Tree, includes direct line from Othon de la Roche to Jeanne de Vergy:\nOthon m. Elizabeth de Ray –> Otho II de Ray m. Etienne de la Roch St H. –> Elizabeth de Ray m. Henri de Vergy –> Jean I de Vergy –> Guillaume de Vergy m. Agnes de Durnay –> Jeanne de Vergy (+ 2 other daughters).  \nScavone makes a plausible case for Othon sending Shroud from Athens to Besancon;\n“BESANÇON AND OTHER HYPOTHESES FOR THE MISSING YEARS: THE SHROUD FROM 1200 TO 1400”  Ohio conference 2008;\nhttp://ohioshroudconference.com/papers.htm\nBesancon in Burgundy, likely to be taken by Empire with Roman Pope sympathies, De Charnay & De Vergy favoured French Avignon anti-pope, Postulated that Othon put Shroud in care of Pons de Chaponay for disptach to Bensancon.  Fire at St Stephen’s church 1349 disclosed loss of Shroud and any records pertaining to it.  Scavone speculates that Shroud actually rescued by Jeanne de Vergy for France, and replaced it with copy, the true subject of the D’Arcis accusation.  In 1624, Chifflet wrote that Shroud was miraculously discovered in a niche of new cathedral in 1377.  Vignon wrote that Besancon Shroud was clearly a replica of the original (apparently ventral image only).  Curiously Besancon Shroud so happened to be certified by a miracle attested to by archbishop with De Vergy family connection(??!!) – Archbishop Guilllaume III de Vergy (1371-91) (family cover-up(?).\nIt seems that Besancon Shroud was used in an Easter liturgy there, which may have been the Quem queritis ceremony referred to by Charles Freeman.\nScavone seems to deal with most objections to this scenario.\n\n","date":"November 1, 2014 at 4:30 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167551","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"1) The genealogical tree of Wilson is wrong. Henry de Vergy was not wife of Élisabeth de Ray.\n2) All the list of Scavone’s speculations and conjectures (=inventions) needs only an answer: where are the sources that associate Othon de la Roche with a Shroud?\n\n","date":"November 1, 2014 at 12:45 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167669","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"husband\n\n","date":"November 1, 2014 at 12:46 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167670","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"1) The genealogical tree of Wilson is wrong. Henry de Vergy was not wife of Élisabeth de Ray.\nSo  who was wife od Henry de Vergy? Or other way: whose wife was Élisabeth de Ray? Can you give us precise answer to those issues?\nPiana (http://www.acheiropoietos.info/proceedings/PianaMYHSWeb.pdf ) has similar genealogy to that of Wilson. Assuming they are both wrong, and you are right, Andrea, where has the mistake originated?\nwhere are the sources that associate Othon de la Roche with a Shroud?\nThose 18th century sources, which you labelled as “lies” without giving evidence of their falsehood. Plus tradition about the coffer in Ray-sur-Saône castle. Plus 1205 letter of Theodore Angelus to the Pope Innocent III. I leave aside Nicholas Otranto as it is too ambiguous, although it may (or may not) be connected.\n\n","date":"November 1, 2014 at 2:21 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167705","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":">>>>So who was wife of Henry de Vergy? \nÉlisabeth de Chalon\n>>>>Piana has similar genealogy to that of Wilson\nPiana is a biologist\n<<<<<>>>Those 18th century sources, \nSource (one), not “sources”. And you call “source” an anonymous treatise of the 18th century, written to defend the authenticity of the Besançon Shroud (that was false, all know), telling something about what happened on 1204, based on falsificated sources? And the historians before, who NEVER associated Othon with the Shroud? Nobody remembered? Oskar, please, could you start to use a historical-critical mehod? We adopted it two century ago.\n>>>>which you labelled as “lies” without giving evidence of their falsehood<<>>>>>Plus 1205 letter of Theodore Angelus to the Pope Innocent III.\nAnother forgery.\n= 0\n\n","date":"November 1, 2014 at 2:34 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167709","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"I note that there are two women named Elizabeth de Ray in Wilson’s Fig 33:  (1) the wife of Othon de la Roche) (2) his grand-daughter who he says married Henri de Vergy.\n\n","date":"November 1, 2014 at 2:41 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167710","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":">>>>So who was wife of Henry de Vergy?\nÉlisabeth de Chalon\nWas his sole wife, or had he additional marriages, (with Élisabeth de Ray perhaps)?\n\n","date":"November 1, 2014 at 2:48 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167712","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"<<<<<Was his sole wife, or had he additional marriages\nToo simple escamotage. But impossible, in this case\n<<<<<<<<it is a source -not the best quality, but a source\nYour traitment of later, disinformated and forged sources is not compatible with the historical-critical method.  \n<<<<<<Can you tell me who faked this\nno. Maybe I'll discover, maybe not. Surely, a member of the siciilian false noble family De Angelis.\n<<<<<<<<when was it faked (century)\nprobably from xvi to xix\n<<<<<Do you consider Benedetto D’Acquisto 19th century transcript as authentic?\nBenedetto D’Acquisto did not transcript anything. Only signed.\n<<<<<<Frale considers it authentic\nYou consider Frale a reliable historian?\n<<<<<and found no evidence\nYou do not found never evidences of forgeries if they are against the Shroud…   :-)\nBut now I told you many things and many informations (false source, wrong marriage, false chartularium). Go forward!\nThis is the first step (according to the method): read all your 18th century \"source\" about Othon, and found proofs of reliability. Second step: compare it with the earlier sources about the history of the Shroud in Besançon. Third step: look for historical mentions of the shroud of Besançon in the sources in the city (we have them) from 1204 to 1523. Best wishes!!!\n\n","date":"November 1, 2014 at 3:09 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167717","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"could you start to use a historical-critical mehod?\nWe are just begining.\nSource (one), not “sources”. And you call “source” an anonymous treatise of the 18th century, written to defend the authenticity of the Besançon Shroud (that was false, all know), telling something about what happened on 1204, based on falsificated sources?\nThanks for reminding this. No matter, it is a source -not the best quality, but a source. And there is still a chance that the claim that Otho once possesed the Shroud might have been true, no matter the silence of earlier historians.\n>>>>Plus 1205 letter of Theodore Angelus to the Pope Innocent III.\nAnother forgery.\nNot so fast. Two issues here.\n1.) Can you tell me who faked this, or at least when was it faked (century)? Do you consider Benedetto D’Acquisto 19th century transcript as authentic?\n2.) Can you prove without doubt that this particular fragment is a forgery. Frale considers it authentic, Zaccone also although with later interpolations. Yes, I have read your paper http://www.giornaledistoria.net/public/file/Content20121006_GdSNicolottiChartulariumCulisanense.pdf and found no evidence beyond doubt that this particular letter (the rest of Chartularium Culisanense does not interest me) is a forgery.\n\n","date":"November 1, 2014 at 2:46 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167711","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Your traitment of later, disinformated and forged sources is not compatible with the historical-critical method. \nThe better. One method does not apply everywhere.\nYou consider Frale a reliable historian?\nNo. Neither you, Wilson, Scavone, Zaccone, Freeman or vast majority of historians. Most of them are unreliable at some point. I even don’t consider myself reliable sometimes.\nYou do not found never evidences of forgeries if they are against the Shroud… \nNor evidence for the existence of the Shroud prior to the 14th century is the evidence in the eyes of sceptic ;-)\n//serious things start here\nprobably from xvi to xix\nFine, that’s what I wanted.\nSo, Andrea you claim that someone from de Angelis family between 16th and 19th century faked a 1205 letter of Theodore Angelus to the Pope Innocent III, with all the information  crucial to us about linteum quo post mortem et ante Resurrectionem noster Dominus J. C. involutus Est [..]  in Athenis and delliberately placed it in some forgotten Chartularium Culisanense. There is one key question I would like you to answer Andrea; FOR WHAT THE PURPOSE?\n\n","date":"November 1, 2014 at 3:22 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167719","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"<<<<<<So, Andrea you claim that someone from de Angelis family \nyes, the false, lying, pseudo-byzantine De Angelis Family. it is better to remember it.\n<<<<<>>>>> and delliberately placed it in some forgotten Chartularium Culisanense. \nAll the Chartularium Culisanense, obviously, is a forgery.\n>>>>>>There is one key question I would like you to answer Andrea; FOR WHAT THE PURPOSE?\nAll fake-Chartulariums are falsificated to give importance to a family or institution that has no importance and wants to have it. So the forger of the cartulary created a fake diploma of Constantine XI, with a false genealogy of his family; and then, to make believe that his family had in the past important relics, made a false dowry which contained the stones of the home of Our Lady of Loreto, a false report of translation of the relics of the martyrs of Otranto to naples and our false letter to the pope where is said that they possessed the Shroud. When the letter was forged, the forger was inspired by the histories of the Shroud of Turin written in his times, after Pingone [1581] that for the first time said that Marguerite de Charny was a GREEK noble woman; that, we know, was false, but repeated for a long time). The forger was not very able, and did not know the Greek; it is easy to see that the document is not authentic. When I showed the letter to the most important experts on this field, Luca Pieralli and Otto Kresten, in five minutes they confirmed my opinion.\n\n","date":"November 1, 2014 at 3:57 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167725","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"All fake-Chartulariums are falsificated to give importance to a family or institution that has no importance and wants to have it. So the forger of the cartulary created a fake diploma of Constantine XI, with a false genealogy of his family; and then, to make believe that his family had in the past important relics, made a false dowry which contained the stones of the home of Our Lady of Loreto, a false report of translation of the relics of the martyrs of Otranto to naples and our false letter to the pope where is said that they possessed the Shroud. When the letter was forged, the forger was inspired by the histories of the Shroud of Turin written in his times, after Pingone [1581] that for the first time said that Marguerite de Charny was a GREEK noble woman; that, we know, was false, but repeated for a long time). The forger was not very able, and did not know the Greek; it is easy to see that the document is not authentic. When I showed the letter to the most important experts on this field, Luca Pieralli and Otto Kresten, in five minutes they confirmed my opinion.\nNice tale, Andrea, have you invented this right now, or before?\nAnyway, next round. What about 18th century “sources” (fake according to you), that is one source, that is presumably one part of MS 826 manuscript which originated the story about Otto de la Roche, and the Shroud of Besancon?\nDid the forger from De Angelis Family also put his fingers in it?\n\n","date":"November 1, 2014 at 4:07 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167726","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"<<<<< have you invented this right now, or before?\nI study very hard\n<<<<<Anyway, next round\nNo rounds, game over. You must study, now. I indicated you the steps. Or you wait the publication of my next study about the Shroud of Besançon. But you can also do it alone, without me and my studies. It is very easy, t see how that \"source\" is a fake.\n\n","date":"November 1, 2014 at 4:16 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167727","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"Game over indeed, Andrea.\n\n","date":"November 1, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167728","author":"O.K.","site":"shroudstory"},{"title":"Dan Scavone Responds to an Earlier Charles Freeman’s Article","post":"If this is an example of the historical-critical method, I don’t see that there can be much mileage in it, and nothing new about the past would ever be discovered.  Its only value would seem to lie in the rigour of corroboration if what may already be known.  If we waited until doctors, lawyers, policemen and engineers practised the same degree of rigour, then if we didn’t die of Ebola first, we should all be murdered in our beds, there’d be no skyscrapers, we’d all be living in mud huts and there wouldn’t be enough horses available for our transport needs.  \nI don’t see that the practice of history can serve any useful purpose when practised in this way.  There are too many gaps in the documentation much of which has long ago been destroyed.  Speculation must be allowed, tested, blind alleys explored, and knowledge can only come in an evolutionary way.  But then I’m no historian, just an ignorant reasonable person, walking in the footsteps of others, but trying to avoid the mire, and as a result coming to my own perspectives, whether right or wrong.  The secret is to be non-dogmatic about it!\n\n","date":"November 2, 2014 at 3:50 am","url":"https://shroudstory.com/2014/10/28/dan-scavone-responds-to-charles-freemans-article/","cat":"article","id":"comment-167845","author":"daveb of wellington nz","site":"shroudstory"}]
