[{"title":"Easter Ink","post":"It is my belief that the image on the Shroud was “imaged” at the split second that the Devine Soul of Jesus’ Christ  re-entered his body for his Resurrection.\n\n","date":"April 5, 2015 at 3:40 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195407","author":"ekmcmahon","site":"shroudstory"},{"title":"Easter Ink","post":"I should make clear about what image I am speaking about, it is the one that some people say was made by some chemical or ‘scorching ‘ element.\n\n","date":"April 5, 2015 at 3:50 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195408","author":"ekmcmahon","site":"shroudstory"},{"title":"Easter Ink","post":"As far as typical newspaper reporting goes, the NY Times report seems to be a fairly well-balanced report concerning my understanding of the current position of the Talpiot Tomb and the recent geologist’s findings, and the various controversies, but with some few possible exceptions.  \nThe news aspect is that a geologist claims to be able to associate the soil on the contentious James ossuary with the Talpiot tomb.  However there are two caveats 1) the soil is very common, and the ossuary might well have come from another tomb with similar soil;  associating it with Talpiot relies on various marker trace elements, and it has yet to be ascertained if other tombs in the area have similar or different quantities of these traces.  2) Golan the dealer expresses doubts, claiming that the ossuary came into his possession in 1976, whereas Talpiot was only excavated in 1980.  However Golan seems to be a fairly shady type of character, and his 1976 claim may only be a ruse so that he can retain possession of a pre-1978 ossuary as the IAA lays claim to any discovered after 1978.   Much has been made of the missing 10th ossuary which some have claimed was merely a plain box, but which others have believed to be the James ossuary.  If Golan is correct it just may have been acquired as a result of an earlier break-in, but in that case it would still seem to leave open the question of the tenth missing ossuary. \nNaturally “Jesus’ bones” feature in the report, that’s the sensationalist bait only.  I clearly recall when I became interested in this subject that James Cameron was insistent that the Jesus ossuary only ever contained a small carpal bone and some shreds of cloth, presumably a shroud.  So if Cameron is correct, the bones of Jesus is no issue at all.  At the time he had expressed hopes of getting some kind of match with the Turin Shroud, but of course nothing ever came of it.  One might speculate I suppose, that it may possibly have been an early repository for the Shroud, but excluding the bones.  Cameron’s more cautious approach was I believe in complete utter contrast to that of Jacobovici, who was clearly after making something more sensationalist out of the whole circus, with a purported marriage to Mary Magdalen, a son to them both, and the Jesus’ bones aspect.  \nWhen the controversy first broke, opponents were quick to point out that the names on the ossuaries were very common in 1st century Palestine, and the tomb could have belonged to anyone.  However it seemed to me then that these tended to ignore the probability of the particular combination of the full list of names,  Perhaps there may have been some ten families in Jerusalem with a similar combination of names.    \nI really need no reminder from Louis as to his position and his detailed research on the Talpiot affair, as I’m well aware of his position on this matter.  My own position verges on benign indifference.  I merely find the combination of names inscribed on the ossuaries a curious coincidence, that may have a quite reasonable explanation not yet understood.  But quite likely as Louis claims, it has nothing to do with the Jesus family at all.  I’m not sympathetic to any claim that Jesus was buried at Talpiot, but that might not exclude the possibility that some of his relations might have been.  We still have little idea where the Shroud might have been kept, it had to be kept somewhere, and it might not have been retained in Joseph’s tomb.  Perhaps Pilate’s wife had it all along.\n\n","date":"April 5, 2015 at 6:39 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195415","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":" We still have little idea where the Shroud might have been kept, it had to be kept somewhere, and it might not have been retained in Joseph’s tomb. Perhaps Pilate’s wife had it all along.\nPerhaps, if it has been retained in Joseph of Arimathea’s tomb, the Pilate’s wife indeed had it all along. \nWe missed something. We missed two crucial elements of the Resurrection narrative. The burial cloths found by Peter & John -and Jewish allegations that Disciples had stolen the body, which are mentioned in Matthew. Which was the only serious allegations Jewish authorities might have brought against them.\nRemember the situation. Early Sunday morning, earthquake, Roman guards are running away from the tomb. Women came, next Peter & John, who found burial cloths in the grave. \nDecision: take them (cloths) or leave them in the tomb? This is absolutely crucial!\nIf they took the cloths, they could be easily accused of grave-robbing.\nIf they left the cloths in the tomb… well, then within half an hour there would have been plenty of Roman soldiers on the side. The cloths would then have come into possesion of Pilate… and his wife…\nThe story of the Shroud of Turin… is more sensational than Indiana Jones, or anything Dan Brown could invent.\n\n","date":"April 5, 2015 at 6:56 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195416","author":"O.K.","site":"shroudstory"},{"title":"Easter Ink","post":"Talpiot: It is very difficult to lay nonsense to rest when sensationalism and agendas are involved. If a lot of money is hidden behind it continues to be an ongoing story, despite the fact that it is written all over the walls that the people involved are clutching at straw. The best scholars and archaeologists know that.\nDaveb has noticed that I continue to insist, like Ted Koppel, at Discovery, that the whole affair is drama, not journalism. Just one fact: one in every ten ossuaries in Israel is said to have the inscription, “Jesus, son of Joseph” and there are hundreds of ossuaries to which there is no access because of the Haredim position when it it comes to where the dead lie buried.\nOK, stay tuned, I will send you an Easter egg later today. It is being specially sent to you because you are an expert when it comes to images. It will be online because many who see it may want to a small bite to see what it tastes like. Some will find it somewhat sweet, others a bitter pill to swallow…\n\n","date":"April 5, 2015 at 9:19 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195424","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"You can now download it at:\nhttps://www.academia.edu/11804110/Is_the_Sudarium_of_Oviedo_the_key_to_unraveling_the_mystery_of_the_Shroud_of_Turin\n\n","date":"April 5, 2015 at 7:06 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195448","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Let them destroy the Shroud. We worship the living Christ, not a piece of cloth. Do I need proof of His having lived and died? No. The fact that the world hates Him and ail He stands for is enough for me.\n\n","date":"April 5, 2015 at 11:27 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195428","author":"Richard Arthur","site":"shroudstory"},{"title":"Easter Ink","post":"Then why did Jesus leave a likeness of Himself on the shroud? I was a non-believer until I saw a picture of a photographic negative, my first thought was that’s impossible. After 30 years of following the shroud research, it changed my life completely. I think Jesus left an imprint because he knew there was going to be many Doubting Thomases.\n\n","date":"April 5, 2015 at 3:32 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195438","author":"don","site":"shroudstory"},{"title":"Easter Ink","post":"I’m a little surprised at Louis’ hearsay assertion that 1 in 10 ossuaries are labelled “Jesus son of Joseph” and can only surmise that the majority of these are fraudulent.  The 1 in 10 matches neither the Rahmani nor Witherington statistics.  With only the possible exception of the James ossuary, the other inscriptions on the Talpiot ossuaries are generally considered authentic inscriptions, and for which there is an archaeological trail.  Interpretation of a few of these inscriptions have been debated. \nThe Rahmani statistics are based on 286 names found on 231 inscribed osssuaries, out of a total of 917 of which 686 were uninscribed.  The name Yeshua appears on only 10 ossuaries, 3.50% of the names, and Joseph on 19 ossuaries, 6.50% of the names:  L. Y. Rahmani, A Catalogue of Jewish Ossuaries, Israel Antiquities Authority and the Israel Academy of Sciences and Humanities (Jerusalem: 1994) \nThe Witherington statistics for Palestinian male Jews are derived from a population of 2625 for which there are 1269 recorded names, and the percentages are somewhat similar, 3.77% for Jesus and 8.30% for Joseph.  Authentic pairings of the two names would be rarer.\nOf the seven certain names, the probability of the full combination occurring is 1 in 11,456.  If the James ossuary is included the probability is 1 in 38,140.  Of 100,000 family groupings of a similar size, there might be 3 families with the same combination of names.  I think that is why I consider the combination an intriguing coincidence.\n\n","date":"April 5, 2015 at 3:46 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195439","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"I wonder where daveb got the “hearsay” from. The most famous “Jesus son of Joseph” ossuary was the one Eleazar Sukenik wrote about in 1956 and another one was found on private property in Jerusalem. Neither Rahmani nor Witherington, whom he refers to, are infallible. Rahmani changed his reading of the inscription on the “Mariam kai Mara” inscription on one Tapiot ossuary and Witherington, not a statistician, jumped to conclusions with the inscription on the James ossuary changing his mind when it was claimed that it had originally been in the Talpiot tomb. For the statistics and the rest:    https://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\n\n","date":"April 5, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195442","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Louis, you did say: “one in every ten ossuaries in Israel is said to have the inscription, “Jesus, son of Joseph” …”  That’s 10% of all the ossuaries found in Israel!  So far, you’ve named just two others.  I interpret your   “… is said to …” as ‘hearsay’.  One or two errors by Rahmani and Witherington, changes their averages but little.  Hence my surmise that the majority of the alleged 1 in 10 are fraudulent or a typo.  Two other ossuaries with the inscription “Jesus Son of Joseph” is not inconsistent with their statistics.\n\n","date":"April 5, 2015 at 7:14 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195449","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"Daveb, actually the Canadian statistician Feurverger meant ossuaries that will also be found or are not accessible because of the Haredim, and some of these can of course have fraudulent inscriptions.  Rahmani’s catalogue is outdated, and there is more recent work by Figueroa.\n\n","date":"April 5, 2015 at 7:37 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195451","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"If every 1 in 10 ossuaries that had an inscription “Jesus son of Joseph” or its opposite was authentic, then every third male in 1st century Palestine would have had to have one of those names, and you can believe that to be the case if you wish, but I don’t happen to think that.  I’m aware that Feurberger was asked to calculate probabilities by the authors of that notorious work “The Jesus Family Tomb” and he later regretted it.  The figures I quoted above are my own which I calculated from data which were widely published and used by the IAA and Christian fundamentalists in their attempts to to rebut the authors’ claims.  They may now be outdated but are sufficiently accurate for purposes of a desk exercise illustrating the rarity of the full combinations.   Hence my statement above: “Of (any) 100,000 family groupings of a similar size, there might be 3 families with the same combination of names.”  I think that puts the complete combination in its proper perspective.\n\n","date":"April 5, 2015 at 11:09 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195461","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"Daveb, you must remember that I write in the field as a professional, not as an amateur, so any calculations coming from people who think they know better mean nothing. Would you have liked it if I had contradicted you in any papers you or others had published on civil engineering, which is your field? You must respect other people’s expertise, it is foolish to try and impose amateurish views, trying to become a sort of Jack of all trades.\nIf you had read the papers I published years go, repeat, years ago, to which you have the links, you would have noticed that the Israeli geologist’s views contradict the position of Professor Wolfgang E. Krumbein, which is what makes the whole affair demonstrate that the geologist is clutching at straws.\nOn must look before leaping.\n\n","date":"April 6, 2015 at 9:12 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195491","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Deferring to you as a professional then Louis, what is your source for the statement: ‘Just one fact: one in every ten ossuaries in Israel is said to have the inscription, “Jesus, son of Joseph”.’ Specifically, by whom is it so said?\n\n","date":"April 6, 2015 at 9:34 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195493","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Good afternoon, Hugh\nYou will find the source I am referring to in the following link:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nIt is known in scholarly circles that the names are like “Bob” and “Jack” in the US today, however that does not prevent people from clutching at straws, in a desperate attempt to forward the Talpiot tomb theory. What is more, even the owner of the James ossuary said it came from Silwan, not Talpiot. He was very lucky because dental drills and other suspicious material was found with him, but the Egyptian Coptic Christian Marco Ghattas, living in Egypt, who is said to have manufactured “antiquities” for him, did not appear at the trial. The  Israel Antiquities Authority returned the ossuary to Golan, making it clear that the inscription had not been authenticated and was probably forged.\nBiblical studies and archaeology can be highly complicated. You may like to read the interview with Father Joseph A. Fitzmyer, SJ, considered to have been one of the greatest NT scholars of the twentieth century:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nHe also taught Biblical Studies at Oxford and was awarded a gold medal by the British Academy. For more, he was also on the Pontifical Biblical Commission, edited and translated the Aramaic Tobit texts of the Dead Sea Scrolls found in Qumran, cave 4, edited the Jerome Biblical Commentary together with American Fathers Raymond E. Brown and Roland E. Murphy. There is a lot more, however the bio-data exceeds five pages.\n\n","date":"April 6, 2015 at 10:33 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195498","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"I’ve had a look through your link. Is your source Camil Fuchs? I have read as much as is available online of his “Names, Statistics and the ‘Jesus Family’ Tomb Site” as his Chapter in James Charlesworth’s book ‘The Tomb of Jesus and his Family?’ but have not found anything to suggest that “one in every ten ossuaries in Israel” bears the inscription “Jesus, son of Joseph.” If it is Fuchs, can you point to where she thinks that? Or if it’s not Fuchs, then who is it?\nI hesitate to mention anybody’s findings, as you tend to dismiss them all as unreliable, but James Tabor has not been quoted yet. He claims (2012) that there are only two “Jesus, son of Joseph” ossuary inscriptions, out of the approximately 2000 ossuaries found so far. Is the total number of ossuaries approximately correct? If so then I understand you claim that 200 of them have an inscription saying “Jesus, son of Joseph.” Have you any evidence for that?\n\n","date":"April 6, 2015 at 11:08 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195502","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Hugh, you seem to be better with microscopes than with texts. The line I refer to is in the fourth paragraph, talking about Feuerverger and Pfann:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\nCamil Fuchs does not say anything about this and, by the way, it is “He”, not “She”.\nNow you are coming with amateurish questions, asking about James Tabor. He is not an archaeologist and teaches religion, so why should there be any reference to him? In any case, he is talking about ossuaries that were found, not about ossuaries that were not found.\nI did not claim anything, just mentioned what others were saying. Where did you read anything where it can be construed that I believe that there are 200 ossuaries with the inscription, “Jesus, son of Joseph”?\nYou know something? Time is wasted talking about these inscriptions. The other inscriptions  at Talpiot also pose problems, much bigger ones, and there will be more about the topic when “Jesus was not buried in Talpiot, Part IV” is ready.\n\n","date":"April 6, 2015 at 11:56 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195504","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Right. I think I get it.\n“Just one fact: one in every ten ossuaries in Israel is said to have the inscription, “Jesus, son of Joseph.” The fact is that it is said that 10% of Jewish ossuaries have that inscription, not that they actually do have that inscription.\nIf about 2000 ossuaries have been found, this means that somebody, not yourself, thinks that there are 200 inscriptions (one in ten). If they are referring also to ossuaries that have not been found, then there must be more than 200 carrying that inscription. It would be strange if all the references to “Jesus son of Joseph” occurred on ossuaries that have not yet been found.\nThus you seem to be claiming that Feuerverger and Pfann think that at least 200 ossuaries bear the inscription “Jesus, son of Joseph.”\nBut I don’t think they do. Is there any evidence that they do?\nTime is not wasted talking about these little scientific details. Accuracy is important.\n\n","date":"April 6, 2015 at 1:04 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195508","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Hugh, It is clear that they mean all the ossuaries found AND NOT YET FOUND in Israel will have one in every ten inscriptions saying “Jesus, son of Joseph”. It is perhaps something like walking down Fifth Avenue and shouting to find (American-born, of Anglo-Saxon or Irish origin) people named “Bob” and “Jack”.\nI think accuracy does not come into the question because other inscriptions are being ignored. The inscription we are talking about is just one, single, minute detail, there are more important things in the topic.\n\n","date":"April 6, 2015 at 1:17 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195511","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"This posting began with two news items, one concerning a NY Times report concerning a geologist’s work who claimed to have identified the soil on the James ossuary as being consistent with the contentious Talpiot tomb.  Anyone at all is free to comment on this blog site about items that appear here.  My original comment is at April 5, 6:39 am, and having reread it, I see nothing to retract in it, but consider it to be a fair statement of the position. \nIt does so happen that I have particular training in statistics and applied probability, more so I would say than most other professional scientists, including even archaeologists, and a training which I often used and applied in my own professional career.  \nLouis clearly stated: “Just one fact: one in every ten ossuaries in Israel is said to have the inscription, “Jesus, son of Joseph” .”   That has been shown not be a fact at all, but as I said earlier, only hearsay and doubtless incorrect.  In order for there to be 1 in 10 ossuaries with the pairings of ‘Jesus’ and ‘Joseph’ inscribed on them, then 1 in 3.16 males in 1st century Jerusalem would need to have had one of those two names.  That is clearly not the case.  ‘Jesus’ and ‘Joseph’ may have been as common as Bob, Jack, Charlie, Bill, Bruce or Trevor in modern day western society, but certainly not as common as he implied.   \nAs at 1994, out of 231 inscribed ossuaries held by the Israeli Antiquities Authority, the name “Yeshua” appeared on only 10 ossuaries, and the name “Joseph” on only 19 of them.  The rate of occurrence might now have changed with further discoveries since then, but I should suspect hardly radically so.  Only two other ossuaries have been identified with an inscription corresponding to “Jesus son of Joseph”.  The rate is clearly not 1 in 10!  The ossuaries currently on hand, may be considered to be a sample of all 1st century ossuaries, including those yet remaining to be discovered.  There is no substantial evidence that 1 in 10 of all ossuaries in 1st century Jerusalem have that particular inscription, in fact quite the contrary.   \nI stand by my earlier claim, that out of any 100,000 similar sized families, perhaps only three such families had the identical combination of names as those inscribed on the Talpiot cache. \nTo make my position quite clear, I consider that Talpiot makes no challenge at all to Jesus having been buried in the tomb of Joseph of Aramathaea, that this tomb may well be the site of the current Holy Sepulchre church in Jerusalem, nor does it make a challenge to His resurrection from the dead, and no good case is made that he was married to anyone, nor that he sired a child.  All such attempted challenges in my view are utterly specious, for which there are adequate responses.\n\n","date":"April 6, 2015 at 3:52 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195520","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"Daveb is undoubtedly correct. Nobody, including Feuerverger, Pfann, Tabor, Fuchs and Rahmani has ever claimed that one in ten of all the ossuaries in Israel, discovered or hidden, bears the inscription “Jesus, son of Joseph.” There may be lots of good reasons why the Talpiot tomb has nothing to do with the Biblical Christ, but this fictitious inscription statistic is not one of them.\n\n","date":"April 6, 2015 at 5:04 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195524","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"All I can say is that both articles “Jesus was not buried in Talpiot”, Parts I&II and Part III have to be read first. Why? Because the topic is kind of stale and the questions raised were answered in these articles — written years ago.\nToday itself a friend sent me the link to the NYT news item, saying that he did not believe in newspaper articles and prefers to read papers, therefore he wanted to know what my views were because it was one of my fields. I had to tell him that sensationalists and their supporters have a lot of money behind them, which they think is worthwhile squandering by clutching at straws, because they will simply not give up.There are agendas, hidden agendas and not-so-hidden agendas. So, if I were to devote time contesting all the rubbish that is being published in the fields of biblical archaeology and studies from time to time, there would be no time for me to do anything else.\nForget the statistics. I must remind daveb that he was supporting Karen King and the fraudulent fragment she was trying to promote on this very blog not long ago. That is what you call amateurish stuff.\n\n","date":"April 6, 2015 at 5:12 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195525","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Something is seriously wrong here. Apparently Hugh has not even bothered to read what I wrote in Talpiot III. Both Pfann and Feuerverger stated exactly what I said they stated. What did they state? That one in ten ossuaries in Israel, including those that have not been found, will have an inscription saying “Jesus, son of Joseph”.\n\n","date":"April 6, 2015 at 5:17 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195526","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Where did they state this?\nIn “Buried Hope Or Risen Savior: The Search for the Jesus Tomb” edited by Charles L. Quarles, Feuerverger is quoted as saying that “1 in 190 men in first-century Jerusalem was named “Jesus, son of Joseph.” I cannot find that Pfann has said anything on the frequency at all. Several websites say that “about one in ten males bore the name Jesus” but they do not assume that all these Jesuses had fathers called Joseph.\nHugh has not only “bothered to read” what you wrote, but he has made strenuous efforts to check that what you wrote was true. He has been unable to do so. Assuming that you did not misread your sources, can you in fact substantiate your claim at all?\n\n","date":"April 6, 2015 at 5:53 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195529","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Good evening, Hugh\n1) You say “to check that what you wrote is true”.\nFirst of all, I write articles and papers, sometimes on request, in the field of biblical archaeology and biblical studies, science-theology dialogue and other topics. These are read by highly qualified people, some even with doctorates from the University of Chicago and Oxford, even people who have appeared in “Who’s Who In the World”. They have appreciated my work and have been requesting me to write more. Do you think I am misleading them? Do you think they are fools, people who can be misled?\nI have not misread my sources, the sources I have are for professional work. Are you sure you have read the sources? Are you sure you read the articles in the links I provided above? I don’t think so.\n1)You ask, “Where did they say so”? Read the articles mentioned above to find out.\n2) “I cannot find that Pfann has said anything at all”. Are you sure? Again, have you read the sources? Pfann has said that Feurverger confirmed to him in a private conversation in Jerusalem that one in every ten tombs in Jerusalem should have a “Jesus son of Joseph”.\nDo you want more? Professor Fuchs, whom you cite, said the following: “None of the statisticians of whom I am aware who analyzed the data considers that the Talpiot tomb is statistically significant in any meaningful way.” Is that enough? I don’t think you know that, so please read carefully.\nLastly, if you were an expert in analysing findings in the field of biblical archaeology, as you think you are, you would know that these two names:\n“Yeshua bar Yehosef”\nJesus, son of Joseph – (Aramaic)\nare among the most popular in pre-AD 70 Judaism.\n\n","date":"April 7, 2015 at 3:22 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195643","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Don’t get tetchy, Louis; I asked a civil question – all you had to do was answer it, but instead we had subtle hints and multiple sources and protestations of professionalism. \nNow you have answered it.\n“Pfann has said that Feurverger confirmed to him in a private conversation in Jerusalem that one in every ten tombs in Jerusalem should have a “Jesus son of Joseph”.\nNow all you have to do is say where Pfann said this. All the rest is persiflage.\n\n","date":"April 7, 2015 at 4:08 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195648","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Didn’t you say you had the sources, Hugh?\nFor God’s sake, for the umpteenth time clink on the link Talpiot III above.\nYou asked a civil question? Really? Look what you wrote:\n“strenuous efforts to check that what you wrote is true”\nand\n“Assuming that you did not misread your sources, can you in fact substantiate your claim at all?”\n\n","date":"April 7, 2015 at 4:22 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195650","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Louis has again misinterpreted my position.  I did not “support Karen King and her fraudulent fragment”.  But like the rational person I aspire to be, I remained open to the possibility that the fragment might have been authentic until it was conclusively demonstrated otherwise, other persons agendas notwithstanding.  \nHere is a simple exercise with a pack of ordinary playing cards.  Discard the joker.  Call all the spades cards “Jesus or Joseph”.  13 of the 52 cards (1 in 4) are spades.  There are 12 x 13 = 156 ways of drawing a pair of spades.  There are 51 x 52 = 2652 possible pairings altogether.  Then the chances of drawing a pair of spades = 156 / 2652 =  0.0588 … =  1 in 17.  So for there to be even a 1 in 17 chance of pairing “Jesus and Joseph”, 1 in 4 persons need to have one of those names.  If 1 in 10 ossuaries are discovered to have the inscription “Jesus son of Joseph” then those inscriptions cannot be authentic.\n\n","date":"April 6, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195530","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"Sorry daveb, that was not really your position. See your comments posted months ago on this very blog.\n\n","date":"April 7, 2015 at 3:26 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195644","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Despite the advance of years, I am still quite cognisant of what I wrote.  I elaborated on what might be the possibilities if it so happened that the fragment proved to be authentic, at that time quite uncertain and hotly debated, but I certainly have never asserted that it was as I could not know.  Your own aversion to Karen King would seem to have resulted in your misinterpreting what I had to say on the matter.\n\n","date":"April 7, 2015 at 10:00 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195670","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"How could anyone possibly have any idea that specific bones were Jesus’ bones?  To me the idea is nonsensical.\n\n","date":"April 7, 2015 at 7:17 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195597","author":"Andy","site":"shroudstory"},{"title":"Easter Ink","post":"Hey Louis! Save yourself the trouble. I can do it for you. By entering “one in every ten” instead of “one in ten” into Google, I find in James Charlesworth’s book, “The Tomb of Jesus and His Family?” in a chapter by Steven Pfann, the following:\n“In fact, statistically speaking, one in every ten tombs from the first century should have a ‘Jesus son of Joseph,’ including those whose names were not inscribed. This was confirmed independently by Prof. Feuerverger in a private conversation during the course of the conference.”\nPhew! Now to check whether I agree with him. But why couldn’t you just give the reference straight off? It would have saved so much trouble…\n\n","date":"April 7, 2015 at 4:40 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195652","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Hugh, come on. Have I been talking in Greek all this while? You yourself mentioned the sources, and all you had it to was to consult them.\nA bit of advice: Don’t bother about these sources. I will soon be writing Talpiot IV, with information that was not cited in them, and, of course, also in the documentary/book on the “Jesus family tomb”. Authors/Documentary producers have to sell, fill coffers and don’t forget that Discovery later put the James ossuary one their list of the century’s ten top hoaxes.\nYou know something? Co-author Charles Pellegrino questioned Father Mervyn Fernando, the Catholic priest in Sri Lanka, who was a friend of Arthur Clarke for 25 years. Why did he have to do this? Father Fernando is not a biblical scholar, he has written about Teilhard de Chardin.\nThe question was about survival after death in the NT (Paul, in Corinthians). The priest told him that he had found the bones of doubting Thomas in Talpiot.\n\n","date":"April 7, 2015 at 5:06 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195654","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"And finally, mostly to set daveb’s mind at rest, where does this “one in every ten” come from?\nUntil his last post Louis was claiming that archaeologists said that: “one in every ten ossuaries in Israel is said to have the inscription, “Jesus, son of Joseph.” This was, no doubt unintentionally, completely untrue. For ‘ossuaries’ we should read ‘tombs’ and there is a very important difference, statistically, as we shall see.\nAccording to Pfann, in “Demythologyzing the Talpiot Tomb” (http://www.uhl.ac/files/9813/4840/4067/TalpiotTombAnalysisSJP3a.pdf), in an “overall census of inscribed ossuaries” there were 286 names, of which 10 were Jesus and 19 were Joseph. For reasons unexplained, Pfann reduces the 286 total to 214, which is the total number of the most numerous 16 names. Of the 214, 144 are male and 70 are female. This gives 7% called Jesus and 13% called Joseph. Assuming the two names are unconnected, the probability of being a “Jesus, son of Joseph” is 7% x 13% which is roughly 1%. However, since a tomb might be said to have an average of ten ossuaries in it, the probability that a tomb contains a “Jesus, son of Joseph” is back to 10%. One in ten.\nActually the reduction of 286 to 214 is not justified. Assuming a similar proportion of males to females though, there would be a total of 196 males and 90 females, and thence 5% Jesus and 10% Joseph, and (if we may still assume 10 ossuaries per tomb), a probability of there being a Jesus son of Joseph actually more like 5% than 10%.\n Of course, some tombs were built to contain up to 16 ossuaries, and some ossuaries contained bones from more than one body, so these figures can be juggled a bit to suit, but at least we have laid to rest the idea that 10% of the male population of Israel were ‘Jesus son of Joseph.’\n\n","date":"April 7, 2015 at 5:41 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195656","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"It is clear that Pfann is using precisely the same Rahmani statistics that I have been quoting all along.  His figure of 214 names are those that occur four times or more.  The other 72 names are those that occur three times or less, making the total 286.  These 286 names occurred on 231 inscribed ossuaries.  In addition there were 686 uninscribed ossuaries, 917 in total.  It is clear from your posting that between 1 in 10 or 1 in 20 tombs might contain a single ossuary attributable to “Jesus son of Joseph”, whether inscribed or not.  But there could never be 1 in 10 ossuaries so inscribed, unless every third male in ancient Israel had one of those names, which is not the case!!!!  Most ossuaries are not inscribed at all!\n\n","date":"April 7, 2015 at 9:51 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195668","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"This information is outdated. Rahmani is not a statistician and his catalogue is outdated.\n\n","date":"April 8, 2015 at 7:20 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195717","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Hugh, politics makes strange bedfellows, isn’t it? Reference is made to your first line above.\nI am not claiming anything, just mentioning what professional biblical archaeologists and scholars have said and I stand by what they say.\nPerhaps you should begin a BJBA British Journal of Biblical Archaeology and become its editor to contest those in Jerusalem.\nHey, have you forgotten about the Turin Shroud? This is a shroud blog and you have said nothing about the Oviedo sudarium, on the other thread. Why?\n\n","date":"April 7, 2015 at 5:55 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195660","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"From what has been posted above it would seem that “professional biblical archaeologists and scholars” have difficulty in distinguishing a tomb from a single ossuary in their write-ups!\n\n","date":"April 7, 2015 at 10:05 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195671","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"Has anyone seen anything like this? Now, the professional work of well-known respected biblical archaeologists and scholars is being questioned.\n\n","date":"April 8, 2015 at 7:22 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195719","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Why? That’s a good question. I do seem to spend an inordinate time trying to getting to bottom of vague generalisations which one might think were better taken in their stride. I’ve no doubt that it is partially my own character, but on this blog, it is also particularly relevant. From the number of people who might have been crucified wearing a crown of thorns, to the chances of a Pantocrator being derived from the Shroud, to Alan Whanger’s 150 points of congruence, to Harry Gove’s 1 to a gazillion chance of the Shroud being 1st century, to Stephen Jones’s use of the same statistic to prove it can’t be medieval, to the Nature paper’s chi-squared test, to OK’s last word about the Pray Codex, among others, quite a lot of the evidence for or against the Shroud is based on probability, and too often those whose quote these probabilities do so without really knowing what they are saying.\nTombs. One in ten tombs. Not ossuaries. Tombs may contain a dozen ossuaries. Daveb, Feuerverger and Pfann were all agreed on that from the start. \nNow, what is the probability that a Spanish cloth dating from the 8th century and a French cloth dating from the 14th century both wrapped the head of a man in the 1st century? It all depends of points of congruence…\n\n","date":"April 8, 2015 at 3:22 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195694","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Hugh: Now, what is the probability that a Spanish cloth dating from the 8th century and a French cloth dating from the 14th century both wrapped the head of a man in the 1st century?\nI have no doubt that, it all depends on the amount of Contamination. Did anyone found that those two clothes are without any contamination and are on the original state? Who think those two clothes are suitable for Carbon dating to decide their age?\n\n","date":"April 8, 2015 at 3:54 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195697","author":"Sampath Fernando","site":"shroudstory"},{"title":"Easter Ink","post":"Hugh, there was no answer to my query. Will you now say that the 14th-century forger found out about the Oviedo century and produced the Shroud image to match the stains?\n\n","date":"April 8, 2015 at 7:25 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195720","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"According to Hugh, the Turin Shroud  now is a “FRENCH (= Made in France; my upper cases) cloth dating from the 14th century”. Could Hugh refer us to research papers from textile experts confirming your assertion, please? Could you refer us too to research papers confirming the Oviedo Sudarium is a “SPANISH (= made in Spain; my upper cases) cloth dating from the eight century”, please?\n\n","date":"April 8, 2015 at 4:02 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195698","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"Methinks Hugh’s wishful thinking completely replaces his critical analysis on a double-standard basis.\n\n","date":"April 8, 2015 at 4:09 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195700","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"No, Max, I can’t. I used the nationalities for convenience. The Shroud may be German or Norwegian for all I know, and the Sudarium is probably not Spanish.\n\n","date":"April 8, 2015 at 4:07 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195699","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Your ‘convenience’ here is misleading not to say sneakily anti-authenticity agenda-driven..\n\n","date":"April 8, 2015 at 4:13 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195701","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"Is it for convenience’s (or gross approximation’s) sake too you keep asserting a medieval super-genius forged the TS image?\n\n","date":"April 8, 2015 at 4:41 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195703","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"In fact there is a possible candidate for that ‘medieval genius’ . Max, provided you accept an alchemist with a sideline in deep philosophical discourse. I refer to the 13th century (pseudo) Geber. \nGeber,  who in his day was regarded as an alchemist, and thus viewed with deep disapproval by the Church, had used Geber as a pen name  (it’s complicated, being an attempt it would appear to pose posthumously as an much earlier Arab alchemist).  However, a strong case has been made for identifying the pseudo-Geber as the Franciscan monk, Paul of Taranto.\nGeber/Paul are credited with the first clear recipe for generating nitric acid and accompanying oxides of nitrogen by calcining a mixture of metal nitrates and sulphates, initially in the form of fumes from the reaction vessel. I am coming round to the view that those fumes could have been used to produce the image we see on the Shroud – as oxidation products of carbohydrates –  and possibly even nitrated products of protein (yellow xanthoproteic products can be formed by nitration of aromatic side chains of tyrosine, tryptophan and phenylalanine).\nSee my most recent two postings for details.\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/04/was-this-man-who-supplied-chemical-know.html\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/04/might-fumigation-with-nitric-acid.html\nConc.nitric acid is on order. Rest assured I’ll be testing the hypothesis at the earliest opportunity, at some risk to my lungs.\n\n","date":"April 8, 2015 at 5:09 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195706","author":"Colin Berry","site":"shroudstory"},{"title":"Easter Ink","post":"Colin, nice to hear you are now recycling my tightly- wrapped-up-remoistened-bloodied-body (mhyrric-) aloetic fumigation pro-authenticity theory (my halakhistic/ritualistic approach) to meet your anti-authenticity agenda.\nHistorically speaking, the very existence of the pseudo-Geber aka Paul of Tarento, an alchemist who would have lived in the 13th c. CE, is more than hypothetical except in the eyes of French chemist and historian of Alchemy,  Marcellin BERTHELOT (1827-1907).\nForensically speaking, indeed the fact is specific fuming (thermochemical developement) can be used to develop, reveal or enhance latent body prints on a porous surface such as linen. Alike the TS body image, the resulting imprint can be lifted  by carefully applying transparent lift tape to the surface that contains the print and peeling the tape from the surface. \n“Courage donc fils de la science”, you’ll finally agree with me (re my pro-authenticity fumigation theory).\n\n","date":"April 8, 2015 at 6:36 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195712","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"I know you have referred to fumigation, Max, and all credit to you for that, but I don’t recall any mention of nitric acid or oxides of nitrogen. I came to nitric acid through trying to think like a medieval forger, and considering what chemical reagents he might have had at his disposal. The first was sulphuric acid, which I rejected after experimentation: it fails to scorch linen unless hot and concentrated. That left two common mineral acids – nitric and hydrochloric. Only the first of those is strongly oxidizing in both dilute and concentrated solutions AND (importantly)  in the cold too, albeit more slowly. What’s more, nitric acid is well known for yellowing organic matter. \nReading the alchemical literature then reminded me that the first nitric acid of European history was generated in the13th century or earlier as fumes from a high-temperature reaction in a heated retort loaded with nitrate and sulphate salts. So it’s pure accident that we’ve both arrived at fumigation. There’s also the small point that hypotheses are designed to be tested (or testable in principle). One afternoon in a school laboratory with a hood, extractor fan and conc.nitric acid is all I would need to check out my HNO3/NOx fumigation hypothesis for viability. Can you say the same Max?\n\n","date":"April 8, 2015 at 6:54 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195714","author":"Colin Berry","site":"shroudstory"},{"title":"Easter Ink","post":"Colin, are you still working from the premise that the forger applied the acid to a bas relief: woodcut, metal or stone – and the image is a contact print result? I’m just trying to understand how the topical acid made it on to the linen. Max would be working from a similar premise but of course with an actual corpse.\nCould your theory likewise involve a corpse?\nAlso, we have historical precedent of people spontaneously combusting. What about a spontaneous vaporization? Pure sci-fi I suppose. Just musing that while human beings are not comprised of light, we are comprised of gases – like carbon. From my Star Trek science lessons, I recall we are carbon based lifeforms.\nIs the Shroud image evidence of a human body turning to carbon vapour? Would this in turn affect its C-14 readings? Questions beyond the realm of science, no doubt.\nCarry on with the actual science.\n\n","date":"April 8, 2015 at 8:42 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195726","author":"David Goulet","site":"shroudstory"},{"title":"Easter Ink","post":"“Colin, are you still working from the premise that the forger applied the acid to a bas relief: woodcut, metal or stone – and the image is a contact print result? I’m just trying to understand how the topical acid made it on to the linen. Max would be working from a similar premise but of course with an actual corpse.\nCould your theory likewise involve a corpse?”\nThere’s a huge advantage of this chemical model over the previous “hot template” hypothesis, DavidG. It permits one to use a LIVE and COOPERATIVE human subject as template, rather like one of Luigi Garlaschelli’s student volunteers. (Or should that be ‘volunteers’ , given they had to consent to be stripped of clothing and fitted with false shoulder-length hair?). That’s not to say it could not have been a more cooperative corpse.\nWhy? One is looking here at a binary chemical system (think binary weapons that are safe to store in warheads until one allows the two ingredients to mix). The safe component is the two “paints” that one applies to the volunteer that is to represent blood and sweat (possibly real blood, but artificial sweat). The beauty of this binary system is that it allows one to apply sweat first, then blood, contrary to blood first/body image second claim of Adler and Heller. When one lays the linen over the subject and presses around the relief contours, it’s blood that imprints first, underneath the  “sweat”.\nOK, one has one’s imprint on the linen. One can then tell the volunteer to get dressed and go back to his studies with improved exam prospects. One then takes the imprinted linen, maybe allowing a short time for partial drying, and one then suspends it in the HNO3/NOx acid fumes. The latter acts on both the background linen to give a faint yellow/brown coloration, but more extensively on all the organic matter in one’s simulated sweat AND blood maybe. Result: Turin Shroud Mark 1. Ageing, wear and tear does the rest to make present TS Mark2.  Who knows: the blood that is “too bright” might even be real blood that had reacted with nitric acid and nitrogen oxides. I suggested something similar with the “leech-digested” blood hypothesis. Adrie van der Hoeven said the visible absorption spectrum was wrong, from her meticulous literature search, but a mix of HNO3 and NOx offers a much wider range of bonding ligands onto that heme-bound Fe+3 centre of acid methemoglobin. Note that it’s “acid” methemoglobin that was identified by Adler and Heller, as Piero has recently reminded us. Hmmm. Now where did the acid come from one wonders? Acids don’t appear out of thin air. Someone has to add them? The maverick monk, with a flair for 13thy century proto-chemistry?  Paul of Taranto? \nPardon me if I skip the difficult question needed to earn full marks (spontaneous combustion etc).\n\n","date":"April 8, 2015 at 10:15 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195738","author":"Colin Berry","site":"shroudstory"},{"title":"Easter Ink","post":"Thanks for the detailed reply, Colin. Full marks for that. The vaporization question was strictly for bonus marks.\n\n","date":"April 8, 2015 at 11:46 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195743","author":"David Goulet","site":"shroudstory"},{"title":"Easter Ink","post":"Thanks David.\nI’ve been out of the loop on clinical chemistry for some 20 years or more, so have to rely on Google to keep in touch. Have just discovered there’s a vast literature on elevated levels of methemoglobin in blood due to excess exposure to NO  (nitric oxide).\n NO supplementation is now therapeutic procedure, would you believe it, based on it having being found to be an endogenous regulator of vascular tone, blood pressure etc . So we now a highly fashionable form of NO therapy (“if a little does you good then more supplied by the therapist must work better”). Shame about the raised risk of methemoglobinemia.\nWhat’s this got to do with the TS you may ask? Those fumes from the Geber/Paul of Taranto retort are not just nitric acid. They are a mixture of nitrogen oxides as well, for which the umbrella term is NOx (NO, N2O,NO2, N2O3, N2O4, N2O5 etc).  One of them is probably NO, which would be able to convert any blood stains to oxidized methemoglobin, with or without assistance from HNO3. Maybe we have an explanation for those permanently-red blood stains on the Shroud, better described (no disrespect to Alan Adler RIP) as NO-methemoglobin than as acid-methemoglobin. \nIt’s all very tentative I grant you. Personally, I like tentative. If it ain’t tentative, chances are one’s stuck in a rut.\n\n","date":"April 8, 2015 at 12:14 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195747","author":"Colin Berry","site":"shroudstory"},{"title":"Easter Ink","post":"I’m sorry you were mislead.\n\n","date":"April 8, 2015 at 4:24 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195702","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"When you mean ‘convenience’, indeed you mean at anti-authenticists’ convenience and authenticists’ inconvenience in order to sneakily biase the debate.\n\n","date":"April 8, 2015 at 4:52 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195704","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"“I’m sorry you were misled”, you mean…..past tense…..\nI thought you were a teacher.  ;^}\n\n","date":"April 8, 2015 at 8:56 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195730","author":"Nabber","site":"shroudstory"},{"title":"Easter Ink","post":"He teaches science, not English!\n\n","date":"April 8, 2015 at 9:12 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195733","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Oh dearie me! At least I didn’t split an infinitive….\n\n","date":"April 8, 2015 at 9:19 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195735","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Colin! Following your lead I have been sloshing acid about as well. And I too find that sulphuric acid in concentrations of more than 0.05M produces physical deterioration before it produces discolouration, and could have resulted in the Shroud falling to pieces by now. The trouble with nitric acid is the fumes, which will probably get everywhere and discolour everything rather than just the surface fibres. Your results will be interesting…\n\n","date":"April 8, 2015 at 6:46 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195713","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Hello Hugh. Pleased to hear you were able to confirm my sulphuric findings.  :-)\nGranted those nitric/NOx fumes can get everywhere. But what if they are used like a photographer would use a developer?  In other words, expose one’s imprinted linen to the fumes, watch closely until one’s achieved the desired effect, then quickly remove, and maybe dust with chalk to neutralise the acid (centuries later the historians will describe the chalk as artist’s gesso ;-).\nKeep in mind the botany too: the first part of the linen fibre to be encountered is the PCW, approx thickness 200nm, comprising reactive non-crystalline cellulose, pectins, hemicelluloses, and protein too that may give a xanthoproteic reaction with HNO3 – intense yellow chromophores can be generated from mere traces of  proteins, providing they have aromatic side chains).\nWhy not give HNO3 a go too, and spare my lungs? As I’ve said before, I believe the prime role of the lead scientist is to generate plausible hypotheses. The rest is teamwork! A protocol is yours for the asking, but I’m sure you are fully capable of producing your own in short order.\n\n","date":"April 8, 2015 at 7:10 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195715","author":"Colin Berry","site":"shroudstory"},{"title":"Easter Ink","post":"Exactly how can fumes of any kind leave behind a detailed image?  Do you have an example of such?\n\n","date":"April 8, 2015 at 8:57 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195731","author":"Nabber","site":"shroudstory"},{"title":"Easter Ink","post":"E.g. solid crystal iodine and starch fumes that adhere selectivly to most of the skin oils and other residues combine and can reveal latent fingerprints.\n\n","date":"April 8, 2015 at 4:07 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195762","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"PS: Have just come across this reference to nitric acid and cotton, Hugh:\n“Cellulose Hexa-nitrate, C6H4O5(NO3)6. This forms the principal portion of the commercial explosive gun cotton, and is made when a mixture of strong nitric acid and strong sulphuric acid is allowed to act on cotton at from 50 to 55° F. for twenty-four hours. The longer the action is prolonged, the more completely is the cotton converted into the nitrate, with a short duration the finished product contains lower nitrates. This hexa-nitrate is insoluble in ether, alcohol, or in a mixture of those solvents, likewise in glacial acetic acid or in methyl alcohol.”\nhttp://www.gutenberg.org/files/21224/21224-h/21224-h.htm\nCotton then is amazingly resistant material, at least towards oxidation, its cellulose -OH groups being esterified by nitric acid, instead of being oxidized to a brown char as one might imagine. How linen behaves is anyone’s guess, given that linen unlike cotton has a lot of reactive hemicelluloses. It or its passengers may be more susceptible to oxidation and yellowing, bearing in mind that it probably carries a considerable burden of impurities from the retting process – bacteria etc – so there may be adventitious surface components that ARE oxidized by nitric acid to yellow or brown products that one would not see with much purer seed hair cotton. But the crystalline core cellulose of the SCW might still remain largely unaffected if surface treatment with vapours were to be brief (“flash fumigation”).\nThe nitric acid is due to arrive at my home sometime in the next two weeks or so. I’ll post results as soon as I get them, that being the nature of my site (an old fashioned web log , ie. blog, written as a diary).\n\n","date":"April 8, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195766","author":"Colin Berry","site":"shroudstory"},{"title":"Easter Ink","post":"Good question,Nabber.\nHey Colin, what about the Sudarium?\n\n","date":"April 8, 2015 at 9:14 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195734","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Re my fumigation hypothesis Colin has recycled ‘by pure accident’ (this is not the first but the third time, he is recycling ‘by pure accident’ my own ideas on the TS image formation process), while admitting “I know you have referred to fumigation, Max, and all credit to you for that, but I don’t recall any mention of nitric acid or oxides of nitrogen.  (…) One afternoon in a school laboratory with a hood, extractor fan and conc.nitric acid is all I would need to check out my HNO3/NOx fumigation hypothesis for viability. Can you say the same Max?”\nI’m practicing neither kitchen nor school laboratory chemistry or pig experiments but first and foremost intuitive thought experiment along with state of the art experimental archaeology. This is a world of a difference. In the hypothesis the TS man is Yeshua’s, I reconstructed in its minute details his speedy burial, the specific wrapping of his corpse in shrouds and the purifying/drying procedure to which it was subjected. (Just to tongue-in-cheek paraphase him) can Colin say the same? \nBTW the TS bloodied body image is not just chemical: it is a mechanical (in terms of mechanical return force of shrinking  taut and compressed  3:1 twill linen fabric soaked in alkaline waters subjected to a fumigation and self collimation due to the presence of “opaques”  –iron oxide and silica particles– adhering to the bloodied body and the linen fabric surface) thermal (in terms of subjection to external heating source at low temperature namely a –myrrhic?– aleotic fumigation) and chemical (in terms of pre- or light mordanting) imprinting. One night (on October 3I-November 1, 1988 CE), it took me just one most vivid kind of lucid dream to reach the solution.(Just to tongue-in-cheek again paraphase him) can Colin say the same?\n\n","date":"April 8, 2015 at 1:35 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195750","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"Endnote: The difference between school laboratory chemistry and state of the art experimental archaeology is the same between synthetic and real diamonds. Cherchez l’erreur.\n\n","date":"April 8, 2015 at 1:41 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195751","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"Perhaps we should lobby schools to drop their chemistry labs and switch over to experimental archaeology — so much cheaper. Why do real science with all those costly materials when you can produce synthetic thought experiments for free. There might even be a free app for that on the kids smartphones.\n\n","date":"April 8, 2015 at 3:03 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195755","author":"David Goulet","site":"shroudstory"},{"title":"Easter Ink","post":"The probability that as yet undiscovered tombs have an ossuary with an inscription corresponding to “Jesus son of Joseph” is very much less than 1 in 10 or even 1 in 20. \nProbability of an ossuary being inscribed = 286 / 917 = 0.3119 ;\nProbability of the name ‘Jesus’ occurring on an inscribed ossuary =  0.0350\nProbability of the name ‘Joseph’ occurring on an inscribed ossuary =  0.0664\nFor any two male names in a family tomb, it is more likely that the relationship will be fraternal than parental, and there are two ways of describing the parental relationship.  Other familial relationships also occur, cousins and third generations or they may be unrelated.  The probability that the relationship is a specific parental relationship cannot exceed 0.20.  \nThe probability of any ossuary having the said inscription cannot exceed:\n0.3119 x 0.350 x 0.0664 x 0.20 = 0.000145\nIn a tomb containing 20 ossuaries, the probability is 0.00290, that is 1 in 345. \nFor there to be a probability of 1 in 10 of an ossuary with the said inscription occurring in a family tomb, there would need to be 690 ossuaries present.  No tomb is known to have that many ossuaries.  Conceivably a public cemetery might.  So far there are three ossuaries known to have the particular inscription, and this would seem to fit the case.  \nI would be confident that all of this would be known to competent and experienced Israeli archaeologists.  The assertion that 1 in 10 tombs would have such an ossuary, is obviously an unthinking, careless, throw-away line of no import, and has no relevance whatsoever to the Talpiot issue.  It ought not to have been quoted in any serious discussion.\n\n","date":"April 8, 2015 at 3:07 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195756","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"Daveb: “I would be confident that all of this would be known to competent and experienced Israeli archaeologists.” It is indeed. Neither Feuerverger nor Pfann mention the probability of finding inscriptions saying “Jesus, son of Joseph”, only the probability that the tombs would contain people who were Jesus son of Joseph. The probability of finding inscriptions is much easier to calculate. Out of about 2000 ossuaries, two or three have been found with inscriptions saying “Jesus, son of Joseph.” Say 1 in 1000 or so.\nLouis: “it would be better if only professionals in the field commented.” I hope you are not including yourself among these eminent people. May I remind you of what you said?\n“Just one fact: one in every ten ossuaries in Israel is said to have the inscription, “Jesus, son of Joseph.”\nThis was factually incorrect on two counts. Firstly replace the word “ossuaries” with “tombs”, and secondly replace the words “the inscription” with “the bones of a.” By doing so, you would have correctly quoted the findings of the archaeologists.\nThank goodness there are intelligent amateurs prepared to challenge inconsistencies in the work of professionals.\n\n","date":"April 8, 2015 at 5:33 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195772","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Hugh, where did you see me including myself among “eminent people”? Did you read what I wrote on this blog some days ago, on why I am qualified to write on the topic? That is why I am defending what you call “eminent people”, meaning respected biblical archaeologists and scholars.\nNow, it seems that you consider yourself an “intelligent amateur”. Fine. Let us read any paper you publish. It better be good, because none of the eminent Shroudies agree with you.\n\n","date":"April 8, 2015 at 5:53 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195778","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"BTW most if not all the time only arch-miraculists who are anti-fraudulists and and anti-fraudulists who anti-miraculists take centre stage in general in the media and in particular in the Shroud blogosphere (see lately e.g. Alan Whanger vs Hugh Farey on Premier Christian Radio). Can solely a miracle or fraud really account for the TS image of a stiff rigid bloodied corpse of a crucifixion victim?\nThis schizophrenic Shroud approach leaves no room at all for any Middle Way Approach such as my Halakhistic Approach that is the most likely to be archaeological stricto sensu in terms of image formation process.\n\n","date":"April 8, 2015 at 3:55 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195760","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"I agree about the media. Polarized viewpoints create tension and thus make for more dramatic media events. Middle ground views are blasé to media producers. Nobody wants to watch a person on TV say, “To be honest, I don’t know.”\n\n","date":"April 8, 2015 at 4:00 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195761","author":"David Goulet","site":"shroudstory"},{"title":"Easter Ink","post":"No wonder even Barrie Schwartz complained about the comments on this blog last week, in the thread where Dan posted something about bilirubin and I commented that it would be better if only professionals in the field commented.\nThere are too many amateurs questioning the work of well-known professionals, in the case of bilirubin Dr.Alan Adler came under fire, now it the archaeologists and biblical scholars.\n\n","date":"April 8, 2015 at 4:31 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195764","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Your comment really rankles with this one-time bilirubin specialist (published) Louis. You’ll see why if you read the entire comments thread on the posting you cite.\nhttps://shroudstory.com/2015/03/28/is-bilirubin-still-accepted-as-an-explanation-for-the-red-blood/#comments\nI shall leave it at that, having better things to do than bang my head against one of sindonology’s brick walls.\n\n","date":"April 8, 2015 at 5:19 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195769","author":"Colin Berry","site":"shroudstory"},{"title":"Easter Ink","post":"Hi Colin\nThe comment was not directed to you because you are at least an expert in the nutrition industry and do understand about chemistry. I aimed at those commenting on biblical archaeology and biblical studies, who are targeting respected scholars.\n\n","date":"April 8, 2015 at 5:27 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195771","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Hello again Louis. It was your comments specifically regarding Barrie Schwortz’s version of what Alan Adler said, or was alleged to have said that stuck in this craw. Most of my research career was spent as a biomedical scientist, continuing to function as such when working for a major UK food research association with direct Government funding where I was head of nutrition and food safety.  The “bilirubin story” is total codswallop, as I’ve said repeatedly, and Alan Adler was not a “blood expert” as Barrie claims, but a synthetic organic chemist specializing in porphyrins, something entirely different.  Adler had no experience or expertise in bilirubin, and failed to do the definitive tests to show its presence in centuries old blood. Yet Barrie continues to proselytize the false bilirubin story, totally impervious to what appears on this site and elsewhere.  This is not right. In fact it’s galling to this one time bilirubin researcher (University of Pennsylvania Hospital Medical School), given Barrie’s title of President of the Shroud of Turin Research and Education Association. It’s time he stopped disseminating that “bilirubin is what makes the  blood stay red” myth. It’s an egregious example of pseudo-science – the agenda-driven variety.\n\n","date":"April 8, 2015 at 5:46 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195775","author":"Colin Berry","site":"shroudstory"},{"title":"Easter Ink","post":"Colin, both Barrie Schwortz and Alan Adler were members of STURP, in fact it was the latter who convinced the former about some things about the Shroud and he also had influence on Avinoam Danin. Three Jews with no axe to grind, each one contributing to Shroud studies based on their expertise.\nAdler was a very serious scientist and also erudite, he could talk about subjects that were very different from his field.\nI proferred a suggestion about any differences in the colour of the blood seen on the Shroud and the Sudarium:\n https://www.academia.edu/11804110/Is_the_Sudarium_of_Oviedo_the_key_to_unraveling_the_mystery_of_the_Shroud_of_Turin\nWell, being Christian, it also has something to do with what is in the introduction. We have gone much beyond Bultmann and Schweitzer today, today’s scholars, even Jewish ones, do not question Jesus’ healing and curing activity. He was hated and feared by the religious authorities for this reason. British-born Israeli archaeologist Shimon Gibson says that it is this activity that led to the crucifixion. I believe that the divine power in Jesus could manifest itself even in an involuntary manner, in life — and in death. You will also find this in the introduction.\nYou mentioned “spontaneous combustion” in one of your previous comments and that is a term used in Parapsychology, which I studied for a while, doing two courses with different parapsychologists,also some on-site research, observing weird rituals, strange behaviour and other things in Spiritualist sects. Parapsychological phenomena cannot be tested in a laboratory, to be genuine they have to be spontaneous.\nIt doesn’t seem to apply to the Shroud image.\n\n","date":"April 8, 2015 at 6:53 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195784","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Oh dear. There’s a lot of extraneous material there Louis that has little or nothing to do with the science, You are free to use the site if you wish to communicate your world view, with its particular blend of philosophy and theology, but it was Paolo Di Lazzaro’s press release back in 2011, prompting us all to consider the implications of his laser result for philosophy and theology that prompted this blogger to focus almost entirely on ‘sindonology’ and its modus operandi, 90% or more of which I consider to be agenda-driven pseudo-science. One’s philosophy or religion does not prevent one from promoting agenda-driven pseudo-science and in some cases may be fuelling it, though I for one make no attempt to understand the particular mindset that is operating. As far as I’m concerned, the distinctive modus operandi of science is to propose a plausible hypothesis, and then to test it, either by researching the available literature, or by performing one’s own experiments if the literature fails to provide answers. I go one step further (call it an idiosyncrasy if you like) which is to think aloud here or on my own site, such that folk know what hypothesis and what working model is currently being tested. If nothing else, it shows the explanations for  TS properties that invoke the supernatural, like Di Lazzaro’s for image superficiality, or which foist a 2000 year old provenance (like Adler’s for ‘trauma’ bilirubin/methemogbin or Rogers’ for starch/saponin coated linen and putrefaction gases) are by no means accepted or indeed acceptable by those of us with a training and career in biomedical science at least the equal of the STURP team members, many of whom could be said to have been self-appointed (or chum-invited). That is not to denigrate STURP’s leading lights at all, merely to inject a note of down-to-earth realism. Were you aware that Alan Adler did not in fact accompany the STURP teams to Turin, and worked on sticky tape samples provided to him by Rogers? Were you aware that Rogers, fine chemist though he was, had no doctorate or any other formal training/supervision in research methods? Were you aware that Barrie Schwortz is a photographer, not an educationist or researcher as his current title might suggest. As I say – let’s keep feet on the ground shall we, and cease putting individuals up on pedestals, whether alive or no longer with us.\n\n","date":"April 9, 2015 at 12:48 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195798","author":"Colin Berry","site":"shroudstory"},{"title":"Easter Ink","post":"Hi Colin\nI am back to the blog and noticed your comments only now. I introduce something on theology or philosophy while commenting on the Shroud only when it is necessary. You have aimed at Di Lazzaro, but in the interview he did not mix anything, it is clear there. If you read it carefully you will notice that he is even ready to accept any missing “ingredient” in the Maillard process,which Ray Rogers toyed with. I, not him, spoke against this hypothesis, also giving the reason.\nAs for worldviews, remember that you wrote on this blog about why you believe we live in an universe where there is no sign of a (good) deity, although you are also willing to listen to what others may say. Your reaction to the world as we find it was dwelt upon in the introduction to the interview, and can apply to you as well, although you are not Christian. I did not go further because the interview was about science and the Shroud image, not about theology or philosophy. The topic will be dealt with more comprehensively in the future.\nRegarding STURP, I do think they did a good job, with the best equipment available during the period and no one is denying that further testing is needed. But I think that will be needed just to fill some gaps.\n\n","date":"April 9, 2015 at 12:48 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195862","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"How Christian is it to go sticking labels on people you have never met Louis, except on web forums?\n\n","date":"April 9, 2015 at 1:22 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195868","author":"Colin Berry","site":"shroudstory"},{"title":"Easter Ink","post":"Where is the label, Colin? If you are referring to your worldviews you stuck a label on yourself. My comment above was based on what you wrote about your worldviews, nothing more.\n\n","date":"April 9, 2015 at 1:43 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195869","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"The closest I can find to a definition of Christian is “someone who believes in the unique significance of Jesus”. I don’t ever recall discussing on this site whether Jesus had a unique significance or not, and if I had would have said that “significance” means different things to different people. That said, you will not hear me attempting to label anyone as Christian or not a Christian unless they themselves had volunteered a label.\n\n","date":"April 9, 2015 at 1:55 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195870","author":"Colin Berry","site":"shroudstory"},{"title":"Easter Ink","post":"Colin, from a dictionary published at your end:\nhttp://www.oxforddictionaries.com/definition/english/Christian\nThat is what I meant by “Christian”.\n\n","date":"April 9, 2015 at 2:17 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195872","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Hi Colin\nTake it easy, you now know that no offence was intended.\nThere are some good Christians at your end, who both believe and put into practice. No one less than HRH Prince Charles:\nhttp://www.catholicherald.co.uk/news/2015/03/06/prince-charles-gives-money-to-children-of-21-coptic-martyrs/\n\n","date":"April 9, 2015 at 6:55 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195885","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"No, Louis, with the greatest respect, we were targeting you. See my comment above. Once we had the words of the respected scholars themselves, we agreed with them. It is you, it turns out, who rejects them. The idea that one in ten tombs may contain a Jesus son of Joseph is based entirely on the data of L.Y. Rahmani, who “is not a statistician and his catalogue is outdated.” If this is true, then Feuerverger and Pfann’s probabilities (which you accept) are based on unreliable data, and ought to be rejected. What a paradox. Thank goodness for amateurs!\n\n","date":"April 8, 2015 at 5:50 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195776","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Hugh, read my comment above. Rahmani’s work is not up to date, there is also work by Figueroa. Pfann corrected Rahmani’s reading of the “Mariam kai Mara” ossuary and he accepted it. Feuerverger and Pfann never depended entirely on Rahmani’s data, the latter is a known scholar and very careful in what he says. Above all, he knows what to expect,based on other studies. Other scholars tend to agree with him, and you should have known that. I think you did not read Talpiot III.\nWhat did you mean by “we”? Whose spokesman are you?\n\n","date":"April 8, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195779","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Louis, believe me, I have read all your comments and your papers very carefully. You confused tombs with ossuaries and inscriptions with bodies, to the extent that if your statistic was taken seriously not only were 10% of the male population of Israel “Jesus, son of Joseph” but also that there should be 200 inscriptions confirming that. Daveb was the first to say that this was absurd, and after much research, I was able to explain how the error occurred.\nYour erroneous comment was, I am absolutely certain, more of a ‘mental typo’ than what you seriously thought, and your basic point, that the inscriptions on the Talpiot ossuaries do not statistically amount to convincing evidence that Christ was buried there, is entirely valid.\nIn future, in the unlikely event that some rank amateur such as myself or daveb has the temerity to challenge any more of your work, it would be good to check exactly what he is questioning, and explain exactly why his question is invalid, before trying to fob him off with persiflage. You never know, he may, in fact, be correct. Again.\n\n","date":"April 8, 2015 at 6:31 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195781","author":"Hugh Farey","site":"shroudstory"},{"title":"Easter Ink","post":"Hugh, the point that both you and daveb ignored is that the scholars were also taking ossuaries that have not yet been found into account. Their opinion was also based on other studies and, please, the statistics are not mine, I merely cited their views. You know how many Patricks there are in Ireland, how many Thomases there are among the Syro-Malabar Christians in South India. It is something like that.\n\n","date":"April 8, 2015 at 7:13 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195786","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"There’s an expression common in North American slang: “My bad.”  When used it signifies that one has made an error, that one owns that error, but also that one is not going to dwell on it – because no one is perfect. Somehow it is easier to say “My bad.” than “I was wrong.” or “I’m sorry.” \nI think some folks on this blog might want to borrow that slang rather than back themselves into corners unwilling to concede a single point.\n\n","date":"April 8, 2015 at 8:14 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195787","author":"David Goulet","site":"shroudstory"},{"title":"Easter Ink","post":"Bernard Werber in “Encyclopedie du savoir relatif et absolu” wrote: “Between what I think, what I want to say, what I believe I say, what I say, what you want to hear, what you believe you hear, what you hear, what you want to understand, what you believe you understand, what you understand…there are 10 possibilities that we might have some problem communicating. But let’s try anyway.”\n\n","date":"April 9, 2015 at 5:56 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195828","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"Max, that is so profound, and ought to be written up large.  “But let’s try anyway” clearly demands a great deal of patience and tolerance, and sledging others’ attempts does nothing to help it.\n\n","date":"April 9, 2015 at 2:57 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195874","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"There are attempts by people on this blog acting like self-appointed judges to try and drop ugly hints in order to target commenters. I know why this is being done and am just waiting for any repetition to post what I have learnt and put an end to it.\n\n","date":"April 9, 2015 at 5:19 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195881","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Louis, if you want an example of “an ugly hint” or a “self-appointed judge”, I suggest you reread your comment, and you might look in a mirror.  I for one am less interested in the personae of commenters as such, than in what they have to say, and responding to the substance of what is said.  Ugly hints are unlikely to deter me from doing so again at any time in the future.\n\n","date":"April 9, 2015 at 10:32 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195898","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"David, who said the reference was to you? It seems that you have a guilty conscience. You want to push people out of this blog, and had success when it came to one Oxford don. Fine, continue with your provocations and read the following for a start:\nhttps://shroudstory.com/2013/06/04/the-writing-on-the-shroud-a-stephen-jones-update/\n\n","date":"April 10, 2015 at 9:52 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195939","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"As far as I’m concerned Davor left the blog of his own free will, after it seems the kitchen got too warm for him with  predictable responses to his mockery, and is free to return to it at any time whenever he recovers from his hypersensitive hostility, his choice.  The subsequent bitter malignancy of his comments directed against me personally on his own blog far outweighs any statement of mine, but I’ve chosen to ignore it.  All of that is now ancient history, so why raise it?  As I stated, I am less interested in the personae of individual correspondents than in what they have to say on the subject at hand.  And I need no personal psychologising from those unqualified!\n\n","date":"April 10, 2015 at 3:27 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195961","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"Re: Personal psychologising:\nThat contradicts what you yourself stated on this very blog not long ago.\nRe: Comments.\nI will continue to defend well-respected professionals in their fields against attacks by amateurs,if and when the need arises.\n\n","date":"April 10, 2015 at 3:35 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195963","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"With no sound reason you accuse me of having a guilty conscience and also of misanthropy against others on this blog.  I read that as a hostile weak attempt at personal psychologising from a person unqualified in that particular discipline!\n\n","date":"April 10, 2015 at 7:29 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195994","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"What discipline are you qualified in? Don’t forget, you indulged in personal psychologising on this blog.\n\n","date":"April 10, 2015 at 7:47 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195999","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"… and was rightly chastised for it! \nIt is human to make an error; it is gracious to admit it; it is obstinacy to continuing denying it.  Experts frequently make errors (Hal Hellman’s “Great Feuds …” series)  Lay persons, including journalists, may misinterpret experts.  If any archaeologist ever said that 1 in 10 ossuaries could be expected to have a certain inscription, it was a careless throwaway line of no significance and no consequence, and an error to believe otherwise.  You will have to continue your apparent vendetta against me alone, as I have no further use for it.\n\n","date":"April 11, 2015 at 2:48 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-196068","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Easter Ink","post":"It was you who started this vendetta,and I have no use for it. No one misinterpreted experts, what the expert in question said is clear and was accepted by other experts and it is no surprise because they were talking about the common pool of name during the period.\n\n","date":"April 11, 2015 at 3:29 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-196070","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"On April 8, 2015 at 3:03 pm David Goulet wrote:\n“Perhaps we should lobby schools to drop their chemistry labs and switch over to experimental archaeology — so much cheaper. Why do real science with all those costly materials when you can produce synthetic thought experiments for free.”\nMethinks David has not the foggiest notion of what state-of-the-art reconstruction of the Sindon’s Man specific burial and INTUITIVE (NOT ‘synthetic’!) thought experiment are all about. If the latter is for free (yet demands a very deep knowledge of the subject matter –an excellent descriptive knowledge of the artefact included), the former (experimental archaeology) is painstaking and can be costly. For instance to really check out my purifying/drying (halakhic) fumigation hypothesis and ascertain which image formation process is the most likely, it would require:\n– one set of at least two ad hoc ‘pre-burial’ pieces of cloth (one alike the Argenteuil tunic another alike the Oviedo Sudarium) in order to account for the fact not only heavy perspiration and secretions can have partially washed away the bloodied body but pre-burial cloth contact and pression too can have also partially wiped up the blood.\n– three sets of ad hoc burial shrouds (at least one long inner burial sheet replica of the Turin Shroud woven on Late-Antique handloom and with residual starch and “soapweed”) + a face cloth and a skull-cap both used as outer NOT inner shrouds + an outer shorter burial sheet the length and width of the Shroud of Compiegne plus the Sindon Munda from Kornelimünster since they are two halves of one original burial sheet + an all wrapping outer burial sheet the length of the Kornelimünster Sudarium)\n– a full body silicone medical mannequin realistic of the TSman (to be filled with heated water to simulate body and body hyperthermia temperatures if need be) and fully jointed neck, shoulders, elbows, wrists, knees, and ankles (to provide a deathlike range of similar rigor mortis positions).\n\n","date":"April 10, 2015 at 5:53 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195923","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"Typo: a full body silicone medical mannequin realistic REPLICA\n\n","date":"April 10, 2015 at 5:55 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195924","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"Reminders:\n(Re the TS man dressing in shrouds and the Halakha)\n All parts of the body should be wrapped-up (not just loosely draped)\n(see Naḥmanides, Torat ha-Adam; Inyan ha-hoẓa’ah). \nOn January 30, 2015 at 7:44 am, I wrote:\n(Re cloth-to-body contact and slight loss of contact through drying out and shrinking due to fumigation)\n“The Turin Shroud bloodied body image implies at least TWO (slightly) different configurations of the long burial cloth in close conjunction with the corpse, not just one from beginning to end as far as the bloody body formation process is concerned (the two slightly different configurations sort of operated a geometric distorsion in the resulting superimposition of the blood decals and body images)”\n(Re aged/archaeological human blood looking as if shed the day before)\nIt is definitely not human fresh blood (no matter how red it could look). It can be degraded through a specific burial ritual, which most likely is the case here.\nOn January 29, 2015 at 8:41 am, I wrote:\n“Bood intensifiers (such as pre- or light mordanting, carbon monoxide liberated along with smoke in the course of a Judean ritual in the shape of fumigation/burning aromatic aloetic woods/myrrh etc) could account for the aged/archaeological blood colour changing (upon exposure to bright sunlight or UV exposure) from standard old brownish to bright carmin red via brownish mauve.”\nAnd on March 16, 2013 at 11:40 a.m. (#5 Reply) and 7:35 p.m. (#21 Reply), I also wrote:\n“As far as the archaeological bloodstain pattern analysis is concerned:\n– Natural mordanting of dry blood remoistened with aqueous alkaline solution along with drying through myrrhic-aloetic (wood aloe) fumigation could account for:\n– The aged bloodstains still “looking fresh” today when seen in full day on the long inner burial cloth as if the blood had just been shed the day before. Mordant is known to be used for INTENSIFYING STAINS e.g. in cell or tissue preparations\n– Potassium giving only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) giving strong signal. Now it is well known gelatine is a breakdown product of collagen. The true fact is low temperature (55°-85° C) alkali gelatinisation of starch residuals present in the ancient linen cloth could be a possible factor as bubbling very fine printing paste to be taken into account in the Shroud image formation process.\n– Bilirubin is neither the problem nor the solution, just probably one part of the whole equation as it could have been trapped (along with carbon monoxide?) during the pre- or light mordanting process.\n– Most likely dust, dirt and body fluids should be found in the very impurity layer that makes up the body image.”\n\n","date":"April 10, 2015 at 7:13 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-195927","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Easter Ink","post":"Talpiot IV will soon be written. It is important to note that archaeologist Shimon Gibson said that “Jesus and Joseph were extremely common names at that time. You could have two, perhaps, three Jesuses within the same extended family,” quoted in a previous article. Gibson had rejected the Talpiot tomb theory as soon as it was announced. He believes that Jesus’ healing and curing activities were a threat to the Temple authorities and led to his crucifixion.\nThe geologist Shimron has not published a peer-reviewed paper, at least not yet. His field is plaster, not limestone ossuaries.\n\n","date":"April 12, 2015 at 7:55 am","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-196126","author":"Louis","site":"shroudstory"},{"title":"Easter Ink","post":"Earlier today, Professor Oulis of Jerusalem University, specialist reader in applied statistics of Jewish burial practices announced an amazing new discovery of a tomb complex in downtown Jerusalem following excavations for a new high-rise tourist corporate hotel.  \n“What was unusual about the complex,” said Professor Oulis, “is that it appears to be the burial site of an unusual 1st century Jewish clan where nearly all of the males seemed to have been named either Youssef ( = Joseph) or Yeshua ( = Jesus).”  \nSome 45 ossuaries were discovered in total.  Consistent with other such discoveries, only 15 had inscriptions, of which 6 were female clan members.  Of the 9 male ossuaries, at least one of the names Yeshua or Youssef appeared, and on five of them both names appeared.  Two of these ossuaries were of brothers with pet names Yeshu and Youssi.  In one case the bones were identified as Yousefus cousin to Yeshuus.  Of the two remaining ossuaries one was identified as Youssef bar Yeshua, and the other Yeshua bar Youssef.\nProfessor Oulis discounted the likelihood that the ‘Yeshua bar Youssef’ box could be that of Jesus of Nazareth.  “The names were very common in 1st century Jerusalem”, he explained, “although admittedly this is a very unusual case.”  However,” he continued “We will need to review our statistical approach.”  \nHe referred to previous published papers where the expected occurrence of this particular inscription was said to be 1 in 10.  “Clearly,” he said “Even under the most favourable conditions, as at this tomb complex, the rate cannot be more than 1 in 45, and even this is exceptional.” \nIt has not been possible to verify Professor Oulis’ claims, as early after the arrival of the archaeologists, an influx of Haredim, opposed to such excavations, assailed the party, pelting them with stones.  The tomb complex has accordingly been shut down, and the architects are now working on a new design for the proposed hotel which will bypass the tomb site.\n\n","date":"April 12, 2015 at 4:03 pm","url":"https://shroudstory.com/2015/04/05/easter-ink/","cat":"press_coverage","id":"comment-196153","author":"daveb of wellington nz","site":"shroudstory"}]
