[{"title":"Feature Story in National Geographic","post":"I am very happy for Dr. Paolo di Lazzaro. He won an award for outstanding scientific activities from the Italian Physics Society years ago. He did not mix science with religion and explained how he and his colleagues proceeded. National Geographic chose the right scientist, on whose experiments they based their report.  https://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"April 18, 2015 at 11:09 am","url":"https://shroudstory.com/2015/04/18/feature-story-in-national-geographic/","cat":"article","id":"comment-196711","author":"Louis","site":"shroudstory"},{"title":"Feature Story in National Geographic","post":"Latest news on the Shroud exposition:\nhttp://news.yahoo.com/turin-shroud-goes-back-display-faithful-curious-132156639.html\n\n","date":"April 18, 2015 at 12:12 pm","url":"https://shroudstory.com/2015/04/18/feature-story-in-national-geographic/","cat":"article","id":"comment-196721","author":"Louis","site":"shroudstory"},{"title":"Feature Story in National Geographic","post":"Supporting Dr. Ray Rogers’ statement:\n“The crystal structure of the flax fiber of the Shroud shows the effect of aging, but it\nhas never been heated enough to change the structure. It has never suffered chemically significant radiation with either protons or neutrons. No type of radiation that could produce either color in the linen fibers or change in the C14 content (radiocarbon age) could go unnoticed. All radiation has some kind of an effect on organic materials. This proves that the image color could not have been produced by thermal or radiation-induced dehydration of the cellulose. Image formation proceeds at normal temperatures in the absence of energetic radiation of any kind.”\n\n","date":"April 18, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/04/18/feature-story-in-national-geographic/","cat":"article","id":"comment-196748","author":"Andy","site":"shroudstory"},{"title":"Feature Story in National Geographic","post":"On another thread Colin jokingly said I was indulging in hagiography. I told him why it was not so and also why NG, and myself before them, were impressed with Dr.Di Lazzaro’s  research. Much in the same way, I was told that there a cult-like devotion to Rogers  in some circles in the US, in which I also do not take part. It is also not clear where exactly Ray Rogers obtained his doctorate. If this information is received I will refer to him as “Dr” from now onwards.  \nOnce again, Dr. Paolo Di Lazzaro never said that his experiment demonstrated that the Shroud image was produced with radiation. It was I who wrote “radiation-like” because laser was used.\nWe must keep one thing in mind: If it IS Jesus no amount of science will demonstrate what EXACTLY happened. The disciples who were with Jesus when power left his body INVOLUNTARILY to cure the woman with the haemorrhage in a SPLIT SECOND, that is, INSTANTANEOUSLY, did not ask questions. They saw, and believed, because the woman told them what had happened. \nSo, if it IS Jesus we, and among us twenty-first century sceptics, are asking questions, or the “question of questions”, that will probably never be answered. The introduction to the interview mentions how the dormant divine power inside the dead JESUS may have been activated by the Father at the INSTANT of the Resurrection. God is not subject to time, we humans are. \nThere is no indication of radiation, but neither are there signs of ingredients involved in a Maillard reaction, impurities, light, normal temperature, high temperature…\nNG is a first-class magazine, many people came to know about the Shroud after reading their first article on the relic. They of course have journalists trained in science. If they chose to highlight Dr.Paolo Di Lazzaro’s experiment, obviously after much research, including the experiments made by Ray Rogers, they knew what they were doing.\n\n","date":"April 18, 2015 at 5:34 pm","url":"https://shroudstory.com/2015/04/18/feature-story-in-national-geographic/","cat":"article","id":"comment-196754","author":"Louis","site":"shroudstory"},{"title":"Feature Story in National Geographic","post":"I like how they label the “Pocker holes” as Probably before 1200. I assume this is in reference to the Pray Codex.\n\n","date":"April 18, 2015 at 11:15 pm","url":"https://shroudstory.com/2015/04/18/feature-story-in-national-geographic/","cat":"article","id":"comment-196781","author":"MikeM","site":"shroudstory"}]
