[{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Proven as a fake??  Couldn’t careless about Joe Nickel. He’s not even a scientist. Just another Charles Freeman with no background in science.\n\n","date":"April 25, 2015 at 5:34 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197489","author":"don","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Don,\nYou said it all.\nhttp://johnklotz.blogspot.com\n\n","date":"April 25, 2015 at 6:25 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197495","author":"John Klotz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Come on, now, Joe. Here you go again. You insist on holding back. How was the image formed? Now, tell us. Don’t keep us i the dark any longer. Put an end to this bickering. Tell us, Joe.\nAnd while you’re at it, please let us know how the Medieval forger traveled to  and from the Holy Lands to secure pollen from plants which only grow in and around Jerusalem.\nPretty crafty forger, wouldn’t you say? He actually had the presence of mind to foresee that 600 years later we would have the science capable of detecting the find pollen residue on the Shroud, thereby leading to endless discussion of his ingenious forgery.\nNow come on, Joe. Enough of this! Stop hiding! Tell us once and for all.\n\n","date":"April 25, 2015 at 7:04 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197503","author":"leon ward","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"The pollen is meaningless unless you can show a chain of custody. Someone from Jerusalem in the last 700 years could have traveled to where it was, carrying pollen on him and touch the Shroud. The Shroud could have traveled at some point to Jerusalem and picked it up in the last 700 years. Each is very possible .\n\n","date":"April 25, 2015 at 8:11 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197514","author":"John Green","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"PS In no way do I agree with most of the statements made by Joe. .\n\n","date":"April 25, 2015 at 8:22 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197515","author":"John Green","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Actually, the pollen is meaningless for a completely different reason.  \nRecent (as of 2014) studies reveal ancient pollens cannot effectively be identified visually because pollens change shape over time because the internal structure breaks down and the external pressure causes the change.\n\n","date":"April 25, 2015 at 8:51 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197522","author":"Andy","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"The Campo Santo in Pisa is a burial ground made up entirely of earth brought from the Holy Land in the Middle Ages. The way that the pollen on the Shroud is distributed in ine place suggests that it may too have been brought in from the outside at some point. So John Green’s point is very relevant.\nI am in Mantua, in a flat overlooking Sant’Andrea where they have vessels contesting the blood of Christ collected from the ground under the Cross. The veneration takes place every year with great ceremony and processions.\n  That is one thing I love about Italy: wherever I am there is some relic claimed to be from the Passion or the life of the Virgin Mary  that is still venerated. The interesting thing is why the Shroud has a following outside Italy when most of the other ‘authentic’ relics do not.\n\n","date":"April 25, 2015 at 9:10 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197523","author":"Charles Freeman","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"“Recent (as of 2014) studies reveal ancient pollens cannot effectively be identified visually…” That’s interesting, Andy, but I’m not sure it’s true, or at least not completely, or at least not always. Pollen has been widely used for years to identify flora in soil samples which are millions of years old. See http://www.sciencedirect.com/science/article/pii/S0034666714001791 for a paper as recent as this April. Can you reference the ‘recent study’?\n\n","date":"April 25, 2015 at 11:01 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197536","author":"Hugh Farey","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Nickell wrote (for the umpteenth time) “STURP’s leaders served on the executive council of the Holy Shroud Guild, which is devoted to the ’cause’ of the reputed relic.”  Does he really think that could have been enough for the STURP group as a whole to say the image was not made by the hand of man?  The group had Jews, atheists and agnostics.  They worked in the country’s space and nuclear programs.  To imply that because STURP’s leaders were part of the Holy Shroud Guild, the group as a whole couldn’t come to any objective conclusions is ludicrous.  Has anyone ever seen Nickell mention that Luigi Garlaschelli, an Italian who has supposedly shown how the Shroud could be faked, has his work sponsored by an Italian atheist group.  Of course, Garlaschelli has claimed that has no bearing on his work.  Apparently no double standard here.\n\n","date":"April 25, 2015 at 8:25 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197516","author":"Joe Marino","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Hey Joe, if it appears to be inappropriate, well darn it, it must be.  Is there another conclusion one can come to?  I am being facetious since STURP were experts doing real science.  It certainly can be criticized, but it would be better if that criticism were scientific by experts in their fields, not a general blanket statement of alleged complicity.\n\n","date":"May 26, 2015 at 11:22 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-200308","author":"Dcn Andy","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"As frequent readers will know, I tend to be a staunch supporter of the generous attitudes of most non-authenticists. However, there are a few who seem to think that, having convincing evidence of the Shroud’s inauthenticity, then any counter evidence can be rejected without being considered on its own merits. Joe Nickell seems to be doing it here. He cannot be accused of ignoring counter evidence, but his conclusions give me the impression that he rejects it ‘because it must be false’, and not because of its internal inconsistencies. If the Shroud is not authentic, then he is correct that it is false, but anyone interested in getting to the bottom of the mystery would surely want to find out why.\nOne of Joe’s arguments is that “A secret commission appointed in 1969 to study the shroud examined the “blood” stains, which are suspiciously picturelike and still red. Internationally known forensic serologists reported that the red substance failed all microscopical, chemical, biological, and instrumental tests for blood. Instead, there were reddish granules that would not even dissolve in reagents that dissolve blood.” He knows very well that as long as the reddish granules did not dissolve, then of course all the tests for blood would fail. What he ignores here is that the 1978 scientists did manage to dissolve the reddish granules, and performed a number of tests which they said indicated the presence of blood. Some sort of discussion is required to resolve this apparent contradiction, but Joe does not engage in it.\nOn the other hand, Leon is not doing the authenticist cause any favours by spouting the old “if you can’t do it your way, it must have been done my way” mantra.\n\n","date":"April 25, 2015 at 8:38 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197518","author":"Hugh Farey","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Hgh:\nDo you really believe that a team of experts in testing blood (1969) don’t were aware that their experiment failed in such a primary variable? \nThe problem of the tests in 1969 and 1978 was other and the same. No specific test for ancient blood was made.\n\n","date":"April 25, 2015 at 11:39 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197538","author":"David Mo","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"“Hgh:\nDo you really believe that a team of experts in testing blood (1969) don’t were aware that their experiment failed in such a primary variable?\nThe problem of the tests in 1969 and 1978 was other and the same. No specific test for ancient blood was made.”\nHugh is true.\nDavid, please read honestly the conclusions of this commission.\nCan you understand that there was, at the time, no specific test test for centuries-old blood.\nIt seems that you are aware of “specific tests for ancient blood”.\nI would like to know something about those ‘specific tests for ancient blood’ ???\n\n","date":"April 25, 2015 at 3:48 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197568","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"I have read some articles both in Spanish and English. \nSome examples in English: \nCarney D. Matheson, Jay Hall and René Viel:  “Drawing first blood from Maya ceramics at Copán,Honduras”, in  Michael Haslam,Gail Robertson,Alison Crowther-Smith,Sue Nugent,Luke Kirkwood eds.Archaeological Science Under a Microscope: Studies in Residue and Ancient DNA Analysis in Honour of Thomas H. Loy, ANU Press Library, 2009.\nJOCELYN KAISER “Blood from Stones Tests for prehistoric blood cast doubt on earlier results”, Science News, June 17, 1995 \nMarek Janko, Robert W. Stark and Albert Zink: “Preservation of 5300 year old red blood cells in the Iceman”, J R Soc Interface. 2012 Oct 7;9(75):2581-90\nAlbert T. Vish: “Blood Residue Studies Synthesis”, https://www.deldot.gov/archaeology/blue_ball/pdf/piedmont/series180_app_f.pdf\nI am not an expert in Archaeometry but I think that these studies above are some clear samples of the difficulty of testing ancient blood. In any case, all use different methods of those of Adler and Heller. I have searched for some specialized article in Archaeometry that quoted Adler and Heller and I have not found anyone. Their theory seems to be a mere speculation without sufficient experimental contrast. \nMy conclusion (once again): let the specialists work on specialized matters. Then we will be able to judge on some aspects. Maybe. Or not.   \nPS: I am in the habit to be honest in my statements. So I ever try to read “honestly”. And you?\n\n","date":"April 27, 2015 at 1:50 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197699","author":"David Mo","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Interesting, David. The first sentence of your link to Vish is:\n“The modern history of testing for blood on archaeological artifacts begins with Thomas Loy’s\n1983 article in Science (Loy 1983).”\nor seven years later than Heller and Adler. Although Heller and Adler’s findings may be controversial, they were pioneering a discipline that had yet to find its feet, and their efforts were as comprehensive and praiseworthy as could be expected at the time.\n\n","date":"April 27, 2015 at 1:59 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197701","author":"Hugh Farey","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"On the pollen. Max Frei’s over-specific identification at species level and the necessity of travelling to Turkey and the Middle East to find type specimens calls into question his methodology. There were very few type specimens to compare pollen with in 1978, and by his own account he had to collect his own. By only having Middle Eastern specimens to compare his pollen with, he assumed that when he found an apparent match, that the species had been identified. My contention is that had he travelled to Brazil or Japan to collect specimens he could have found equally good matches among them, and conclude that the Shroud must have a South American or East Asian provenance. Most thistle pollens look much the same, and there are different species of thistle found all over the world.\n\n","date":"April 25, 2015 at 8:46 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197519","author":"Hugh Farey","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Hugh, but you are aware Avinoam Danin has expertise in the grains and flowers of Jerusalem and would have been able to distinguish between those grown in Israel and those grown in South America or East Asia.  Some of the plants bloom only at Passover in Jerusalem as you well know.\nSee numbers 3-5\nFlowers of the Shroud of Turin\nhttp://www.patheos.com/blogs/prayergardens/2014/04/flowers-of-the-shroud-of-turin-2/\nBest,\n\n","date":"April 25, 2015 at 9:58 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197603","author":"Angel","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Angel\nIt doesn’t matter unless you can tell us where the Shroud was every day in the last 700 years and every person who came into contact with the Shroud and where they came from. The pollen could have been deposited at anytime during the last 700 years.\n\n","date":"April 26, 2015 at 4:42 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197624","author":"John Green","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Well, yes and no, Angel.\n1) Many pollens look very much alike. Unless Prof. Danin had compared his specimens to type specimens from areas other than Israel, he is likely to make the same mistake as Max Frei. It is not surprising that some of the pollen resembles that of plants that bloom in Spring, as most plants do. What is more surprising is the pollen that comes from plants that bloom in autumn.\n2) Prof. Danin has also identified the imprints of a number of plants on the Shroud, most notably Chrysanthemum coronarium, and ‘an almost continuous carpet of flowers […] most similar in shape and size to flowering heads of Matricaria recutita or Anthemis bornmuelleri.’ None of these is represented in his pollen list.\n3) As most of the pollen is entomophilous, it must have arrived by the flowers being placed on the Shroud. There is very sparse archaeological evidence that this was common practice, no biblical suggestion that any such thing occurred, and gives us an interesting vision of various holy people rushing around the environs of Jerusalem to gather about 20 different species of flowers, some of which only grow on the shores of the Dead Sea, and most of which are extremely unattractive.\nI do not dispute that there is pollen on the Shroud, but, rather like the cotton fibre enthusiasts, until there is rather more explanation and agreement among the palynologists, I cannot consider the evidence convincing.\n\n","date":"April 26, 2015 at 7:19 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197629","author":"Hugh Farey","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Hugh, Professor Danin has defended the work of Dr. Uri Baruch with all his might and he has no axe to grind. As a Jew, his own findings left him sleepless for a while, as mentioned in the book “The Botany of the Shroud”. He is a blunt-spoken former Israeli army officer, not the kind of person to talk nonsense. \nWhat needs to be done is to take what was collected from the Shroud during the controversial restoration and compare it with what is preserved in the US, which is unavailable.\nThe archdiocese of Turin who should take the initiative.\n\n","date":"April 26, 2015 at 8:18 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197632","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Yes, Dr Uri Baruch, on the other hand, did not defend the work of Dr Uri Baruch (himself) and refused to say anything more about it. Another curious anomaly…\n\n","date":"April 26, 2015 at 9:20 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197640","author":"Hugh Farey","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"That is because he left the field is now working with computer science. By the way, is that debate with Dr. Whanger available in CD?\n\n","date":"April 26, 2015 at 9:28 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197641","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Alas no. It’s a podcast a Premier Christian Radio – http://www.premierchristianradio.com/Shows/Saturday/Unbelievable/Episodes/Unbelievable-Is-the-Turin-Shroud-the-burial-cloth-of-Christ-Alan-Whanger-vs-Hugh-Farey\n\n","date":"April 26, 2015 at 9:59 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197643","author":"Hugh Farey","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"What a pity. I would love to have it inside my files.\n\n","date":"April 26, 2015 at 10:31 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197645","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Joe might want to invest in the flat earth society if he discounts the expert work of STURP.  These are experts in their areas of expertise who took years preparing for and years analyzing the data discovered on the Shroud.  How sad.\n\n","date":"April 25, 2015 at 8:47 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197521","author":"Andy","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"So, assuming that they have not lost or destroyed their precious tapes, why have STURP never had their tests replicated? They cannot expect to be taken seriously as experts if they do not.\n\n","date":"April 26, 2015 at 12:07 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197609","author":"Charles Freeman","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"” So, assuming that they have not lost or destroyed their precious tapes, why have STURP never had their tests replicated? They cannot expect to be taken seriously as experts if they do not.”\nCharles, those precious tapes were very small in size (5 cm2).\nRemember that all the tapes were first given to McCrone who “nearly destroyed the value of the carefully prepared samples” (Rogers).\nThis was the first disaster. \nThen, most of the samples were given to Adler and Heller, who made the best job, given the condition of the samples and their means. Do you know the extraordinary difficulty of Adler’s work ?  \nFinally, after Adler’s death, all of his samples were sent back to Turin by his wife.\nThis was the second disaster.\nDo you understand now why the tests could not be replicated?\nWhat is extraordinary is the fact that STURP could nevertheless give so many reliable data that are even today the basis of any scientific study of the TS.\n\n","date":"April 26, 2015 at 2:54 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197664","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Frankly, David (Mo), I don’t know. I think it was Heller and Adler who suggested that the antiquity of the blood meant that it would not respond to conventional testing, which is why it did nothing in 1973, but was made to dissolve in 1978. Walter McCrone quotes from the report of the tests that were made in 1973 in detail. The red granules would not dissolve in a variety of acid, alkaline or alcohol solutions, and could not have been more negative if they had been iron oxide. However, Heller and Adler managed a variety of successful tests. Some sort of resolution of these two sets of results should be discussed, as I do not believe either group of scientists was lying. You may be correct about “specific tests for ancient blood”. Do you know of any?\n\n","date":"April 25, 2015 at 12:58 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197550","author":"Hugh Farey","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"“However, Heller and Adler managed a variety of successful tests.”\nIf I remember well, some said that the same varieties of successful tests results  could be obtained not only from blood but also  from other substances  so that the tests carried out by Heller and Adler were nothing more than speculative.\n\n","date":"April 25, 2015 at 1:50 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197554","author":"PHPL","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"You are developing the same bad habits as Charles Freeman. “Some say” Some may have said that but Heller and Adler published in a peer reviewed journal and there work, to the best of my knowledge as never been challenged in a peer reviewed journal. Some just don’t say that McCrone was wrong, they have published it. So have I in my book. Chapter 9. “The Blood of the Lamb.” The title is a quotation from scripture: Revelations a/k/a The Apocalypse.\nAre you really a scientist? Is this how you document your research? “Some say?” Seriously? \nStay tuned. I am jammed right now but I find “some say” criticism to be totally disingenuous.\n\n","date":"April 25, 2015 at 2:24 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197560","author":"John Klotz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"If you think that peer review automatically equates to proven or respectability, then you still have a lot to learn.\nThe Shroud of Turin has always attracted much more attention from authenticists than from non-authenticists and one  will encounter much more authenticists than skeptics on this website for example. Believers in authenticity or “Shroudies” as they sometimes call themselves, have always been very vocal and expansive. They have tried to demonstrate by whatever means one can imagine of (controversial scientific tests, weird hypothesis, conspiracy theory, inept mathematical reasoning, biased research, et cetera) that the Shroud of Turin wrapped the body of Jesus Christ. Scientists have better things to do than to study an old cloth whose medieval origin was already written on the walls prior to that monstrous radiocarbon testing.\nThat being said, I don’t have anything personal against shroudies and would be happy to invite any of them   to a good restaurant and discuss with them whilst  enjoying  a good meal and drink . But I also know that some people out there pretend to believe in the Turin Shroud’s authenticity so as to obtain financial gains and I have no respect for them.\n\n","date":"April 26, 2015 at 1:22 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197616","author":"PHPL","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"See my previous comment, please.\n\n","date":"April 27, 2015 at 2:05 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197702","author":"David Mo","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"“… some said …” Some did, indeed. But never, to my mind, quite convincingly. The collection of different substances other than blood required to give all the results reported by Heller and Adler is so complicated a cocktail that it is simpler just to attribute them to blood. A simple mixture of red ochre and rabbit skin gesso would not, I think, be adequate. Furthermore, I don’t know at all how such a cocktail would have responded to the unsuccessful 1973 tests.\n\n","date":"April 25, 2015 at 2:15 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197557","author":"Hugh Farey","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"We have three different results for the problem. Solution: a specialized team with specialized means. Independent of the parts in conflict, of course.\n\n","date":"April 27, 2015 at 2:11 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197703","author":"David Mo","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"So now a stage magician is telling National Geographic what they should or should not publish. How nice.\n\n","date":"April 25, 2015 at 7:04 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197587","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Nickell wrote, “Written by Frank Viviano, the article ‘Why Shroud of Turin’s Secrets Continue to Elude Science’ (2015) is so misleading, so replete with falsehoods, so lacking in basic facts about the notorious ‘shroud’ that it is an affront to the proud name of National Geographic.”\nNickell is always fond of putting certain words in quotes for his particular emphasis, but why does the word “shroud” have to be in quotation marks because whether it is the burial cloth of Jesus or not, it really is a “shroud.”\n\n","date":"April 25, 2015 at 8:24 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197591","author":"jmarino240","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"You speak the truth.  When will people wise up?\nJoe Nickell (self-proclaimed atheist with a heart) is using the psychology of Joseph Goebbels.\n“If you tell a big lie often enough and keep repeating it, people will eventually come to believe it.” \nBest,\n\n","date":"April 25, 2015 at 10:20 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197604","author":"Angel","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"“If you tell a big lie often enough and keep repeating it, people will eventually come to believe it.”  \nYes, yes. Sometimes once is enough.\n\n","date":"April 27, 2015 at 2:26 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197704","author":"PHPL","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"I googled Joe Nickell.He has a PhD in english lit.\nWikipedia: “Nickell has worked professionally as a stage magician, carnival pitchman, private detective, blackjack dealer, riverboat manager, university instructor, author, and paranormal investigator, listing over 1000 personae on his website.”\nI’m not convinced that he has the qualifications and experience to be an ‘authority’ on the shroud. He is not a historian, not a scientist.\nJack of all trades, master of none?\n\n","date":"April 26, 2015 at 3:25 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197621","author":"Thomas","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"I may be simplistic in my approach but there are two items that for me settle the issue: the inexplicable image that matches in great detail the accounts of the crucifixion and that actual existence of aged human blood identified as methemoglobin by scpectral analysis by Heller and Adler. Everything else only guilds the lily. \nAlmost all the other claims support authenticity although they may on an individual basis be arguable. (pollen, coins in the eyes)\nThere is an accumulation of factors about the image and the blood that NO medieval forger could have anticipated or duplicated centuries before they were first observed and documented by the some of the greatest scientific minds of any age,\nThe carbon dating has been thoroughly debunked and contrary to the claims of pseudo-skeptics there is evidence of the Shroud’s existence extending into the first millennium CE\nYet, these two items now form the last defense of the pseudo skeptics.\n\n","date":"April 26, 2015 at 7:53 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197631","author":"John Klotz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"I did two courses in Parapsychology, prompted by personal experience, which convinced me that there are phenomena beyond the visible world, and I am not superstitious. Unfortunately they cannot be laboratory-tested because they are spontaneous. Genuine parapsychological phenomena have to be spontaneous, as Parapsychologists know, and should not be confused with claims made by Spiritualists. One prominent figure who began mixing things was Sir Arthur Conan Doyle, who was Catholic, despite being warned by the Jesuits in England. But that was before the Society for Psychological Research was founded.\nC.G. Jung witnessed the spiritualist sessions of his relatives, which left him unconvinced. He was a co-founder of SPR. Freud warned him about dabbling in these kind of things, misunderstanding the Swiss psychiatrist’s motives. I think that later on, wondering why his former disciple had much interest in paranormal phenomena, he himself began to investigate, in fact began to write about it. He would never admit that C.G.Jung was right, but then what went on his mind is locked up in the archives at the Library of Congress, unavailable for research.\nOne of my professors of Parapsychology had some of his works praised by the Society for Psychical Research and was also a first-class magician. He challenged India’s Sai Baba to perform a miracle in his presence, with scientific control. All he had to do was to fill a cavity, but there could be nothing more than a gesture. The challenge was ignored. The spiritualists were also afraid of him because he began to expose a number of frauds. He showed me a number of tiny coffins, or frogs, with his photograp inside them, black magic rituals. They were placed in front of his institute, probably at night, and he stored them in his museum, the frogs inside bottles with formol. He also studied Satanic sects, like the group founded by Anton La Vey, in Los Angeles and won a debate with a satanist, in the presence of journalists, who also witnessed his encounter with Uri Geller, who also lost. That very day Geller took the first plane available. Destination? Tel Aviv.\nYou have to be really qualified to say that you are a “paranormal investigator”.\n\n","date":"April 26, 2015 at 8:55 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197636","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Louis,\nUltimately science and religion will meet on these issues and find expression for them in quantum mechanics.\n\n","date":"April 27, 2015 at 3:15 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197711","author":"John Klotz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"John Klote\n“Ultimately science and religion will meet on these issues and find expression for them in quantum mechanics.”\nIf you  read the mystical writings of  De Broglie, Sir James Jeans, Werner Heisenberg, Erwin Schroedinger, Max Planck, Wolfgang Pauli and others you would think it already has began. \nFor the last few years I’ve been studying Eastern Philosophy. Right now I’m studying the Kashmir Shaivism school of EP. \nIn his book, “Consciousness is Everything” Swami Shankarananda he tells us that Kashmir Shaivism teaches us that there is only consciousness and that it’s the only substance in the universe. Everything that appears different is just consciousness vibrating at a particular frequency and behaving in a specific way ( sound like string theory or Penrose?). Everything is one. To them Shiva, the divine being, is consciousness itself. And we are all a part of the divine. The divine is in all of us? Isn’t that what Mat 25:35-40 telling us? \nYou can replace Shiva with Jesus if you like. I don’t believe in their gods, or that we are born again but this helps me understand the Bible better.  \nPS Got up this morning and hit my post toe on the bed post, hurt like hell, but it reminded me to write this post. \nI started thinking, all the books I’ve read on neuroscience they tell me that the brain itself doesn’t feel pain. Is it an illusion like some claim consciousness is?  Just neurons firing? We don’t know! Oh and how many neuron connections do we need before something is conscious?  Is a fruit fly conscious? Do we need neurons at all? Is the universe itself conscious? Is what Sir James Jeans said, “the universe begins to look more like a great thought than a great machine.”  Is that true?\n\n","date":"April 27, 2015 at 5:29 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197719","author":"John Green","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Correction\n you would think it already began. \nTo save time all othe typos are intentional\n\n","date":"April 27, 2015 at 5:34 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197722","author":"John Green","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Hinduism is a philosophy of life, not a religion, has eighty schools of interpretations, and a number of contradictions. What you are referring to is “Maya”, illusion, but it is something that the philosophy cannot explain. The god Shiva you refer to, what you say “is consciousness itself”, is the god of destruction in Hinduism.\nNow this does not mean to say that there is nothing good in Hinduism. It has a number of good things to tell us.\nFor further reading I would suggest:\n“Return to the Centre”, by Dom Bede Griffiths, a former\nAnglican who became a Catholic priest and found an ashram in India.\nPluralism can be confusing and there are limits. You can check the works of Professor Gavin d’Costa, of Goan origin, and who therefore knows a lot about India. He is head of the department of theology at the University of Bristol, UK.\n\n","date":"April 27, 2015 at 8:31 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197730","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Louis\nReligion:\n: the belief in a god or in a group of gods\n: an organized system of beliefs, ceremonies, and rules used to worship a god or a group of gods\n: an interest, a belief, or an activity that is very important to a person or group\nI think Hinduism falls under that.\nNext, you can have a philosophy of life with no god or gods. My beleif system is a philosophy so I agree on that point. \nNext, Chistains also has many schools of interpretations and they can’t even agree what books should be in the Bible.\nNext, The Bible also has man many, many contradictions.\nNext, The God of the OT was a;also a god of destruction. Remember the claimed flood? Remember all the times God told the jews to go over here and kill these people? Now go over here and kill those people. Oh and Sliva is also the restorer.        \nI’ve Just added “Return to the Centre” to my Amazon wish list. I think there is about 300 books on it so it may take a while. But it looks interesting so thanks for suggesting that.\nI studied the bible and all the subject about is for about 30 years. I use to read all the debates in Biblical Archaeology Review. I’ve read the Nag Hammadi Library many times(I find the Coptic Gospel of Thomas very interesting). All this made me an agnostic. Many years ago I was debated Christian on the internet. Some of the debates were that the earth is 5 or 10 thousands years ago, dinasaurs and humans walked the earth together, maybe they got that from the flintstones, etc.. That turned me into an agnostic with atheist leanings. I started studying Eastern Philosophy only a few years ago so I’m still new to this. Now I’m a agnostic with Eastern Philosophy leanings.\nHaving a philosophy allows me to pick from many areas. And it allows me to look at the Shroud without at this time to a belief system.\n\n","date":"April 27, 2015 at 9:48 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197737","author":"John Green","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Hi John Green\nI agree to a certain extent with some of the things you said. There seem to be two basic differences between Hinduism and Christianity, the first falls in the category of philosophy of life, the second as revealed religion. It is true that that both have differences within themselves, however the nature is different. You can believe almost everything under the sun in Hinduism, but that is not so in Christianity.\nHave you read anything by Wendy Doniger? She is an expert in Hinduism and her last book on the topic seems to have hit the nail on the head. I think it may be the ideal guide for you.\n\n","date":"April 27, 2015 at 10:25 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197741","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Louis\nHinduism is clearly a religion unless you want to redefine the meaning of religion. Go to Amazon and type in “World Religions” and you will find books which that list Hinduism as a religion. The Norton Anthology of World Religions list Hinduism as a religion. \nChristains believe God revealed things to them and Lord Sliva is claimed to have revealed Tantra to them. Neither one of them can prove a god revealed anything so if that’s the test both are philosophy.\nNow remember I am talking about, Kashmir Shavism and for me I agree that’s a philosophy more than a religion.\nhttp://www.themovementcenter.com/about/philosophical-foundations/\nKashmir Shaivism\n“The practitioners of nondualistic Kashmir Shaivism came to view the world as absolute Consciousness, which they called Shiva. This Consciousness, being both one and free, creative and self-reflective, was revealed as the fundamental I, or Divine Self. Thus, Kashmir Shaivism emphasizes the inner Self. The systematic growth of Kashmir Shaivism unfolded as practitioners reflected on the nature of the highest reality, describing it as pure Consciousness.”\nI have not read anything by Wendy Doniger yet. I looked on Amazon and read some of the reviews about her book, “On Hinduism.”  It has 48% 1 stars and only 21% 5 stars. She is a Professor of Religions so I don’t dismiss her and since I like to read all sides of an issue maybe I’ll read her book, but right now I’m into the Yoga of .Kashmir Shaivism\nNow if the Shourd is proven to be authentic that would put it in a new ball park. I don’t know either way but I kind of like the Kashmir Shaivism idea that the person before me, like me, is part of the divine. And if I can suppress the ego I can find self and the divine within me.\n\n","date":"April 27, 2015 at 11:51 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197755","author":"John Green","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"John\nNothing is really defined in Hinduism, unlike Christianity. This “inner self” concept you refer to leads to selfishness and that is the reason for so much suffering in India, with millions of beggars. They become stoics, accepting the doctrine of reincarnation, believing in the caste system, which has to do with race. This is the legacy of the fair-skinned Indo-Aryans who reached India from central Asia, pushed the dark-skinned Dravidians to the south of the country, but not before mixing the beliefs of both groups to give birth to Hinduism.\nThe “divine within me”  also has to mean “the divine within you”, applying to each and everyone, but that is not so in a country where beggars are often kicked and the charity comes mainly from Christian institutions.\nJesus also dealt blows to the ego, but did not ask people to look for the “inner self”, he asked people to look beyond their egos and towards other people. That is not visible in India.\n\n","date":"April 27, 2015 at 4:37 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197772","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Louis\nMaybe you missed it in my first post on this. I repeat, “I don’t believe in their gods, or that we are born again but this helps me understand the Bible better.”\nI can pick apart things they believe in and I can do the same for what Christains believe in. \nWhat you are saying is as wrong as if I was to say the Catholic Church believes it ok for priest to have sex with young boys and they will just cover it up. \nAnd guess what a Christain nation ruled India untill 1947, shall we blame them for all the problems india on Christains? How about all the suffering evil people caused in the name of Christ, does the  Spanish Inquisition  ring a bell?\nLouis give us your data that supports your claim that believing believing that the person before me, like me, is part of the divine is the reason for so much suffering in India. \nUsing you logic I could never lose at the race tract because I noticed that every horse that wins has a jockey on it so all I have to do is bet every horse with a jockey.  \nKashmir Shaivism teachs that before you can come to the divine in you must get go beyond ego and come with love and forgiveness to others. How is that not Christ like? I don’t know where you are getting your information from, but it’s wrong.\nHere, how’s this;\n“One may amass wealth with hundreds of hands but one should also distribute it with thousands of hands. If someone keeps all that he accumulates for himself and does not give it to others the hoarded wealth will eventually prove to be the cause of ruin.”\nAtharva Veda 3: 24-25\nIs that UnChrist like?\nPS  I went to Catholic school when I was a kid, but I don’t let any group or person do my thinking for me. I do my own research and decide for myself what works for me.\n\n","date":"April 28, 2015 at 5:54 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197822","author":"John Green","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"John\nre. paragraph 3\nYou did not understand what I meant. Theoretically it sounds fine, but in practice it is zero in India. If they believe everyone is part of the divine how is it that there are millions of beggars in India, ill treated, sometimes even kicked, by many? So it is the human being, who also has something of the divine, paying for his sins because of the law of karma? What a handy excuse.\nRemember: That is why Mother Teresa was given a Head of State funeral there. She was moved by Christian belief.\nC.G. Jung found it to be a dreamland, with people not bothering about their contradictory Hindu beliefs.\n\n","date":"April 28, 2015 at 6:24 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197823","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Louis,\nI am not an advocate of the Hindu religion by any means. The communal violence among Hindus and Muslims is appalling. There is no love in that.  However, the history of Christianity is replete with incidences of appalling un-Christian actions. The Fourth Crusade for example which cuts kind of close to home for the Shroud community.\n\n","date":"April 28, 2015 at 6:51 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197825","author":"John Klotz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Hi John\nThere is some misunderstanding here. There is always a gulf between belief and practice in everyone, in any religion. What I was referring to was contradictory beliefs in the same religion. How can you believe everyone has a spark of the divine, even beggars and lepers, but make differences in treatment? So the beggars, who have a spark of the divine, have to be ill-treated because they are paying for their sins due to the law of karma? And how do you get out of this karmic ladder? It is precisely the rich who ill treat the poor there.\nOne Saturday I was looking around for books and met a Jewish acquaintance who was walking his dog after returning from the synagogue, the kipan still in his pocket. He was also looking for books. Knowing that 58% of Israelis do not believe in life after death, I asked him about what he believed.\nHis response: It would be impossible for Hitler to be resurrected, and it would also be impossible for Mother Teresa not to be resurrected.\n\n","date":"April 28, 2015 at 7:40 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197831","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Louis\nYou’re right, I don’t understand you. Here’s what you wrote\n“This “inner self” concept you refer to leads to selfishness and that is the reason for so much suffering in India, with millions of beggars.”\nI’m still waiting for your data of that. Maybe that person kicking the begger was a Christain. \nIt appears you don’t understand the concept. To find the “inner self ” is to go beyond the ego, it’s the ego that causes all these problem, not the teachings.    \nJust because all Hindus don’t follow all the teachings of Hinduism does that make the teachings bad? Hey, guess what, not all Christians follow the teachings of the Bible, are the teachings wrong?  Isn’t that why Jesus came? \nYou do know that the peak of poverty in Indea was in the 1920’s under the rule of a Christian nation. Gandhi led the way to get rid of that Christain nations wrongs, oh and he was a Hindu.\nTHE USA is a claimed Christian nation. We have lot of people homeless, we bomb other people, Long at all the people we killed in that war in the 60’s. Children go to bed without food, we shot unarmed people, the 1% control almost everything.\nIndia is growmg fast, more and more people are getting jobs. India is very young under non Christian rule. When the USA started Christians owned blacks and beat and killed them. Oh and the KKK, the group that killed blacks at will was a Christain group. \nShall I can go on and on Louis. Shall I tell you how many, “Christains” commit horrible crimes all over the world? Shall I say that the teaching of Jesus theoretically sounds fine, but in practice it doesn’t work?  \nYou want to tell us what Jung said I can tell you what Bart D. Ehrman wrote. Why waste the time? Oh and Chriatians have contradictory beliefs also.\nLouis you may believe that only what you believe is valid, that’s fine. I don’t believe I and only I hold the truth and only my way is the right way. Many of the things I believe may be proven wrong. I just telling what works for me.\n\n","date":"April 28, 2015 at 8:16 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197834","author":"John Green","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Hi John (Green)\nSince this is a Shroud blog I don’t want to go further into the matter. Have you ever gone to India? Do so, and then tell me about your experience. Also remember: You refer to Gandhi. Gandhi was accused of secretly being a Christian, his best friend was the Rev. C.F.Andrews, an Anglican priest, it is common knowledge that the greatest influence on him was the Sermon on the Mount, and the wall of his living room had a crucifix.\nI wish you success in your quest.\n\n","date":"April 28, 2015 at 8:27 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197837","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Louis\nI can go into detail the contradictory beliefs of the Bible and science and known facts, but I’m not going to do that. I did that for years and I have nothing to show for it. \nI believe that many belief systems have a lot in common and I’m trying to bring belief, science and consciousness together. \nThis is taking for that so I will end my comments here.\n\n","date":"April 28, 2015 at 8:39 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197840","author":"John Green","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"How lovely to have the certainty of John Kotz. How wonderful to think that you can pop a microscopic shard into a “methemoglobin testing machine” and be told for a fact whether it is blood or not, or to imagine that a handful of cotton fibres can debunk the radiocarbon dating, or that the “the greatest scientific minds of any age” have pronounced the Shroud authentic.\nHow lovely to have the certainty of Joe Nickell. How wonderful to be able to cling to a finding in 1973 without bothering to consider a contradictory finding five years later, or to accept the writings of a 14th century bishop without a moment’s hesitation, or to know that 3/1 herringbone is a typical medieval weave without any corroborating evidence.\nIs there a difference?\n\n","date":"April 26, 2015 at 9:17 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197639","author":"Hugh Farey","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Have you ever heard of a “microspectrophotometer.” It isn’t a “methemoglobin testing machine” it was a machine for determining the composition of materials by measuring their spectrum. Actually, we have better devices now but when Heller wanted to analyze the composition of the bloodstains it was the best analytic device available. \nYou state you are a scientist . How can you be so infantile in your attempt to denigrate Heller’s work. If you want to critique don’t make up a snide insult. It doesn’t demean him (or me), it demeans you.\n\n","date":"April 27, 2015 at 7:38 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197726","author":"John Klotz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Oh, tut. “Infantile” indeed. I have the greatest respect for Heller’s and Adler’s work, and was as impressed as you by the identifying of methemoglobin on a single shard from the Shroud. What’s more, I have read what Heller and Adler published in Applied Optics in 1980. “Thermodynamically\nthe latter fibrils would be expected to show the spectrum\nof a fully oxidized denatured met-hemoglobin, i.e.,\na so-called perturbed acid met-hemoglobin. Although\nthe spectra of the Shroud fibrils are, in fact, indicative\nof such a spectrum, the high degree of scattering from\nthese solid samples makes the visible band shape features\nless distinct and does produce peak shifts from the\nsolution spectra. Therefore, this identification\nis much less positive than desired.”\nI made no attempt to denigrate Heller’s work, and certainly not to demean him. I simply wanted to point out that overweening confidence in any of the scientific findings on the Shroud is invariably unjustified, and usually hedged with caution even by the discoverers themselves. In casually denying that, or suggesting that anyone who doesn’t agree with you is infantile or a pseudo-skeptic, you place yourself in the same mind-set as the most convinced and unquestioning non-authenticists.\nNow perhaps you’d like to list the ten “greatest scientific minds of any age”… Shall I start? Galilleo, Darwin, Einstein, Newton, Aristotle… anyone I’ve forgotten? Oh, yes, Ray Rogers, Alan Adler and Steven Hawking.\n\n","date":"April 27, 2015 at 1:26 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197761","author":"Hugh Farey","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Although one can put the Shroud or any other topic “on trial” and perhaps get a verdict that matches with one’s belief, it’s also important to remember that just because a court reaches a certain verdict based on the evidence, it doesn’t mean the verdict is correct.  Obviously, there are numerous law cases in which a verdict was reached based on the available evidence at the time and the verdict turned out to be wrong.  Another factor at play is the very human desire to be right about things and wanting other people to agree with us.  In the case of the Shroud, there are certain people on both sides of the question (and perhaps some in the middle) who will never be convinced by the evidence from (an)other side, no matter how compelling they think it is.  Personally, although I think that studying the Shroud is frustrating to a degree because there will probably never be a clear-cut solution, I think one has to be somewhat comfortable with mystery and tolerant of the fact we are never going to be able convince everyone of one’s own view.  Regarding the comment about those who are able to make financial gains from touting the Shroud’s authenticity, I would love to see what would have to be an extremely short list, as most shroudies spend many of their own resources, including the greenbacks.\n\n","date":"April 26, 2015 at 12:02 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197653","author":"Joe Marino","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Reference to the Heller-Adler work on blood, I think the following excerpt from Chapter 9 of my book Quantum Christ may be helpful. \n“When Heller got back to the Institute he ran in and grabbed Adler. “Get some graph paper. We’ve got some plotting to do.”\n“Heller read off the coordinates he had written in the dark while Adler plotted the curves. “John, this is hemoglobin. It’s the acid methemoglobin form and it’s denatured and very old.”\n“Heller decided to check the results with at least two other top hemoglobin experts and see if they would be a sure as he and Adler were.\n“Adler got on the phone immediately and read the coordinates to his chosen specialist. The answer – old acid methemoglobin. \n“Then they called Bruce Cameron on a speaker – phone. His double doctorate was dedicated to hemoglobin in all its many forms. After they had given him the numbers and plotted them, Cameron was a little sharp.\n “You both should know what it is. It’s old acid methemoglobin. I don’t know why you wanted to bother me with something you know as well as I do . . . Hey, wait a minute. Are you two idiots working on the Shroud of Turin?”\n“Indeed they were.”\nChapter 9 is entitled “The Blood of the Lamb.” The above was based upon Heller’s memoir “Report on the Shroud of Turin.” I had been clued in before I read that in Heller’s memoir by a physicist I consult with that if the stains on the Shroud were actual blood, they would be “methemoglobin.”\nI have a court appearance today and I am up early. I am not going to be able to participate in a continuing dialogue but maybe later this afternoon, I’ll check in.\n\n","date":"April 27, 2015 at 3:12 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197709","author":"John Klotz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Hi John\nre. Your comment above directed to me\nYes, I think science and religion will ultimately have to get together, but science explaining the How and religion (systematic theology) explaining the Why. I have the feeling that, deep inside, that was what the Jewish atheist Stephen Jay Gould, who sometimes sang in church choirs, believed. He even took Carl Sagan to the Vatican when he was presenting his NOMA and said that he would be comfortable discussing philosophy with Pope John Paul II. RD rejected NOMA, believing that science and religion are two separate compartments which have nothing to do with one another.\n\n","date":"April 27, 2015 at 7:46 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197728","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"I briefly studied aspects of Hinduism several years ago as part of a degree course in Religious Studies.  It included the Upanishads, the Vedas, and the Bhagavad Gita.  Compared to the polytheisms in eastern and other religions, it seemed that the specific polytheism in Hinduism was more in the nature of “kathenotheism” or “one-god-at-a-time- ism”.  That is, all these various gods were really only different aspects of the Hindu concept of the One. \nRecently I attended a lecture by a retired Doctor of Divinity who referred to the ancient and medieval view of the three-tiered universe, with God above in the sky, earth in the middle, and Sheol below.  We now know that this concept is incorrect.  He preferred to think of everything existing “within God”.  That possibly comes close to Hindu and other eastern concepts.  \nThe Catholic historian Anne Fremantle referred to three fundamental heresies that have in various forms bedevilled Christian orthodoxy from its beginnings:  Pantheism, Polytheism and Prometheanism.  Pantheism confuses the Creator with Creation;  Polytheism confuses other supernatural beings with the one deity;  Prometheanism puts man in the place of God.  It is in avoiding these confusions that marks out Christian orthodoxy so distinctly from other religious expressions.  \nThe origins of various religions tend to follow a pattern:  the obvious one is a search for the mystical and divine beyond material reality;  another aspect can be found in the legitimisation of secular governance such as in the “mandate of heaven”, the religious coronation of kings who at one time had a distinctly priestly function, and is still evident in those nations with an establishment religion;  a third can be found in the various social mores of the particular culture as a form of social control.  \nWhile all of these different religions are part of man’s historic search for God, I feel that it is also part of the divine plan of God’s patient and persevering search for man to bring everything to Himself.  \nAs for distinctions between science and religion, they are both only distinct aspects of the one truth, and cannot fundamentally conflict.  Any perceived conflicts are only due to our limited finite understanding of the truth which with our limited understanding we find confusing.  The controversies following Darwin’s work on evolution is a case in point.  Established religion believed they had a correct view of Creation in the Genesis stories which were at odds with Darwin’s discoveries.  However Teilhard de Chardin was able to attempt a synthesis of the two concepts, but not without further controversy.  No doubt some new genius will eventually arise who can offer an even more successful synthesis of these two aspects giving us a theology which sees God as Creator in terms which the body of science might be able to more readily accept.\n\n","date":"April 27, 2015 at 4:07 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197768","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Interesting Daveb. However you did not touch; reincarnation, eternal conciousness, results from regression therapies and NDE. \nUpanishads tell that at the begining all were with the Creator and they left the creator and finally all who left the creator wanted to unite with the creator again.\nIn Revelation we can read about the fallen angels. According to parable of Prodigal son who is this son and why father is waiting for his return? \nThat is why Jesus came to this world to take lost angels back to the kingdom of God. Jesus main message was “Love”.\nLook at the Shroud. You can see that Love there. See how much Jesus suffered tell us how much father is loving us. Until science tell me how the image got printed on that linen piece Shroud is real for me. I never believe controversial Carbon Dating results.\n\n","date":"April 27, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197774","author":"Sampath Fernando","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Sampath:  Alexander the Great reached as far east as the Indus Valley, and the Silk Road linking China, India, Samarkand and the Levant was well developed by 200 BC.  Trade, military adventurism, migration (sometimes forced) made for a ready exchange of ideas and adaptations of the various mythologies.  Earlier Babylonian and Zoroastrian ideas had filtrated into some aspects of Judaism.  The annual fertility cycle of death and resurrection of the god can be found in such works as the Phoenician myth of Baal Hadad of ~1300 BC.  Influences of even Buddhism are seen in some aspects of Johannine scriptures.\nI see all this as part of the divine plan of revelation. purified by the Christ events.\n\n","date":"April 27, 2015 at 6:01 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197779","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Thank you Daveb: I have not read in any other religions a person like Jesus. Jesus is only person died and resurrected. Most probably Shroud is the only witness to that.\n\n","date":"April 27, 2015 at 6:42 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197781","author":"Sampath Fernando","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Agricultural Man was long obsessed with the mystery and wonder of the annual fertility cycle, birth, death, rebirth.  His whole economy and survival depended on it.  It found expression in fertility rites, in a number of myths of death and resurrection.  Occasionally it even included human sacrifice to make the crops grow.  Jesus even used it in parables of seed falling to the ground and dying, before it could grow and yield manifold fruit.  \nI think it is one reason why the story of His death and resurrection is so fundamental.  It strikes at the core of our primal instincts, so that we can see a truth in it, even if we do not understand the reason.\n\n","date":"April 28, 2015 at 3:53 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197817","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"We seem to be getting into a controversy about what is the one “true” religion. Louis has made  tremendous contributions to the Shroud scholarship but I respectfully differ with him on somethings. My perspective of what a Christian is may differ from his. I think mine may be closer to that of Pope Francis.\nSome years ago, I pondered a solution to the multiple religions quandary that actually echoed something Bobby Kennedy suggested to his brother and his other advisers dealing with the Cuban Missile Crisis. Khrushchev (like Kennedy) was dealing with a bellicose faction in  the military and he sent two messages in near rapid succession. One was quite temperate and promising. The second was bellicose and threatening seeming to shut the door, Bobby’s proposal was to ignore the second message and respond to the first. (There were numerous other factors including a not widely publicized intervention by Pope John XXIII)\nIt worked.\nWhat I think the Pope should do, and I think what Pope Francis has effectively been doing is recognize that all those parts of humanity whatever their formal religion are de facto Christians and a part of his flock. His obligation is to all of humanity, not just baptized Catholics.\nWhen I was a child (and even a teenager) I was taught that the hallmarks of the true church was that it be One, Holy, Catholic [universal] and Apostolic. By asserting the moral authority of the Christian Gospel and finding common cause with multiple religious leaders Francis is creating a framework for a truly Catholic Church. \nHis essential message becomes you are all Catholics and  I am the pope of all. Kind of like the Kennedy’s ignoring the bombast of the second message and concentrating on the first.\nWhen we surrender to love, we belong to a universal church whether we want to admit it or not. All of the scriptures and the prophets resolve to this: love. Don’t argue with me, that is what He said. (capital H not a typo!) Whenever anyone, be it a friend or a political leader or financial tycoon speaks or acts, the first, and perhaps only question should be: where is the Love in that.\n\n","date":"April 28, 2015 at 6:32 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197824","author":"John Klotz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"John, we don’t differ here at all. I am one who looks at contents, not labels, although I also know what Bertrand Russell, the atheist, said: Since religions are contradictory only one can be true.\n\n","date":"April 28, 2015 at 7:50 am","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197832","author":"Louis","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Concerning the diversity of humanity’s religious expression, the matter is well covered in the ground-breaking “Lumen Gentium”, particularly Chapter II ‘The People of God’, probably the most important achievement to come out the the Second Vatican Council.  The focus here seems to be on People and it is all-embracing.  Ever since the time of Pope Paul VI we seem to have seen a gradual realisation in the Church of its prophetic significance, despite the baggage of history, its many religious wars and arrogant sectarianism.  \nThis morning I shall once again attend a short lecture by a Presbyterian Doctor of Divinity.  I have heard him many times over the last few years; he always has something to say, important for me, but I don’t need to agree with everything he has to say.  Decades ago, my attendance at his sessions would have been unthinkable for me as a born and bred Catholic man.\n\n","date":"April 28, 2015 at 3:15 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197868","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Flat Earth Society, Shroud of Turin Research Project (STURP) and Other Partisans","post":"Hugh I have referred you to Bruno Azzola’s experiment re contactless image transfer mechanism on the TS (at a few millimiters’ distance) and dust-covered linen (acting as collimating/enhancing agent). Most obviously you are not even aware of it!\nMost obviously too, you are not an achaeological experimentator AND textile specialist (familiar with mechanical return force exerted by textile structure). Methinks you just CANNOT understand what I mean nor even imagine it!\n\n","date":"April 28, 2015 at 2:27 pm","url":"https://shroudstory.com/2015/04/25/flat-earth-society-shroud-of-turin-research-project-sturp-and-other-partisans/","cat":"article","id":"comment-197862","author":"Max patrick Hamon","site":"shroudstory"}]
