[{"title":"Forbes Editors Need to Polish Up Their Headline Writing","post":"It would appear that the Shroud has the DNA on it of most every person who has handled it since it’s beginning.  The exact large number of people is of course unknown.\n\n","date":"October 31, 2015 at 5:26 am","url":"https://shroudstory.com/2015/10/31/forbes-editors-need-to-polish-up-their-headline-writing/","cat":"article","id":"comment-213978","author":"ekmcmahon","site":"shroudstory"},{"title":"Forbes Editors Need to Polish Up Their Headline Writing","post":"I think the Shroud has been recognized much longer than since the middle ages (which has a shifting date range depending on who you talk to).\n\n","date":"October 31, 2015 at 9:55 am","url":"https://shroudstory.com/2015/10/31/forbes-editors-need-to-polish-up-their-headline-writing/","cat":"article","id":"comment-213989","author":"Dcn Andy","site":"shroudstory"},{"title":"Forbes Editors Need to Polish Up Their Headline Writing","post":"A better headline in case you missed it: –\nNZ All Blacks have just the won the Rugby World Cup Final in Twickenham England against Australia 34 – 17 to take the coveted Webb Ellis trophy for the third time in succession, a hat trick!  The quarter final was an entirely southern hemisphere affair with teams from South Africa, Argentina, Australia and New Zealand competing.  Many of the international teams had included New Zealand players and some such as Japan even with New Zealand coaches.  For four of the NZ veteran players it was their final international test match, and a great way to end their professional careers in Rugby.  It’s a tough body-contact sport and unlike American grid-iron, with practically no body padding.  But we’re a robust nation.  A win well-deserved!\n\n","date":"October 31, 2015 at 1:17 pm","url":"https://shroudstory.com/2015/10/31/forbes-editors-need-to-polish-up-their-headline-writing/","cat":"article","id":"comment-214009","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Forbes Editors Need to Polish Up Their Headline Writing","post":"“…third time in succession”. No, they have now won the trophy for the third time, but it’s the second time in succession. Having said that, I too support the All Blacks (sorry Hugh) and am happy that they won. I would like to visit New Zealand one of these days, it’s expensive , long and tiresome to travel there, but it surely must also   be very rewarding.\n\n","date":"October 31, 2015 at 9:33 pm","url":"https://shroudstory.com/2015/10/31/forbes-editors-need-to-polish-up-their-headline-writing/","cat":"article","id":"comment-214037","author":"PHPL","site":"shroudstory"},{"title":"Forbes Editors Need to Polish Up Their Headline Writing","post":"Many kiwis are gloating and showing off, unlike their modest heroes.\nAs a kiwi -and an All Black fan – I find that rather irritating\nBut it was well played for sure, and one to savor.\nWell played to Australia too. And they were dignified in defeat.\n\n","date":"November 1, 2015 at 2:47 am","url":"https://shroudstory.com/2015/10/31/forbes-editors-need-to-polish-up-their-headline-writing/","cat":"article","id":"comment-214052","author":"Thomas","site":"shroudstory"}]
