[{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"Dan,there seems to be nothing wrong with that as long as the author of the paper who is also the editor-in-chief of the journal proceeded like Paolo di Lazzaro. At least he is not hiding behind any pseudonym, alias, or is not an “anonymous” author. It may also be a means to avoid paying the high cost to get a peer-reviewed paper published, and what is propounded is by no means gospel truth, it only merits consideration.\n\n","date":"February 15, 2014 at 10:27 am","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79578","author":"Louis","site":"shroudstory"},{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"I’d like to make a few comments here.  I believe they apply whether the science is rated excellent or poor in the judgement of others, including scientists within the appropriate discipline.  I have read similar statements regarding Ray Roger’s publications and those of unrelated authors.  Change the name, change the title, change the date: same thing.  \nThis type of situation, when it arises, typically applies to smaller, specialty journals with a relatively small impact factor rating (1.7 in this case).  Why wouldn’t an editor publish (at times) in a journal that he or she was a part of?  If this is a frequent or exclusive occurrence, it’s obviously a problem.  But it’s by no means unheard of.  Paolo Di Lazzaro points out the procedures that exist for such a scenario.  Without knowing for certain otherwise, it is assumed such procedures were followed.  Questioning the journals’s objectivity, the integrity of the reviewers, what do such insinuations imply?  Intellectual dishonesty or bias in publication and/or reviewing?  An inside job?  Less than professional behavior on the part of the journal or it’s referees?  There’s a fine line here. \nI think there is “full disclosure”, after all how long did it take someone to “uncover” that the author was also an editor?  It’s a simple matter to find out such information, it’s not as though it’s being intentionally hidden.\n\n","date":"February 15, 2014 at 10:43 am","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79583","author":"Kelly Kearse","site":"shroudstory"},{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"Nothing wrong with full disclosure.  Makes everyone know the reality and decide if they want to accept the paper or not.  Failing to fully disclose makes it appear there’s something underhanded going on – not that it is, but appearances can be serious detractors.\n\n","date":"February 15, 2014 at 12:34 pm","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79599","author":"Andy","site":"shroudstory"},{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"\nAndy :\nNothing wrong with full disclosure.  Makes everyone know the reality and decide if they want to accept the paper or not.  Failing to fully disclose makes it appear there’s something\nunderhanded going on – not that it is, but appearances can be serious detractors.\n\nI think deciding for oneself whether a paper is acceptable or not should be based on the scientific merit of the results and discussion contained within it, not appearances.  If appearances are such serious detractors, bias toward it has already been established, in essence what reviewers, journals are having insinuated towards them.  There is no “failure” to fully disclose here and this is a completely separate issue from whether one considers the science to be lousy or not.\n  “Failing to fully disclose” is a straw man, it’s in print, it’s a matter of record-it’s not as though someone discovered a hidden file chock full of secrets.  That this is in some way being kept under the table, and that the journal should attach a warning label at the top of the page.  As Louis points out, no aliases were used; as the Santa Barbara reader notes, identical e-mail addresses were given.  Should Dan attach a clarifier each time he makes a comment in a thread to “fully disclose” that he is also the editor of the blog?  It’s there, if you look for it.  Similar charges have been made against the Rogers’ TA paper in the past, which many would argue is a harder form of science than the case being discussed here. Such insinuations of a “failure” imply a deliberate action, not a type of oversight (it is neither of these), and extend beyond just the involved authors.\n I trust I have fully disclosed how I feel–it’s just my opinion-like saying that someone fought with loaded gloves, without any proof, even if the accused was KO’d in the 2nd round.\n\n","date":"February 15, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79619","author":"Kelly Kearse","site":"shroudstory"},{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"It would have been helpful if Professors Gordon Cook and Christopher Ramsey had been more specific. Ramsey talks about “older archaeological material… much more sensitive to any effects.” But what material is this?\nFrom Fox News:\nhttp://www.foxnews.com/science/2014/02/11/shroud-turin-could-ancient-earthquake-explain-face-jesus/\n\n","date":"February 15, 2014 at 5:36 pm","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79641","author":"Louis","site":"shroudstory"},{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"A more or less exact contemporary of the shroud would be the bones of John the Baptist (http://www.ox.ac.uk/media/news_stories/2012/120615.html). These, like the Shroud, were tested by the Oxford Radiocarbon Unit and found to be from the 1st century. If neutron radiation from a local earthquake had an effect, it should have made them date much later. Similarly Timothy Jull’s dating of a number of remains from “the Judean desert” to the 1st century BC (http://digilander.libero.it/Hard_Rain/Radiocarbon1994.pdf) would have dated much later if an earthquake had had any effect. In fact, apart from the Shroud, I can find no anomalous radiocarbon dates which might have been effected by neutron radiation from an  earthquake.\n\n","date":"February 15, 2014 at 6:25 pm","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79651","author":"Hugh Farey","site":"shroudstory"},{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"The problem is that bones are bones and linen is linen. So the question about the material Dr. Christopher Ramsey talks about has still not been answered. I respect him a lot and can understand his position, being sandwiched between Shroudies and Oxford.\n\n","date":"February 15, 2014 at 6:32 pm","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79654","author":"Louis","site":"shroudstory"},{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"I wouldn’t think neutrons can distinguish between bones and linen, or parchment and linen, which are closer in form. However, some of the Judaean desert remains mentioned above were linen, and they show no anomaly.\nThe older remains are, the less C14 they contain, and so an influx of C14 makes a disproportionately larger effect. However no discrepancy was found in the dating of bones and linen from Wadi El Makkukh, also in the Judean desert, from about 4500 BC (http://www.rhodes.aegean.gr/maa_journal/1_Weiner.pdf).\nI think Ramsey did not need to be specific about his “older archaeological material.” For a start he was speaking to a journalist who probably wouldn’t have reported specifics anyway, and also a quick flick through Google would reveal any number of Judean excavations which do not show evidence of neutron distortion of their C14 proportions.\n\n","date":"February 16, 2014 at 5:11 am","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79753","author":"Hugh Farey","site":"shroudstory"},{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"Quite right, and it doesn’t seem that there would have been something high on the Richter magnitude scale. Professor Giulio Fanti has a different hypothesis about what may have happened, it is in the response to question no. 6:\nhttp://holyshroudguild.org/science-and-religion-meet-in-shroud-research.html\n\n","date":"February 16, 2014 at 11:15 am","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79808","author":"Louis","site":"shroudstory"},{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"\nHugh Farey :\nI wouldn’t think neutrons can distinguish between bones and linen, or parchment and linen, which are closer in form. However, some of the Judaean desert remains mentioned\nabove were linen, and they show no anomaly.\nThe older remains are, the less C14 they contain, and so an influx of C14 makes a disproportionately larger effect. However no discrepancy was found in the dating of bones and linen from Wadi El Makkukh, also in the Judean desert, from about 4500 BC (http://www.rhodes.aegean.gr/maa_journal/1_Weiner.pdf).\nI think Ramsey did not need to be specific about his “older archaeological material.” For a start he was speaking to a journalist who probably wouldn’t have reported specifics anyway, and also a quick flick through Google would reveal any number of Judean excavations which do not show evidence of neutron distortion of their C14 proportions.\n\nJust for grins, how do you know that the estimated age of the whole lot (articles, bones) wasn’t skewed, being inside the “Richter zone?”  The estimated age of the bones is this study is determined by carbon dating and mt DNA evaluated, which is discussed relative to the other articles found there, whose age was also determined carbon dating?  Or is there an independent reference point?\n\n","date":"February 16, 2014 at 3:05 pm","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79836","author":"Kelly Kearse","site":"shroudstory"},{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"Well, since the purported difference made by the earthquake amounted to 1300 years or so, that means that the Dead Sea Scrolls were written in 1300 BC, at about the time Abraham arrived in Israel (using the so-called Low Chronology), and the bones of John the Baptist are in fact those of Abraham!\n\n","date":"February 16, 2014 at 4:25 pm","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79846","author":"Hugh Farey","site":"shroudstory"},{"title":"Full Disclosure: Author of ‘Earthquake’ paper is also editor of journal that published paper","post":"\nHugh Farey :\nWell, since the purported difference made by the earthquake amounted to 1300 years or so, that means that the Dead Sea Scrolls were written in 1300 BC, at about the time\nAbraham arrived in Israel (using the so-called Low Chronology), and the bones of John the Baptist are in fact those of Abraham!\n\n Well..I was just talking about that particular study, but..Tally ho-Good one!\nInterestingly, both the Qumran cave and the tomb where JTB is believed to have been buried have been found to contain a unusually high amount of lead in the soil down to a depth of approximately two feet, which also impregnates both the interior and outer surface of these cave walls…\n\n","date":"February 16, 2014 at 4:59 pm","url":"https://shroudstory.com/2014/02/15/full-disclosure-author-of-earthquake-paper-is-also-editor-of-journal-that-published-paper/","cat":"press_coverage","id":"comment-79853","author":"Kelly Kearse","site":"shroudstory"}]
