[{"title":"Who Is He?","post":"Beautiful!\n\n","date":"June 25, 2015 at 6:18 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","id":"comment-203564","author":"John Klotz","site":"shroudstory"},{"title":"Who Is He?","post":"He is Jesus.  Yep, many will scoff at my answer, but each person has to give their own answer.  There is no way to prove it is or isn’t Jesus, so my opinion is just as valid as anyone else.\n\n","date":"June 25, 2015 at 7:03 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","id":"comment-203571","author":"Dcn Andy","site":"shroudstory"},{"title":"Who Is He?","post":"As much as any fact can be proven, I think the identity of the man in the Shroud is proven. We do not order our lives by proof beyond a reasonable doubt. The identity of the man in the Shroud is not a gift of faith, it is a gift of reason.\n\n","date":"June 25, 2015 at 7:08 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","id":"comment-203572","author":"John Klotz","site":"shroudstory"},{"title":"Who Is He?","post":"Catholic Exchange is a good source of information and K.V. Turley, who studied theology, is based in England, involved in producing documentaries, it seems.\n“Who is he” on the Shroud can perhaps be linked to “Who do people say that I am?” in the New Testament. I will cite two sources, both Jewish:\nhttps://www.academia.edu/12851672/The_Historical_Jesus_The_view_of_Professor_Geza_Vermes\nProfessor G.Vermes departed from this world telling Jews and Christians that the “real words of Jesus” would pose a challenge to both groups alike. He shunned organised religion and, from what it is possible to gauge, was guided by an existential spiritual legacy that he thought Jesus left for us.\nHarold Bloom, on the other hand, says that “Jesus did not tell us who he was”. He of course analysed the Bible from the point of literature and this analysis is linked to existence:\n https://www.academia.edu/12823419/Book_Review_Jesus_and_Yahveh_the_names_divine\n\n","date":"June 25, 2015 at 9:58 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","id":"comment-203583","author":"Louis","site":"shroudstory"},{"title":"Who Is He?","post":"Professor Pallant Ramsundar (Trinidad and Tobago), a Methodist and mathemician has written some interesting material about the timeline relating to Jesus. Since he is of Indian (Hindu) origin it would have been easy for him to use astronomical data in his studies.\n\n","date":"June 30, 2015 at 10:42 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","id":"comment-204143","author":"Louis","site":"shroudstory"},{"title":"Who Is He?","post":"From the Catholic Universe, England:\nhttp://www.thecatholicuniverse.com/the-monks-of-norcia-beauty-of-the-chant-captured-for-the-world-to-enjoy-6704\nPerhaps to meditate on Who is He?\nLike a good German, Benedict XVI also got a bottle of beer prepared by the monks.\n\n","date":"June 30, 2015 at 11:03 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","id":"comment-204149","author":"Louis","site":"shroudstory"},{"title":"Who Is He?","post":"I would like to emphasize once again that I consider the radiocarbon testing\nas a method disrespectful to the holy relic because that controls\nis a destructive test.\nSo: an analytical way which have to be limited, useful only to\nthe control of parts that have been already shown with safety\n(ie: a safety that for now we have not obtained, certainly not yet!)\nas mending or patching …\nI think that a further sentence about the authenticity of the Shroud\n(…or about the best [for example: with respect the SPM techniques]\nway of having to follow along with analytical works, and then\nto be able to arrive at scientific truth) uttered by me or\ndeclared by a group of high-level scientists has definitely different power\nof impact on international public opinion.\nIn short, you can think that amateur scientists (or the layman)\nor any poorly documented skeptic cannot create respectable\nopinion on the subject.\nHere I want to clarify: this year I’m not even able to go\nto Turin Cathedral because I have no money and then\nmy words will certainly have very little value on public opinion!\nThen, what can have a greatest value is a study done\nby respectable scientists (working in daylight, that is,\nwithout some subterfuge … ie: no data specially rigged\nto validate a given hypothesis), possibly certificates\nfrom other serious scientists…\nThe title of the work can be the following:\n“Statistical Evaluations for the Epoch and\nApparent Origin for the Body Image Formation in the Shroud of Turin”.\nAs an unusual documentary film can be indicated the AFM film\nabout linen fibril’s surfaces (…and then it’s important to show\nwhat we can see on preliminar experiments)…\n\n","date":"June 25, 2015 at 10:53 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","id":"comment-203593","author":"piero","site":"shroudstory"},{"title":"Who Is He?","post":"Errata corrige:\n>…. I consider the radiocarbon test …\n>… … to the holy relic because that control\nis a destructive test.\nInstead of:\n>…I consider the radiocarbon testing …\n>… to the holy relic because that controls\nis a destructive test.\n\n","date":"June 25, 2015 at 11:00 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","id":"comment-203596","author":"piero","site":"shroudstory"},{"title":"Who Is He?","post":"Re Who is he: On June 30, 2015, the two brightest planets in the sky, Venus and Jupiter, shall appear very, very close to one another.The conjunction has been suggested as a source for the “Star of BethleHem”.\nSee link at:","date":"June 30, 2015 at 1:26 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","id":"comment-204100","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Who Is He?","post":"The year of Jesus’ birth is uncertain but can be narrowed down to probably between 6 and 4 BC. The biblical account indicates two sightings of the star, one before the wise men began their journey (probably from Babylonia or Persia) and the other near their journey’s end, when the omen “came and stood over where the young child was.” A celestial object near the horizon of any given observer might be considered by him as pointing out some spot on Earth below.\nChinese annals record novae in 5 BC and 4 BC; in the early 17th century, Johannes Kepler advanced the view that the Star of Bethlehem may have been a nova occurring in or near some conjunction of bright planets.\nSeveral striking planetary conjunctions also took place within 10 years of the chronological point now taken as the beginning of the Christian era. A triple conjunction in early 6 BC, in which Mars, Jupiter, and Saturn stood at the points of a triangle, has often been mentioned as a possible explanation of the star. Prior to that, in 7 BC, Jupiter and Saturn were for eight months within three degrees of each other and three times within that period passed within one degree. Several years later, on June 17, 2 BC, the bright planets Venus and Jupiter would have appeared to observers in Babylon to have merged just before setting in the general direction of Bethlehem to the west.  \nAlternatively, interpret it as a literary device.  Several notable people in ancient times were said to have had asterism phenomena at their birth as a signal portent.  Matthew’s gospel is noted for several allusions to gentiles, some favourable, others less so.  If he wants important gentiles at the birth of Jesus, a sign from a star gives them a reason for their journey.\n\n","date":"June 30, 2015 at 2:05 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","id":"comment-204103","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Who Is He?","post":"thanks for the great rundown on dates….\n\n","date":"June 30, 2015 at 11:21 am","url":"https://shroudstory.com/2015/06/25/who-is-he/","cat":"article","id":"comment-204154","author":"Nabber","site":"shroudstory"}]
