[{"title":"Including the Truth About the Shroud of Turin","post":"The truth about the Shroud of Turin is to be  found in Vatican’s secret archive ? This does not augur well for holders of authenticity.\n\n","date":"August 13, 2015 at 6:25 am","url":"https://shroudstory.com/2015/08/13/including-the-truth-about-the-shroud-of-turin/","cat":"article","id":"comment-208141","author":"PHPL","site":"shroudstory"},{"title":"Including the Truth About the Shroud of Turin","post":"It is beyond credibility that a scientific paper in the journal Nature constitutes the only record of a commission by the archdiocese of Turin of the British Museum to carbon date the Shroud. There is a full report somewhere, of which I have no doubt the British Museum, the Archdiocese of Turin and the Vatican have a copy. I wonder what it says.\n\n","date":"August 13, 2015 at 6:33 am","url":"https://shroudstory.com/2015/08/13/including-the-truth-about-the-shroud-of-turin/","cat":"article","id":"comment-208143","author":"Hugh Farey","site":"shroudstory"},{"title":"Including the Truth About the Shroud of Turin","post":"If there is indeed such a report it poses no problem for those in the pro-authenticity camp.\nWe must remember that Cardinal Severino Poletto arranged a Round Table long after the carbon dating results were published, at which Dr. Michael Tite and some prominent “Shroudies” were present. I still have to publish some stretches of another interview with the late Daniel Raffard de Brienne, who was then the CIELT president, where he spoke about this Round Table. Another of those invited was Professor Heinrich Pfeiffer, SJ, an insider to some extent, and he had something to say when I interviewed him:\nhttps://www.academia.edu/14795646/An_interview_with_Professor_Heinrich_Pfeiffer_SJ\n\n","date":"August 13, 2015 at 7:09 am","url":"https://shroudstory.com/2015/08/13/including-the-truth-about-the-shroud-of-turin/","cat":"article","id":"comment-208145","author":"Louis","site":"shroudstory"},{"title":"Including the Truth About the Shroud of Turin","post":"I recall that the anthropologist J Bronowski  was given free access to the Galileo archives for his Ascent of Man TV series and was shown there inspecting the file.  Several extracts are quoted in his book of the same name.  So the archives are selectively available. \nWe may speculate on what the TS archive might reveal.  Comments relating to the radiocarbon dating, both before and after, seem apt.  There might even be references concerning its journey from Constantinople to Troyes, possibly even earlier, judging from already published letters to the Pope after 1204.\n\n","date":"August 13, 2015 at 3:21 pm","url":"https://shroudstory.com/2015/08/13/including-the-truth-about-the-shroud-of-turin/","cat":"article","id":"comment-208185","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Including the Truth About the Shroud of Turin","post":"For “Shroudies” interested in browsing the Vatican collection:\nhttp://www.catholicherald.co.uk/news/2015/08/17/vatican-launches-fundraising-app-for-museum-restoration-projects/\n\n","date":"August 17, 2015 at 1:14 pm","url":"https://shroudstory.com/2015/08/13/including-the-truth-about-the-shroud-of-turin/","cat":"article","id":"comment-208435","author":"Louis","site":"shroudstory"}]
