[{"title":"Interview with Paolo Di Lazzaro","post":"If I understand the main objection to the work of Lazarro et al, it is that positing that the image on the Shroud was caused by some sort of ultraviolet laser radiation would be the same as suggesting that something miraculous had taken place.  Is that correct?\n\n","date":"April 14, 2015 at 6:06 am","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196298","author":"Julian","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"Briefly, yes.\nMore usefully, there are no circumstances currently known whereby a body in a tomb can generate the kind, quantity or direction of radiation required for di Lazzaro’s mechanism to operate to produce the image on the Shroud. Either further discoveries in physics or archaeology will eventually justify the mechanism, or something occurred outside the realm of physics altogether, or the image was not produced using the mechanism described.\n\n","date":"April 14, 2015 at 6:17 am","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196300","author":"Hugh Farey","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"If Gospels are true;\nLuke 23:46 (New International Version) Jesus called out with a loud voice, “Father, into your hands I commit my spirit.” When he had said this, he breathed his last.\nMark 15:38 (New International Version) The curtain of the temple was torn in two from top to bottom.\nFrom the above we can see that when Jesus handed over his spirit to the Father, how much energy dispatched from his body. That energy was so powerful that even the curtain of the temple was torn in two from top to bottom.\nAs I mentioned previously no one knows about the resurrection process and no one knows how much energy is required to enter the spirit of Jesus back to his dead body.\nCan anyone explain about this energy? What type? and What quantity?\n\n","date":"April 14, 2015 at 4:53 pm","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196348","author":"Sampath Fernando","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"At resurrection:\nMatthew 28:2 (New International Version) There was a violent earthquake, for an angel of the Lord came down from heaven and, going to the tomb, rolled back the stone and sat on it.\nAt resurrection where this energy came from to have violent earthquake?\n\n","date":"April 14, 2015 at 6:30 pm","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196354","author":"Sampath Fernando","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"I really have no sympathy for those who wish to slam the door on on scientific progress by claiming that the Resurrection is an unnatural event and therefore forever beyond the scope of scientific investigation. If the body of Christ underwent a trans-formative process, that trans-formative process began with a physical object: His body wrapped in the Shroud. Although I don’t intend to do much with the concept right now, Hugh’s initial skepticism that I could construct (with tutelage) a tesseract at age 17 drew my attention to the tesseract: a three dimension representation of a four dimensional cube, the fourth dimension being time.\nYou have in the tomb Christ’s body one instant and in another instant it’s gone. That instant is to people of faith, the Resurrection. What makes anyone think that the process of transformation would leave no traces? It may have been an infinitesimally small instant. (So was the Big Bang) but it was instant. His body transported from one existence to another. \nSome years ago Isabel Piczek described the Shroud as an “event horizon.” At first I was querulous l. Now I am not. When Christ’s body entered a new dimension or universe of cosmic existence, the Shroud recorded the last visible instant as that happened. I would reference his conversation with Mary Magdalene outside the tomb: “Do not touch me!” \nIn that regard, di Lazzaro’s research is intriguing. Is it a final answer? Not yet, but it may be pointing in a  direction.\n\\\n\n","date":"April 14, 2015 at 7:26 am","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196309","author":"John Klotz","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"One is here led to the dilemma Heidegger bumped into, influenced as he was by Bultmann. Bultmann has been largely discarded today, but not Heidegger. Although an ex-seminarian he fought with the Jesuits and drifted away from religion. Faced with the ultimate meaning of the dilemma, unable to solve it while thinking deeply during long walks in a forest, he returned to religion, began to enter and bless himself each time he passed a church and, finally, called a priest to his house to make sure he would be given a Catholic burial.\nIf Heidegger had read the NT from a different angle, he would not face the dilemma, but then he would have have to mix religion and philosophy, which he did not exactly do. He would have to take another path, but nothing to do with a new dimension of cosmic existence….\n\n","date":"April 14, 2015 at 7:12 pm","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196358","author":"Louis","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"“The tesseract: a three dimension representation of a four dimensional cube, the fourth dimension being time.” Er… no… A tesseract is a figure of four spacial dimensions, in which each of the edges is of unit length and either parallel to or at right angles to each of the other edges. Assuming one could make one, it would also exist in time, making it, from that point of view, a five-dimensional object.\nConceptually speaking, especially if exploring n-dimensional space-time, it can be obstructive to think of time as the 4th dimension. It is more useful to think of time as the 1st dimension. This goes against conventional thinking, as it implies that a square is a three dimensional figure, but a moment’s thought will show that this is true, in that if a square exists at all, it exists in time, and therefore consists of two spacial dimensions and time. There is a further extension to this, which is that there may be numerous time dimensions, and that a complete description of an object may require one to specify both how many spacial and how many temporal dimensions it occupies. It may be that some of the peculiarities of quantum theory become easier to understand in these terms.\n\n","date":"April 14, 2015 at 9:03 am","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196312","author":"Hugh Farey","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"“This goes against conventional thinking” It sure does.\n\n","date":"April 14, 2015 at 9:20 am","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196313","author":"John Klotz","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"Perhaps we have also  to see what happens using the other way:\na Corona Discharge on a manikin built with a new unconventional method\nfor combining metal and textile (polyurethane is used as skin to blend with a metallic grid)…\nIn my idea a thin grid can be constructed in order to combine them…\nThis was only a vague suggestion to improve what is able to do Eng. G. Fanti.\nIf we want to try to use VUV excimer laser on that particular 3D structure,\nthen we can think to lower the power…\nBut I have some doubt about the exactness of the work (for example:\nwhen the grid is too large).\n— —\nSorry.\nI am joking a bit on serious issues (= the textile tesseract:\na three dimensional representation, VUV and Laboratory of Excimer,\nCD power calibrations, VUV calibrations, etc. …)\n\n","date":"April 14, 2015 at 10:19 am","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196315","author":"piero","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"I would add, however, an attempt of mine to clarify:\nI’m afraid that might happen the phenomena of “thermal pollution” during production (= adequate experiments done with the use of that polyurethane/metallic blend ) of the image on the Shroud, namely: a bit like what Rogers told me to have happened with the experiments performed (but here I speak about things of the past) from known researcher Giovanna De Liso …\nSo, I cannot exclude a sameness to what had happened with linen fibrils produced by De Liso.\nWe were dazzled with the proofs obtained by Di Lazzaro (and Fanti), but we never saw the results from the controls (on linen fibrils) obtained using advanced microscopies (= AFM techniques, etc.).\nI said all these things also because I want to underline\nthe importance of microscopic controls…\nFor example: the evaluation by Rogers (about an interesting sample otained\nby De Liso) was based on his observation, performed using a microscope.\n— —\nBefore ending, here’s a question:\nWhat should be the optimal size of the “metallic grid”\n(a grid that has to be well inserted into the polyurethanic skin)\nin your opinion?\n\n","date":"April 14, 2015 at 11:45 am","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196321","author":"piero","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"Perhaps it is not such a difficult problem?  It is well known that individual atoms have signature EM frequencies as subatomic particles change their energy levels.  A simple example is the Fraunhofer lines of stars whereby their chemical composition can be analysed.  What Physics student hasn’t seen the orange luminescence of common salt NaCl?  Very likely in some cases these signature frequencies extend into the UV range.  All it needs is the for the right atoms to be activated.  A resurrection process might do it.  Analysis, anyone?  Apostles Creed, “He descended into hell… ”  Would that be hot enough to do it?\n\n","date":"April 14, 2015 at 4:29 pm","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196345","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"daveb wrote:\n“… Analysis, anyone? Apostles Creed, “He descended into hell… ” Would that be hot enough to do it?”\nSo one might think …  that could be the glow of the light of the flames of hell the one that produced … the image of the Shroud?\n — —\nNow, to return to the problems of this poor world:\nHow much is the amount of money required for the preparation of a good Laboratory of Archaeometry (like the one that seemed to think Prof. Barberis in an interview)?\n— —\nWhat do you think of the dummy/manikin constructed with the combination\n of a metal mesh and the polyurethanic skin?\nWhat is your opinion about the idea of subjecting the dummy constructed with the combination of a metal mesh and polyurethanic skin (or a polyurethanic sheet over\nan insulating sculpture) to a Corona Discharge?\n— —\nIs it possible to think other ways (about the B.I.F. = Body Image Formation)?\nFor example, I have found the following description:\n>Electrostatic painting is commonly called powder coating. It is a dry powder mix of resin and pigment. The mix is positively charged in the paint sprayer and sprayed onto the finished surface by air. The painted object is grounded to give it a negative charge. The powder is only attracted to the finished object, so it spreads uniformly over the most irregular and complicated surfaces. …\nLink:http://www.ehow.com/facts_6684816_kind-paint-used-electrostatic-painting_.html\nand\nthis one:\n>The term electrostatics or electrostatic spray finishing refers to a spray finishing process in which electrical charges and electric fields are used to attract particles of atomized coating material to the target (the object to be coated). In the most common types of electrostatic systems, electrical charges are applied to the coating material and the target is grounded, creating an electric field. The charged particles of coating material are drawn by the electric field to the surface of the grounded target because of the attraction of opposing electrical charges. …\nHere another excerpt:\n>In a corona charging system, a high voltage generator is used to charge an electrode at the tip of the powder gun. This creates an electrostatic field (or corona) between the gun and the substrate.\n>Gas molecules in the air pick up electrons emitted from the corona. This negative charge is, in turn, transferred to the powder particles as they are propelled from the gun head towards the substrate.\n>The charged powder particles are deposited on the earthed substrate.\n>Electrostatic spraying gun system has been the most popular coating methods\nfor powder coating powder.\nLink:\nhttp://www.chinapowdercoating.com/tag/electrostatic-spraying/page/2\nSo…\nIs it possible to think the Shroud as a sort of electrostatic painting?\n— —\nI think this idea (= the Shroud as a sort of “electrostatic painting”) has\nthe defect of being different from what we can observe about the Shroud:\nlooking the Shroud we see only a weak superficial action and\nso there is no true penetration into the material (apart from the claims\nby Fanti and Maggiolo about the existence of the “second face”,\na phenomenon that was [interpreted in a different manner by Rogers,\nwho, instead of the Corona Discharge, indicated the absorption-desorption\neffect about the behavior of linen fibres] denied by Balossino …).\nIn any case we have to test under the advanced microscope\nthe linen fibrils coming from the Image of the Shroud, before\nto speak too about the hypothesis of an “event horizon” or “horizon of the Hell”\nor whatsoever thing you want to think…\nBut we should also take into account the effect of the passage of time,\nthe aging of the “mysterious picture” …\nthis without necessarily having to arrive to the exaggerations of Charles\nFreeman (I hope that our poor friend Charles will forgive me for\nthis term a bit severe…) about the past appearance of the Shroud…\nSo, what now I want to emphasize is that we have not yet observed\nthe aging of what was produced by Di Lazzaro (apart from a special case\nalready considered by himself…).\n\n","date":"April 15, 2015 at 9:27 am","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196412","author":"Piero","site":"shroudstory"},{"title":"Interview with Paolo Di Lazzaro","post":"I want to try to improve my little contribution to this blog\nwith few lines about the “gopic hand test”… \nIn other words:\nWe have to know if linen fibrils treated by Paolo Di Lazzaro\n(compared to the other coming from the Holy Shroud)\npass or fail the “gopic hand test”…\nDo you know Soprano Gopichand from India?\nTry to see under:\nhttp://coolmusicinstrument.com/ektara-and-gopichand-one-string-percussive-instrument-india\nand\nthere is another posibility of information under:\nhttp://en.wikipedia.org/wiki/Ektara\n>… he ektara is a drone lute consisting of a gourd resonator\ncovered with skin, through which a bamboo neck is inserted … \nB.T.W.:\n>Paramhansa Yogananda was an early proponent of kirtan in the west,\nchanting Guru Nanak Dev’s Hey Hari Sundara (“Oh God Beautiful”)\nwith 3,000 people at Carnegie Hall in 1923… \nLink:\nhttp://en.wikipedia.org/wiki/Kirtan\n— — —\nI hope that you have understood\nwhat can be the “gopic hand test”…\nBut (perhaps) …\nDo  you prefer the banjo ?…\nLink:\nhttp://en.wikipedia.org/wiki/Banjo\n— —\nI don’t believe we can work with “Four-string banjos” [or similar things]\n(using linen fibrils as cords), also perhaps “in tremolo style”…\nbecause we have to test the vibration of a single linen fibril.\n— —\nIn my opinion VUV treated (= probably brittle) linen fibrils react\nin a different manner with respect the other material, but I never\ntried to test these interesting “nanomusical things” (and excuse\nme for this term written in an easy humorous style) in a great\n“Lab orchestra” (… directed by prof. B. Barberis?)…\n\n","date":"April 15, 2015 at 11:46 am","url":"https://shroudstory.com/2015/04/14/interview-with-paolo-di-lazzaro/","cat":"article","id":"comment-196429","author":"piero","site":"shroudstory"}]
