[{"title":"In the Eyes of the Befuddled","post":"We are not going to have unbiased coverage from the media when it comes to the SOT or anything else regarding religion.  Catholics, Protestants, Orthodox, etc. have all been branded idiots by the media, regardless of our level of education or success.  And maybe that has more positive ramifications for the believer than we think. We will never, ever be friends of the world, we are hated of the world and will always be, we have had the highest assurance possible of this fact.  I was raised in an atheistic household, and had to do my research and reflection, although God leads us to Him by His own means and ways.  The author, typically, has failed to mention that NO medieval portrait of Christ, and no Renaissance portrait either, depicts Christ naked.  The medical accuracy of the Shroud had never been duplicated by a work of art, NO artist has ever gone that far in terms of morbidity or gruesomeness, not even  Matthias Gruenewald.  That the blood on the SOT is genuine is no longer in doubt, that the patterns of blood correspond with the stains of the Cloth of Oviedo has been established by forensic science.  That pollen corresponding to plants that bloom ONLY in Palestine in the Spring are on the SOT has been established by outstanding biologists in Jerusalem and Europe have been established as fact is not in doubt.  We might go on and on, and Carbon 14 tests done on the leg of a mammoth establish that it is 1000 years older than the head of the same frozen animal, but what of it? No evidence presented will be sufficient to move those who have established, a priori, that there are no miracles. All we can really do is wonder what motivates a journalist to write an article with no research behind it, and what motivates the journal to pay someone who writes this kind of poorly researched stuff.\n\n","date":"June 24, 2015 at 7:58 am","url":"https://shroudstory.com/2015/06/24/in-the-eyes-of-the-befuddled/","cat":"press_coverage","id":"comment-203450","author":"Josie Tyner","site":"shroudstory"},{"title":"In the Eyes of the Befuddled","post":"I wonder if either Dan or Josie have read the two articles of the dreadful media connected with this article. Both the CNN report and the Huffington Post article are, if anything, pro-authenticity rather than anti, and deeply respectful of Christianity in general and the Pope in particular. Josie’s diatribe verges on paranoia. Christians are not branded idiots by these articles, they appear to be friendly towards them. Not a single one of Josie’s subsequent statements about the Shroud is true. There are many medieval portraits of a naked Christ, the image is so inaccurate that authenticists have twisted themselves into knots trying to reconcile a possible posture of a body with a possible configuration of the cloth, many medieval depictions of the crucifixion are far worse in terms of blood spurts and the depiction of wounds than the rather demure figure on the shroud, the genuineness of the blood has always been and still is a subject of heated controversy, the patterns of the blood on the Shroud and on the Oviedo cloth clearly contradict each other, the pollen has not been established as Middle Eastern and no mammoths have been dated so diversely as claimed.\nBut what of it? No evidence presented will be sufficient to move one so convinced that world is against her that she despises even the journalists and their journals that lend credence to her beliefs. Weird…\n\n","date":"June 25, 2015 at 12:12 pm","url":"https://shroudstory.com/2015/06/24/in-the-eyes-of-the-befuddled/","cat":"press_coverage","id":"comment-203605","author":"Hugh Farey","site":"shroudstory"},{"title":"In the Eyes of the Befuddled","post":"SUPPORTING jOSIE TYNER\nDear Josie Tyner\nDespite that unsympathetic rebuttal to your comment most of what you wrote in your own words about the scientific aspects of the Shroud of Turin is backed by the conclusions of honest scientists who studied the Shroud of Turin and the Sudarium of Oviedo.\nActually the painting of a naked Christ was absolutely unusual in medieval art(most of historian arts agree with this), the blood marks on the Shroud are consistent with contact with a body that sustained the horrors of scourging, crowning with a helmet of thorns and crucified with nails on the wrists (not the palm) and had his side pierced with a spear – THESE ARE EVIDENCES PRESENTED BY FORENSIC EXPERTS, NOT SPECULATIONS.\nThe question pf pollens is a bit more complex due to difficulties in taxonomical classification of pollen grains, namely ancient samples collected by Dr. Max Frei nevertheless there are pollens on the Shroud that allow us to conclude that it had been in the Middle East possibly in Palestine.\nNew studies on contaminating human DNA and plant DNA from dust vaccuumed from the Shroud ( by Professor Fanti and an enlarged team of italian geneticists) coroborate the known historical Shroud trail.\nNO doubt blood marks on the occipital area area of the head image of the Shroud match the ones on the Sudarium of Oviedo, and this is not a matter of faith it’s enough to compare the photos side by side..\nThis is a subject that cannot be denied and recent studies by Centro Español de Sindonologia support this conclusion, and besides this fact is a classical argument against he validity of the infamous 1988 radiocarbon tests.\nYou must be aware that skeptics always try to deceive us denying evidences and spreading controversy\nWhen we study all the evidences pro and con the conclusion can be no other than the Shroud is indeed the cloth that wrapped the Body of Jesus Christ.\n                                                              regards\n                                               Antero de Fias Moreira\n                                  (Centro Português de Sindonologia)\n\n","date":"June 27, 2015 at 4:37 am","url":"https://shroudstory.com/2015/06/24/in-the-eyes-of-the-befuddled/","cat":"press_coverage","id":"comment-203825","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"In the Eyes of the Befuddled","post":"Why someone (perhaps often on this blog) writes the poorly researched stuffs?\nMaybe different types of explanations can be indicated…\nIn any case I have just read that:\n“An argument ‘premature’ may fail to attract attention even when presented by authors who have already built an important scientific reputation”\n\n","date":"June 24, 2015 at 11:46 am","url":"https://shroudstory.com/2015/06/24/in-the-eyes-of-the-befuddled/","cat":"press_coverage","id":"comment-203474","author":"piero","site":"shroudstory"},{"title":"In the Eyes of the Befuddled","post":"Here a link:\nhttp://www.nature.com/news/sleeping-beauty-papers-slumber-for-decades-1.17615\nSubject:\n‘Sleeping beauty’ papers slumber for decades\n(an article by Daniel Cressey)\nResearch identifies studies that defy usual citation patterns to enjoy a rich old age… \n>Some scientific studies are popular from the start, garnering multiple citations from other researchers. But others can languish as ‘sleeping beauties’ for more than a century before awaking to glorious approval, a study finds1.\n>Filippo Radicchi, a researcher in complex networks at Indiana University Bloomington, and his colleagues have analysed a set of 22 million scientific papers to identify such beauties — and to find the fairest of them all. … etc. … etc. …\n\n","date":"June 24, 2015 at 11:50 am","url":"https://shroudstory.com/2015/06/24/in-the-eyes-of-the-befuddled/","cat":"press_coverage","id":"comment-203475","author":"piero","site":"shroudstory"},{"title":"In the Eyes of the Befuddled","post":"Fr. D. Longenecker follows the traditional line. It also seems to be the path taken taken by US presidential candidate Bobby Jindal, governor of Louisiana, and a Hindu convert to Catholicism. Here is a news item about exorcism, about which both the Catholic priest and the Catholic politician have written:\n  http://www.washingtonpost.com/blogs/the-fix/wp/2015/06/25/a-presidential-candidate-first-jindals-witness-to-an-apparent-exorcism/\n\n","date":"June 25, 2015 at 11:53 am","url":"https://shroudstory.com/2015/06/24/in-the-eyes-of-the-befuddled/","cat":"press_coverage","id":"comment-203604","author":"Louis","site":"shroudstory"}]
