[{"title":"It’s the Cloth, Not the Image","post":"http://www.reuters.com/article/2013/04/14/us-pope-idUSBRE93D09A20130414\n\n","date":"July 20, 2014 at 10:27 am","url":"https://shroudstory.com/2014/07/20/its-the-cloth-not-the-image/","cat":"article","id":"comment-139475","author":"Louis","site":"shroudstory"},{"title":"It’s the Cloth, Not the Image","post":"Further to the above:\n“Progressive thinking”? Indeed it is there, but in the form of plagiarism. See Para. 2 in “Important notes” and the last question in the interview with Professor Giulio Fanti:\nhttps://shroudstory.com/2014/07/15/a-telling-interview-with-giulio-fanti/#comments\n\n","date":"July 20, 2014 at 12:48 pm","url":"https://shroudstory.com/2014/07/20/its-the-cloth-not-the-image/","cat":"article","id":"comment-139487","author":"Louis","site":"shroudstory"},{"title":"It’s the Cloth, Not the Image","post":"Further to the previous comments, it must be stated that Barth has been taken out of context. He was simply saying the obvious. Why? If Jesus came into our world as a divine being he also had to leave it in the same condition. The Protestant biblical scholar Ernst Käsemann described the whole scene in a different way, with no reference to mangers or tombs: Jesus is the only manifestation of God that Christians can see. It is a definition that can be accepted without hesitation by all Christians, whether liberal or conservative, in an increasingly sceptical (Western) world.\nThe Turin Shroud is said to be Jesus’ burial cloth, not the nappie he used in the manger.\nThere is a hidden agenda behind this. What is it? It is a cult-like devotion to Ray Rogers. Poor Barth must have turned over in his grave.\n\n","date":"July 21, 2014 at 12:08 pm","url":"https://shroudstory.com/2014/07/20/its-the-cloth-not-the-image/","cat":"article","id":"comment-139662","author":"Louis","site":"shroudstory"},{"title":"It’s the Cloth, Not the Image","post":"The statement “cannot be based on a real scientific and rational reflection” in no way implies faith cannot have rational reflection.\n\n","date":"July 20, 2014 at 2:59 pm","url":"https://shroudstory.com/2014/07/20/its-the-cloth-not-the-image/","cat":"article","id":"comment-139502","author":"Andy","site":"shroudstory"},{"title":"It’s the Cloth, Not the Image","post":"“Is it possible that the most important message of the Shroud concerns primarily the greatness of the love of God for all humanity much more than his own personal Resurrection, while showing us in graphic detail where such a God was willing to go with his human body in order to reveal to us that his merciful love for every human being has absolutely no limit at all when it’s time to save even the most lost of his children and, consequently, we have absolutely no good or rational reasons to fear such a loving and merciful God and to fear for our eternal salvation?”\nBeautiful statement, I wholeheartedly agree. The shroud has always been to me a 21century opportunity to “Behold the man” and decide on the question “Who do you say that I am?”\n\n","date":"July 25, 2014 at 11:31 pm","url":"https://shroudstory.com/2014/07/20/its-the-cloth-not-the-image/","cat":"article","id":"comment-140403","author":"Mike M","site":"shroudstory"},{"title":"It’s the Cloth, Not the Image","post":"I agree, this is a beautiful thought well written.\n\n","date":"July 26, 2014 at 11:40 pm","url":"https://shroudstory.com/2014/07/20/its-the-cloth-not-the-image/","cat":"article","id":"comment-140617","author":"Andy","site":"shroudstory"}]
