[{"title":"John Klotz’ Approaching Book on the Shroud","post":"As work on what will be the penultimate chapter of my manuscript, I thought my Law Review article from 41 years ago had preternatural relevance. The piece was written in 1971-1972 before the environmental community began to focus on “climate change”. Oil was a big source of pollution then as it is today. Alas, pollution seems to be small potatoes compared to climate change. \nHow does climate change connect to the Shroud? I give you the introduction to Chapter 17.\nThe Apocalypse of Selfishness: The Great “So What?”\n “When it is evening, you say, ‘It will be fair weather for the sky is red.’ And in the morning, ‘There will be a storm today, for the sky is red and lowering.’ You know then how to discern the face of the sky, and can you not know the signs of the times?”\nMatthew 16:2-4\nIt is my premise  that the Shroud of Turin is the authentic burial cloth of Jesus, called Christ, and that it offers evidence that supports the claim of his resurrection within three days of his crucifixion. The scientific examination of the Shroud began with the Secondo Pia photographs in 1898. Until then,  the facts concerning the death and purported Resurrection were essentially matters of faith drawing on the four Gospels accounts, the Epistles of Christ’s apostles and oral traditions of cloudy provenance. There were even those who claimed that Christ never existed at all. Science has now provided a rock of fact to which believers may cling. But so what?\nHere’s what: Humanity now faces an apocalyptical extinction as a species. Revelations and other apocalyptical writings have been until now mystical allegories and metaphors. But science is not prophesying in metaphors or allegories –  its prophecies of doom are based on hard facts.\nThe Apocalypse that threatens us is an apocalypse of selfishness. The heedless exploitation of our environment has resulted in multiple crises that demand immediate, concerted international cooperation and action, but the very apostles of selfishness that are driving humanity to the brink of extinction bar our way.\nFor prophecy of an apocalypse, let us turn to the current Roman Catholic Pope.\n“Small yet strong in the love of God, like Saint Francis of Assisi, all of us, as Christians, are called to watch over and protect the fragile world in which we live, and all its peoples.\nPope Francis\n¶216 Evangelii Gaudium\nDespite some criticisms from conservative elements in the Church, Francis has not retreated from his elevation of the environment to a religious issue. On May 21, 2014, Pope Francis told an audience; “If we destroy creation, creation will destroy us.” \nIs Francis right? Was his statement hyperbole or prophecy? Creation destroying us! Is he prophesying an Apocalypse?\n\n","date":"June 26, 2014 at 8:45 am","url":"https://shroudstory.com/2014/06/26/john-klotz-approaching-book-on-the-shroud/","cat":"article","id":"comment-132917","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz’ Approaching Book on the Shroud","post":"Hi John, nice to see you posting something after a long while. You asked me to contact you directly and I did so, and here we go now. Allow me to comment the following: I think you have chosen the wrong title. Why? Because you are playing into the hands of well-known scientists who deny any meaning in life, who say that selfishness has always been there and will always be there, we destroy creation and creation destroys us.\nUnlike Benedict XVI, Pope Francis was never a professor, a theologian or a philosopher, he was always a kindly parish priest, even as archbishop of Buenos Aires, so his intention is to be more practical, to help people live in a better way. Only, he does not understand that when he uses words like “fragile world in which we live” and “if we destroy creation,creation will destroy us” he does not take into consideration that we are also part of creation, there is an element of destruction everywhere, the reason for the fragile world. To go further, when you say “apostles of selfishness”, one must add that they also exist because there are the “faithful of selfishness”. \nIt is like a vicious circle,it is part of the show, it has something to do with the nature of human existence, or should we say existence as a whole? You may find something here:\nhttps://www.academia.edu/7343768/Viktor_Frankl_and_the_Human_Search_for_Meaning\nNow, on the other,  it is hard to agree with scientists who say that “science has now provided a rock of fact to which believers may cling”. That is an illusion, an appeal to scientism, one must insist that they may explain “how”, but not “why”.\nNice also to see you talk about the Resurrection. Russ Breault is also doing some excellent work with his talks about this event that is crucial to Christian faith and possible signs on the Shroud.\n\n","date":"June 26, 2014 at 10:26 am","url":"https://shroudstory.com/2014/06/26/john-klotz-approaching-book-on-the-shroud/","cat":"article","id":"comment-132935","author":"Louis","site":"shroudstory"},{"title":"John Klotz’ Approaching Book on the Shroud","post":"Louis,\nI could never locate your message. Try klotzlaw@gmail.com\nAs for your comment, I guess I am a “Chardinist” or “Teilhardist” (whichever) when it comes to science and religion. The fact that many scientist adopt “an argument from incredulity” as to Christ and the Resurrection,doesn’t change the fact that science itself is a search for truth and has made amazing progress in unraveling the mysteries of existence. It is now knocking on the door of the mystery of consciousness. It can’t be ignored or pigeon holed. \nThat is why I find the work of Hameroff so interesting. Again, I recommend a brief video of him:\n\nFor primitive man, anything inexplicable ended up as part of his religion. Thus the volcano was a god, the stars and planets were gods and everything that happened inexplicably was a visitation from god. As human knowledge expanded, the province of the gods shrunk. Now science is knocking on the door of ultimate issues.\nSome theologians and some science seek to avoid what Teilhard knew was an eventual merger of science into religion. You can’t avoid the science that is exploring the seminal issues of existence.\nThe first physicist to propound a theory of the “Big Bang” creation of the universe was a Belgian priest-scholar. He did it my simply taking the calculations that demonstrated an expanding, rather than a static universe and reverse them to an ultimate point where the Universe emerges with a “Big Bang” from nothingness, or what I prefer to call cosmic chaos. (That word may a-have a scientific definition of a state other than the one I prefer.)\nBut just as Galileo’s telescope first revealed the magnificent beauty and order of creation, science as to grapples withe the quantum and what lies beyond, is creating a “te deum” of its own.\nOf course many scientists are agnostic and atheistic, that’s their problem. In some recess of their minds they are apostles  of Nietzsche who propounded that “God is Dead.”\nSpoiler alert: That’s where I am heading with this chapter, the Apocalypse of Selfishness. We have institutionalized selfishness and besides Nietzsche, among the apostles of the Antichrist are Ayn Rand and the Austrian School of Economics. Those apostles are the subject Pope Francis withering  disdain. \nThat’s some agenda I have set for myself, I have already accumulated well over 100 items in my Apocalypse research folder (digitized). I believe in what I am doing and I think the pay-off is worth the candle, it is  however, proving to be a tough nut to crack. \nThank you. Your comments and references are always welcomed. \nStay tuned.\n\n","date":"June 26, 2014 at 11:27 am","url":"https://shroudstory.com/2014/06/26/john-klotz-approaching-book-on-the-shroud/","cat":"article","id":"comment-132944","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz’ Approaching Book on the Shroud","post":"Looking forward to the book, John. Heavy stuff!\n\n","date":"June 26, 2014 at 11:52 am","url":"https://shroudstory.com/2014/06/26/john-klotz-approaching-book-on-the-shroud/","cat":"article","id":"comment-132947","author":"David Goulet","site":"shroudstory"},{"title":"John Klotz’ Approaching Book on the Shroud","post":"Thanks John, I will stay tuned, we are both on the same track in a way, but it bifurcates now and then. Yet, there is no way of denying that you have much to offer and I wish you success.\nNietzsche was deep but perhaps not deep enough, he just dismissed Plato. To understand him we also need to look at his life, and beyond Safranski. He was also unconsciously a Christian, whatever he said about Christianity, that being the reason why he dispatched a letter to the Vatican’s Secretary of State before his death. He was being cynical in a way, but there can be no doubt that it looked like he wanted Christianity to be true and found it lacking. That was his point of view, but he spared Christ, he had no choice.\nYou mention the Belgian priest-scientist Father Georges Lemaitre, who first proposed the Big Bang, which is generally accepted today. Now when we come to the scientific definition of the state before that, we arrive at no conclusion. It is part of the ultimate issues scientists try to tackle, but surely beyond their field. It depends on more things, in the field of religion.\nWill contact you shortly.\nBest.\n\n","date":"June 26, 2014 at 1:54 pm","url":"https://shroudstory.com/2014/06/26/john-klotz-approaching-book-on-the-shroud/","cat":"article","id":"comment-132957","author":"Louis","site":"shroudstory"},{"title":"John Klotz’ Approaching Book on the Shroud","post":"I first become conscious of Nietzsche at Freshman philosophy class at SU which was more or less a survey course. I do not recall whether I had even heard of Nietzsche at that point but may have seen some tangential references that had registered very much. The Professor read “The Madman” to us and it was quite a moment. \nWhen the mad men told the people that God is dead but he has died beyond the space and news of his death hadn’t reached us yet, I was quite taken. Not by his philosophy but his insight. Nietzsche was primarily a late 19th century writer but I felt that the news of God’s death arrived with a bang in WWI and the reverberations of that echo still.\nHowever, philosophically, Nietzsche’s  philosophy of the superman beyond morality never became a part of my thinking.\nStrauss wrote a piece inspired by Nietzsche entitled “Thus Spake Zarathusta (auf Englshe). It’s opening bars were the introduction in the Kubrick and Arthur Clarke’s “2001, a Space Odyssey.” It was clearly informed by Nietzsche’s  superman credo. At the end, as the world is destroyed by nuclear one only one man, the surviving astronaut who has morphed into an eternal entity has survived.\nLike probably most movie goers, I never caught the Nietzsche reference at the time.\nIt is supreme irony, that 2001 came and there was one transcendent moment: the terrorist attack of 9/11.\nI may reference that when I deal with the apostles of selfishness.\n\n","date":"June 26, 2014 at 3:04 pm","url":"https://shroudstory.com/2014/06/26/john-klotz-approaching-book-on-the-shroud/","cat":"article","id":"comment-132969","author":"John Klotz","site":"shroudstory"},{"title":"John Klotz’ Approaching Book on the Shroud","post":"John, I am not one for fiction and films, although I agree that they can convey some truths. That being so, I did not read Arthur Clarke. Perhaps you may want to read something about the work of the priest Father Mervyn Fernando, who got his Master’s at Fordham and worked on the thought of Teilhard de Chardin, and was a friend of Clarke for 25 years.\nCuriously, Charles Pellegrino consulted him about the meaning of Jesus’ resurrection before writing the “Jesus family tomb” and heard those verses in Corinthians penned by Paul. The priest also told him that he had found a tomb — the one where doubting Thomas was buried.\nFather Fernando wrote about RD:\n   http://www.island.lk/index.php?page_cat=article-details&page=article-details&code_title=44401\nThe other link to him:\n http://www.archdioceseofcolombo.com\nSuccess!\n\n","date":"June 26, 2014 at 3:50 pm","url":"https://shroudstory.com/2014/06/26/john-klotz-approaching-book-on-the-shroud/","cat":"article","id":"comment-132979","author":"Louis","site":"shroudstory"},{"title":"John Klotz’ Approaching Book on the Shroud","post":"Another aspect of consciousness to be taken into account is animal consciousness, acknowledged in the “Cambridge Declaration of Consciousness”. It will no longer be a neglected field and is something beyond the purview of the Bible. Questions will be asked: what is the purpose of animal consciousness? What goes on in the mind of those animals who are led to slaughter or are victims of blood sacrifice? Are there levels of consciousness, differences between mammals and non-mammals?\nThere is much more to say, but this is just the beginning.\n\n","date":"July 2, 2014 at 8:18 pm","url":"https://shroudstory.com/2014/06/26/john-klotz-approaching-book-on-the-shroud/","cat":"article","id":"comment-134966","author":"Louis","site":"shroudstory"},{"title":"John Klotz’ Approaching Book on the Shroud","post":"http://www.voanews.com/content/pope-calls-exploitation-of-nature-a-sin/1951447.html\nPope Francis is a man worthy of great respect, particularly on account of his humanity, but he should take more things into account: Do we destroy nature? Yes, we do. But then nature also destroys us when it wants to.\n\n","date":"July 5, 2014 at 2:56 pm","url":"https://shroudstory.com/2014/06/26/john-klotz-approaching-book-on-the-shroud/","cat":"article","id":"comment-135517","author":"Louis","site":"shroudstory"}]
