[{"title":"A New Image","post":"Glaudeamus Igitur\n\n","date":"December 18, 2013 at 9:42 am","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","id":"comment-61544","author":"John Klotz","site":"shroudstory"},{"title":"A New Image","post":"They finally found a pope they like. That’s great. Now if they would just listen to what he says…instead of what they *think* he says…\n\n","date":"December 18, 2013 at 10:53 am","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","id":"comment-61574","author":"Jeffrey Liss","site":"shroudstory"},{"title":"A New Image","post":"And what do YOU think he says Jeffrey?  I’m curious to know…\n\n","date":"December 18, 2013 at 12:27 pm","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","id":"comment-61628","author":"Anonymous","site":"shroudstory"},{"title":"A New Image","post":"I refer to translation in the literal sense.  The man thinks in Spanish and, to some extent Italian.  The statements he makes — the ones most misunderstood — are usually expressed in Italian (a second language), then translated, often inexpertly by those lacking necessary context, into English.  In this form, they propagate within a global press that, while not *entirely* hostile, tends to exhibit a uniform incompetence when reporting on the Catholic Church.\nIn short, one should be exceedingly skeptical of statements attributed to Pope Francis in the popular media.  There have now been multiple cases were what was reported was, in fact, the exact opposite of what the pope actually said.  Find a competent source and trust *only* translations provided by that source.  I recommend Fr. John Zhulsdorf.  When I want to know what the pope *really* said, I read his blog.\n\n","date":"December 18, 2013 at 12:38 pm","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","id":"comment-61635","author":"Jeffrey Liss","site":"shroudstory"},{"title":"A New Image","post":"This is a season to celebrate the Birth of Chhrist. Perhaps the sour pusses could stop sucking on heir lemons and rejoice.\nHow far Pope John can go is an interesting question. He made some remarkable appointments and non-appointments in the past few days which auger well in my opinion.\nThere have been many interesting incidents that give an insight into this Pope’s soul. One the most interesting was that he personally contacted a an unwed woman carrying the child of her married lover (he apparently had concealed his marriage.) One of the woman’s concerns was that since she wasn’t married, her child would not be baptized. Pope Francis comforted the woman by  by promising to baptize the child himself. \nThe other day out of curiosity I checked the church bulletin at my local parish. Sure enough, when it talked about ground rules for baptizing an infant it required a review of the parent(s)’ and God Parent(s) appropriateness.\nThe there is the issue of communion which some prelate’s in the US have  been threatening to deny to recalcitrant  politicians who did not toe the Church’s mark on a number of issues including gay marriage, contraception and abortion. Francis has said words to the effect that we need communion to nourish us because we are all sinners.\nHos recent appointments give us solid indication about his attitude towards the right wing ideologues who have recently controlled the US Catholic Bishop’s Conference. I expect his language in private is reflective of his actions in public.\nGaudeamus Igituer\n\n","date":"December 18, 2013 at 12:47 pm","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","id":"comment-61640","author":"John Klotz","site":"shroudstory"},{"title":"A New Image","post":"I’m currently reading “Pope Francis” by Matthew E Bunson, published by ‘Our Sunday Visitor’, 2013, soft cover, 230 pp. A recent acquisition in my local public library. First 60 pages covers Pope Benedict and his decision to resign the papacy. Quite a lot on the excesses of the right-wing excesses of previous Argentinian regimes and persecution of the Argentinan church. Doubtless it left its mark on Francis, and has shpaed his attitude on the need for transparency and openness.\n\n","date":"December 18, 2013 at 3:02 pm","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","id":"comment-61723","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A New Image","post":"David, a new book entitled “La Lista de Bergoglio. I salvati de Francesco durante la dittatura” by Nello Scavo (Bologna, EMI) was launched this year in Italy and is expected to be translated into several languages. The title in English would be “Bergoglio’s list” and it is about the more than 100 lives that the then Cardinal Jorge Mario Bergoglio of Buenos Aires saved during the terrible dictatatorship in Argentina. I received a copy for review today although I didn’t want it, reluctant as I am to write much on politics, but of course a short article will have to be written. This is in fact the second book on Pope Francis I received for review, the other one is by the German journalist and author, Andreas Englisch, who was a Vatican correspondent for around 20 years. \nThe “caudillo” mentality still prevails in much of Latin America and is a leftover of the colonial regimes, Portugal and Spain competing for land and power. There is a good film about the Jesuits who were the first to establish a civilisation in the region. It is “The Mission”, starring Robert de Niro and Jeremy Irons, and won two Oscars. It a long film, almost 3 hours, filmed in Brazil and Colombia, but worthwhile watching because you learn a lot and you will probably find it on youtube.\n\n","date":"December 18, 2013 at 7:37 pm","url":"https://shroudstory.com/2013/12/18/a-new-image/","cat":"press_coverage","id":"comment-61921","author":"Louis","site":"shroudstory"}]
