[{"title":"Maybe the devil made them post this","post":"Of course Piczek is not a physicist. She is not a scientist. This is the stuff of comic books.\n\n","date":"October 15, 2015 at 8:11 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212554","author":"Paulette","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"I posted the following comment two years ago under In case you missed Isabel Piczek’s wonderful paper after Hugh Farey asked, “Can anyone anywhere explain why Isobel Piczec is referred to as a physicist?” Mine, was not the only comment:\n\nThere are many references to Dame Piczek as a particle physicist, a theoretical physicist and a Hungarian trained physicist. Then there is this nice but far too short biography from the Miner Messenger, a publication of the alumni, friends, and parents of Bishop Manogue Catholic High School in Reno, Nevada. I wish I knew more.\nChapel Stained Glass Artists Have International Reputation\nBishop Manogue has been graced with the works of remarkable and\ninternationally famous artists, the sisters Isabel and Edith Piczek. Both sisters were born in Hungary. They were friends of Sister Ida, Foundress of the Sacred Heart Sisters who provided years of ministry in the Diocese of Reno. Isabel, our principal contact, won a national competition for painting at a very early age, and at thirteen she decorated her first church with stained\nglass. Young Isabel, a Catholic, got herself into religious conflict with the communist government of Hungary and had to flee her country, accompanied by Edith, her sister and colleague.\nAlmost immediately after her arrival in Rome, she won the International Grand Award for Painting and another competition to paint a 400 square foot fresco mural at the Vatican’s famous\nPontifical Biblical Institute. She spent three years in Rome. During this time she completed another 42 murals at the Precious Blood Monastery of Rome and elsewhere.\nShe also pursued her other interest, particle physics.\nLeaving Rome, Isabel came with her sister to the United Stated and with her she established her art studio, the Construction Art Center in Los Angeles. To date she has completed huge murals, mosaics, ceramic tile murals and stained glass windows for 493 churches and public buildings in seven countries on three continents.\nIn addition to her outstanding work in the Bishop Manogue chapel, some of Isabel’s major works can be found at the St. Thomas Aquinas Cathedral and Our Lady of Snows parishes in Reno;\nthe Guardian Angel Cathedral in Las Vegas; the Basilica of the National Shrine of the Immaculate Conception in Washington, D.C.; Holy Cross Mausoleum in Culver City, California; Holy Family Cathedral in Orange, California; and numerous other buildings in California, Rome, Canada, Illinois, New Mexico and elsewhere.\nMs. Piczek is also an internationally known expert on the Shroud of Turin. She has appeared many times on national television.","date":"October 16, 2015 at 2:06 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212636","author":"Dan","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"And here is a Wikipedia article on Isabel Piczek.\n\nIsabel Piczek (born 1941) is a Hungarian born ecclesiastical artist and physicist, perhaps best known for her study of the Shroud of Turin, and who currently lives in Los Angeles. Her sister, Edith Piczec, was also a noted religious artist.\nPiczkc, as with her sister Edith, was born in Hungary, where her father was a noted artist and art professor, and graduated from the Academy of Fine Arts in Budapest. After World War II, however, the sisters fled to Rome during the Communist regime to pursue their work in sacred art. There, whilst still only teenagers, they won a 1949 competition to paint a mural at Rome’s Pontifical Biblical Institute.\nBy 1955 they were in Canada and shortly after arrived in Los Angeles to pursue their combined talents. In Las Vegas, Edith designed the 2,000 square-foot mosaic on the façade of the cathedral that illustrated the roles of the Guardian Angel.[1]\nIn 1992, Piczek was honoured by Pope John Paul II in recognition of her prolific artistic achievements, examples of which can be found in nearly 500 different cathedrals, churches and other buildings across the world.[2] Cardinal Roger Mahony, Archbishop of Los Angeles, conferred on Piczec admission into the Pontifical Order of Saint Gregory, and the title Dame of Saint Gregory, whereby she became one of only 70 Knights and Dames throughout the world who hold this honour.[3]\n\n","date":"October 16, 2015 at 2:25 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212638","author":"Dan","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Having been born in 1941 and claiming to be only a teenager in Rome in 1949 does not compute. Did Piczek return to communist Hungary after arriving in Canada and the U.S. in order to become a Hungarian trained physicist or did she study physics in grade school? Did she formally study physics anywhere at anytime? She is a great artist. She should leave it at that. \nThe fantasy resurrection scenarios of Piczek, Jackson and Lavoie are why people scoff at the Shroud.\n\n","date":"October 16, 2015 at 9:22 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212655","author":"Paulette","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Most of the material form the Wiki page is unreferenced, including the date of birth. But it is possible that actual date of her birth is unknown, as during that time (WWII and her escape from communist Hungary) it was very likely for documents to get lost. So date of birth written in her documents may be quite arbitrary. \nI do not consider some parts of Piczek  resurrection theory credible, for several reasons (you have some of them here: https://shroudofturin.files.wordpress.com/2015/10/3dproperties6_3.pdf ) regardless whether she has a formal degree in physics or not.\nI agree that more transparency in Shroud reasearch is needed, to avoid some spoof or dubious claims by various experts or “experts”.\nNevertheless, we should discuss arguments, not people.\n\n","date":"October 16, 2015 at 11:08 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212667","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"And this is why, in my opinion, the Church/Turin has an obligation to further test the Shroud. In the absence of truth this kind of superstitious nonsense abounds. Superstition slowly poisons faith.\n\n","date":"October 15, 2015 at 8:46 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212558","author":"David Goulet","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Good catch by a reader. I posted Satan and his clever Shroud of Turin trickery in January of 2012. I had forgotten that.\n\n","date":"October 15, 2015 at 11:53 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212570","author":"Dan","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"So it did sound familiar after all.\n\n","date":"October 15, 2015 at 12:45 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212575","author":"David Goulet","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Piczek is a physicist, and a gifted large form artist that won commissions even as a young lady (teen I think), but speaking as a nuke eng – I don’t know what she has been smoking when she talks about her event horizon ideas – google it, there’s videos of her talking about it with dramatizations.  It’s weird that the shroud image is undistorted.  If it’s a fake, that’s what you would expect from an artist doing something to a flat sheet, unless made in the manner of Colin Berry’s experiments where you would expect some distortion and forshortening from projection.  There’s diffenently projection shortening going on under the legs, and the top the legs look longer, like the shroud is following the general contour of the top – so the shroud being pulled taunt while imaging was happening wouldn’t have to be the case.\nI imagine the shroud loosely draped over the body, pulled and tucked around the feet, and then something imaged the body only from up-and-down direction and not perpendicular from the skin surface (there is no image from the side of the body or arms and legs).  The imaged depended a bit on the pressure, as IMHO the back side looks more distinct than the front.  So the either the resurrection event produced energy up and down, or a natural effect (radiation? piezo-electrical?) from the stone slab/bench and the roof of the tomb or niche in the tomb, or the faker for some reason used only a bass relief, as Colin asserts, but I don’t know why or how he could have done under the legs – or with what to make the image.\nWasn’t it Rodgers who worked out a theory that the image could be be a chemical reaction from the body and ointments, worked out that it would take about two days to get a good image and more would over-saturate it – and then realized that the only way decay products wouldn’t be embedded in the shroud or that 1st century Jews would touch such a cloth on the third day stopping the process, would be if the body wasn’t there….(and that is what really stopped the process…)\n\n","date":"October 15, 2015 at 2:27 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212581","author":"Jim Giordano","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"“Piczek is a physicist”. No.\n“It’s weird that the shroud image is undistorted.” No. Or rather, it depends what you mean by undistorted, especially as in the next paragraph you explain that it is distorted, by “projection shortening”. It is not clear what you mean by “There’s diffenently projection shortening going on under the legs, and the top the legs look longer, like the shroud is following the general contour of the top – so the shroud being pulled taunt while imaging was happening wouldn’t have to be the case.” I think you are suggesting that the front image looks longer than the back image? This would be logical if the Shroud followed the contours of a flexed body (head slightly raised; legs slightly bent)  across the top, but was horizontal across the bottom. However, remarkably, this is exactly the opposite of what most people, including Isobel Piczek, observe, which is that the dorsal image seems longer than the ventral.\n\n","date":"October 15, 2015 at 5:39 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212600","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"I meant that we don’t see the sides if the imaged areas, its like light from top and bottom reacted with the flesh to generate a reaction in the flesh that then dehydrated the fibres.  If it was the body on its own then the sides of the body would have affected the fibres too – unless it was pulled tight side to side so that it wasn’t in line of sight of the body.  The shroud seems to follow the body around its head to foot perimeter but no around the other direction.  However it has been shown that the blood stains do seem to follow around the body contours in both axises (axes?)(axis’s?).  See how that starts to affect our understanding of how the Shroud was faked, made naturally, or shows how the Resurrection happened.  Is it possible, that if the Shroud was just allowed to drape around the body, but tight around the head and feet since we have a good image of the feet, that the imaging process would be gentle enough not to affect the fibres noticeably, but yet strong enough to give the image that we have.  Why is there no image of the top of the head? (just the water stain)?\n\n","date":"October 16, 2015 at 9:24 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212736","author":"Jim Giordano","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Yes, I think I understand your point. Some people have suggested that the herringbone weave makes a cloth stiffer in the width than in the length, so that it drapes well, as you suggest, along the contours of the length of the body but does not flop down the sides very well. I don’t know if this is true.\nThe idea that the cloth had two configurations while it enveloped the body has also been explored, but is not very satisfactory. If it was wrapped close around the body to receive the contact bloodstains, then the circumstances in which it was straightened out to receive the ‘radiation’ image are difficult to explain.\n\n","date":"October 17, 2015 at 1:21 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212766","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hugh & Jim:\nThere was no vertical projection, nor two configurations of the Shroud. \nI explained it in my presentation:\nhttps://shroudofturin.files.wordpress.com/2015/10/3dproperties6_3.pdf\nApparently you haven’t familiarized with it yet.\n\n","date":"October 17, 2015 at 4:52 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212791","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Jim:\n1)  Draping of the cloth:  If you haven’t already caught up with it, you need to check out paper by Mario Latendresse. “The Turin Shroud Was Not Flattened Before the Images Formed and no Major Image Distortions Necessarily Occur from a Real Body”  This URL works, but you need to click on the download links there:\nhttp://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.160.656   \nAlso the sindonology site had several of his slides, most informative.  If they’re still there it’s at:\nhttp://www.sindonology.org/papers/latendresse2005aSlides.pdf   \n2)  Wrapping over the head:  We discussed this here over a year ago.  Mario shows the cloth loosely draped over the head, but a few of us were not convinced.  You need to go to Shroudscope;  You can measure the dimensions between the various features.  Using a tape measure, find the distance between the tip of your nose and the bump on the back of your head; It’s probably about 37 cm – 40 cm.  Try to identify these features on shroudscope and measure the distance.  I think you might be persuaded that the cloth was placed firmly over the top of the head.  Why then is there no top-of-head image?  Possibilities: (i) type of funerary cap or jaw strap masking the Shroud cloth; (ii) the imaging process acted near vertical only;  (iii) a mystery.    \n3)  Orthogonality of the image, no imaging of sides:  Loose draping of the cloth, with the intention to complete the burial rites after the sabbath might be a sufficient explanation, but a few believe that the wrapping would have to be completed on the day of burial regardless.  That means the imaging process would have to be constrained vertically.  I’ve previously been an advocate of a paper by Giovanna de Liso, (a protegee of Giuilo Fanti), who carried out a lot of research on imaging caused by seismic action in Piedmont.  She seems to have obtained images which may be associated with seismic variations in geomagnetic & geoelectric fields, but many are not persuaded by it.  Nevertheless I think it’s possible that there may be something in it.  Otherwise we seem to be left with either a miraculous explanation or some unknown process by an artisan.\n\n","date":"October 17, 2015 at 5:11 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212797","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Both OK and daveb make valid points, but none can be said to be generally accepted or scientifically explained. Perhaps the majority of the authenticists agree that whether by nuclear, electromagnetic or other radiation, or by vapour emission, the transmission of image from body to cloth was almost exactly vertically up or down, and not perpendicular to the body, or to the cloth, or any halfway stage between. This is in order to explain not the minor irregularities of the face, but the complete absence of anything representing the flanks or sides of the legs, and also the precision of the features and the mathematical intensity-distance relationship, which requires collimated emission to make any sense at all. Giovanna de Liso’s discoveries regarding earthquake images are in need of verification, but there is precious little else scientific that bears credence.\nIn his paper, OK attempts to demonstrate that the Shroud shows a minor version of the Agamemnon face effect, by manipulating the width of the face to fit his hypothesis. On Page 17 (“Let’s compare the results”) he says that by removing the weave and the banding, the Shroud face appears wider. Actually it appears wider because it has been stretched sideways by about 5%. On Page 18 (“3D Comparison”), where we are told the image on the right looks “much more realistic”, it has been stretched by nearly 20%, and on Page 23, to show how well the Shroud fits the Agamemnon mask (“Yeah!”) it is widened by over 30%. If the real Shroud were remoulded into a 3D figure in the same way that can be done with the mask, it would be seen to represent a wholly anatomically impossible human head. OK’s confidence in his paper is, in my opinion, overstated.\n\n","date":"October 17, 2015 at 9:57 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212834","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hugh:\nPerhaps the majority of the authenticists agree that whether by nuclear, electromagnetic or other radiation, or by vapour emission, the transmission of image from body to cloth was almost exactly vertically up or down, and not perpendicular to the body, or to the cloth, or any halfway stage between.\nNonsense. Although assumed in many papers (including the most influential ones) the transmission certainly wasn’t vertical. \nIn his paper, OK attempts to demonstrate that the Shroud shows a minor version of the Agamemnon face effect, by manipulating the width of the face to fit his hypothesis\nHugh, nothing is manipulated here. The Shroud face actually is the Agamemnon face. You need a little bit of spatial imagination (which was lacking for over 30 years in Shroud scholarship, and I say this with a full responsibility) to get aware of this extremely important point.\nIf you want, you can try yourself:\n","date":"October 17, 2015 at 11:41 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212839","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"OK may disagree with the “majority of the authenticists” (I do myself, but for different reasons), but I think that collimated transmission, and that vertically up and down, is indeed what the “majority of the authenticists” believe.\nIt is convenient to take measurements of the Shroud from Shroud Scope. Readers are invited to take a couple, of their own choice, one vertical and one horizontal, and calculate the ratio between the two. Repeating those measurements using the image immediately above OK’s in the paper he quoted, they will find that the width of the Shroud has been considerably increased. They will therefore be surprised to find that the image of the Shroud immediately above this post is correctly proportioned. In this case, however, they should measure the image of the Mask of Agamemnon, both in the original paper and above, when they will find that the mask has been considerably narrowed from what it was in the paper!\nHow extraordinary. I order to reconcile these problems we must remember that the Shroud is, of course, flat, but the mask of Agamamnon, although its ears have been squashed outwards, is not at all flat, but maintains its original “face profile” rather well. See, for example, the three-quarter profile at http://images.fineartamerica.com/images-medium-large/mask-of-agamemnon-2-bob-christopher.jpg.\nSo, apart from the ears, the flat Shroud neatly reproduces the curved face of Agamemnon. This is not evidence for any kind of drape, but rather for the vertical radiation hypothesis OK rejects.\nI am intrigued by the statement, “the transmission certainly wasn’t vertical.” If the darkness/distance correlation exists at all, it is important that whatever emerged from the body at a specific point was represented on the cloth at a specific point. OK admits that if the radiation is not collimated this “theoretically may result in multiple images of the same body points”. Quite so. If the transmission is perpendicular to the surface of the body or the surface of the Shroud, then some parts of the Shroud would receive no radiation at all, and not darken, while other parts would receive radiation from several places, and therefore darken more than they would if they only received radiation from only one place. The sides of the nose, for example, would be dark, but this is not what is observed on the Shroud. OK actually says of his 4 diagrams of possible transmission that “all 4 ways give similar results.” So, how can he be so dogmatic that “the transmission certainly wasn’t vertical”?\n\n","date":"October 17, 2015 at 1:25 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212848","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"OK may disagree with the “majority of the authenticists” (I do myself, but for different reasons), but I think that collimated transmission, and that vertically up and down, is indeed what the “majority of the authenticists” believe.\nMaybe. But I strongly disagree.\nIn this case, however, they should measure the image of the Mask of Agamemnon, both in the original paper and above, when they will find that the mask has been considerably narrowed from what it was in the paper!\nHere you have a screenshot of the previous comment:\n\nHow can I convince you that the Shroud face is indeed the mask of Agamemnon effect?\nI order to reconcile these problems we must remember that the Shroud is, of course, flat, but the mask of Agamamnon, although its ears have been squashed outwards, is not at all flat, but maintains its original “face profile” rather well.\nAnd fine! Of course neither the mask is completely flattenen, nor the Shroud was tighly pressed to the face (rather loosely draped, see blue line on Slide 6).\nThe sides of the nose, for example, would be dark, but this is not what is observed on the Shroud.\nQuite contrary, if you look at the Shroud carefully.\nOK actually says of his 4 diagrams of possible transmission that “all 4 ways give similar results.” \nSlide 7: “Generally, as first approximation, all 4 ways give similar results, but there may be subtle differences between them.”\nSo, how can he be so dogmatic that “the transmission certainly wasn’t vertical”?\nSo, apart from the ears, the flat Shroud neatly reproduces the curved face of Agamemnon. This is not evidence for any kind of drape, but rather for the vertical radiation hypothesis OK rejects.\nExactly opposite: it disproves vertical projection. Use your imagination and guess where hair should be -roughly in the ears area, on the sides of the head. Compare it with the mask of Agamemnon and Lavoie’s diagrams (slide 23). See the position of bloodstains.\nThe vertical projection cannot be maintained any longer.\n\n","date":"October 17, 2015 at 2:00 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212851","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hugh: here you have the exact dimensions of Agamemnon mask:\nhttp://odysseus.culture.gr/h/4/eh430.jsp?obj_id=4503\nwidth: 0,017 m, height: 0,025 m\nThe dimensions of Shroud face (with hair) are roughly similar:So maybe instead of hinting that I manipulated something, you would rather admit me right?\nOr do you prefer to run away and hide?\n\n","date":"October 17, 2015 at 3:37 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212858","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Please don’t think that a few hours delay in replying constitutes running away. Nothing could be further from the truth. I think I understand your paper thoroughly, but cannot derive the same conclusions as yourself. \nFirstly, can we ignore the ludicrous dimensions you quote? The Mask of Agamemnon is life size, not a few millimetres in each direction, and it is roughly as wide as it is high. The reproduction in Valladolid is 25cm x 28cm, and one in New York is 26cm x 25cm. However, the most important dimension is not the height or width, but the third. If the mask was laid flat on a table, how high would the nose be above the table surface? The Met Museum copy gives this as 7cm. A cloth pulled tightly over the mask, in a straight line from ear to nose to ear would be three or four centimetres wider than the mask, and if it was loosely draped it would be even wider. If the Shroud does indeed exactly match the width of the Mask (or of a theoretical body), then it cannot have been draped over it. It must have been more or less horizontal, and the image therefore projected vertically. \nFar be it from me to insinuate anything. I measured, and requested my readers to measure, the dimensions of the various copies of the Shroud you reproduce in your paper, often side by side, as on Pages 17,18 and 23. The image gets progressively wider and wider in proportion to its height, as specified. You are very welcome to check this for yourself; after all, its your paper. The progressive distortion, which incidentally fits your hypothesis of a loosely draped cloth, may be an inadvertent artefact of the pdf, but it cannot be denied that it is there.\n\n","date":"October 17, 2015 at 5:35 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212862","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hugh:\nI measured, and requested my readers to measure, the dimensions of the various copies of the Shroud you reproduce in your paper, often side by side, as on Pages 17,18 and 23. The image gets progressively wider and wider in proportion to its height, as specified. You are very welcome to check this for yourself; after all, its your paper. The progressive distortion, which incidentally fits your hypothesis of a loosely draped cloth, may be an inadvertent artefact of the pdf, but it cannot be denied that it is there.\nThe aspect of different pictures may change slightly from slide to slide, as they were put there in a way to include as many of them on individual slides, as necessary. But this is irrelevant, as just the original images, before insertion into presentation, count. \nHere you have original images from Slide 23. There are only two actually:Firstly, can we ignore the ludicrous dimensions you quote? The Mask of Agamemnon is life size, not a few millimetres in each direction, and it is roughly as wide as it is high. The reproduction in Valladolid is 25cm x 28cm, and one in New York is 26cm x 25cm.\nI have noticed this. The quoted 17 cm must be then probably cheek to cheek width. But this is similar to the Shroud.\nAnyway, what’s important, is the Lavoie’s diagram on the left of Slide 23. See the position of bloodstains apparently in the hair. Then look on the comparison with Agamemnon mask on the right. Check where the hair should be, if the Shroud shows similar flattening of a 3D object.\nThen you can easily understand that the projection cannot be exactly vertical.\nHowever, the most important dimension is not the height or width, but the third. If the mask was laid flat on a table, how high would the nose be above the table surface? The Met Museum copy gives this as 7cm.\nCyrano de Bergerac? The actual nose protrusion rather doesn’t exceed about 3 cm. It is most likely because the Mask is not fully flat.\nA cloth pulled tightly over the mask, in a straight line from ear to nose to ear would be three or four centimetres wider than the mask, and if it was loosely draped it would be even wider. If the Shroud does indeed exactly match the width of the Mask (or of a theoretical body), then it cannot have been draped over it. It must have been more or less horizontal, and the image therefore projected vertically.\nNonsense. Just look at Lavoie’s figures: they show the linen actually draped over the body. And as to frontal face distortions check Mario’s paper:\nhttps://www.academia.edu/9063899/The_Turin_Shroud_Was_Not_Flattened_Before_the_Images_Formed_and_no_Major_Image_Distortions_Necessarily_Occur_from_a_Real_Body \nhttp://www.sindonology.org/papers/latendresse2005aSlides.pdf\nor as, a last resort: tape measure, life volunteer  & Shroud Scope. You will realise that everything is fine.\n\n","date":"October 17, 2015 at 7:09 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212865","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"I still do not clearly follow your reasoning. Your own measurements from the ingenious Lavoie image of a cloth superimposed on a man show that while an actual width of the face is 8.8cm, a contact image produced by such a drape would be 12.2cm, an increase in width of nearly a third. Is this what you call a ‘minor distortion’? Is so, then I do follow your reasoning, but simply disagree that increasing the width of an image by a third is a minor distortion. Other people have suggested that the actual width of 8.8cm is represented by a vertical transmission image which is also 8.8cm. This would come about if the cloth were held flat above the body.\nI do not know how deliberate – perhaps not at all – the different widths of the face in your paper are. Here are the ones I was referring to.\n\nYour comment about Cyrano de Bergerac is silly. The Agememnon mask, laid on a table, projects 7cm above the table, as I said. It is about 25cm across. In simple mathematical terms, an equilateral  triangle 25cm across and 7cm high has diagonal sides of 28.6cm. A cloth stretched tight across the face would be that wide. If it were more loosely draped it would be wider still. How is this observation nonsense?\nFinally, checking things with calipers and a tape measure, I find that the distance measured by a tape measure across my nose from ear to ear is well over 25% more than the distance measured directly using calipers. Have you tried the same?\n\n","date":"October 18, 2015 at 3:06 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212879","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hugh, do I really need to show you evidence that all those images were originally the same size:In simple mathematical terms, an equilateral triangle 25cm across and 7cm high has diagonal sides of 28.6cm. \nAbout 14 % increase. Hardly a major distortion. About a centimeter in this or that way for a face width, had there been vertical projection. Hardly noticeable at first glance.\nHugh, read carefully those two papers:\nErcoline, W.R., R.C. Downs, Jr. and J.P. Jackson, “Examination of the Turin Shroud for Image Distorions,” IEEE 1982 Proceedings of the\nInternational Conference on Cybernetics and Society, October 1982, pp.  576-579 and Mario Latendresse’s „Evidence that the Shroud was not Completely Flat during the Image Formation” from the 2005 3rd  International Dallas Conference\nThe results there are similar to the increase you calculated. They are consistent with human body shape. The shape of the linen draped around the head is similar to the one presented as blue line on Slides 6 & 9 of Part 3 of my presentation, and also similar to the Fig. 7 & 8 in Ercoline et al., and Fig. 4 & 5 in Mario’s paper. With the notable difference that the linen is in contact with sides of the head (see Slide 24 in my Part 3). The cloth was neither in direct contact with the face everywhere, nor was completely flat surface. It was about halfway between them. That’s why it is analogous with the mask of Agamemnon.\n\n","date":"October 18, 2015 at 5:48 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212885","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Well, I think we’ll have to leave it at that. Now that you seem to agree that the heads in your paper were distorted widthwise, and produce two heads of the same proportion above, the upper one looks a good deal more realistic to me, but not to you. It’s a matter of opinion.\nAlthough a mathematically calculated triangle shows a 14% increase in length via the two angled sides – not a major distortion perhaps – the Latendresse practical equivalent shows a 28% increase, which I do consider a major distortion. Maybe you don’t. it’s a matter of opinion.\nI know the papers you refer to well. The old Ercoline and Jackson paper is extremely detailed, and compares 23 measurements of a set of 98 living people with their equivalents on the Shroud. Without going into the uncertainties of this exercise (how you make a precise measurement involving the elbows or nipples of the Shroud image, for example), I can be seen that Ercoline and Jackson find that in only 5 cases does the Shroud measurement exceed the human measurement by more than 10%. These are in two hip-width measurements, two finger-length measurements and a forearm measurement (with all the uncertainty of not knowing where the elbow is).\nThe only two face-width measurements show that the Shroud image is 6% and 8% wider than the equivalent human width respectively. This is interpreted as indicating some distortion. However, as it is wholly insufficient to be produced by a loosely draped cloth covering a real head, the authors come to the conclusion that: “The character of the distortions and some anomalies of the image seem to be best explained by a vertical mapping process.” I agree with Ercoline. You don’t. It’s a matter of opinion.\n\n","date":"October 18, 2015 at 12:55 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212910","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hugh: Check Mario measurements from Slides 16-17 (Shroud) of his presentation and the Slide 21. \nhttp://www.sindonology.org/papers/latendresse2005aSlides.pdf\nYou will see that the results are fully consistent, and so is the Shroud draped over the face.\nhttp://www.sindonology.org/papers/latendresse2005aSlides.pdf\nHowever, as it is wholly insufficient to be produced by a loosely draped cloth covering a real head, the authors come to the conclusion that: “The character of the distortions and some anomalies of the image seem to be best explained by a vertical mapping process.” I agree with Ercoline. You don’t. It’s a matter of opinion.\nIt is not a matter of opinion, definitely! Ercoline, Downs & Jackson correctly observed that for the frontal face area (and most of the rest of the body), the vertical projection is the most consistent with observed distortion profile, in comparison with two alternative hypotheses (projection perpendicular to the body or the cloth). But they missed something. They missed the possibility of other ways of projection, for example the projection through the shortest path between the body and cloth (see Part 3 of my presentation, Slide 7, figure 4). This is also the way of projection indicated by Mario:\nSee how it works:\n\nIn the front face area it is close to vertical mapping. But this is not the case for sides! where it is more perpendicular to the body (similar to contact process).\nHad Ercoline, Downs & Jackson (or Lavoies, or anybody else) analysed the Shroud image a little bit more carefully they would have found the analogies to the  Mask of Agamemnon effect. \nThe vertical projection myth really confused Shroud scholarship for more than 30 years.\n\n","date":"October 18, 2015 at 6:09 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212937","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"I have referred to, read and checked your references many times. Mario Latendresse found that a cloth draped over a head face was 28% wider than the head, but Ercoline found that the image on the Shroud was only 6% wider than a head. Therefore the Shroud could not have been formed by a ‘shortest path’ mechanism, and something more like a vertical mechanism would fit the measurements better. Both Latendresse and Ercoline make this explicit. As far as I know you are alone in maintaining that the vertical transmission hypothesis is impossible on measurement grounds alone, although there are good reasons for suggesting that it is impossible in terms of the physics of radiation.\n\n","date":"October 19, 2015 at 4:37 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212974","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hugh:\nMario Latendresse found that a cloth draped over a head face was 28% wider than the head, but Ercoline found that the image on the Shroud was only 6% wider than a head. \nBecause the two papers compare measurements of different face areas. For Ercoline they are: I “width of the face at hair/face intersections a long horizontal level through the center of eyebrows”  and J “width of the face at bone structure at edges of eye sockets”, where distortions should be relatively modest. On the contrary: Mario measures the width of the face at line going through the tip of the nose, where distortions should have been maximal. I don’t see inconsistency between the two.\nTherefore the Shroud could not have been formed by a ‘shortest path’ mechanism, and something more like a vertical mechanism would fit the measurements better. Both Latendresse and Ercoline make this explicit.\nMario in Section 2.1 of his paper:\n“On the other hand, we conjecture that the projection direction and value (its “force”) is probably due\nto only one rule: the distance attenuation of the projection. That is, every point of the body might be\nprojected by following the shortest path to reach the\nsheet. That would be a simpler rule unifying the direction and force of the projection. This projection\nwould be perpendicular to the skin or sheet in some\ncases – for example when the sheet and body surface\nare flat and parallel. On some other configurations,\nit would not be perpendicular neither to the skin nor\nto the body surface. It is beyond the scope of this\npaper to analyze this conjecture.”\nand in Conclusions: “We have also conjectured that the mechanism of projection is probably neither normal to the skin, nor to the sheet, and not really perpendicular to gravity,  but is probably following the shortest path to the sheet.”\nErcoline et al. do not consider the shortest path projection.\nAs far as I know you are alone in maintaining that the vertical transmission hypothesis is impossible on measurement grounds alone\nYes. But that is how it looks like to make new discoveries. Even maintaining a great respect, we must go beyond what Ercoline, Downs, Jackson and Mario accomplished.\nEven though it apparently looks like, the projection of body on the Shroud isn’t actually vertical. Hugh, if instead of inventing 1000 reasons to undermine my conclusions, you will repeat my reasoning yourself, and check all the premises mentioned (bloodmarks position determined by Lavoie, face distortions measured by Mario & Ercoline, the Agamemnon mask effect, the trick of bandings modulation of the sides of the face,  and manage to imagine how the shortest path projection looks like), you will realise that.\n\n","date":"October 19, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213033","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hi OK – I am agrreing with you. But how can you explain the image formation of hair. Was it followed the shortest direction or the verticle direction?\n\n","date":"October 18, 2015 at 11:05 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212952","author":"Sampath Fernando","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hi Sampath! In the comments to this post you agree with OK, who thinks the image almost a contact image from a draped cloth, was and in the comments to “Raymond Arroyo’s Special Report from April”  you agree with Lavoie, who thinks that the Shroud was flat and a vertical projection was the mechanism. Are these two views reconcilable?\n\n","date":"October 19, 2015 at 4:42 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212975","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hi Mr. Farey – As a logical thinker I knew you are going to ask that question. Before giving my answer I must thank to Dan for this valuable and unique site on Shroud of Turin.\nI was exposed to Shroud on 1 April 2010 and after that I gave my leisure time to do research on Shroud and this Dan’s site helped me to learn almost all about the Shroud. It is nice and good experience to listen to all sort of people and absorb many positive as well as negative things about the Shroud.\nMr. Farey, the blood on hair is the Trade Mark of Authenticity of the Shroud. It tells that image on Shroud is not a painting as well as not a contact process. Furthermore Blood on Hair tell us that image was formed due to some form of Radiation. This Blood on Hair confirmed that it is not a work of a forger.\nResurrection is a unique incident in Human history. No one ever resurrected from the death after three days.  So my imagination is that at Resurrection Jesus body got dematerialized and radiation emitted from the body including Hair.  That is why we can see blood on Hair on the image.\nScientific research on Shroud tells us that the body which was caused the image on Shroud never got deteriorated. Furthermore STURP research tells us that blood came first before the formation of image.  Dr. Lavoie’s observation also confirmed that blood on cheeks came first before the formation of image.\nOK is 90% correct to say that image was formed by shortest distance due to some sort of emission of waves from the body. Dr. Lavoie is also 1-5% correct shroud was flat and vertical projection was the mechanism.\nNow I give the possible missing link (say 5% accuracy)\nMr. Farey can you remember I posted a clip which shows that when radiating hair blows out. What can we get from that clip?\nThis is my hypothesis: At resurrection Jesus body got dematerialized and radiation emitted from the body.  Due to this radiation image was formed on the Shroud. During this process hair got blown out and as a result of that draped cloth expanded on the cheek area and image of hair got printed on the blood absorbed area of the cheek.\nMr. Farey what do you think?\nUnlike Engineer Daveb, my communication is not that good because English is my second language.\n\n","date":"October 19, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213029","author":"Sampath Fernando","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Your English was entirely good enough, and your explanation ingenious. I can’t say that I agree with it, but I commend the idea.\n\n","date":"October 19, 2015 at 4:45 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213032","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"From the above, it’s apparent that like so many other aspects of the Shroud, there’s some lack of unanimity among even the informed, about the question of whether the imaging action was constrained vertically or not, which I’ll leave Hugh & O.K. to debate between themselves if they wish to continue this discussion.  Some have argued that if a burial commenced before sunset on the eve of a sabbath, then completion of many of the rites was permitted, including wrapping of the corpse.  Assuming authenticity, that creates real problems on the question of image orthogonality, and the action would have to be constrained vertically. \nI mentioned De Liso’s paper, and I think it a great pity that many of her findings seem to have suffered lack of follow-up by others, except for some rather absurd speculations.  One of the effects of earthquakes is the release of radon gas from within the earth, a radioactive inert gas, one of the decay products from uranium.  It is very common in apartment basements, a leading cause of cancer, and is also used in its treatment.  De Liso only ever obtained seismic images in the presence of radon gas, along with variations in the electro-magnetic fields.  Regardless of whether or not the imaging was caused by radiation, I think it possible that the radon may have had some kind of collimation effect resulting in the orthogonality.  It is obviously just speculation, but otherwise it is all part of the intriguing mystery.  \n“Shroud-like image formation during seismic activity”; Giovanna de Liso; ENEA Frascati Conference May 2010.\nhttp://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\nUnfortunately the PDF is in secure format, and so it’s impossible to do any copy and paste of any extracts without retyping.  \nBecause of the forensic investigations, I cannot accept that a statue or bas-relief was used, and the medical knowledge would not have been available in medieval times, and so I consider it was of a real human body.  Imaged cloths, a few “not made by human hands”, were known in Constantinople until 1204, after which they disappeared.  My fundamental objection to the radiocarbon dating, is the setting aside of a valid sampling regime, along with other factors.  I suppose it might just be remotely possible that it arrived in medieval times as a miraculous gift from heaven, but prior history and other evidence argues against it.\n\n","date":"October 17, 2015 at 3:20 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212856","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"“Shroud-like image formation during seismic activity”; Giovanna de Liso; ENEA Frascati Conference May 2010.\nhttp://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf\nUnfortunately the PDF is in secure format, and so it’s impossible to do any copy and paste of any extracts without retyping. \nUbuntu Linux, and secure format is broken.\nWhat do you want to be quoted?\n\n","date":"October 17, 2015 at 3:22 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212857","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Thanks O.K. I’ll look into it unless you can tell me more about Ubuntu;  I was able to grab some graphics for a slide show using PrintScreen, but it’s a primitive approach.\n\n","date":"October 17, 2015 at 6:09 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212863","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"https://builtvisible.com/the-ubuntu-installation-guide/\n\nor anything similar (type “Ubuntu installation” or similar into Google)\nHalf an hour, and you don’t want to return to Windows.\n\n","date":"October 17, 2015 at 6:21 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212864","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"I thought of another idea why the Church might be reluctant to do more testing, even if most of the testing has been positive.  If PROVED positive, then they would have to give the Shroud back to the Orthodox in Constantinople, from where it originally came from.   Or… is there a Catholic church still in Edessa??\n\n","date":"October 15, 2015 at 2:30 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212583","author":"Jim Giordano","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Faith??? Where does that come in????\n\n","date":"October 15, 2015 at 2:46 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212586","author":"Suzanne","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"The shroud belongs to the church Jesus established…the catholic church..get over it…\n\n","date":"October 15, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212595","author":"rick","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Rick, are you replying to me?  I would agree with you wholeheartedly, but you know the crap that happens for the sake of ecumenism.  The Orthodox are still mad at us for sticking a few extra words in the creed to make things more clear, more than a thousand years later.  I was thinking that if the Patriarch made a stink about it, then the Church in Odessa (Urfa) could make a bigger stink about it, as Constantinople took it from them, who got it apparently from St. Thomas, as a posthumous, post-Resurrection, gift from Christ.\n\n","date":"October 15, 2015 at 6:37 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212605","author":"Jim Giordano","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Here’s a somewhat lengthy discussion of whether it makes sense to dismiss the Shroud as demonic. Most of the discussion is in the comments section of the thread, so you may want to read beyond the initial post.\nWe have a lot of evidence for the acceptability of long hair among ancient Jews. I’ve provided some examples here, if anybody is interested.\nRegarding whether the Shroud is consistent with Isaiah 52:14, see my August 5 posts in the thread here.\n\n","date":"October 15, 2015 at 5:17 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212598","author":"Jason Engwer","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Demonic things would cause people to leave God, not increase the faith in Him.  Big serious fail for the stinky guy in red pj’s.\n\n","date":"October 15, 2015 at 6:39 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212606","author":"Jim Giordano","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"no Jim…not replying to you….good points\n\n","date":"October 16, 2015 at 4:26 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212705","author":"rick","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Jim Giordano:  If there’s any Christian Church still extant in Urfa, they’d have an extremely difficult task demonstrating that any relic they ever held was identical with the Shroud.  The Mandylion was given to John Curcuas as a fair exchange by the Moslem authorities at the time, prisoners were set free, silver was given, and an undertaking not to lay siege to the city.   Many of the Orthodox believe that the burial cloth they held was destroyed when the ship purported to be carrying it sank at sea.  The Shroud seems to have had many owners if it is the same object as ancient records report, an assortment of Arians, Monophysites, Orthodox, Syrians, Greeks and the French.  I think it’s a little like kingship.  He can be king whoever can take the crown and keep it.  If the victor returns the spoils of war to the conquered, then it can only be as a free gift, not as any entitlement.  History everywhere confirms it, whether it’s the Middle East, Europe or Polynesia.  The Mandate of Heaven so dictates – a long tradition!\n\n","date":"October 15, 2015 at 10:00 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212623","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Thank you Dan for your indispensible levity.  The Burial Cloth of JESUS seems to upset folks just like His Name does. Curious.\n\n","date":"October 16, 2015 at 2:09 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212690","author":"chuck hampton","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Chuck,  that was an excellent observation. Now how the heck is enmeshment process towards globalization ever going to work!\n\n","date":"October 17, 2015 at 8:02 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-212867","author":"Giorgio HSG","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hugh, you wrote here:\n\n“On the first two pages, it is claimed that removing weave and banding by FFT makes the Shroud face look wider and more realistic”\nAnd then: ” actually, it looks wider because the image itself has inadvertently been stretched sideways so it really is wider”.\nThis second sentence seems to be very strange.\nCan you explain in detail (yes I know: this has to do with your interpretation of the banding effect).\nThanks.\n\n","date":"October 20, 2015 at 2:27 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213174","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Thibault:\n“On the first two pages, it is claimed that removing weave and banding by FFT makes the Shroud face look wider and more realistic”\nAnd then: ” actually, it looks wider because the image itself has inadvertently been stretched sideways so it really is wider”.\nThis second sentence seems to be very strange.\nCan you explain in detail (yes I know: this has to do with your interpretation of the banding effect).\nThis is Hugh’s misconception. The aspect ratio of several images in presentation has been modified, of course, to fit the slides. But original images have not been modified. Check my posts from  October 17, 2015 at 11:41 am,  October 17, 2015 at 7:09 pm and October 18, 2015 at 5:48 am.\n\n","date":"October 20, 2015 at 2:38 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213175","author":"O.K.","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hi Thibault. The first two pictures above appear side by side on page 17 of OK’s paper https://shroudofturin.files.wordpress.com/2015/10/3dproperties6_3.pdf. It is OK’s contention that by removing the alleged bands on either side of the face, the image would appear broader, and more realistic, even if the image was in fact the same size. By stretching the second image, the truth of his contention cannot be ascertained. His caption:”What can be seen at first glance is that the right one is much broader” is true because it has been stretched widthwise, not because of the removal of the bands. The images on page 18 are even more grotesque, showing the ‘original’ as much narrower than it really is, and the ‘adjusted’ one much too wide. By the time we get to a mapping of the shroud onto the Agamemnon mask, the images has been distorted so much it clearly looks as if it has been wrapped around a head from ear to ear, but this is entirely due to the aspect ratio, and nothing to do with the removal or adjustment of the bands.\nOK is correct that Latendresse conjectures (his word) that the image formation was created by a ‘shortest route’ process, but his study does not involve such a process, and he explicitly uses vertical transmission instead. In the Abstract he says: “If a cloth is appropriately laid on the front part of a body,and a body image forms by a vertical projection on the cloth, no major image distortions occur.” In the Introduction he says: “the Shroud was not ﬂattened, yet a real body – assuming a simple vertical projection – can have made these images without creating major image distortions.” The second of his Major Assumptions is: “2. The images formed by a mechanism that reproduces each point by a vertical projection, from the body to the Shroud.” And further on: “Our analyses assume a ‘straight vertical projection’ from the body, to form the images. Several other projections have been analyzed: perpendicular to the sheet, perpendicular to the skin and non-collimated (dispersive). Ercoline et al. argue that the vertical projection avoids most image distortions whereas the others do not. We agree that the vertical projection should create the least amount of image distortions (among the above-mentioned projections).”\nOne of the problems in this discussion is that the Shroud man has no ears, and the exact position of the hair is difficult to be precise about. If, as it appears, the hair forms a close frame around the face, in the same approximate plane as the cheeks, as if the face was framed in a kind of ‘box’ of hair, then the Shroud was indeed pretty flat, even when loosely draped. However, if the hair is in two lengths covering the ears, then the image is far too narrow to come from a loosely draped cloth.\n\n","date":"October 20, 2015 at 5:30 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213188","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hugh: ” It is OK’s contention that by removing the alleged bands on either side of the face, the image would appear broader, and more realistic, even if the image was in fact the same size. By stretching the second image, the truth of his contention cannot be ascertained. His caption:”What can be seen at first glance is that the right one is much broader” is true because it has been stretched widthwise, not because of the removal of the bands.”\nNo Hugh, OK is right about that.\nJust download the two pictures and give them the same dimensions.\nYou will see that the FFT second image is truly broader and more “realistic” than the first one.\nThe banding effect is real.\nThe fact that the TS image appears much more “realistic” after removal of the bands (no additional input of information) is true and is not clearly explained.\n\n","date":"October 21, 2015 at 2:38 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213277","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Yes, I agree. When returned to its proper size, the manipulated image does look broader, subjectively, although objectively it is exactly the same size. However, OK’s possibly inadvertent stretching of the manipulated image meant that in his paper, the truth of this contention could not be ascertained, the image was genuinely wider, and the point was lost.\n\n","date":"October 21, 2015 at 3:55 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213279","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Thanks Hugh,\nAbout the banding effect.\nI have read again your pdf\nhttps://shroudofturin.files.wordpress.com/2014/08/banding.pdf\nYou have shown that the bands are closely related to the weave structure of the cloth:\n“However, regular bands of very slight difference in colour do seem apparent, coinciding with the change of pitch of the herringbone weave”, and “Once again, we can see that the darker shadows below the ‘bottom-left-to-top-right’ pitch make those bands slightly darker than the ‘top-left-to-bottom-right’ bands”.\nThe first part of your conclusion: “The weave of the cloth does produce the illusion of bands according to its illumination, which serve to enhance a viewer’s perception of the intensity of the image at various places, and give the illusion of over-defined dark and light bands in\nvarious places( ..)” is consistent with your demonstration.\nBut then you jump to another conclusion: “So the light vertical areas defining the sides of the cheeks are really present, (…) and are not merely artifacts of the cloth, but real areas where the image making process just didn’t happen”.\nI don’t understand how, starting from your observations, you can conclude that there is no image in those areas.\n\n","date":"October 24, 2015 at 1:39 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213513","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Yes, it is tricky. The light sides of the face between the cheeks and hair are irregular in shape and do not extend upwards or downwards beyond the upper hairline or down in the chest. They appear more regular than they really are because of the illusory banding produced by the diagonal lighting of the photo, and some irregularities of the warp thread. When these artefacts of the cloth and photo are recognised for what they are and discounted, the irregularity of the empty patches can be seen to be an artefact of the image itself, or rather an absence thereof, not an illusion which ought to be ‘corrected’.\n\n","date":"October 24, 2015 at 5:22 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213523","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"I think Shroud got expanded less than 30 degrees from the verticle plane. If Shroud is fully flat then blood marks goes outside the hair.\nOf course hair covered the ears.\n\n","date":"October 20, 2015 at 6:34 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213193","author":"Sampath Fernando","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Possibly the one profession that comes anywhere close to a knowledge of human anatomy as the medical profession would be those skilled in real-life sculpture.  I am subjectively persuaded that Luigi Mattei knew what he was doing when he cast his bronze statue of the “Man of the Shroud”.  It seems to have excellent proportions, appears to have a realistic human form, and satisfies the eye as to what the human Christ quite probably looked like laid out in death.  \nThere may well be something on the web describing how Mattei approached the subject, as to what assumptions he may have made about the disposition of the Shroud as a burial cloth.  There is a brief YouTube video showing him at work on the clay model for the statue, and he seems to be making diligent measurements from a photograph of the Shroud.  From a subjective comparison of the statue with its cloth template, it seems to me that an assumption of an orthogonal projection might well have been the fundamental underlying basis for his work.\n  \nThere are of course several other images of the statue which can be found on the web. \nDoes anyone else know anything more about Mattei’s assumptions for matching his statue to the Shroud image?  Thierry Castex has also produced a 3-D impression.\n\n","date":"October 21, 2015 at 5:50 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213238","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"I think daveb is correct, and that Mattei assumed, as have countless observers before and since, that he was looking at something resembling a photograph, more or less parallel rays from the body to the cloth.\nThere’s a thing about long hair though. It flops. If you bow your head forward, it flops forward, and if you lie back, it flops back. It only hangs straight down if your head is upright. Mattei’s crucifix (1:18) looks as if Jesus is wearing Kirby grips to keep his hair from flopping forward, and his lying image (0:51) looks as if it has been glued to his collar bone to stop it flopping back.\n\n","date":"October 21, 2015 at 10:46 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213252","author":"Hugh Farey","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Assuming your hair is clean.\n\n","date":"October 21, 2015 at 11:22 am","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213259","author":"David Goulet","site":"shroudstory"},{"title":"Maybe the devil made them post this","post":"Hair matted with dried blood from wearing a basket of thorns on your head wouldn’t flop.  I still remember the Brylcreem days; more recently the young people used hair gel;  But to really keep it in place, the ladies used a hair-spray lacquer.  No flopping!  I should think dried blood would have a similar action.\n\n","date":"October 21, 2015 at 1:54 pm","url":"https://shroudstory.com/2015/10/15/maybe-the-devil-made-them-post-this/","cat":"article","id":"comment-213273","author":"daveb of wellington nz","site":"shroudstory"}]
