[{"title":"More Carbon Dating and Other Studies of Christian Relics","post":"Wow, the True Cross.  I am not saying that there may not be some of the True Cross still in existence but I have read that if a person were to accumulate all of the pieces that claim to be from the True Cross that you would have enough wood to build a small house.  Therefore it is evident that not everyone has a piece of the True Cross.\nIt will be interesting to see the outcome of the forensic tests run on the Saint’s bone fragments.  What a society we live in ??  Money is more important than the holy religious truth. For the willful liars, does that mean a longer stretch in Purgatory or is it serious enough to land in Lucifer’s hot home as a permanent guest ??\n\n","date":"October 13, 2015 at 3:48 pm","url":"https://shroudstory.com/2015/10/13/more-carbon-dating-and-other-studies-of-christian-relics/","cat":"article","id":"comment-212445","author":"Emmett McMahon","site":"shroudstory"},{"title":"More Carbon Dating and Other Studies of Christian Relics","post":" I am not saying that there may not be some of the True Cross still in existence but I have read that if a person were to accumulate all of the pieces that claim to be from the True Cross that you would have enough wood to build a small house.\nIt’s a long ago refuted nonsense:\nBy the end of the Middle Ages so many churches claimed to possess a piece of the True Cross, that John Calvin is famously said to have remarked that there was enough wood in them to fill a ship:\n    “There is no abbey so poor as not to have a specimen. In some places there are large fragments, as at the Holy Chapel in Paris, at Poitiers, and at Rome, where a good-sized crucifix is said to have been made of it. In brief, if all the pieces that could be found were collected together, they would make a big ship-load. Yet the Gospel testifies that a single man was able to carry it.”\n            — Calvin, Traité Des Reliques.\nConflicting with this is the finding of Charles Rohault de Fleury, who, in his Mémoire sur les instruments de la Passion 1870 made a study of the relics in reference to the criticisms of Calvin and Erasmus. He drew up a catalogue of all known relics of the True Cross showing that, in spite of what various authors have claimed, the fragments of the Cross brought together again would not reach one-third that of a cross which has been supposed to have been three or four metres in height, with transverse branch of two metres wide, proportions not at all abnormal. He calculated: supposing the Cross to have been of pine-wood (based on his microscopic analysis of the fragments) and giving it a weight of about seventy-five kilogrammes, we find the original volume of the cross to be 0.178 cubic metres (6.286 cubic feet). The total known volume of known relics of the True Cross, according to his catalogue, amounts to approximately 0.004 cubic metres (0.141 cubic feet) (more specifically 3,942,000 cubic millimetres), leaving a volume of 0.174 m3 (6.145 cu ft) lost, destroyed, or otherwise unaccounted for.\nhttps://en.wikipedia.org/wiki/True_Cross#Dispersal_of_relics_of_the_True_Cross\n\n","date":"October 13, 2015 at 4:57 pm","url":"https://shroudstory.com/2015/10/13/more-carbon-dating-and-other-studies-of-christian-relics/","cat":"article","id":"comment-212447","author":"O.K.","site":"shroudstory"},{"title":"More Carbon Dating and Other Studies of Christian Relics","post":"Every piece of these timber (or none) may not be from the true cross But how this brain washed John Calvin – second generation reformist – spread false rumours to attract people from Catholic Church to their new church?\n\n","date":"October 13, 2015 at 6:43 pm","url":"https://shroudstory.com/2015/10/13/more-carbon-dating-and-other-studies-of-christian-relics/","cat":"article","id":"comment-212451","author":"Sampath Fernando","site":"shroudstory"}]
