[{"title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive","post":"“Even more remarkable, is that the man’s image can be scraped away with a razor blade because it sits on TOP of the cloth.” Now there’s an interesting experiment…\n\n","date":"April 20, 2014 at 11:16 am","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","id":"comment-101668","author":"Hugh Farey","site":"shroudstory"},{"title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive","post":"The extreme superficiality of the image, effecting only the top one or two micro-fibers implies that, by way of explanation, that if someone shaved the surface of the cloth the image would disappear.\n\n","date":"April 20, 2014 at 11:24 am","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","id":"comment-101672","author":"Russ Breault","site":"shroudstory"},{"title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive","post":"And this shaving would most probably imply the disappearance, not of the primary cell wall of the linen fibers, but the colored coating of carbohydrate impurities that reside on-top of those fibers…\n\n","date":"April 20, 2014 at 7:13 pm","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","id":"comment-101768","author":"Alvin","site":"shroudstory"},{"title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive","post":"That, in itself, makes the image unique. There have been differences about the depth of the image between Giulio Fanti and Paolo di Lazzaro, but the superficiality is in keeping with what we know about Jesus in the New Testament.\n\n","date":"April 20, 2014 at 11:41 am","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","id":"comment-101678","author":"Louis","site":"shroudstory"},{"title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive","post":"Russ, Louis: Catch up! See discussions under Recent Posts, ‘Good Chemistry Questions’, ‘Remember the Valencia Consensus …’. \nReaders were reminded that Ray Rogers had succeeded in removing the coloration of an imaged fibre using the highly active chemical diimide, but leaving the fibres underneath intact and unaffected.  This persuaded Rogers that the image lay in the starch coating, not the fibres themselves, no matter what Fanti and DiLazzarro had to say about the matter!\n\n","date":"April 20, 2014 at 4:56 pm","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","id":"comment-101742","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive","post":"The implication is that attempts to discover the cause of the image, can only be valid if linen manufactured according to the ancient methods is used.  Modern methods of manufacturing linen do not leave a starch coating.  The ancient methods did!\n\n","date":"April 20, 2014 at 5:01 pm","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","id":"comment-101745","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive","post":"I agree again 100% with Daveb’s comment, except for the fact it’s not Rogers who did the test with diimide (and other solvants and reagents) but Alain Adler…\n\n","date":"April 20, 2014 at 7:16 pm","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","id":"comment-101769","author":"Alvin","site":"shroudstory"},{"title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive","post":"Daveb, thanks for the lead. But so what? Does that mean the image is even more superficial? The matter will be raised in a Shroud article shortly, right now I’m working on a big review-article on biblical archaeology.\n\n","date":"April 20, 2014 at 5:19 pm","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","id":"comment-101749","author":"Louis","site":"shroudstory"},{"title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive","post":"Louis, the implication is that many of the previous and recent attempts to ascertain the cause of the image, whether directed at a naturalistic or fraudulent explanation, excimer laser, corona discharge, scorching, seismic origin, or for that matter Maillard, must be reconsidered as very likely invalid.  Many of these attempts used modern linen and any results from those tests might well be judged irrelevant. The two possible exceptions I’m aware of are: Rogers’ coloration of Edgerton type linen treated with dextrin and saponaria using ammonia; possibly De Liso’s use of linen cloths which she claims had only ever been washed using Marseilles soap since 1860 and using various additives, myrrh, aloes, NaCl, blood.  There may be others I’m not aware of. I’m not sure about Thiebault’s recent paper on scorching experiments, but he focuses on the fibres, not any coating properties.\n\n","date":"April 20, 2014 at 6:14 pm","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","id":"comment-101761","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive","post":"Agreed, Daveb, it is a well-balanced position. The main doubt is whether the surface of the cloth played such a key role in the image-formation process.\n\n","date":"April 20, 2014 at 6:45 pm","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","id":"comment-101767","author":"Louis","site":"shroudstory"},{"title":"Myra Adams:  The larger question for Easter Sunday is how did the Shroud survive","post":"A couple of naive questions and a few thoughts:\n1. Did medieval methods of manufacturing linen still follow those of “ancient” methods, i.e.\nsoapwort (saponin) treatment, a starch coating?\n2. Is flax, flax?  That is, is all flax created equally-on a genetic level?  or a cellular (morphological level)?  This article would seem to suggest that significant diversity may exist\n http://www.ncbi.nlm.nih.gov/pubmed/23647851  \nAny possibility that the fibers themselves might be amenable to genetic analysis or detailed morphological studies to learn more about where they may have come from?\nhttp://www.sciencedirect.com/science/article/pii/S0305440311001592\n Is any plant DNA present in retted, processed fibers or is it nonexistent?   \nCould genetic diversity (of flax) possibly be used as a marker(s) to link to specific geographic regions and/or changes over generations (time) to approximate age, divergence among species? Relatedly, might such analysis be useful in corroborating Roger’s chemical findings/the Benford/Marino reweave theory on a genetic level?  That plant fibers from the sampled region of the cloth are genetically distinct from those of the main body of the cloth. \nI would echo daveb’s comments regarding the specifics of manufacturing linen.  I think it’s a key point in considering all possible mechanisms of image formation.  Even if the image were faithfully approximated (or not), it could be a case of true, true, and unrelated.\n\n","date":"April 20, 2014 at 6:42 pm","url":"https://shroudstory.com/2014/04/20/myra-adams-the-larger-question-for-easter-sunday-is-how-did-the-shroud-survive/","cat":"press_coverage","id":"comment-101766","author":"Kelly Kearse","site":"shroudstory"}]
