[{"title":"New Angle on the Supernatural?","post":"That is exactly what I said Pope Francis would do when he went to Turin. He places emphasis on action, for quite often churches can become social clubs. When Anglican Primate Archbishop Justin Welby went to Rome he found the pontiff to be “fired with the spirit of Christ”. That is exactly what moves him. Bones, blood, a feather from Saint Michael have no effect on him. That is also why I predicted that he would ignore the petition sent to him by some Shroudies”.\nThe Church of England has also been influenced by the Peruvian priest Father Gustavo Gutierrez’s Liberation Theology and once invited the late Brazilian Archbishop Helder Camara to give a talk to its bishops in England. Poor Anglican Father Tim Jones, also fired with the spirit of Christ, got into trouble because of a sermon…\n\n","date":"September 12, 2015 at 6:30 am","url":"https://shroudstory.com/2015/09/12/new-angle-on-the-supernatural/","cat":"article","id":"comment-210191","author":"Louis","site":"shroudstory"},{"title":"New Angle on the Supernatural?","post":"It is natural that Pope Francis avoided any mention of authenticity, given the infighting that is going on in the realm of Shroud studies, with a “consensus” dominating the scene. There are people who will certainly give up their Christian faith if fresh carbon dating, for some reason or the other, gives a result that is not around AD 33.\nBut why should we bother so much about a relic that will never tell us the entire story about existence? Jesus never revealed everything, although he dropped a number of hints in his parables. The key to understanding existence, even provide some responses like the ones Stephen Hawking is seeking, lies there. To decipher the secret is another story. It almost seems that Jesus reserved this gift for a “chosen few”,and only he knows the reason, although we can guess what it is.\nThere are quite a lot of questions demanding answers in this troubled world. If we look to the Bible from a fundamentalist viewpoint, that will get us nowhere. Pope John Paul II pointed out that the book of Genesis is not about science. One should add that even Babylonian mythology crept into the text, and not just in the Pentateuch, we see traces even in the Psalms and Isaiah.\nWe cannot hold on just to the Bible looking for responses, there are things that go beyond its purview, exception taken to Jesus’ parables. Otherwise we will limit the scope of our quest, as Freud did:\n        https://www.academia.edu/15308857/Freuds_incomplete_speculation_on_monotheism\nIf there was one scientist who understood the picture with which we are confronted it was Stephen Jay Gould:\nhttps://www.academia.edu/14727603/Why_Stephen_Jay_Gould_proposed_the_principle_of_Non-overlapping_Magisteria\nThat is the path we will have to take. Jesus was not buried in Talpiot and neither did he survive the crucifixion to go to Kashmir. This kind of nonsense has received undue attention, even in the realm of Shroud studies.\n\n","date":"September 12, 2015 at 10:34 am","url":"https://shroudstory.com/2015/09/12/new-angle-on-the-supernatural/","cat":"article","id":"comment-210210","author":"Louis","site":"shroudstory"},{"title":"New Angle on the Supernatural?","post":"I am currently reading “Big Bang, Big God”, ‘A Universe designed for Life?’, by Rodney Holder, former Course Director of Faraday Institute for Science & Religion at St Edmund’s College, Cambridge;  DPhil in astrophysics, degree in theology from Oxford, combines parish ministry with writing & research on relationship betw science and faith. \nReviews development of the Big Bang theory by Lemaitre at al, the challenge by Hoyle, Christian Doctrine of Creation, Goldilocks Enigma, multiverses, challenges Hawking’s view of something from nothing, etc.  Heavy going in places, a solid read, but worthwhile.\n\n","date":"September 12, 2015 at 2:59 pm","url":"https://shroudstory.com/2015/09/12/new-angle-on-the-supernatural/","cat":"article","id":"comment-210222","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Angle on the Supernatural?","post":"I was reading an article about how life was formed from the elements on earth that came from stars but no scientist can explain how the spark of life originated from these elements. This reminded me of the shroud in that we can list all the elements of the shroud but can not explain how the elements came together to explain its existence.\n\n","date":"September 12, 2015 at 9:41 pm","url":"https://shroudstory.com/2015/09/12/new-angle-on-the-supernatural/","cat":"article","id":"comment-210237","author":"Paul","site":"shroudstory"},{"title":"New Angle on the Supernatural?","post":"Paul, for a different perspective, I suggest you dip into “The Phenomenon of Man” by Pierre Teilhard de Chardin.  You should be able to pick up a copy from any good public library.  Even the Introduction to it by Sir Julian Huxley will give you a good overview.  Teilhard was a palaeontologist, and a Jesuit scholar.  His Jesuit superiors forbade him to publish during his lifetime, so that all his works are posthumous.  Teilhard seems to see the breakthrough as “cephalisation”, and he uses self-coined words like ‘noogenesis’ and ‘noosphere’ to signify the coming of consciousness.  \nOnly hydrogen, helium and some lithium could be formed as a consequence of the Big Bang, the lighter elements are formed as a result of nuclear reactions in stars up as far as Iron (atomic no. 26); all other heavier elements require a super-nova explosion to form, so we are actually made of star-dust.  \nUp until the 18th century it was believed that a ‘life-principle’ was required to form the more complex organic compounds.   In 1828 Friedrich Wohler announced he had succeeded in synthesising urea from ammonium cyanate without using a kidney, and this signified the commencement of organic chemistry. \nThe real brain teasers are “Why is there something rather than nothing?” and the mystery of consciousness.  You might also like to check out “Goldilocks Zones” for a perspective on creation by design.\n\n","date":"September 12, 2015 at 10:56 pm","url":"https://shroudstory.com/2015/09/12/new-angle-on-the-supernatural/","cat":"article","id":"comment-210239","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Angle on the Supernatural?","post":"“Why is is there something instead of nothing” is a thing of the past. Stephen Hawking raised the question and he has now replaced it with “spontaneous creation”, in my view because he is unable to answer the question he raised. This will be the topic of an article to be written in the future. Questions such as these have been raised and answered by scientists, however it is evident that science has its limits. This can be seen in the introduction to:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nThat is the reason why Stephen Jay Gould proposed his NOMA as a solution:\nhttps://www.academia.edu/14727603/Why_Stephen_Jay_Gould_proposed_the_principle_of_Non-overlapping_Magisteria\nThe highly-qualified Sri Lankan priest Father Mervyn Fernando, a friend of Arthur Clarke for 25 years, devoted the major part of his life to studying astronomy and the views of Teilhard de Chardin, details about which can be found on other websites. He is now involved in other activities:\n   http://www.purnodaya.com/mervyn-fernando.html\nCuriously, he was consulted about the interpretation of Jesus’ resurrection as described in the New Testament by Charles Pellegrino, co-author of the “Jesus family tomb”.The priest told him that he had found doubting Thomas’ tomb!\n\n","date":"September 13, 2015 at 9:11 am","url":"https://shroudstory.com/2015/09/12/new-angle-on-the-supernatural/","cat":"article","id":"comment-210280","author":"Louis","site":"shroudstory"}]
