[{"title":"New Article on the Shroud of Turin","post":"David Belz: ‘My main reference source for this article is “The Turin Shroud” by Ian Wilson, Victor Gollancz, 1978’\nDan Porter: ‘It is excellent.’\n\n","date":"July 9, 2012 at 6:40 am","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13641","author":"Davor Aslanovski","site":"shroudstory"},{"title":"New Article on the Shroud of Turin","post":"Had an article been written and its author had stated his main reference source for his article was The Image of Edessa and the Turin Shroud, parts one & two” by Davor Aslanovski and the latter’s ego been flattered in the proces, I just wonder what would have been his own comment: excellent or really poor?\n\n","date":"July 9, 2012 at 10:03 am","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13649","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"New Article on the Shroud of Turin","post":"Poor, because it would also have consulted only one source.\n\n","date":"July 9, 2012 at 2:40 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13657","author":"Davor Aslanovski","site":"shroudstory"},{"title":"New Article on the Shroud of Turin","post":"..and was just published in a parish magazine.\n\n","date":"July 9, 2012 at 6:05 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13662","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"New Article on the Shroud of Turin","post":"An article written within the publishing limits of a local parish magazine intended to inform a modern diverse community of “ordinary” Catholics on an important aspect of their heritage, hardly requires the citations properly expected in any academic thesis or conference paper.  Even articles written by academics, such as professional historians and science experts regularly appearing in publications for popular consumption or particular interest groups seldom provide citations.  It is evident in the article that material from one source in particular was in fact used and so it was appropriate to acknowledge this.  It was not necessary to cite other sources concerning material known to be in the public domain.  \nThose who see some informative value in the article are welcome to do so.  Others may enjoy their jaundiced view of the matter.\n\n","date":"July 9, 2012 at 4:39 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13661","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Article on the Shroud of Turin","post":"I note that “Scientific American” that most prestigious science magazine, to be found in the better public and university libraries, seldom cites a list of references for its principal articles, but may refer readers to a few other works for further reading.  It enjoys a stable of highly reputable science journalists, and a reputable publishing history of some 165 years.  It is widely read by very many professional scientists and engineers as well as those with an amateur interest.  From other comments he has made, I can only conclude that DA fails to understand the role of quality journalism in the modern world.  He may prefer his musty Byzantines.\n\n","date":"July 9, 2012 at 11:48 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13678","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Article on the Shroud of Turin","post":"And I note that daveb, blinded by his personal dislike for me, has once again totally missed my point. It’s not that the article doesn’t PRESENT a full bibliography – it’s that it USES only one reference source. And so it does not ‘inform a modern diverse community of “ordinary” Catholics of an important aspect of their heritage’, but of what Ian Wilson believes and teaches.\nJudging from what I see here, the author will have achieved his goal if at least one reader is willing to blindly accept Wilson’s teaching and to make it his or her way of imitatio Christi to personally insult anyone who dares to differ.\n\n","date":"July 10, 2012 at 5:16 am","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13680","author":"Davor Aslanovski","site":"shroudstory"},{"title":"New Article on the Shroud of Turin","post":"The article itself is merely confined to establishing the identity or intended identity of the Shroud Man, and little of the content can hardly be considered controversial.  This article did not touch on any theories of the history of the cloth, but a later article may do so.  An earlier article endeavoured to present material on some of the scientific aspects, and this can be found on the same web-site.  An attempt was made in the earlier article to be conservative in the scientific assertions made, and the more radical claims made by certain investigators were treated cautiously or left open.\nSources on crucifixion practices included the Encyclopaedia Britannica, and an article on the Herodians by Margaret J Thorpe.  A quotation from an early sceptic of the Shroud’s authenticity, a Jesuit historian Herbert Thurston, was also given.  A 3-D image from a very recent web-site was also used and cited.  Dr David Willis, one of the very few English investigators on the Shroud’s medical evidence was also quoted, and Dr Pierre Barbet’s papers were also of assistance.  \nI note that the exegetical advice given.on John 20:25-28 and Acts 12:7 does not appear to be quite accurate, as a better transliteration of the Greek root word for hand used in those texts is “kheiron-” (or “chiro-“), but this does not derogate from the principal argument used there.   \nI rather suspect that DA’s aversion to Ian Wilson derives from his disagreeing with Wilson’s theories or speculations on the history of the cloth.  However he can hardly disagree with Wilson’s presentation on the identification of the Shroud Man as Rabbi Yeshua, when even Herbert Thurston was prepared to concede this.  The question of identification is relevant, as tens of thousands were punished by crucifixion, and therefore identity is a fair question. \nI am not a blind follower of Ian Wilson’s theories.  My personal belief is that both Jack Markwardt and Daniel Scavone, although both disciples of Wilson, come closer to the mark, by asserting that the burial cloths were in Antioch for some centuries before arriving in Edessa, and that very likely Jeanne de Vergy came by the cloth through her ancestor Othon de la Roche, and that it was kept at Besancon, rather than being held in secret by the Templars as Wilson asserts.  Any attempt to resolve the whereabouts of the cloth after the sixth century must still deal with the matter of the Vignon markings on both coinage and iconography.  It is apparent that the Shroud image was then known.  If not in Edessa, where was it?  Noone has come up with an alternative theory, not even DA.  it was certainly not in “Neverland”!  \nI note that DA has asserted that the Byzantines did not appear to rate the burial cloth very highly as a relic as they kept it hidden.  I think that although he may know all there is to know about Byzantine sources, he may have failed to understand the Byzantine mind-set when it comes to the sacred.  He ought to know for example that the most sacred moments of eucharist worship are concealed from the common gaze, as contrasted with that in the western liturgies.  That says a lot about the Byzantine attitude to the sacred, which cannot be judged from a western stand-point.  I’m sure that he must already be aware of this, but it is not evident to me in what he writes.  And I think that is what I take exception to.\n\n","date":"July 10, 2012 at 8:52 am","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13685","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Article on the Shroud of Turin","post":"Very well said DaveB! …Wish I could write like that ;-)\nR\n\n","date":"July 10, 2012 at 1:33 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13694","author":"Ron","site":"shroudstory"},{"title":"New Article on the Shroud of Turin","post":"The next time DA wanders into the jungle, taking pot-shots at the wild life, chopping down trees, and over-turning the furniture, he should not be amazed if he encounters retaliation from conservation-minded cannibals!\n\n","date":"July 10, 2012 at 5:16 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13709","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Article on the Shroud of Turin","post":"Rabbi Yeshua’s imaged burial cloth was kept hidden mostly  because the bloody face imprint (on the original linen) looks more like Yeshua’s death mask than a resurrection mask. Beside  it was linked to theological mysteries such as Incarnation, Resurrection and Transfiguration. \nIt shall also be reminded here, that Rabbi Yeshua was called Ha-Notsry that is “The Hidden (Prince)”.\n\n","date":"July 10, 2012 at 5:58 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13711","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"New Article on the Shroud of Turin","post":"DB, I am sorry, but your name is too difficult for me to spell… so I’ll just use initials. But I’m glad I finally know your full name.\nSince you were the first to start personally insulting me when I disagreed with your view of history, you will always hold a special place in my heart. Others came after you, with more imaginative insults, but you were my first. So it’s good to know your name. Nice to meet you, DB. They call me DA. And we’re both Catholics. With some interest in the Turin Shroud. Interesting. I will remember you in my prayers and I suggest you remember me before you go to your next confession. Have I spoken ill of someone? Remember that one? Well, in this day and age, it should probably be rephrased into something like: ‘Have I ran off at the mouth in my internet debates?’   \nBut, to business… I don’t understand why you’re working yourself up like this. My only intention was to point out that what Dan rated as ‘excellent’ was nothing but a quote from the ‘sindonological’ catechism. It looks like I touched a delicate point there. I guess we tend to be sensitive when someone lightly dismisses something we’ve put a lot of work in. I’m sorry, but, hey, now you know how it feels, so maybe there’s a chance to learn something. Plus, I didn’t know that it was you who wrote that article. And now I do. \nAs for ‘history’ vs (white-coat) ‘science’ in ‘sindonology’, let me use your qualification: I don’t think either would be fit to offer testimony in a New Zealand court of law.\nI have already confessed that, upon my first reading of Wilson, I thought he presented a pretty strong case. And I have felt very much the same upon reading many other ‘sindonological’ papers.\nSure, I noticed that Markwardt doesn’t understand what Disciplina Arcani is, that Vignon has never taken a life drawing lesson, that Dreisbach can’t tell a theological from a historical interpretation, and a couple of million small problems like that… but, in the main, I thought the current ‘sindonological’ story was sound.\nThen, of course, I examined the historical evidence for myself. That was the part about which I could form my own opinion, because I had both the necessary training and direct access to the object of examination. And I found out that everything was wrong. Indeed, I would be very hard pressed to think of a single thing that the ‘sindonological’ account of history got right. (Perhaps that there was an image in Edessa that was reverently transferred to Constantinople. Or that a look into Byzantine texts and art would be a good place to start. But any further than that and we’re completely off the chart.) And if history has been so terribly misinterpreted, how am I to know that the same has not been done with every other type of ‘evidence?’ I don’t possess the specialist knowledge to go into questions like the bilirubin in the stains on the Shroud. (And, btw, neither did Herbert Thurston, so I don’t know why you’re dragging him out.) What do I know about bilirubin? I can only listen to what others tell me. And after I have seen what violence has been done to history, I cannot trust the (white-coat) ‘science’ part of ‘sindonology’ either. In words of George W. Bush, ‘fool me once, shame on you… fool me twice… uhmm… you’re not gonna fool me twice.’\nThis, I believe, answers all your questions.\nBut just to make sure.\nA) I do not believe that it is the authentic image of ‘rabbi Yeshua’. Neither do I like it when Christians call Him that (does any New Testament or patristic text call Him that?), nor do we have any RELIABLE evidence for that identification. It MIGHT BE an authentic image. Or it might not. In order to know the truth, the investigation should be conducted within the confines of the academic world, and not the way that it has been conducted by ‘sindonologists’. And the more it is conducted by ‘sindonologists’, the less likely it is to ever be conducted by serious scientists.\nB) Wilson is at least a good and original writer. Markwardt and Scavone have equally misinterpreted history, but are not even particularly good wordsmiths. So between them and Wilson, I choose Wilson.\nC) I have shown what I think of the Vignon markings here: http://deumvidere.blogspot.co.uk/2012/07/picture-normally-says-thousand-words.html\nD) As for your last paragraph, the Byzantine attitude towards the sacred is exactly what I am researching. Most particularly, I am looking at anthropomorphic conceptions and representations of the transcendental in Byzantium. So, yes, I’d say I’ve given this some thought. It’s when you go from ‘Byzantines concealed the liturgy of the Eucharist from the common gaze’ to ‘The texts on the Image of Edessa really talk about the Turin Shroud’ that you are pushing a square peg of nonsense into a round hole in my mind. Let me rephrase that last bit. It’s a non sequitur. \nOh, and did you not end your article with:\n‘In a subsequent article, I hope to outline the evidence for some of the theories concerning the early history of the Shroud prior to its first emergence in France in about 1350.’\nIsn’t it pretty obvious what you’re next article will say? So why point out that this part doesn’t yet touch upon the Mandylion theory? \nHere’s a piece of advice, one Catholic to another: apologize to me and mention your rash words in a confession; give a good thought to the fact that experts have rejected Ian Wilson’s theory; and then be very careful what you tell your ‘diverse community of “ordinary” Catholics’ about historical ‘evidence’.\n\n","date":"July 11, 2012 at 12:13 pm","url":"https://shroudstory.com/2012/07/09/new-article-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-13741","author":"Davor Aslanovski","site":"shroudstory"}]
