[{"title":"A New Paper by Paul Maloney","post":"One must add that Professor Danin stands by the examination of the grains made by Baruch.\n\n","date":"July 28, 2014 at 8:31 am","url":"https://shroudstory.com/2014/07/28/a-new-paper-by-paul-maloney/","cat":"paper_chase","id":"comment-140882","author":"Louis","site":"shroudstory"},{"title":"A New Paper by Paul Maloney","post":"I have written anarticle on the pollen in the latest issueof the BSTS newsletter which discusses some important issues regarding the entomophilous pollen found on the Shroud by various researchers. It is significant that there is very little correlation between the supposed flowers placed on the shroud identified by Prof. Danin and others, and the pollen identified by Max Frei.\n(Personal: I am currently typing at the only internet terminal in Yuksom, Sikkim, which is subject to frequent power outages, so dare not spend long on each comment!)\n\n","date":"July 30, 2014 at 4:00 am","url":"https://shroudstory.com/2014/07/28/a-new-paper-by-paul-maloney/","cat":"paper_chase","id":"comment-141193","author":"Hugh Farey","site":"shroudstory"},{"title":"A New Paper by Paul Maloney","post":"U. Baruch was a professional palynologist before he left the field to work in computer science, and contrary to what has been said, Professor Danin does stand by the findings. The challenge is not new, it was in the news a long time ago, and received a response from Professor Danin there and then. The last paragraph in article no.7, entitled “Shroud Studies bring Good News” reports this:\nhttp://newvistas.homestead.com/MediaRePatch.html\nIt must also be remembered that Max Frei Sulzer left his work unfinished.\n\n","date":"July 30, 2014 at 8:51 am","url":"https://shroudstory.com/2014/07/28/a-new-paper-by-paul-maloney/","cat":"paper_chase","id":"comment-141228","author":"Louis","site":"shroudstory"},{"title":"A New Paper by Paul Maloney","post":"I have read the paper by Paul Maloney and I wondered about the\nbehavior of Max Frei : he made no attempt to distinguish between\nanemophilous and entomophilous pollen materials !\nIf it is important to record the nature of pollen grains,\nthen we have to deepen the question…\nIf the pollen grains are powdery, dust like, this is an indication about wind pollination.\nUsually pollen grains are sticky in insect pollinated flowers.\nSo we have to control what are the levels of viscoelasticity and adhesion …\nBut, after the centuries and aging, I have several doubts about the precision of that control.\nIs this attempt (to verify the differences) a nonsensical control ?…\n—————\nB.T.W. :\nI have not yet seen the image (photo n. 17) quoted by Maloney…\n— — —- —\nI have found a study:\nPollenkitt Wetting Mechanism Enables Species-Specific Tunable Pollen Adhesion\nby\nHaisheng Lin , Ismael Gomez , and J. Carson Meredith\nSchool of Chemical & Biomolecular Engineering,\nGeorgia Institute of Technology\nPublication Date (Web): February 12, 2013\nCopyright © 2013 American Chemical Society\nHere an excerpt from the\nAbstract\n>Plant pollens are microscopic particles exhibiting a remarkable breadth of complex solid surface features. In addition, many pollen grains are coated with a viscous liquid, “pollenkitt”, thought to play important roles in pollen dispersion and adhesion.\n>However, there exist no quantitative studies of the effects of solid surface features or pollenkitt on adhesion of pollen grains, and it remains unclear what role these features play in pollen adhesion and transport.\n>We report AFM adhesion measurements of five pollen species with a series of test surfaces in which each pollen has a unique solid surface morphology and pollenkitt volume.\n>The results indicate that the combination of surface morphology (size and shape of echinate or reticulate features) with the pollenkitt volume provides pollens with a\nremarkably tunable adhesion to surfaces. \nTHERE ARE TWO ALTERNATIVES :\n>With pollenkitt removed, pollen grains had relatively low adhesion strengths that were independent of surface chemistry and scalable with the tip radius of the pollen’s ornamentation features, according to the Hamaker model.\n>With the pollenkitt intact, adhesion was up to 3–6 times higher than the dry grains and exhibited strong substrate dependence.\n— —\nWhat is your own conclusion ?\n— —\nHere I want to add another excerpt\nfrom the Abstract:\n>The combination of high pollenkitt volume and large convex,\nspiny surface features in echinate entomophilous varieties\nappears to enhance the spreading area of the liquid pollenkitt relative\nto varieties of pollen with less pollenkitt volume and less\npronounced surface features.\n—- —- — —\nWhat is pollenkitt? \nLink:\nhttp://www.honeybeesuite.com/2010/03/page/2/\n>Pollenkitt is a sticky covering found on the surface of pollen grains.\nIt is also spelled “pollen kit” or “pollenkit” and is sometimes called “pollen coat.”\nIt is found in some plant families more often than others, but it is especially common in plants that are pollinated by insects. Because of this, scientists believe that one of the major functions of pollenkitt is to help the pollen stick to the bugs.\n>Honey bees have special body parts where they pack pollen to be carried back to the hive. The parts—one on each hind leg—are called corbiculae or “pollen baskets.” The corbiculae are covered with hairs which help to hold the pollen in place, but very sticky pollen can form large clumps—something that makes provisioning even easier.\n>The pollen from many wind pollinated plants, such as grass, is much drier and not nearly so sticky. This pollen has to be carried in smaller clumps and so the bees have to make more trips to collect an equal amount, which wastes both time and energy. … …\n>Plants that are insect pollinated not only have sticky pollen, they have lots of pollen. This provides the win-win relationship that defines plant-pollinator mutualisms. … ..\n>Researchers have suggested many other reasons for pollenkitt and, in truth, it probably has multiple functions. It may keep the pollen from blowing away or drying out, or it may protect the pollen from ultra-violet radiation and certain pathogens.\n— —\nI hope in your comments …\n\n","date":"August 1, 2014 at 12:21 pm","url":"https://shroudstory.com/2014/07/28/a-new-paper-by-paul-maloney/","cat":"paper_chase","id":"comment-141637","author":"piero","site":"shroudstory"},{"title":"A New Paper by Paul Maloney","post":"Piero, I have no time, patience, much less expertise to go delve deeply into this topic. All I can say is that more work needs to be done.\n\n","date":"August 1, 2014 at 8:58 pm","url":"https://shroudstory.com/2014/07/28/a-new-paper-by-paul-maloney/","cat":"paper_chase","id":"comment-141699","author":"Louis","site":"shroudstory"},{"title":"A New Paper by Paul Maloney","post":"I don’t think we need to go into the biochemistry of pollen to explore the uncertainties surrounding Frei’s work. Uncertainties there certainly are, and I have been attempting to understand his methodology to try to clarify them. Two particular difficulties are his unrealistic identification of his pollen right down to species level, and the unrealistic proportions of the various types of plant identified. I think his main problem was the lack of reference material with which to compare the grains he found. To counter this, he went several times to collect reference material from places he thought might be relevant. Now this next bit is speculation, but I think he then compared his grains with the reference material collected, and where he found a match, identified the pollen as from that species. This is a mistake. Pollen is not as individually shaped as he thought, and even today very few grains can be identified at species level; the family is as good as most palynologists can get, and families of plants are much more widely distributed, of course, than species. I think that had Frei gone to, say, South America or Japan for his reference specimens, he would have had no less difficulty in finding 50 or so matches, even though the list of species would have been entirely different! This scenario could also account for the unrealistic proportions of types of plants, as it is easier to collect pollen from a brightly coloured flower (entomophilous) than from an undistinguished, possibly difficult to find, even difficult to reach, catkin (wind-borne), and plants from the same family can include both types.\n\n","date":"August 1, 2014 at 10:59 pm","url":"https://shroudstory.com/2014/07/28/a-new-paper-by-paul-maloney/","cat":"paper_chase","id":"comment-141719","author":"Hugh Farey","site":"shroudstory"},{"title":"A New Paper by Paul Maloney","post":"Max Frei Sulzer was a criminologist at the Zurich police department, he took his tasks seriously, he was not an amateur. He made tiny incisions in some of the tapes to enable him to make correct identification. U. Baruch was a professional palynologist and confirmed at least some of Frei Sulzer’s findings. His findings were challenged by Prof T. Litt, however he did not work on the pollen as Frei Sulzer did, only a lens was used.\nSo what needs to be done? More work on what remains of the pollens, not to be discarded as trash on which Frei Sulzer worked.\n\n","date":"August 2, 2014 at 10:29 am","url":"https://shroudstory.com/2014/07/28/a-new-paper-by-paul-maloney/","cat":"paper_chase","id":"comment-141798","author":"Louis","site":"shroudstory"}]
