[{"title":"News Story from Sindone.org","post":"It seems that Monsignor Giuseppe Ghiberti will have to return to the seminary to learn theology and biblical studies instead of wasting his and our time.\n\n","date":"January 6, 2015 at 6:00 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181601","author":"Louis","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"yes..i’m sure you know much more then him\nhttp://www.touregypt.net/featurestories/vmary.htm\n\n","date":"January 6, 2015 at 10:57 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181637","author":"rick","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Your link means nothing, what it states and the ‘why’ can be traced to the evolution of religious ideas in the first centuries AD, so it is something for amateurs to read without the need to go deep into the topic. As for the monsignor, I do think I know more than him, judging by what he is doing, unless that is just PR.\n\n","date":"January 6, 2015 at 5:58 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181679","author":"Louis","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"I sense you are correct Louis.\n\n","date":"January 6, 2015 at 6:25 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181684","author":"Stan Walker, MD","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Thank you, Stan. It is pleasing to see someone get the point, doing away with the need for spoon feeding.\n\n","date":"January 6, 2015 at 7:32 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181698","author":"Louis","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"You missed the point…..this is about islam and catholics and the virgin mary…common ground kinda stuff…what this stuff about evolution of religious ideas?…..seems like this is  a simple concept to me…whether you believe this or not, it’s better to talk about what we have in common rather than killing each other…i don’t know the monsignor, but it’s not a bad idea he has\nthe point of the link was not  to prove something to you “professionals” ….who go “deep” into topics, but rather how some efforts are being made to stop the killing…..guess that’s a amateur subject though\n\n","date":"January 6, 2015 at 7:04 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181693","author":"rick","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Please refrain from personal attacks. Yes, I am talking after a lifetime devoted to studies and also based on personal experience. Stan Walker, MD above got the point, so nothing has been missed.\n\n","date":"January 6, 2015 at 7:28 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181697","author":"Louis","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"personal attacks?…..you mean like your “amateur” comment?….I did not mean to attack you, but simply stated you missed the point….guess i found your post a bit haughty…if i am wrong i apologize….\n\n","date":"January 6, 2015 at 7:47 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181702","author":"rick","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"“Rick”, I will no longer engage with you and you may have noticed that moderator Dan is eliminating people who post comments like the ones you are posting. Is is haughty to comment after a lifetime of study and personal experience?\nTheory is one thing, in practice, however, it can be the exact opposite. It is good to find common ground for dialogue, it should be encourage, but how far is it possible? Do you think the Boston bomber facing the jury now is not aware of this common ground? Has he shown any remorse? Kneel and thank God that you were not around to get maimed. If blood was spilling from you body there you would be saying the exact opposite of what you have commented.\n\n","date":"January 6, 2015 at 8:20 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181706","author":"Louis","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Well not sure about Dan  eliminating me based on what I’ve  posted….yes Louis….just because you have a “lifetime” of study and personal experience (notice you’ve used that phrase in both of your postings) does not mean your tone cannot be a bit haughty……remember you made the amateur comment….as well as a comment about spoon feeding…..but I forgive you!\nThink you made a bad analogy comparing the Boston bomber with nonchristians involved in this “debate” …..that’s quite a reach…you ask, how far is dialogue possible?.. … probably in the 60’s and 70’s people were asking the same thing about the British and the IRA.  \nWhat does the Boston bomber have to do with Muslims and Christians trying to find common ground with the shroud?…\nDon’t think the Boston bomber is germain to this discussion….nor did i see that ISIS was invited to the presentation/debate\nI am not Neville Chamberlain….I can see this is a dangerous world and we live in.\nMuslims and Catholics hold Mary in high regard…yes, probably for different reasons, but it’s a start…..I hear some Muslim groups make pilgramages to Catholic Marian shrines for example.  \nThink this is the reason the Virgin Mary is mentioned:\n“The prospect Islamic and Christian – explain the organizers – the son of the Virgin Mary will be juxtaposed in a comparison that helps to understand what they have in common Christian and Muslim brothers in faith in the one God of Abraham.”\n\n","date":"January 6, 2015 at 11:55 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181738","author":"rick","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Calm down, Rick. We all try to find polite ways of saying things. I slip up often, so I get it.  Nonetheless . . .\n\n","date":"January 7, 2015 at 6:16 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181797","author":"Dan","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"ok Dan…but not sure “amateur” and “spoon fed” were polite comments…kinda got my Sicilian blood up! As far as the comment upon Monsignor Giuseppe Ghiberti at the opening; thought that was kinda a cheap shot without anything to back it up.  I could be wrong about this, maybe he has some bagage I don’t know about. However could someone give me a link or other information or opinion on why this priest is being maligned.\nThe only reason I posted the link at the top was to show how Mary is regarded in the Muslim world.  She might be a bridge between faiths.\nLove this blog..follow it daily…..even like Louis’s posts……….. most of the time\n\n","date":"January 7, 2015 at 11:10 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181847","author":"rick","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"that’s baggage not bagage!\n\n","date":"January 7, 2015 at 11:12 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-181849","author":"rick","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Rick, Have you read this? Dialogue can be very difficult, even when Mary is involved. The priest was not maligned, either he is badly informed or it is PR:\nhttp://www.catholicherald.co.uk/commentandblogs/2015/01/08/benedict-xvi-showed-the-way-forward-for-the-muslim-world/\nBy the way, I wouldn’t talk about Sicilian blood or Neapolitan blood and so on. The people with which you say there should be dialogue have mostly Semitic blood, stronger than Sicilian blood if you know history. We are talking about reducing the shedding of blood in the name of blind monotheism.\n\n","date":"January 8, 2015 at 9:25 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182047","author":"Louis","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"ha!…you really don’t know Sicilians!\nthanks for the link…interesting\n\n","date":"January 11, 2015 at 7:07 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182660","author":"rick","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"“Isis is a terrible aberration without any justification. The result of the madness of the fundamentalists’  in this way Yahya Pallavicini, imam and vice president of Coreis – Islamic Religious Community has spoken to us…\n The Italian Islamic Religious Community (= Co.Re.Is) is the organization that brings together the largest number of citizens of Italian Muslims.\n(it’s my rough translation)\nLink:\nhttp://www.vita.it/mondo/emergenze/i-musulmani-italiani-dicono-no-all-isis.html\n— — —\nMichel Houellebecq burst into tears, yesterday, when he learned that among the dead was his friend Bernard Maris, an economist at the Bank of France and columnist in “Charlie Hebdo”. On the issue of the magazine came out a few hours before the massacre, Maris concluded with these words what will be the last article of his life: “Just a wonderful novel. Still a masterstroke. ”\n He was referring to “Submission,” the book of the same moments that Houellebecq finally began to be sold in bookstores, after weeks of rumors,\n(and this is my rough translation from Italian language…)\nLink:\nhttp://www.corriere.it/esteri/15_gennaio_08/houellebecq-l-ultimo-charlie-hebdo-dedicato-suo-nuovo-libro-983b7072-9703-11e4-b51b-464ae47f8535.shtml\n— — —\nThe book “Submission”  speaks about a France ruled in 2022 by the Muslim Brotherhood, who manage to go to the government, thanks to a (slightly) incredible alliance with the remains of centrist and left allied to moderate Muslim Mohammed Ben Abbes, leader of “Muslim Brotherhood”, against the excessive power of Marine Le Pen. It is not just another alarm Houellebecq against the progressive Islamization of the country. As written by Emmanuelle Carriere, Houellebecq has the merit of being the only one to talk about a problem that exists but that many intellectuals seem to ignore. Not only for Carriere to Houellebecq is a position politically and sociologically ‘reasonable’.\n The West gives up (gently, but in a manner of speaking …) to Islam, exhausted by centuries of\nEnlightenment and rationality excessively (empowering) turned as responsibleness\n— — — —\nFirst of all I want to underline that I have no true personal knowledge\nabout Msgr. Giuseppe Ghiberti and his life in Turin, but the haughty approach\n“Isis is a terrible aberration without any justification. The result of the madness of the fundamentalists’  in this way Yahya Pallavicini, imam and vice president of Coreis – Islamic Religious Community has spoken to us…\n The Italian Islamic Religious Community (= Co.Re.Is) is the organization that brings together the largest number of citizens of Italian Muslims.\n(it’s my rough translation)\nLink:\nhttp://www.vita.it/mondo/emergenze/i-musulmani-italiani-dicono-no-all-isis.html\n— — —\nMichel Houellebecq burst into tears, yesterday, when he learned that among the dead was his friend Bernard Maris, an economist at the Bank of France and columnist in “Charlie Hebdo”. On the issue of the magazine came out a few hours before the massacre, Maris concluded with these words what will be the last article of his life: “Just a wonderful novel. Still a masterstroke. ”\n He was referring to “Submission,” the book of the same moments that Houellebecq finally began to be sold in bookstores, after weeks of rumors,\n(and this is my rough translation from Italian language…)\nLink:\nhttp://www.corriere.it/esteri/15_gennaio_08/houellebecq-l-ultimo-charlie-hebdo-dedicato-suo-nuovo-libro-983b7072-9703-11e4-b51b-464ae47f8535.shtml\n— — —\nThe book “Submission”  speaks about a France ruled in 2022 by the Muslim Brotherhood, who manage to go to the government, thanks to a (slightly) incredible alliance with the remains of centrist and left allied to moderate Muslim Mohammed Ben Abbes, leader of “Muslim Brotherhood”, against the excessive power of Marine Le Pen. It is not just another alarm Houellebecq against the progressive Islamization of the country. As written by Emmanuelle Carriere, Houellebecq has the merit of being the only one to talk about a problem that exists but that many intellectuals seem to ignore. Not only for Carriere to Houellebecq is a position politically and sociologically ‘reasonable’.\n The West gives up (gently, but in a manner of speaking …) to Islam, exhausted by centuries of\nEnlightenment and rationality excessively (empowering) turned as responsibleness\n— — — —\nFirst of all I want to underline that I have no true personal knowledge\nabout Msgr. Giuseppe Ghiberti and his life in Turin, but the haughty approach\nby Louis about the biblical studies by Ghiberti and the attempt to dialogue\nwith another religion during a meeting is a bit strange …or worrying….\nHere I want to add few lines:\nalthough I understand the critical situation (and the urgent need to dialogue to prevent extremist acts from both followers),\nit’s hard to believe that Muslims [apart the strange heretic sect Ahmadhija, well known for particular ideas and\nstrange interests about Jesus, the Rozabal, etc.] and Christians find common ground on the Shroud.\nHere another question (apparently far from the subject treated here):\nLudvik Leibler is a French physicist who has developed a revolutionary new technique\nabout the use of a nanoparticle solution made from polymers to connect human tissue.\nHe has been awarded with Descartes-Huygens Prize (a prize set up by the French and Dutch\ngovernments in 1995). In the past he won an ACS Award in Polymer Chemistry for his pioneering work\non the self-assembly of polymer systems.\nIf we wiil be able to show the true epoch of the Ancient Linen (without to destroy the Holy Shroud!),\nbut I don’t believe we will be in the list for these future Awards if we are not able to do something instead to\ndiscuss about the Koran.\nThis question seems to be very important and all the scientists\n(independently from their religious ideas. See also the example of Pontifical Academia…)\ncan collaborate in order to discover the truth. So, the words by Msgr. Ghiberti should be an interesting point  to start toward this direction.\nBut, knowing something about the ideas of Pallavicini (who seemed to be rigorous about Tradition, etc.),\nI have some doubt… because I believe thee approach by Co.re.is (Islamic religious community) to the Christian world\nand Tradition is a knotty problem.\nI like the idea nevertheless, then I hope in that possible inter-religious (and also scientific, if possible…) dialogue…\nThere is a German book that can be indicated as an exemple of  what some layman can read about the Shroud:\nDas Jesu Komplott, by Holger Kersten and Elmar Gruber\n( http://en.wikipedia.org/wiki/Holger_Kersten ) and then a particular Islamic Tradition  (connected with these ideas) can be understood [= the first book by Holger Kersten: “Jesus Lived in India” promotes the claims both of Nicolas Notovich (1894) regarding the unknown years of Jesus between the ages of 12 and 30 in India, also Ahmadiyya founder Ghulam Ahmad’s claims regarding the years aged 33 to age 120 in India, and the burial of Jesus at the Roza Bal shrine in Srinagar]. But I don’t believe that Pallavicini is in this field of Islamic Tradition, then a more refined Knowledge (avoiding blasphemies!) is required\nto discuss a Mystery of Faith, this is an useful way for both religious fields.\nPerhaps there are several studies connected :\n– Gnostics\n– Liber Schale Machometi (= “Halmahereig”, translated by Abraham Alfaquim)\n– question of “Ascended Masters”\nand inherent Traditions,\nstarting from \n– the ancient Pharaohs,\nFor example:\n>Amenhotep III is believed to have begun his rule at about the age of nine. It is likely that a relative acted as regent for him until he came of age. As an Egyptian Pharaoh, Amenhotep III, and his wife Tiye are known as the founders of monotheism in Egypt, a practice continued and expanded by one of Amenhotep’s sons, Akhenaten, an incarnation of an ascended master … (Warning!!! I write this just to make you understand of what I am dealing…)\n– Enoch,\nEnoch was a Priest of the Order of Melchizedek and an anointed prophet of God\n(“Enoch took his ascension in the light and became an ascended master…”. Warning!!! Here I do not want you to deflect a straight Christian doctrine, this is only a vague reference!)\n– Saint Paul, II  Corinthians 12:1-3\n1 – Boasting is necessary, though it is not profitable; but I will go on to visions and revelations of the Lord.\n2 – I know a man in Christ who fourteen years ago — whether in the body I do not know, or out of the body I do not know, God knows — such a man was caught up to the third heaven.\n3 – And I know how such a man — whether in the body or apart from the body I do not know, God knows –…\n– Koran, LIII. 1-10 \n>a famous tree, as-sidratul-muntaha, is mentioned twice in the passage in Surah 53 describing the second vision Muhammad had of Gabriel (Surah 53.14,16) where he also saw the angel ‘inda sidrah, “near the lote-tree”. Gabriel and Buraq could go no further but Muhammad went on to the presence of Allah where he was commanded to order the Muslims to pray fifty times a day. …\nLink:\nhttp://answering-islam.org/Gilchrist/Vol1/3d.html\n(= The Nature of Muhammad’s Prophetic Experience…)\nThe Qur’an is considered “pure revealed literature”. It is believed by the faithful to be “the actual speech of God, through the angel Gabriel, and mediated by the prophet Muhammad” (see sura 53.1–10).\n— — —\nand then see also the famous work by Dante Alighieri\n… all that can be included during the following discussion, after that meeting…\n— — —\nProbably the Rosicrucians are more aware (affinity) of these topics …\n In Italy Massimo Introvigne ( http://en.wikipedia.org/wiki/Massimo_Introvigne ) has written extensively on sectarianism. Introvigne started collecting books on minority religions and esoteric-gnostic schools in the 1970s…\nThe Ancient and Mystical Order Rosæ Crucis, also called the Rosicrucian Order (AMORC), is a worldwide philosophical and humanistic, fraternal order devoted to “the study of the elusive mysteries of life and the universe.”\nLink:\nhttp://en.wikipedia.org/wiki/Ancient_Mystical_Order_Rosae_Crucis\n>René Guénon (November 15, 1886 – January 7, 1951) was a French author and intellectual who remains an influential figure in the domain of metaphysics, having written on topics ranging from metaphysics, sacred science and traditional studies to symbolism and initiation\nhttp://en.metapedia.org/wiki/Ren%C3%A9_Gu%C3%A9non\n— —\nSee also :\n-René Guénon,\nLe Théosophisme, histoire d’une pseudo-religion, Ed. Traditionnelles, Paris\n-René Guénon\nThe Esoterism of Dante\nhttp://www.sophiaperennis.com/books/christianity/the-esoterism-of-dante/\n>… In the middle of the nineteenth century two scholars, Gabriele Rossetti and Eugene Aroux, pointed to certain esoteric meanings in the work of Dante Alighieri, notably The Divine Comedy. Partly based on their scholarship, Guénon in 1925 published The Esoterism of Dante. From the theses of Rosetti and Aroux, Guénon retains only those elements that prove the existence of such hidden meanings; but he also makes clear that esoterism is not ‘heresy’ and that a doctrine reserved for an elite can be superimposed on the teaching given the faithful without standing in opposition to it. …\n— —- —\nHowever I think it is a little disconcerting that, in the city of the shroud and the famous Eucharistic Miracle (1453), we have to be reduced to humiliate our pride\ngoing to the house of the Muslims …\n>The event which led to the construction of the church occurred on 6 June 1453 during the war between Louis of Savoy and France. A group of French soldier had plundered the main church in Exilles, a town in the Val di Susa. On 6 June, the day of the Feast of Corpus Christi, they went to Turin to sell the booty. The donkey which transported the sacramental bread from the Exilles’ church fell on the ground and the Holy Spirit rose and illuminated the square from the air …\nLink: http://en.wikipedia.org/wiki/Basilica_of_Corpus_Domini\n\n","date":"January 8, 2015 at 9:15 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182045","author":"piero","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"However, even St. Francis went to Egypt in the house of the Muslims, preaching to try to convert them …\nObviously I do not think words of proselytizing will be allowed to next talk of Monsignor Ghiberti.\n\n","date":"January 8, 2015 at 9:22 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182046","author":"piero","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Piero,\nSorry to see that you have again begun to post rubbish on the blog and accuse me of being haughty. It is being haughty to point out where the monsignor is wrong? Have you read the link I posted above, where you will see that I am not alone? Your field is dyeing, not the history of religions, which is part of my area,and you lead us to Wikipedia material. Now,  let me tell you the following, for I have plenty of change in my pocket:\nYou have avoided answering my query about demonstrating on this blog how the Jospice Mattress Imprint was formed as a result of mattress dye, as you claim. Don’t forget to carefully read Father Francis O’Leary’s words about the partial head image, which he calls the “face image”, and then show us how the dye had effect particularly in this part of the imprint:\nhttps://www.academia.edu/4691379/Can_the_Jospice_Mattress_imprint_be_compared_to_the_Image_on_the_Shroud\nThe only difference I had with the good priest, who had a MA in theology and was no fool, was regarding the imprint formation, which he interpreted as a spiritual phenomenon. He had a hard time obtaining funds for the charitable hospital for poor terminal patients he was running, and in such a situation it was obvious that he could not be bothered a lot with a secondary issue.\nThe other Wikipedia link you provided is about Kersten. What was the need for that? Have you not read Ian Wilson’s books? He is an Oxford-trained historian. Kersten has an agenda which is linked to other agendas:\nhttps://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\n\n","date":"January 8, 2015 at 11:20 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182059","author":"Louis","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Louis,\nFirst of all you have to know who is Ghiberti!\nI am not here to accuse you persecute me for controversial opinions, however I think that the limit of decency is approaching to our continuous exchange of opinions …\nIf you do not know the possibility of cold dyeing for polyamide 6, then forget to discuss the strange story of imprint of Liverpool (Jospice Imprint)…\n— —\nWhy you do not say anything about the Eucharistic miracle of 1453?\nThat miracle happened in an important year: the fall of Constantinople …\n— —\nB.T.W.: I do not believe in the strange ideas by Holger Kersten!\n— —\n… And then I believe that you know the exact meaning of the word:\n“Stalking”…\n= Stalking is unwanted or obsessive attention by an individual or group toward another person…\n\n","date":"January 8, 2015 at 12:54 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182070","author":"piero","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Piero\nMonsignor Ghiberti studied theology, not biblical studies, and don’t forget that theology has necessarily to be based on Scripture. Why have you ignored the “Catholic Herald” link I posted above? Is that because it is inconvenient? Would you say that the monsignor is brighter than another famous theologian called Benedict XVI, who taught in German universities for forty years, knows how to interpret the New Testament, having written the bestseller “Jesus of Nazareth”, recommended even by top Protestant scholars such as Charlesworth and Evans?   \nThe Jospice mattress imprint is not a “strange story” and has nothing to do with cold dyeing. If the dyeing explained the imprinting you would be writing on the process on this blog, challenging what I wrote years ago. Sorry, you prefer not to pick up the gauntlet, dodging the questions is more convenient.\nPlease don’t teach me about “stalking”. I have reviewed books on Freud and lived just twelve blocks away from the house where he died in London, now a museum. I felt the man more than you did. I am not stalking anyone. I had even forgotten about you since you were dodging my queries about the Jospice Mattress Imprint, making claims that you could not substantiate. This morning you said I was “haughty”, trying to get even with me. This is not a professional way of discussion. Do you take me for a fool?\nWould you call the English priest who wrote the article in the link cited also haughty?\nThe Lanciano host is a different matter.\n\n","date":"January 8, 2015 at 1:59 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182073","author":"Louis","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Louis,\nI want to respect your profession (journalism) and\nour common Christian background (and, so, forget what I wrote [only few words]\nabout AMORC and Guenon!), then\nI reject hard temptations to insult your “stalking behaviour” about Mons. Ghiberti and myself…\nIn 1998 I have bought a book by Mons. Ghiberti and other authors: “Dossier sulla Sindone”,\ned. Queriniana, Brescia, 1998. In that book there are some references about previous work by Ghiberti.\nSee also:\n“La sepoltura di Gesù. I Vangeli e la Sindone” (Studia Taurinensia 3), Marietti, Roma, 1982,\netc.\nI am curious to know what is your exact position about Mons. Ghiberti.\nLouis, take care of yourself, it seems to me that you are a bit sick…\nAm I wrong in my suspect?\nI beg your pardon about some (previous) line\non non christian thinkers (= René Guénon, etc.)…\nNow I want to try to understand what do you want to obtain from myself…\nI quoted the Eucharistic Miracle of Turin, which happened in 1453, and\nI underlined the question of the fall of Byzantine Empire (Constatinople).\nInstead you wrote something about Lanciano host (VIII century\n= blood clots and cardiac muscle, carefully sectionalized/dissected…).\nWhy?\nI am still looking at your message, dismayed…\nPlease, be more careful in your particular remarks!\nI fully accepted your note about Kersten,\nbut I reject your claims about Jospice Imprint…\nUntil now we have not yet seen an advanced control using SPMs (= a kind\nof microscopies that, IMO, can solve that enigma.See also the use of Raman analyses\nin parallel to SPM controls).\nSo, in my opinion we have not yet reached a good level of scientific control and\nwe cannot say more on that strange image.\nYou wrote a confusing statement about cold dyeing\nsuggesting that I indicated that phenomenon as explanation.\nNot, I am not yet a very old man with early-stage Alzheimer…\nThen I want to clarify my position (altough I guess something about that strange imprint),\nso:\n“Nothing can be said before to read new useful results obtained from adequate analyses”,\nthis (IHMO) is the right condition about that “Jospice Imprint” enigma.\nKeep calm!\nI hope in your answer.\nRegards.\nP. S.\n— — — —\nCriticism of Muhammad has existed since the 7th century…\nBut Dante ALighieri wrote an interesting work ….\nThen read the “Liber Schale Machometi” (= “Halmahereig”, translated by Abraham Alfaquim)\nand try to know the question of “Ascended Masters” and inherent Ancient Traditions…\n— —\nHere few lines about the Miracle of Turin…\nHic est panis vivus, qui de coelo descendit…\nLink:\nhttp://www.therealpresence.org/eucharst/mir/english_pdf/Turin1.pdf\nEgo sum panis vitae.\nPatres vestri manducaverunt manna in deserto, et mortui sunt.\nHic est panis de coelo descendens: si quis ex ipso manducaverit, non morietur.\nEgo sum panis vivus, qui de cælo descendi.\nSi quis manducaverit ex hoc pane, vivet in æternum:\net panis quem ego dabo, caro mea est pro mundi vita. Alleluia. \nRough translation =\n= I am that bread of life.\nYour fathers did eat manna in the wilderness, and are dead.\nThis is the bread which cometh down from heaven, that a man may eat thereof, and not die. I am the living bread which came down from heaven:\n if any man eat of this bread, he shall live for ever:\nand the bread that I will give is my flesh, which I will give for the life of the world.\nHalleluiah!\n— — — — —\nAnd, if you want some beautiful (catholic) image, look under:\n\nhttp://www.terradimaria.it/scheda-tecnica/\n\n","date":"January 10, 2015 at 9:22 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182379","author":"piero","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Piero\nPlease be objective in your comments, avoiding insinuations and personal remarks. Are you trying to hit below the belly? You’ll not get far with this. I am sick, yes, of seeing people posting comments and making claims that they cannot substantiate.\nI will not change what has been written about the Jospice Mattress Imprint and you have not demonstrated how dye had something to do with the process.\nAs for Monsignor Ghiberti, he can say what he wants, he is the archdiocese’s spokesman. The approach in the form of a dialogue is following what Pope Francis has said, however the ideology must be guided by what Benedict XVI has written (and spoken). So how far will his approach get him?\nRegards.\n\n","date":"January 10, 2015 at 9:58 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182384","author":"Louis","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Please … you must not talk about Dyeing Engineering  and Jospice Imprint! You are not qualified to comment on that field …\n\n","date":"January 17, 2015 at 9:54 am","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-184046","author":"piero","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"http://www.ibtimes.com/brunei-officially-bans-future-christmas-celebrations-1777526\nSee why the monsignor is wasting his time?\n\n","date":"January 8, 2015 at 2:39 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182077","author":"Louis","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"Louis…I’m reading some of your posts and am started to “get you”.  But just because there is evil in the world does not mean you don’t try dialogue…..(I know the chances are small that much good will come of it)\nBlessed are the peacemakers….monsignor wasting his time?…guess you think St Francis wasted his time as well….\n\n","date":"January 11, 2015 at 7:06 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182658","author":"rick","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"but actually must admit you make some good points\n\n","date":"January 11, 2015 at 7:08 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182661","author":"rick","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"There are exceptions to the rule, where there is no PR, the Egyptian president means what he says:\nhttp://www.dailymail.co.uk/wires/ap/article-2608374/Egypts-el-Sissi-visits-Coptic-pope-Easter.html\n\n","date":"January 11, 2015 at 7:15 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182664","author":"Louis","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"yes..was about to post that!..your pretty fast on the draw\n\n","date":"January 11, 2015 at 7:18 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182666","author":"rick","site":"shroudstory"},{"title":"News Story from Sindone.org","post":"although I agree with piero more often then not…\n\n","date":"January 11, 2015 at 7:17 pm","url":"https://shroudstory.com/2015/01/06/news-story-from-sindone-org/","cat":"news_&_views","id":"comment-182665","author":"rick","site":"shroudstory"}]
