[{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"A good quick explanation of the what the Shroud of Turin is telling us.\n\n","date":"March 9, 2015 at 5:12 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192898","author":"ekmcmahon","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"I attended Breault’s presentation in Skokie, IL on March 7. Great job! He covered all the bases. It was very credible.\nNo presentation on the Shroud is complete without a discussion of the evidence debunking the results of the carbon dating tests done in 1988. No less than Ray Rogers, a scientist and leader of one of the teams doing the carbon dating, showed later how the results of the tests were flawed, and,therefore, meaningless, since the tests were done on a patch sewn into the cloth in 1532.\n\n","date":"March 9, 2015 at 7:50 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192905","author":"leon ward","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Russ Breault’s emphasis on the Message of the Shroud, succinctly summarised in the Lauer paragraph extract above, is truly what matters.  It is too often muffled in the perpetual pointless authenticity debate which too often preoccupies the correspondents on this site to the detriment of the true message.  \n“The message really isn’t about the shroud; it’s about the message behind the shroud. It’s not about an old piece of linen, it’s about the message behind that linen, the message of salvation — the whole mission and purpose of why Jesus came to Earth as the son of man and the son of God.” \nThe masking of the message by endless raucous debates which are always inconclusive, is one reason why I have lately seriously considered withdrawing from the site.\n\n","date":"March 9, 2015 at 2:24 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192977","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"I too hope you stay…but disagree with you on the “message of the shroud”…the message has always been there…but the question on may of our minds is whether God has left something behind for us…I don’t know if it’s real or not, but at least that’s the message I want to know,,,come on daveb!…we need you here!\n\n","date":"March 9, 2015 at 5:22 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192990","author":"rick","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Rick, I almost always tell people that I am 90% certain it is authentic, I will always give 10% to the possibility that it is the work of some medieval artist who predated Leonardo by several hundred years, we don’t know who he is, we don’t know how he did it, and he never did anything else of any significance.  I guess that is possible but not very likely in my opinion.  As far as whether Jesus left something behind, he surely did.  In fact it was the “linen cloth lying there” that was the first piece of evidence that Jesus rose from the dead.  The only question is whether the Shroud of Turin is the same cloth.\n\n","date":"March 9, 2015 at 5:46 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192993","author":"Russ Breault","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"agree Russ..have been watching your presentations online on youtube….excellent…..I actually agree with you for the most part…just don’t want to get my hopes up!\n\n","date":"March 10, 2015 at 9:53 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193049","author":"rick","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Daveb: Breault is very emphatic about his beliefs that the Shroud is the authentic burial cloth of Christ. Yes, he talks about the message in the Shroud, but he doesn’t back off from the skeptics and doubters including the scientists, and that’s because he has the facts and the science to back himself up. He is not running from a debate. He is participating in it as well as demonstrating his belief in the message of Christ.\nI am with him on this. I tend to be skeptical myself, but when the evidence in favor of one argument over another hits me square in the face overwhelmingly, then I have no choice (if I’m a reasonable person). I owe it to myself to admit what I might not like to admit.\nBreault passionately believes the Shroud is authentic, and I do as well. I could care less whom I might offend.\n\n","date":"March 9, 2015 at 5:33 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192991","author":"leon ward","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Dear Daveb of Wellington NZ\nOn behalf of Centro Português de Sindonologia I sincerely hope you give up your purpose of withdrawing from this blog.\nYou are a serious Shroud researcher and your comments are always very wise and we all learn a lot with them.\n                                                                   warmest regards\n                                                             Antero de Frias Moreira\n\n","date":"March 9, 2015 at 2:41 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192980","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"@Daveb of Wellington NZ, Don’t leave – I just ignore the naysayers. It seems that there will always be those either through ignorance or design. If by ignorance – they need help learning and if it is by design then the evil needs people against them sowing the public just what they are.\n\n","date":"March 9, 2015 at 3:40 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192983","author":"Emmett McMahon","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Dear Daveb\nOne skeptic says it is a painting. He says so, because he doesn’t know the difference between a painting and a negative photographic image. Other skeptics do not know how the image was formed. Some says it is a scorch. No one even Christians do not know what was involved in Resurrection Process. So without telling us how it was formed they tell us it is a fake.\nNo one can produce any other image similar to image on shroud of Turin or can produce any other image which was produced in 14th Century or even 21st Century.\nFurthermore these skeptics can not understand the difference between Grab sample and composite sample. They don’t know what is the meaning of represetative sample. Even they don’t know what is the meaning of contamination.\nSo Daveb please don’t give up. I have learnt many from you. Hope to learn more in the future.\nGod Bless You.\n\n","date":"March 9, 2015 at 5:03 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192989","author":"Sampath Fernando","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Go carefully, Sampath…\n“These skeptics can not understand the difference between a grab sample and composite sample. They don’t know what is the meaning of representative sample. Even they don’t know what is the meaning of contamination.”\nRemember I’m one of these skeptics. One of the ones who does “not know how the image was formed.” Do you think I cannot “understand the difference between a grab sample and composite sample”? Do you think I “don’t know what is the meaning of representative sample”? Do you think I “don’t know what is the meaning of contamination”?\nOr perhaps you don’t include me. So which of the skeptics on this forum is indeed as ignorant as you suggest? Does David Mo not “understand the difference between a grab sample and composite sample”? Does Charles Freeman not “know what is the meaning of representative sample”? Does Colin Berry not “know what is the meaning of contamination?”\nI too have learnt much from daveb. I hope he continues to defend his corner in the face of genuine inquiry and difference of opinion. If I had not had flaws in the authenticist argument pointed out to me, I would never have explored the statistics of radiocarbon dating, and if I had not had flaws in the non-authenticist argument pointed out, I would never have discovered as much as I have about Three Marys iconography, and they are only two examples of the wide variety of fields of knowledge which have been opened to me by reading the posts of those whose opinions differ. From disagreement often comes progress, from agreement often comes stultification.\n\n","date":"March 9, 2015 at 5:41 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192992","author":"Hugh Farey","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Dear Mr. Farey.\nDo you believe Image on Shroud of Turin was produced in 14th century based on Carbon Dating results of the shroud? According to your opinion how the image on Shroud of Turin was produced or formed?\nThank you.\n\n","date":"March 9, 2015 at 6:27 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192995","author":"Sampath Fernando","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"On balance, I have to say that my current inclination is that the Shroud is medieval. Anybody reading anything I have written will know that I have neither ignored or dismissed any of the contrary evidence, but rather weighed it all up carefully, and on balance feel that the radiocarbon date cannot be rejected. I am not so convinced of my opinion that I hurl abuse at anybody who disagrees with it, and I am even less clear how the image as it appears today arrived on the Shroud. I have long tended towards some kind of imprinting process, and long felt that that its precise appearance may have been the incidental result of some other image making process, possibly involving a pigment in an acidic medium. I have read about and experimented with as many of the ‘authenticist’ image making mechanisms as I can, and find them even less convincing than the medieval versions. So the short answer is: I don’t know.\n\n","date":"March 10, 2015 at 3:10 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193020","author":"Hugh Farey","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Yes, to date no one knows or can explain how the image was formed on the Shroud of Turin. But we know that it is a negative photograph and in 14th Century no one had any technology to produce a such an image on 14 feet by 3 feet long sheet with three dimensional coding.\n\n","date":"March 10, 2015 at 4:02 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193023","author":"Sampath Fernando","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Love that last paragraph, Hugh. It’s so well put I almost feel compelled to disagree with it. ;)\n\n","date":"March 9, 2015 at 9:14 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-192999","author":"David Goulet","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"And somehow or another, we still managed to turn it back into the authenticity debate again!  Remember what Russ said:..\n“The message really isn’t about the shroud; it’s about the message behind the shroud. It’s not about an old piece of linen, it’s about the message behind that linen, the message of salvation — the whole mission and purpose of why Jesus came to Earth as the son of man and the son of God.”\nThat is the true message from this piece of cloth!\n\n","date":"March 10, 2015 at 5:47 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193030","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Good Evening Daveb of Wellington,  The Message Behind The Shroud is one of hope and possibility.  One that sheds light where there is darkness, hope where there is despair, faith where there is doubt and joy where there is sadness.  Those are all things Jesus did during his ministry and  Russ Breault is doing the same. Good, that is exactly what the Lord wants done.  Shroud is a witnessing tool.  I am 100% convinced of the authenticity of the Shroud.\nFor 3 Reasons\n1. The Forensic Science tells a story of a scourging, mocking, crucification, death & resurrection\n2. Scripture tells the same story and the forensic evidence is in agreement with scripture\n3. Personally confirmed to be authentic to me by The Spirit of God\nThe 3rd being the most convincing.\nBack to messages, I think there is a message written plainly on the Shroud, an identification mark/message telling us all exactly who the Man In The Shroud is.\nBefore I say what this is, I have this question for you Daveb of Wellington\nIf you were a forensic detective and came upon the scene of a very brutal murder in which the victim was stabbed 120 times and you came upon this man lying face up and saw what clearly looked like the number 3 written in blood on the right side of that person’s head, would you think it looked out of place?\nWould you photograph it?   Would you measure the blood stain?\nWould it get your attention & leave you thinking that it was left by the killer, a signature sign?\nOr would you think by random coincidence the blood coming from a small puncture wound just happened to take on the shape of number 3?\nThe odds of that happening are extremely slim.  I challenge anyone in the world to show me a photo of a blood stain that by random coincidence took on the shape of #3.\n“I am from Missouri you gotta show me something!”\nSince The Shroud case file is loaded with “coincidences” that all point to the same historical figure as being the Man IN The Shroud   I thought I would humor you and add some more bizarre coincidences/messages for you to look at.  Messages Behind The Shroud\n30 Coincidences Relating to #3 blood stain on Shroud which is “coincidentally” 3cm in length\n 1. Jesus prayed (3) three times in the Garden of Gethsemane before His arrest.\n 2. Jesus was placed on the cross at the 3rd hour of the day (9 a.m.)\n3. There were 3 hours of darkness that covered the land while Jesus was on the cross from the 6th hour to the 9th hour.  (On the cross for 3 hours)\n4. NASA confirmed there was a blood moon in Jerusalem on Friday April 3, 33AD, (This just happened to be the time of the Passover that year)\n5. Jonah was in the belly of the whale for 3 days\n6. After Elijah was taken into heaven skeptical roman soldiers searched for his body for 3 days but did not find him, only his Shroud/Mantle was left behind. (Preceding Event to the Resurrection)\n7. Jesus’ ministry on earth was 3 years and he was 33 years old at death\n8. Jesus is 1) Prophet, 2) Priest, and 3) King.\n9. There were 3 witnesses to transfiguration of Jesus, John, Peter and James\n10.  During His ministry Jesus raised 3 people from the dead.\n12. There were 3 crosses, 3 people crucified\n13. The inscription on the cross of Jesus was in 3 languages.\n (Showed completeness of His rejection by man)\n 13. Peter denied Jesus 3 times,\n14.  Later Peter told Jesus he loved him 3 times\n15.  Judas betrays Jesus for 30 pieces of silver\n16… 3 Samples of Shroud fabric are sent to 3 different labs\n17. Shroud of Turin is 3 over 1 herringbone twill fabric\n18.  3 women and 3 men were present at burial.\n19. Jesus appeared to his disciples 3 times after being resurrected\n20.  3 witnesses to Resurrection,  Shroud, Sudarium, Empty Tomb\nIt took Saint Joseph and Mary 3 days/3 nights to find Jesus in the Temple; Talking with the elders for 3 days\n21. Jesus received 3 gifts at birth, gold, frankincense & myrrh (same at death)\n22. Jesus was in the tomb 3 days\n23… Jesus said he would rise after 3 days & temple will be re-built in 3 days\n24. God’s attributes are (3) omniscience, omnipresence, and omnipotence.\n25. God’s essence is that of a Trinity (3) Three in One: Father, Son, and Spirit.\n26. Three (3) denotes divine perfection and completeness\n27. Jesus died at the 9th hour (3 p.m.).\n28. The Number (3) is the number of resurrection\n29 The NUMBER 3 IS WRITTEN IN BLOOD ON RIGHT SIDE OF MAN IN SHROUD!\n30.. The NUMBER 3 BLOOD STAIN IS 3CM LONG!!!    Are you serious?!\nOf course these are all just coincidences they have nothing to do with the #3 bloodstain.  That is another thing that just happened by random coincidence, like the distance information.  That is not distance information, just incredible luck, some fibers are colored and others are not,  some lite, some dark.  There was no planning involved.  #3 bloodstain was not planned either. \n9 More Points To Consider Before Dismissing the Number 3 of having significance\n1. The Physical Universe consists of 3 things: 1) Time, 2) Space, and 3) Matter\n2. Time is divided in 3 different parts: 1) Past, 2) Present, and 3) Future\n3. Space is 3 dimensional: 1) Length, 2) Width, and 3) Height\n4. Matter coexists in 3 states: 1) Solid, 2) Liquid, and 3) Gas\n5. People consist of 3 distinct parts: 1) Body, 2) Soul, and 3) Spirit.\n6. Water consists of 3 elements: 2 Hydrogen and 1 Oxygen\n7. There is 3 D Information on The Shroud of Turin\n 8.  ELF Waves Around Earth are made up of 3 components.\n A. The Electrostatic Component\nB.  The E Wave Component\nC. The Magnetic Component   A sophisticated form of wireless communication Spirit of God uses to communicate with 1.plants, 2.animals and 3.people \n9. Shroud Fabric is 3 over 1 Herringbone twill fabric, reference to The Shroud in the Bible is 3: 1 Galatians.\n“You foolish Galatians! Who put you under a spell? Was not Jesus the Messiah clearly portrayed before your very eyes as having been crucified?”\n (Further Coincidence: There are pollens on the Shroud from Central Turkey where Galatia was)\nFinal “3” Coincidences written in book of Revelation\nAn angel is charged to cry 3 woe’s to those who live on earth to warn them of more trials to come (Revelation 8:13). The murdered bodies of the Two Witnesses will not be allowed to be buried but rather will lie openly in Jerusalem for 3 days before they are resurrected. 3 unclean spirits will be allowed to deceive the whole world to FIGHT the returning Jesus Christ in what is called the battle of Armageddon (Revelation 16:13 – 16). The new Jerusalem, created by God for placement on a new earth, will be shaped like a square with 3 gates on each side (Revelation 21:13).﻿\n# 3 is written in blood on the right side of The Man In The Shroud who is bringing a message of hope and possibility.  One that sheds light where there is darkness, hope where there is despair, faith where there is doubt and joy where there is sadness”\n“Who do you say that I am?”\n\n","date":"March 11, 2015 at 2:12 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193097","author":"Dave Hines","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"It’s not a #3 – it’s a sideways lower case ‘m’. Start again….\n\n","date":"March 11, 2015 at 8:17 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193158","author":"David Goulet","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Opinions vary\n\n","date":"March 11, 2015 at 10:15 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193165","author":"Dave Hines","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"With the reading that I have done on this site and the shroud.com site and as I have said before my Guardian Angels voice, I am convinced that the Shroud of Turin that can also be called Christ’s Shroud, is the actual burial cloth of Jesus Christ.  The blood and the image that surrounds the body area tells the truth. Christ’s dead body “wrapped” in the Shroud and placed into the tomb. The blood and the dirt and pollen  tell us part of that.  When his soul re-entered his body (remembering that his soul is the Son of God’s Soul) it then re-energized his body – the divine power in his soul is what caused the “scorched image” to be made on the Shroud. It is there to cause us to look – wonder – research and to believe that he did in fact come back to life.  The resurrection of Jesus Christ\nHe knew that we would be going through some of these doubts.  It is as if he is signing his name to the Shroud.  He is telling us that yes, his dead human body was placed in this cloth and his loving spiritual body came back to the human body so that we will believe in him for the centuries that we are still here on the Earth.\n\n","date":"March 10, 2015 at 6:39 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193035","author":"Emmett McMahon","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Thanks, Emmett. I attended one of Russ Breault’s presentations recently. It lasted about 80-90 minutes. He spent about 5 minutes talking about his faith in Jesus and “the message behind the Shroud”. He spent the rest of the time making a compelling case for the authenticity of the Shroud, much of it based on science, science which the skeptics don’t have the courage to even consider, let alone accept. What really gets me is all this stuff the 1988 carbon-dating tests. FOLKS, LISTEN UP. THE CARBON-DATING TESTS IN 1988 HAVE BEEN DEBUNKED BY NO LESS THAN RAY ROGERS, ONE OF THE SCIENTISTS INVOLVED IN THE TESTS. HE WENT BACK, DID HIS OWN HONEST AND EXTENSIVE RESEARCH AND DUMPED ALL OVER THOSE TESTS.\n\n","date":"March 10, 2015 at 7:49 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193039","author":"leon ward","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Leon, YOU LISTEN UP (gee my caps lock works too) the case for authenticity is not as air tight as you seem to believe. Please do your homework and read some of the older archived posts here on the blog. The carbon dating has not been ‘debunked’ by anyone. Period. Full stop. Have serious questions been raised about the protocols and sampling? Yes. Does this mean the carbon dating is null and void? Not until the above mentioned questions have been fully answered.\nCan you show me where Rogers ‘dumped’ all over the tests?\nIf the Shroud ignites and inspires faith, wonderful. This is an inner treasure a believer should cherish quietly, not brag about it to those more skeptical. Skepticism, by the way, is a God given trait as well, meant to save us from the chains of superstition.\n\n","date":"March 10, 2015 at 9:06 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193047","author":"David Goulet","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"David:  You and I evidently interpret things differently.\n\n","date":"March 10, 2015 at 10:07 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193052","author":"leon ward","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"When human can’t understand how image was created then we need help from heaven. As Christians we are believe in God the Father then we have to believe in his heavenly hosts including Guardian Angels. I believe in Guardian Angels. So Leon I believe you.\n\n","date":"March 10, 2015 at 4:54 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193078","author":"Sampath Fernando","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"“The skeptics don’t have the courage to even consider, let alone accept.”\nOh, Lord, let’s not go through this all over again! Stop it, authenticisti, just stop it.\n\n","date":"March 10, 2015 at 8:01 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193041","author":"Hugh Farey","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"OK, Mr. skepticisti!\n\n","date":"March 10, 2015 at 8:14 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193043","author":"leon ward","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"My whole mission for the past 35 years is finding and using the middle path.  I fully recognize there are gaps in the data.  C-14 is not a settled issue one way or the other.  That said, do we just sit on our hands until we have absolute proof?  I will be in heaven with the angels before that happens. The middle path is this:  Can we use the Shroud for its phenomenal witness for Christ even though we don’t have absolute proof of authenticity?  And the answer is a resounding YES as long as we recognize the message is what matters.  Either the Shroud is the authentic burial cloth of Christ or it represents the biblical truths upon which it is based.  I always say, “Explore the Mystery–Encounter the Message”.  The message remains the same regardless of authenticity.  Do I think it is authentic?  Yes.  Do I hope it is authentic?  Yes.  Can I prove it absolutely?  No.  Can I still use it effectively as a unique way of telling the “Greatest story ever told”?  Absolutely!  The enduring mystery of the Shroud is what makes it so compelling.  “It is the glory of God to conceal things, but the glory of kings is to search things out.”  Proverbs 25:2 ESV\n\n","date":"March 10, 2015 at 10:48 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193055","author":"Russ Breault","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"It is a noble middle path. Do carry on, Russ.\n\n","date":"March 10, 2015 at 11:51 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193058","author":"David Goulet","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Skeptics wil never accept or understand the Shroud message because they only care trying to distort the truth and deceive people.\nI’d be happy to know what standards they consider to accept some importants issues discussed in this blog, but till now my curiosity has not been satisfied\nIt seems nothing will satisfy them as long as the matter under analysis points toward authenticity.\nExcellent comment from Russ Breault highlighting the spiritual side of the Shroud that some commenters will never reach.\n                                                               regards\n                                                 Antero de Frias Moreira\n\n","date":"March 10, 2015 at 2:11 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193067","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"“Skeptics will never accept or understand the Shroud message because they only care trying to distort the truth and deceive people.” “It seems nothing will satisfy them as long as the matter under analysis points toward authenticity.”\nUnbelievable. One after the other. That’s three times in a single blog entry. Need I say more?\n\n","date":"March 10, 2015 at 2:35 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193070","author":"Hugh Farey","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"It’s times like this I wish the Shroud was proven a medieval forgery. And I am an authentist!\nAre there skeptics who will never, under any circumstance accept authenticity? I’d imagine so. Are there authentists who will never accept a medieval provenance. Undoubtedly. But to paint either side with such a broad brush, to allow no room for legitimate skepticism or legitimate (vs blind) faith, is unjust.\n\n","date":"March 10, 2015 at 2:49 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193072","author":"David Goulet","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Blaise Pascal felt that humans had an innate aversion to truth, Freud was a pessimist, also because of his studies on instincts and civilisation, C.G. Jung had no aversion to religion. He only wanted religion to pass through a filter called Psychology.\nThere was one object related to religion that he seemed to have accepted without hesitation, and in this case it did not have to pass through the filter.\nIt was the face on the Shroud of Turin:\n  https://www.academia.edu/6823292/What_did_Jung_see_in_the_Shroud\n\n","date":"March 10, 2015 at 3:20 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193074","author":"Louis","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"as I recall he viewed psychology as “the cure of souls”\n\n","date":"March 10, 2015 at 6:49 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193082","author":"rick","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Partly, because as the founder of analytic psychology he believed that religion was very important for the individual.\n\n","date":"March 11, 2015 at 7:41 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193116","author":"Louis","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Tell me folks, which question will finally get answered during future shroud research? 1988 Carbon dating? Or how image was formed? Of course, the carbon dating! It was done by man. Humans makes mistakes. There will be another STURP like research project down the road. Vatican will give in to pressure from researchers/scientists from around the world.\n\n","date":"March 11, 2015 at 7:40 pm","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193156","author":"don","site":"shroudstory"},{"title":"Nice Review of Russ Breault’s Presentation in Wisconsin","post":"Don’t build your hopes.  The Vatican might be responsive, but the Turinese are another matter.  Check out the prehistory of the 1988 radiocarbon circus.  Even Chagas, head of the Pontifical Science Academy, was over-ridden by those in Turin who thought they knew better, but didn’t!\n\n","date":"March 12, 2015 at 1:52 am","url":"https://shroudstory.com/2015/03/09/nice-review-of-russ-breaults-presentation-in-wisconsin/","cat":"article","id":"comment-193177","author":"daveb of wellington nz","site":"shroudstory"}]
