[{"title":"Pure Rubbish","post":"It was penned by the editor (no less) of The Church Today in April 2009. See page 5 of this pdf:\nhttp://www.holymotherchurch.org/files/37466174.pdf\nIt was easy to track down with Google by inputting that 600,000 claim – and no surprise to see it accompanied by the term “pier review” !\n\n","date":"July 9, 2014 at 4:00 am","url":"https://shroudstory.com/2014/07/09/pure-rubbish/","cat":"press_coverage","id":"comment-136479","author":"Colin Berry","site":"shroudstory"},{"title":"Pure Rubbish","post":"PS: I omitted to mention that it’s a local (Louisiana-based) periodical, and that the article in question was prefaced with this hat tip – if one can so dignify it:\n“Editor’s Note: The following information is from a Lighthouse Catholic Media CD titled “The Passion of Christ in Light of the Holy Shroud of Turin,” by Fr.Francis Peffley.” \nGIGO, as the computer programmers used to say. Correction, a turbo-charged version thereof. Best I stop there.\n\n","date":"July 9, 2014 at 4:32 am","url":"https://shroudstory.com/2014/07/09/pure-rubbish/","cat":"press_coverage","id":"comment-136483","author":"Colin Berry","site":"shroudstory"},{"title":"Pure Rubbish","post":"Thanks for the ref Colin, I read most of the article.  Worse than the curate’s egg, good and bad in parts, but mainly  inaccuracies galore.  Pity the editor didn’t get his work “pier reviewed” before publishing.  I guess sloppy journalism gets in everywhere!\n\n","date":"July 9, 2014 at 4:40 am","url":"https://shroudstory.com/2014/07/09/pure-rubbish/","cat":"press_coverage","id":"comment-136486","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Pure Rubbish","post":"“I guess sloppy journalism gets in everywhere!”\nMethinks sloppiness was raised there to an art form. Surviving STURP members must have loved it. The others are still spinning.\n Nuff said from me. Am off to Oxford for the day, a brief but merciful release from the horrors of the internet.\n\n","date":"July 9, 2014 at 5:05 am","url":"https://shroudstory.com/2014/07/09/pure-rubbish/","cat":"press_coverage","id":"comment-136490","author":"Colin Berry","site":"shroudstory"},{"title":"Pure Rubbish","post":"And I listened to the first few minutes of the CD on which the article is based. Good grief!\n\n","date":"July 9, 2014 at 5:02 am","url":"https://shroudstory.com/2014/07/09/pure-rubbish/","cat":"press_coverage","id":"comment-136487","author":"Hugh Farey","site":"shroudstory"},{"title":"Pure Rubbish","post":"Reblogged this on Omaha News & World Report.\n\n","date":"July 9, 2014 at 7:27 am","url":"https://shroudstory.com/2014/07/09/pure-rubbish/","cat":"press_coverage","id":"comment-136501","author":"OmahaNews.com","site":"shroudstory"},{"title":"Pure Rubbish","post":"Hi Dan\nYou know something? Journalists are supposed to check facts, it is absolutely basic to journalism. It also has a lot to do with ethics.That is something top in my mind when there is something to be written, and it has always been so even when it has come to pointing out errors made by people in the realm of Shroud studies  — and who had their work published!\nThe results have not been good for me, but then, chummies can say whatever they want, others are silenced as much as possible. Welcome to the realm of Shroud studies!\nThe “highly imaginative information” you refer to probably came from someone, who heard it from someone, who, in turn, heard it from someone else. It is not really news, I’ve seen this before. The editors should have known that correct reporting demands sources and the big problem is that people may get the impression that it was derived from someone who was on the STURP team, which is not true.\nI can also see that someone else is following my lead in pointing to these errors!\n\n","date":"July 9, 2014 at 12:16 pm","url":"https://shroudstory.com/2014/07/09/pure-rubbish/","cat":"press_coverage","id":"comment-136538","author":"Louis","site":"shroudstory"},{"title":"Pure Rubbish","post":"Pope Francis also chooses the right people. Even when it comes to the media:\nhttp://www.catholicherald.co.uk/news/2014/07/09/lord-patten-named-president-of-new-vatican-media-team/\n\n","date":"July 9, 2014 at 1:30 pm","url":"https://shroudstory.com/2014/07/09/pure-rubbish/","cat":"press_coverage","id":"comment-136546","author":"Louis","site":"shroudstory"},{"title":"Pure Rubbish","post":"Unfortunately prejudiced editors can and do dictate terms in certain parts of the media. Cardinal Timothy Dolan of New York lashed out this week:\nhttp://cny.org/stories/Thank-You-FFRF,11266?content_source=&category_id=44&search_filter=&search_headline=&event_mode=&event_ts_from=&list_type=&order_by=&order_sort=&content_class=&sub_type=stories&town_id=\nBut it must also be pointed out that the newspaper in question is also anti-Israel and the Sulzberger family belongs to the Episcopal Church (Dan’s Church!)\n\n","date":"July 9, 2014 at 1:45 pm","url":"https://shroudstory.com/2014/07/09/pure-rubbish/","cat":"press_coverage","id":"comment-136547","author":"Louis","site":"shroudstory"},{"title":"Pure Rubbish","post":"I chased the posted story a little further.  Byline of the “Grand Island Independent” story was attributed to ‘Deacon Bill & Nancy Buchta’.  I couldn’t find out much about them, but was led to the St Leo’s Grand Island Parish newsletter.  The newsletter included a promotion of the exhibit, but confined itself to the first quoted paragraph in the posting above, but excluded the inaccurate follow-on; noted that Grand Island Spirit Radio, a local Catholic broadcasting station, and the Knights of Columbus were sponsoring the exhibit.  Also noted that Dan’s posting above has been picked up and published in the Omaha News & World Report, see comment above, presumably scoring a point against the rival Independent paper.  It would seem that the Buchta couple have uncritically taken at face value the Fr Francis Peffley version of the TS evaluation.  The fact that the Omaha News was able to report the Buchta hash creates the potential to undermine the value of the exhibit in some people’s minds.  It would have been better if the Omaha News had included a paragraph referring its readers to more accurate and reliable background sources such as some of the material found on Barrie Schwortz’s shroud.com site instead of merely point-scoring against its rival paper, potentially undermining visitor attraction to the exhibit.\n\n","date":"July 9, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/07/09/pure-rubbish/","cat":"press_coverage","id":"comment-136575","author":"daveb of wellington nz","site":"shroudstory"}]
