[{"title":"Quote for Today:  Historical criteria do not fall from the sky","post":"This is an amazing intellectual exercise. I await with interest a  rebuttal from Charles Freeman. I hope he spares us any invective.\nWhile I admire the author’s work, it points to a problem for the Shroud. How does one present academic arguments in a manner that it accessible to the larger community of humanity who as we face an Apocalypse of Selfishness desperately need the example of Christ’s unselfish sacrifice? That is not just a religious or scientific question, it is also a political one.\nIn the last chapter of my book Quantum Christ I quote Andrew Revkin  of the N.Y. Times who at the 2014 Vatican conference on the environment was chose to sum-up the proceedings:\n“The physical and biological sciences, along with revolutionary advances in technology – from satellites to supercomputers – have provided a clarifying picture of human-driven environmental changes. Psychological and sociological studies have revealed deeply ingrained human traits; many shaped by our evolutionary history as a “here and now” species, that prevent us from acting rationally in the face of threats with long time scales, dispersed impacts and inherent complexity. Possible paths have been delineated in recent decades using ever more sophisticated models. But that is where science’s task ends. It is up to individuals and societies to choose which paths to pursue.”\n\n","date":"November 17, 2014 at 7:35 am","url":"https://shroudstory.com/2014/11/17/quote-for-today-historical-criteria-do-not-fall-from-the-sky/","cat":"article","id":"comment-171700","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today:  Historical criteria do not fall from the sky","post":"models are not all encompassing such as global warming models that have failed to predict the no change in global temp. for the last 18 years even though carbon dioxide has been increasing each year.\n\n","date":"November 23, 2014 at 5:04 pm","url":"https://shroudstory.com/2014/11/17/quote-for-today-historical-criteria-do-not-fall-from-the-sky/","cat":"article","id":"comment-172714","author":"Paul","site":"shroudstory"},{"title":"Quote for Today:  Historical criteria do not fall from the sky","post":"Googling the words:\n“History Historical criteria Numismatics”\nI have found the article:\n“The Coins of 3rd Century Sasanian Iran and the Formation of Historical Criteria”\nby\nRika Gyselen, C.N.R.S. France\nThen try to consider the words:\n>… how a numismatist can isolate a coin type that provides evidence about a particular political\nsituation, whose real nature has to be discovered by the historian.\nthat can be turned into the following words:\n>how a numismatist can isolate a coin type that provides evidence about a particular\nreligious\nsituation, whose real nature has to be discovered by the historian.\nLinks:\nhttp://www.sasanika.org/esasanika/the-coins-of-3rd-century-sasanian-iran-and-the-formation-of-historical-criteria-2/\nhttp://www.sasanika.org/wp-content/uploads/e-sasanika10-Gyselen.pdf\n…and, of course, everything is still connected to the previous discussions\nabout the article written by Charles Freeman …\nDo you agree on this very simple change in word (turning the phrase)?\nIn any case Numismatics seems to be a secretive sphere through which links with art, history, religion and finance are revealed …\nI apologize for the trivial “materiality” of the argument (= “Coins and History”) treated\nbefore these lines. However, what is important is the demonstration (the so-called:\n “numismatic dating”) through the exact calculation of the probabilities with respect to the claims of Charles Freeman ….\nand, of course,  I hope that Charles do not spares us any invective.\nThis is just a feeble attempt to establish the Truth about the “numismatic dating” and his claims about the origin of the Shroud…\nI apologize if I have turned a bit goofy with this my little numismatic-historical intervention in the blog … So… I hope in the possible contribution of the real experts of the two sectors (Numismatics and History).\n\n","date":"November 17, 2014 at 10:48 am","url":"https://shroudstory.com/2014/11/17/quote-for-today-historical-criteria-do-not-fall-from-the-sky/","cat":"article","id":"comment-171732","author":"piero","site":"shroudstory"},{"title":"Quote for Today:  Historical criteria do not fall from the sky","post":"“simple” in scientific terms means few free parameters.\nepicycles theories have a terribly bad reputation.\n\n","date":"November 18, 2014 at 4:34 am","url":"https://shroudstory.com/2014/11/17/quote-for-today-historical-criteria-do-not-fall-from-the-sky/","cat":"article","id":"comment-171838","author":"anoxie","site":"shroudstory"},{"title":"Quote for Today:  Historical criteria do not fall from the sky","post":"I don’t believe that numismatic dating is equal to Ptolemy’s theory of epicycles …\nIn any case I want to understand what you wrote with the words:\n>epicycles theories have a terribly bad reputation \nI have read that:\n>Ptolemy’s theory of epicycles (orbits within orbits within orbits…) was used to explain the strange motion of the planets, which sometimes flipped back on their own paths, instead of following simple patterns. At the same time, crucially, his theory allowed the Earth to remain the centre of the universe. …\nlink:\nhttp://www.simonsingh.net/Simpsons_Mathematics/how-ptolemys-homer/\nNumismatics (from the Greek “nòmisma”) is the science concerned with the study and description of coins as well as with historical, artistic and economic matters related to them. Numismatics and the coins it studies therefore constitute an open book on the history of the world …\n— —\nLink:\nhttp://en.wikipedia.org/wiki/Portal:Numismatics\n— —\nIn the book (2014) by Giulio Fanti the Byzantine coins were reevaluated to better understand the influence of the Shroud image.\nProf. Eng. G. Fanti in his own book used nose/eyes ratio…\n… and then Barrie Schwortz rejected “Freeman’s claims”\nand indicated the numismatic proof about the early coins (= byzantine coins, IMO).\nIt is therefore to exhibit in a good manner to the attention of readers the inherent calculation of the Probability.\nSo (speaking without too many frills…) Calculus of Probability is the main issue to consider …\nThen : no epicycles… unless you had another idea.\nUnfortunately I can not write anything that appears in the book of the engineer Fanti (… because of copyright …), the title translates into English is: “Turin Shroud: First Century A.D.”. But, if I am right, the coins considered are from the Byzantine period and therefore with that numismatic dating you can only get to a date before the seventh century … but this is already useful to refute Charles Freeman!\nTherefore I am expecting your answer on the question exposed (and then I believe\nyou have to take into account the nose/eyes ratio [for the faces of Christ present on the coins]… !).\n\n","date":"November 18, 2014 at 7:56 am","url":"https://shroudstory.com/2014/11/17/quote-for-today-historical-criteria-do-not-fall-from-the-sky/","cat":"article","id":"comment-171865","author":"piero","site":"shroudstory"},{"title":"Quote for Today:  Historical criteria do not fall from the sky","post":"I was answering to the posting’s issue, namely about Ockham’s razor and how it translates in scientific terms. It was not an answer to your comment.\n\n","date":"November 18, 2014 at 10:14 am","url":"https://shroudstory.com/2014/11/17/quote-for-today-historical-criteria-do-not-fall-from-the-sky/","cat":"article","id":"comment-171882","author":"anoxie","site":"shroudstory"},{"title":"Quote for Today:  Historical criteria do not fall from the sky","post":"The theory of epicycles, is associated with the Greek’s quest for perfection, particularly with Plato’s theory of ideals.  Circles represented the mathematical ideal of curved orbits.  Eudoxus 400-350 BC, had proposed a model of 27 nested spheres as a geocentric model but which was inadequate for Venus and Mars.  Aristarchus of Samos 310-230 BC proposed a heliocentric model but was unable to win support except from Seleucus in Babylonia.  Eratosthenes 276-194 BC, a remarkable astronomer, director of the Great Library, calculated the earth’s diameter to within 15% from the sun’s solstice angle at Aswan, accurately measured the angle of the ecliptic, compiled a star catalog (lost), and a calendar including leap years.  Hipparchus d.~127 BC, gave the fatal blow by rejecting the heliocentric model, discovered precession of the equinoxes, calculated the year to within 6.5 minutes, compiled first known star catalog of 850 stars in six magnitudes as used today, and introduced the ideas of epicycles, eccentrics and deferrents, provided trig tables.  \nPtolemy’s Almagest in 13 books, (fl 127-145 AD), drew heavily on Hipparchus but modified his geocentric model, extended the catalog to 1022 stars.  The Ptolemaic system remained Western Christendom dogma until the time of Copernicus and Galileo.  \nAround 1609 Kepler had derived his laws of planetary motion and determined that the orbit of Mars was an ellipse.  He had written to Galileo, but Galileo refused to modify his theory of circular orbits.  Why?  Because he wished to preserve the theory of ideals as represented by circles! \nThe Copernican-Galilean-Kepler heliocentric model could only remain as an unproven hypothesis until the 19th century when it was finally proven by two major projects.  These were the quest for the discovery of stellar parallax from the extremities of the earth’s orbit, to which many astronomers dedicated their efforts but were frequently frustrated in their attempts by inadequate equipment and faulty conceptualisation.  It was only finally resolved by the realisation that corrections had to be made for the varying angle of light incidence from Alpha Centauri, an analogy realised from the change in wind direction when turning about while sailing up the Thames River.  The second project was Foucault’s erection of his pendulum suspended by a single filament in Paris demonstrating the actual rotation of the earth.  \nFrom the time of Aristarchus’ first proposing his heliocentric model to its final proof by stellar parallax and Foucault’s pendulum is some 2,200 years.  Secondo Pia displayed his first photographs of the Shroud in 1898.  How long might it be before the mystery of the Man of the Shroud will be resolved?  So many imagine that they have resolved the question already, but there is as yet no consensus.  Will it ever come? In 2,200 years?\n\n","date":"November 18, 2014 at 3:10 pm","url":"https://shroudstory.com/2014/11/17/quote-for-today-historical-criteria-do-not-fall-from-the-sky/","cat":"article","id":"comment-171928","author":"daveb of wellington nz","site":"shroudstory"}]
