[{"title":"Retracted Papers","post":"Odd. Why wasn’t the Fulbright and Di Lazzaro paper published?  All the other St. Louis papers were published at shroud.com.\n\n","date":"April 21, 2015 at 5:54 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197027","author":"Paulette","site":"shroudstory"},{"title":"Retracted Papers","post":"Sadly, Diana Fulbright is extremely ill and has been unable to get us the paper to include on the page. Perhaps Paolo can send it to us?\n\n","date":"April 21, 2015 at 3:45 pm","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197088","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Retracted Papers","post":"“More likely, it has something to do with the St. Louis Conference paper, Earthquake-Induced Piezonuclear Reactions and the Image on the Shroud of Turin: Critical Remarks by Diana Fulbright and Paolo Di Lazzaro.” I doubt if the St Louis conference itself was as important as the several detailed papers (albeit referenced by di Lazzaro) detailing attempts to replicate Carpinteri’s results, which failed to do so.\n\n","date":"April 21, 2015 at 7:01 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197034","author":"Hugh Farey","site":"shroudstory"},{"title":"Retracted Papers","post":"Yeah, you’re right.\n\n","date":"April 21, 2015 at 7:47 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197039","author":"Dan","site":"shroudstory"},{"title":"Retracted Papers","post":"“… detailing attempts to replicate Carpinteri’s results, which failed to do so.”\nPerhaps I have a linguistic problem.\nSo, I ask your help…\nIndeed Carpinteri does not seem to have failed when he measured\nthe neutron radiation, an interesting question if you really relate\nthat strange phenomenon to the possibility for nuclear fission of Iron atoms …\nBut we can not just start from this fact and then immediately move\nto say other particular things (specifically concerning the formation of the\nImage on the Shroud) …\nI think that there is a gap to be filled with the most appropriate studies.\nWhere are ?\nApart the studies done by De Liso (… and she is not a nuclear physicist)\nwe have not the inherent data…\n\n","date":"April 21, 2015 at 8:18 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197042","author":"piero","site":"shroudstory"},{"title":"Retracted Papers","post":"Links:\nhttp://link.springer.com/article/10.1007/s12046-012-0066-4#\nhttp://staff.polito.it/alberto.carpinteri/papers/CARPINTERI_2012_N.671_RMRE.pdf\n\n","date":"April 21, 2015 at 8:20 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197043","author":"piero","site":"shroudstory"},{"title":"Retracted Papers","post":"Here I do not want to discuss whether Carpinteri\n[who is a Griffith Medal for Fractural Mechanics, ESIS (2008)\nlink:  http://en.wikipedia.org/wiki/Alberto_Carpinteri ]\nwas out the field of the reason with the fact of going well beyond\nhis own research on piezonuclear fissions occurring in rocks\ncontaining iron (as phengite and biotite) which is transformed\ninto aluminum (with emission of 2 neutrons) or silicon and magnesium\n(with emission of 4 neutrons) in these piezonuclear reactions [involving the fission of iron]. \nSee also:\n“Geomechanical and Geochemical Evidence of Piezonuclear\nFission Reactions in the Earth’s Crust”\nby\nA. Carpinteri and A. Manuello\nLink:\nhttp://onlinelibrary.wiley.com/doi/10.1111/j.1475-1305.2010.00766.x/abstract?deniedAccessCustomisedMessage=&userIsAuthenticated=false\nHere an excerpt from the Abstract: \n>Piezonuclear reactions, which occur in inert and non-radioactive elements, are induced by high pressure and, in particular, by brittle fracture phenomena in solids under compression. These low-energy reactions generally take place in nuclei with an atomic weight that is lower or equal to that of iron (Fe). The experimental evidence, obtained from repeatable measurements of neutron emissions [Strain 45, 2009, 332; Strain (in press); Phys. Lett. A. 373, 2009, 4158], can be also recognised considering the anomalous chemical balances of the major events that have affected the Earth’s crust, oceans and atmosphere, over the last 4 billion years. … etc. … …. etc. …. .\nInstead I believe that “Meccanica, an International Journal of Theoretical and Applied Mechanics” should publish some new researches based on nanotechnologies\n(AFM, AFM three-points bending tests, MEMS, etc.) for the controls of linen fibrils\nas often I wrote in this blog.\n— —\nHowever Carpinteri was pelted (along with other sindonologists)\nfrom the “historical researcher” Andrea Nicolotti in his book published by Einaudi …\n— —\nProf. Carpineri was director of the Istituto Nazionale di Ricerca Metrologica (= INRiM) in Turin. The worst thing was the fact the “commissariamento” (= compulsory administration)\nfor the INRIM…\nLinks:\nhttp://www.inrim.it/gen/doc/DPCM_14_febbraio_2013_Commissariamento_INRIM.pdf\nhttp://www.inrim.it/index.shtml\n>The Istituto Nazionale di Ricerca Metrologica (INRIM) is a public body under the jurisdiction of the Ministry of Education, Universities and Research. INRIM is devoted to the study of the science of measurements and to research into materials; furthermore it works on developing innovative technologies and devices. \n— — —\nAs I think you may well understand, research on the degree of polymerization of the cellulose and research about the flexural test of the linen fibrils have enough to do with metrology… \nFor example, see in this blog:\nNew Italian Book: The Mystery of the Shroud by Giulio Fanti and Saverio Gaeta\n(March 26, 2013)\n>… …Do you know Structural Mechanics ?\n>There is the three-point bending test with an AFM apparel\nthat is an interesting way to use.\n>In my opinion this is the way to know the answer\nfrom the linen fibrils.\nand also:\n>… …In my opinion we have to do a good survey, testing both the areas : the safe\nand the (presumed) contaminated areas.\n>The AFM and the Raman analyses can show the truth.\nLink:\nhttps://shroudstory.com/2013/03/26/new-italian-book-the-mystery-of-the-shroud-by-giulio-fanti-and-saverio-gaeta/\n\n","date":"April 21, 2015 at 7:59 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197041","author":"piero","site":"shroudstory"},{"title":"Retracted Papers","post":"“Indeed Carpinteri does not seem to have failed when he measured the neutron radiation.” On the contrary, Piero; Carpinteri’s experiment, his data and his conclusions have been examined in detail and found hopelessly wanting. His neutron radiation has been discredited. You might try the following for evidence: “http://www.sciencedirect.com/science/article/pii/S0375960110009515” and there are several similar papers.\n\n","date":"April 21, 2015 at 9:18 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197049","author":"Hugh Farey","site":"shroudstory"},{"title":"Retracted Papers","post":"First of all: the paper you previously mentioned\n(= Remarks on “Piezonuclear neutrons from fracturing of inert solids”, by Antonio Spallone, Odoardo Maria Calamai, Paolo Tripodi) is dated 2010, an old paper … \nInstead there is a study by Carpinteri and Manuello dated 2012 titled:\n“An indirect evidence of piezonuclear fission reactions:\nGeomechanical and geochemical evolution in the Earth’s crust.”\nLink:\nhttp://staff.polito.it/alberto.carpinteri/papers/CARPINTERI_2012_N.670_PMES.pdf\nThen, see also:\n“Piezonuclear fission reactions triggered by fracture and\nearthquakes: From the chemical evolution of our planet to the\nso-called cold fusion”\nAlberto Carpinteri Politecnico di Torino\nHere an excerpt :\n>Piezonuclear reactions are fissions of non-radioactive, relatively light elements (iron or lighter ones) that split without a concomitant generation of gamma radiation or radioactive waste but give rise to neutron emissions. As evoked by the Greek root of the word, they are caused by pressure waves, in both liquids and solids. The salient results, which have already appeared in authoritative international journals of experimental physics or mechanics, provide direct and indirect evidence of the occurrence of piezonuclear reactions. Indirect evidence includes the neutron emissions that have been detected in a regular and reproducible fashion using different types of detector. Direct evidence of piezonuclear reactions was obtained through a brand-new spectroscopic technique,\nEDS, which, by comparing a statistically significant number of spots lying on the outer surface or the fracture faces of the granite specimen, and aiming directly on the only two iron ores present – Phengite and Biotite – was able to ascertain that iron, on average, was locally reduced by 25% and was replaced with atoms of aluminium (atomic number =13, half that of iron), silicon (atomic number =14) and magnesium (atomic number =12). Thus, the split was symmetrical in the case of aluminium, asymmetrical in the other instances.\nIf these reactions can take place in a laboratory, where pressure and temperature conditions are much lower and, especially, the masses at play are much smaller than those found in the deep layers of the earth’s crust, they are bound to take place on a much larger scale within the latter, triggered by fracturing and crushing phenomena of seismic and tectonic origin. On the other hand, neutron fluxes up to a thousand times the natural background level may be detected before and during earthquakes, including medium magnitude ones. … … etc. … … etc.\nLink:\nhttp://www.jacques-benveniste.org/coherence_15_ottobre_2013_Roma-CIRPS.pdf\n— — —\nHugh,\nI want to emphasize that I am not a fan of science fiction or pseudoscience,\nI just want to see what’s true around the world …\nIf someone tells me that there are “chemical proofs” that confirm the piezonuclear transformation of biotite and phengite, then I can believe what he says.\nInstead if I was duped by false chemical tests, then this is another question …\nThese are the terms of the problem, IMO.\n— —\nThen we have to read  the following paper:\n“Comments on ‘Geomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust’ by A. Carpinteri and A. Manuello”,\n by\nU. Bardi and  G. Comoretto\nThis was an article first published online: 7 Nov 2013\nAbstract:\n>In ‘Geomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust’ [Carpinteri and Manuello, Strain (2011) 47(2), 267], the authors claim that the composition of the Earth’s crust and of its atmosphere can be explained by hypothetical piezonuclear reactions. We argue that these claims are contrary to the known experimental evidence of the energy balance of the nuclear reactions involved, and we report a detailed criticism of the claims of the paper.\n— —\nSo … Where is the truth?\nI am not a lawyer…\n— —\nAt the end I have to admit that I have found the following words:\n“Controversial Italian scientist loses 11 papers from journal he used to edit”\n(a note written by Cat Ferguson, April 16th, 2015 at 3:26 pm)\nunder the address:\nhttp://retractionwatch.com/\n>… …Carpinteri was also editor in chief of the journal Meccanica until 2014, when Luigi Gambarotta took over. Now, Meccanica is retracting 11 of its former EIC’s papers, including the one on the Shroud, and a number on piezonuclear fission, which Wired Italy put on their list of “most famous science hoaxes.” The reason? According to the notice, “the editorial process had been compromised.” … \nAmen…\nThen it would be really interesting to see how\nthe “phantomatic/ghost neutrons” jumped out …\n— — —\nIn Turin, back in 1998, I underlined the need to improve researches\non the Shroud with the use of advanced microscopies:\nAFM, SNOM and CFM …\nI never made extravagant claims about nuclear emissions\n… indeed: in 2005, my paper for Dallas (where I pointed to the idea of\nexposing in parallel with linen samples [during the inherent and\ncareful experiments] the Solid State Nuclear Track Detectors = SSNDT),\nwas rejected…\nAnd see also the words by Eng. Gonella (during the meeting of Villa Gualino, year 2000).\n\n","date":"April 21, 2015 at 11:27 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197067","author":"piero","site":"shroudstory"},{"title":"Retracted Papers","post":"Sorry…\nI forgot to write the link about the study by Bardi and Comoretto (“Comments on ‘Geomechanical and Geochemical Evidence of Piezonuclear Fission Reactions in the Earth’s Crust’ by A. Carpinteri and A. Manuello”): \nhttp://onlinelibrary.wiley.com/doi/10.1111/str.12036/abstract;jsessionid=32BCA169B993158B66C9AE24D23BB9E8.f01t04?deniedAccessCustomisedMessage=&userIsAuthenticated=false\n— — —\nHowever I believe that Prof. Carpinteri could (maybe) help out (… in further studies on “mechanical dating”. See my previous remarks on AFM bending tests for measurement of Young’s modulus, the “gopic hand test”, etc. …) for his great experience in Structural Mechanics calculations (as a professor of Building Science).\nBut I do not think this is the time to annoy him …\n\n","date":"April 21, 2015 at 11:46 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197070","author":"piero","site":"shroudstory"},{"title":"Retracted Papers","post":"I’m not how all that ends up, Piero, except that from Carpinteri’s first experiments in 2009 until his latest submission to Meccanica in January 2014, his work has been challenged sufficiently to doubt whether any of it should have been included in a peer-reviewed scientific journal. An article at “http://retractionwatch.com/2015/04/16/controversial-italian-scientist-loses-11-papers-from-journal-he-used-to-edit/” says that “In 2012, more than 1,000 scientists signed a petition asking the Italian National Institute of Metrological Research (or INRIM, of which Carpinteri was director at the time) not to fund piezonuclear fission.” This does not suggest universal confidence in Carpinteri’s ideas.\nIt is interesting to revisit “https://shroudstory.com/2014/02/12/breaking-news-another-day-another-solution-to-the-image-and-the-carbon-dating/” to see what we all thought of Carpinteri three years ago.\n\n","date":"April 21, 2015 at 12:17 pm","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197075","author":"Hugh Farey","site":"shroudstory"},{"title":"Retracted Papers","post":"Hugh,\nFirst of all, I want to underline that your address:\n“http://retractionwatch.com/2015/04/16/controversial-italian-scientist-loses-11-papers-from-journal-he-used-to-edit/”\nis the same with respect the other :\nhttp://retractionwatch.com/\nthat I have indicated (more shortly written).\nI was curious to see what were the results\nfrom the application of Solid State Nuclear Track Detectors\n(= SSNTDs) in experiments about Image Formation\n(then: included neutron dosimetry …), but I didn’t believe\nin this particular way as explanation for the mysterious Image.\nPerhaps we can try to simulate an “AFM (Atomic Force Microscopy)\ninspection on exposed SSNTD” model with Comsol Multiphysics.\nSee also the useful “personnel neutron dosimetry” in nuclear plants.\nFor this question I have found the following study:\n“Different etching processes of damage track detectors for personnel neutron dosimetry”\nby\nL. Tommasino, G. Zapparoli, P. Spiezia, R.V. Griffith, G. Espinosa\n(It is available online since 29 August 2002)\nAbstract\n>The advantages and limitations of different etching processes of CR-39 detectors for personnel neutron dosimetry are analysed. The chemical etching can be considered the converse of the electrochemical etching, since the former provides very poor response to low energy neutrons, while the latter greatly simplifies the registration of these neutrons. A foil of CR-39 etched electrochemically results in a simple and sensitive neutron dosimeter with a response proportional to the dose over the entire energy range of interest.\n — —\nHere the explanation about CR-39, or allyl diglycol carbonate (ADC):\n>It is a plastic polymer commonly used in the manufacture of eyeglass lenses…\n>… An alternative use includes a purified version that is used to measure neutron radiation, a type of ionizing radiation, in neutron dosimetry. …\nLink:\nhttp://en.wikipedia.org/wiki/CR-39\n— — —\nCarpinteri claimed the fission for Iron atoms,\nbut I have never seen the use of SSNTD in the inherent experiments.\nCarpinteri believed in normal EDS (Energy Dispersive X-ray Spectroscopy)\ncontrols…\nSee also:\nEnergy dispersive X-ray spectroscopy analysis on rock samples\nsubjected to piezonuclear tests.\nby A. Carpinteri, A. Chiodoni, A. Manuello, R. Sandrone\nLink:\nhttp://link.springer.com/chapter/10.1007/978-1-4419-9798-2_7\nReading the inherent abstract we can see the absence of SSNTD:\nAbstract\n>In the present paper, Energy Dispersive X-ray Spectroscopy (EDS) was performed on different samples of external or fracture surfaces coming from specimens used in piezonuclear tests [1,2]. For each sample, different measurements of the same crystalline phases (phengite and biotite) were performed in order to get averaged information of the chemical composition and to detect possible piezonuclear transmutations from iron to lighter elements. The results of EDS analyses show that, in the fracture surface samples, a considerable reduction in the iron content (~25%) seems to be counterbalanced by an increase in Al, Si, and Mg concentrations.\nReading what is able to do EDS we can turn perplexed\nabout what really happened in the experiments by Carpinteri :\n>Energy-dispersive X-ray spectroscopy (EDS, EDX, or XEDS), sometimes called energy dispersive X-ray analysis (EDXA) or energy dispersive X-ray microanalysis (EDXMA), is an analytical technique used for the elemental analysis or chemical characterization of a sample. It relies on an interaction of some source of X-ray excitation and a sample. Its characterization capabilities are due in large part to the fundamental principle that each element has a unique atomic structure allowing unique set of peaks on its X-ray emission spectrum. …\nLink:\nhttp://en.wikipedia.org/wiki/Energy-dispersive_X-ray_spectroscopy\n— —\nSo…\nWhat happened? Another question similar to the “C14 1988”?\nI don’t know…\nWere the results of EDS analyses a wrong approach?\nWere the EDS analyses wrong?\nThese things seem to be incredible.\n— —\nPerhaps the use of an exposure (in parallel to the fracturation)\nto the SSNTD samples was a better solution (in theory),\nbut in practice this was a bit difficultt to obtain …\n— —\nWhat is your idea?\n— —\nPerhaps I have lost the exact point of the matter:\nSo, where is the problem?\nReally Carpinteri results were not replicated?\nZero neutrons?\nAttention, please:\nas you can see, I am not referring to gamma rays,\nI only refer to the strange neutron emissions.\nIn the article by Spallone, Calamai and Tripodi\n(published online in August 2010)\nwe can read:\n>Mistake in the analysis of neutron detection due\nto intense acoustic signal or charged particle emitted\nin fractoemission phenomena is suggested.\nBut EDS analyses were not mentioned…\nUnfortunately I have not read the entire article (only the abstract).\nSo, the results obtained from the EDS analyses\nis still a point to clarify … (in my opinion)…\n[taking apart the question of numerous signatures against Carpinteri\nthat “in itself” are “meaningless” (IMO)].\n— — —\nNow (unfortunately) I have to stop with these stories\non “piezonuclear cancer” (and here I didn’t discuss the strange\n“earthquake” in Jerusalem, that is another problem to solve\n[…and we have not the inherent informations. See also:\nthe tunnel of Ezekia and the presence or absence of useful signs\nfor the past earthquakes, etc.])…\nInstead what was important (in my idea) is the analysis of\nStructural Mechanics, in order to properly discuss the AFM bending tests!\n\n","date":"April 22, 2015 at 9:37 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197182","author":"piero","site":"shroudstory"},{"title":"Retracted Papers","post":"In my opinion a “key-paper” (published in 2012) to discuss (about the problem for EDS analyses, the point to clarify as I\npreviously wrote…) is the following:\nComment on “Compositional and Microchemical Evidence of Piezonuclear Fission Reactions in Rock Specimens Subjected to Compression Tests” [Strain 47 (Suppl. 2),\n282 (2011)]\nby\nG. Amato, G. Bertotti, O. Bottauscio, G. Crotti, F. Fiorillo, G. Mana, M. L. Rastello, P. Tavella, and F. Vinai\nINRIM – Istituto Nazionale di Ricerca Metrologica, Turin\nLink:\nhttp://arxiv.org/pdf/1205.6418.pdf\n— —\nShort summary:\n>it is shown that the chemical composition data published by Carpinteri et al. in the article “Compositional and Microchemical Evidence of Piezonuclear Fission Reactions in Rock Specimens Subjected to Compression Tests” [Strain 47 (Suppl. 2), 282 (2011)] cannot be the result of independent measurements as claimed by the authors.\n>Therefore, no conclusion can be drawn from them about compositional modifications induced in the stone by hypothetical piezonuclear reactions taking place during catastrophic failure of the material at fracture.\n— — —\nIn other words, the EDS compositional analysis was challenged by INRIM researchers …\nThe comments concerned the phengite data only.\nNothing was said about the biotite data.\nIn the case of the phengite phase, EDS spectra were collected at 30 sites on polished thin sections of the uncracked external surface, and at 30 sites on small portions of the fracture surface.\nHere the problem:\n>The relative precision of semiquantitative standardless EDS analysis is of the order of some percent for homogeneous test specimens with carefully prepared polished surface. Data generated on casual surfaces, such as fracture surfaces, are of signicantly lower precision with unpredictable variation…\n… and after other important considerations\n(… here omitted …), the negative conclusion about the analyses on chemical composition data published by Carpinteri et al. was that:\n> the work done by Carpinteri et al. cannot be the result of independent measurements. \nThen, the verdict by Amato, Bertotti, Bottauscio, Crotti, Fiorillo, Mana, Rastello, Tavella, and Vinai,\nwas the following:\n>Consequently, no conclusion can be drawn about compositional modifications induced by hypothetical piezonuclear reactions taking place during\ncatastrophic failure of the material at fracture.\n— — —\nIn any case this strange question about the Iron minerals\n(= phenigite and biotite) and the rejected “piezonuclear reactions” [which caused a rift within the Italian institution of research (= INRIM), who later was in a critical position for these troubles…] was very far from the positive contribution in order to solve the interesting problem of “advanced textile analyses on linen fibrils of the Holy Shroud”, already sketched in 1998 by myself…\n\n","date":"April 22, 2015 at 11:20 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197201","author":"piero","site":"shroudstory"},{"title":"Retracted Papers","post":"In June 2014 we published several articles relating to the Carpinteri paper. Here’s the link to our article: http://www.shroud.com/late14.htm#quake.  It includes further links to papers by archaeologist Jeff Williams and Shroud researcher John C. Iannone. Williams’ paper was originally published in 2011 in International Geology Review and can be found on Academia.edu at this link: https://www.academia.edu/6108262/Quake_Article.  Iannone’s paper is at: http://www.shroud.com/pdfs/iannoneearthquake.pdf.\n\n","date":"April 21, 2015 at 3:53 pm","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197089","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Retracted Papers","post":"At least meccanica has retracted the articles.\nTwo years ago Scientific Research and Essays published a bunch of shroud articles: https://shroudstory.com/2012/08/04/special-shroud-of-turin-issue-of-scientific-research-and-essays-journal/\n\n","date":"April 22, 2015 at 11:28 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197203","author":"anoxie","site":"shroudstory"},{"title":"Retracted Papers","post":"Yesterday I tried to send the following message:\nIn the past I wrote about the: \n>Iron minerals (= phenigite and biotite) and the rejected “piezonuclear reactions” \n(but my previous definition about phenigite and biotite as “Iron minerals”\nwas a bit wrong because: “Phengite is a series name for dioctahedral micas\nof composition K(AlMg)2(OH)2(SiAl)4O10, similar to muscovite\nbut with addition of magnesium. …” and “Biotite is a common\nphyllosilicate mineral within the mica group, with the approximate\nchemical formula K(Mg,Fe)3AlSi3O10(F,OH)2” …)\nand this question can be easily connected with the last note of the study\nby G. De Liso, C. Fidani and A. Viotto (published in “Earth Science”,\nFebruary 2014):\n “Unusual animal behaviour before earthquakes and multiple\nparameter monitoring in Western Piedmont.”\nThis note indicated the study by:\nCarpinteri A, Lacidogna G, Manuello A, Borla O.\n“Piezonuclear Transmutations in Brittle Rocks under Mechanical Loading:\nMicrochemical Analysis and Geological Confirmations”. In Symposium on Recent Advances in Mechanics, Academy of Athens, Athens, Greece, 17-19 September, book part III: 361-382, Editors Anthony N. Kounadis, Emmanuel E. Gdoutos, Editors Affiliations: Academy of Athens, Dept. of Civil Engineering, Democritus University of Thrace; 2009\nTherefore De Liso and the other researchers of that study\nhad chosen a rather special support (prof. Carpinteri and his\nparticular piezonuclear claims) that now seems in doubt weight …\nunless extraterrestrial beings have really suggested to De Liso\n the right way in order to go towards the Truth …\nIn the past De Liso was defined by Garlaschelli\n(link: http://www.uaar.it/news/2014/02/17/sindone-terremoti-intervento-luigi-garlaschelli/\nas “soprano, painter, former sighting of aliens, now become\nexperimental sindonologist…”\n(Italian words = “soprano, pittrice, ex-avvistatrice di alieni, ora diventata\nsindonologa sperimentale”…).\nNow I want to clarify that I do not want to judge a researcher\n(Giovanna De Liso) for her claims about UFOs, abductions, etc.\nUnfortunately I had only exchanged few words with her in 2002\n(near Paris).  I have only taken note of what was written by\nprof. Luigi Garlaschelli (and then echoed by Nicolotti)…\nWas (an is) our humanity driven by extraterrestrial beings?\nMaybe it was better to believe the good angels,\nthem there were not deceiving.\nHowever I think it would be better not come to confusion between extraterrestrials and angels (= pure spirits) … these are special topics.\nWhat drove Carpinteri to pursue a nuclear physics research deemed\nimpossible by the rest of the scientific community in no time losing\nthe authority conquered in a good career?\nThe piezonuclear question seemed to be very controversial\nalso because De Liso said (in an italian webpage),\nin a letter published in November 15, 2012 :\n “… we have seen neutron detectors, which marked the presence\nof neutrons at the time of rupture of gneiss …\nLink:\nhttp://oggiscienza.it/2012/10/25/istituto-nazionale-di-ricerca-in-misterologia/\n… and I have read on the Web that Giovanna de Liso\nwas also named as an expert in ufology and collaborator\nof CUN (a Italian National “UFO Center”).\n-*-*-*-*-*-*-*-*-*-*-\nIn any case the Luserna Stone (Pietra di Luserna)\n>is a leucogranitic orthogneiss, characterized by a micro-Augen texture, with a marked foliation that is mostly associated to a visible lineation: it geologically pertains to the Dora-Maira Massif, and outcrops in a quite large area (approximately 50 km2) of the Cottian Alps, on the border between the Turin and Cuneo provinces (Piemonte, Italy)…\nLink:\nhttp://www.researchgate.net/publication/259080763_Quantitative_phase_analysis_(QPA)_of_the_Luserna_Stone\nBTW:\nI remember that years ago I have read a study about:\n“Fine atomic image of mica cleavage planes obtaiend with an atomic force microscope (AFM) and a novel procedure for image processing”\nAbstract:\n>Potassium layers and basal oxygen layers in muscovite and biotite cleavage planes were clearly discerned by an atomic force microscope (AFM) with a novel procedure for image processing. Unit cell sizes of muscovite and biotite determined by this procedure were in good accordance with those determined by X-ray structural analysis. Expected differences in the structures of muscovite and biotite, that is, the atomic arrangement of oxygen in the tetrahedral sheet, were clearly demonstrated from the processed images. \nNow I doubt that this technique may serve to then be able to gain more control over what is left after the fracturing process…\nPerhaps one can try to do some new controls on biotite cleavage planes\nin order to better investigate the negative problems already seen with EDS.\n-*-*-*-*-*-*-*-*-*-*-*-\nHere another question about the use of microscopy…\nbut about Charles Freeman and\nnot regarding De Liso or Carpinteri:\nI think Charles should consider the following fact: Prof. P. L.\nBaima Bollone says that Grazia Mattutino, a leading criminologist,\nhelped him to do a new examination (using electron microscopy) of the stubs of 1978\n— —\nHere an explanation about the word “stub”:\n>… All samples must also be of an appropriate size to fit\nin the specimen chamber and are generally mounted rigidly\non a specimen holder called a specimen stub. \nLink:\nhttp://en.wikipedia.org/wiki/Scanning_electron_microscope\n\n","date":"April 24, 2015 at 8:59 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197414","author":"piero","site":"shroudstory"},{"title":"Retracted Papers","post":"Do you know the Rietveld method applied to quantitative phase\nanalysis of minerals containing disordered structures?\nUnder the address :\nhttp://www.rigaku.com/en/applications/rietveld_analysis\nI have found the following explanations:\n>Invented by Hugo Rietveld, Whole Pattern Fitting Structure Refinement is now widely accepted to be an exceptionally valuable method for structural analysis of nearly all classes of crystalline materials not available as single crystals. For the X-ray diffraction (XRD) technique, Rietveld Analysis is analogous to the Fundamental Parameters technique for X-ray fluorescence (XRF). …\n>…The process of refining the pattern is computationally intensive, requiring several minutes to calculate results for a multi-component mixture. Rietveld Analysis has the advantage, over conventional quantitative methods, that no standards are required to achieve accurate results to within ±1%.  … …\nOther links:\nhttp://www.ebookmax.org/uncategorized-list/the-rietveld-method_c2oj.html\nhttp://en.wikipedia.org/wiki/Rietveld_refinement\nhttp://reference.iucr.org/dictionary/Rietveld_method\nhttp://scripts.iucr.org/cgi-bin/paper?S0365110X67000234\n— — —\nSo…\nI am an old dyer who ended up in a problem of mineralogical analysis! …\nThen I ask for your help in order to solve the issue, because\nI have previously indicated the AFM analyses and after another way:\nthe Rietveld method.\nThen I have some doubt about the XRD analyses on fractured mineral materials.\nSo… the last thing that I have found is the following:\n“High Angle Annular Dark Field (HAADF) STEM Tomography”\nWhere:\nHAADF = High angle annular dark field\nSTEM =  Scanning Transmission Electron Microscopy \n>This imaging technique proves ideal for tomographic reconstruction\nas it generates strong contrast that has a fully monotonic relationship\nwith thickness. \nBut I believe it can be extremely long (= time consuming)\nthe fact of having to work with this system on fractured mineral.\nAm I wrong?\nBesides the primary purpose of the analysis would be to identify a change in the atomic composition (after the alleged piezonuclear fission) … and also this way does not seem to offer a great confidence. Am I wrong another time?\n — —\nLink:\nhttp://www-hrem.msm.cam.ac.uk/research/CETP/STEM_Tomo.html\nIs it possible to do these analyses ?\n\n","date":"April 24, 2015 at 9:52 am","url":"https://shroudstory.com/2015/04/21/retracted-papers/","cat":"article","id":"comment-197422","author":"piero","site":"shroudstory"}]
