[{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I take exception to his comment about the ‘ ridiculous idea’ that the side strip was cut off and use to tie up the body.  I’ll find the link later, but that idea is confirmed by the stitching using a technique only seen from artifacts recovered from Masada (last occupied AD70).\n\n","date":"September 9, 2015 at 2:00 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209929","author":"Jim Giordano","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"In Ian Wilson’s 2010 text,  pp 71-72, he quotes Methchild Flury-Lemberg as claiming that the likely reason for the edge piece was to provide a tailored selvedge finish to the cloth.  The main portion of the cloth already had a properly finished selvedge.  Mme F-L postulates that the cloth had been cut from a much larger weaver’s bolt, so as to provide the required width.  The selvedge from the off-cut was then removed and recovered and then resewn to the main cloth to provide a finished edge on the opposite side.\n\n","date":"September 9, 2015 at 2:37 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209933","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I read “The Untold Story of the Holy Shroud” by Carlos Evaristo and was impressed by how much support the history of the cloth while in possession of the Savoy’s gave credence to the reweave theory.\n\n","date":"September 9, 2015 at 5:54 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209945","author":"Russ Breault","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"The difficulty is surely that no one whose speciality is ancient textiles who has actually examined the Shroud close-up has been able to spot the reweaving. Th is is the point that Flury-Lemberg makes of herself and her colleagues who have worked on it.\n\n","date":"September 9, 2015 at 7:07 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209948","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"There is no doubt, I think, that the last paragraph of Marco Bella’s editorial was inflammatory, and did not reflect the objectivity of his principal scientific observation, which has not been questioned. This stated that the two spectrographs Rogers used in his Thermochimica Acta paper, which Rogers thought differed in that one showed the presence of pentosan and one didn’t, should instead by explained by supposing that one shows a hydrocarbon contaminant and one didn’t. That’s all. Rogers’s comments about the spectrographs do not include anything about one containing cotton and one exclusively linen, or one containing vanillin and one not, or one containing madder and one not, or one being older than the other. \nAs to the possibility of invisible weaving, I think I have said all I can without having an example done for me, and have sent two samples of cloth to two different invisible menders to be mended invisibly, so that I can observe, photograph, and demonstrate to anybody that invisible weaving is not invisible under a microscope. I have never seen any evidence for invisible weaving, let alone the invisible weaving itself.\nShroud 2.0 is sufficient to show individual threads, and clearly shows where the odd thread here and there has been extracted, there is no evidence to show that any ‘invisible’ repair has been made. Anybody with Shroud 2.0 who thinks they have found an example should screengrab and post it forthwith! The reply, “of course you can’t see invisible mending – it’s invisible” does not impress me.\nThe side strip issue is not relevant to Rogers’s or to Bella’s papers, as it is not mentioned in either of them. I do not think that the idea that it was cut off to provide a band for tying is any more ridiculous than the idea that a strip was cut out of the middle of the Shroud and the edges sewn back together in order to have a selvedge on each side of the cloth. There are several less ridiculous hypotheses, but I don’t think any of them bear sufficient weight to decide me either way!\n\n","date":"September 9, 2015 at 8:35 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209956","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I’m curious. Put invisible weaving aside. Based on this posting by Joe, does it not give you pause for thought that perhaps the sample section used for the C-14 testing was not ‘original’ material? He presents a strong case that the Shroud has been repaired and fiddled with many times. I wouldn’t be surprised if only the image area has been left untouched by pious medieval weavers. Do you think the sample section tested was consistent with the rest of the linen? I think we may be focusing on the wrong section of the shroud for evidence of reweaves, we need to look at sections closer to the image area. You won’t find evidence of invisible weaves, or otherwise, in a section that itself may be a part of a larger reweave.\n\n","date":"September 9, 2015 at 9:30 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209959","author":"David Goulet","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"The ‘invisible reweaving’ is supposed to have been as a result of the wearing down of the corner after many years of wear, perhaps in the 17th century. If the reweaving area is small, it is possible to speculate that some two thirds of the area is interpolated threads, while one third are the remains of the original, giving the 1320 date. The wider one speculates the edges of the frayed area to be, the less the proportion of original threads is likely to be at the corner. At the edge, where the sample was taken from, the proportion of original threads would be very low indeed. This would imply that the 1320 radiocarbon date was, in fact, the date of the reweave, before the shroud had been displayed for the first time. This is contrary to accepted wisdom.\n\n","date":"September 9, 2015 at 4:38 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209998","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Hugh, I can just say that the whole data regarding 1988 C-14 dating of the Shroud is contrary to accepted wisdom. \nNothing stacks up here -in no way (neither for correctness of the measurements, nor one simple explanation for incorrectness, nor even conspiracy theories)!\nOne data contradicts another, and all the way round!\n\n","date":"September 9, 2015 at 4:57 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209999","author":"O.K.","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Dear Hugh, \nI understand that the final sentence in our paper “..the scientific community and the general public can only be misled by this paper..” referred to TA Rogers’ work might appear harsh to you, but there is a reason for that, as there was a reason for “medieval invisible mending”.\nIn the 2005 TA paper by Rogers you can read: \n———–\n“…The chemical-ionization system used was the most sensitive MS at the time, sufficiently sensitive to detect parts per-billion traces of oligomers from the polyethylene bag that Gonella had used to wrap the Raes threads…”\n————\nTherefore, it appears that Rogers was aware about the presence of a contaminant in the spectra (not “spectrograph”), and this contaminant would give a mass spectra (cluster of peaks differing by 14 atomic mass units) quite similar (identical?) to the one actually observed for his mass spectra of Raes sample. He did not mention these foreign peaks due to the contamination in his discussion of the spectra. Moreover indicated that the peak at M=96 was due to furfural, while it is clear that it is  instead  due to the contaminant.\nIn my opinion, the word “misleading” is justified.\n\n","date":"September 9, 2015 at 11:48 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209974","author":"Marco Bella","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Spectra. Quite so. Thanks for the correction! And me a scientist too!!\nAs for the rest, well, fair enough. Maybe I’m just more permissive….\n\n","date":"September 9, 2015 at 12:54 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209980","author":"Hugh Farey","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"But the expertise of the textile experts has to be weighed against the expertise of the chemists and microscopists who found evidence of a reweave.  In any crime scene, for example, evidence is not just based on visual inspection but also on chemical evidence.\n\n","date":"September 9, 2015 at 8:36 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209957","author":"Joe Marino","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Joe- from all your researches or from the photographic evidence  can you tell us how far the reweaving extends?\nI have never been able to follow the logic of  Roger’s explanations but he seems to imply the reweaving was in cotton that was then dyed. Yet everyone agrees that it is easy to distinguish cotton fibres from linen threads so where are they on Shroud 2.0?\n\n","date":"September 9, 2015 at 9:31 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209960","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"By the way, in 1986, during the Turin planning meeting, before Flury-Lemberg had apparently even seen the Shroud, Harry Gove wrote (per Gove’s book although I don’t have the exact page # handy) “”Flury-Lemberg stated that the cloth is the same from one end to the other. There is no need to take samples from various places. One could take strips from the edges of the main cloth from any place and it would be the same.”  Based on that statement, she was possibly predisposed to not finding any evidence of a reweave.  Experts are not immune to biases.\n\n","date":"September 9, 2015 at 9:19 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209958","author":"Joe Marino","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"That was a very strange assumption made by Gove. What was it based on?\n\n","date":"September 9, 2015 at 9:32 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209961","author":"David Goulet","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Flury-Lemberg made the assumption, not Gove.  Gove just quoted her.\n\n","date":"September 9, 2015 at 9:58 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209964","author":"Joe Marino","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Right, thanks for the correction.\n\n","date":"September 9, 2015 at 10:08 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209966","author":"David Goulet","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I beg your pardon! Your comment is pure malicious speculation. We can invalidate every work that doesn’t please us with this kind of argument .\nRemember that Flury-Lemberg was working with a team that made a micro scanning of the shroud. Were they also biased? Is the micro scanning manipulated? Please, please. \nYou have not any evidence (neither chemical nor physical) that absolutely invisible repairs exist. There is not bibliography, nor any instance of a patch of 1x7cm that could be invisible to microscopical examination. Even some of the experts you have presented as testimonies say that that invisible mending (French Weaving, etc.) is not absolutely invisible to the experts and microscopical examination. \nNow, a peer reviewed paper questions the bases to believe in chemical anomalies in the samples. (Rogers) This is the issue. Not hearsay about suspicious minds.\n\n","date":"September 9, 2015 at 9:58 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209962","author":"David Mo","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I’m not sure the invisible weave exists (it may be a weave too far for me) but Flury-Lemberg’s assumption is very strange. What did she base it on, is my question. Just eyeballing the linen? Is there any hard evidence that supports her assertion? It seems grossly short-sighted and I say that without malicious speculation.\n\n","date":"September 9, 2015 at 10:07 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209965","author":"David Goulet","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I believe that when she made the statement (at the planning meeting and the Shroud wasn’t present) she hadn’t even seen the Shroud.  I have no idea what she based it on.  She would have to expand on that herself.  And based on several replies in this thread, I’ll refrain for now from speculating on that and several other issues raised.\n\n","date":"September 9, 2015 at 4:27 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209996","author":"Joe Marino","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Joe’s citation of Gove’s book, regarding Flury-Lemberg, is found on page 155. Here are some of William Meacham’s comments regarding how much Flury-Lemberg knew about the Shroud at the time of the 1986 workshop:\n“I recall feeling at the time that this was unthinkable – someone who knew nothing about radiocarbon dating and little about the Shroud, and who apparently had not seen the cloth or read the reports on its study, would be nominated to pick a spot and take a sample. Ultimately the responsibility for bringing Flury-Lemberg into the Shroud arena lies with [Teddy] Hall.” (The Rape Of The Turin Shroud [Lulu, 2005], 71-2)\nAnd here’s Meacham’s description of Flury-Lemberg’s comments and the responses at the 1986 workshop:\n“Flury-Lemberg maintained that it did not matter where one took the sample from, since the Shroud was all a homogeneous cloth. Adler begged to disagree, citing the very different chemistries apparent in the scorched areas, the water stain margins, the image areas and the edges. I argued, as I had in correspondence with Gonella, that the edges were anomalous and might have been treated in some way. After more in this vein, Chagas put an end to the discussion by proclaiming that the Shroud was not an archaeological site, sampling should be straightforward and a single sample divided into six or seven pieces would be sufficient. Adler and I shook our heads in dismay. Although we did not know it, the seeds of the imminent disaster that was to befall the Shroud had been planted.” (74-5)\n\n","date":"September 9, 2015 at 6:32 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210002","author":"Jason Engwer","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Finally ! As I first asked on this blog [message dated September 8, 2015] we can read a comment connected to the interesting (and, perhaps, controversial…) book by William Meacham …\nHere what I wrote [September 8, 2015]:\n>Anyway, we can also try to consider what Prof. William Meacham wrote in the book: “The Rape of the Turin Shroud:\nHow Christianity’s most precious relic was wrongly condemned, and violated” (= That book describes the two major fiascos to have afflicted the Turin Shroud in recent years: the C-14 dating of 1988 and the so-called “restoration” of 2002…)…\nWe can remember that previously unpublished photographs of the Shroud, taken by STURP using Quad-Mosaic Photography (state-of-the-art NASA technology) at the time, were published in the scientific journal “Chemistry Today” by Marino and Benford in 2008 in a paper entitled “Discrepancies in the Radiocarbon Dating Area of the Turin Shroud”\nand\nthe fact that these “unpublished photographs of the Shroud” showed “anomalies in the radiocarbon sample area”…\n(see, for example, the paper by Mark Oxley under the address: http://www.shroud.com/pdfs/oxley.pdf and the paper by Barrie Schwortz: https://www.shroud.com/pdfs/quad.pdf.).\nBut the issue turned as another controversial proof…\nThen I think we have to solve an interesting “Four-corner and center (of the Shroud) [UV Photographs]” problem!\nWell.  How to exit from that conundrum?\nNow I ask:\n1- Is it possible to photograph the sample from the so-called “reserve” using ultraviolet fluorescence photography?\n2- Is it possible to photograph (another time) the Shroud using ultraviolet fluorescence photography?\n3- Is it possible  to photograph the Shroud sample of Arizona using ultraviolet fluorescence photography?\nIs too difficult to obtain the permission to do all these simple works?\nIn that case we still can think to start trying the checks after a positive answer only to the questions number 1 and 3… (and also this work it’s obviously feasible only with inherent permissions).\nBut (probably) we still require another check on a sample coming from the main body of the Shroud (as main reference) because the controls, without the adequate reference (= the check on a sample coming from the main body of the Shroud), seems to be a bit inconclusive … or …Would we retain the old UV data (from the main body of the Shroud) as useful reference?\nIn any case if Prof. Jull (of the University of Arizona) want be gentle with us and provide us the useful UV photograph for Arizona sample, that fact will be an interesting “great progress”.\nBut this is not a great progress.\nSo…\nI think we can try to reflect how to write a Plan to submit to the attention of Prof. Jull.\nAnother thing:  don’t like mass spectrometry and I prefer non destructive analyses…\nIs that preliminar work on that Arizona sample too difficult? Only “SPMs-utopia”?\n— — —\n… And, at the end, I want to remember that there exist Alternative Methods for Dating the Shroud… that\n(probably) can break all the vain claims.\n\n","date":"September 10, 2015 at 9:50 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210044","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"This blog is essential. Great stuff, Joe.\n\n","date":"September 9, 2015 at 9:58 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209963","author":"Paulette","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I think we ought to cease with speculations and wait for Heimburger’s reply. Unless someone be able to provide some substantial contribution.\n\n","date":"September 9, 2015 at 10:12 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209967","author":"David Mo","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"That’s one thing I can agree with you, David Mo.\n\n","date":"September 9, 2015 at 10:57 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209970","author":"O.K.","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Mme Flury-Lemberg’s reputation was built on her knowledge and experience of textiles, not of microscopy, nor chemistry, nor any one of the hard sciences.  She had no comprehensive background knowledge of the Shroud before her engagement,  It is conceivable she might have have some minor acquaintance of taking samples if she had been exposed to quality control inspections in textile production, but certainly no full knowledge of what comprises correct sampling protocols in any scientific project.  \nFrom what Joe Marino has written above it seems clear enough that the underlying presumption of homogeneity, based solely on her eye-balling the cloth was quite unjustified.  In discussions concerning possible reweaving, she seems to have assumed that simple darning was implied, seems strangely to have been unacquainted with the practice of French invisible reweaving, and not seeing any obvious evidence of mending within her own experience, made the unjustified assertion that the cloth was uniform throughout. \nThe consequential abandonment of the Chagas protocols, specifying representative sampling has resulted in utterly inconclusive data, and disputatious wrangles with opinion divided merely on the basis of personal viewpoint, and very little else.\n\n","date":"September 9, 2015 at 3:41 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209992","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"So who of those involved might be better qualified to see whether an ancient textile had been rewoven or not?\nAs the issue of reweaving was posed as a hypothesis, it falls on those who propose it to show where they think the reweaving extended to and why no one seems to be able to spot it. In particular if Rogers believed that there was some reweaving in cotton that was then dyed( I do find his account difficult to follow) then it should be easy to see it.\nWe obviously need an expert microscopist to help us here. .  The late Walter McCrone anyone?\n\n","date":"September 9, 2015 at 4:07 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-209994","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"As daveb says those who involved in taking the sample did not follow proper proceedure. They took a grab sample (no engineer do that sort of mistake) instead of representative sample and told the world that Shroud is a medieval forgerry. They may have adopted correct laboratory procedures but this do not imply that their results are correct.\nNo one knows when the textile was woven. No one knows how the image got printed. No one knows whether they took the sample from an original linen cloth. Very interesting.\n\n","date":"September 9, 2015 at 6:15 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210000","author":"Sampath Fernando","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Excellent rebuttal, Joe.  Thanks for your insight.\n\n","date":"September 9, 2015 at 9:20 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210013","author":"Dcn Andy","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"“Mme Flury-Lemberg’s reputation was built on her knowledge and experience of textiles, not of microscopy, nor chemistry, nor any one of the hard sciences”.\nWho is an expert on textile? An expert on textile restoration and textile history or an explosives expert? Or a nurse and a former monk? May be I am a very odd person but I think that the most qualified person to decide if a canvas is mended is an expert on textile restauration. This is not to say that this expert cannot be wrong in a particular case and the nurse be right, of course. But now we are speaking about qualifications, are we not?\nFlury-Lemberg: About her expertise with microscope we know nothing. (Remember that her last conclusions were co-signed with an expert in microscope of her team). We don’t know anything on what circumstances she uttered the sentence that Gove attributes to her. I have read the book of Gove and it is a gossip collection with a unique heroe: Harry E. Gove. Remember that Gove affirms that the STURP was a team of destructive zelots. Take care with the book of Gove. \nPlease, wait and see.\n\n","date":"September 10, 2015 at 2:08 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210022","author":"David Mo","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I think it is better to talk about facts, e.g:  The explosives expert found evidence of foreign material where he didn’t expect to find it;  The former nurse and monk interviewed the previous owner of the Shroud who informed them that repairs to the cloth were routinely carried out, and they also interviewed experts in invisible reweaving;  The textile expert appears not to have known about this technique, and expected to see evidence of darning;  Etc, etc.\n\n","date":"September 10, 2015 at 5:07 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210030","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I don’t know this interview. Can you geave the reference, please. Thank you.\n\n","date":"September 10, 2015 at 8:47 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210041","author":"David Mo","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"The “interview” was my misreading of a very long comment by Joe Marino, on the preceding posting concerning the TA editorial, at Sep 8, 8:32 pm: \nSelected extracts:\n“The following passages about invisible mending on the Shroud are taken from the book “The Untold Story of the Holy Shroud” by Carlos Evaristo, the archivist for the Savoy family, who owned the Shroud until King Umberto died in 1983.” … …  \n“According to the testimony of King Umberto II of Savoy (later recalled by friends, the exiled Monarch entertained in the 1950s, at Villa Italia, in Cascais, Portugal), oral tradition in the Savoy Royal Family confirmed that the Custodians of the Holy Shroud, from the earliest medieval period, had sporadically made copies of the Shroud,but also removed fragments from all around the outermost edges of the Burial Cloth, even as far inward as 10 centimeters and distributed these to close relatives, devotees and allies. ” … … \n“According to King Umberto II, the pious practice of sharing Major Relics of the Holy Shroud was, according to tradition, continued by the first three Savoy Lords who possessed it, although they, unlike some of their predecessor Guardians, never purposely removed fragments from their areas with the image of the Corpus Sancti (Holy Body.)\nAnother fact confirmed by His Majesty was that it was traditionally affirmed, that at one point in the past, he edges of the Lenzuoli (Sheet) had become so tattered as to cause embarrassment or criticism of the Custodians, and those areas were repaired and rewoven using identical techniques, but obviously with similar, yet newer, materials containing dyes and other medieval manufacturing ingredients, in an attempt to better blend the new sections in, as best possible, with the original fabric.  ”  Etc. \nThe report by the former Savoy archivist as to repairs routinely carried out, would seem to be sufficient evidence that such repairs were in fact carried out.\n\n","date":"September 10, 2015 at 3:07 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210065","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"“…fragments from all around the outermost edges of the Burial Cloth, even as far inward as 10 centimeters and distributed these to close relatives, devotees and allies”. \n10 cm!? Sincerly, I don’t think this is a reliable source. Where are the holes ? Where is a documented confirmation of such damage?\n\n","date":"September 11, 2015 at 1:45 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210096","author":"David Mo","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I think you will believe what you want to believe to suit your own personal viewpoint on the matter,  The sample taken from the corner was only about 75mm x 12mm.  It then matters little whether the alleged intrusions were 10cm, 5cm or only 1cm.  It is sufficient to discredit the presumption of homogeneity of the cloth, and as the sample was from a highly suspect corner, it cannot be asserted that it was representative of the main cloth, and the claim of 95% reliability becomes risible.\n\n","date":"September 11, 2015 at 4:06 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210105","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"There may have been reweaving but the question is has anyone with PROFESSIONAL EXPERTISE in textile analysis who HAS ACTUALLY EXAMINED THE SHROUD close-up  been able to see it in this specific area.\nNo.\nTherefore no reason to take the reweaving theory seriously. It was never more than a hypothesis and it has been clearly refuted (as John Jackson concurred by providing the pictures showing uninterrupted weave through this section of the cloth).\nSometimes one has to make a judgement on an hypothesis and move on.\n\n","date":"September 11, 2015 at 4:12 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210106","author":"Charles Freeman","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I agree. \nWho is Carlos Evaristo? Is he the archivist of what place? I have not found any biography of this man. Only his controversial interview with Sister Lucy of Fatima. A soap opera, it seems.\nNote that we are speaking of an interview made  by an unknown “archivist” with someone that says that “according some oral tradition”… Oral tradition against statements of experts?\nThe classical confusion. Without any reliable data we are in the domain of the hearsay.\n\n","date":"September 11, 2015 at 5:48 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210112","author":"David Mo","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Do we have examples of other linens of similar age and material (and usage) that we can compare to see if they have been reweaved?\n\n","date":"September 11, 2015 at 8:05 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210114","author":"David Goulet","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I have just read the following strange words:\n>… two crude pamphlets produced in 1992 – 1993 by one Carlos Evaristo, an obscure young man from Portugal who claims to have interviewed Sister Lucy on two different occasions in her cloistered convent.\n>According to Evaristo, during these two “interviews” Sister Lucy essentially retracted everything she had said about the Message of Fatima during the previous 75 years. …\n>… …Evaristo has published the interviews in the form of two pamphlets, entitled Two Hours with Sister Lucy and It All Started with Two Hours with Sister Lucy. The pamphlets have ignited tremendous controversy because in them Sister Lucy is reported as having flatly contradicted a whole series of statements she had made over the previous 75 years regarding the Message of Fatima and its implications for the Church and the world. … \nBut:\n>… …Father Francisco Pacheco (who is a lawyer as well as a priest), publicly disavowed the pamphlet in its entirety. …\nSource:\n“Sister Lucy Betrayed” by Christopher A. Ferrara\nLink:\nhttp://www.fatima.org/books/divimp/divimpap3.asp\n— —\nNow, there is a question to answer…\nIs that “Carlos Evaristo” the same person who was indicated in the following words?\n>…Dr. Zugibe also founded and Chaired, at Fatima, Portugal, the Centre for Religious Research co-founded by Carlos Evaristo of the Oureana Historical Cultural Foundation and dedicated to the scientific study of Miracles and Relics. …\nSo…\nI repeat my request:\nIs this “Carlos Evaristo” the same person?\nLink:\nhttps://www.shroud.com/pdfs/zugibeburial.pdf\n\n","date":"September 11, 2015 at 10:15 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210122","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I do not want to sound like a broken record but it must be reiterated that Rome was not interested in the carbon dating, as Professor Heinrich Pfeiffer explained in the interview:\nhttps://www.academia.edu/14795646/An_interview_with_Professor_Heinrich_Pfeiffer_SJ\nI have also to repeat that Pope John Paul II was also a philosopher and Cardinal Anastasio Ballestrero was a Carmelite. For that reason, not much faith was based on relics by both of them and Turin was negligent in 1988.\n— No examination was made of the chemical composition of the sample\n— the sample was taken from the dirtiest part of the relic\n—Monsignor Giuseppe Ghiberti rejected Ray Rogers’ paper\n— We do not know what was the procedure adopted by Dr. Mechthild Flury-Lemberg\nduring her examination\n— No paper was published to explain the procedure adopted by Dr. Flury-Lemberg\nLastly, with the direction some “Shroudies” have taken, any pleas will fall on deaf ears in Rome.\n\n","date":"September 11, 2015 at 10:14 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210121","author":"Louis","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Here two little remarks (to consider, IMO):\n1) We never saw what kind of results were obtained\nfrom Raman analyses 2002 (by Renishaw)…\nWhy?\nWhat is your idea on that point?\nHere a simple “explanation” (it’s only a vague supposition,\nas I already wrote in the past): they failed that Raman control.\n2) If I am right in my comment, a textile examination was made\n(about the composition of the sample [and they found cotton…]):\n>…As part of the testing process in 1988,\nDerbyshire laboratory in the UK assisted the Oxford University\nradiocarbon acceleration unit by identifying foreign material\nremoved from the samples before they were processed.\n>Professor Edward Hall of the Oxford team noticed two or\nthree “minute” fibers which looked “out of place”, and those\n“minute” fibers were identified as cotton by Peter South\n(Textile expert of Derbyshire laboratory) who said:\n“It may have been used for repairs at some time in the past,\nor simply became bound in when the linen fabric was woven.\nIt may not have taken; us long to identify the strange\nmaterial, but it was unique amongst the many and\nvaried jobs we undertake.” … …\nLinks:\nhttps://en.wikipedia.org/wiki/Radiocarbon_14_dating_of_the_Shroud_of_Turin \nhttp://www.sindone.info/TEXTILE.PDF\n\n","date":"September 11, 2015 at 10:34 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210124","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Please excuse me for the possibility of confusion.\nCaution:\nI spoke of two checks carried out in different years: 2002\n(= Raman analyses) and 1988 (ie fourteen years between one and the other)!\n\n","date":"September 11, 2015 at 10:39 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210125","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Here some of the words written under the Fig. 3:\n>Detail from Fig. 5 (Rogers paper) decomposition pattern\nof the contaminant …\n>…the peak at mass = 96 is likely to belong to the peak pattern of the contaminant…\nLink:\nhttp://www.sciencedirect.com/science/article/pii/S0040603115003093\nSo…\nWhat can be that contaminant (with mass 96)?\nIs that contaminant only an Arabic gum?\n— —\nReferences:\nAcacia senegal vs. Acacia seyal gums – Part 1: Composition\nand structure of hyperbranched plant exudates\nLink:\nhttp://www.sciencedirect.com/science/article/pii/S0268005X15001745\nHere a very little excerpt from the abstract\n(the first line):\n>Acacia gum is a natural arabinogalactan-protein\ntype polysaccharide widely used …\nHere another vague reference:\nStructure of arabinogalactan-protein from Acacia gum: From porous ellipsoids to supramolecular architectures.\nD. Renard , C. Garnier, A. Lapp, C. Schmitt, C.Sanchez \nCarbohydrate Polymers 90 (2012) 322– 332\nAbstract:\n>The structure of the arabinogalactan-protein (AGP)\nfraction of the gum exudate of Acacia senegal (gum Arabic)\nisolated from hydrophobic interaction chromatography\nwas investigated using HPSEC-MALLS, small angle\nneutron scattering and TEM observations. … …\nLink:\nhttp://www.researchgate.net/publication/233440181_Structure_of_arabinogalactan-protein_from_Acacia_gum_From_porous_ellipsoids_to_supramolecular_architectures\n— — —\nIn any case is different from that of Arabinogalactan\n(= (+)-Arabinogalactan; 9036-66-2; D-Galacto-L-arabinan; Galactoarabinan; Larch gum; Polyarabinogalactan), because this has the following\nMolecular Formula:\nC20H36O14\nLinks:\nhttp://pubchem.ncbi.nlm.nih.gov/compound/24847856\nhttp://pubchem.ncbi.nlm.nih.gov/image/fl.html?cid=24847856\n— —\nI hope we are able to solve this little “contaminant enigma”…\n\n","date":"September 11, 2015 at 11:25 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210126","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Here some of the words written under the Fig. 3:\n>Detail from Fig. 5 (Rogers paper) decomposition pattern\nof the contaminant …\n>…the peak at mass = 96 is likely to belong to the peak pattern of the contaminant…\nLink:\nhttp://www.sciencedirect.com/science/article/pii/S0040603115003093\nSo…\nWhat can be that contaminant (with mass 96)?\nIs that contaminant only an Arabic gum?\nor…\nan Olive Oil (with an “aliphatic chain”. Oleic acid: 70.0%)?\n— —\nIn any case this contaminant seems to be\ndifferent from Arabinogalactan\n(= (+)-Arabinogalactan; Galactoarabinan; Larch gum;\nPolyarabinogalactan), because this compound\nhas the following Molecular Formula:\nC20H36O14\n— —\nSo…\nI hope we are able to solve this little “contaminant enigma”…\n\n","date":"September 11, 2015 at 11:48 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210127","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Perhaps Garlaschelli & C. did want indicate the possible contamination from the previous immersion in the tape’s adhesive. Please, read in the paper by Rogers (“Pyrolysis/Mass Spectrometry applied to the Shroud of Turin”). …\n— —\nI don’t understand two things:\n– Why Bella, Garlaschelli and Samperi, indicated a peak at mass 96 instead of 97?  For example : in the paper by Rogers (“Pyrolysis/Mass Spectrometry applied to the Shroud of Turin”) the Figure 2 (“Mass spectrum of the low-temperature pyrolysis of fibers from Raes\nsample #3”) shows a peak at 97\n– Why they wrote “…a pigment, alizarin…”? Alizarin was supposed to come from Robbia (see also : the lake with Aluminium)… Then Alizarin is a compound of coloring matter for linen and/or cotton.\nLinks:\nhttps://en.wikipedia.org/wiki/Rose_madder\nhttps://en.wikipedia.org/wiki/Lake_pigment\nRogers wrote (“Studies on the radiocarbon sample from the shroud of turin”):\n>…The presence of alizarin dye and red lakes in the Raes and radiocarbon samples indicates that the color has been manipulated. Specifically, the color and distribution of the coating implies that repairs were made at an unknown time with foreign linen dyed to match the older original material. …\nLinks:\nhttp://www.casebook.org/forum/messages/4922/Studies_on_the_radiocarbon_sample_from_the_shroud_of_turin-21136.doc.\nhttp://webcache.googleusercontent.com/search?q=cache:NXXgTKP8pR4J:http://www.casebook.org/forum/messages/4922/Studies_on_the_radiocarbon_sample_from_the_shroud_of_turin-21136.doc%2Bshroud+madder+dyeing+lake+aluminium&hl=it&biw&bih&gbv=2&&ct=clnk\nMass spectrometry (Wikipedia):\n>In mass spectrometry, fragmentation is the dissociation\nof energetically unstable molecular ions formed from\npassing the molecules in the ionization chamber of\na mass spectrometer.\n>The fragments of a molecule cause a pattern\nin the mass spectrum used to determine structural\ninformation of the molecule. … … ….\nLink:\nhttps://en.wikipedia.org/wiki/Fragmentation_(mass_spectrometry)\nInterpretation of Mass Spectra\n>… Automated computer-matching procedures are still\nonly an aid to, not a replacement for, the skilled interpreter;\nand the path to that skill, as emphasized in every\nedition of this text, is practice…\nLink:\nhttps://books.google.it/books?id=xQWk5WQfMQAC&hl=it\n\n","date":"September 12, 2015 at 8:36 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210201","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"A few minutes ago I wrote a post trying to explain what I meant …\n But I do not see it.\n So I repeat:\n Perhaps what Garlaschelli & C. wanted to emphasize that there is the possibility of contamination in materile arising from previous immersion in the adhesive.\nThe reference taken into account is the paper by Rogers:\n“Pyrolysis/Mass Spectrometry applied to the Shroud of Turin”\nand the words are the following:\n“…All of the fibers were immersed in the tape’s adhesive, Joan Janney (now Joan Rogers) laboriously cleaned and prepared Shroud fibers for analysis at the MCMS. …”\n\n","date":"September 12, 2015 at 8:59 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210202","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"In other words we have to know what is the probable\ncompound of for that alkyl chain…\nHave you found  an useful example of Pyrolysis/Mass Spectrometry applied to tape’s adhesive?\n\n","date":"September 12, 2015 at 9:01 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210203","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"In other words: we can try to investigate the studies of mass spectrometry techniques for characterizing the hydrocarbon composition of “pressure-sensitive adhesive tapes for forensic correlation purposes”…\nAn example:\nRapid Commun Mass Spectrom. 2008 Jun;22(11):1763-6.\n“The application of isotope ratio mass spectrometry for discrimination and comparison of adhesive tapes.”\nHoracek M, Min JS, Heo S, Park J, Papesch W.\nHere an excerpt from the abstract:\n>Forensic scientists are frequently requested to differentiate between, or compare, adhesive tapes from a suspect or a crime scene. The most common polymers used to back packaging tape are polypropylene and polyvinyl chloride. …\nLink:\nhttp://www.ncbi.nlm.nih.gov/pubmed/18438979\n— — —\nRemember also that the solvent used to clean the tapes\n(laboriously cleaned) was xylene.\nXylene.\nFormula: C8H10\nMolecular weight: 106.1650\nLink:\nhttp://webbook.nist.gov/cgi/cbook.cgi?ID=C95476&Mask=200\n\n","date":"September 12, 2015 at 9:15 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210205","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Here another (extremely vague) reference:\nStandard Guide for Using Pyrolysis-Gas Chromatography andPyrolysis-Gas Chromatography/Mass Spectrometry in ForensicTape Examinations Scientific Working Group for Materials Analysis (SWGMAT)\nLinks:\nhttp://www.swgmat.org/SWG%20tape%20PGC%20guideline.pdf.\nhttp://webcache.googleusercontent.com/search?hl=it&biw&bih&q=cache:nDGKdW2YsaEJ:http://www.swgmat.org/SWG%2520tape%2520PGC%2520guideline.pdf%2BPyrolysis/Mass+Spectrometry+tape+adhesive&gbv=2&&ct=clnk\n\n","date":"September 12, 2015 at 9:18 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210206","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Piero wrote:\n————\n… we have to know what is the probable compound of for that alkyl chain…\n———–\nActually, we do not need to do that far… we just need to read what Rogers wrote in his paper.\n———–\n“…The chemical-ionization system used was the most sensitive MS at the time, sufficiently sensitive to detect parts per-billion traces of oligomers from the polyethylene bag that Gonella had used to wrap the Raes threads…”\n————\nIt happens that “oligomers from polyethylene” show a spectra which peaks differ by 14 atomic mass units. The parks at M=96 it is not furfural, but just one of these peak. Therefore, the two  spectra in Rogers paper differ only by the peaks of the contaminant. I believe it is not necessary to explain that plastic bags were not so common in the Middle Age and why their presence should be considered contamination…\n\n","date":"September 12, 2015 at 10:36 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210211","author":"Marco Bella","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Sorry.\n…actually, we do not need to GO that far…\n\n","date":"September 12, 2015 at 12:30 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210217","author":"Marco Bella","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"I have found an useful link (about presumed methylenic [CH2] peaks, etc.):\nhttp://www.mhhe.com/physsci/chemistry/carey/student/olc/ch13ms.html\nPlease, observe the MS of a typical hydrocarbon, n-decane (and this is the same question you underlined before in your message):\n>…the series ions detected that correspond to fragments that differ by 14 mass units, formed by the cleaving of bonds at successive -CH2- units …\n— —\nDuring the past University Course of Textile Engineering (in English), we did not too deepened into the question of mass spectrometry, the matter to learn was “Textile Chemistry”.\n Instead we were focused on other analyses: the interesting IR and NMR spectra …\n— —\nHave you an interesting and clear proof (= spectra from a mass spectrometry analyses) about the presumed “oligomers from polyethylene”?\n\n","date":"September 13, 2015 at 7:31 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210273","author":"piero","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Carlos Evaristo is a Portuguese Canadian historian and author.\nCarlos and his family were known to Sister Lucia and the sisters in St. Teresa’s Convent in Coimbra. Carlos was the official translator at meeting between Sister Lucia and Bishops and Cardinals from 1992 – 1993. During several of the interviews Sr. Lucia confirmed on video the validity of the Consecration that was made by Pope John Paul II on March 25, 1984. However Father Francisco Pacheco, who witnessed the meeting (1992), publicly disavowed the content of the interview published by Evaristo.[1] Pascheco’s sister a nun named Sister Lourdes Pacheco living in Fatima, Portugal, told Philip James Kronzer on film in the 2005 video documentary “The Fatima Priest or Satan’s Beast?” that her late brother had betrayed the truth and Sister Lucia in exchange for a cash payment from the late Father Nicholas Gruner. Previously Pacheco had given a talk to his blood sister’s religious community at Fatima the day after the meeting with the Fatima Seer and had related her answers to questions posed in almost identical terms as was recorded and publshed by Evaristo. This talk was tape recorded by the sisters who provided a copy of the tape for the Kronzer Documentary exposing the modus operandi of the suspended priest Nicholas Griuner and his fanatical cult. Seer Sister Lucia labelled both Pacheco and Gruner “liars” during an Octiober 11th, 1993 video taped interview broadcast on Portuguese television in March of 1998. She also praised Evaristo for his defence of the truth despite the attacks of Gruner and his cohorts. One of the interviews Evaristo conducted with the Seer was broadcast on Portuguese and Italian television stations for the purpose of public clarification following malicious attacks by Gruner and his Fatima conspiracy theorists. Carlos was the Director of the Castle Program in Ourem,Castle and appears frequently on radio and TV in Portugal and the USA when there are newsworthy programs broadcast on Fatima and Church related issues. Carlos is Curator of St. Stephen’s Church Museum in Santarem, the Shrine where the Most Holy Miracle of the Holy Eucharist occurred in the year 1247 and the Representative of the Vatican Museums Patron’s Office in Poirtugal.[2]\n\n","date":"September 21, 2015 at 6:28 pm","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210895","author":"Father Simon","site":"shroudstory"},{"title":"Significant Response to the Preview of the Thermochimica Acta Editorial","post":"Thank you very much for these\nspecifications/clarifications about Carlos Evaristo!\nI hope to be able to follow (surfing the Web)\nall the intriguing issues a soon as possible …\nAs you can see we are not yet able to solve\na material problem (subject to deepen = individuation\nof chemical compounds, through chemical fingerprinting\nin mass spectroscopy), and then\nI presume that spiritual problems can be more complex.\nThen the next Year (an Extraordinary Jubilee) of Divine Mercy\n(“Misericordiae Vultus”) should be used to prepare\nour souls for the famous Centenary (1917-2017)…\nAm I wrong?\n\n","date":"September 22, 2015 at 11:07 am","url":"https://shroudstory.com/2015/09/09/significant-response-to-the-preview-of-the-thermochimica-acta-editorial/","cat":"article","id":"comment-210940","author":"piero","site":"shroudstory"}]
