[{"title":"Thanks for mentioning the Shroud of Turin again","post":"Maybe next time Jerry Coyne should have a more productive comment beside obvious statements.\nWhat made the image ? Next.\n\n","date":"March 28, 2014 at 10:04 am","url":"https://shroudstory.com/2014/03/28/thanks-for-mentioning-the-shroud-of-turin-again/","cat":"article","id":"comment-94220","author":"anoxie","site":"shroudstory"},{"title":"Thanks for mentioning the Shroud of Turin again","post":"One more thing Jerry is patently ignorant of: substantiated miracles! Clearly, Mr. Coyne should defer to the initiated what should be deferred to them.\n\n","date":"March 28, 2014 at 11:00 am","url":"https://shroudstory.com/2014/03/28/thanks-for-mentioning-the-shroud-of-turin-again/","cat":"article","id":"comment-94242","author":"Psuedonym","site":"shroudstory"},{"title":"Thanks for mentioning the Shroud of Turin again","post":"Jerry Coyne ought to interact with something like Craig Keener’s two-volume work Miracles (Grand Rapids, Michigan: Baker Academic, 2011). Keener is a highly-regarded New Testament scholar who recounts many miracles that he and his associates have experienced, as well as a large number of other miracles in modern times. He includes cases with medical documentation (e.g., before-and-after x-rays), multiple eyewitnesses, and corroboration from hostile sources, for example. He also interacts at length with David Hume’s philosophical objections to miracles. He cites a lot of polling data from around the world showing that hundreds of millions of people claim to have experienced at least one miracle firsthand. If anybody is interested, I wrote a series of posts about Keener’s work a couple of years ago. You can find it here. In the series, I cite many of Keener’s findings and give examples of miracle cases he discusses that are accompanied by documentation.\nCoyne could also interact with the work done by modern paranormal researchers. Say, Stephen Braude’s documentation of some modern paranormal cases. His book The Gold Leaf Lady (Chicago, Illinois: The University of Chicago Press, 2007) is a good introduction to modern paranormal research. Here’s a video of a lecture Braude delivered a few years ago, in which he discusses the evidence for some modern paranormal cases. It should be noted that though the video is labeled as a discussion of the Ted Serios case, Braude discusses more than that one case. What Braude writes about the dishonesty of some (not all) skeptics is largely applicable to some (not all) skeptics of the Shroud as well:\n“Nevertheless, with his usual bluster, [James] Randi accepted a $10,000 challenge (a considerable sum in those days) to duplicate the Serios phenomena and make good on his claim. Of course, confidence is easy to feign, and Randi does it routinely in his role as magician. He also cleverly takes advantage of the occasional high-profile case he successfully exposes as fraudulent, by publicizing those successes and creating the impression that he’s a generally reliable guide when it comes to the paranormal. So Randi’s dismissal of the Serios case was all it took for those already disposed to believe that Serios was a fake, and it was probably enough even for those sympathetic to parapsychology but unaware of Randi’s dishonesty….What the TV audience never learned was that when the show was over and Randi was pressed to make good on his wager, he simply weaseled out of it. To keep that side of the story under wraps, Randi prohibited publication of his correspondence on the matter. That was undoubtedly a shrewd move, because the letters show clearly how Randi backed down from his empty challenge. However, Randi’s original letters now reside in the library at the University of Maryland Baltimore County, and researchers, finally, can easily confirm this for themselves. When Serios’s principal investigator, Jule Eisenbud, died, I was assigned the task of going through his papers. I collected all the material relevant to the Serios case and deposited it in the Special Collections section of the UMBC library. (This includes correspondence, the original photos and film, and signed affidavits from witnesses.)…But there’s no documentary evidence of Randi having even attempted to duplicate the Serios phenomena under anything like the conditions in which Serios succeeded, much less evidence of his having actually pulled it off….In fact, the history of parapsychology chronicles some remarkable examples of dishonest testimony and other reprehensible behavior on the part of skeptics….Skepticism is just as glib and dishonest now as it was in 1882 when the British SPR was founded. In fact, despite sensible and careful dismantling of the traditional skeptical objections, the same tired arguments surface again and again. And those arguments all too easily mislead those who haven’t yet heard the other side of the story or examined the evidence for themselves.” (The Gold Leaf Lady [Chicago, Illinois: The University of Chicago Press, 2007], 22, 34, 126)\n\n","date":"March 28, 2014 at 6:03 pm","url":"https://shroudstory.com/2014/03/28/thanks-for-mentioning-the-shroud-of-turin-again/","cat":"article","id":"comment-94327","author":"Jason Engwer","site":"shroudstory"},{"title":"Thanks for mentioning the Shroud of Turin again","post":"Don’t forget, Jerry Coyne also complained:\n“Another problem is that scientists like me are intimidated by philosophical jargon, and hence didn’t interrupt the monologues to ask for clarification for fear of looking stupid. I therefore spent a fair amount of time Googling stuff like “epistemology” and “ontology” (I can never get those terms straight since I rarely use them).”\nThat’s an amazing confession.  It shows that the man is abysmally ignorant outside his specialty. He is not wondering about the distinction between de dicto and de re, but about a Philosophy 101 distinction.  It would be as if a philosopher couldn’t distinguish between velocity and acceleration, or mass and weight, or a scalar and a vector, or thought that a light-year was a measure of time. \nYes, but despite his ignorance of the simplest distinctions, Coyne is not bashful about spouting off on topics he knows nothing about such as… free will.  Lawrence Krauss is another of this scientistic crew…  And Dawkins…  And Hawking and Mlodinow. And . . . .  Their arrogance stands in inverse relation to their ignorance.  A whole generation of culturally-backward and half-educated scientists does not bode well for the future.\n\n","date":"April 20, 2014 at 12:38 am","url":"https://shroudstory.com/2014/03/28/thanks-for-mentioning-the-shroud-of-turin-again/","cat":"article","id":"comment-101535","author":"Alexander Walker","site":"shroudstory"}]
