[{"title":"The Amazing Parts","post":"Shroud Of Turin DNA Indicates Global Origins |   | |   |  |   |   |   |   |   | | Shroud Of Turin DNA Indicates Global OriginsGenetic material suggests the shroud may have been created in India. | |  | | View on http://www.huffingtonpost.com | Preview by Yahoo | |  | |   | \nI do believe that the facts in this article are false and they want to arrive at the outcome they did so they did not properly relay the facts of the 1988 STURP.  They find a way to arrive at the outcome they want by leaving out the full facts.  It may be helpful to write a rebuttal to the alleged science used in this article, because it is imcomplete. \n\n","date":"October 19, 2015 at 12:46 pm","url":"https://shroudstory.com/2015/10/19/the-amazing-parts/","cat":"article","id":"comment-213003","author":"trina mclaughlin","site":"shroudstory"},{"title":"The Amazing Parts","post":"It would seem that a few exponents of the Shroud’s authenticity are not readers of this Shroudstory site, as they have yet to catch up with the latest debates, and a few of the developments that have been argued here.  It was also obvious in the write-up for the posting for the award to Emanuela Marinelli.  Old assertions which have now been explored more fully are still asserted as dogmatic fact, rather than a more judicious approach to those findings.  I don’t believe that the criticisms seen here discredit the authenticity of the Shroud, only that the arguments are not quite as strong and affirmative as was once believed.  Frei’s work in particular has been disputed, and the presence of aragonite on the nose and knee are not quite as conclusive as previously asserted, although it is present on the feet.  Errors are always present, and many of them are due to the inaccessability of the object, but such presenters need to be a little more cautious in their assertions.\n\n","date":"October 19, 2015 at 2:33 pm","url":"https://shroudstory.com/2015/10/19/the-amazing-parts/","cat":"article","id":"comment-213017","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Amazing Parts","post":"Doesn’t the Sudarium have dirt near the nose area? The study said it matched dirt from Calvary in Jerusalem. I’m sure you know the article i’m talking about.\n\n","date":"October 19, 2015 at 2:49 pm","url":"https://shroudstory.com/2015/10/19/the-amazing-parts/","cat":"article","id":"comment-213020","author":"Matthew L.","site":"shroudstory"}]
