[{"title":"The Shroud of Canterbury","post":"Yes, many people will disagree with my view but I firmly believe that the Shroud of Turin was a gift from the Lord to the people of the world.  He came into the world for the people and he instructed his  apostles to insure that his teachings be given to all of the people so that all be given the word of the Father.\n\n","date":"September 28, 2015 at 5:46 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211408","author":"ekmcmahon","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"It’s time!\nThe key passage in the post is this one:\n“They plan to use multispectral analysis to highlight hidden traces of ink, and holes in the binding may answer other questions: When did the magnificent work break apart? What did the cover look like?”\nSTURP used spectral analysis to the greatest extent possible. The Quad Mosaics were a “primitive” form which did not actually yield data as to composition. Heller used digital analysis to arrive at the conclusion that the bloodstains were in fact bloodstains.\nIf there is one procedure that properly performed is non intrusive its spectral digital analysis.\nIt might cost a few bucks or euros. What is needed is a desire to do it and an organization dedicated to its use to raise the money fund it. Something like a single purpose STURP. I say single purpose because a broad based, multi-tasking study like STURP is politically not feasible. IMVHO\n\n","date":"September 28, 2015 at 6:47 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211410","author":"John Klotz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"But it is not mentioned in the treaty.\n\n","date":"September 28, 2015 at 7:28 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211411","author":"Paulette","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"To quote Trump, the details are not important. If only the Black Knight had brought it back to England when he could have …\n\n","date":"September 28, 2015 at 7:49 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211412","author":"Dan","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Then Charles will come and say that it would have been burned during Protestant reformation.\n\n","date":"September 28, 2015 at 7:54 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211413","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Dan, actually I think HM the Queen would not object, although the Church of England is divided between High Church and Evangelical. Catholics and Anglicans worship at the Walsingham shrine and both denominations now share churches in England.\nPerhaps she would appoint the Duke of Norfolk, of the Fitzalan-Howard family, Marshall (and Chief Butler!) of England, the country’s premier duke and, as earl of Arundel, also the premier earl, as the custodian. The family never became Anglican and is still Catholic.\nDr. Barbara Frale,of the Vatican Secret Archives, who found the Chinon Parchment, agrees that the Shroud was stolen in Constantinople:\nhttps://www.academia.edu/7447446/Was_there_a_link_between_the_Knights_Templar_and_the_Turin_Shroud_An_interview_with_Dr._Barbara_Frale\nBut, if genuine, was is stolen in Jerusalem?. It doesn’t seem so. It would have to be between James (Saint James Vicariate) and Peter (Latin Patriarchate of Jerusalem)\n\n","date":"September 28, 2015 at 9:44 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211417","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Louis,\nThe “theft” of the Shroud from Constantinople is a tricky question because its history pre-Constantinople is controversial. I expect one reason why the Vatican refuses to make an unequivocal statement on authenticity would be the possible claim an Orthodox prelate to have it “returned.”\nWho ever possesses it can never be a true “owner.” Once you reach hypothesis that it is authentic, the Shroud can have only one “owner” and He is the one who left it behind. The Church is not the owner of the Shroud, it is the trustee for Him.\n\n","date":"September 28, 2015 at 9:58 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211418","author":"John Klotz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Hi John\nI agree with you about the pre-Constantinople phase, but there is also controversy when it comes to post-Constantinople. Daniel Raffard de Brienne dismissed Knights Templar possession of the relic, which Dr. Barbara Frale favours:\n https://www.academia.edu/9156258/Shroud_Studies_in_France\nbut then he was accused of having an axe to grind because he was a descendant of Gauthier V de Brienne, Duke of Athens in the 13th century.\nPope John Paul II actually returned some relics stolen from Constantinople to Patriarch Bartholomew I. It was not really the Church’s fault if mercenaries paid by Enrico Dandolo, the Doge of Venice, sacked the city, in fact Pope Innocent threatened thieves with excommunication, as you can read in the interview with Dr. Frale.\nYou are also correct about the trustee, but who should it be if the Owner is up there?\n\n","date":"September 28, 2015 at 11:03 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211430","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Sadly, the English claim to all things French was weakened by the activities of Jeanne d’Arc, among others, and finally abandoned by the Treaty of Amiens in 1802. However, both the fineness and the style of the weave are not inconsistent with British manufacture, and the Shroud may have been either captured from or given by an English owner as part of the negotiations of the Hundred Years War.\n\n","date":"September 28, 2015 at 10:09 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211419","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"I agree with Hugh that an English origin is certainly possible. The English ell, the width of cloth, was 45 inches,c.114 cms and so close to the width of the Shroud. The patterns of bloodstains on the Holkham Bible crucifixion scenes, c.1330. are similar and were made in London. Then the Shroud could have been a spoil of war  won by Geoffrey who was, after all, predominantly fighting the English.\nO.K. Is right- if the Shroud had remained in England, it would have undoubtedly been destroyed at the Reformation.\n\n","date":"September 28, 2015 at 11:18 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211435","author":"Charles Freeman","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Perhaps any English owner would have to be the Grand Master of the Knights Templar. As Ian Wilson has pointed out, the face of Christ was important to the knights, the reason why they chanted psalm 67 during mass, and why they also built round churches all over Europe.\nLondon’s round church, Temple Church, was consecrated by Heraclius, Patriarch of Jerusalem, in 1287, before the Hundred Years War. See the photographs:\n https://www.academia.edu/7556467/Jesus_was_not_buried_in_Talpiot_-_Parts_I_and_II\n\n","date":"September 28, 2015 at 11:18 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211434","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Reminds me of the legendary Knights of the Round Table, in England.\n\n","date":"September 28, 2015 at 12:55 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211437","author":"nag","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"The Shroud would seem to have had many different custodians over the course of centuries.  The original of course must have been in Jerusalem, and from there it is likely to have been in Antioch, possibly Edessa, likely Anatolia, and may have arrived in Constantinople.  Whatever the origins of the present relic, it came into the hands of the De Charnay family and thence to the Savoys.  There is a strong tradition that St Peter kept it as the chief of the apostles, and held it in Antioch where he was the first bishop.  If the Shroud is shown to be the authentic burial cloth of Christ, then as the present successor of St Peter, any current Bishop of Rome would seem to have a legitimate claim to his being the Shroud’s true earthly owner, no matter whatever its previous history.\n\n","date":"September 28, 2015 at 7:36 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211454","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Dan and John Klotz got the point. It has been reported that HRH Prince Charles has demanded the return of the manuscripts to Saint Catherine’ s Monastery. I took a photograph of the pages preserved in England, where they are said to have landed after Stalin sold some pages to the British. The rest are preserved in Russia and Germany.\nTradition is not documentation, there is even a legend that Jesus gave the cloth to James when he appeared to him. When King Humberto was exiled all his property was confiscated and we do not know if Italy made an agreement with the Holy See about ownership of the relic.\nRelations between the Catholic and Orthodox churches are not always cordial. I can understand John’s point that the Orthodox in Istanbul (Constantinople) may claim the relic if it is dated to the first century, they possessed it before the Catholics.\n\n","date":"September 28, 2015 at 8:42 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211459","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"No!  Whatever it’s intervening history, Antioch, Constantinople, Savoy or Turin, it has now been returned to its original owner, St Peter!\n\n","date":"September 28, 2015 at 9:13 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211462","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Daveb,\nDon’t mean to quibble. How was St. Peter the “owner” of the Shroud. Custodian maybe. But if the Shroud ever belonged to any human being it was Joseph of Arimathea who gifted it to Christ.\nI guess you might invoke the old Anglo Saxon rule of finders keepers but that only applies to “lost property” and not even to mislaid property. (I can’t help it, I am a lawyer.)\nI am satisfied to believe that the Shroud was Christ’s gift to humanity, preserved until science could unlock its secrets.\n\n","date":"September 28, 2015 at 10:42 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211467","author":"John Klotz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"John, I can certainly agree with the notion that the Shroud was Christ’s gift to humanity in general.  But if it is to be debated as to who should possess it as an earthly object or as a property right, then I believe that a good case can be made for St Peter having first claim, and it does not have to be on any kind of finders-keepers basis.  \nWe do not need to debate the primacy of Peter among the apostles, and I think we can assume that as given.  In John chapter 20, we read how “the other apostle” arrived at the tomb first and saw the linen cloths, but did not go in, but he gave way to Peter.  \n“4 They both ran, but the other disciple ran faster than Peter and arrived at the tomb first; 5 he bent down and saw the burial cloths there, but did not go in. 6 When Simon Peter arrived after him, he went into the tomb and saw the burial cloths there, 7 and the cloth that had covered his head, not with the burial cloths but rolled up in a separate place. 8 Then the other disciple also went in, the one who had arrived at the tomb first, and he saw and believed.” Jn 20:4-8 \nThe stone had been rolled away, and the tomb was now accessible to all and sundry, including the Roman and Jewish officials.  The burial cloths were still there, and they had held the body of their master.  What to do with them?  As head of the apostles, I think Peter would see it as his duty to take possession of them.  There is good testamentary evidence that he did precisely that, even taking them to Antioch when they eventually abandoned Jerusalem, and where he became its first bishop.  I know that some sources give a variety of versions as to what happened to the cloths, including one involving Pilate’s wife, while others say that they were given to Peter.  Peter’s custodianship tends to be corroborated by various subsequent writers.  I think he has the best claim.  Constantinople was not even founded as a city until some 300 years later.\n\n","date":"September 29, 2015 at 5:07 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211478","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Daveb,\nWell stated as usual but I still have reservations about the use of the the word “own.” I think it is held in trust for humanity. Perhaps it is a distinction without practical difference.\n\n","date":"September 29, 2015 at 5:45 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211480","author":"John Klotz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"John, have you changed your mind, after understanding why Dan posted my comments linking the codex to the Shroud? I never said that I do not think that the Pope should not be the trustee. In response to a previous comment by you I mentioned that Pope John Paul II returned some relics stolen during the “Fourth Crusade” to Ecumenical Patriarch Bartholomew I. \nWhatever may happen, Hagia Sophia is now a museum and Christians in Turkey are not exactly comfortable with the present government.\n\n","date":"September 29, 2015 at 6:25 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211485","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Louis,\nI don’t think I have changed my mind as to anything. I believe the survival of the Shroud to our times is actually a divine providence.\nThat’s a statement that is perhaps a bit out there to some. I think the posting about the codex was fascinating and there is one little piece of it that has captured my attention. That was the fact that the experts would be using spectral digital analysis in unraveling the history of the codex pages. “es e es”\nI’ve reached the conclusion the one examination of the Shroud which would probably be the least intrusive, produce the most important results and might have the best shot at success is spectral imaging. The database created would preserve the Shroud’s composition could be studied in numerous places for generations. The problem is that people would jump on board with if you do that can’t we just add this and then add that little more  and the ability to achieve a simple, quick process of little intrusion that might be approved (with a lot of hard work and tact) would bog down.\nI think is is fair to say a STURP style examination – 120 hours of somewhat intrusive investigations (the removal of samples) or even carbon dating which also includes the removal and destruction of sample no matter how minute is not in the cards.\nA digital spectral database would be created in a fairly short time perhaps a day or two and the results could  be made available for centuries until such time that humanity truly perished.\n\n","date":"September 29, 2015 at 7:19 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211488","author":"John Klotz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Turin has more than sufficient material, including the roughly 2000 microphotographs taken during the restoration. They could start with that, but given what has gone on I do not believe that “Shroudies” will participate in anything.\n\n","date":"September 29, 2015 at 7:55 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211490","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"These 2000 microphotographs…who has seen them? Who currently has access to them?\n\n","date":"September 29, 2015 at 10:14 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211492","author":"David Goulet","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"I do  not know but I would guess that the micro photographs are not sectral digital imaging. On the other  hand it would e nice to know. Can anyone do the math that assuming the 2000 microphotographs were of the complete shroud what the dpi would be (dpi per cm).\n\n","date":"September 29, 2015 at 11:03 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211496","author":"John Klotz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"You can be sure that they are of the complete Shroud, John, also that it was a professional job. Giulio Fanti had wanted to see them to confirm the existence of a “second face”. We now know that there is no such face, just bloodstains.\n\n","date":"September 29, 2015 at 12:25 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211499","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"You can’t really have dpi per cm, as dpi stands for dots per inch, and refers mainly to printers, rather than the resolution of a photo. However, if, to a rough approximation, the Shroud measures 4m2, or 40000cm2, then the 2000 Haltadefinizione photos covered about 20cm2 each. If it is true that details as small as “a few hundredths of a millimetre” are visible, then about 20 pixels per mm would seem to be the “PPI” count, and each photo therefore 800000 pixels. This seems an extraordinarily low figure. Can anyone explain?\n\n","date":"September 29, 2015 at 1:03 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211501","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"You can’t really have dpi per cm, as dpi stands for dots per inch, and refers mainly to printers, rather than the resolution of a photo.\nTo the photographs as well -check scanner settings. My model has max of 1200 DPI -this means that the size of one pixel is about 0.02 mm.\n\n","date":"September 29, 2015 at 2:26 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211505","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"They are in the possession of the archdiocese of Turin and I can’t say who has had access to them. The most that I can say is that if they were made available for study we wouldn’t have people breaking their heads on computers, trying their best with image processing techniques. One person’s work is debunked by another person and that’s how it is.\n\n","date":"September 29, 2015 at 10:34 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211494","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"The Archdiocese has this incredible resource and has not produced a single paper on the subject? Or have they? It sounds like they are sitting on a goldmine and while I may understand why they do not want to share the gold, they should be producing something with it. Otherwise, what was the point? Have they discovered something that puts authenticity in question? Why else to withhold?\n\n","date":"September 29, 2015 at 10:40 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211495","author":"David Goulet","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"When I met Ian Wilson to interview him for a daily he told me that he never expected that much hoopla when his book was published in 1978 and what followed. That is also what the Church feels, for relics are secondary matters. The central event in Christianity is the Resurrection, whether that can be observed on the relic or not.\nIt doesn’t seem that the Church is hiding anything and it would require something more than just the microphotographs for progress to me made. More examination of the bloodstains is also needed.\n\n","date":"September 29, 2015 at 12:09 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211498","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Not a cousin of Jesus.  The Greek here does not translate directly and has always been translated differently than cousin by authorities.\n\n","date":"September 29, 2015 at 6:05 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211510","author":"Dcn Andy","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"But there are examples (In Septuagint and Josephus) where the word adelfos means some relatives who were not direct borthers, for example Gen: 14:14:\nἀκούσας δὲ ῞Αβραμ ὅτι ᾐχμαλώτευται Λὼτ ὁ ἀδελφιδοῦς αὐτοῦ, ἠρίθμησε τοὺς ἰδίους οἰκογενεῖς αὐτοῦ, τριακοσίους δέκα καὶ ὀκτώ, καὶ κατεδίωξεν ὀπίσω αὐτῶν ἕως Δάν\nAnd Abram having heard that Lot his nephew had been taken captive, numbered his own home-born [servants] tree hundred and eighteen, and pursued after them to Dan.\nSo enough with this protestant nonsense.\n\n","date":"September 29, 2015 at 6:14 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211512","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"http://www.ellopos.net/elpenor/physis/septuagint-genesis/14.asp?pg=2\n\n","date":"September 29, 2015 at 6:15 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211513","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Directed to Dcn Andy:\nIt is known that the Greek “adelphos” may mean something other than blood brother, examples being co-religionist (Rom 9:30, neighbour (Mat 5:22-24), step-brother (Mk 6:17-18), kinsman, relative (Gen 29:12, 24:48). It is also true that the NT has a word for “cousin”, Col 4:10, “anepsios”, but when it comes to Mark 6:3 the meaning of “adelphos” is ambiguous.\nWhen the so-called James ossuary was announced to the press with hype, Ben Witherington wrote that the Catholic Church would have to “rethink” the virgin birth. Then, when the “Jesus family tomb” documentary and accompanying book were launched, he was quick to say, “No, James is buried elsewhere”\nThe ossuary inscription reads;\nYaakov bar Yehosef, akhu d’ Yeshua   — Aramaic\nJames son of Joseph, brother of Jesus\nActually the word “akhui” can mean brother, half-brother, step-brother, cousin, relative, even partner.\nIf you want to know the whole story and have the time and patience:\nhttps://www.academia.edu/13960422/The_James_Ossuary_Much_Ado_About_Nothing\nand:\nhttps://www.academia.edu/7556467/Jesus_was_not_buried_in_Talpiot_-_Parts_I_and_II\nas well as:\nhttps://www.academia.edu/7471223/Jesus_was_not_buried_in_Talpiot_-_Part_III\n\n","date":"September 29, 2015 at 7:28 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211516","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"J P Meier in “A Marginal Jew” was uncompromising in his assertions concerning the brothers and sisters of Jesus.  Extract from my notes of 2008: \n“He discounts the birth stories in Bethlehem and concludes that, very likely, Jesus was born and grew up in Nazareth;  His education in Galilee would probably be limited to that attainable by an eldest son of a tradesman, he essentially spoke Aramaic, with only sufficient Greek for commercial transactions, and likely some Hebrew.  Meier discusses the fourth century doctrines of Mary’s perpetual virginity, but considers that the “brothers” and “sisters” of Jesus mentioned in the gospels are in fact blood-brothers or sisters of Jesus – he refers to the typical use of the Greek word adelphos (brother or half-brother) rather than other terms (e.g. anepsios) in common use for relationships such as cousin or step-brother – thus he rejects Jerome’s and other patristic interpretations of these relationships. ”  \nIt is based on the evangelists’ use of the word adelphos, when another common word “anepsios” would have sufficed if they were cousins.  However it occurred to me that adoption was very common in this period, because of the high mortality rates, and the general prevalence of orphans.  Under both Jewish and Roman Law, adoptees had precisely the same legal rights as those of natural descent.  It is fairly easy to find examples where emperors adopted sons and these succeeded to the imperial throne.  Under those circumstances, “adelphos” would be the appropriate term.  Other interpretations would tend to strain too much at the meaning of “adelphos”.  It is interesting that St Paul makes much of the notion that we are all made sons by adoption, and consequently heirs to Christ.  \nA direct quote from Meier’s summary “Roots of the Person”, chapters 8, 9, 10: \n“During the reign of Herod the Great, and probably towards its end (ca. 7-4 BC), Jesus was born in the hill town of Nazareth in Lower Galilee.  His mother was Mary, his putative father, Joseph.  We hear of four brothers of Jesus (James, Joses, Jude, and Simon) and at least two unnamed sisters.  It may be significant that all the names in the family hark back to the glorious days of the patriarchs, the exodus, and the conquest of the Promised Land.  Jesus’ family may have shared in the reawakening of Jewish and national and religious identity that looked forward to the restoration of Israel in its full glory.  That is all the more likely if Joseph claimed to be a descendant of King David.  At any rate, judging by the fiercely religious focus of Jesus’ life once it becomes visible to us, we may reasonably suppose that his family had been deeply devout Jews of a peasant Galilean type: firmly committed to the basic practices of the Mosaic Law (especially to its “boundary symbols” of circumcision, Sabbath, and pilgrimage to the Jerusalem temple), but not given to the niceties of Pharisaic observance. ”\n“As the firstborn son, Jesus would have been the object of Joseph’s special attention, both in training him for a trade and in seeing to his religious education.  The fact that Joseph is notably absent during the public ministry is best explained by the traditional idea that he had already died.  Jesus’ mother, brothers, and sisters survived into the period of the ministry, though not without some tensions between themselves and Jesus.”\n“We are specifically told by various evangelists that the family thought Jesus mad (Mk 3:21), or that his brothers did not believe in him (Jn 7:5), or that Jesus refused a request of his family to see him (Mk 3:31-35).  It is therefore all the more startling, when we glance ahead to the history of the early Church, to find Jesus’ brother James prominent in an early creedal formula listing witnesses to the resurrection (1 Cor 15:7) and in the leadership of the Jerusalem church (Gal 1:19; 2:9, 12) Acts 15:13-21; 21:18) – with other family members following in his steps.”\n“In the face of all this information about members of Jesus’ family, the total silence about a wife or children is best taken as indicating that Jesus chose the highly unusual – but not unknown – path of celibacy.”\n“Growing up in Nazareth, Jesus would have spoken Aramaic as his everyday tongue, while also learning some Hebrew from the local synagogue services, and perhaps more Hebrew from formal instruction provided by his father.  As he started to learn the trade of woodworker from Joseph, he would have found it useful, or even necessary to acquire some Greek phrases for business purposes.  Frequent visits by his family to Jerusalem for the great feasts would have exposed him to more Greek in that polyglot city.  Although he might have used Greek when dealing with Gentiles, and Hebrew when debating the meaning of Scripture with professional Scribes, the bulk of his teaching, directed as it was to ordinary Palestinian Jews, would have been delivered in Aramaic.”\n“Jesus’ teaching was delivered orally, and oral teaching could in theory have been the sole conduit of Jesus’ own education in the Scriptures and Jewish traditions.  In the oral popular culture in which he grew up and later taught, literacy was not an absolute necessity for common people.  Yet the matrix of a devout Jewish family, Jesus’ own preoccupation with the Jewish religion, and the debates over Scripture that Jesus held with professional scribes and pious Pharisees during his ministry all make his ability to read the sacred text a likely hypothesis.” \n“Jesus the woodworker of Nazareth was poor by our modern American standards, though relative to his own society he was no poorer than the vast majority of Galileans.  Actually, not knowing the grinding destitution of the dispossessed farmer, the city beggar, the rural day labourer, or the rural slave, he was not at the bottom of the socio-economic ladder.  While we would find the economic and political realities of Antipas’ Galilee unbearable, they were on the whole preferable to the chaotic last days of Herod the Great, the chaotic first days of the Jewish War in the late sixties, or the sense of oppression by foreigners that the presence of the Roman prefect aroused in Judea.” \nThere is more, and much of it dismisses the more fanciful and even some popular notions concerning this marginal Jew.\n\n","date":"September 29, 2015 at 9:25 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211522","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"daveb:  Why would Jesus have given his mother Mary over to the care of John, if there indeed had been siblings to take her in?  Not many people would believe that all the siblings had died by that time; possible but not likely.  James survived, if he was indeed a brother.  What was Meier’s assumption?\n\n","date":"September 30, 2015 at 9:26 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211556","author":"Nabber","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Nabber, see my comment on J.P. Meier below. In an article published in 2003, as Joe Marino can attest because he ran it on his e-mail list in that year, the handing of mother Mary to disciple John was pointed out:\n https://www.academia.edu/13960422/The_James_Ossuary_Much_Ado_About_Nothing\n\n","date":"September 30, 2015 at 10:17 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211562","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"S.t James and the analyses on ancient DNA.\n>Jerome …\n>…proposed that James, son of Alphaeus,\nwas to be identified with “James, the brother of\nthe Lord” (Gal.1:19) and that the term “brother”\nwas to be understood as “cousin.”\n>The view of Jerome, the “Hieronymian view,”\nbecame widely accepted in the Roman Catholic\nChurch, while Eastern Catholics, Eastern Orthodox\nand Protestants tend to distinguish between the two.\n>Geike (1884) states that Hausrath, Delitzsch,\nand Schenkel think James the Just was the son\nof Clophas-Alphaeus. … …\nLink:  https://en.wikipedia.org/wiki/James,_son_of_Alphaeus\n>James (Hebrew: יעקב Ya’akov; Greek Ίάκωβος\nIákōbos, can also be Anglicized as Jacob), who died\nin martyrdom in 62 or 69 AD, was an important figure\nof the Apostolic Age.\n>Other epithets used to refer to James include James\nthe Just, or a variation of James, brother of the Lord.\n>Roman Catholic tradition generally holds that this\nJames is to be identified with James, son of Alphaeus\nand James the Less.\n>It is agreed by most that he should not be confused\nwith James, son of Zebedee. … …\nLink: https://en.wikipedia.org/wiki/James_%28brother_of_Jesus%29\n>The Church of the Twelve Holy Apostles (Italian:\nSanti Dodici Apostoli, Latin: SS. XII Apostolorum) is\na 6th-century Roman Catholic parish and titular\nchurch and minor basilica in Rome, Italy, dedicated\noriginally to St. James and St. Philip and later\nto all Apostles.\n>Today, the basilica is under the care of the\nConventual Franciscans, whose headquarters\nin Rome is in the adjacent building. … \n>The confessio was constructed in 1837.\n>During its construction, the relics of St James\nand St Philip, which were taken from the catacombs\nin the 9th century to protect them from invaders,\nwere rediscovered.\n>The wall paintings are reproductions of\nancient catacomb paintings.\n>An inscription explains that Pope Stephen IV\nwalked barefoot in 886 from the catacombs to\nthe church carrying the relics on his shoulders.\nLink: https://en.wikipedia.org/wiki/Santi_Apostoli,_Rome\nSo, we can easily suppose that a non destructive DNA\nexamination of these relics (perhaps) can reveal us\nsomething about the possible identity of the deceased person.\nBut we already know that the ancient-DNA control can be\na matter full of pitfalls…\nThen, see also the possible comparison with the analyses\nabout the DNA coming from the Shroud…\nSee also the other case:\nLuke the Evangelist – aka St. Luke…\n>A doctor, but better known as the biblical author\nof the “Gospel According to Luke”, Luke the\nEvangelist was believed to have been born in\nAntioch, in the Roman province of Syria.\n>Historical sources cite that he died at the age\nof 84 in Thebes (Greece) around the year 150 A.D.\n>His body was interred first in Constantinople, and\nthen later transferred to Padua, Italy.\n>Geneticists have tested the remains believed\nto be those of Luke, and sampled Syrian and\nGreek populations for comparison.\n>They’ve determined that the body attributed as\nLuke’s, is likely of Syrian origin.\nLink:\nhttp://www.isogg.org/ancientdna.htm\n\n","date":"September 30, 2015 at 9:22 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211555","author":"piero","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Is it a trollish act the simple fact to indicate\nthe trivial problem of genetic research?\nSorry…\nOther researchers are turning to different\nkind of mysteries ( air shafts in the Great Pyramid\nof Giza, etc., etc.) …\nBut I believe that the study of the relics that\nbelong to the Christianity can be very interesting!\n\n","date":"September 30, 2015 at 11:41 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211566","author":"piero","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Readers please note that my choice of the word “cousin” in the comment which Dan posted above is based on around twenty years experience as a professional Religion Writer, with emphasis on developments in biblical archaeology and studies, some of it the the result of requests from publishers and leading dailies to interview some of the world’s topmost biblical scholars.\nThat said, one must point point the dangers in accepting any amateurish attempts in biblical studies. What does J.P. Meier mean by “marginal Jew”? The title “A Marginal Jew” is not at all representative of the scholar-priest’s insights. He uses the word “marginal” in the sense that Jesus’ life would not have been featured on CNN and that he was not a typical Jew.  \nThe belief in the virginal conception of Jesus was part of the Christology of the early Church, within New Testament times, to be sure. This is part of the long-standing church tradition about Mary’s perpetual virginity, as even Raymond E. Brown acknowledged.\nOne can be sure that J.P.Meier confesses this liturgically.\nThere are times when he has even been conservative in his interpretation, and challenged:\nhttps://www.academia.edu/4700001/What_do_we_know_about_the_Bible_An_interview_with_Joseph_A._Fitzmyer_SJ\nIt is important to know that the priest is still part of the Third Quest, and that is a thing of the past. In a short while a paper on the latest developments in the study of the Jesus of history will be posted online.\n\n","date":"September 30, 2015 at 10:11 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211560","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Food for thought:\nhttp://www.catholicherald.co.uk/commentandblogs/2015/09/30/what-st-jerome-can-teach-internet-trolls/\n\n","date":"September 30, 2015 at 10:45 am","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211564","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"My notes above on adoption give a satisfactory explanation for the evangelists’ use of the word “adelphos” and provide a way of leaving intact the doctrine of Mary’s perpetual virginity.  The first known assertion of the doctrine would seem to be the 2nd century pseudonymous Protoevangelium of James, was debated in the early Church but did not become official until the 4th century.  J P Meier is hardly an amateur biblical scholar.  The gospels would seem suggestive of some possible tension between Jesus and his family, and record that of them all, only Mary his mother was present at the crucifixion, hence the assignment of her care to John.  It therefore might seem curious that nevertheless James the brother (adelphos) of the Lord was the first bishop of Jerusalem.\n\n","date":"September 30, 2015 at 3:47 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211580","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"One thing is interesting: the first known assertion of the doctrine is 2nd century Protoevangelium of James.\nI am quite certain that first Christians from 1st-2nd century who professed that doctrine knew Bible (and greek language) much better than Reformers 1500 years later.\nYet for those latter, everything was simple: there is no mention in the Gospels that Mary was perpetual virgin, there is mention of “brothers” and “sisters” of Jesus, hence shabby papists are deceiving gullible sheep. We read Bible (first Christians didn’t?) so know better 1500 years later.\n\n","date":"September 30, 2015 at 3:59 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211581","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"There were different point of view among the apostles. James was put in charge of Jerusalem because he was not familiar with gentiles. The high priest Ananos had him murdered because he was also a threat to the Temple, Peter did some travelling to preach and eventually went to Rome, while Paul, more open to gentiles, travelled extensively.\nWe should talk about James as part of Jesus’ extended family, as cousin, therefore Mary was left in the care of John.\nSensationalists have tried to use an ossuary, where the second part of the inscription was forged, to put forward the view that James was Jesus’ brother. They did not succeed also because the Israeli authorities judged that the second part of the inscription was indeed forged:\n https://www.academia.edu/13960422/The_James_Ossuary_Much_Ado_About_Nothing\n\n","date":"September 30, 2015 at 5:58 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211594","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Exactly OK…….Mary herself referred to her perpetual virginity related to Fatima (hence 5 first Saturday devotion) and at Guadalupe : “During her initial apparitions to Juan on December 9, the Blessed Virgin Mary had spoken of herself by saying: “Know for certain, dearest of my sons, that I am the perfect and perpetual Virgin Mary, Mother of the true God, through whom everything lives, the Lord of all things, who is Master of heaven and earth. … I am your merciful Mother”\nSo…think i’ll believe Mary instead of  the “reformers” who believe Jesus just left a cookbook instead of a Church.\n\n","date":"September 30, 2015 at 4:33 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211585","author":"rick","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Sorry Rick, the Guadalupe quotation may persuade Marian fanatics, but I think not many others.  My adoption scenario provides a way out to those who see a need to conserve the doctrine, may possibly even be correct, but is not necessarily so.  The early assertions for the belief have to be seen in the context of the need to assert the virginal conception of Christ in light of the infancy narratives, the apparent aversion of many of the early Fathers to the concept of marriage, even misogyny, which survived into the need for ritual purification after parturition.  Goodness knows how they expected survival of the species to come about.\n\n","date":"September 30, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211590","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Goodness knows how they expected survival of the species to come about\nThey didn’t.\nSecond Coming should have been soon.\n\n","date":"September 30, 2015 at 5:30 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211592","author":"O.K.","site":"shroudstory"},{"title":"The Shroud of Canterbury","post":"Daveb…..over 70,000 witnessed Fatima…..including atheistic press (which documented it)..if you don’t like Guadalupe try Fatima….don’t usually agree with you, but always enjoy your posts\n\n","date":"September 30, 2015 at 7:06 pm","url":"https://shroudstory.com/2015/09/28/the-shroud-of-canterbury/","cat":"article","id":"comment-211595","author":"rick","site":"shroudstory"}]
