[{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Of course, the reference to Dante has a devastating effect on the credibility of the paper… What a shame…\nBut, if we are fair-minded, we have to say that neither the 11th on the Richter scale nor the “Dante effect”, have no impact whatsoever on the validity of the scientific conclusion (the possible effects of a 8-9 Richter Scale earthquake on the radiodatation of the shroud) .\nBy the way, Achenbach knows perfectly well (I hope) that Meccanica is a good peer-reviewed journal and not open-access (http://www.scimagojr.com/journalsearch.php?q=14471&tip=sid&clean=0).\nSo why does he suggest the contrary?  This is bad journalism (and bad faith?).\n\n","date":"February 16, 2014 at 4:14 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79747","author":"Tristan Casabianca","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"The first thing they need to establish and the most important if if there was an earthquake and how strong it was with accuracy.  Christ was most likely not crucified in 33.\n\n","date":"February 16, 2014 at 10:12 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79796","author":"Andy","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Tristan is correct that a succession of obvious irregularities in an article do not necessarily detract from any kernal of truthful information that may be found there, but they do cast doubt on the authors’ attention to accuracy, which may impact accross the paper.\nIn this case, the authors seem to have misapplied various findings to the possibility of neutron emission distorting the radiocarbon date of the shroud, and it is disappointing that nobody took them up on this before their article was published.\nFor instance their evidence for an earthquake in 33 AD is extremely shaky. Although they list no less than 6 references for this, every one is directly derived from the biblical accounts of the resurrection, which, even if literally true, do not give any date at all!\nFor another example they say that ” [Most writers] accept the occurrence of the Resurrection earthquake, to which they assign the severity of a catastrophic event, characterised by a local magnitude ML = 8.2.” However they only give one reference for this, At enormous expense, I can quote some exact words of the reference: “The fact that these earthquakes in Jerusalem are not mentioned by contemporary pagan writers, or by three out of the four evangelists, suggests that they may have been inspired by the topos of natures reflecting events of great importance, and they must not be considered as referring to historical earthquakes.” Ambaseys (the author of the reference) goes on to suggests that if the fissures in the vicinity of the Holy Sepulchre are due to an earthquake (which they show is probably not the case), “the causative earthquake should have been strong enough to destroy Jerusalem, for which there is no evidence.” Ambaseys is generous enough to mention, albeit with a wink of incredulity, three modern writers who disagree with him, as they believe in the earthquake, “to which they assign a magnitude of a catastrophic event of ML (sic) = 8.2.”\nThere is more, and in detail, but surely we have enough here to begin to show that Carpinteri’s paper is far too speculative to be accepted without a great deal more research on his part.\n\n","date":"February 16, 2014 at 6:16 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79760","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Having said that, I think it is important that these rather esoteric ideas get their proper airing. Recently we have thoroughly examined David Roemer’s ideas, and a little while ago had another look at the significance of the Quad Mosaic photographs. I think that a rather disturbing proportion of accepted wisdom, even accepted scientific wisdom, let alone esoteric speculation, and not just about the Shroud, is based on insufficiently scrutinised research, which only when it is brought out into the light of the internet, can be properly assessed in detail.\n\n","date":"February 16, 2014 at 6:22 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79763","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"\nHugh Farey :\nHaving said that, I think it is important that these rather esoteric ideas get their proper airing. Recently we have thoroughly examined David Roemer’s ideas, and a little while ago\nhad another look at the significance of the Quad Mosaic photographs. I think that a rather disturbing proportion of accepted wisdom, even accepted scientific wisdom, let alone esoteric speculation, and not just about the Shroud, is based on insufficiently scrutinised research, which only when it is brought out into the light of the internet, can be properly assessed in detail.\n\nBut in whom does one trust?  “Properly assessed” by whom?  The internet is full of “experts”, loaded with them-Macgyvers in lab coats, “experts” in all scientific disciplines-how often in such cases do you hear someone simply say, “I don’t know”.  I’m sorry, but being able to use scientific vocabulary does not make one a scientist.  There’s more to it than that.  if such comments are perceived as somewhat arrogant-flip the coin over-how does it work on the reverse side-when others decide to “properly assess” a topic, even though their personal experience may be limited to nonexistent?  Hear this from the scientific side and see how it rings.  An advanced degree is not necessary to make an intelligent, worthwhile, important point(s).  That is not what I’m saying.  But the “scientific community” to whom you refer is going to respect one thing:  Data-driven discussion.  Period.  And, paramount in trying to piece together what the Shroud may or may not be, the variables that might be involved cannot be oversimplified or underestimated-look closely at many of the discussions and “proper assessments” that take place and determine if this applies.\n\n","date":"February 16, 2014 at 8:39 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79780","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Oh I couldn’t agree more. Experts! But actually I don’t refer to a ‘scientific community,’ because I don’t think there is one. I sometimes refer to ‘scientific consensus,’ but even there we must be careful. “Most scientists think…..” is often a very subjective judgement based on ones own research partners and a quick flick through Google. This is where a forum like this is so important. A senior academic and Editor-in-Chief of a respected journal might well be regarded as an expert, while a middle school science teacher might not. However, if the science teacher can demonstrate the invalidity of the academic’s work, then the tables turn.\nReal experts, in this context, are essentially compendia of experiences and resources, which they can use to demonstrate the value of their opinion. If they don’t do that, but rely on their authority alone, then their opinion is no more valid than anybody else’s.\nYou’re right that “properly assessed” was rather an imprecise term. “Universally assessed” might have been better. Some will go for the “he’s a famous scientist so he must be right” angle, some for the “he disagrees with me so he must be wrong” angle (both held by several commenters here), and a few who will look more carefully at the data and references. Eventually, I trust, the truth will out.\n\n","date":"February 16, 2014 at 9:15 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79788","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"I agree with you Hugh. Does it take an expert to deduce that if there was an earthquake of the magnitude suggested – then the collateral damage would have been equally as massive and this would have been recorded beyond the pages of the gospel.\nCertainly we need the folks with phd’s when we get into the nitty gritty areas. But for many of the more esoteric ideas merely vetting them on the internet is enough to find the holes. In that sense each of us is capable of ‘peer reviewing’ many of these ideas.\n\n","date":"February 16, 2014 at 9:37 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79791","author":"David Goulet","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Judging the reporting I have read on  any subject, most of them stand condemned by this writer.\n\n","date":"February 16, 2014 at 10:10 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79795","author":"Andy","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Joel Achenbach writes in an interesting way, but he is not a Carl Bernstein nor a Norman Finkelstein, he did not go deep enough and was even badly informed about the journal.\nHe instinctively thought that a Shroud article would be “crap”, then went against his instinct and drew attention to the journal’s paper. What would he have said if he had read some of the material posted on Shroud websites or published in Shroud publications?\nLook what he said:\n“We don’t publish everything we hear. We filter. We curate….. to create a reputation for accuracy, fairness, relevance and this requires the willingness to not publish things that are unlikely to be true.”\nIf it were not for Dan’s Shroudstory….\n\n","date":"February 16, 2014 at 12:00 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79816","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"\nHugh Farey :\nOh I couldn’t agree more. Experts! But actually I don’t refer to a ‘scientific community,’ because I don’t think there is one. I sometimes refer to ‘scientific consensus,’ but even there\nwe must be careful. “Most scientists think…..” is often a very subjective judgement based on ones own research partners and a quick flick through Google. This is where a forum like this is so important. A senior academic and Editor-in-Chief of a respected journal might well be regarded as an expert, while a middle school science teacher might not. However, if the science teacher can demonstrate the invalidity of the academic’s work, then the tables turn.\nReal experts, in this context, are essentially compendia of experiences and resources, which they can use to demonstrate the value of their opinion. If they don’t do that, but rely on their authority alone, then their opinion is no more valid than anybody else’s.\nYou’re right that “properly assessed” was rather an imprecise term. “Universally assessed” might have been better. Some will go for the “he’s a famous scientist so he must be right” angle, some for the “he disagrees with me so he must be wrong” angle (both held by several commenters here), and a few who will look more carefully at the data and references. Eventually, I trust, the truth will out.\n\n“Properly”, ah yes that was the kicker…\nBeing a famous or a respected scientist carries a certain amount of clout for certain, but if the data sucks, it sucks.  Typically one’s competitors will make sure everyone is aware of this and will come bearing elephant guns.\nA middle school science teacher demonstrating the invalidity of an academic’s work-sure, it can happen, but I do think you have to be careful that it’s not just slaps on the back from those in your group-there is a significant difference between posting on a blog and putting an idea in the professional arena.  Not a put down-If the science is sound, the truth as you say will out. \n A personal question, if you don’t mind me asking-what exactly is your own background, were you ever involved in any type of independent research, before becoming a science head (at a preparatory school, I believe)?  Start to work on a graduate degree at some point?  If so, what area(s) did you work on?  Have you ever published in a science journal on your work?  This is by no means a call-out, I am just interested.  Also, what first got you interested in science, as a wee lad, I presume?\n\n","date":"February 16, 2014 at 3:46 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79840","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"\nDavid Goulet :\nI agree with you Hugh. Does it take an expert to deduce that if there was an earthquake of the magnitude suggested – then the collateral damage would have been equally as\nmassive and this would have been recorded beyond the pages of the gospel.\nCertainly we need the folks with phd’s when we get into the nitty gritty areas. But for many of the more esoteric ideas merely vetting them on the internet is enough to find the holes. In that sense each of us is capable of ‘peer reviewing’ many of these ideas.\n\nFor certain of these ideas, anyone capable of grasping the correct end of a toothbrush is more than capable or ‘peer review’ or evaluation.  I agree.  Where I mainly take issue is when it sounds as though all of the scientists who make their living at it, don’t really know what they are doing, and need to be straightened out by a “real expert”.  This is especially the case in relation to STURP, that they couldn’t get anything right.  The opposite is true-they don’t get enough credit; their efforts are far too unappreciated-much of what is discussed here daily wouldn’t be the case without their work.  Repeatedly tossing the same issue(s) under the bus with discussion is not equivalent to hard, bench top science.  That’s the point I was trying to make, if you want the science to get real, design a set of experiments to support/disprove your points, expand on your own ideas rather than mere (repeated) finger pointing.\n“Into the nitty gritty”…jumped so high, jumped so high…folks with PhDs-the NGDB, has a certain ring to it\n\n","date":"February 16, 2014 at 5:31 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79861","author":"Kelly kearse","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Yes. I think it’s important to distinguish between simply disagreeing with a published paper and refuting it. That’s why I have been very specific in my disagreements with Carpinteri and others, and not only quoted exactly where they have gone wrong, but enabled anybody else to check my refutation. I have rarely found the STURP scientists wrong, but from time to time their evidence is contradictory, and I have wished they could be consulted in order to disentangle the confusion. Incidentally, on this blog at least, it is not the STURP team but the radiocarbon scientists who come in for the greatest obloquy.\n\n","date":"February 16, 2014 at 7:45 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79886","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Didn’t the Roman historian Tacitus say that an earthquake occurred(along with worldwide darkness) in what we would today call 33 AD? I’m not saying that an earthquake caused the image on the Shroud(that seems absurd), but there are extra Biblical reports of seismic activity(as well as an eclipse) in April of the year 33.\n\n","date":"February 16, 2014 at 6:00 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79867","author":"Chesterbelloc","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"In a word, no he didn’t. And no there aren’t.\n\n","date":"February 16, 2014 at 7:34 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79883","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"In an official document available online the Israel Ministry of Foreign Affairs says something about steps that were taken to protect the Church of the Holy Sepulchre “against another tremor.”:\nhttp://www.mfa.gov.il/mfa/mfa-archive/1999/pages/the%20tomb%20of%20christ.aspx\n\n","date":"February 16, 2014 at 6:16 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79873","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Jerusalem frequently suffers tremors. I don’t think the reference above implies one in 33 AD.\n\n","date":"February 16, 2014 at 7:36 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79884","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"The intention to post the link was exactly to draw attention to the fact of tremors occurring in Jerusalem, not to the NT data, which I find credible.\n\n","date":"February 16, 2014 at 7:44 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79885","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Fair enough. Have you looked at Jeff Williams’s deadseaquake.info? That’s very interesting.\n\n","date":"February 16, 2014 at 7:49 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79888","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"There is no sufficient data in the link and the crack that is shown in the region is surrounded by myth, making matters even worse.\n\n","date":"February 16, 2014 at 8:45 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79894","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Kelly wrote:\nFebruary 16, 2014 at 3:46 pm | #10 Reply | Quote\nHugh Farey :\nOh I couldn’t agree more. Experts! But actually I don’t refer to a ‘scientific community,’ because I don’t think there is one. I sometimes refer to ‘scientific consensus,’ but even there\nwe must be careful. “Most scientists think…..” is often a very subjective judgement based on ones own research partners and a quick flick through Google. This is where a forum like this is so important. A senior academic and Editor-in-Chief of a respected journal might well be regarded as an expert, while a middle school science teacher might not. However, if the science teacher can demonstrate the invalidity of the academic’s work, then the tables turn.\nReal experts, in this context, are essentially compendia of experiences and resources, which they can use to demonstrate the value of their opinion. If they don’t do that, but rely on their authority alone, then their opinion is no more valid than anybody else’s.\nYou’re right that “properly assessed” was rather an imprecise term. “Universally assessed” might have been better. Some will go for the “he’s a famous scientist so he must be right” angle, some for the “he disagrees with me so he must be wrong” angle (both held by several commenters here), and a few who will look more carefully at the data and references. Eventually, I trust, the truth will out.\n“Properly”, ah yes that was the kicker…\nBeing a famous or a respected scientist carries a certain amount of clout for certain, but if the data sucks, it sucks. Typically one’s competitors will make sure everyone is aware of this and will come bearing elephant guns.\nA middle school science teacher demonstrating the invalidity of an academic’s work-sure, it can happen, but I do think you have to be careful that it’s not just slaps on the back from those in your group-there is a significant difference between posting on a blog and putting an idea in the professional arena. Not a put down-If the science is sound, the truth as you say will out.\nA personal question, if you don’t mind me asking-what exactly is your own background, were you ever involved in any type of independent research, before becoming a science head (at a preparatory school, I believe)? Start to work on a graduate degree at some point? If so, what area(s) did you work on? Have you ever published in a science journal on your work? This is by no means a call-out, I am just interested. Also, what first got you interested in science, as a wee lad, I presume?\nKelly kearse\nFebruary 16, 2014 at 5:31 pm | #11 Reply | Quote\nKelly, the back slaps in the group is also what is referred to in #9, even Max seems to have noticed it.\n\n","date":"February 16, 2014 at 7:52 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79889","author":"Louis","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Could we carbon date Joel’s hair, it looks circa 1992.\n\n","date":"February 17, 2014 at 3:34 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79966","author":"Matthias","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Joel A: “Never mind that, as far as I know, seismologists do not use the term “Richter scale” anymore.” \nThis empirical logarithmic scale was devised by Charles Richter in 1935, for the purpose of standardising and comparing earthquake intensities. It is calculated from the amplitude of the movement of seismographs and then standardised to a distance of 100km from the estimated epicentre. Yes there are other more sophisticated measures in use, more difficult and time consuming to calculate, but in theory they should yield pretty much more or less the same results. Shallow earthquakes will be felt to be more significant in their effects than deep earthquakes of the same intensity.  The intensity needs to be distinguished from the Modified Mercalli scale which gives a subjective measure of the effects of an earthquake at various places.  The intensity is an absolute measure of the earthquake, the Mercalli attenuates with distance from the epicentre. \nA quick Google on “Earthquakes in Israel” shows that it is moderately seismically active. In 2013 there were several shocks of around 3.5, In 1927 there was a 6.2 which killed 500, injured 700; and in 1837 an earthquake left 7000 dead.  The effects of an earthquake event will depend a lot on how well buildings and structures have been engineered against earthquake. There are various techniques commonly used, such as ensuring components are tied together, spiral reinforcing of columns, base isolation in foundations, and other standard techniques. The design philophy is usually to ensure the structure can survive a moderate earthquake, and in a severe earthquake will fail in a safe and controlled manner.  These techniques are commonly used in Japan, California and New Zealand, where earthquakes are most significant and there is a heightened awareness of their effects. In locations of only moderate seismicity, damage may be more severe, as there is often less awareness of what can be done, and sesimic design does not receive the same attention. \nThere are several problems with the Carpenteri et al paper published in Meccanica.  One is that the authors for some unknown reason have focused on the year 33AD, when they might have looked more closely at the year 30AD, possibly a more credible date for\nthe crucifixion. Most informed students of the Shroud are unlikely to accept the proposition that the crucifixion / resurrection earthquakes affected the 1988 radiactive carbon dating results.  It has never arisen with the dating of any other artifact, no less likely to have been so affected.  \nPersonally I can accept the possibility that sesimicity may have had a bearing on the formation of the Shroud image, for reasons I have given elsewhere.  But this is not to say that the image formation mechanism is as outlined by the authors. It is credible that the high energies involved in earthquakes may have released neutrons. But we have yet to see replication of images so formed.  The images produced by De Liso apparently required the release of radon gas, which produces gamma radiation, not neutrons. There were other necessary components as well including concurrent variations in the geo-magnetic and electric fields. \nWith all the talk and theories of image formation, there has been a sad lack of attempts at persuasive experiments to produce images on linen cloth from cadavers, or even from time-expired laboratory test animals.  The best De Liso could come up with was a dead snake and a metallic key.  A more concerted effort is required if the various theories are ever to be brought to any kind of conclusion.  \nScriptural references to the crucifixion / resurrection earthquakes:  Matt 27:51 (crucifixion), 28:2 (resurrection) (specific); Mk 15:38 is suggestive (veil of temple torn in two); Luke 21:45 (likewise); John does not refer to darkness nor earthquake.\n\n","date":"February 17, 2014 at 6:58 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-79994","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"\nHugh Farey :\nYes. I think it’s important to distinguish between simply disagreeing with a published paper and refuting it. That’s why I have been very specific in my disagreements with\nCarpinteri and others, and not only quoted exactly where they have gone wrong, but enabled anybody else to check my refutation. I have rarely found the STURP scientists wrong, but from time to time their evidence is contradictory, and I have wished they could be consulted in order to disentangle the confusion. Incidentally, on this blog at least, it is not the STURP team but the radiocarbon scientists who come in for the greatest obloquy.\n\nMaybe, but I think it tends to be a flavor of the month-I had to look up obloquy by the way.\n“I have rarely found the STURP scientists wrong”. That covers a lot of territory!  Would take an Expertus Maximus.  I’m still on page 2.  Maybe we could catch up some time and you can bring me up to speed over a cold pint…\nBTW, when I asked about your background I was being sincere, it was intended, in fact, to be complimentary in nature-I just wanted to know a little bit more about you, particularly in regard to where your specific area(a) of interest lie.  That’s all-wasn’t a “bait”, sans acrimony, I assure you.\nWhen I first heard about the carbon dating news-I wasn’t even aware they were doing it-was thumbing through the latest copy of Nature: “Turin Shroud a Fake!”  I was disappointed, not because of the dating results-I could have cared less about them to be honest, I was hoping there would be some news regarding the specifics of how it was faked.\n\n","date":"February 17, 2014 at 9:54 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-80036","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"\nHugh Farey :\nYes. I think it’s important to distinguish between simply disagreeing with a published paper and refuting it. That’s why I have been very specific in my disagreements with Carpinteri and others, and not only quoted exactly where they have gone wrong, but enabled anybody else to check my refutation.\n\nI think you might be overselling here-good points about the documentation of quakes, a reference regarding if piezonuclear is a reality-yes, yes. \nIf you’re talking about the arguments that other local artifacts in the area would have been affected, and this nailed it-the one regarding the bones & items in a cave is circular, unless there’s an independent reference point.  The arguments about the DSS and JTB are anecdotal.  Far too many unknown variables here, only takes one or two to add a potential monkey wrench into such a comparison.  Scientifically, you would have to split the artifacts into at least two, place them in & outside of caves, in & out of the quake zone, and compare after the big one hit.  There’s also the matter of variable distance(s) from radiation source, quake shake, etc. in any type of comparison.  Too many unknowns, too many variables-it’s reasonable, yes, but its strength ends there if you want to call it scientific (with a capitol S).  Just my thoughts, they’re rhetorical, no need to answer.\nI’ll let the Meccanica paper in question speak for itself-I think it already has-I’m only mentioning the above because I think (too often) these types of arguments/counter arguments are used as proof, with the lack of applying a scientific matrix of experimentation/empirical data to the question.  Even if it is water under the bridge.\n\n","date":"February 17, 2014 at 11:31 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-80052","author":"Kelly Kearse","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"Oh, yes, time moved on and I forgot your earlier post. I can’t remember when I first became interested in Science. My father was involved in guided-missile guidance systems with the Royal Navy and his brother was a science teacher, so maybe it’s genetic. However I was never a professional researcher and have never published anything in a science journal. Being a teacher of general science for 40 years has given me an interest in, and a certain experience of, just about every aspect of the subject, and since I took my degree in the old days of the Open University, when it took six years, I could pick and choose any topics I found interesting, including Geology, Oceanography, Physiological Psychology, Evolution, Ecology and various more general ones like Biology, Technology and Organic Chemistry. My final year was spent on biological statistics! I’ve also taught History and have a passion for emphasising primary sources – I think that may be part of my scientific make-up as well.\nI have, I think, practically all the STURP papers, and, which appears almost unheard of, I’ve read them. There are some surprising errors (Bill Mottern’s X-ray team thought the Holland backing cloth was made of cotton, for example), but on the whole they are a model of scientific diffidence, and clearly say where their conclusions were tentative and where further investigation should be encouraged. There is no doubt that Rogers’s much later surface contamination hypothesis is distinctly at variance with earlier findings, and leads to contradictory conclusions in some cases, that the blood spectra are far from definitive and that the whole cotton business is a muddle, but that’s all part of the fun.\nAnd as for the pollen….\nObloquy… good word, isn’t it!\n\n","date":"February 17, 2014 at 11:38 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-80055","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"\nHugh Farey :\nIn a word, no he didn’t. And no there aren’t.\n\nJim Bishop mentions it in his book THE DAY CHRIST DIED. I guess that anyone who actually believes that some of the events of the Bible are true are untrustworthy, or biased. At least that’s the impression I get from a lot of the folks on this blog.\n\n","date":"February 17, 2014 at 11:47 am","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-80057","author":"Chesterbelloc","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"No no, please don’t think that. Just because there’s no external evidence for some bit of biblical history doesn’t mean it didn’t happen. Perhaps there was some form of earth tremor around the time Jesus died and no one can deny it. What we can deny is that many people noticed it, or that it caused the destruction of Jerusalem, or substantial enrichment of the C14 content of the clothes of its populace.\n\n","date":"February 17, 2014 at 1:44 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-80080","author":"Hugh Farey","site":"shroudstory"},{"title":"The Shroud of Turin story brings up all the usual issues about click-bait journalism","post":"\nHugh Farey :\nOh, yes, time moved on and I forgot your earlier post. I can’t remember when I first became interested in Science. My father was involved in guided-missile guidance systems with the Royal Navy and his brother was a science teacher, so maybe it’s genetic. However I was never a professional researcher and have never published anything in a science journal. Being a teacher of general science for 40 years has given me an interest in, and a certain experience of, just about every aspect of the subject, and since I took my degree in the old days of the Open University, when it took six years, I could pick and choose any topics I found interesting, including Geology, Oceanography, Physiological Psychology, Evolution, Ecology and various more general ones like Biology, Technology and Organic Chemistry. My final year was spent on biological statistics! I’ve also taught History and have a passion for emphasising primary sources – I think that may be part of my scientific make-up as well.\nI have, I think, practically all the STURP papers, and, which appears almost unheard of, I’ve read them. There are some surprising errors (Bill Mottern’s X-ray team thought the Holland backing cloth was made of cotton, for example), but on the whole they are a model of scientific diffidence, and clearly say where their conclusions were tentative and where further investigation should be encouraged. There is no doubt that Rogers’s much later surface contamination hypothesis is distinctly at variance with earlier findings, and leads to contradictory conclusions in some cases, that the blood spectra are far from definitive and that the whole cotton business is a muddle, but that’s all part of the fun.\nAnd as for the pollen….\nObloquy… good word, isn’t it!\n\nHugh,\nThanks-enjoyed reading this.\n\n","date":"February 17, 2014 at 4:52 pm","url":"https://shroudstory.com/2014/02/16/the-shroud-of-turin-story-brings-up-all-the-usual-issues-about-click-bait-journalism/","cat":"press_coverage","id":"comment-80119","author":"Kelly Kearse","site":"shroudstory"}]
