[{"author":"bippy123","post":"Just saw the article Stephen, thanks a bunch :)Hopefully this will get indexed quick by google so that other researchers could also get this out there.The more people that know this the better.Forgive me for the typos, arghhh, it's the i Pod again God bless.","date":"2012-02-12","mins":"6:07 AM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"author":"bippy123","post":"Ok Schwartz maybe a good sturp photographer but I don't agree with him on ancient blood turning ab. I can't really post links since I'm on my i Pod but tested king tuts blood from his tomb and it tested type ab. If you want to come up with the excuse that the blood was preserved through the mummification process you can also make the case for the shroud because they found the blood on the shroud perfectly preserved probably from the aloe, myrr and other ingredients that were found on the shroud.The info on this took me a few hours but thanks to my extreme scrupulosity I finally found it. This debunks the theory that all blood degrades to type ab.","date":"2012-02-07","mins":"6:35 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"author":"bippy123","post":"Stephen as I said yesterday I am on my i Pod and my bad luck tonight is that I am still on my i Pod and unable to get to a pc to copy and paste the info.It's frustrating though.Try doing a search for king tut's blood type.I think you will find some interesting info as we both know tut is older than 2000 years. It's times like these I wished I had a laptop.In my former post I posted that tut had type ab, what I meant to say was type a2 which is definitely different than ab. Can anyone verify this about tut before I get to a desktop pc?.","date":"2012-02-09","mins":"4:23 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"},{"author":"bippy123","post":"No prob Stephen, as we are nothing looking honestly for the truth here. If it wasn't for this blog I also would not have known this myself. It's incredible how my extreme scrupulosity lead me to the shroud of Turin.You have a great blog Sir God bless.","date":"2012-02-11","mins":"2:41 PM","url":"http://theshroudofturin.blogspot.com/2011/03/re-shroud-blood-types-as-ab-aged-blood.html","title":"\nRe: Shroud blood ... types as AB ... aged blood always types as AB, so the significance of this ... is unclear\n"}]
