[{"author":"bippy123","post":"My guess is that hugh thinks that these very intelligent people who believe in the shrouds authenticity are obviously delusional because hugh farey thinks its a 14th century forgery mistake lol.I bet hugh also things the congruent points between the shroud and sudarium were also a mistake or that the sudarium's history is a lie ;)But then again making false accusations against Stephen claiming what he said against Catholics was also proven by Stephen to be untrue.Hugh actually u didn't cause much excitement to me. I've come to expect these things from u as completely normal behavior Best wishes to you also ;)For the record , I'm just a peasant who believes in the authenticity of the shroud .Bippy.","date":"2015-02-24","mins":"7:21 PM","url":"http://theshroudofturin.blogspot.com/2015/02/locations-of-shroud-turin-shroud.html","title":"\nLocations of the Shroud: Lirey c.1355 - Chambéry 1471: Turin Shroud Encyclopedia \n"},{"author":"bippy123","post":"Stephen don't forget the sturp physicist John Jackson performed a raking test on the shroud and found the folding creases that match a tetradipion. I can't post the links because for some reason I can't copy and paste on here from my i Pod , but this is even more evidence in favor of it.Great article again God bless Bippy123.","date":"2012-09-16","mins":"2:37 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"},{"author":"bippy123","post":"Stephen, thank you again for adding John Jacksons raking finds. You've done an incredible job of adding all the bread crumb evidence together. Have a few friends that have been debating the shroud and I'm going to lead them to your post here. They are really excited about this connection here.God bless.","date":"2012-09-18","mins":"4:09 PM","url":"http://theshroudofturin.blogspot.com/2012/09/tetradiplon-and-shroud-of-turin.html","title":"\nTetradiplon and the Shroud of Turin\n"}]
