[{"author":"bippy123","post":"Stephen, nice find and a very accurate portrayal of Freeman's review.It looks like Freeman is tailoring his review of Wesselow's book to complete newbies.Why is it when Atheists like Freeman ask for evidence and get it that completely ignore the scientific evidence and turn all pseudo scientific on us. I truely believe that they must reject the shroud at all costs because of the strong evidence for authenticity.Even when googling about the shroud I couldn't believe all of the nonsensical information on the skeptical websites I have seen. Back in 2009 I was totally ignorant of the shroud and thought it was just some relic. Ironically it was the atheist funded and failed replication of the shroud , and all of the hoopla that surrounded it worldwide that got me to take a deeper look into it.Thank God for websites such as yours that actually study the relevant info pertaining to the shroud.Do you have a donate page ?I think that would be a great idea to help this website grow God bless Bippy.","date":"2012-07-08","mins":"7:54 PM","url":"http://theshroudofturin.blogspot.com/2012/07/my-critique-of-charles-freemans-turin.html","title":"\nMy critique of Charles Freeman's \"The Turin Shroud and the Image of Edessa: A Misguided Journey,\" part 1: \"Introduction\"\n"},{"author":"bippy123","post":"\"\">As long as you don't think that the Catholic Church's 'dishonesty' is Satanically inspired I can live with that. \"\"That is surely one of the most bizarre posts I have seen .Stephen never alluded to anything such as this. What I can't understand is why even allude to this ?I'm a Catholic myself Hugh and I see in Stephen someone who is passionately pursuing the truth, and he isn't the only one that is persuaded by the evidence for the shroud's authenticity. I am also, but there are also some that desperately want the shroud to be a forgery. I have encountered them not only in evangelical circles but in Catholic circles as will and it seems.that they are motivates by emotions then the evidences .I never knew about the shroud until 2009 and I found out about it from atheists of all people. Oh the irony.","date":"2014-10-31","mins":"3:08 PM","url":"http://theshroudofturin.blogspot.com/2014/10/my-critique-of-charles-freemans-claim.html","title":"\nMy critique of Charles Freeman's claim that the Turin Shroud was made for a medieval Easter ritual\n"},{"author":"bippy123","post":"Stephen, good points. I really think what we have here are 2 possibilities .1. They have a very liberal theology kind of stance towards the supernatural or 2. They are afraid of being embarrassed in front of their materialistically leaning colleagues .It's clear that something emotional is motivating this anti authenticity or anti super naturalism bias of theirs.Hughes slandering posts and then his inability to back them up just smacks of hidden intentions and diversionary tactics.I usually see these tactics by pseudo skeptics not from believers..","date":"2014-11-03","mins":"4:26 PM","url":"http://theshroudofturin.blogspot.com/2014/10/my-critique-of-charles-freemans-claim.html","title":"\nMy critique of Charles Freeman's claim that the Turin Shroud was made for a medieval Easter ritual\n"},{"author":"bippy123","post":"\"'And in fact Chevalier's intellectual dishonesty regarding the Shroud, was much worse than that. He forged a crucial heading to Bishop Pierre d'Arcis 1389 Memorandum that wasn't there. Read Markwardt, J., 2001, \"The Conspiracy Against the Shroud,\" BSTS Newsletter, No. 55, June 2002).Fr Herbert Thurston (1856–1939) was another Roman Catholic leading opponent of the Shroud, although Wikipedia doesn't say much about that:\"'Wow thanks Stephen for these 2 examples .I knew there were some Catholics that were against the shroud but I never knew the extent that they went to to try to discredit it.One more question Stephen. Have you ever done a blog post on the fire in 1997 that almost destroyed the shroud.was there any information gleaned by the local turin authorities as to who was involved in that arson?Thanks and God bless.","date":"2014-11-03","mins":"4:41 PM","url":"http://theshroudofturin.blogspot.com/2014/10/my-critique-of-charles-freemans-claim.html","title":"\nMy critique of Charles Freeman's claim that the Turin Shroud was made for a medieval Easter ritual\n"},{"author":"bippy123","post":"Great Post again Stephen. My guess is that this medieval easter ritual theory is being acclaimed highly by people like hugh Farey who just want the shroud to be a fake, despite all the evidence to the contrary.I was recently going through some old posts there and I happened to come across an old post by Yannick Clement and he theorizes that because God made himself known in a very subtle way twice to Yannick that the shroud couldn't be authentic because God couldn't have made his presence known in such a powerful and obvious way, and only makes himself known to everyone in the same exact way he did for Yannick.This is ridiculous because Christ made himself known in a very powerful way when he appeared post resurrection to his disciples and 500 people.I can understand why freeman and his ilk would want the shroud to be fake to the point of ignoring other strong evidences for its authenticity but people like farey and others totally confuse me.Its like there is a hidden bias already in there apriori before they even look at the evidences.as for thisalanborky\"Whether or not any o' this's true what amazes me's how readily an' unquestioningly many members o' both sides o' the argument rush t' embrace an' promote any \"intense and sometimes absurd speculation\" which claims t'confirm their preciously held beliefs.\"\"\"It took me 2 years to even consider having an opinion on the shroud, and when I first studied it I made myself only visit anti authenticist shroud sites to make sure I wasn't wasting my time researching the shroud. So no, not all people on both sides embrace any theory as true.Im sure it took Stephen jones even longer to come to a conclusion on the shroud, not without much research and contemplation..","date":"2014-10-30","mins":"7:16 AM","url":"http://theshroudofturin.blogspot.com/2014/10/my-critique-of-charles-freemans-claim.html","title":"\nMy critique of Charles Freeman's claim that the Turin Shroud was made for a medieval Easter ritual\n"},{"author":"bippy123","post":"Brilliant article Stephen, and it shows that the shroud was documented to be here 171 years before the earliest 1260 ad date of the c14 tests.The majority of evidence points to the shroud's authenticity and it being much older then the 1988 tests and even Mitch older then the 11th century documentation you have shown in this article.Any honest seeker or researcher has to concede this when going through the maintains software evidences for the shroud's authenticity .What I find remarkable is that there are a few Christians on Dan's blog (not gonna name names ) that believe in the shroud's authenticity yet somehow believe that the image was created by some naturalistic method, even though every naturalistic effort used to try to replicate the shroud has failed.I was wondering what you thought of doctor August Accetta's work with the gamma rays in trying to replicate some of the unique features of the shroud ?I believe he converted from agnosticism to Christianity after his research on the shroud ..","date":"2014-05-08","mins":"6:17 PM","url":"http://theshroudofturin.blogspot.com/2014/05/the-letter-from-alexius-comnenus-my.html","title":"\n\"The Letter from Alexius Comnenus\": My response to Dan Porter\n"},{"author":"bippy123","post":"Hello Stephen, it looks like Joseph Accetta has hugh Farey fever. Not to be confused with August Accetta, STURP team member Joseph Accetta is presenting a possible 14th century explanation for that image and he's speculating that the image is made from a contact process. It looks like we are officially in the twilight zone lol. Another hugh Farey clone is ignoring the mountain of evidencefir an older date yet again. Is Joseph Accetta an atheist , agnostic or Christian. I haven't been able to find much on his worldview , but he will be presentimg this at the shroud conference in St. Louis .Where are they getting these kooky theories from?Colin berry who ridiculed sturp so many times is suddenly pro Accetta. Why doesn't that surprise me.http://www.stlouisshroudconference.com/program/speculations on the 14th century origins of the turin shroud Presentation SPECULATIONS ON THE 14 TH CENTURY ORIGINS OF THE TURIN SHROUD10 Oct 201411:15 11:45 am Authors Joseph Accetta, Ph.D. Presenter Abstract:This paper is based on the assumption that the Shroud is of 14th century origins consistent with its radiocarbon date and thus must be explained within the technology and historical context of that era. Avoiding the controversy surrounding the date, the author presents a plausibility argument to reconcile its visual and forensic properties with extent 14th century printing technology, geographical circumstance and historical context. The observed 3 d properties of the image are discussed in relationship to physical image formation processes and a plausible explanation for this extraordinary effect is given based printing techniques known to exist at that time and in that locale. Further the argument is reinforced with analytical results showing that under any reasonable assumption about the surface bi directional reflectance distribution function (BRDF) including the use of measured human skin data, the observed 3 d properties cannot be reconciled with any known radiative imaging process and thus must be a contact process.I really wanted to attend the conference. Now I thank the good lord above that I couldn't make it.Bippy123.","date":"2014-08-31","mins":"4:56 PM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n"},{"author":"bippy123","post":"\"\"Let's hope he is corrected in the Q&A session after his presentation by someone at the Conference. In days past, when pro authenticists Ian Wilson and Mark Guscin edited the BSTS Newsletter, any such corrections would have been reported in it.But now the anti authenticist Hugh Farey, who believes that the Shroud was a 14th century accident, any such correction probably won't be reported in the BSTN.\"\"Now I truly understand the urgency of why you objected to Hugh Farey being made editor of the BSTS more then ever.I am wondering who voted him in and what process they used to do this?I would be shocked if anyone didn't correct him In the Q & A because there is simply a mountain of evidence to do this with, but my point is couldn't this presentation have been replaced with something a little more plausible and interesting. It feels like this guy is taking us back to the 1970's for heaven's sake.\"\"While he is not a scientist, I came across an online paper by Dan Porter where he admits that he regards (or at least did in 2001), \"the Resurrection\" as \"a metaphor\":\"\"This is amazing, which explains why he gives so much leeway to atheists and skeptics like Collin berry and is harder on pro authenticists and believers like you and a few others. I wonder why Dan just doesn't save us all the trouble and put this information in bold letters on his site if he was honest enough to warn newbies who are about to enter the proverbial dragons lair.\"\"Why \"thank the good lord above\"? Presumably there are going to be other papers at the St. Louis Shroud Conference 2014 which take account of ALL the available evidence, than Joseph Acetta's, which simply IGNORES that evidence?\"\"You make a very reasonable Point Stephen, there are actually going to be a lot of good presentations. I hope I can get an opportunity to somehow make it but it looks slim right now as I am battling some kind of health issues, I wont know more until the labwork is all done. Ive been having all over the body itching for the last 8 months and some hip and finger discomfort. It could be from the stress of my dad passing, don't know for sure.I hope everything is better with your wife Stephen. I have her and you in my daily prayers.God bless Bippy123.","date":"2014-09-02","mins":"2:55 AM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n"},{"author":"bippy123","post":"\"\"Thanks. She had the `flu recently and it stopped her taking her first steps, until I had helped her start walking. Any raising of her temperature exacerbates her MS, which is the nerves having damaged myelin `insulation' which weakens the nerves' signals to the muscles.\"\"Aww , I pray that she is over the flu. Im praying so hard for the both of you. If I ever get married I hope my marriage is as strong as your Stephen. The way you care for each other is very Christ like :)I Just came back from my doctors appointment and she wants to test me for Cancer and other things. Hopefully all will turn out fine.Stephen, Thank God for this Blog and for you as you are relentless in your pursuit of truth and not double sided like a few we will not name.God bless you my friend Bippy123.","date":"2014-09-04","mins":"12:31 PM","url":"http://theshroudofturin.blogspot.com/2014/08/crispino-dorothy-1916-2014-turin-shroud.html","title":"\nCrispino, Dorothy (1916-2014): Turin Shroud Encyclopedia\n"},{"author":"bippy123","post":"Hey Stephen thanks for the link and article my friend.I had a hunch that there was a reason for this TV showing of the shroud but I had no idea it would potentially be this big.I wonder how the skeptics are going to spin their way out if this. It's great also that its being submitted for peer review.The news just keeps better and better for us and worse for shroud skeptics. :).","date":"2013-03-29","mins":"10:38 AM","url":"http://theshroudofturin.blogspot.com/2013/03/new-experiments-on-shroud-show-its-not.html","title":"\nNew experiments on Shroud show it's not medieval\n"}]
