[{"id":"comment-205629","author":"simon_brown","post":"If anyone can prove the Shroud is a fake? then they will be more famous than Jesus..","date":"2015-07-14","mins":"6:31 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"id":"comment-205682","author":"simon_brown","post":"[removed by moderator].","date":"2015-07-14","mins":"1:00 pm","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"id":"comment-205659","author":"simon_brown","post":"100’s of the BEST scientists on the planet have already proved the Shroud is the same cloth as told in the gospel of John 19 – 20. Please read the 100’s of peer reviewed, scientific, facts, papers and evidence proving the visible and physical evidences of the crucifixion, death, and the ultimate Resurrection of Jesus (Yeshua) meaning Salvation. Researched by the best researchers, experts and scientists in the world, proving the facts of God’s love for ALL humans, by sending Jesus who suffered severe pain and punishment by being whipped and nailed to a cross. NOT to condemn us. NO. But to save us. ALL HERE http://wwwrealdiscoveriesorg simon.blogspot.co.uk/2015/02/read 100s of peer reviewed scientific.html.","date":"2015-07-14","mins":"10:52 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"},{"id":"comment-205628","author":"simon_brown","post":"Our Almighty God did not create a 3 D image of Jesus revealing the most important time in world history for ALL to SEE, for no REASON. If we read John 3:16 we truly understand why God preserved a 3 D image of Jesus. For God so loved the world, that he gave his only begotten Son, that whosoever believeth in him should not perish, but have everlasting life. The Lord is not slack concerning his promise, as some men count slackness; but is longsuffering to us ward, not willing that any should perish, but that all should come to repentance. 2 Peter 3:9. King James Bible What more evidence do we need to believe, repent, FOLLOW Jesus and be SAVED?.","date":"2015-07-14","mins":"6:26 am","url":"https://shroudstory.com/2015/07/14/does-it-matter-if-the-shroud-is-a-fake/","cat":"presentation","title":"Does it Matter if the Shroud is a Fake?"}]
