[{"title":"How long before the grey scales fall from people’s eyes, and the Shroud image accepted as a thermal imprint (“scorch”)??","post":"One “Olowkow” on the Randi forum, following a tip from Hugh Farey, has visited this site, and offered the following comment early this morning:\n“I must add that you might want to soft pedal the picture of the enhanced green face on the shroud on the upper left in your website. If you believe that it has any significance at all, you missed my post a few years months back of Frank Zappa using the same “3D” effect. It’s bogus. Always has been, always will be. It merely reveals the unscientific nature of this quest.”\nhttp://forums.randi.org/showthread.php?postid=9417590#post9417590\nThat was a reference, needless to say, to the banner that appears above all my postings, referring to the ghostly green “processed” TS face in the top left hand corner.\nSorry, Olowkow, but you have spectacularly missed the point. What I intended to convey, admittedly without cluttering captions, is that the so-called encoded 3D properties of the TS are not uniquely mysterious, as STILL claimed by Shroudies on a regular basis. They can be reproduced very simply and quickly simply by pressing a heated bas-relief template, like my Ghana trinket (second from left) into linen to produce a scorch, and then doing a light/dark inversion, as per Secondo Pia, followed finally by 3D enhancement in any computer program that reads image density as height above a reference plane (I used ImageJ, freely downloadable). So where 3D enhancement is concerned it’s a case of “move on folks, nothing to see here”. Much the same might be said for the welter  of mystery-promoting (pseudo)science that is promoted elsewhere, mainly on U$-based sites, where the $hroud of Turin is still Big Bu$ine$$. \nI see that the incorrigible fellow Brit David Ro£fe is now taking another bite at the apple, hoping no doubt to make another killing to match the one he got for starting all the overblown mystery-promoting hype with that Si£ent Witness film. He’s now sunk to the level of promoting a daft conspiracy theory involving not just one Pope,  but two.The man is an embarrassment.\nPS. My admiration for the peerless Hugh Farey grows by the hour, viewing his most recent postings on two quite different sites, yet maintaining the same “voice” on both. I’m not jealous – just pleased that I gave him a slot here, on this site, some months ago, feeling his focused, laser-beam approach was exactly what the doctor ordered where Shroudology is concerned. His pupils (and their parents) should feel privileged to have so methodologically-correct and penetrating a science teacher, able to slice his way through the jungles of misinformation.\n","date":"August 10, 2013 at 2:58 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/09/how-long-before-the-grey-scales-fall-from-peoples-eyes-and-the-shroud-image-accepted-as-a-thermal-imprint-scorch/","cat":"medieval_hoax","id":"comment-2226","author":"colinsberry","site":"colinberry"},{"title":"How long before the grey scales fall from people’s eyes, and the Shroud image accepted as a thermal imprint (“scorch”)??","post":"Hello Chris. Good of you to look in. I’m no expert where digital image analysis is concerned, but grey scale seems fairly self-explanatory. That said, I’m not sure I’d agree that image superficiality should correlate with grey scale. Why not? Because we’re told that image intensity, and thus grey scale, has peculiar, some might say unexpected, half tone qualities.  It’s explained by saying that it is the number of coloured fibrils that determines image intensity, as distinct from intensity of individual fibril colouring. So where you have a high image intensity and high grey scale value, you do not necessarily have a deeper, more weave-penetrating less superficial image. All the action, so to speak is in the most superficial surface layer.\nBut it’s self-evident that if you have a hotter template, you’ll get a deeper scorch, which might sound like I’m contradicting myself, which in a sense I am. I guess what I’m saying is that in modelling the Shroud image one makes a decision at the outset to use low temperature templates to get uniformly faint scorches (overall), so that any differences in intensity/grey scale are then down to half-tone differences, all at the same level of superficiality.\nI hope that makes sense, but I’ll read through what I’ve written tomorrow morning,and may regret my decision to hit the send key.\n","date":"September 10, 2012 at 10:37 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/09/how-long-before-the-grey-scales-fall-from-peoples-eyes-and-the-shroud-image-accepted-as-a-thermal-imprint-scorch/","cat":"medieval_hoax","id":"comment-650","author":"colinsberry","site":"colinberry"},{"title":"How long before the grey scales fall from people’s eyes, and the Shroud image accepted as a thermal imprint (“scorch”)??","post":"Hi Colin, thanks for referencing my comment on your blog. One thing that strikes me about your theory about how the Shroud image was formed (effectively plunging a 250c statue into a sand bed covered with a linen sheet as I understand it) is that there should be on the Shroud a correlation between the superficiality of the image and intensity of grey scale. On this point, for your theory to hold, it seems to me the image depth should be greater on places like the tip of the nose than on the side of the nose for example, as you pointed out more pressure would be exerted there. I don’t know if this is the case with the Shroud as I’m not sure where image samples were taken from.\n","date":"September 10, 2012 at 10:13 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/09/09/how-long-before-the-grey-scales-fall-from-peoples-eyes-and-the-shroud-image-accepted-as-a-thermal-imprint-scorch/","cat":"medieval_hoax","id":"comment-649","author":"ChrisB","site":"colinberry"}]
