[{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Thank you Matt. Your comments have been most heartening.\n","date":"March 18, 2017 at 7:51 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8683","author":"Colin Berry","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Thank you Matt. I’ve been waiting patiently for 18 months or more for this kind of feedback…\n You have finally confirmed my faith (correction, initial hopes)  in the internet as a medium for disseminating research and discussion online in REAL TIME as a 21st century alternative to the over-hyped ‘peer-reviewed-dare-one-say- hide-behind-a-paywall option’.\nYes, Dan Porter’s site served a useful role in discussing the pros and cons, but he himself was less than helpful in adjudging the relative merits between both sides of the argument. His main objective seemed to be to keep the discussion going – endlessly. \nBut thank you Dan for the memories (positive ones)….\n","date":"March 18, 2017 at 7:01 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8681","author":"Colin Berry","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"You’re welcome. I’m a skeptic and like such discussions. I’ve looked into a lot weird religiously based claims that don’t get a lot of skeptical treatment or scrutiny. The Shroud is one of them. When I first heard about the Shroud a few years ago I was surprised at the lack of skeptical sources on the internet or in books, responding to the obvious pseudoscientific “findings” and methods of that crowd. Anyways keep up the good work. I’ll be checking in from time to time.\n","date":"March 18, 2017 at 7:25 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8682","author":"Matt","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Ah yes, the maillard reactions that Rogers proposed (the only thing he did right). I think your explanation is brilliant. As regards to the proshroudies. They’ve been caught with there pants down (figuratively) too many times. STURP reminds me of the pseudoscience done by creation “scientists”. I think the reason it hasn’t been explained is because no one wants to explain it because it serves a religious purpose and mystery gets publicity.\nMy question is when I read Dan Porter, he says he believes it’s authentic but then says he doesn’t believe it’s a miracle and can be explained naturally.What do you make of that because at times it seems like he’s talking out both sides of his mouth. Like it seems many times that people in that camp will try to play both sides of the table like that.\n","date":"March 18, 2017 at 6:42 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8680","author":"Matt","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Yes, the pro-authenticity folk in general (Mario L a notable excepotion – see his site) seem to be relaxed about an image that is on both faces of the Shroud, albeit exceedingly faint on the obverse side, yet say there’s nothing in between! That takes quite a bit of explaining, wouldn’t you say, and I don’t recall seeing any attempts as yet to come up with a cogent explanation?\nI have one, and it’s tentative, so am pleased to see your thinking is at least partly along the same lines. \nYup, we’re talking about OIL. \nMy flour imprinting works best when there’s vegetable oil prsent, not just to attach flour to the skin initially, but to help colour development in the oven too. \nThe oil helps to ‘micro-fry’ the particles of flour, which then proceed to turn brown due to Maillard reactions, A small surplus of oil then acts as a liquid vehicle, allowing that cocktail of yellow/brown Maillard products to penetrate the weave of the linen.  The likely route for capillary migration is the narrow channels BETWEEN the fibres, as can be easily modelled with ink ( I did a clip for YouTube back in 2015), so the brown cocktail can get from one side of the linen to the other INSIDE the threads, out of sight, and then, if there’s sufficient, proceed to stain the opposite face where they emerge..\nWhy an image (of sorts)  on the opposite face, rather than a mere oil stain? Maybe the Maillard cocktail deposits solid polymeric highly-pigmented  melanoidins on its short journey. The latter attach strongly to the fibres, so that the migrating oil gets cleaner and cleaner, finally scarcely visible in the cloth. leaving the pigmented image on the obverse side roughly the same shape and size as the topside, but not exactly the same (which might explain Fanti’s curious finding that the main and subsidiary image were not quite identical in his computer-assisted imaging).\nThanks for the interest Matt. Let me know if you have any further insights. Right or wrong they are all grist to the mill.\n","date":"March 18, 2017 at 4:34 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8679","author":"Colin Berry","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Hello Matt.\nNo, I’ve never addressed the claim for partial  ‘obverse side’ images as yet, notably face and hands, feeling as I do that I needed to be better informed as to the nature of the topside image first. When I say images, I mean ones that can or cannot be seen with photographs alone, rathet than those problematical computer-aided reconstructions reported by Giulio Fanti and his team.\nMario Latendresse put a couple of photos up on his sindonology.com site a while ago. I’ve taken the face, shown first “as is” and then after photoenhancement in my unsophisticated MS Office Picture Manager, using just the 5 controls in brightness and contrast.\nBefore:\n\nAfter:\n\nWhat do you reckon Matt? Is there an image on the opposite side of the linen or not? Mario says there’s not…\n(There’s probably no point our discussing THAT claimed image unless agreed on whether there really is one or not!).\nPS: Beware: the photoedited one has also been left/right reversed, unlike the ‘as is’. Apols for that (it was done for future use, when comparing with topside image).\n","date":"March 18, 2017 at 3:23 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8677","author":"Colin Berry","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Well if there is no image, where is the hair coming from unless the front image isn’t as superficial as they’re saying. It’s hard for me to believe a lot of the pro-shroudies given the spurious nature of a lot of their claims. I saw your comment on Dan Porters site about the graphite background and the picture of the red painting on linen. Could this be a light phenomena? assuming the images are as superficial as they say. In any case, I’m convinced that the shroud is a fake. I think the image of the hair may come from the outlines of the painted blood and perhaps some oil substance staining through which adds to the paredolia. \nIn the big picture I think this is the last thing Christianity has seeing that they’ve lost when it comes to creationism, geocentrism and Adam and Eve. Seeing that all these things have been debunked. I think the shroud will follow. \nWhat say you?\n","date":"March 18, 2017 at 4:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8678","author":"Matt","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Good day Colin, I’ve been reading your blog and you’ve revealed things to me I never knew about the shroud given all the hype thats out there. Just wanted your opinion on something. What do you make of the “second face” on the reverse side claim. I’ve heard even some pro-shroud people deny it. Do you have a post about it? Thanks.\n","date":"March 18, 2017 at 1:20 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8675","author":"Matt","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Have just posted this comment and images to an ongoing thread on the International Skeptics Forum  (see link to Comment 297 at end):\n\n“These two images are not new here – they are excised portions from my Comment 191 where I first announced to this site (and the world!) that the Zeke filter on Microsoft’s Window’s 10 is perfectly attuned to the needs of Shroudology, unmasking fine particulate matter from background.\nThat’s flaking-off blood in the hair you see on the left. That’s flaking-off something else you see on the right.\nBut it can’t be anything else but body image on the right, since it’s virtually the entire moustache and tip of the nose!\n Sorry to repeat myself, but the Shroud body image has two distinct components – a crust- like one that has largely flaked-away, similar in behaviour to the aged blood, and an underlying faint yellow or yellowish-brown stain.\nSo when you read the old literature and see references to particles, e.g. McCrone’s ‘red ochre’ etc, think about the non-detached components. And when you read others that talk about the amazingly superficial nature of the Shroud image, typically cited as 200nm thick or less, the need to use pulsed uv laser beams to reproduce, think about the underlying stain.\nI knew I’d get there in the end. Who’d have thought that some “crappy” image-editing software supplied on every new Windows laptop would supply the answer…\nI tried saying thank you to MS on their site that announces Zeke and the other filters, but after enrolling and attempting to add Comment 51 was told newbies have not acquired sufficient “reputation” to leave comments on old postings. What a cretinous thing to say, immediately below “Welcome new member”.”\nhttp://www.internationalskeptics.com/forums/showpost.php?p=11751513&postcount=297\n","date":"March 10, 2017 at 8:59 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8615","author":"Colin Berry","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Thanks sheona\nWhile I’m no longer bothering with new posts here, being totally ignored and shut out  by those true believer ‘sindonologists’,  I’m still deliberating, still trying to make sense of the Shroud as a ‘forgery’. As already indicated, I’ve never been happy with that term ‘forgery’, feeling we may be missing something re ORIGINAL motivation of its fabricators.\nIn fact, I’m currently onto what I believe is an entirely new angle, one that I wasted no time in posting to the  ‘Odds n Sods – a Miscellany’  website (see link in my reply to Paul that directly precedes your comment).\nHere’s what I posted to his site, though  ideas based on Leviticus Chapter 6 are evolving as we speak (with Paul I’m pleased to say expressing much interest):\nColin Berry Feb 17,2017 11:24 am\nHello again Paul. I hope you won’t mind if I now use your site – and possibly your social media contacts too – for a kite-flying exercise, the kite in question being a mere 3 hours old!\nIt began with me googling (bible flour). I got to wondering this morning if there might be some clues as to why medieval ‘forgers’ of the Turin Shroud might choose to use white breadmaking flour as an imprinting medium.\nSuppose I said there was a chapter in the Bible that mentions not only my white flour, that additionally mentions cooking oil (also an important ingredient in my imprinting medium) AND fire AND white linen as well? That would be asking too much, right, to have 4 vital components in my medieval manufacturing scenario not only in the Bible, but in a particular chapter thereof?\nWell, guess what? There is. See Leviticus, third book after Genesis and Exodus in the Old Testament, Chapter 6 !\nIt’s about the procedures/rituals that have to be followed by those who have confessed their sins to a priest, and who are required under Jewish law to make a sacrifice.\nChp 6 is targeted at poorer folk who can’t afford animal sacrifices, who are told to bring along cheaper food, “finest flour” especially – some to be used as a burnt offering, the rest to be baked into unleavened (i.e. non-yeasted) bread for the presiding priest and hopefully his family especially!\nHere are two key verses (New International Version):\n15. The priest is to take a handful of the finest flour and some olive oil, together with all the incense on the grain offering, and burn the memorial portion on the altar as an aroma pleasing to the LORD.\nWow! That’s three of the ingredients – flour, oil and fire. What about the 4th? Linen?\nGuess what? It comes 5 verses earlier in the same chapter :\nAs before, the New International Version:\n10. The priest shall then put on his linen clothes, with linen undergarments next to his body, and shall remove the ashes of the burnt offering that the fire has consumed on the altar and place them beside the altar.\n(Yes, the white linen has special ritual significance, given what we read in the following verse):\n11.Then he is to take off these clothes and put on others, and carry the ashes outside the camp to a place that is ceremonially clean.\nThis comment is already too long, Paul, so I shall end here, except to propose an entirely new explanation for the Turin Shroud. Might it have been intended initially to symbolize the crucifixion of Jesus as an Old Testament style sacrifice of Son by Father, intended as an expiation of someone else’s , i.e. mankind’s sins.\nThat explains why the technology was customized, a one-off. It was a gesture on the part of those powerful, privileged folk who commissioned it (the Lirey-based de Charny family certainly, based on the Lirey Pilgrim’s badge, but conceivably under instructions from the highest in the land, King John the Good as well, no less. Those two battle-hardened knights were linked via their self-created chivalrous Order of the Star, said to have been de Charny’s idea, modelled on England’s Order of the Garter).\nYou read it here first!\nListen ye here now, you authenticity-promoting imaging via nuclear or electromagnetic radiation obsessed tunnel vision shroudologists. You may get away with ignoring my site, basically because I’m uninclined at this stage to involve the MSM (or even so-called ‘peer-reviewed’ journals, read chum-reviewed in many instances). Will you dare ignore Paul’s and others’ internet sites too?\nHearing yours and others’  immediate response to this new approach will be most welcome, sheona before I elaborate further. Suffice it to say there are not just one but TWO  aspects to the Mosaic laws regarding sacrificial burnt offerings. There’s the obvious one of being required to part with valuable livestock or even the ‘finest flour’ and olive oil (ring any bells?) . But there’s another, one I’d missed up till now.  It’s the presumption of an anthropomorphic God up there in his heaven who will appreciate the aromas wafting up from the fires on those altars!.\n Watch this space (or Paul’s website) for more on that “Currying favour with Mr.Big” idea which could be the real explanation for that so-called ‘forgery’  we call the Shroud of Turin. Was it intended not just as a sin-expiating sacrifice, but,  more importantly, as a GIFT too from one or more of the most powerful families in mid-14th century France, including that of the monarch’s too (John the Good, no less) as well as his bearer of the Oriflamme, Geoffroy de Charny, Lord of Lirey and his wife, both of whose coats of arms appear on the Lirey pilgrim’s badge?\n","date":"February 20, 2017 at 7:17 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8513","author":"Colin Berry","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Sorry to read you are no longer posting. I don’t say much, but I enjoy reading.\n","date":"February 19, 2017 at 10:22 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8510","author":"sheona","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Paul is an author/blogger with an engaging style of writing. He covers an extraordinary range of thought-provoking topics. I was fortunate to come across his recent feature on the Shroud through googling. Here’s a link:\nhttp://www.paul-andruss.com/turin-shroud/\nSeparately, I yesterday had a pop at that Arch-Purveyor of Shroudie Dogma, namely Stephen E.Jones (currently shifting reams of convoluted logic re alleged 3D properties, failing to publish – though vaguely alluding to – my critical ripostes). It’s to be found on my otherwise neglected sciencebuzz site:\nhttp://colinb-sciencebuzz.blogspot.co.uk/2017/02/the-evidence-is-overwhelming-that-turin.html\n","date":"February 12, 2017 at 8:49 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8477","author":"Colin Berry","site":"colinberry"},{"title":"Might those be flecks of congealed wheat gluten one sees on the Turin Shroud? Evidence for unique one-off white flour imprinting?","post":"Thanks Colin for the very interesting and revealing article. I see we are in the same time zone.. wasn’t to sure when I emailed you.\n","date":"February 12, 2017 at 1:45 am","url":"https://shroudofturinwithoutallthehype.wordpress.com/2017/01/04/testing-my-flour-imprint-hypothesis-might-those-be-solid-gluten-flecks-one-sees-on-the-shroud-scope-body-image/","cat":"medieval_hoax","id":"comment-8476","author":"paulandruss","site":"colinberry"}]
