[{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"I agree with Colin also in this matter, but not his presentation…Can not Barrie or Stera make all those photographs in their archives available in high resolution (for viewing only) on the site, without one’s ability to download them? …I think that would go a long way to subsiding many complaints!…I was actually contemplating sending Barrie an email asking if he would think about it.\nThoughts on this from anyone appreciated.\nR\n\n","date":"July 22, 2012 at 11:07 am","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14088","author":"Ron","site":"shroudstory"},{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"From time to time, we come to this point and not being able to overcome these difficulty is the major reason why research on the Shroud remains amateur and not professional. This applies to Barrie but also to all the persons who along the years have had access to any kind of sample coming from the Shroud. If any available material is not freely available for research to anyone, with a clear protocol of use, sorry to tell, but we will never progress. In this sense, the research on the Shroud is stuck for so many years because in the absence of a central body coordinating available evidences AND designing a comprehensive research program with state of the art techniques and knowledge, we are still discussing on material published in the 90’s and techniques like C14 belonging to the same period. Please remember what has happened with other recent examples in which truly scientific challenges that additionally may have serious social/religious/political implications.Take for example, the long period in which Qumram manuscripts or climate data were not available to the scientific community. In both cases, research did not move forward until open discussion on objective data allowed properly addressing those scientific issues.\nIn my view, with the Shroud we are stuck exactly for the same reason.\n\n","date":"July 22, 2012 at 6:05 pm","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14100","author":"Gabriel","site":"shroudstory"},{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"For copyrights, Barrie Schwortz is an expert and could address this if he chose to do so.  I doubt that he will, since the author is merely trying to goad Barrie into doing something he does not have to do.  I really don’t understand why Colin feels the need to attack someone who is so upright and agreeable as Barrie Schwortz.\nWhy doesn’t Colin visit http://www.sindonology.org/shroudScope/shroudScope.shtml and take a look at these very high resolution, publicly available images?  With the zoom made available by Mario Landresse (sp?), he should be more than satisfied.\n\n","date":"July 22, 2012 at 10:42 pm","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14105","author":"Andy Weiss","site":"shroudstory"},{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"Andy, but a good point has been put forward here. Why hasn’t the thousands of pictures of the Shroud been made public? Atleast viewable to the public. Pictures that cannot be accessed anywhere else. Why hide them? For instance Barrie mentions in the interview about pictures of the weave at the seam of the side-strip, …I would love to see these photos, as I am in the tendancy to dissagree with Barrie on the subject of the side-strip. I’ve seen other close-up photos and do not agree the threads match up so well, maybe his photos are clearer and can settle the matter.  I doubt there would be a copyright issue with any of the pictures given to Barrie and if there is just make access to photos that there isn’t any issue and display them as I proposed in my post above. Aslong as they can’t be downloaded, everything should be fine.\nR\n\n","date":"July 23, 2012 at 3:10 am","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14110","author":"Ron","site":"shroudstory"},{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"\nColin Berry :\nWhat are you afraid of?  That folk might see things in those images that could dispel some assiduously-promoted ideas about the Shroud of Turin as constituting some kind of “enigma”\n\nThat is unfair, and absurd.\nShroud.com is the largest and most reliable site on the Shroud. Maybe reading articles on STERA’s site you might see things that could dispel your vain fight.\n\n","date":"July 23, 2012 at 7:19 am","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14117","author":"anoxie","site":"shroudstory"},{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"Didn’t the BBC take some Hi-res pictures of the Shroud in 2009 for a documentary? Why doesn’t he bug them?\n\n","date":"July 23, 2012 at 12:58 pm","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14132","author":"Chris B","site":"shroudstory"},{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"Yes they did ChrisB, but I think it was in 2008, filming David Rolfe’s-Shroud Material Evidence for the BBC. I believe those high-res images are property of the Turin Archdiocese/custodians and they must give permission. If I remember correctly they (Archdiocese) claimed they would make the images public at some point….still waiting ;-)\nR\n\n","date":"July 23, 2012 at 2:13 pm","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14134","author":"Ron","site":"shroudstory"},{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"Don’t you expect too much even of the Turin Sindon HD video. There is a loss of detailed information in filmstills.\n\n","date":"July 23, 2012 at 2:52 pm","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14135","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"You may be right Max. Alas, I also erred/forgot that the Archdiocese had HD Digital ‘photographs’ taken around the same time and these were what they claimed would be available to the public eventually. Apparently 160 Gigibytes of information to be precise, if memory serves me well.\nR\n\n","date":"July 23, 2012 at 5:05 pm","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14138","author":"Ron","site":"shroudstory"},{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"\nRon :\nAndy, but a good point has been put forward here.\nR\n\nI don’t think a valid or good point has been made here, Ron.  I find it childish.  Here’s my answer to you and anyone else…\nIf you want to do research and would like Barrie’s pictures to do that research, visit Shroud.com and e-mail him and request whatever pictures you would like to use to do your research.  That is precisely what I did and he has been most generous.  Perhaps you ought to read Barrie’s response posted in Dan’s blog elsewhere.\nThe real problem is that not everyone will honor these legal and rightful copyrights.  Barrie has extensive experience with this area since he was a professional photographer for about 40 years and also taught copyright law in a school in California.  In this area he is an expert.  This is like telling John Jackson how to do physics or Ray Rogers, God rest his soul, how to do chemistry.\n\n","date":"July 25, 2012 at 10:06 pm","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14230","author":"Andy Weiss","site":"shroudstory"},{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"I have read the response, and I must clarify what I meant with my previous post, noticing now, it was quite vague. I have no issue with Barrie and when I stated; “a point was made”, I definately was not in line with Colin’s comments (although it seemed like it from a terribly written comment). I was just actually making a suggestion, where I believe many of us amateur researchers do not need the actual photos, as in downloading them, but would like to view them and hopefully with better clarity or (dpi). This is quite possible, as I’ve come across it many times on other sites, as photos can be accessed online, on the site, but without the ability to download said photos. If others would like to actually have the photos for personal use then yes they can email Barrie and ask. I just didn’t understand why this has not been made available! But after reading Barrie’s comment, I see now that there are issues, as in time and funds to name a few. I just hope Barrie will reconsider his stand of not making available any photos over the present dpi, in light of the proposal of making all photos available {for viewing only} without ability too download….In due time ofcourse…If I lived nearby, I would easily volunteer myself to help in the process, believe me. But it’s Barrie’s site, he can do with it what he likes, I’ll make no mention of it again. I would like to apologize to Barrie if my statement (written badly) was taken in a negative sense….I too have shared emails with Barrie and he has always been helpful, honest and kind.\nR\n\n","date":"July 26, 2012 at 6:47 am","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14243","author":"Ron","site":"shroudstory"},{"title":"Absurdity for Today:  Colin Berry Castigates Barrie Schwortz","post":"Hope what I said makes sense.\nR\n\n","date":"July 26, 2012 at 6:50 am","url":"https://shroudstory.com/2012/07/22/absurdity-for-today-colin-berry-castigates-barrie-schwortz/","cat":"news_&_views","id":"comment-14244","author":"Ron","site":"shroudstory"}]
