[{"title":"Barrie Schwartz on the Shroud of Turin","post":"” we do know it is at least twice as old as the now discredited carbon 14 date.”\nAnd how do we know it is “at least twice as old”?  Only dating methods can do that.\n“deny that the shroud is authentic requires a leap of faith.”\nIt doesn’t take a leap of faith to realize that it is just a piece of cloth with attached legends.  It can never be linked to any specific person any more than it can be proven that the other relics of the Catholic Church – the holy prepuce, Jesus baby teeth and umbilical cord, his baby blanket or the vials of Mary’s milk are authentic.  Consider as well that the Romans conducted crucifixions over a period of 700 years with, at times, a thousand victims at a time.  Some or most of them would also had shrouds.\n\n","date":"March 30, 2009 at 3:37 am","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-348","author":"Lora Singer","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"Did all of them have a crown of thorns? Did all of them have non broken legs? Did all of them have a pierced side? Were all of them scourged to within an inch of their lives? Were all of them buried in a cloth that was an expensive type cloth, that only a rich man could afford? The shroud is literally a forensic match to everything that happened to Jesus at his crucifixion and was given in all four gospels. None of the things you stated have the Biblical backing the shroud has. Lastly, why do we have the shroud, how  many people are crucified, buried and we have the shroud? The answer is none!\n\n","date":"October 6, 2013 at 10:46 am","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-46307","author":"Rich Giardelli","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"wall street journal article friday, april 10 cited aging analysis by “accelerator mass spectrometry.”\nof course, the age of the shroud was shown to be 1200 yrs out of synch.\ni am always frustrated by media types who will keep trying to find a way to disprove the obvious qualities of the shroud.\nour aging techniques are rather irrelevant.\nthere is a picture of a man on an ancient linen who perfectly bears witness to the scourging and crucifiction. the image defies our attempts to explain it.\nit is a miracle.\nbill hart\n\n","date":"April 13, 2009 at 9:57 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-377","author":"william hart","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"This was obviously place before the Giulio Fanti vibrational spectroscopy tests. The writer would have us believe that the ST is no better than the plethora of medieval relics that flourished when the relic trade was both fashionable and lucrative. However, and rather disturbingly for him, the Shroud is unique in every sense an artifact can be . Crucifixion was a common brutality in Roman rule. So where are the other shrouds? Rather like the evolutionist, when asked for his intermediary forms, for the bones of the little birdy the reptile gave birth to one day by mistake, this worthy writer will no doubt say, “we’ll find them someday.” Perhaps. It cannot be linked with any person, but if it had been found in Los Angeles yesterday morning only a hermit living in a cave on Mars could not tell you who it was. Who, indeed.\n\n","date":"June 11, 2013 at 7:51 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-36739","author":"Josie L. Tyner","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"Hey Barrie,\nI heard you speaking as a guest on “Coast to Coast” last night (12/17/09).  Great work once again Barrie! As I listened to the interview I pulled out my autographed picture of the shcroud that you once gave me, and, as I marveled upon it, I was thankfull to have known you.\nThe schroud is as real and authentic as Jesus himself was real and authentic.\n\n","date":"December 18, 2009 at 3:38 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-895","author":"Daryl Alvarado","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"* sorry, partially blind. refers to comment by by l. singer sorry mr. hart.\n\n","date":"June 11, 2013 at 7:54 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-36741","author":"Josie L. Tyner","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"where could you buy the book by barry schwaartz named Shroud of turin/\n\n","date":"December 19, 2009 at 10:50 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-897","author":"phyllis","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"I would like the name of the book on the shroud of turin\n\n","date":"August 22, 2010 at 8:27 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-1409","author":"ignatius russo-alesi","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"Barrie\nput together your own broadcast of the Shroud of Turin;\ni love your no nonsense and open mindness\nwhich is very refreshing in comparison to\nthose other so-called scholars who are\ninsufferable and closed minded and obviously have have their own agenda\n\n","date":"June 13, 2010 at 5:55 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-1359","author":"David Hughes","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"please drop one of the “have” in the last line\n\n","date":"June 16, 2010 at 5:01 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-1361","author":"David Hughes","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"Psi Tech viewed Jesus Resurrecting:\nhttp://www.remoteviewing.com/remote-viewing-news-articles/the-signal-line/041103/index.html\nand reason for it:\nhttp://www.trvnews.com/tmn/042705/jesusredux.html\nPsi tech came out of CIA black ops to the public\n\n","date":"September 5, 2010 at 11:15 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-1419","author":"Carol","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"oh forgot they viewed the shroud and said it is not Jesus burial cloth\nI asked them to find it–via viewing\nthen 911 attack and I assumed that would be back burner\nIt could be viewed again–the protocols have to be followed–for the data to be correct\nAs far as I am concerned it is the Shroud, until they find the correct one or re-do the technical remote viewing to make sure the data is clean.\n\n","date":"September 5, 2010 at 11:19 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-1420","author":"Carol","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"If you study the blood stains closely, it would appear that the person being covered by cloth may well have been alive at the time. Comments please, thank you. @\n\n","date":"September 24, 2010 at 6:35 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-1448","author":"Asim Butt","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"Why do you say that? Fred Zugibe, Rockland County, NY, medical examiner for 30 years, doesn’t think so. In fact, he is certain that the man was in full rigor and that the bloodstains are definitively post-mortem. He has studied the Shroud extensively and published books and papers on the subject.\n\n","date":"September 24, 2010 at 9:32 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-1452","author":"Episcopalian","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"Ever since I seen the Shroud of Turin Documentary I knew it was the actual burial cloth of Jesus Christ.  No doubt in my mind that it is Authenticate.  The Shroud was left behind for those who seek proof of Jesus Resurrection or for those who need to strengthen their faith.\n\n","date":"July 28, 2011 at 1:53 am","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-3451","author":"shroudofturinnews","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"Dear Barry\nHaving seen on TV various attempts at  verifying the authenticity of the so called Turin shroud. I have always been slightly puzzled that the image is so precise. If I am correct , at that time the body was normally wrapped in a shroud,the linen or whatever not just laid on the body. To my mind this would produce very different markings,\n I have not seen or heard of attempts to coat a living person with something which could mark the cloth, whilst correctly wrapping the body as in ancient times, in order to see just what image results. For instance on the Turin shroud there is no evidence of impression of the top of the head or the side and there is little sign of folding or creasing, which one would assume would be so profuse as to distort any image\n Further to this, The body of Christ was allegedly washed and anointed with various substances such as myrrh. Since dead bodies do not continue to bleed and no doubt all trace of blood would have been washed away, how is it that marks on the cloth appear to show fresh bleeding from the corpse precisely corresponding to the wounds Christ was meant to have suffered?\n\n","date":"March 24, 2013 at 7:13 am","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-28263","author":"David Georgeson","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"Hi David; good to have you along.\nThe points you ask about have been the subject of considerable discussion, and even some research (!), but it would be wrong of anybody to say that conclusive proof has been achieved for or against any of them. Whether the body was washed or not, whether it was surrounded or anointed by anything, whether the shroud was wrapped or draped, whether and especially what combination of these might have resulted in the image as we see it today have all been, often hotly, debated. For what it’s worth, I will summarise the main opinions…\n1) “Normally wrapped.” The precise details of 1st century Jewish burials, as applied to victims of a judicial crucifixion, in a hurry, are, of course, unknown, and leave lots of scope for variation. The paucity of archeological remains only serves to obfuscate the situation further. It seems that bodies were ‘normally’ laid in some sort of shroud (probably not a long thin one), allowed to rot away, and the bones reinterred in urns. Recovery of a relatively undamaged shroud would thus be very unlikely, which is why we don’t have any. Or any others, perhaps I should say.\n2) “Attempts to coat a living person.” There have been dozens, all with fairly gruesome results. Any kind of wrapping produces what is called the ‘Agamemnon mask’ distortion of the face, with the ears wide apart sticking out at the sides, the legs very thick, and the top of the head a continuous band from forehead to the back of the neck. Very few, if any, researchers think that the body-image could have been formed in that circumstance, although some people think that the blood stains were transferred while the body was wrapped, and the image arrived later, on a different configuration of the shroud. However this is not necessarily a fatal objection to authenticity. After all, the body may have been closely surrounded, even packed, by bags or blocks of ‘myrrh and aloes’ or some other concoction. The bible is at pains to point out “one hundred pounds,” which is a pretty generous dose. This might have resulted in what was essentially a bas relief, and the image would not not have extended beyond what we might call the top and bottom surfaces.\nOther researchers think that the image was formed by some form of emanation, either of gases, radiation or something more esoteric. Although these might be expected to spread out in all directions, if they actually only acted in a vertical direction, then again, the sides of the body would not be expected to leave an image.\n3) “Washed and anointed.” Here, again, prescribed Jewish ritual versus a hurried burial in a temporary tomb leaves room for uncertainty. It does appear that the body itself was not smeared with oil or anything similar, as it left no trace of the cloth, but it may have been completely washed (a sign of respect) or not washed (to preserve the blood with the body, which was, and still is, important to Judaism when the blood represents a significant quantity of the remains) or partially washed (to remove mud and clean minor wounds, but leaving the dried or clotted significant quantities undisturbed). The ‘anointing’ may have consisted of packing the body with spices, or laying flowers or more spices on the body in some places.\n4) “Dead bodies do not continue to bleed.” This is only partially true. As the heart stops pumping, and capillaries are thin, blood soon stops flowing through them, and the blood coagulates pretty soon anyway. However, blood inside a body stays liquid for some time, and opening a major wound, such as a nail-hole in a wrist or a spear-hole, can result in that blood falling out under gravity. Furthermore, abrasions, resulting in a loss of skin, can also remain moist for some time, and although they are unlikely to drip, at least some portion of the blood can be transferred to a cloth by contact. Try laying a piece of steak on a napkin to see what might be expected. Small but deep puncture wounds might also bleed under gravity if their surface clots were opened by a a cleaning or wiping process.\nIt should be needless to say that none of the suggestions above constitutes a verification of the authenticity of the shroud, but they do show that the simple assumptions many take to be proof of inauthenticity are in no way to be accepted at face value.\n\n","date":"March 24, 2013 at 12:44 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-28276","author":"Hugh Farey","site":"shroudstory"},{"title":"Barrie Schwartz on the Shroud of Turin","post":"Mr. Schwartz, About your decomposition test for the shroud of Turin:\nYou used a dead pig, I would assume that was killed mercifully. After having to undergo numerous spinal operations and the pain attached, I know that there is a condition that I call “the pains sweats”. It would have me sitting on the steps in a T shirt at -30 C, feeling hot. It also smells. Perhaps if you were to try the decomposition test again with a coating of whatever chemicals Christ would have had on his body from “the pain sweats”, you would get even better results. Also to be considered are what they might to wash the body and the interaction of these chemicals with the pain sweats chemicals.\nI am sure that I don;t have to mention this but please don’t torture a pig to death for the sake of realism. Whether the shroud is real or a fake isn’t that important. What is important is that Christ died a horrid death for us. The church say he died to pay for our sins. I believe that .this babbling idiocy. The only explanation that makes sense to me is that he lived and died so that he could experience the human condition fully and be able to judge us fairly. Surely the greatest example of love there ever was.\nIf you have the time, please respond and let me know if what I am saying is valid and if you decide to do the test and what your results were.\nThank You\n\n","date":"October 25, 2013 at 10:21 pm","url":"https://shroudstory.com/2009/01/30/barrie-schwartz-on-the-shroud-of-turin/","cat":"news_&_views","id":"comment-48710","author":"Mark Dechambeau","site":"shroudstory"}]
