[{"title":"Barrie Schwortz would like to see reexamination of the Shroud with today’s technology","post":"Barrie said everything that needed to be said, leaving nothing to add. Let’s hope Turin listens to him and not rush to make a decision.\n\n","date":"April 16, 2013 at 8:38 am","url":"https://shroudstory.com/2013/04/16/barrie-schwortz-would-like-to-see-reexamination-of-the-shroud-with-todays-technology/","cat":"news_&_views","id":"comment-30951","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz would like to see reexamination of the Shroud with today’s technology","post":"Amen. What is needed is a strong hand from either Turin or Rome so that whatever further tests are done are well designed and purposeful.\nOne of the problems is that there were competing interests. In the end, the carbon dating companies were dedicated to pushing STURP out and cancelling further tests until after they had made their tests because if it was medieval there would be no need for further tests. \nI am not making his up. It’s in Harry Gove’s own book on the Shroud published in 1998 and available on Kindle. What’s interesting is to read Gove’s attack on the ultimate protocol which was not followed any way and his attack on the conflicts between the British Museum and Oxford. He called it a “shoddy enterprise.” Granted he was angry because his lab was not chosen and granted then more or less ate his words afterwards, but he wrote them and they were instructive. (Harry E Gove. Relic, Icon or Hoax?: Carbon Dating the Turin Shroud, Kindle Edition)\nSTURP’s problem is that they were not in it for the money and for the carbon labs, millions of dollars were at stake. STURP brought a candle to a bonfire.\n\n","date":"April 16, 2013 at 9:11 am","url":"https://shroudstory.com/2013/04/16/barrie-schwortz-would-like-to-see-reexamination-of-the-shroud-with-todays-technology/","cat":"news_&_views","id":"comment-30956","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz would like to see reexamination of the Shroud with today’s technology","post":"Thank you, Barrie.\n\n","date":"April 16, 2013 at 9:31 am","url":"https://shroudstory.com/2013/04/16/barrie-schwortz-would-like-to-see-reexamination-of-the-shroud-with-todays-technology/","cat":"news_&_views","id":"comment-30959","author":"Chris","site":"shroudstory"},{"title":"Barrie Schwortz would like to see reexamination of the Shroud with today’s technology","post":"John, it seems to be a long story. Cardinal Anastasio Ballestrero certainly did not believe in the authenticity of the relic, at least before the CD test, and in fact there is a photograph where he appears leaning over the relic. Did he have second thoughts? Yes, he did. These thoughts were published in an Italian Carmelite monthly shortly before he died.  There were doubts about Gonella’s belief and, curiously, Prof. Carlos Chagas, who also did not believe in authenticity  — a TV report aired the day he died has him saying this — was the one who prepared the protocols.\n\n","date":"April 16, 2013 at 9:33 am","url":"https://shroudstory.com/2013/04/16/barrie-schwortz-would-like-to-see-reexamination-of-the-shroud-with-todays-technology/","cat":"news_&_views","id":"comment-30960","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz would like to see reexamination of the Shroud with today’s technology","post":"There is a very interesting book interview with Schwortz in Polish, performed by Catholic journalist Grzegroz Górny, title “Oblicze Prawdy, Żyd który zbadał Całun Turyński” (Face of the Truth, a Jew, who examined the Shroud of Turin): http://www.rosikonpress.com/towar_karta_151/Oblicze_Prawdy.html Unfortuantely it costs too much, and I am out of money for Shroud books for this month.\n\n","date":"April 16, 2013 at 9:43 am","url":"https://shroudstory.com/2013/04/16/barrie-schwortz-would-like-to-see-reexamination-of-the-shroud-with-todays-technology/","cat":"news_&_views","id":"comment-30961","author":"O.K.","site":"shroudstory"},{"title":"Barrie Schwortz would like to see reexamination of the Shroud with today’s technology","post":"Louis,\nYou have hit on a problem that has deep philosophical or theological roots. Is it wrong to rely on science to either support or deny faith? There is an attitude that faith must stand independent of science and that those who attempt to harmonize faith and science are somehow lesser Christians. I guess I am guilty of this.\nFor the better part of two millenia faith had demanded that we accept a story of the Garden of Eden and the forbidden fruit as the source the “original sin” which tained all of humanity. had it not been for Adam and Eve there would have been no death and no work.\nWe know know that that was a metaphor. Advanced theologians who were also scientists like Pierre teilhard de Chardin sought to redefine the faith in terms of evolution. The scientist who first proposed the “Big Bang” theory was a Belgium priest who was excoriated by the scientific community including some atheists.\nI think we are long past the moment when we should flee scientific proof of the authenticity of the Shroud. We do not organize our lives by proof beyond a reasonable doubt. To say, I turn my back on science because my faith has no doubt is to limit your world and your faith. (That is not an accusation of you, Louis, it’s just something I read and hear from others.)\nBy all the standards of evidence we use in law, the evidence that the Shroud is authentic is overwhelming except for the disputed carbon dating. The atheists cling to carbon dating the way some believers cling to their inerrant bible. Better, perhaps, to “Cling to that Old Rugged Cross.”\nScience is now approaching the complex question of human consciousness of self and its nature. The answer will lie in the Quantum realm, I believe. Genesis says that we are created in the image and likeness of God. That likeness is not our hands and our feet but our consciousness. I do not think this is heresy but it is my opinion or speculation in any event: Perhaps the best study of God is humanity.\n\n","date":"April 16, 2013 at 10:24 am","url":"https://shroudstory.com/2013/04/16/barrie-schwortz-would-like-to-see-reexamination-of-the-shroud-with-todays-technology/","cat":"news_&_views","id":"comment-30964","author":"John Klotz","site":"shroudstory"},{"title":"Barrie Schwortz would like to see reexamination of the Shroud with today’s technology","post":"John, the science-theology dialogue is essential in our days, that being the reason Gould did not keep his mind closed and wrote his paper on non-overlapping magisteria, after being influenced by a papal encyclical. \nIt is not possible to take Genesis literally, also because Mesopotamian myths crept into the text, and it is also not compatible with what we know today. The JEPD theory therefore makes sense and only God knows how much editing was done if the OT, as we know it today, only became “ready” around 500 BC, during the time of Ezra. But was it really ready? Monotheism, as we understand it today, is said to have been defined by the Council of Nicaea. D.N. Freedman’s study about the evolving concept about God in OT times thus becomes very relevant.\nYou are right about the complex question of human consciousness and quantum. There are scholars who believe that the universe is determined, so it follows that we humans with our physical bodies are also determined. That, needless to say, raises the question of the mind-body problem. If the body is determined, what about the mind, which is connected to the brain? We are thus lead to more questions, things like free will and so on.\nViktor Frankl, who suffered in Auschwitz, wrote that the question of suffering is related to the question of God. That makes Pope Benedict’s advice to Seewald on what to expect an important tip. And, as you said, the image on the Shroud shows suffering…\n\n","date":"April 16, 2013 at 11:08 am","url":"https://shroudstory.com/2013/04/16/barrie-schwortz-would-like-to-see-reexamination-of-the-shroud-with-todays-technology/","cat":"news_&_views","id":"comment-30970","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz would like to see reexamination of the Shroud with today’s technology","post":"Louis,\nI don’t mean to drag this on through the forum, but we are not getting too far afield. My thesis is simply that the Shroud is a revelation preserved for the scientific era. The issue is not provenance but providence.\n\n","date":"April 16, 2013 at 2:40 pm","url":"https://shroudstory.com/2013/04/16/barrie-schwortz-would-like-to-see-reexamination-of-the-shroud-with-todays-technology/","cat":"news_&_views","id":"comment-30978","author":"JOHN kLOTZ","site":"shroudstory"},{"title":"Barrie Schwortz would like to see reexamination of the Shroud with today’s technology","post":"That’s right, John, the topic is vast. We differ regarding the authenticity of the relic. There are more pro-authenticity arguments, but that is not conclusive evidence. Barrie is simply right about the possibility of obtaining some answers and doubts about getting conclusive proof with today’s technology.\n\n","date":"April 16, 2013 at 3:16 pm","url":"https://shroudstory.com/2013/04/16/barrie-schwortz-would-like-to-see-reexamination-of-the-shroud-with-todays-technology/","cat":"news_&_views","id":"comment-30981","author":"Louis","site":"shroudstory"}]
