[{"title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Roy Schoeman was led to Catholicism by a sort of mystical experience that was said to have been “instaneous”, not entirely different from the blinding flash experienced by Paul on the road to Damascus. Curiously, Paul studied under Rabban Gamaliel, Schoeman under Rabbi Arthur Hertzberg, two great rabbis in the history of Judaism..\nIf all who disagreed in the realm of Shroud studies would be allowed to voice their opinions in the known forum things would have been better for all and could, perhaps, help convince both Turin and Rome to open the doors for a fresh hands-on examination of the Shroud. What, after all, did Benedict XVI request at the last Dallas Conference, in the message read out by Bishop Kevin Vann of Fort Worth?\n\n","date":"April 2, 2014 at 10:42 am","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","id":"comment-95856","author":"Louis","site":"shroudstory"},{"title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Quote: “Roy Schoeman was led to Catholicism by a sort of mystical experience that was said to have been “instaneous”…\nI can testify that, in my life, I had 2 of those mystical experiences of the only one and true God (in 2001 and 2007) and, since that time, I’m fully convinced of the eternal salvation of all humanity…  Note that there was no puff of smoke or sound of thunder or flash of light during those 2 expériences.  They were both completely interior and spiritual.  A loving and merciful voice from within.  That’s how I can best describe those 2 experiences.  And that proved to me how much God is discreet and subtle.  All the contrary of those who believe the Shroud image would have been created by a supposed burst of energy from the Resurrection…\n\n","date":"April 2, 2014 at 1:07 pm","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","id":"comment-95878","author":"Yannick Clément","site":"shroudstory"},{"title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"And why God is so discreet and subtle?  Because he is love.  And when you are love in person, you let your children free to believe and recognize you or not, while he’s still here, in our space-time universe…\n\n","date":"April 2, 2014 at 1:09 pm","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","id":"comment-95879","author":"Yannick Clément","site":"shroudstory"},{"title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"My 2 personal and spiritual experiences of God can explain (at least partially) why I favored greatly a natural explanation for the image on the Shroud, because I know that the God I have meet (who was the Father, I’m sure) would never leave any potential proof of the Resurrection on his Son on his burial shroud…  That’s purely and simply not his style. \nNow, anyone is free to agree with this or not…\n\n","date":"April 2, 2014 at 1:21 pm","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","id":"comment-95883","author":"Yannick Clément","site":"shroudstory"},{"title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"Thanks Barrie, good words. Truly, even a good quarrel may sometimes put the things straight, and correct some errors…\nThere is a serious one in your interview. Circa 28:00-29:00 you mentioned that mixing linen and cotton was prohibited by the Jewish law, no it was permitted. Actually mixing linen and wool (or in general animal derived yarn with that of the plant origin) was prohibited (but according to Ada Grossi, funeral clothes were actually not obligued to be ritually clean).\nAnd one more thing:\n24:17 “one of the folks in Turin, who’s a supposed textile expert…”\nThat statement towards Mme Flury-Lemberg was not nice… (even despite I disagree with her opinion). The fact is that she actually is a textile expert (and in my opinion that’s root of the problem here)!\n\n","date":"April 2, 2014 at 1:36 pm","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","id":"comment-95887","author":"O.K.","site":"shroudstory"},{"title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"I note the quad mosaic photos appearing again, with the usual explanation that the difference in colour across the shroud represents diffrence in chemical composition. While Barrie carefully explains how a green area in one corner of one photo suggests moden interweaving, he does not explain that all the photos of different areas of the shroud show similar discolouration at the corners, or what the huge pale blue area right across the middle of the images might indicate. Surely this argument for interweaving has been totally discredited.\n\n","date":"April 3, 2014 at 4:19 am","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","id":"comment-96075","author":"Hugh Farey","site":"shroudstory"},{"title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"I assume that Hugh is claiming that the variations in the quad mosaics are an inadequate argument for interweaving, and not that the assertion that there is interweaving is itself discredited.  Or is he indeed claiming that interweaving is no longer tenable?\n\n","date":"April 3, 2014 at 5:36 am","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","id":"comment-96095","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Part 2:  Barrie Schwortz on Roy Schoeman’s Salvation is from the Jews Radio Show","post":"You’re quite correct. I don’t believe in the interweaving hypothesis, but there is certainly some evidence in favour of it, such as the appearance of cotton fibres and possibly Rogers’s madder and glue. The quad mosaic argument though is surely dead in the water.\n\n","date":"April 3, 2014 at 5:51 am","url":"https://shroudstory.com/2014/04/02/part-2-barrie-schwortz-on-roy-schoemans-salvation-is-from-the-jews-radio-show/","cat":"other_blogs","id":"comment-96096","author":"Hugh Farey","site":"shroudstory"}]
