[{"title":"Rosetta Correa interviews Barrie Schwortz","post":"There must be a typo, Barrie was not 50 during the STURP effort, he was 30.  Don’t want anyone thinking Barrie is now in his 80’s!\n\n","date":"April 21, 2012 at 2:53 pm","url":"https://shroudstory.com/2012/04/21/rosetta-correa-interviews-barrie-schwortz/","cat":"news_&_views","id":"comment-10674","author":"Shroud Encounter","site":"shroudstory"},{"title":"Rosetta Correa interviews Barrie Schwortz","post":"Actually, the statement about my age is correct. I examined the Shroud as part of the STURP team at age 32, but did not confront my own faith until I was forced to do so 18 years later, at the age 50, so I could answer the questions honestly.\n\n","date":"April 21, 2012 at 6:08 pm","url":"https://shroudstory.com/2012/04/21/rosetta-correa-interviews-barrie-schwortz/","cat":"news_&_views","id":"comment-10684","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Rosetta Correa interviews Barrie Schwortz","post":"Quote from the interview :\nCorrea: For you, what would authentication of the Shroud of Turin mean for the Christian world, the whole world?\nSchwortz: For the Christian world it is a verification of everything the Gospels tell us about what was done to this Man. This is a document of the Passion, and so I think the real significance for Christians, and for everybody, is its faithfulness to what the Gospels tell us was done.\nI LOVE THIS ANSWER FROM BARRIE !  In fact, this is exactly what I think myself.  As a Catholic guy who have sometimes his moments of doubts, the Shroud is like a good insurance for my faith, just like the life of some saints (like Ste. Therese of Lisieux), the story of some apparitions (like the Marian apparitions to Bernadette in Lourdes) or the story of some great signs (like the Eucharistic miracle of Lanciano) are also good insurance for my faith.  \nI think that’s the greatest message the Shroud can give us :  You can trust the validity of the gospel accounts and you can be sure that those who wrote them were HONEST !!!  They wrote what they considered as THE TRUTH.  I personally found a very good insurance for my faith in this message !!!\nI think, as a Jew, Barrie has understand this piece of cloth better than many Christians (if not most) !!!  Keep on your good work M. Schwortz !!!\n\n","date":"April 22, 2012 at 9:47 pm","url":"https://shroudstory.com/2012/04/21/rosetta-correa-interviews-barrie-schwortz/","cat":"news_&_views","id":"comment-10727","author":"Yannick Clément","site":"shroudstory"},{"title":"Rosetta Correa interviews Barrie Schwortz","post":"\nBarrie Schwortz :Actually, the statement about my age is correct. I examined the Shroud as part of the STURP team at age 32, but did not confront my own faith until I was forced to do so 18 years later, at the age 50, so I could answer the questions honestly.\nI picked up on this, it was in 1996 that you finally realized from the studies by Adler why the blood had kept it’s reddish colour, a topic being discussed/argued on another thread here by the way. It was the last straw that brought you finally to believing in the Shroud’s authenticity.\nBarrie you’ve aged graciously and we expect to see and hear more from you for many years still to come. We all owe you gratitiude for your years of work, your great website and most importantly, your honesty.\nThanks.\nRon\n\n","date":"April 23, 2012 at 2:01 am","url":"https://shroudstory.com/2012/04/21/rosetta-correa-interviews-barrie-schwortz/","cat":"news_&_views","id":"comment-10729","author":"Ron","site":"shroudstory"},{"title":"Rosetta Correa interviews Barrie Schwortz","post":"If the overall evidence points to the Shroud being the actual burial cloth of Jesus.  What prevents Barry from fulfilling what God has given us through Salvation History to become Catholic?\n\n","date":"May 25, 2012 at 10:38 am","url":"https://shroudstory.com/2012/04/21/rosetta-correa-interviews-barrie-schwortz/","cat":"news_&_views","id":"comment-11591","author":"KJ Boyd","site":"shroudstory"},{"title":"Rosetta Correa interviews Barrie Schwortz","post":"Why Catholic? Why not Episcopalian?\n\n","date":"May 25, 2012 at 1:34 pm","url":"https://shroudstory.com/2012/04/21/rosetta-correa-interviews-barrie-schwortz/","cat":"news_&_views","id":"comment-11596","author":"Dan","site":"shroudstory"},{"title":"Rosetta Correa interviews Barrie Schwortz","post":"From the perspective of someone who believe the Shroud is authentic, there’s 2 very different way that this person can understand this cloth :  \n1- This person can think that the Shroud is the authentic burial shroud of Jesus of Nazareth (the Jesus of history who was a Jew who lived during the first part of the 1st century) or\n2- This person can think that the Shroud is the authentic burial shroud of Jesus-Christ, the Son of God (some of these persons will even see some physical proofs of the resurrection on the cloth, while the others, like me, will only see some signs of that event, which is something totally different)\nI know Barrie well enough now to know that his personal opinion fits perfectly with the first description, not with the second.  In other words, Barrie don’t see a proof or even a sign of the resurrection of Christ on this cloth, but nevertheless, he believe that this is a real burial shroud and, mainly because of the injuries due to a cap of thorns, he also believe that it cannot belong to someone else than Jesus of Nazareth (the Jesus of History).  And that’s why he’s still a Jew and not a Christian !  \nAnd you know what ?  He’s not alone like that and it’s all right that way !  I don’t think Jesus would want to force anyone to believe in him !  In fact, if you read the Gospels carefully, it’s evident that it’s true.  Jesus never forced anybody to believe in him or his Father and that’s precisely why I truly believe he is God !  \nGod is Love and when your name is Love, you just have an infinite respect for the liberty of the ones you love, namely your children !!!  If Barrie never convert on Earth, that’s no big deal.  You can be sure that he will on the other side when he’ll be face to face with Christ !!! ;-)\n\n","date":"May 25, 2012 at 3:35 pm","url":"https://shroudstory.com/2012/04/21/rosetta-correa-interviews-barrie-schwortz/","cat":"news_&_views","id":"comment-11598","author":"Yannick Clément","site":"shroudstory"},{"title":"Rosetta Correa interviews Barrie Schwortz","post":"\nDan :Why Catholic? Why not Episcopalian?\nCatholic is easier too pronounce ;-)\nR\n\n","date":"May 25, 2012 at 5:58 pm","url":"https://shroudstory.com/2012/04/21/rosetta-correa-interviews-barrie-schwortz/","cat":"news_&_views","id":"comment-11604","author":"Ron","site":"shroudstory"}]
