[{"title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site","post":"Where is the link between OBE/NDE and the Turin Shroud?\n\n","date":"January 12, 2014 at 9:07 am","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","id":"comment-73158","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site","post":"There is no connection except in the faith journeys of some of us. Some look to the shroud for reassurances about their beliefs in the incarnation and the resurrection. Some people, frequently fundamentalist Protestants, find that deplorable. Others look to NDE/ODE experiences for similar reassurances. And, of course, some find that deplorable even as NDE books are becoming a best selling genre. \nI find neither subject positively reassuring or deplorable for my faith journey. Both are interesting. I knew a Catholic priest who would go on and on about the faith inspiring value of the shroud; but mention NDEs and he almost foamed at the mouth calling the subject heresy. A good friend of his, a devout Presbyterian minister, felt just the opposite. In the two subjects they found common ground and they loved to argue about both subjects. They are subjects that many scientists claim are scientific while numerous other scientists claim otherwise. \nThat is the best I can do.\n\n","date":"January 12, 2014 at 10:29 am","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","id":"comment-73160","author":"Dan","site":"shroudstory"},{"title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site","post":"That’s right, Dan, you have correctly pointed out that there is variety both in faith journeys and in what scientists are saying, which is what makes leaping to conclusions incorrect. The battle between Descartes and Spinoza is still raging, neuroscientists have made reasonable progress, they have provided signs but no hard evidence and have left yawning gaps to fill and so we have to be patient.\nMost of this is spurred by the quest for human survival and no one thinks about other living matter. What about animals, what about plants? It was sufficient food for thought for Albert Schweitzer and I think Dr. Alan Adler had this in mind when he said that “nothing lasts forever”. Did not Pope John II refer to the “mystery of life and death” during one Shroud exposition?\nRight now, therefore, let us concentrate on images, which is not only something more interesting but also more palpable for us in the field of Shroud studies. We have to determine what is psychic, what is natural, what is unnatural, what is spiritual. Little has been said about the imprints Padre Pio left on handkerchiefs. The phenomenon is mentioned by Prof. Giulio Fanti, who says that around two hundred of these kerchiefs are extant in one of his Shroud books. The link below makes mention of this and has a clear photograph of the imprint on the handkerchief: \nhttp://motheofgod.com/threads/the-shroud-of-padre-pio.4501/\nThat the priest Agostino Gemelli, also a physician and psychologist, once President of the Pontifical Academy of Science, was quite hasty in judging him becomes evident when one considers that the monk was canonised. He was known to have had as many as forty “gifts”, including bilocation.\n\n","date":"January 12, 2014 at 12:11 pm","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","id":"comment-73162","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site","post":"Hi Dan. Thanks for letting your readers know that Barrie’s TEDx talk is posted on NHNE Pulse. For the record, while NHNE Pulse does spend a lot of time covering near-death experiences, we also cover many of other topics as well. But I will stick with NDEs here. If you, or any of your readers are on the fence about NDEs; if you are not sure if they are legitimate spiritual experiences or simply products of malfunctioning brains, I encourage you to check out this outstanding presentation by Dr. Bruce Greyson, who is Professor of Psychiatry at the University of Virginia. He gave this tour de force talk in 2011 to an audience in India: \n \nYou readers may also be interested in these resources:\nNDEs Absolutely, Positively NOT Caused By Malfunctioning Brains\nhttp://nhne-pulse.org/ndes-absolutely-positively-not-caused-by-malfunctioning-brains/\nHow Near-Death Experiences Are Changing The World\nhttp://msv-nhne.org/how-near-death-experiences-are-changing-the-world/\nNDE Stories\nhttp://ndestories.org/stories/\nExtraordinary Human Capabilities\nhttp://nhne-pulse.org/extraordinary-human-capabilities/\nMagic is everywhere!\nFinally, thank you for this fantastic blog. The Shroud, as you well know, is one of humankind’s most remarkable historical artifacts. I’m grateful for the work you are doing to keep those who are interested well informed.\n\n","date":"January 12, 2014 at 2:39 pm","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","id":"comment-73166","author":"David Sunfellow","site":"shroudstory"},{"title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site","post":"Hi Dan. Thanks for letting your readers know that Barrie’s TEDx talk is posted on NHNE Pulse. For the record, while NHNE Pulse does spend a lot of time covering near-death experiences, we also cover many of other topics as well. But I will stick with NDEs here. If you, or any of your readers are on the fence about NDEs; if you are not sure if they are legitimate spiritual experiences or simply products of malfunctioning brains, I encourage you to check out this outstanding presentation by Dr. Bruce Greyson, who is Professor of Psychiatry at the University of Virginia. He gave this tour de force talk in 2011 to an audience in India:\n\nYou readers may also be interested in these resources:\nNDEs Absolutely, Positively NOT Caused By Malfunctioning Brains\nhttp://nhne-pulse.org/ndes-absolutely-positively-not-caused-by-malfunctioning-brains/\nHow Near-Death Experiences Are Changing The World\nhttp://msv-nhne.org/how-near-death-experiences-are-changing-the-world/\nNDE Stories\nhttp://ndestories.org/stories/\nExtraordinary Human Capabilities\nhttp://nhne-pulse.org/extraordinary-human-capabilities/\nMagic is everywhere!\nFinally, thank you for this fantastic blog. The Shroud, as you well know, is one of humankind’s most remarkable historical artifacts. I’m grateful for the work you are doing to keep those who are interested well informed.\n\n","date":"January 12, 2014 at 2:41 pm","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","id":"comment-73167","author":"David Sunfellow","site":"shroudstory"},{"title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site","post":"There still seems to be no direct link to Shroud studies and I would go further, pick one topic, and ask what relevance Dr. Bruce Greyson’s talk in India, more to do with reincarnation, has to the Shroud? Why was India chosen? Was it because of the Hindu belief in reincarnation? How would it be accepted in the US? The University of Virginia is the institution where Professor Ian Stevenson taught and he was known for theories in favour of reincarnation. He was challenged on several occasions by the highly respected Professor C.T. K. Chari of Madras Christian College, India, whose papers were published in the Journal of the Society for Psychical Research, London. In fact, many years one prominent Shroud scholar made it a point to verify Stevenson’s research and found it doubtful.\n\n","date":"January 12, 2014 at 4:28 pm","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","id":"comment-73170","author":"Louis","site":"shroudstory"},{"title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site","post":"What relevance do Shroud studies have to Dr. Bruce Greyson’s talk? And near-death experiences? And reincarnation stories? And… Here’s the relevance for me:\nIf you examine these topics closely enough, I believe you discover universal truths that underpin all life. For example, if you study the core truths that underpin near-death experiences from around the world, you discover that they are in surprising alignment with the core truths presented by Jesus in sources that pre-date Christianity (in the Sayings Gospel Q, for example). This is remarkable, I think. In essence, you’ve got a fellow who lived two thousand years ago who said and did things that changed the course of human history in very dramatic ways. But what, exactly, did he say and do? And is any of it relevant to us today? Does it still have the power to change lives? Produce miracles? Lift people into higher states of consciousness? \nNear-death experiences are full of stories of changed lives, miraculous healings, and people encountering the kind of unconditionally loving God that Jesus spoke about two thousand years ago. After decades of research, I’m convinced that Jesus tapped into the same Reality than near-death experiencers are tapping into today. I’m also convinced that the life, teachings, death, and possible resurrection of Jesus continue to have important things to add to the discussion. Because near-death experiences are a current and unfolding phenomenon, there are many ways to learn more about them. But how can we learn more about Jesus? And then compare his teachings and experience to NDEs and related phenomenon? Modern Biblical scholarship has provided a lot of insight into who Jesus was — and wasn’t. If the Shroud is authentic, it could add to (and correct) the other historical records we have. For example, the man pictured on the shroud was crucified, but the nails were not driven through his palms. Instead, they were driven through his wrists. There are also blood stains on the Shroud. As science progresses, there may be ways to extract all kinds of interesting information from this. And then there is the way that the image on the Shroud was burned into the fabric that suggests something very, very unusual took place. Is this proof that Jesus resurrected? And if so, is this an experience that is possible for the rest of humankind?\nAnd, no, this line of reasoning is not as far fetched as it seems. Right now, all over the world, people are experiencing the kind of events that fill the pages of the New Testament. And that includes people rising from the dead, complete with doctors scratching their heads and reams of medical records to verify the impossible has, indeed, happened. A good case in point is near-death experiencer Anita Moorjani:\nhttp://ndestories.org/anita-moorjani/\nYou can find other stories, many of which include miraculous healings, posted here:\nhttp://ndestories.org/\nHaving a physical artifact that is linked to Jesus that can add and/or clarify important parts of his story, gives us more of an ability to understand what the guy actually said and did, as well as what happened to him. And I, for one, am extremely interested in knowing all about this. As more people make the connection between modern day near-death experiences and the life and teachings of Jesus, I think they will be interested too. Ditto for research that is being done with past life experiences, miracles and spontaneous healings, angelic appearances, and the like. All of these things shed light on who we are, why we are here, and where we are headed…\n\n","date":"January 12, 2014 at 5:23 pm","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","id":"comment-73174","author":"David Sunfellow","site":"shroudstory"},{"title":"Barrie Schwortz’ TEDx Talk Featured on NDE Site","post":"The objections raised in # 5 have not been answered and this topic can be discussed for hours and we will get nowhere. What I said in # 3 is that neuroscientists have made reasonable progress but have yet to present hard evidence, so one can image how tough it is even for highly qualified professional scientists like the Portuguese-born Professor Antonio Damasio (University of Iowa). What, then, can be said about the links provided? Is this science? No one can present this to serious scientists and not expect to be laughed out of court. There is still a lot to be learnt about the nature of mind, consciousness and the structure of the universe. We know very little about ontological reality and blogs and sites that appear to appeal to the esoteric seem to lead to a world of make believe, a world to make everyone feel nice.\nReincarnation is not compatible with a good God, that is why Hinduism has at least some eighty schools of interpretation, with little agreement between them. God can be “He”, “She”, “It”, it can be an endless cycle trying to get out of the karmic ladder, more in keeping with Camus’ Myth of Sisyphus. The contradictions are numerous. It has to be noted that reincarnationists are always talking about karma, about climbing the karmic ladder, but always in the next reincarnation, very rarely in the present one. A clear example?\nThe Indian vice-consul arrested in New York was clearly exploiting the servant she brought from India. Why? Because the servant came from a lower caste, the suffering is her karma, that his her problem. The vice-consul, apparently from a higher caste, was worried about her material comfort, doing little to get out of the wheel of Karma. Why be surprised about what Freud wrote about human nature? Better, Jesus said, “Where is your treasure there is your heart also.”  \nIt happens in Christendom also. Let us take a clear example from there, although the object is a revered figure. Thomas Jefferson was wealthy, with 602 slaves in his backyard and minors working as “trainees” in his nail factory. He had plenty of time to cut the Gospels into pieces, selecting only those passages that were convenient to his lifestyle. With a desktop he would be much more faster, there would be no need for scissors and glue. Cardinal Avery Dulles wrote that he was a “Christian deist”! What sort of apologia was this?\nThere can be no doubt that NHNE’s intentions are very good, but the aims are not relevant to Shroud studies. They can help those whose faith is weak, there are gaps to be filled and these undermine faith. That is because Jesus spoke to us about our lives, he didn’t say anything about the universe that is presented to us. If, as it is said, the universe is indifferent, it can also be stated that Jesus was indifferent to it. You learn that in the Gospels. Jesus demanded absolute faith.\n\n","date":"January 12, 2014 at 7:43 pm","url":"https://shroudstory.com/2014/01/12/barrie-schwortz-tedx-talk-featured-on-nde-site/","cat":"other_blogs","id":"comment-73181","author":"Louis","site":"shroudstory"}]
