[{"id":"comment-12019","author":"mr_moose","post":"David Mo, thanks for uploading all these interesting paintings. This one definitely shows some striking similarities with the PM and I agree that they certainly had some kind of common model. Notice for example how the shroud continues over Josef’s right shoulder in both cases, in the PM however it goes on behind his neck and proceeds all the way to John. We have the same kind of folds under Jesus head in both paintings where it is apparent that the shroud is being rolled up in the PM and therefore more narrow as it continues to John (?) who also participate in the ceremony by holding the shroud in his left hand. However, this seems to fit Jesus placement relative to the burial shroud according to the Turin Shroud (with head at cloth center) perfectly well. Maybe too well considering all the other similar features? So while there are many striking similarities due to a common way of depicting the anointment scene, the PM seems to abandon the template exactly where the Turin Shroud Jesus and cloth differ. And I think that makes all the difference..","date":"2012-06-06","mins":"8:31 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"},{"id":"comment-12486","author":"mr_moose","post":"What I had in mind was certain traditions in depicting these scenes of the PM (Pray manuscript) rather than a single common painting. I certainly don´t think it´s impossible to interpret the distinct line at Jesus shoulder as a division into two different cloths. But the same kind of sharp edged lines are occurring in the middle of what you consider to be a single piece of cloth? So I still think it´s plausible to imagine the continuation of the cloth Jesus is lying upon over Josef’s shoulder given the artist’s way of depicting fold marks. Now given a certain tradition of depicting the shroud resting over a participants shoulder, a tradition the artist certainly knew, don’t you think this comparison give any weight to the claim that we only have one shroud in the upper scene (instead of two or more)?.","date":"2012-06-14","mins":"5:19 pm","url":"https://shroudstory.com/2012/06/04/on-christ-naked-in-medieval-art-and-empty-vessels/","cat":"art","title":"On Christ Naked in Medieval Art and “Empty Vessels”"}]
