[{"id":"comment-12715","author":"mr_moose","post":"The most interesting link between this finding and the Shroud of Turin got to be the relationship between Mary and Elizabeth, the mother of John. A DNA test is supposed to indicate this..","date":"2012-06-19","mins":"1:57 pm","url":"https://shroudstory.com/2012/06/17/john-the-baptist-relics/","cat":"history","title":"John the Baptist Relics?"},{"id":"comment-17901","author":"mr_moose","post":"When considering alternative explanations for the image which not include the historical Jesus and taking into account the only constraint that a crucified body (with the same bloodmarks as Jesus) at some time must have been placed in the shroud, I can think of other possibilities that would fit somewhere between your first two points: In the year 715 when Suleiman had risen to the caliphate he started to prepare a massive attack on the city of Constantinople. The Muslim chronicler al Tabari tells us about the confrontations that took place while the Muslims tried to make their way through the land between the Byzantine and Umayyad empires: “The inhabitants of the city were filled with terror the likes of which they had never experienced before. All they saw were Muslims in their midst screaming ‘Allahu Akbar!’ Allah planted terror in their hearts…. The men were crucified over the course of 24 km.” I don’t think this scenario really fits your second point which addresses “an accidental resemblance with the Jesus of the Gospels”. The resemblance would be a main goal in the case of martyrs on the other hand. But your second point could of course easily be extended to include this situation as well (or your first point depending on how you stress the word “forger”). Nevertheless, I think the scenario is interesting. It explains how crucifixions at certain times and areas despite the influence of Christian culture and law and scenarios like this could give us a lot of corpses with exactly the same blood patterns we find in the case of Jesus which of course raises the possibility of surviving burial shrouds. And if you prefer some place over another; pick your choice: Jerusalem, Spain, Turkey. Christians have been persecuted in many places for being Christians..","date":"2012-10-19","mins":"9:34 pm","url":"https://shroudstory.com/2012/10/19/the-central-dilemma-of-the-shroud/","cat":"history","title":"The Central Dilemma of the Shroud?"}]
