[{"id":"comment-6683","author":"mr_moose","post":"DNA test on pollen? It´s at least possible (2005) to retrieve a DNA from sediment fossil pollen as old as 10000 years: http://www.anst.uu.se/lapar168/Projects files/Parducci%20et%20al%202005.pdf And you can find numerous other similar papers. The question is how good it works for pollen in the same condition as the Turin shroud pollen. Promising reading on p. 2: “The outer walls of pollen grains are extremely resistant to chemical and physical attack” If it´s possible to analyze DNA segments from pollen it would then be possible, I guess, to classify pollen down to species level which would be interesting in the case of the Turin shroud. And it´s possible to radiocarbon date pollen as well. That’s a quit interesting potential combination of place and time determination. And even place and time determination over the shrouds history considering pollen attached at different times and locations. The risk is of course that we lose materials which in the future could help us understand the shroud in even greater extent..","date":"2012-01-08","mins":"4:22 pm","url":"https://shroudstory.com/2012/01/07/bill-meacham-responds-to-gabriel-on-using-trace-elements-to-determine-geographic-origen-of-the-shroud-of-turin/","cat":"news_&_views","title":"Bill Meacham responds to Gabriel on using trace elements to determine geographic origin of the Shroud of Turin"},{"id":"comment-6978","author":"mr_moose","post":"Thank you for the quotation Yannick, found it fascinating. And I have never heard about these types of tests before. It always strikes me when I consider the shroud from a scientific perspective how many possibilities there should be out there, 2012, to reach some very conclusive results regarding place, time and authenticity. There is so much “stuff” to analyze. At the same time there seems to be so much ambiguity present, like the interesting contact formation of the blood hypothesis you mentioned for example with all its accompanied complications. Not to talk about what the restoration caused. A link between the Shroud and the Sudarium of Oviedo would really be beneficial. Maybe pollen (introduced again) can play a role here. If I had more time over I would have done some more detailed research in this area and not only present speculative ideas..","date":"2012-01-14","mins":"9:04 pm","url":"https://shroudstory.com/2012/01/07/bill-meacham-responds-to-gabriel-on-using-trace-elements-to-determine-geographic-origen-of-the-shroud-of-turin/","cat":"news_&_views","title":"Bill Meacham responds to Gabriel on using trace elements to determine geographic origin of the Shroud of Turin"},{"id":"comment-6742","author":"mr_moose","post":"Shroud pollen determined to young age wouldn’t prove anything I agree, though it would put the shroud in general, and Max Frei in particular, into some doubts if for example the Jerusalem originated pollen (species now established through DNA) only could be traced back a couple of decays or if none could be traced back any longer than some centuries. But I think you have a point that we after all would have been left with just speculations. It would certainly be harder though to explain away Jerusalem pollen dated to around Jesus lifetime. Regarding the amount of pollen needed: one pollen grain is actually enough. One grain = many atoms! Regarding Bollone: With age I guess you mean 33 A.D. And not 33 years old? (Even if that would be interesting information as well). Never heard of Baima Bollone before, I´m kind of new to this subject. If he´s talking about DNA it´s probably related to what we know of human mutation patterns and rates. Something I know very little about, I´m more into physics. My guess though would be that the greatest challenge concerning DNA test of the blood would be too separate the DNA components in first place from DNA belonging to other persons. But other fields, for example those related to criminal investigations, would certainly have a great interest in this particular question and I´m certain that methods will be developed in the future. How far we will reach are of course only speculations..","date":"2012-01-09","mins":"8:04 pm","url":"https://shroudstory.com/2012/01/07/bill-meacham-responds-to-gabriel-on-using-trace-elements-to-determine-geographic-origen-of-the-shroud-of-turin/","cat":"news_&_views","title":"Bill Meacham responds to Gabriel on using trace elements to determine geographic origin of the Shroud of Turin"}]
