[{"title":"A Collection of Ray Rogers Quotations","post":"What a magnificent collection. Thank you, Yannick.\nHowever.\nIsn’t there always a however? Fanti, Botella et al.’s paper ‘Superficiaity,’ quoting Jumper, specifically mentions: “the linen fibers seen on the body-image tapes are shorter and more fractured than those from nonimage areas.” This suggests that the material of the cloth itself, not just the ‘impurity layer’ was affected by the image forming mechanism.\n\n","date":"January 1, 2013 at 7:57 am","url":"https://shroudstory.com/2013/01/01/a-collection-of-ray-rogers-quotations/","cat":"uncategorized","id":"comment-21418","author":"Hugh Farey","site":"shroudstory"},{"title":"A Collection of Ray Rogers Quotations","post":"Concerning the fractured aspect of the image fibers, Rogers had a different interpretation… Here’s the relevant quote (found in my paper) in which he explain his point of view about that: “Quote #61- Dehydration causes shrinkage; therefore, any coating of carbohydrate impurities would “craze” during dehydration. Such a crazed coating would be easy to pull off with adhesive, explaining the easy removal of tapes from image areas.”\nAs you can see (and as I realized more and more following what goes on in the Shroud world), in science, what is the most important thing is not necessarily the data itself but, very often, it is much more the INTERPRETATION you do of that particular data!!!!  And on this question, many different point of views can exist for one single data.  That’s why I often prefer to put my trust in Rogers’ judgment because I know how good, unbiased and profesionnal a scientist he was. Don’t forget that, since the STURP days, he changed his mind a lot of time when some new data or observation came in his way.  For me, that’s a very good sign of integrity.  That proved that Rogers was really following the scientific method properly while only going in the direction indicated by all the facts taken as a whole and not in the direction he first thought.\n\n","date":"January 1, 2013 at 8:38 pm","url":"https://shroudstory.com/2013/01/01/a-collection-of-ray-rogers-quotations/","cat":"uncategorized","id":"comment-21444","author":"Yannick Clément","site":"shroudstory"},{"title":"A Collection of Ray Rogers Quotations","post":"This is an interesting point.\nThe aging and mechanical properties of the flax fibers may be directly influenced by the integrity of the pcw.\nThe reacting/impurity layer may be thicker/deeper at dislocations.\n\n","date":"January 1, 2013 at 8:27 am","url":"https://shroudstory.com/2013/01/01/a-collection-of-ray-rogers-quotations/","cat":"uncategorized","id":"comment-21419","author":"anoxie","site":"shroudstory"},{"title":"A Collection of Ray Rogers Quotations","post":"Well done, Yannick!  An impressive work of dedication, an extremely useful and readily accessible collection.  My congratulations.  I’ll look forward to reading through it.\n\n","date":"January 1, 2013 at 3:30 pm","url":"https://shroudstory.com/2013/01/01/a-collection-of-ray-rogers-quotations/","cat":"uncategorized","id":"comment-21431","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Collection of Ray Rogers Quotations","post":"Thanks to Hugh and Daveb for the positive comment.  \nHere’s an important comment for all of you: This morning, I found out one more interesting quote from Ray Rogers and decided to add it in my paper and I just sent this updated version of my paper to Dan a few hours ago.  So, I hope Dan can do the switch rapidly with my new version.\nWhile we wait for that, here’s this new quote that speak loud versus the fact that, for Rogers, the primary cell wall of the linen fiber on the Shroud was not a relevant option for the chromophore: “An average flax fiber is 10-20 um in diameter, and some lower fibers are colored in image areas. Any radiation that colored the circumference of two, superimposed fibers would have to penetrate at least 20 40 um of cellulose. Radiation that penetrated the entire 10-20-um-diameter of a fiber would certainly affect the entire volume of the fiber, including the walls of the medulla (the cylindrical void in the center of the fiber). All image fibers (from the Shroud) show color on their outer surfaces, but the body of the fiber and the walls of the medulla are not colored.”\nThe last phrase is truly important.  It is one of the most precise description of Rogers’ opinion concerning the chromophore of the image.  I’m sorry for all the defenders of the primary cell wall hypothesis (Fanti, Di Lazzaro, etc.) but this new quote of Rogers made it clear that, in his mind, the whole body of the fiber (that certainly includes the primary cell wall!) never was affected and colored during the image-formation process.  Of course, that doesn’t necessarily means that Rogers was right about that, but you know what?  I don’t see any good reason right now to doubt his professional opinion on that question.  Until new data could prove he was wrong, I think it’s fair to consider the chromophore of the image as being most probably a thin layer of carbohydrate impurities.  \nRogers’ arguments are very strong because he considered all the data and observations available without lefting one aside. Also, we have to consider that, unlike almost every modern Shroud researchers, Rogers was able to see and analyzed the image directly in Turin in 1978.  This is not banal…\n\n","date":"January 1, 2013 at 8:13 pm","url":"https://shroudstory.com/2013/01/01/a-collection-of-ray-rogers-quotations/","cat":"uncategorized","id":"comment-21443","author":"Yannick Clément","site":"shroudstory"},{"title":"A Collection of Ray Rogers Quotations","post":"So try to duplicate it.  Lets see you make a duplicate.  Come on  man your a man of science. So duplicate one?\n\n","date":"January 31, 2013 at 4:36 pm","url":"https://shroudstory.com/2013/01/01/a-collection-of-ray-rogers-quotations/","cat":"uncategorized","id":"comment-23107","author":"Mark Reza","site":"shroudstory"}]
