[{"title":"Consider Rogers","post":"Dave G,\nWhat you say has some merit, but there is also the danger of a “fool’s errand” signifying a waste of time. Whatever Colin’s credentials, and they may be impressive in his field, he is apparently using makeshift apparatus. Does he actually work in his kitchen? I thought I saw that once. John Brown worked in his dinning room, but he had one his advanced microscopes there.\nRay Rogers did not rely on his expertise and devices which far exceed what Colin has at his disposal. Moreover, he didn’t rely on his own findings and sought verification from others including John Brown and Robert Villarreal. Brown was a retired Principal Research Scientist at Georgia Tech Research Institute who had his own Scanning Electronic Microscope at his home. He reproduced pictures of fibers from the Raes patch at 3650X and 3300X magnification. You can look at them yourself, at this very instant. http://www.shroud.com/pdfs/brown1.pdf\nRobert(o) Villarreal reported on his results twice: once at the 2008 Ohio Conference http://www.ohioshroudconference.com/a17.htm and again at the 2012 Valencia Conference http://www.shroud.com/pdfs/villarrealvtxt.pdf\nVillarreal was consulted by Rogers shortly before he died and he was given a sample thread by Rogers. But before he could any test Rogers passed away. He asked Roger’s wife Joan what he should do and she said she was too distraught to deal with it. He heard nothing more  until contacted by Barrie Schwortz who was de facto Rogers’ scientific executor. Barrie delivered to Villarreal, among other things, a sample thread from the carbon sample area which held back by Riggi and Gonella.\nThe thread samples Virreal  then  had were examined by:\n1. X-ray Photoelectron Spectroscopy\n2. Tube Excited and Radioactive Source Micro-spot Energy Dispersive X-Ray Fluorescence\n(MXRF) Spectrometry\n3. High and Low Powered Magnification with a High Resolution Photo-Microscope\n4. Fourier Transform Infra-Red Spectroscopy (FTIR) with Reflectance Mode Capability\n5. Time-of-Flight Secondary Ion Mass Spectrometer (TOF-SIMS)\nIn each one of those tests he was assisted by scientists from Los Alamos,\nBerry says “forget STURP, forget Rogers” on no other basis then his skepticism. He has never had in his possession a sample of any kind from the actual Shroud as Rogers, Brown, Villarreal and Schwortz did.\nPeople like to cite Occam’s Razor for various propositions, none of which actually originated with William of Okkam. Let me put it this way. Fraud and Falsehood are usually more complex than the truth. Unless you have grounds to believe that Ray Rogers, Sue Benford, Joe Marino, John Brown,. Robert Villarreal and Barrie Schwortz  were participating in a fraud that scanned 14 years (from Orvieto to Valencia) you have no basis to ignore their results as Berry does.\nFrankly, I am reminded of Christ’s retort to Mary and Joseph when as a boy, he had abandoned them to discuss scripture with the elders of the Temple: “Do you not know I must be about my father’s business.” His Father is also our Father. In studying the shroud, we are about His business. We can not, as I am once again, allow Berry to distract us from His business with a whistling tea pot. There is too much real science to do. \nI will not respond to Colin should he comment. I must be about the Father’s business which in my case includes finishing my manuscript.\n\n","date":"November 2, 2013 at 6:02 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49547","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"That is one great rant, John, by far and away the best I have seen all day (thus far). I especially like the final paragraph.Do you acquire a halo when you return to the Father’s business. Does it imprint images on nearby soft-furnishings?\nBack here on planet earth, I’m still at home, with a very basic microscope. But wasn’t that how Rogers did his work for his 2005 Thermochemica Acta paper – at his home, being retired, like me, with some threads (non-image threads) though admittedly, one suspects, with a superior microscope?\nHe was an explosives expert you know, applying thermochemical methods to judge their shelf life and safety. I’d have been very wary about taking him on where his own specialty is concerned. If only for that reason, I’d have asked why, when wishing to discount the scorch theory, he resorted to physiological evidence based on 4-hydroxyproline in blood (criticism of which I have voiced on numerous previous occasions). You see John, while I claim to have no specialist skills of direct relevance to the Shroud, I did spend most of my career in and around medical schools and hospitals and plant-based research laboratories, so my ears prick up as soon as a thermochemist quickly exhausts his thermochemical armoury and has to resort to a physiological argument – and a highly contentious one in my view – to discount a heat scorch. And let’s not forget that STURP no less was at pains in its short Summary to state that the Shroud image bore close resemblance to the kind of chemical change (carbohydrate dehydration – not a Maillard reaction in sight) produced by  by heat or acid – a scorch in all but name.\nYes, Ray Rogers and I would have a lot to talk about if he were still here, but I would have wished those chats had been in 1988 before he went down the Maillard reaction route. If already on that path, I’d have wasted no time in getting him to check out nitrogen distribution in image v non-image areas, a point I made earlier this morning on a different thread, and to ask whether he really thought that starch impurities could provide enough “reducing sugar” (intact starch having scarcely any reducing properties).\nAs for dogma, or lack thereof, I report all my findings, AND thoughts, in real time, which means I can say things I later regret, like suggesting as I did here two days ago that the nodes of linen are the favoured pyrolysis zone, or that amorphous cellulose is the target molecule (yes, my session yesterday with the microscope is causing me to have second thoughts through imagining that my harshest critic is looking at the same fields as me, questioning my observation and objectivity). \nMaybe you aren’t aware that I describe my interest in the Shroud as a personal journey of discovery, reported in real time as a stream of consciousness, sometimes impaired (it’s called advancing senility). That’s why my project is blog- rather then pdf or conference-based.  If you and others think it’s a personal campaign to attack religious faith, then you are mistaken. I’m only here for the science, good, bad or indifferent, and as a retired science bod I know probably better than you how deceptive research findings can be at first sight, and how one must always be willing to play Devil’s Advocate with one’s own data and interpretation thereof, and to try and do that before the howling mob descends with its charges of pseudo-skepticism, heresy and worse.\nHave a nice day. Don’t stand too close to the wallpaper. ;-)\n\n","date":"November 2, 2013 at 6:52 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49554","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"I think the wise man, Thibault Heimburger, has taken up the challenge regarding the “scorch hypothesis”.\n\n","date":"November 2, 2013 at 6:22 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49551","author":"anoxie","site":"shroudstory"},{"title":"Consider Rogers","post":"I believe you are correct and  I am anxious to see his results when he publishes.\n\n","date":"November 2, 2013 at 6:38 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49552","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"https://shroudofturin.files.wordpress.com/2012/10/scorch-paper-en.pdf\n\n","date":"November 2, 2013 at 6:41 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49553","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"I believe that Heimburger has even more in store for us.\n\n","date":"November 2, 2013 at 9:10 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49573","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"\nO.K. :\nhttps://shroudofturin.files.wordpress.com/2012/10/scorch-paper-en.pdf\n\nOK, but Thibault’s premise that a contact scorch must invariably produce excessive tonal contrast has to be viewed against his somewhat odd choice of template. One might say that a flat sheet of metal with a recessed area (not my idea of a bas-relief) virtually guaranteed an excess of contrast between those two stepped planes. (Sorry, someone had to say it). It would be interesting to see his experiments repeated with something like a medallion with smooth rounded contours that rise up and taper-off progressively from a base plane, and to see how the end-result responds in ImageJ and similar software that gives 3D enhancement.\n\n","date":"November 2, 2013 at 8:10 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49564","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"Collin, one sceptic tried to reproduce Shroud image with the use of bas-relief. My refutatation of his article is here: http://ok.apologetyka.info/racjonalista/caun-turynski-faszerstwo-niedokonane-cz-3,560.htm You can see there end results in ImageJ, compared to the real Shroud face.\n\n","date":"November 2, 2013 at 8:33 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49565","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"You can see there end results in ImageJ, compared to the real Shroud face.\nIllustrations 11 and XXII. Arabic numerals: his illustrations, Roman numerals: mine.\n\n","date":"November 2, 2013 at 8:35 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49566","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"That’s because Rogers was a world class scientist of the highest caliber, even when he thought something was crazy.\n\n","date":"November 2, 2013 at 9:06 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49572","author":"Andy Weiss","site":"shroudstory"},{"title":"Consider Rogers","post":"Forgive my asking, Andy, but how can a thermochemist working on safety aspects of chemical explosives fit that description? Am I not right in thinking that such descriptions attached to PhD-less Mr. Raymond Rogers AFTER he was invited to head STURP’s chemical team, recruited by that eminent scientific body called the Holy Shroud Guild? Had you heard of him before he joined STURP? If so, for what precisely? Do you keep plastic explosives or TNT in your garden shed? Are you afraid they might have exceeded their shelf-life? Are you checking Ray Rogers’ papers online as we speak?\n\n","date":"November 2, 2013 at 9:23 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49575","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"So you are the best scientist we have? Wow!\n\n","date":"November 2, 2013 at 10:25 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49581","author":"Paulette","site":"shroudstory"},{"title":"Consider Rogers","post":"\nO.K. :\nYou can see there end results in ImageJ, compared to the real Shroud face.\nIllustrations 11 and XXII. Arabic numerals: his illustrations, Roman numerals:\nmine.\n\nThanks OK. Three nights in Krakow last year was a amazing experience, but didn’t do much for my Polish, so it’ll take a little time to find what was done. For the moment, all I would say is that a 3D enhancement can only be as good as the starting template and one can only speculate as to how good a template needs to be to produce a Shroud image. Crude bas-relief in metal? Or a facsimile of a real face or person using plaster, or a fuzzier version thereof using, say, Garlaschelli’s powder technique? And who’s to say that centuries of ageing have not improved the final image in a purely aesthetic sense, with softer tonal contrasts etc?\nThe first priority was to show that a 3D-enhancible negative Shroud image can/could be produced in principle, ie. that there are no insurmountable scientific obstacles. I believe that has been already been achieved, if not by the ones you show (though promising) certainly by Garlaschelli, and I’ve produced some passable results myself using simple shallow metal bas -reliefs (horse brasses, trinkets etc). \nI realize that none of this will make the slightest impression on true-believers, but it’s a fact that hot solids do tend to leave a slight impression on linen, one that is a negative image, 3D-enhancible etc etc. OK, so it’s not going to be hung in any art galleries, but there you go. As the jokey signs say: “The impossible I do immediately. Miracles take a little longer.”\n\n","date":"November 2, 2013 at 9:12 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49574","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"\ncolinsberry :\nThanks OK. Three nights in Krakow last year was a amazing experience, but didn’t do much for my Polish, so it’ll take a little time to find what was done.\n\nHe used iron -but didn’t say whether traditional or modern electric -I bet the latter. From pictures 13 and XXIII one can easily see he failed -Thibault Heimburger explains in detail why.\n\ncolinsberry :\nFor the moment, all I would say is that a 3D enhancement can only be as good as the starting template and one can only speculate as to how good a template needs to be to produce a Shroud image.\n\nAnothe difficult problem for an ingenious forger to solve -without using computer modelling of course.\n\ncolinsberry :\n And who’s to say that centuries of ageing have not improved the final image in a purely aesthetic sense, with softer tonal contrasts etc?\nAnd who’s to say exactly oposite, that centuries of ageing have not deteriorated the final image in a purely aesthetic sense, with softer tonal contrasts etc? Tonal contrasts are scalable, and I hardly believe they changed through centuries. The image has faded perhaps, or rather linen has darkened, but tonal contrast in case of bas-relief are rather 0-1, either it was in the contact with the cloth, or no. So all the techniques in general using bas-reliefs would have problems with smooth grayscale.\n\ncolinsberry :\nThe first priority was to show that a 3D-enhancible negative Shroud image can/could be produced in principle, ie. that there are no insurmountable scientific obstacles. I believe that has been already been achieved, if not by the ones you show (though promising) certainly by Garlaschelli, and I’ve produced some passable results myself using simple shallow metal bas -reliefs (horse brasses, trinkets etc).\nI realize that none of this will make the slightest impression on true-believers, but it’s a fact that hot solids do tend to leave a slight impression on linen, one that is a negative image, 3D-enhancible etc etc. OK, so it’s not going to be hung in any art galleries, but there you go. As the jokey signs say: “The impossible I do immediately. Miracles take a little longer.”\n\nIn principle yes, and no serious scholar has ever denied this. But in practice -no. The set of possible parameters for acceptable reproduction of the Shroud image is null set.\n\n","date":"November 2, 2013 at 10:54 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49585","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"Thanks for the detailed response, OK. I’ll give thought to all your points. But I have one major criticism to make of your final sentence, i.e. “The set of possible parameters for acceptable reproduction of the Shroud image is null set.”\nSorry, but there can be no possible scientific basis for that statement. Put another way, you can never know until you try, and until there is an agreed set of scientific criteria that have to be met (excluding other, non-scientific ones like aged appearance, aesthetic appeal etc). Oh, and “null set” is hardly scientific language either ( being simply a set that is empty, a set with no members). What possible relevance can set theory have for reproducing an image, especially when the mechanism that produced the image is unknown? \nIt’s by attempting to reproduce the (main features) of the Shroud image that one may gain an insight into mechanism – so it hardly makes sense to make an a priori declaration that the task is futile, based on misapplied set theory that is in the realm of algebra and logic, not science. \nStop making straitjackets for science – it is science that has freed us from the straitjackets of doctrinal prescriptions and dogma.\n\n","date":"November 2, 2013 at 11:20 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49588","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"\nPaulette :\nSo you are the best scientist we have? Wow!\n\nThere are other scientists who contribute here, Paulette, but I don’t consider myself to be in competition with them, nor with STURP scientists living nor dead. I prefer to discuss the specifics of the science, issue by issue, and even happier if they know I’m a published scientist with research degrees from reputable institutes. But I leave it to others to establish the pecking orders, if that’s what matters to them. It frankly matters not a jot to me. What matters is who can muster the most persuasive argument on the issues.\n Where do you stand on the major scientific issues of Shroudology, Paulette. What would you teach your students if invited to deliver a module on the Shroud’s current status? Would you accept and transmit every word that emanated from Rogers, Adler, Jackson, Fanti, Di Lazzaro etc etc uncritically (despite the differences that exist between them)? Or would you attempt, as I do, to arrive at your own independent judgement, while making no claim to be the best scientist on the site, considering that to be the naffest stance for any individual to adopt on this or any other internet forum, regardless of qualifications?\nNote: it’s others here who are the ones attempting (by proxy) to pull rank of one scientist over another.\n\n","date":"November 2, 2013 at 11:03 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49587","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"Thanks for promoting my comment, Dan. Now look at the mess. ;)\nI believe that to do good science, and good theology, we must always be prepared to question our assumptions (as hard as that can be sometimes). I learned that from a certain teacher from Nazareth.\n\n","date":"November 2, 2013 at 11:40 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49590","author":"David Goulet","site":"shroudstory"},{"title":"Consider Rogers","post":"“Unless you have grounds to believe that Ray Rogers, Sue Benford, Joe Marino, John Brown, Robert Villarreal and Barrie Schwortz were participating in a fraud that spanned 14 years (from Orvieto to Valencia) you have no basis to ignore their results as Berry does.” An interestingly eclectic band of researchers, John, but the statement is not really meaningful. \nThe fact is that the results of all these people (except perhaps Barrie, who has been more of a collector of results than an initiator) have not been ignored by people such as Colin and myself, they have been ignored by all those who have only read their conclusions, rejoiced that they supported authenticity, and then used them as impregnable ‘boxes of authority’ that one would have to be insane or criminal to dispute. Throughout this blog and elsewhere, one or two of us have genuinely studied the results, rather than the conclusions, of the people mentioned, and been unable draw the same conclusions.\nFor example. Rogers found a thread which he thought was spliced, old linen and new cotton. Villarreal found that both sides were cotton. Estimates of the amount of cotton in the radiocarbon samples ranges from 2% to 100%.  Benford and Marino speculated (and quoted confirmation for) a line down the middle of a herring-bone “V,” one side of which was old and one side of which was new. They did not realise that for such a scenario, the radiocarbon dates of the samples would include some that were “pure” patch, which is, of course, not the case. These observations are not conclusions. They are results, and they do not point to a coherent explanation for the shroud.\nIs there one among you (apart from Thibault, who knows this area well) who can explain why the image on the shroud cannot be a scorch? Is there one among you who has actually read Miller & Pellicori’s paper on Ultraviolet Fluorescence? Or the Gilberts, or Accetta & Baumgart, on Reflectance Spectra? What do you make of this observation: “Shroud blood comparisons with known bloodstains show marked differences”? It was made by a “true expert,” or possibly a “Research Scientist” and “independently confirmed” by other “real scientists.”\nNow let’s look at some real results, shall we, from some real experts…\nRobert Villarreal and his team at Los Alamos studied some Raes threads by various instruments, but I cannot find that his results are published anywhere. http://www.shroud.com/pdfs/villarrealvtxt.pdf discusses them, but does not give any results. Fortunately, Dan has put a lecture by Villarreal up on Youtube, and there we can see what he actually discovered.\nOn a slide labelled “Analytical Results in Order of Analysis” we have:\n1) X-ray Photoelectron Spectroscopy\n2) Microphotography\n3) ToF SIMS\n4) FTIR\n5) Assessment of Results\n6) Re-analysis by FTIR\n7) Micro-spot Energy Dispersive X-Ray Fluorescence (MXRF) Spectrometry\nThe first test examined the two ends of a single thread (R1) and found the relative proportions of Carbon, Nitrogen, Oxygen, Silicon and Calcium present. There was a big difference in the proportion of Carbon (Fuzzy end: 70%, Twisted end 80%) and Oxygen (Fuzzy end: 24%, Twisted end 16%), and a small one in the Silicon (Fuzzy end: 3%, Twisted end 2%).\nNext, the ToF SIMS instrument sucked the thread apart into three, two pieces of thread and a linking ‘crust.’ At this point in his lecture Villarreral explains that microphotography was useful for looking at individual fibres, but not at groups of fibres as they are cylindrical, and focussing, which is restricted to a single plane, is difficult. The photo of a single fibre from the fuzzy end that he shows looks like a flax fibre, being not twisted, and showing ‘nodes.’ Note that flax fibres are more or less cylindrical while cotton fibres are flat.\nNow it is not clear next how many fibres or from which ends were individually subjected to ToF SIMS analysis, but Villarreal quotes his expert as follows: “He had a lot of difficulty because when you look at a thread, the thread itself is not conductive, and so it develops space charges; but still, he said, ‘This analysis that we’re looking at looked very much like cotton. I don’t see anything that looks like flax.’ ”\nSome fibres were then sent off for FTIR analysis, as the spectra of different materials are much easier to recognise this way. Most noticeably, linen has a very distinct carbonyl peak which is completely lacking in cotton. Two fibres from each end were studied and they were all clearly cotton. The crust first gave the cotton spectrum, from embedded contamination, and then, at finer resolution, something that was cautiously identified as a terpene-based resin. Subsequently threads R7 and R14 were also identified as cotton by FTIR analysis, possibly contaminated with the resin of the ‘crust.’\nDetermination of the composition of the threads was by means of reference standards of linen and cotton, but they were modern reference standards, not ancient ones, so an attempt was made to find an ancient thread with which to compare them. In an extraordinary part of the lecture, Villarreal says this: “An individual says, I’ve got a thread, and he gave me a whole history of this thread, and we called it the Tama 4 thread, and he said this is probably one of the main shroud fibres. And we looked at it, and it turns out that we don’t know in fact what this Tama 4 purportedly shroud fibre is. It is not a good match for either the cotton or the linen standard. This may be a result of the ageing effect or the material may be something entirely different.” Some provenance! Nevertheless, it is worth looking at the slide entitled FTIR Absorption Data for Tama 4 “Shroud Fibre.” It’s at 4:43 on ‘Shroud of Turin Ohio State University Villarreal Lecture Part 4 of 5.’ Of the spectrum for Tama 4, Villarreal says: “It’s somewhat comparable with cotton, but it doesn’t have the linen characteristic that we would have liked to have seen.” In other words, assuming for a moment that the thread actually was from the main body of the shroud, and therefore linen, it’s spectrum nevertheless makes it look more like cotton, placing in doubt the identification of the cotton from the Raes threads previously analysed.\nVillarreal goes onto to display a sticky tape sample given him by Barrie Schwortz, and admits that he is unable to identify the fibres on it. He then shows another whole thread with a thin metal filament around it, about the same diameter as one of the fibres. Having been told this was a gold-iridium wire used by John Brown in his analysis, it turned out to be pure nickel.\nSample R1 was then subjected to X-Ray Fluorescence, which identifies whereabouts on a sample various elements can be found. Calcium, Iron, Potassium, Phosphorus, Silicon and Sulphur were identified “all through the thread. Why? We don’t know.” There were minor amounts of all sorts of things, “but we did not see any aluminium.” Oddly, the proportion of Silicon to Calcium by this means was determined as about 1 to 40, whereas by the first test (X-ray Photoelectron Spectroscopy), the proportion was about 4 to 1. How odd.\nVillarreal sums up his findings by saying that the threads he was given were definitely cotton and did not contain flax fibres. This is in marked distinction to the findings of Thibault Heimberger, who also examined R7, and declared that there was only 15% cotton in that same thread. Thibault’s expalnation is that by sheer chance Villarreal’s teams only analysed cotton fibres, among the many flax ones that were in fact present, both in R7, R1 and R14. Finally, Villarreal concluded that the samples he analysed were not representative of the main body of the shroud, even though the only, albeit dubious, thread from the shroud he had gave substantially the same results.\nThe confusions, mis-identifications and uncertainties above are what real science is about. As I said at the start, it is not Colin or myself who “ignore results,” it is those who don’t bother to read or make the effort to understand them who really ignore them, clinging desperately to generalised conclusions in the rather vague hope that that the inconsistencies will disappear if you don’t look at hem.\n\n","date":"November 2, 2013 at 12:14 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49596","author":"Hugh Farey","site":"shroudstory"},{"title":"Consider Rogers","post":"\nHugh Farey :\n“\nThe confusions, mis-identifications and uncertainties above are what real science is about. As I said at the start, it is not Colin or myself who “ignore results,” it is those who don’t bother to read or make the effort to understand them who really ignore them, clinging desperately to generalised conclusions in the rather vague hope that that the inconsistencies will disappear if you don’t look at hem.\n\nYes, Hugh I know that you, Collin, Charles Freeman, Andrea Nicolotti, Gian Marco Rinaldi and a few other cunning sceptics, really study in depth all the results, all the papers about the Shroud. For the purpose of looking a whole in the whole, of course. It can always be found in every domain of scientific inquiry. So you can cast doubt on every result that is pro-authenticity:\n*No blood under bloodstain -bad\n*No cotton in the main Shroud -bad\n*3D properties -bad\n*No fluorescence -bad.\n* The fact that 90% crucifixes show right foot on top of the left (exactly opposite to the Shroud, because positive images are mirror ones) -bad.\n* Consistency between Shroud and Sudarium -bad.\n*Statistical Inconsistency of the C-14 results -bad\nAnd so on. Every result that is pro-authenticity is bad becauese Rogers, Jackson, Borwn, Villareal, Piczek, Fullbright, whoever didn’t wrote X or Y in their works. So they were imprecise, so we can doubt their results, because, and call them inconclusive, because IF, IF, IF, IF, IF, IF, IF, IF, IF, IF, assuming that, that, that, that, that, that, that, that, that, that, that, that, that, that, that, that, that, that, that, that and that it can be otherwise, thus the Shroud IS A FAKE.\nThis is the most efficient method of sceptics to deny authenticity of the Shroud. Unfortunately, why are they not so scrutine in case of those who claim the Shroud is not authentic? Because by default the arguments of anti-authenticity are good, while arguments of antiauthenticity is bad.\nOf course such approach is flawed and counterproductive. But no one is an expert in every field, so sometimes it is impossible to counter the sophisticated (but in fact quite absurd) arguments of the sceptics, and we must sometimes simply trust the guys who we believe were real experts in their field, like Rogers, Jackson, Villareal and others.\nA small digresion here 95 % of sceptics are idiots who laugh at the Shroud because they think it is stupid catholic pseudo-relic, 4% of sceptics are crooks who know that their methods of replicating the Shroud don’t make sense, nevertheles they lie outrigh that they do, and only 1 % are smart, cunning sceptics. Similarly 95 % of pro-authenticity are simple believers, who know nothing about the Shroud but simply believe in its authenticity, 4 % know something, but repeats uncritically what they read in the books or see in the movies, and only 1% really understands the arguments for authenticity of the Shroud.\n\n","date":"November 2, 2013 at 2:42 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49608","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"OK, I am familiar with your postings, and read them carefully.  I am inclined to believe that the Shroud is authentic.  However, I do not expect my opinion to be universally held, in spite of evidence I believe to be very supportive of this case.  And I agree with you to an extent; many people who post here will never, EVER be convinced, not even if the Man of the Shroud starts to sit up and sing ABBA’s “Dancing Queen” in the middle of the Turin Cathedral, at 400 decibels and shatters the windows. Because if they did, their entire world view would have to change.  They would have to say “God is real, so I owe Him something and must obey Him.” The atheist is not afraid that there is a God, he is afraid that he is no longer his own god.  So don’t expect to convince anyone that the Shroud once wrapped the Son of God. Never will happen, not on this blog. EVER.\nI am more inclined to believe that, given sufficient evidence, and with continued study, that it can be proved that the SOT once wrapped the historical Jesus of Nazareth.  The only problem is how, by what means, did this unique artifact come into existence? If the SOT did NOT wrap a cadaver, than what?  NOT plaster hot enough to scorch a linen cloth, and not a dead body hot enough to scorch linen-THAT much I am certain of. There are NO such artifacts in existence today, certainly not of the (even disputed) age of the Shroud.  Very few are they who possess the scientific acumen to argue the molecular properties of chemical components found on the Shroud, or the have technical savvy to argue how the 3D properties differ in each equipment used for this study of Sindonology.  But those simple ones, like myself, who follow this blog and read as much as they can on the subject, have more to lose or gain than any academic. We have staked our lives, and anything past our lives, on the deeply held conviction and belief that Jesus is not only real, but that He lives and reigns and will come to bring us unto Himself.\nHaving said that, no artifact can provide proof of the Divine. In the Scriptures, Jesus Himself has but faint praise for those whose tottering faith depends on ‘signs and wonders.’  These things are for spiritual babies and toddlers.   No mature Christian, of any denomination, stakes their faith on an artifact.  If it was somehow made by human hands, this I would truly like to know. But conversely, if this Shroud is a sort of postcard to an age where committed faith is rare, then He willed this for reason, and this I would also like to know.\nAn English poet named Lear wrote a poem called “The Blind Men and the Elephant,” we are all blind men and the Elephant, the Shroud, we many never be able to perceive save through our own pre-conceptions and prejudiced beliefs. But I, for one, will continue to try.\n\n","date":"November 4, 2013 at 10:42 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49898","author":"Josie L. Tyner","site":"shroudstory"},{"title":"Consider Rogers","post":"Josey, surey there is a lot of people as you describe. Their behaviour is exactly the same of the sindonologists. Because they (both) do not study the shroud, they use the shroud to their own ideological pourposes. As for me, if the Shroud is authentic or not, my life or my ideas about God will not change in any manner. But I remember to you that in the XX century the most clever scholars opposed to the authenticity have been almost always catholic priests. This means that this opposition shroudies christians / critics atheists is not true\n\n","date":"November 4, 2013 at 3:29 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49932","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Consider Rogers","post":"Hi OK! I think I’ve lost you somewhere. Or maybe you’ve lost me. You appear to be making a plea for people not to try to understand details if they are likely to cast doubt on their convictions. If the shroud is authentic, then no arguments or evidence can make it a forgery, and if the shroud is a forgery, then no arguments or evidence can make it authentic. At present though, all we have to go on is an inconclusive pile of evidence, some for and some against. There are, I know, a number of extremists who, having made up their mind, don’t really need any evidence, and denounce anybody of the opposite camp as an idiot or a criminal, but there’s really no need. Most of us here find the evidence on both sides very finely balanced. It is often confused and uncertain rather than dogmatic, and the difference between those who try to understand it thoroughly, on either side, can be very small. I think Dan has read and understood everything I have, and I wholly respect his “Is the Shroud real? Probably” as I hope he respects my “Unfortunately probably not.”\nHowever you do make an important point about the proper criticism of anti-authenticist arguments. There’s a reason for that, which is that there are very few such arguments to criticise. The most powerful one, of course, is the radiocarbon paper. I believe I have examined this as thoroughly as I have any other, and although I find Remi val Haelst’s statistical papers very hard going, I was impressed by Riani and Atkinson’s paper, which I think does demonstrate chronological sequence along the radiocarbon sample. Luckily both these last gentlemen are still alive, and were able to reply to the queries I put to them.\nThe only other scientific paper discrediting the shroud is that of Walter McCrone, as published in Microscope and in his book. His results too I have examined thoroughly, and am largely not in agreement with his conclusions, particularly the importance he gives to vermillion as a pigment, which he didn’t even notice until it was pointed out to him by spectroscopists.\nFinally, there are the opinions of numerous art historians, who say the shroud is coherent within the artistic conventions of medieval Europe. Well, I think I’ve must have seen very nearly every crucifix, shroud and dead Jesus painted or sculpted between 0 AD and 1700 AD, every naked, or crossed-handed, or flogged, nailed, thorn-crowned or speared body, within the Byzantine or Romanesque traditions of overtall thin people with long thin fingers, in psalters, altar frontals, statues, brass rubbings and images of every kind, and am not persuaded that these art historians are correct. I don’t think the shroud derives from an artistic culture. Mind you, I’m not convinced that an artistic culture derives from the shroud either, so maybe that cuts both ways.\nDoes that help?\n\n","date":"November 2, 2013 at 3:48 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49624","author":"Hugh Farey","site":"shroudstory"},{"title":"Consider Rogers","post":"At present though, all we have to go on is an inconclusive pile of evidence, some for and some against.\nTruly, it is always the case, not only about the Shroud, but anything. No one has monopoly on absolute knowledge, and every known fact can be disputed. But for what purpose? If one desires so, he can always claim that evidence for the most obvious facts (e.g. Earth is round and orbiting the Sun) is inconclusive. In science, there is never a final word. But there is something like a common sense. The evidence for the Shroud being authentic is quite a solid monolith. But if one wants while studying papers he can always find weak points in any of them. That’s what the cunniest sceptics (including you) do: because Rogers, Benford Jackson or anyone else didn’t write X in his/her paper, thus their conclusions are “inconclusive”. But can you point their mistakes? If so, why not write your own article showing that an expert A is wrong in theses points, here are evidence. Does the US goverment have to prove that 9/11 was not result of its conspiracy? \nMost of us here find the evidence on both sides very finely balanced.\nI don’t find it. I am rather under impression that pro-authenticity evidence overwhelms anti-authenticity arguments (or more often the so called “arguments”). And arguing that the whips on the Shroud are 2 mm too large or too small, or that the eyes of the Man of the Shroud are 2 mm too high or too low, don’t change anything. Under any normal criteria one can say that the Shroud is authentic -but not under philoosphical criteria, for which the absolute Truth doesn’t exist. But the Shroud concerns the One who said that He is the way, and the truth, and the life, so that’s why the evidence must be very finely “balanced”, for obvious reasons.\n\n","date":"November 2, 2013 at 4:14 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49625","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"“But can you point to their mistakes?” Don’t you read my comments at all? I do not claim they have made mistakes. They are mostly good scientists and their experiments are valid. Sometimes they are contradictory, and I sometimes disagree with their conclusions. If so, I explain in exquisite detail why.\n\n","date":"November 2, 2013 at 4:29 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49629","author":"Hugh Farey","site":"shroudstory"},{"title":"Consider Rogers","post":"Finally, there are the opinions of numerous art historians, who say the shroud is coherent within the artistic conventions of medieval Europe. Well, I think I’ve must have seen very nearly every crucifix, shroud and dead Jesus painted or sculpted between 0 AD and 1700 AD, every naked, or crossed-handed, or flogged, nailed, thorn-crowned or speared body, within the Byzantine or Romanesque traditions of overtall thin people with long thin fingers, in psalters, altar frontals, statues, brass rubbings and images of every kind, and am not persuaded that these art historians are correct. I don’t think the shroud derives from an artistic culture. Mind you, I’m not convinced that an artistic culture derives from the shroud either, so maybe that cuts both ways.\nThere are guys like Schafersman and Nickel who like to look for characteristics of Gothic style in the Shroud. And they can find it, I don’t argue. The problem is that they can find characteristics of Romanese, Reneissance, Baroque, Classicism and Art Deco styles, as well as many discrepancies with any of those styles in Shroud. But of course for them the Shroud is medieval forgery so it must be Gothic.\nThe relationship between the Shroud and Christian art for me are quite obvious, and undisputable (and no matter what the art historians who are completely unfamiliar with the Shroud think, if they had overlooked such basic correspondence how one can call them true experts?), even, if not always direct. The problem is what influenced what, whether the Shroud influenced art, or the art influenced the Shroud? The answer is connected to the fact what is easier to reproduce: the Shroud or the works of art?\nEvery child knows that the Jesus was a thin tall man, had a beard and long hair, and looked quite like a hippie. But no one has ever put forward a basic question: how do we know that?\n\n","date":"November 2, 2013 at 4:30 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49631","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"Dear O.K:\n“[…] you, Collin, Charles Freeman, Andrea Nicolotti, Gian Marco Rinald really study in depth all the results, all the papers about the Shroud”\nYes, I do it.\nWhy 99% of shroudies don’t do the same? \n“…cunning sceptics”\nI am not a “sceptic”, I am a researcher and I work according to scientifical method. \n“why are they not so scrutine in case of those who claim the Shroud is not authentic?”\nI think you do not read what I write. But you ought to think about the statistics. Shroudies are hundreds. “Sceptics” are not many. There are hardly any serious researcher. So, obviously, the absurdities usually are pro-authenticity. Because they are the majority.\n“Because by default the arguments of anti-authenticity are good, while arguments of antiauthenticity is bad.”\nThis is what you see in your mind… I am not interested in pro- or against- autheticity, I am interested on truth, on serious researches, on scientifical methodology. Stop. This is my work, it is not a hobby to get a bit of relaxation about the work.\n\n","date":"November 2, 2013 at 4:21 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49627","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Consider Rogers","post":"Dear Andrea:\nI am not a “sceptic”, I am a researcher and I work according to scientifical method.\nI am not interested in pro- or against- autheticity, I am interested on truth, on serious researches, on scientifical methodology. Stop. This is my work, it is not a hobby to get a bit of relaxation about the work.\nAll the sceptics, rationalists, militant atheists etc. claim that. They are only interested on truth, they are using “scientific” methodology, and so on. But if one looks deeper, it always appear that they methodology is entirely flawed, and no matter if they study in depth all the material available -usually only for the purpose to find where is the weak spot there, where to attack? And it is not a problem that most of the absurdities are pro-authenticty, If for 10 000 pro arguments there are maybe 100 wrong or absurd, it is a different thing than that for 100 anti, 99 are wrong or absurd.\nCan you say any argument pro-authenticity of the Shroud? Because I can invent a lot of arguments against its authenticity, even if I am convinced that the Shroud is for “almost” sure genuine.\n\n","date":"November 2, 2013 at 4:42 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49632","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"[about = after\n\n","date":"November 2, 2013 at 4:22 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49628","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Consider Rogers","post":"One is perfectly at liberty, if one so desires, to reject the radiocarbon dating, and to side  with those who claim there are alternative and more reliable methods of dating ancient linen. \nBy the same token, one is also perfectly at liberty in a free country, or here on the internet, to accept the radiocarbon dating, to reject the claims for re-weaving etc. But there is a logical consequence of adopting that position which is to be highly sceptical of the burgeoning Shroudie literature from the radiocarbon refuseniks who continue to insist that the Shroud is of 1st century provenance, that it really is the blood of the crucified Jesus.\nAccepting the radiocarbon dating does not make one a “pseudo-skeptic”, or indeed a pseudo-anything, far less a deceiver, or liar, or blog troll, or heretic, or any of the other terms of endearment that fly around this site. In fact it is just the opposite. It is having the courage of one’s convictions to say “Why are you insisting year after year, decade after decade, that the radiocarbon dating was a fiasco, or a wicked conspiracy and yet doing nothing to get it repeated?”\nMethinks it’s time to stop the name-calling, the character assassination, and return to the science. If believers in the authenticity of the Shroud are genuine in their desire to have their position buttressed by sound science, then they must abide by the methods of sound science. If a measurement is in doubt, then repeat it. And if the method produces the “wrong” answer then don’t immediately claim there’s something wrong with the method and turn on the scientists and technicians.  It’s as simple as that.\n\n","date":"November 2, 2013 at 4:30 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49630","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":">>>>But if one looks deeper, it always appear that they methodology….\nNormally – not always, but normally – sindonologists do not look deeper, but until now nobody in scientific field said me that my methodology is “entirely flawed”. I started my work 14 years ago.  \n>>>>Can you say any argument pro-authenticity of the Shroud? \nI did not find one until now. Until now, always I have discovered that arguments pro-authenticity are non-arguments. But I have not finished yet, so maybe you can wait, if you want.\nBut as for the historical part, yes, I have finished with it. \nP.S. “To look deeper”, you said.\nWhy to discover the froud of Dmitri Kuznetsov was necessary the study of the “sceptic” Gian Marco Rinaldi? Why nobody looked deeper before, instead of paying and sponsoring his falsehoods? I have little trust in such a people. They “look deeper” only when someone says what they do not like.\n\n","date":"November 2, 2013 at 5:06 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49634","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Consider Rogers","post":"So Andrea, you showed your true face of fanatical Shroud-hater. I didn’t expect that so early.\nIt was not necessary to rely only on Gian Marco Rinaldi’s study to discover that Kuznetsov was a fraudster (even though we can be grateful to Gian Marco for that). Ian Wilson also discovered his second face, and makes no mention about Gian Marco. The fact is that the greatest enemy of pro-authenticity is another pro-authenticity, who thinks his arguments are better. Although the fact that there are some who accept at face value the purest idiocy (like bio-plastic coating)  if it is only pro- or anti-authencity, doesn’t stop to surprise me.\nSo Andrea, who and how faked the Shroud? If you are entirely convinced of that.\n\n","date":"November 2, 2013 at 5:14 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49636","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"O.K.\nYou are truly an asset to this discussion.\n\n","date":"November 3, 2013 at 10:10 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49740","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"Hello Andrea\nYour  “I templari e la Sindone. Storia di un falso”: is it available yet in English? Is there an English language summary?\n\n","date":"November 2, 2013 at 5:32 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49639","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":">>>>true face of fanatical Shroud-hater\n“Fanatical”, very funny.\nIt is useless to speak with you, you can not go out of your manicheism: love-Shroud / hate Shroud.\nI do not love nor hate the shroud, the shroud is an object that I study. Before the Shroud I studied the diabolical possession in antiquity, but I do not love nor hate the possessed.\nWilson did not discover that Kuznetsov was a scientific frauder, he only discovered other thing related to money. Is not the same.\n<<<<>>>> who and how faked the Shroud? If you are entirely convinced of that.\nYour obsession with  pro-authenticity / against -authenticity is preventing you from see that I never wrote that the Shroud is a fake.\nBut, by the way, your question “who and how faked the Shroud” is a non-scientifical question. I do not know exactly how Stradivari prepared his violins, but I do not think that Stradivari is God or that the violin is a miracle. And if I could make a Shroud identical to the original, this does not mean that the original Shroud was made exactly as I did. It is question of probabilty.\n\n","date":"November 2, 2013 at 5:34 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49641","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Consider Rogers","post":"Oh, Andrea, don’t try to excuse yourself. I am not so naive. Your attitude to the Shroud is well known to me, simply from the fact that you cannot overcome your inability to say a single, even the weakest argument that could be used to support the Shroud’s authenticity. I can say many arguments that cast doubt on the authenticity of the Shroud and several other relics, even if I am quite persuaded for the case of their authenticity. Shall I mention one anti-authencity argument first, so you will be not so shy to say something pro-authenticity? Or you are quite convinced that there are no pro-authenticity arguments, because in your mind they cannot be.\n\n","date":"November 2, 2013 at 5:44 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49644","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"\ncolinsberry :\nHello Andrea\nYour  “I templari e la Sindone. Storia di un falso”: is it available yet in English? Is there an English language summary?\n\nNo English. Until now nobody asked to translate it. At the moment they are translating only the book about the mandylion.\n\n","date":"November 2, 2013 at 5:37 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49642","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Consider Rogers","post":"Would you consider me rude to ask you to summarise here-  in as few or many words as you see fit – what links you see between the Templars and the Shroud? I have my own half-baked (literally!) views too, but they can and should wait till I’m au fait with what a published author has to say on the topic.\n\n","date":"November 2, 2013 at 5:43 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49643","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":">>>don’t try to excuse yourself. \ni do not excuse myself, I did nothing wrong\n>>>you cannot overcome your inability to say a single, even the weakest argument that could be used to support the Shroud’s authenticity>>>>>\nA: you do not believe in UFO\nB: Never I saw a UFO\nA: Because you hate them and you do not want to believe in them\nB: I do not hate them, simply I have not found until until now an argument to support their existence\nA: You showed your true face of fanatical UFO-hater. Don’t try to excuse yourself.\nB: I do not excuse myself, I did nothing wrong.\nA: But I can say, if i want, many arguments that cast doubt on the existence of UFO or against the authenticity of the the relic of our Lady’s milk, that was conserved at Paris with the Mandylion of Edessa. And you can found even the weakest argument that could be used to support that UFO exist and that this milk is authentic?\nB: No. But can you show me this milk?\nA: No, it is impossible to see. But it did many miracles.\nB: Probably I do not believe in these miracles.\nA: You hate not only UFO and relics, but also miracles!\nB: No, I do not hate anything. So you believe also in miracles happened through the Shroud of Besançon or Cadouin?\nA: Excuse me, we were talking about milk.\n\n","date":"November 2, 2013 at 6:18 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49645","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Consider Rogers","post":"Nice, but not concerning our discussion. Contrary to UFO, the Shroud is a real object, (according to Wikipedia) bearing the image of a man who appears to have suffered physical trauma in a manner consistent with crucifixion.\nMany believe this man pictured on this cloth is a Jesus Christ, and perhaps they have some reasons to believe so. If you Nicola, were one of them, how would you argue that the Shroud is authentic, (even if you don’t believe it)? What points can be presented in support of this view? I don’t think  none.\nBut first I can tell you one weak point of pro-authenticity arguments. According to Robert de Clari, he saw in Constantinople a burial shroud with a picture of Christ on it. There is no textual evidence that this cloth was actually the Shroud of Turin (like “shroudies’ usually assume), and not the pseudo-Shroud of Besancon for example.\nI could say more anti-authenticities, but now its your turn.\n\n","date":"November 2, 2013 at 6:30 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49646","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"\ncolinsberry :\nWould you consider me rude to ask you to summarise here-  in as few or many words as you see fit – what links you see between the Templars and the Shroud? I have my own half-baked (literally!) views too, but they can and should wait till I’m au fait with what a published author has to say on the topic.\n\nExcuse me, but I cannot summarise here 180 pages full of arguments…\nBut in few words, I have checked all texts that have been used to demonstrate a link between the Templars and the shroud, and I recognized them as falsified, poorly translated, poorly contextualized or invented. So, as it has been already written by the historian of Templars Malcolm Barber, I think that there is no link between the shroud (if existed at that time) and the Templars.\nBut I can help you otherwise. If you want to read a review of my book, the British Society for the Turin Shroud Newsletter published one. My book is about medieval history and I am an historian.  That review was written by a shroudie graduated in natural sciences. Surely you will like it.\nThere are other reviews of my book, in «Rivista di storia e letteratura religiosa» 48 (2012), pp. 167-178, in «L’indice dei libri del mese» 10 (2011), p. 21, in «Giornale di storia» 6 (2011), in «Deutsches Archiv für Erforschung des Mittelalters» 67 (2011), p. 805, in «Revue d’histoire ecclésiastique» 106/3-4 (2011), pp. 858-859, in «Vetera Christianorum» 48 (2011), pp. 392-393, in «Rivista di storia del cristianesimo» 10/2 (2013), pp. 508-511.\nBut unfortunately they were written by historians on scientifical reviews, so better if you do not trust them.\nP.S. If someone wants to give me a tenth of the money given to Kuznetsov, or to Frei, or some of the money given to Rolfe, I’ll pay the translation. For me, I do not need money. I am sure that a lot of sindonologists want to give their money  also to people that want to study the Shroud without saying in the first page that surely it is authentic. Maybe also Rinaldi or Freeman could get some  :-))\n\n","date":"November 2, 2013 at 6:47 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49648","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Consider Rogers","post":"Oh Andrea.\nBut unfortunately they were written by historians on scientifical reviews, so better if you do not trust them.\nThey didn’t like your books?\nBut I can help you otherwise. If you want to read a review of my book, the British Society for the Turin Shroud Newsletter published one. My book is about medieval history and I am an historian. That review was written by a shroudie graduated in natural sciences. Surely you will like it.\nhttp://www.shroud.com/pdfs/n74part8.pdf\nhttp://www.shroud.com/pdfs/n75part8.pdf\nTruly it is good that Emanuella Marinelli graduated from natural sciensces, because most of them at least think rationaly, contrary to (maybe I am prejudiced, forgive me, I also graduated from exact science, not human) many historians. For me, it was very surprising that so many academic professors of history are so big idiots, serving particular ideology, and building their careers on nothing else but conformism nad coteries.\nWell if Marinelli’s reviews are acurate, your scholarship, my dear Andrea is nothing else but simple denialism going to absurdity. But remeber, there is no single evidence that Hitler was responsible for Holocaust, even that with a single or two exceptions, no other scholar ever doubts that.\nI could believe that Marinelli’s reviews are too harsh. But after discussion with you, my dear Andrea, I am convinced that you are nobody but a fanatical Shroud-hater who will never say a positive word about Shroud’s possible authenticity.\n\n","date":"November 2, 2013 at 7:15 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49650","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"Well, I’m no historian, Andrea, and there are plenty on this site who would remind me of that fact were I to forget it. But I do have gut instinct, nurtured by a all-consuming interest in current affairs, politics etc etc, so while I agree that there is probably no strong direct connection between the Templars (given that the last Grand Master and his lieutenants were dispatched in 1314 at the earlier end of the radiocarbon dating) I do think there was a cause-and-effect relationship between the events of 1314 and the first documented showing of the Shroud in 1357. Some of the features of the Lirey Pilgrim’s badge hint at such a connection. Most of these ideas have been drip-fed to this site over many months, but here’s something that I bashed off hastily earlier, before you put in your appearance on this thread, thinking an opportunity might present itself to post here as a comment. Seems I must be prescient – you have provided just such an opportunity:\nThe Templar Shroud of Lirey (Mk1 and 2) now Turin\nInitially intended as a memorial to Jacques de Molay , last of the Templars, and to the manner of his death. (1314, Paris, slow-roasted at stake)\nThere was no corpse, possibly no ashes except for ghoulish souvenir collectors, so no headstone. Yet he was or had been head of a powerful order that probably had surviving members, certainly outside of France, who had means, one of whom wanted something more than memories. He hit on the idea of a striking wall-hanging, to be seen initially by a tiny circle of  surviving crypto-Templars only.\nThe decision was made to represent De Molay as if Christ laid out on a burial Shroud, but with a difference. The image would show that of a man at an intermediate stage of being burned, or rather roasted. The linen would be expensive, as per biblical account,\nThe L-shaped poker holes were there from the start. They were intended as a cue to the viewer to see the image as a scorch, as if a hot man had transferred heat to the linen. This is of course a metaphor – nobody is suggesting that a real man was used to produce the image, at least not directly by scorching from hot flesh.\nSo how was the image produced? Probably use of  heated metal or ceramic template, or by powder frottage, or a combination of the two. Garlaschelli used frottage to obtain an imprint from the body of a student volunteer, but a number of modifications were needed he said – like using a template for the face, like finishing the fingers with manual artwork (thus their unnatural length).\nBlood?  Given the figure was intended to look Christ-like, while actually that of J de M, there is no reason why some nominal signs of crucifixion were there initially, say palm or wrist wounds and a lance wound.  That is all one sees in the 1516 Lier copy. Alternatively there may have no wounds, no blood at all initially. \nThe “blood belt” of Ian Wilson on the Lirey badge?  That may have been an attempt initially to represent a chain, as used for burning at the stake, that was later touched up with blood.\nAt some stage, someone, no doubt the de Charny family, saw the potential in morphing the image of a Templar completely into that of Christ, and passing it off as a genuine burial Shroud. But they had to be very careful how that was done, so as not to be accused of peddling a fake. But there was a big incentive anyway to regularise the Shroud, to strip it of its Templar symbolism, and re-invent it entirely as a Christian relic.\nHow did the Mark 1 version look at first showing, in 1357 or thereabouts?  Fortunately we have the Lirey medallion, that strangely neglected artefact to provide guidance, and probably its curious omissions, inconsistent with a crucified Christ, that are responsible for it receiving so little attention and languishing in the basement of the Cluny museum. The man on the Lirey Shroud does not look Christ-like – note the short hair – he has no obvious body wounds on hands, feet or side, no bloodstains on head or other attempts to represent a crown of thorns, no scourge marks. But it’s clearly modelled on the Shroud, as shown by the herringbone weave. Arguably the man depicted could be seen as someone in some acute degree of discomfort, going by tilt of head, the hand being where they could protect privates from heat, and it’s even possible that there is an attempt to represent knees burned to bone.\nMorphing the image: itt is a matter of painting on blood in all the biblically-correct places. Wrist location of nail wound? Some see as it as telling us what the Bible and early artists omitted to mention – that the wrist is better mechanically, at least with unsupported feet. But there’s another explanation. The artist mistook the bones of the palm, with metacarpals shown prominently through thin skin, as fingers, and placed the wound where he thought the palm would be – i.e. closer to the wrist, but not intended to be at the wrist itself\nNote there are no unequivocal wounds on the Shroud image, ie. no lacerations, puncture wounds etc etc. The identification of wound sites depends entirely on  blood stains, and those could have been added after image formation. Blood came before image? So we are told, but it rests on one spot test done on  “serum-coated” fibres under a microscope, and can hardly be the final word on so crucial an issue (given that blood on top of linen would be at odds with authenticity).\nThere’s more I could add by way of supporting detail, but hopefully there’s enough of a narrative here to account for why there’s only one Shroud (that we know of) with the negative image double image, and why someone went to the trouble and expense of fabricating (not forging) it in the first instance, by  dramatic, point-making “pyrography”, and why it became accepted so quickly as a seemingly genuine holy relic. \nNo authenticists should be hurt – far less take offence – by the making of this narrative, it being pure imagination (well, mainly)\n\n","date":"November 2, 2013 at 7:16 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49651","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"Colin,\nThat’s absurd. Everybody knows da Vinci did it.\n\n","date":"November 2, 2013 at 7:24 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49653","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"Ah, but you read it John, and unlike the laptop, your brain has no Delete function. Gotcha.  ;-)\n\n","date":"November 2, 2013 at 7:34 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49654","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"O.K,\nHitler never existed. It was invented by a crown of graduated from natural sciences in 1947 because they, hafter having destroyed Nagasaky with their bombs, wanted to blame someone for having started the war.\nWe, professors of history (I am sure you know many of them), are truly big idiots, serving particular ideology, and building our careers on nothing else but conformism and coteries; so we were payed by you “exact” scientists to write the histories about Hitler. I confess it.\nThe shroud is authentic because you says it, and Koutznetzov is an historian. And the evangelists were graduated from natural sciences at the Jerusalem University. \n[Finished]\n\n","date":"November 2, 2013 at 7:55 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49655","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Consider Rogers","post":"Andrea, I agree with you about RCC priests being among the most tenacious arguers against the examination of the Shroud. But the reasoning behind it is not what you think.  Take a look at what the Catholic Church has claimed, in the past to be true:  That wine and bread become flesh and blood ( Cannibalism is a horrible concept.) An old English ballad of the Presbyterians tells the story of a Catholic husband whose wife became a Protestant. He invited a priest to celebrate mass in their home, and bade his dissenting wife bake a loaf of fine bread for the occasion.  Upon completion of this sacrament,  the wife tells the priest “I have put a pound of arsenic in the batter, but since you’ve changed it’s nature, well, that really cannot matter.”  She of course did no such thing, but as the screaming priest ran off to get an emetic, she pointed out to her husband that not even HE believed it.  The concept of Purgatory is built on the flimsiest of suppositions in the book of Maccabees, praying for the dead may be done without assuming the existence of a place never mentioned by Jesus.  Or Moses. Or anyone else.  The worst of these inexcusable superstitions, in my opinion, is the exhibition of the so-called “incorruptible” saints. I accompanied a former employer to Lourdes many years ago.  She was heart broken, and later fired me, for making the resident priest admit that the beautiful Bernadette Soubirous  had actually turned black years ago, and what they were looking at was a wax covering.  Saint Teresa of Avila, one of  three female saints the RCC named Doctors of the Church, was hacked to pieces so parts of her body could be distributed as relics. In the light of the claims and teaching supported by the RCC in the past, are you surprised they are reluctant to make any pronouncements about the Shroud of Turin?\n\n","date":"November 4, 2013 at 7:40 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49952","author":"Josie L. Tyner","site":"shroudstory"},{"title":"Consider Rogers","post":"Josie: Well as a Catholic, with all the respect to your beliefs and convictions, must say not everyone would agree with your opinions. As to Andrea, his position is clear. He will never say a positive word about possibility of Shroud being authentic. As to claims that even catholic priests opposed to the authenticity of the Shroud: this is meaningless. Many later saints had problems with catholic hierarchy. And although I don’t know what are Andrea’s  beliefs or ideology, from may experience I can say that many militant atheists tried to teach catholics what Catholic Teachings should be.\n\n","date":"November 4, 2013 at 8:02 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49958","author":"O.K.","site":"shroudstory"},{"title":"Consider Rogers","post":"Josie, I have not spoken about priests as arguers against the examination of the Shroud, even if I have an idea about that; I have spoken about many priests that in the XX century did not believe in authenticity of the Shroud and wrote books against shroudies. And they were professors in seminaries and universities, not ignorant people. The last example is Mons. Victor Saxer, president of the Roman Pontifical Academy of Archaeology and of the Pontifical Commettee of Historical Sciences (even if in some aspects his work on the Shroud was not so well conducted as one could hope). What I want to say is that the equivalence “believer in Shroud = catholic” and “not believer = atheist” is wrong. Or it is true only in the mind of some obtuse catholic, as you can see in this blog (people that can guess also my ideology, my faith, if I am catholic or not…). Maybe they love the Shroud in such a fanatic way because they think to be able to demonstrate the miracles of God or his resurrection through the Shroud. It is an old temptation: to take a so-called miracle and to use it as proof of God.\nBy the way, the idea that the wine and bread become flesh and blood is not in idea “claimed in the past”: is a present truth of faith. But until now we are lucky because some pseudo-scientific has not yet thinked to study with the microscope the wine before and after the mass, to see if it changed its composition in some way due to the priest’s verba institutionis.\n\n","date":"November 4, 2013 at 8:28 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49962","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Consider Rogers","post":"I don’t understand, how is it that ‘for’ and ‘against’ evidences is balanced?? I only see ONE inconsistency which is the radiocarbon dating. Everything else we have tried to duplicate the image have NOT worked. Its that simple.\n\n","date":"November 2, 2013 at 9:41 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49658","author":"Donn Reile","site":"shroudstory"},{"title":"Consider Rogers","post":"Damascus Fine Linens Incorporated;\nMemo to Friends of Jaques de Molay Memorial Fund; \nDear Sirs, we regret we are unable to meet the stringent terms of specification for your order as requested to us, and will therefore be unable to meet your order.  We admit to some surprise that the high quality linen cloth you ordered should be cut to exactly 8 x 2 old Assyrian cubits, as these went out of fashion some centuries ago around about the time that Sultan Mu’awiyah, blessed be his name, delivered the city out of the hand of the infidel, we believe in the year 661 according to your own system of reckoning.    \nWe are mystified at your demand for such a high level of purity in the linen thread, to be absolutely free from cotton.  You must be aware that multi-tasking is an essential economic necessity in these straitened times, and we expect our spinners to be adept at all fibres. Consequently all our fibres are heaped around our work-rooms, float about in the air and can generally get quite mixed up. It wasn’t always like this, but we believe there are some excellent compensating “spin-offs”, if you’ll forgive our little pun. \nWe note your requirements for certain botanical contaminations from specific geographical areas.  We are on good terms with our brethren in Anatolia who can arrange for the necessary exposures during the appropriate seasons, but would caution you concerning the prohibitive cost of this little indulgence.  We cannot however recommend sending the cloth to the Dead Sea Area at this time of year, as our brothers the Mamluks and Abbasids are presently engaged in what may politely be called duck-shooting activities, and we would fear for the safety of our couriers and of your order.  We are not at all certain whether in fact the plants you refer to, are any longer extent in the area.  It is now a fairly barren kind of place. \nThe most perplexing item of your specification  seems to relate to some peculiar geology requirement we have never heard of. What in fact is this travertine aragonite limestone of which you speak?  And just why do you want to contaminate our lovely linen products with such unspeakable dirt, even if it is from off the streets of the blessed city?  What are you? Some kind of nut? \nOur public librarian claims to have sighted a record of a similar kind of order as yours, but it was well over a millenium ago.  He believes it was requested by Joe someone, he thinks it looked like Harry Matthews, or maybe ‘Arry-Matthis or some-such. \nMay we interest you in purchasing some fine Persian carpets instead. Perhaps these might be a more enduring token of memory for your dear departed friend.  They are becoming very fashionable, and I can arrange immediate delivery at reasonable prices.\n\n","date":"November 3, 2013 at 5:14 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49681","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Consider Rogers","post":"Mystery solved!!!\n\n","date":"November 3, 2013 at 6:16 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49685","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"Dave, you bring up a point in your excellent (and hilarious!!) refutation.  I have read the work of Max Frei and Alan Whanger. Ok, whatever the critics say.  But what of the excellent work of Israel’s leading botanist, Avinoam Danin, and his work? He found, among other pollens, figoneum molis, an herb used unto this day by the Bedouin people for healing superficial wounds. But he also found, around the head, a huge preponderance of the pollen of Gundifolia Dumosim, an extremely nasty spined plant that only blooms in, and around, Jerusalem. Could it have been transplanted? What are the odds? Have you heard of his work? What do you think of it?  I stand my ground on the skeptics, nothing you point out, individually or together, however Damascus Linens, Inc. makes them look, will matter. But you put it with..how is it? Dry British humor, even if you are in NZ.  Kudos.\n\n","date":"November 4, 2013 at 7:22 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49950","author":"Josie L. Tyner","site":"shroudstory"},{"title":"Consider Rogers","post":"Historians HAVE to be sceptics as part of their professional life as most of the evidence we use is not as it might seem at first glance.  I resent the way the word is used here as if anyone who does not believe in the authenticity of the Shroud and keeps an open mind to the evidence as it unfolds – and will certainly unfold in dramatic new ways, probably totally unexpected ones, if modern technology developed since 1988 is applied to the Shroud, is branded as in some way ‘evil’ or ‘idiotic’. I look forward with an open mind to new tests and so far in what I have read on the Shroud I have still not found a single test that convinces me that the the cloth was made between 1 and 35 AD. Clearly I am not nearly as emotionally involved as the many others on this site with the Shroud and if a new test does come up with a first century date and confirms that it is human blood ( we really do need new tests on that and they are not difficult to come by), then I shall simply rewrite the first chapter of my book on medieval relics to fit with the evidence. Until then I shall continue as a sceptic and happily live with that!\n\n","date":"November 3, 2013 at 5:55 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49683","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"Charles,\nI understand your position but let me close with the first line of my manuscript: “We do not order our lives by proof beyond a reasonable doubt.”\n\n","date":"November 3, 2013 at 6:18 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49686","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"Quite so, John, but for most Christians, the authenticity of the Shroud is simply not an issue as relics are not an appropriate way of worshipping God. That is why Britain is bereft of all its relics that were simply rounded up and burned in the sixteenth century.  It is of immense historical interest if the Shroud is authentic but for most Christians it does not change their faith in any way if it is.\nThere are apparently lots of large stones around the ancient cemeteries of Jerusalem that were used to close off tombs. The one that closed off Jesus’s tomb is likely to be still there if only it could be picked out from the rest. So what implications follow?  Not many than i can see, other than this would again be of immense historical interest and so qualify for a place in my history of medieval relics.\nIf more sophisticated tests do confirm that there is first century blood on the Shroud then there are immensely interesting theological questions that arise if that blood is analysed – where does ‘the Son of God’ fit genetically?\n\n","date":"November 3, 2013 at 7:32 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49704","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"Charles,\nI am at my computer this “ungodly” hour because this morning at 2:00AM DST ended and we “gained” an hour. However, I have one reservation about blood. Not that new work is needed but that blood hasn’t been demonstrated.\n There is nothing you’ve said but  you seem to ignore or overlook the conclusions of Heller and Adler which were published in a peer reviewed journal. .\nWhen I first started the path, someone whose initials are in fact BS suggested I should read John Heller’s Report on the Shroud of Turin. It is the most authoritative work on STURP written and Heller was a gifted writer. He was not at the 120 hours of Turin but he became a part of STURP a two months before they departed for Rome and in the ensuing three years labored mightily to resolve the issues of the the blood stains He did the blood work on  the samples Rogers took that  were temporarily absconded by Walter McCrone. Adler was brought into STURP by Heller. Heller, as I have mentioned from time to time was a Yale graduate who in his undergraduate days was chosen by Yale to be advised by Einstein at Princeton. He tries to modestly brush it off as a fluke bit it was hardly that.\nThe best summation of STURP and what it did and frankly a measure of Heller’s soul  is what I quote at length and call his Valedictory:\n“The images are the result of dehydrative acid oxidation of the linen. The blood is human blood. How the images got on the cloth is a mystery. We would love to have the answer to this mystery, to explain the science of .it.  If it turns out that some form of molecular transport we have not been able to fathom is a method whereby the images of the scourge, crucified man were transferred to the linen, we shall have solved only another little micro part of the puzzle.\n“We do know, however, that there are thousands upon thousands of pieces of funerary linen going back two millennia before Christ and another huge number of linens of Coptic Christian burials. On none of these is there any image of any kind. A few have some blood and stains on them, but no image.\n“However, there are some remarkable aspects to this voyage of discovery. The team itself – its formation, cohesion, diversity, collaboration, as well as his sacrifice of time, talent and treasure – is unique in scientific annals.\n“The role of “coincidence” is awesome.\n“Science undertook its specialty, which is measurement. We were supremely confident that the answers would – indeed must – be forthcoming. And we fail.\n“Many team members were ordered or threatened to desist from the project, yet they persevere. Though it was believed that there would be a confrontation between science and religion, none occurred. Rather the relationship was harmonious and synergistic.\n“All of us have been changed by the project. I believe we have grown.\n“Some years ago, a friend of mine said to me in exasperation, ‘Heller, why don’t you spend less time in Athens and more in Jerusalem?’\n“I find the Acropolis much less interesting these days.”\nDr. John H. Heller passed away December 13, 1995. I truly wish I could have known this man. As  we say stateside: “He had soul.”\n\n","date":"November 3, 2013 at 8:00 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49707","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"I overlooked your last comment on genetics. I note that Zugibe thought the image indicated that Christ suffered from Marfan’s syndrome [as some feel Abraham Lincoln did]. We unfortunately have a sad family experience with that syndrome and perhaps the assassination of Lincoln was almost providential. Would he be so revered if he died from a naturally occurring  burst Aorta?\nThat’s a genetic condition and it does raise some interesting issues if it were true as to Christ. But, efforts to glean meaningful DNA from the blood samples have failed – thus far. About 20 years ago an agent at William Morris was interested in a book proposal of mine about cloning Christ. Didn’t fly (thank God).\n\n","date":"November 3, 2013 at 8:12 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49708","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"Yes, John, but you have to bear in mind that many blood experts do not support Heller and Adler.  I ran one of their reports past a Professor of Physiology who told me that what was there was consistent with animal organic material and no more. So at the very least the question is open ( and I am happy to leave it open).  I just think that when we have so much more advanced technology we should try again.What’s to lose if we have a more advanced test confirming Adler and Heller?\n\n","date":"November 3, 2013 at 9:40 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49726","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"Mr CB wrote: “The man on the Lirey Shroud does not look Christ-like”.\nThe true fact is the dorsal image of the man on the Lirey Shroud does look Christ-like (see the Stuggart Psalter Flogging of Christ miniature) while the ventral image of the man on the Lirey Shroud doesn’t look Jacques-de-Molay-like at all… (I found two 1308 templar graffiti depicting JdeM which are consistent with a 15th-16th portrait of the last Great Master in his late 60s: he looks Christ-like meaning the ventral image of the man on the Lirey Shroud doesn’t look Jacques-de-Molay-like either). Hope Mr CB is smart enough to follow…\n\n","date":"November 3, 2013 at 6:20 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49687","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Consider Rogers","post":"The true fact is the dorsal image of the man on the Lirey Shroud does look Christ-like\nI challenge anyone who thinks the dorsal view of the Man on the Lirey Shroud (i.e. pilgrim badge, aka medallion, aka Cluny medal) looks Christ-like to see this enlargement I did last year. Link goes to photo only.\n\nI’ll spare folk a repetition of my previously-expressed views  which accompanied the picture, but that restraining coil (or chain?) across the midriff might provide a clue. (No, I do not subscribe to the view of a certain eminent Shroud historian that it represents a  “blood belt” from the Biblical lance wound, extending  laterally as it does both sides of the body, there being no  lance wound as such, or indeed of any other attempts to depict wounds or bloodstains on the badge (despite the thoughtful incorporation of a herring-bone weave to assure the modern viewer that he or she is seeing a portrayal of the same linen that is now in Turin).\n\n","date":"November 3, 2013 at 6:53 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49695","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"Colin,\nYou piece of what others would think was  satire was a serious representation of your position, was it not? I thought so, but I replied with a piece of sarcasm.\nLet me use on a non-scatological description of your position which you in fact take seriously. “Bonkers.” \nScatological phrases are sometimes more satisfying in releasing scorn but I hesitate. Having been raised in an upstate New York city (Syracuse) our local radio stations were sometimes afflicted (but not always)  with programs aimed for a more rural audience. The “Ozark Mountain Boys” were quite popular. One program featured a host called “Deacon Doubleday” as I recall who was in love with the phrase “That’s the way it is,  Up-Country or “Down City.” One of the jobs I had in the summer during college included at  working maintenance at the State Fair Grounds. That included cleaning cattle barns. That job ended when Nelson Rockefeller defeated Averell Harriman for governor. Small cinema note: Harriman’s father was the Harriman who was an unseen character in Butch Cassidy and the Sun Dance kid. \nSo let me hint at how I really feel about the Jacques de Molay theory. BS Maybe Charles Freeman could think of a more elegant way of saying it unless he also feels that five decades after de Molay was burned at the stake (or roasted on spit?) an honored knight of the King of France would celebrate Jacques de Molay and thousands of pilgrims would flock to see his Shroud. BS\nThe representation on the pilgrim’s badge was a few inches (less than 3 perhaps Maybe 7 cm) The shroud was 8 cubits long (12 feet or so). The claim that the image on the pilgrim’s badge was Jacques de Molay is BS, or if seriously maintained,  bonkers. \nNot look at the time you’ve made me waste.\n\n","date":"November 3, 2013 at 7:30 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49703","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"BS, maybe, to your jaundiced eyes, John. But try top-dressing with BS in your garden, and look at the results, 6 months or a year later.\n\n","date":"November 3, 2013 at 7:37 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49706","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"“Maybe Charles Freeman could think of a more elegant way of saying it unless he also feels that five decades after de Molay was burned at the stake (or roasted on spit?) an honored knight of the King of France would celebrate Jacques de Molay and thousands of pilgrims would flock to see his Shroud. BS”\nMaybe John is not aware of the view, supported by a leading genealogist/historian, that the Geoffroi de Charney, Templar Knight and Preceptor of Normandy  who was burned at the stake same day as De Molay in 1314 was the uncle of Geoffroi de Charny, first known owner of the Shroud in W.Europe, and whose wife placed it on display, commissioned the Pilgrims’ badge etc in Lirey, 1357.\nThe official message could have been ambiguous to begin with as to whom precisely was portrayed on the Shroud, to attract pilgrims while making no categorical claims that might provoke immediate confrontation with either the Church or State. All that had to be said initially was that “it was brought back from the Crusades, and is reckoned to be very, very old, with miraculous powers to cure illnesses…”\n\n","date":"November 3, 2013 at 10:53 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49749","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"One more instance of a ‘scientist’ who ‘think’/dream he can turn into a medieval image analyst or cryptanalyst overnight or within 15 minutes…\n\n","date":"November 3, 2013 at 8:56 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49714","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Consider Rogers","post":"Mr CB can try top dressing with BS the Cluny Pilgrim badge, no JdeMolay image will ever grow out of it 6 months or a year later… except within his own pseudo-secientic and pseudo- scholarly intellectual imaginative construction (taking his desire for reality).\n\n","date":"November 3, 2013 at 9:03 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49716","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Consider Rogers","post":"\nCharles Freeman :\nIf more sophisticated tests do confirm that there is first century blood on the Shroud then there are immensely interesting theological questions that arise if that blood is analysed – where does ‘the Son of God’ fit genetically?\n\nCharles,\nI don’t believe that it’s possible to determine a first century origin for the blood, in of itself.  Even more sophisticated tests such as DNA analysis are not able to date the blood to a particular time period.  If the DNA is degraded/fragmented (as has been reported for the Shroud), this would be consistent with older blood, but by no means conclusive-there are a number of environmental conditions that can cause the same result in more recent samples.  \nRegarding where the Son of God fits genetically, is this in reference to the presence of a full complement of chromosomes, including a Y, or a more general comment in terms of ancestry (race),  or “fully human, fully divine” DNA vs. human DNA?   Just curious.\nBTW, In the latest copy of the Science journal, there is an article with a summary from a recent meeting (Paleoamerican Oddyssey, Oct 16-20), describing the recent DNA analysis of the skeleton of a 24,000 year old Siberian boy-this is the oldest complete genome of a modern human sequenced to date.  The full article will appear in next week’s Nature journal-no mention regarding blood group typing (I actually e-mailed the author yesterday afternoon).  In searching for the lab contact info, I ran across a paleo-discussion site and there was quite a bit of chatter about how ABO blood typing fits into human ancestry. The development of the ABO blood groups in humans and non-human primates has become a very interesting topic as more studies are coming forth.\n\n","date":"November 3, 2013 at 8:56 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49715","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"Re “The true fact is the dorsal image of the man on the Lirey Shroud does look Christ-like”\n I meant SHROUD-like. Sorry.\nANYWAY, I challenge Mr CB who thinks the Man FACE and body on the Lirey Shroud looks Jacques de Molay-like to see the 15th-16th c. CE Christ-like portrait of the Great Master (Absent the fact I got an early 14th c. CE portrait of JdeM in his late fifties showing the latter as an old man with long hair and in his late 60s). Just in case Mr CB is ignorant of JdeM iconography…\n\n","date":"November 3, 2013 at 9:47 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49729","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Consider Rogers","post":"typo: in in late SIXTIES.\n\n","date":"November 3, 2013 at 9:48 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49730","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Consider Rogers","post":"Sorry for all the typos, just typing in haste…\n\n","date":"November 3, 2013 at 9:49 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49733","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Consider Rogers","post":"Methinks Mr CB is not smart enough just to understand JdeM iconography shows the latter as a Christ-like old man in his late 60s with long hair. How can Mr CB contends the man on the Lirey Shroud does look JdeM-like is just pseudo-scholarship for the gullible. How can the man ‘has been thinking’ he means Big science as far as the TS is concerned, is just beyond common sense. Is Mr CB just losing it or just intellectually blind? That is the question…\n\n","date":"November 3, 2013 at 10:39 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49745","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Consider Rogers","post":"\nCharles Freeman :\nYes, John, but you have to bear in mind that many blood experts do not support Heller and Adler.  I ran one of their reports past a Professor of Physiology who told me that what\nwas there was consistent with animal organic material and no more. So at the very least the question is open ( and I am happy to leave it open).  I just think that when we have so much more advanced technology we should try again.What’s to lose if we have a more advanced test confirming Adler and Heller?\n\nIn one of the last interviews Heller & Adler did before Heller died, Adler said “But the most interesting thing is now there is immunological evidence that it is primate blood”, (1995)  The principles of immunology are grounded on specificity. Run the immunological data by anyone trained in the field and see if the strongest conclusion is that it is consistent with animal organic material and no more.\n\n","date":"November 3, 2013 at 11:41 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49755","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"Kelly,\nCan you (or maybe Dan P or Barrie S) locate a report on that immunological data? While I am satisfied that the whole of the stain phenomena are consistent with blood including the serum (?) rings and the cupped shape of the stains are blood, the more evidence we have, the stronger the case. Don’t get too upset with Freeman’s demeanor. After all, he is an Oxonian.\n\n","date":"November 3, 2013 at 11:51 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49756","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"No, John, my degrees are from Cambridge, the University of London and the University of East Anglia. I can’t see why anyone should get upset when I suggest more sophisticated testing. The number of whole blood tests that failed to find blood are enough to show that more testing is needed. It may never happen but  until it is it is certainly right to say that the matter is disputed. We must also remember that ‘consistent with’ is not proof. We have to be aware of what in human blood is also in animal collagen and what in human blood has not be found on the Shroud such as potassium.\nOf course, if your minds are absolutely made up, this is all irrelevant.\nI don’t usually get criticised for being cautious about evidence- in the rest of the academic world it is usually treated as a virtue.\n\n","date":"November 3, 2013 at 12:11 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49763","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"Quotes from John Heller provided by John Klotz\n“The images are the result of dehydrative acid oxidation of the linen. The blood is human blood. How the images got on the cloth is a mystery. We would love to have the answer to this mystery, to explain the science of .it. If it turns out that some form of molecular transport we have not been able to fathom is a method whereby the images of the scourge, crucified man were transferred to the linen, we shall have solved only another little micro part of the puzzle.”\nand later: \n“Science undertook its specialty, which is measurement. We were supremely confident that the answers would – indeed must – be forthcoming. And we fail.”\nMethinks future historians of science will not have too much trouble discerning cause and effect in those two paragraphs. I’ve done some bolding where necessary.\nSo Heller had Einstein as a tutor. Great. But Einstein, don’t forget was a theoretician, NOT an experimental scientist.\nExperimental scientists do not make a working hypothesis out of the proposition under test, unless the experiments chosen directly, or even indirectly, test the truth of the proposition. Failure to understand that simple point, and taking a crucifixion scenario as given, may well explain why Heller and several other similarly narrative-fixated STURP colleagues failed to make headway with the Shroud, resulting in that mournful  “… and we fail”. That’s what happens when you pursue agenda-driven “science”. In gambling terms, it’s like placing your entire stack of chips on “Lucky 7”.\n\n","date":"November 3, 2013 at 11:54 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49757","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"Colin,\nYou a poodle barking at a Great Dane.\n\n","date":"November 3, 2013 at 12:02 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49758","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"By the way, the person who instructed Heller on the gedenken (thought) experiment was Albert Einstein. Heller reports on that in his book. Einstein told him that the great thing about thought experiments they don’t require a large budget. Alas, the DO require logical  thought. The last sentence is mine not Einstein’s.\n\n","date":"November 3, 2013 at 12:06 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49761","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"Great Dane? Why have you switched from Einstein to Neils Bohr?  ;-)\nhttp://denmark.dk/en/meet-the-danes/great-danes/scientists/niels-bohr/\nEveryone’s heard of Einstein, fewer will have heard of Bohr. Yet it didn’t stop Bohr from challenging Einstein, especially re his blind spot or phobia for probability-based quantum mechanics (“God does not play dice”). It’s what scientists do, John They challenge one another, and what’s more they do so with complete indifference to perceived pecking orders, their own, and certainly other people’s. You see, those who try to make invidious comparisons between one scientist and another are simply displaying their ignorance of the scientific method, and focusing on the practitioners instead of the issues, usually to do down an opponent. You’re wasting your time: it’s water off a duck’s back, given I know my own strengths and weaknesses far better than you can ever hope to know.\nWhile I hesitate to say it John, I do hope that book of yours, when it materializes, will be less irate and crotchety than your performance on this thread, indeed this site, to date.\n\n","date":"November 3, 2013 at 12:27 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49766","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"Oh, did Bohr tutor you?\n\n","date":"November 3, 2013 at 12:50 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49771","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"\nJohn Klotz :\nKelly,\nCan you (or maybe Dan P or Barrie S) locate a report on that immunological data? While I am satisfied that the whole of the stain phenomena are consistent with blood including the serum (?) rings and the cupped shape of the stains are blood, the more evidence we have, the stronger the case. Don’t get too upset with Freeman’s demeanor. After all, he is an Oxonian.\n\nJohn,\nThis will summarize Heller & Adler’s immunological data as well as that of others-it will include the original references.   http://www.shroud.com/pdfs/kearse.pdf. \nI’m not upset with Freeman’s demeanor!  I didn’t mean to come across that way-it’s just I don’t think you can selectively look at certain results (chemical or elemental analysis) without considering the entire body of data, particularly the immunological studies.  Adler, himself a chemist, recognized the discriminatory power that immunological methods contribute.  I am admittedly biased, but the immunological evidence takes the chemical data to another level.  \nI don’t know what particular data in which particular report a Physiological expert may have been looking at-but to be fair, I don’t think you can look at one set of data without considering the other…Charles Freeman, and his demeanor, is more than okay in my book.\n\n","date":"November 3, 2013 at 12:10 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49762","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"I’m sorry is you felt I was criticizing his demeanor. I think he can be valuable at some point. As far as Oxford is concerned, I have a nephew who was a Rhodes scholar and had a distinguished career in the Air Force.\nAt times I can be little too clever in  twitting my friends on occasion (and I mean the old english, not the Internet twit). In our repartee my friends take it in good humor and twit right back.\n\n","date":"November 3, 2013 at 12:22 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49764","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"Kelly,\nI owe you an apology. At times I can be a little too breezy. My Shroud files now number more than 1,800, little less than one gigbiyte. As a matter of fact I checked and it turns out I downloaded your file a year ago but was not prepared to deal with it. Now I am.\nCould you send me your E-Mail address to\nklotzlaw@gmail.com\nI am working on a chapter right now that will cover from the AMSTAR conferences, Ohio 2008 and Valencia up to Good Friday 2013. Then I will turn to the quantum. \nI would really like to get into your work. Did you present at Valencia? If not, you should prepare for a big year next year in any event because  if you are correct, you work is important.\nI may want to discuss it with you but not on a public blog.\nJohn Klotz\nklotzlaw@gmail.com\n\n","date":"November 3, 2013 at 12:43 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49769","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"\nCharles Freeman :\nNo, John, my degrees are from Cambridge, the University of London and the University of East Anglia. I can’t see why anyone should get upset when I suggest more sophisticated testing. The number of whole blood tests that failed to find blood are enough to show that more testing is needed. It may never happen but  until it is it is certainly right to say that the matter is disputed. We must also remember that ‘consistent with’ is not proof. We have to be aware of what in human blood is also in animal collagen and what in human blood has not be found on the Shroud such as potassium.\nOf course, if your minds are absolutely made up, this is all irrelevant.\nI don’t usually get criticised for being cautious about evidence- in the rest of the academic world it is usually treated as a virtue.\n\nThe number of whole blood tests that failed to find blood?  Such as….?  And those that did indicate blood was present?  \nIn the world of forensics, is the presence (or absence) of potassium a typical method that is used to evaluate the presence of blood in bloodstains?  Or are the types of chemical tests & immunological tests that were performed on the Shroud more in line?\n“What is in human blood is also in human collagen”, this is a hydroxyproline reference?\nI’m all in favor of being cautious & objective about evidence.  I’m also in favor of more sophisticated testing.  I am just confused as to what such particular sophisticated tests you are referring to and what particularly these would show?\n\n","date":"November 3, 2013 at 12:23 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49765","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"The tests normally quoted are those carried out by Professor Frache and his colleagues at  the forensic laboratory at Modena in 1973. Several tests that should have shown up blood failed to do so and this was after all a speciality of a forensic laboratory which is more than anything that Heller and Adler could provide. I am happy to stick to my view that the question of whether there is blood is certainly disputed. As I understand it, the absence of potassium is certainly an indicator that this may not be blood. But I am not an expert, the only expert personally known to me read a range of work including a long article by you Kelly and concluded that there was no clear evidence of human blood. So let’s leave it open.\n\n","date":"November 3, 2013 at 12:57 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49772","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"\nJohn Klotz :\nI’m sorry is you felt I was criticizing his demeanor.\n\nJohn,\nI felt that you felt I was criticizing his (Charles’) demeanor.  I can see where it might appear that way.  I am okay with both (Charles’) and yours (John) demeanors.  To borrow from a recent post, I am not lukewarm about immunology.  I also try to be objective and respect other’s opinions.  I don’t mean to come across as challenging, but if the subject is brought up to discuss, I would like to know specifics.\n\n","date":"November 3, 2013 at 12:28 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49767","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"Kelly,\nI replied to you but the way this blog works you might have to scroll up a message to you since ut appears as a reply to a prior post of yours.\n\n","date":"November 3, 2013 at 12:45 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49770","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"\nJohn Klotz :\nOh, did Bohr tutor you?\n\nBefore my time, I’m afraid John, and in any case I’m a biochemist by training. Having trained at reputable institutes I too have had the privilege of attending lectures and seminars by some scientific greats – Francis Crick, Max Perutz, Fred Sanger etc. A few years back, I had a long chat over coffee with the UK’s Chief Scientific Officer – on a completely different subject – CCS. So while I’m respectful of top notch scientists, I’m not overawed, knowing I can hold my own when I’ve done my homework.\nIf you had done YOUR homework, John, you would not have made that unnecessary comment about my Templar-Lirey link, had you known there were two players with almost identical names, allegedly uncle and nephew. My views on Lirey appeared on this site many moons ago – but you clearly, as I say, have not bothered to do your homework, yet you constantly throw that charge at me. \nI have news for you, John. I do my homework. But I’m not here for self-aggrandizement. It’s the dodgy science that is my preoccupation, and has been for several years, ever since setting up a site called sciencebuzz, long before the press reports of “miraculous flashes of light ” appeared in the UK media in Nov/Dec 2011, reporting ENEA’s experiments with pulsed uv-excimer laser beams that left faint marks on linen.\nI’m an issues man, John, so can we agree to disagree, and then stick to discussing specific issues, specific details? Thanks. Goodnight.\n\n","date":"November 3, 2013 at 1:06 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49773","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"\nJohn Klotz :\nKelly,\nI owe you an apology. At times I can be a little too breezy. My Shroud files now number more than 1,800, little less than one gigbiyte. As a matter of fact I checked and it turns out I downloaded your file a year ago but was not prepared to deal with it. Now I am.\nCould you send me your E-Mail address to\nklotzlaw@gmail.com\nI am working on a chapter right now that will cover from the AMSTAR conferences, Ohio 2008 and Valencia up to Good Friday 2013. Then I will turn to the quantum.\nI would really like to get into your work. Did you present at Valencia? If not, you should prepare for a big year next year in any event because  if you are correct, you work is important.\nI may want to discuss it with you but not on a public blog.\nJohn Klotz\nklotzlaw@gmail.com\n\nJohn,\nNo apologies needed-all good\nI’ll be in touch\n\n","date":"November 3, 2013 at 1:36 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49775","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"\nCharles Freeman :\nThe tests normally quoted are those carried out by Professor Frache and his colleagues at  the forensic laboratory at Modena in 1973. Several tests that should have shown up blood failed to do so and this was after all a speciality of a forensic laboratory which is more than anything that Heller and Adler could provide. I am happy to stick to my view that the question of whether there is blood is certainly disputed. As I understand it, the absence of potassium is certainly an indicator that this may not be blood. But I am not an expert, the only expert personally known to me read a range of work including a long article by you Kelly and concluded that there was no clear evidence of human blood. So let’s leave it open.\n\nOn page 12 of Heller’s book it says, “…Jackson called.  He told me that in 1973 some Italian scientists had taken out a “blood”-covered thread, tested it, and could not obtain a positive result.  But, they added, it was not negative…”  What to make of this?  I, myself, don’t know?  Heller went on to say in the following sentence that it was “double-talk”.     \nAlso consider that Baima Bollone, a pathologist, performed blood studies as well, which surely would have contributed some expertise.  Alder was a porphyrin chemist-this speciality would include the identification of hemoglobin.  Most current standard field tests for blood rely on similar chemical analysis as used by Heller & Adler & immunological tests for further confirmation.  In first exploring the blood data, I consulted with numerous other scientists, many of whom I already knew personally, others whom I did not.  These include colleagues in immunology, blood specialists, and forensic scientists, employed at Yale, Johns Hopkins, the NIH.  I wanted to hear multiple, objective opinions, for me, the more the better.   \n“No clear evidence of human blood”, could the same be concluded for the counterpart, paint or pigment?  Or that there is positive evidence for such?  I think the evidence is positive that the bloodstains contain blood products.  I am somewhat hesitant to state that there is strong evidence that it is human blood.  For me, primate blood, yes, the evidence is substantial, human blood, it could be better.  The immunologist in me bristles a little bit when the phrase “human” blood is tossed around so cavalierly.  If the phrase “human blood” is going to be used so repeatedly as a solid fact, there needs to be solid, scientific evidence for it.  At the lab bench, the physical characteristics of the blood must be considered apart from the image.\nSo, yes, of course, we can agree to disagree.  I welcome discussion with those who have different viewpoints-otherwise it would be pretty boring.  To put my response in perspective, consider if I had brought into discussion the issue of “certain historical documents”  or “historical data”-I am certain your ears would have perked up and you would want to know specifics.  That’s all.  I appreciate your response.\n\n","date":"November 3, 2013 at 2:11 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49778","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"Kelly. Was Jackson an expert on blood or the tests actually undertaken in the forensic lab? Hearsay evidence doesn’t count for very much.\nWould you be happy to support my view that we should aim for a blood test to settle the matter one way or the other? My father-in-law had many years of practice as a doctor and he tells me that what you can say about blood now from tests compared to thirty years ago is amazing.\nEveryone I have asked ridicules the idea that the blood on the Shroud is redder than it should be because the victim suffered torture. If that was the case, I am told, every murder case in the courts would bring this up as evidence of the circumstances in which a victim died. My physiology friend  also saw the colour of the ‘blood ‘on the Shroud as one of the main reasons he thought that it wasn’t blood.\nI just repeat what I have said all along. There is disputed evidence in a field where tests are vastly more sophisticated that they were thirty-five years ago and I would like to see new tests that would certainly settle the matter one way or the other because this is scientifically possible. Until then I am a sceptic  and it seems to me the only possible way to be (although my physiology expert was much more certain that the evidence for blood was lacking).\nHistorians seldom have this certainty as we are making assessments of evidence that is often inadequate but please pass on any historical evidence you have!\n\n","date":"November 3, 2013 at 3:23 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49789","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"\nCharles Freeman :\nKelly. Was Jackson an expert on blood or the tests actually undertaken in the forensic lab? Hearsay evidence doesn’t count for very much.\nWould you be happy to support my view that we should aim for a blood test to settle the matter one way or the other? My father-in-law had many years of practice as a doctor and he tells me that what you can say about blood now from tests compared to thirty years ago is amazing.\n\nThe reference to Jackson calling was a quote from the book to place the next sentence in context.  Of course he was not a specialist and you know this!  He was merely passing information along-please…\nIt’s a little difficult for me to support your view to “settle the matter one way or another”. As I mentioned before, the standard field tests currently in use by forensic scientists to determine if bloodstains are, in fact, real blood are chemical tests, similar to those used by Heller & Adler, and immunological tests for conformation.  \nCompared to thirty years ago, what you can tell from blood, is in fact, amazing, particularly in relation to genetics.  However, the standard principles for determining if, in fact, a dried bloodstain is really blood or not really haven’t changed that much. Consult the FBI manual or any forensics source.   Monoclonal antibodies have replaced previous polyclonal sera in typing-both were used in the collective series of Shroud experiments.  My question would be, what exactly would be this specific, new test for aged blood and what amazing, new information could be gleaned?\n\n","date":"November 3, 2013 at 6:27 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49804","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"The question I want settled is whether Frache and his colleagues in the forensic lab at Modena  or Adler and Heller who seem to work in rather makeshift conditions are right. We need confirmation as to whether this is blood, human blood or merely collagen – animal glue from bones and skin used either as a binder for paint or as a preservative on cloth. \nEvery ten years I update my Egypt, Greece and Rome – working on the proofs this week for the third edition out next spring. Each ten years things that were considered mysteries are now solved by new research. So I work on the principle,with the Shroud, as with other material objects, if we don’t know now, we soon may. I am amazed at the way these long ago tests with relatively unsophisticated technology are still argued over as if the Shroud had been dated to the first century AD by any of them! The problem with the Shroud is  lack of access so that we are deprived of up-to-date evidence from which to work from.\nI often think, however, that it might have been better not to have had any tests on the Shroud and kept it as a mystery!\n\n","date":"November 4, 2013 at 3:47 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49842","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"Reading your comment, and thinking, yet again, about how easy it should be to test for blood in principle, yet infernally difficult in practice (if the blood is ancient and degraded) something suddenly stuck me, working through the biochemical checklist. What about the lipid profile? How come I’ve never seen a mention of lipids (triglycerides, free fatty acids, cholesterol etc.) . Presumably any cholesterol would all be “good” cholesterol.  ;-)\n\n","date":"November 4, 2013 at 4:02 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49852","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"Postcript: I was pleased to see you yesterday flagging up potassium and collagen as problems that the “real blood” pro-authenticity advocates must face up to (and have so far failed to do so).\nOK, so mineral salts are not a specific marker for blood, but they come into their own where degraded blood is concerned, where so many macromolecules will be severely degraded and damaged, losing their chemical, biological or immunological specificity and with it their utility as markers. The mineral salts should still be there, come what may, barring laundry cycles(which would have at least partly washed away bloodstains, or the appearance thereof, which is not the case). So while not specific markers, one can still insist they should be there. So where’s the potassium gone?\nThen there’s that collagen problem. Rogers detected a peak for hydroxyproline (HP) in Shroud blood, and used it (questionably in my view) to support an otherwise shaky thermochemical argument re scorching – or absence thereof. But HP should be a minor constituent of blood, except in some clinical situations like excessive bone resorption that cause breakdown of connective tissue collagen and subsequent release of HP into blood. But we’ve seen the crucifixion- trauma-explains-all-anomalies argument deployed – that it too produced raised blood HP levels by connective tissue breakdown. But collagen, animal collagen that is( boiled bones etc)  is such an obvious additive to expect in any “forgery” scenario that a specific marker (HP) for its presence has to be assessed for cons as well as pros. Not to do so is to risk seeming biased and selective with the evidence.\nI’m still trying to think of the killer marker for ancient blood that everyone else has so far overlooked. I may be gone a while.\n\n","date":"November 4, 2013 at 4:56 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49857","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"\nCharles Freeman :\nEveryone I have asked ridicules the idea that the blood on the Shroud is redder than it should be because the victim suffered torture. If that was the case, I am told, every murder case in the courts would bring this up as evidence of the circumstances in which a victim died. My physiology friend  also saw the colour of the ‘blood ‘on the Shroud as one of the main reasons he thought that it wasn’t blood.\n\n“Every murder case”. The degree and time frame of suffering for the man on the Shroud, if it does in fact represent Jesus, would be in the extreme range-it is not a justifiable comparison to “every murder case”\nBTW, others have written articles concerning the evidence for the blood on the Shroud, including Thibault & Nels Svensson, who are both medically trained.  You might want to check those out…\nPlease bear in mind when generalizing about blood tests, there is a difference between evaluation of freshly drawn blood versus the examination of aged, dried bloodstains…\n\n","date":"November 3, 2013 at 7:12 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49806","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"‘In the extreme range’. Sadly there are others who have died in these circumstances and it would be a crucial bit of evidence to establish the nature of the death. But it is simply not relevant as there is no evidence that the colour of dried blood varies significantly  according to the degree of torment suffered by the victim. If there was it would have been used in the courts by now. So Adler’s hypothesis has failed because it seems impossible to replicate and it has not done his reputation as a blood ‘expert’ any good.\nThis is the world we are stuck in until there have been new tests to establish whether there is human blood, primate blood or just collagen. I am only seeking to apply the same criteria to the Shroud that one would apply to any other ancient material object whose origins  are unknown. If, until this has been done, I remain sceptical, then I am happy to be counted as a sceptic.\n\n","date":"November 4, 2013 at 3:58 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49851","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"No doubt one day someone will write a book about the evil, insincere, deceitful,etc, people who, for some reason, seem particularly drawn to researching the Shroud. I don’t know any of them so I have only the comments provided here to go on but, my goodness, they seem a crooked lot!\nPerhaps best to keep one’s head down and concentrate on the evidence, or rather lack of it.\n\n","date":"November 4, 2013 at 4:41 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49854","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"Let me emphasize one thing. If are are a serious critic of STURP or a serious proponent of their findings, you MUST read Heller’s book to get a real grasp of what happened as well as the interplay of what happened. For example, Heller was quite critical of McCrone and essentially said that he tied to steal Rogers’ samples. He was supposed to look at them, make his findings and then forward them to Heller. He didn’t do that. He sent him three slides and kept the rest. Jackson and Rogers had to go to Chicago and physically retrieve them. He also was sloppy in his handling. The most appropriate critique of Heller’s work might be that McCrone had messed-up the samples – except that Heller and Adler were able to work around that klutz McCrone’s mess. :-)\nAnd incidentally, in Grove’s memoir he indicates  that McCrone was out to prove the Shroud a fake from the get go. He had “proven” Yale’s Vinland Map a fake and he wanted to add the Shroud’s scalp to his belt.\n\n","date":"November 3, 2013 at 7:27 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49808","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"Grove = Gove\n\n","date":"November 3, 2013 at 7:29 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49809","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"I don’t believe McCrone was “out to prove the Shroud a fake from the get go.” His letters to Fr Rinaldi (held by the Holy Shroud Guild) suggest exactly the reverse, and a sense of real disappointment when he found he could not agree with the rest of the STURP team. I think he felt polarised into defending his position (partially due to his own stubbornness, it’s true) and became a bitter, and embittered, opponent of authenticity; but I do not think that was his original position. Gove’s book must by balanced by McCrone’s own for one to try to get a fair idea of who was responsible for what.\n\n","date":"November 3, 2013 at 7:45 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49810","author":"Hugh Farey","site":"shroudstory"},{"title":"Consider Rogers","post":"Hugh, if you have read Heller’s book and Gove’s  memoir and really believe in McCrone’s sincerity, then there are a couple bridges,you might be interested in investing. I can get you a good price. \nAnything he wrote to Rinaldi would be self serving and his actions with the Rogers’ slides were not only deceitful but incompetent.\nYou can be a skeptic if you want but if that means you weigh McCrone’s words equally with Heller and Rogers and the rest of the STURP team,  you are a fool. That is very strong language but there comes when there are competing versions of the truth totally at odds, you must either make a judgment of confess you just don’t know. The scientific evidence that the Shroud is not a painting is conclusive – beyond a reasonable doubt. And I don’t say that about everything involving the Shroud. There many things that some Shroud scholars believe they see that may be highly imaginative. Heller and Adler do not belong to that category. \nRogers trusted him and he betrayed Rogers.\nOthers have commented on his twisting of Rinaldi’s words. His book was a terrible mishmash without discernible organization. A collection of literary curios. His misreading of Rinaldi was even too much for Gove not to notice.\nIf you put your prestige into defending the indefensible McCrone, you must value your prestige lightly. I suppose I should be more diplomatic but when it comes to McCrone’s reprehensible actions vis a vis the Shroud, I will not sugar coat his actions with insincere diplomacy or even superficial tact.\nHowever, I will concede that the first person a con man cons is often himself.\n\n","date":"November 3, 2013 at 9:45 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49818","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"Whenever anybody calls me a fool I usually know I’m on the right track…\n\n","date":"November 4, 2013 at 9:40 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49893","author":"Hugh Farey","site":"shroudstory"},{"title":"Consider Rogers","post":"Hugh,\nCharles Freeman has painted with a broad brush in deciding the Shroud research attracts  “evil, insincere, deceitful,etc,” individuals. I hope you will remember that when functioning as editor of the BSTS newsletter since that broad brush, if true certainly splatters many members of the BSTS. However, I have commented enough on Freeman. \nMy statement on McCrone is a value judgment in the course of a debate. The fact that the Shroud is not a painting is  well supported by peer reviewed scientific research. NO PEER REVIEWED SCIENTIFIC RESEARCH HAS DEMONSTRATED OTHERWISE. On the other hand, I would never call you ” evil, insincere, deceitful,etc,” I have no doubt about your sincerity. I do believe your appraisal of McCrone is simply wrong and I am at loss to find substantiation for it other than the rhetoric of individuals who are desperate to prove the Shroud unauthentic.  In both Saxe’s books and Gove’s it finally comes to McCrone. Our argument is over his good faith. He didn’t have any. That’s my opinion. It’s also my opinion that given the extent and depth of research into the painting issue which began before STURP was just a gleam in John Jackson’s eye, the overwhelming, uncontradicted by peer reviewed  scientific evidence, is that the Shroud is not a painting. \nThere comes a time when after weighing the evidence we ought to make a decision. “We do not order our lives by proof beyond a reasonable doubt”. I believe that’s a Klotz original unless someone has another source. (And I also guess it’s copyrighted. Feel free to quote with proper attribution).\n\n","date":"November 4, 2013 at 10:00 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49896","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"\nCharles Freeman :\n‘But it is simply not relevant as there is no evidence that the colour of dried blood varies significantly  according to the degree of torment suffered by the victim. If there was it would have been used in the courts by now. So Adler’s hypothesis has failed …”\nI think it’s still an open issue regarding the molecular basis for the color of the blood.  Besides, the above logic would require evidence that the colour of dried blood does not vary according to the degree of torment suffered by the victim.  If there was it would have been used in the courts by now…\n\nCharles Freeman :\n‘\nThis is the world we are stuck in until there have been new tests to establish whether there is human blood, primate blood or just collagen. I am only seeking to apply the same criteria to the Shroud that one would apply to any other ancient material object whose origins  are unknown.\n\nMe too.  \nThere seems to have been a shift from the previous tests being inferior because we can now do so many more amazing things with blood 30 years later, to being stuck until there have been new tests. What are these specific, new tests would you propose to evaluate if there is human blood, primate blood or just collagen?\n\n","date":"November 4, 2013 at 5:23 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49860","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"\nCharles Freeman :\nNo doubt one day someone will write a book about the evil, insincere, deceitful,etc, people who, for some reason, seem particularly drawn to researching the Shroud. I don’t know any of them so I have only the comments provided here to go on but, my goodness, they seem a crooked lot!\nPerhaps best to keep one’s head down and concentrate on the evidence, or rather lack of it.\n\nNo comment.\n\n","date":"November 4, 2013 at 5:29 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49861","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"Charles,\n“No doubt one day someone will write a book about the evil, insincere, deceitful,etc, people who, for some reason, seem particularly drawn to researching the Shroud.”\nI think it’s time to wheel the horse outside the city gates. Your statement which is of course libelous per se on this side of the Atlantic had you named just one living person who was “evil, insincere, deceitful,etc”  Such a personal attack is totally unwarranted by any facts you have stated. One thing I have stated about Heller is that he had “soul.” In an  inner US city, that is the highest of praise. \nI guess I’m a little partial to the term since at one time in my career, I was representing Latino insurgents against the corrupt Bronx political machine in the South Bronx. After one argument in court, an African-American Council member who was also a minister remarked to an acquaintance: “I never knew Klotz had soul.” I have had a number of compliments in my career but I was touched by that one. Of course primo uno compliment came from the presiding judge of the New York State Court who introduced to me to “his attorney” as “one the ten best lawyers in Manhattan.” That was probably hyperbole, but the my “soul” compliment about Heller is a measure of my esteem for the late John Heller.\nIf you have truly read Heller’s book, and not come away with personal admiration, if not for his book than the man, you are surely in sorry state.\nI am spent too much time on this blog this weekend. It’s been a distraction. However when I come to appropriate time to write a about pseudo-skeptics in my book, this interchange will play a role. Whether I have time, or the inclination to blog it before publication is a question I will consider.\nIn addition to smoking out pseudo-skepticism, this exchanges introduced me to someone whose paper I had downloaded last year but never had time to analyze: Kelly Kearse. Thank you Dan Porter. The blog is full of “sound and fury” but through the clouds of over the top rhetoric, on occasion,  the truth emerges from the cacophony.\nThere I go, paraphrasing Macbeth again. Did I ever tell you I saw a dynamite new production at Lincoln Center a week ago?\nJohn Klotz\nklotzlaw@gmail.com\n\n","date":"November 4, 2013 at 9:25 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49891","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"John, I did law at Cambridge so know the law of libel. But surely the people to sue are the ones who call others insincere, deceitful,etc. I am only taking  words from personal attacks that crop up on this site, many of them made on sceptics  who have as much right as anyone else to be considered Shroud researchers.  (Or should they be excluded by virtue of the fact that their own professions train them to take a critical view of what is often inadequate or ambiguous evidence?)\nYou can read through any of my comments and find that I never make personal attacks on people. I start with the assumption that everyone,  sceptics and others, are bone fide researchers but it is the evidence that should be the centre of attention, not the characters of the contributors. That’s the point I wanted to make.\nBTW what did you mean by ‘I think it’s time to wheel the horse outside the city gates’? I assume it has something to do with your earlier cryptic ( bring in Max Hamon here), comments about a Trojan horse. Sounds a bit libellous to me whoever it is aimed at.\n\n","date":"November 4, 2013 at 1:21 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49916","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"Thank you for your clarification. Duly noted.\n\n","date":"November 4, 2013 at 1:25 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49918","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"\ncolinsberry :\nPostcript: I was pleased to see you yesterday flagging up potassium and collagen as problems that the “real blood” pro-authenticity advocates must face up to (and have so far failed to do so).\nOK, so mineral salts are not a specific marker for blood, but they come into their own where degraded blood is concerned, where so many macromolecules will be severely degraded and damaged, losing their chemical, biological or immunological specificity and with it their utility as markers. The mineral salts should still be there, come what may, barring laundry cycles(which would have at least partly washed away bloodstains, or the appearance thereof, which is not the case). So while not specific markers, one can still insist they should be there. So where’s the potassium gone?\nThen there’s that collagen problem. Rogers detected a peak for hydroxyproline (HP) in Shroud blood, and used it (questionably in my view) to support an otherwise shaky thermochemical argument re scorching – or absence thereof. But HP should be a minor constituent of blood, except in some clinical situations like excessive bone resorption that cause breakdown of connective tissue collagen and subsequent release of HP into blood. But we’ve seen the crucifixion- trauma-explains-all-anomalies argument deployed – that it too produced raised blood HP levels by connective tissue breakdown. But collagen, animal collagen that is( boiled bones etc)  is such an obvious additive to expect in any “forgery” scenario that a specific marker (HP) for its presence has to be assessed for cons as well as pros. Not to do so is to risk seeming biased and selective with the evidence.\nI’m still trying to think of the killer marker for ancient blood that everyone else has so far overlooked. I may be gone a while.\n\nKiller marker for ancient blood:  Hemoglobin?  Immunoglobulin?  Serum Albumin? ABO antigens?  If potassium or mineral salts are such a definable marker, why aren’t those typically used in the forensic evaluation of (dried) blood? \nLosing their immunological specificity?  Antibodies used to detect such products are quite capable of recognizing denatured proteins that may have undergone alterations in their conformation or degradation.  Polyclonal antibodies are especially adept at this as they are a mixture of the products of many different B cell clones.  Such recognition is the basis of Western blotting.\nBesides, I thought this was all due to Brother Hirudo.  Have the leeches been abandoned?\n\n","date":"November 4, 2013 at 5:39 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49862","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"Let’s take just the first of those, Kelly – the hemoglobin (there, see my spelling – I’m really trying hard to reach hands across the Atlantic this sunny morning in England ;-) \nWhat do you expect to see in blood that is 1 year old, a century old or 2 millennia old? Intact hemoglobin? If so, one should be able to get it to migrate on electrophoresis gels, or through gel filtration, and show by use of standards that it’s the real McCoy. I’m not aware of such evidence for intact hemoglobin, are you? So a crucial link in the evidence is missing, is it not, while anticipating the rejoinder that I’m simply asking too much of the Redeemer’s blood.\nOK, so let’s jump to the far end of the scale, where there’s still an intact free porphyrin, a very stable molecule by all accounts, which is what remains after globin and iron have been stripped out. A porphyrin chemist like Adler would have known precisely how to extract the free porphyrin of ancient blood, if suspecting that Hb was at intermediate states of degradation. So what’s the next step? It’s easy, because I’ve done it, or rather encountered free porphyrins on TLC plates. One needs only traces there to detect them by their intense red fluorescence under uv, so all Adler and Heller needed to do was run Shroud porphyrins against known porphyrin standards (of which Adler at least must have had a library of variants).\nTell me this, Kelly. Did you ever read of such a simple straightforward experiment  being done – i.e. to isolate the free porphyrins of Shroud blood, and run them against standards (and maybe do a mass-spec fingerprinting on eluted pigment?). I have not (which is not to say the data are not there, but if that’s the case, then why is it not publicized?). What we see instead are uv/visible spectra of pigments which are the bluntest of instruments in tetrapyrrole chemistry (excluding the Soret band of porphyrins) and when an anomalous spectrum is found for Shroud porphyrin, we see Adler immediately rushing to construct exotic hypotheses based on bilirubin and crucifixion trauma, presupposing a narrative that he and his STURP colleagues were supposed to be testing, not assuming, when instead he should have been doing more experiments, like TLC or GLC-mass spec to identify it chemically.\nThat’s just hemoglobin for starters. Am I allowed to go back to calling it haemoglobin now? Let me do that, and  I’ll promise not to mention my leech hypothesis – at least not in the presence of children.  ;-)\n\n","date":"November 4, 2013 at 6:08 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49865","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"\ncolinsberry :\nLet’s take just the first of those, Kelly – the hemoglobin (there, see my spelling – I’m really trying hard to reach hands across the Atlantic this sunny morning in England ;-)\nWhat do you expect to see in blood that is 1 year old, a century old or 2 millennia old?\nIntact hemoglobin? If so, one should be able to get it to migrate on electrophoresis gels, or through gel filtration, and show by use of standards that it’s the real McCoy. I’m not aware of such evidence for intact hemoglobin, are you? So a crucial link in the evidence is missing, is it not, while anticipating the rejoinder that I’m simply asking too much of the Redeemer’s blood.\nOK, so let’s jump to the far end of the scale, where there’s still an intact free porphyrin, a very stable molecule by all accounts, which is what remains after globin and iron have been stripped out. A porphyrin chemist like Adler would have known precisely how to extract the free porphyrin of ancient blood, if suspecting that Hb was at intermediate states of degradation. So what’s the next step? It’s easy, because I’ve done it, or rather encountered free porphyrins on TLC plates. One needs only traces there to detect them by their intense red fluorescence under uv, so all Adler and Heller needed to do was run Shroud porphyrins against known porphyrin standards (of which Adler at least must have had a library of variants).\nTell me this, Kelly. Did you ever read of such a simple straightforward experiment  being done – i.e. to isolate the free porphyrins of Shroud blood, and run them against standards (and maybe do a mass-spec fingerprinting on eluted pigment?). I have not (which is not to say the data are not there, but if that’s the case, then why is it not publicized?). What we see instead are uv/visible spectra of pigments which are the bluntest of instruments in tetrapyrrole chemistry (excluding the Soret band of porphyrins) and when an anomalous spectrum is found for Shroud porphyrin, we see Adler immediately rushing to construct exotic hypotheses based on bilirubin and crucifixion trauma, presupposing a narrative that he and his STURP colleagues were supposed to be testing, not assuming, when instead he should have been doing more experiments, like TLC or GLC-mass spec to identify it chemically.\nThat’s just hemoglobin for starters. Am I allowed to go back to calling it haemoglobin now? Let me do that, and  I’ll promise not to mention my leech hypothesis – at least not in the presence of children.  ;-)\n\nColin,\nI would agree that additional, different experiments would have been helpful to supplement Adler’s analysis.  I have never felt this was due to Adler being out of his realm of expertise, but doing what he was particularly specialized in, and also considering the fact that the amount of sample was relatively limiting.  If given carte blanche with the forceps following their initial studies, I believe that Adler would have extended his work, including looking into a more detailed characterization and identification of the spectral profile.  However, the Soret band to me seems pretty telling.  I, too, would have liked to have seen more-I once posted on this blog, Ten questions I would ask Alan Adler-but I think you have to put in the context of the time-this wasn’t his own laboratory where the generation of samples was under his control.  Haemoglobin, sure :)\n\n","date":"November 4, 2013 at 6:27 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49866","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"Er, um, at the risk of stating the obvious, why employ the services of a top porphyrin specialist if not given enough blood to apply the technology that then existed?\nIn fact, you have touched on one of the more curious features of the STURP project – that neither Heller nor Adler went to Turin for that famous week. Had either been there, they could have insisted they be given sufficient scrapings, e.g. from the dorsal side, in order to apply their expertise.\nI’m trying to recall that disparaging term (Italian sound?) that has been used to write off the radiocarbon dating – yet there are those here who still insist that things would have been so much better organized had STURP with its expertise and management skills been in charge…\nDoh!\n\n","date":"November 4, 2013 at 6:41 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49868","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"A really helpful paper is “Age Estimation of Blood Stains by Hemoglobin Derivative Determination Using Reflectance Spectroscopy” in “Forensic Science International” by Rolf Bremmer et al. It’s behind a paywall, but I could pass it on to anyone who sent me a PM.\n\n","date":"November 4, 2013 at 9:44 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49895","author":"Hugh Farey","site":"shroudstory"},{"title":"Consider Rogers","post":"Does it discuss the Shroud controversy  or Heller or McCrone?\n\n","date":"November 4, 2013 at 10:05 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49897","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"After reviewing the Power Point, I expect that the paper doesn’t deal with  the Shroud. However, this new(?) might be a candidate for use on the Shroud.\n\n","date":"November 4, 2013 at 1:23 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49917","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"\nHugh Farey :\nA really helpful paper is “Age Estimation of Blood Stains by Hemoglobin Derivative Determination Using Reflectance Spectroscopy” in “Forensic Science International” by Rolf Bremmer et al. It’s behind a paywall, but I could pass it on to anyone who sent me a PM.\n\nThere’s a free powerpoint at http://www.slideshare.net/rolfok/ageing-bloodstains\nI contacted this lab last year, Rolf Bremmer was a graduate student in the lab who has sinced moved on-\n\n","date":"November 4, 2013 at 1:10 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49915","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"\nKelly Kearse :\n\nCharles Freeman :\nNo doubt one day someone will write a book about the evil, insincere, deceitful,etc, people who, for some reason, seem particularly drawn to researching the Shroud. I don’t know any of them so I have only the comments provided here to go on but, my goodness, they seem a crooked lot!\nPerhaps best to keep one’s head down and concentrate on the evidence, or rather lack of it.\n\nNo comment.\n\nA comment on my No comment.  This morning I chose not to respond.  This evening I am choosing to. It is a matter of personal judgement whether to continue to discuss with someone, or agree to disagree, or to simply ignore them-In my view, the  overhyping of non-results and the selective omission of others appeared a bit fit to order-but that is my opinion.  Beliefs are personal, skepticism of scientific results, including those under discussion, is healthy.  Everyone has their own viewpoint.  That being said, I find your insinuations and use of the words “evil, insincere, deceitful” extremely inappropriate.  No amount of skepticism or pro-authencity warrants such remarks.  I can assure, you, Charles Freeman, that I am not a deceitful or insincere person-I believe this is transparent in my discussions here from day one.  I am not always perfect in my conduct, but I am by no means evil.  You are not justified in saying that those who provide comments here are part of a “crooked lot”.\n\n","date":"November 4, 2013 at 10:21 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-49970","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"Kelly. As I said earlier, I am only repeating what commentators on the site have said about other Shroud researchers (of all persuasions and  among them perfectly honest ‘sceptics’). Need I trawl back among the posts? When you put them together very few people, especially the sceptics, seem to be of upright character if their opponents are to be believed!  That is the impression that one often gets but as I don’t know any of the characters involved in these attacks I am in no position to know whether they are justified or not. I just know that they divert attention from the evidence.\n I was standing back from that, and deploring it because personality and the ability to produce valid evidence are not the same thing. I have no idea  whether you have been one of the people who have suffered personal abuse or not. I have certainly been by name and actually got an apology for a libellous comment! McCrone, for one, is not around to do the same. It is not beyond the bounds of possibility that a new microscopic analysis of the Shroud will side with him rather than with his opponents and in that case his character will be irrelevant.We  have to wait and see.\n\n","date":"November 6, 2013 at 4:46 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50146","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"“It is not beyond the bounds of possibility that a new microscopic analysis of the Shroud will side with him rather than with his opponents” \nAgreed, Charles. It is time that McCrone’s detection of iron oxide outside of blood-bearing zones, but possibly in image-bearing ones, was re-evaluated in the light of Garlaschelli’s description of how the image could have been produced. While most of Luigi’s proposed red ochre will have flaked off, it would be interesting to compare the distribution of iron traces in image v non image zones. (Maybe someone already has – it’s been a while since I last looked at the iron story, but I do recall it’s not for the faint-hearted, given the different crystalline modifications of iron oxide that have to be identified and mapped).\n\n","date":"November 6, 2013 at 5:17 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50152","author":"colinsberry","site":"shroudstory"},{"title":"Consider Rogers","post":"Well said, Kelly! \nI think my first comments on this site were probably posted around April 2012.  Ever since that time I have waited in vain for a single gem of wisdom to inform me from the ranks of Art critics and so-called Byzantine experts, that might increase my understanding of their point of view, and so thereby come to some greater wisdom in such matters. Sadly I have had to come to the conclusion that there is in fact no such formal academic discipline as such; it is neither a science nor history as the rest of us might understand by that term, it is rather a type of arcane mystery religion whose infallible doctrines are to be given soulful assent by all neophytes who would seek admission to their ranks, independent of any kind of sensible objective evidence to the contrary.\nIt would add a far better and constructive purpose to their lives if they actually took up knitting, so that their otherwise wasted efforts might take on some useful semblance of productivity by which the rest of humanity might benefit even if only to some minor degree.\n\n","date":"November 5, 2013 at 6:53 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50023","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Consider Rogers","post":"David,\nYou remain one of the most astute observers of the Shroud community.  Is it something that New Zealand atmosphere that enhances your acuity.?\n\n","date":"November 5, 2013 at 7:19 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50032","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"‘It would add a far better and constructive purpose to their lives if they actually took up knitting, so that their otherwise wasted efforts might take on some useful semblance of productivity by which the rest of humanity might benefit even if only to some minor degree.\nGreat idea  about the knitting , Daveb, but some of us have busy jobs writing books on history, including relic cults, that others actually buy and learn from!\n\n","date":"November 6, 2013 at 4:51 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50147","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"DaveB , I think one of the reasons why  Byzantine experts cannot contribute much about the Shroud is that none of them can find any evidence for its existence in the Byzantine world. No expert has any time for the Wilson/Edessa theory so that leaves the Byzantine experts with nothing much to do, except presumably take up knitting. \n However, as you may or may not have read on this site, my own research on medieval relic cults has produced references to relics from ‘the Lord’s Tomb’ that came over in the first millennium from Jerusalem and are still in collections in northern France very close to Lirey. Yesterday, I came across references to stones from the Sepulchre in Jerusalem that had been brought back to the cathedral at Langres, just 125 kilometres from Lirey. Then there is a wealth of material on relics brought back from the Holy Land by crusaders, again direct to France.  Then there is bishop Gautier of Troyes  who was in charge of the allocation of the relics from Constantinople in 1204 and brought back many to Troyes, just twenty kilometres from Lirey (he is shown in a window in Troyes with a cup from the marriage feast at Cana!). Perhaps one of his retinue  brought back something as welI.  Then then is a native born man of Troyes, pope Urban IV who was Patriarch in Jerusalem before he became pope and lavished patronage on Troyes ( his basilica there still survives). Did he bring back any relics?\nIn my own work on medieval relics, the Shroud does not feature because it was one of many thousands of cults competing against each other and certainly not the most interesting or important  but I don’t think  we historians can be accused of sitting by when, as here, I am providing those who do want to concentrate on the Shroud  with lots of leads from my own researches. It’s hardly my problem if no one wants to follow these leads up.\n\n","date":"November 6, 2013 at 5:14 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50151","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"P.S. I have also provided information on an early  cloth with an image of Christ  in Memphis in Egypt. That is important because one of the massive problems about the Shroud is how it was preserved from the damp over centuries. Yet, if it were stored in Egypt then it stood a chance. I AM a sceptic overall but that doesn’t stop me spotting possibilities for further research on the Shroud when I see them! That is what i enjoy about being a  historian even if the Shroud is far down my list of interesting relics so far as the medieval period is concerned.\nI do think that the Jerusalem direct to northern France route that is known to have featured relics from quite early is the place to START for anyone genuinely interested in seeing if there is any convincing evidence for the Shroud before 1350.\n\n","date":"November 6, 2013 at 6:54 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50159","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"\nCharles Freeman :\nKelly. As I said earlier, I am only repeating what commentators on the site have said about other Shroud researchers (of all persuasions and  among them perfectly honest ‘sceptics’). Need I trawl back among the posts? When you put them together very few people, especially the sceptics, seem to be of upright character if their opponents are to be believed!  That is the impression that one often gets but as I don’t know any of the characters involved in these attacks I am in no position to know whether they are justified or not. I just know that they divert attention from the evidence.\n I was standing back from that, and deploring it because personality and the ability to produce valid evidence are not the same thing. I have no idea  whether you have been one of the people who have suffered personal abuse or not. I have certainly been by name and actually got an apology for a libellous comment! McCrone, for one, is not around to do the same. It is not beyond the bounds of possibility that a new microscopic analysis of the Shroud will side with him rather than with his opponents and in that case his character will be irrelevant.We  have to wait and see.\n\nCharles, I initially entered this discussion, because some scientific terms you were using caught my eye. The initial comment I chimed in on was one that mentioned genetics.  I asked you three specific questions regarding what you meant by where the Son of God might fit in genetically, not to stir anything up, not to deplore you view-I was simply to wanting to understand what you were referring to.  No answer.  Then the discussion shifted to blood studies, okay, I’m still in-up to a point.  I respect a skeptical discussion-up to a point.  I don’t believe it’s fair to choose the evidence you like, cafeteria style, while refusing to discuss the whole of it.  No matter how cleverly one can write, when the specifics and details are lacking/selectively omitted, it comes across.  If the Shroud is dated to the first century, and the blood is shown to be human blood, that of a male, type AB (or whatever type one wishes),  bilirubin is detected (at whatever levels one personally desires), and even trace amounts of potassium (eureka!  it’s blood!) are detected…well, then what?  Does it scientifically prove that the Shroud is the burial cloth of Jesus?  I say no. \nI believe there was a decision/mandate set forth on this blog that insinuations about intellectual dishonesty without proof would not be tolerated.  Referring to anyone specifically or generically as being “evil, insincere, deceitful” and a “crooked lot” in my opinion, certainly falls within this category. These are very strong, very specific words.  I don’t believe they should be used lightly.  In my opinion, they shouldn’t even be used at all, even in the context of “deploring”.\n\n","date":"November 6, 2013 at 7:05 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50161","author":"Kelly Kearse","site":"shroudstory"},{"title":"Consider Rogers","post":"Charles,\nWhat I think you are missing is that the Shroud is not a work of art. Whatever your infatuation with Walter McCrone, for years he used is “debunking” of the Yale Vinland map as a credential. It was one of the things that impressed STURP members early on. Gove in his memoir after discussing the Shroud with McCrone in 1977-78, concluded he was seeking to polish his credentials withe proving the Shroud a fake.\nYou may may feel John Heller an unreliable witness or scientist, you sight one individual and rush to the 1973 test which Heller found to be unreliable.  I believe Heller to be a very credible scientist. Gove’s dish of Heller in his memoir would be laighable if it were not, I will use the word “dishonest.” Also, the earliest work on the Shroud by STURP scientists before there was even a formal STURP revealed a lack of “directionality ” in the image. Also the image is finer than any known paint brush (cf Heller again). McCrone frantically came up with various theories  and theories about it being a painting, but none of them flew. And eventually his findings on the Vinand map were challenged.\nHere’s were you have an near insurmountable problem: the Shroud is not a work of art. As far as the Byzantine is concerned (depending on how you define Byzantine, Paul Vidnon who was among the first scientific-scholars to report on the Pia photos also rejected it as a work of art. Vignon was also an accomplished artist.\nLater, he published a book at the start of of World War II that examined in great detail the relationship of the image of the Shroud to what I assume you mean by Byzantine. Vignon’s book was an elaborate expensive production and was never translated into English. I was privileged to examine a copy at the NY Public Library., two years ago. However Vignon’s work was first noticed by Walsh and then popularized by Ian Wilson and his examination of the Vignon markings has been quite sophisticated. Not all the markings are representive in each piece of Byzantine art and some are included and some not in various places. \nAbout the history of art you might have something to contribute. However, with all due respect, you have a habit of trashing those who reach conclusions different than yours. i.e. Thomas de Wesellow. For some reason you review of his book “The Sign” had disappeared from the Amazon page on the The Sign. Am I correct on that? My last attempt to find it was unsuccessful. Perhaps I didn’t go deep enough.\nIf you can as an art historian identify the school or tradition from which the Shroud image might have come, it might be helpful. In From Christ to Coke, Martin Kemp attempted to do a cursory examination and I would submit failed miserably. But that’s my opinion and I shall address it later. Kemp, when not being cursory, is in fact an excellent art historian and his work as an appraiser can involve some deep science. No so in the case of his Shroud appraisal. I will write about that in my manuscript.\nNow I have  to get to court. If all you have is McCrone, HONESTLY you have nothing.\n\n","date":"November 6, 2013 at 7:25 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50164","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"‘I believe there was a decision/mandate set forth on this blog that insinuations about intellectual dishonesty without proof would not be tolerated. Referring to anyone specifically or generically as being “evil, insincere, deceitful” and a “crooked lot” in my opinion, certainly falls within this category. These are very strong, very specific words. I don’t believe they should be used lightly. In my opinion, they shouldn’t even be used at all, even in the context of “deploring”.\nI totally agree- that was the point of my post.They have been used all too often but not by me.\nAs I am not a scientist or blood specialist and had on one of my tours a professor who was a leading authority on physiology, I was talking to him about this.  I sent him every article I could find that suggested that there might be blood on the Shroud. He replied that he had read them carefully (he is now retired) and could see nothing that suggested that there was blood. As I said earlier, on that basis I am happy to leave the question open.\n\n","date":"November 6, 2013 at 8:09 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50173","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"John. Come on! I only said that McCrone might be proved right and so he might or might not when more sophisticated tests are done on the Shroud! I have no means of judging whether he was right or wrong myself but to say that it is impossible that he was right when he was a leading authority in his field seems to me to be rather sweeping.\n\n","date":"November 6, 2013 at 8:11 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50174","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"P.S. I have no idea where my review of de Wesselow went to. I haven’t been back there for months. The question of whether the Shroud was a work of art, in the sense of the images having been created artificially and not by a decomposing human body, is another of several that I am leaving open. Like many others I have some ideas of it as a work of art but I wouldn’t take these further until I went through them with a specialist in medieval painted linens.\n\n","date":"November 6, 2013 at 8:19 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50175","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"I do have a method of judging whether McCrone is right or wrong. It’s the detailed report of the STURP team and the peer reviewed articles that demonstrated that fact. It is not a painting. \nMcCrone only published his claims in a magazine he controlled. Of course the main stream media pick that up and it gets elevated in the minds of any of the public who might be paying some attention. \nIf you have a peer reviewed source supporting McCrone’s determination that the Shroud was a painting, I would like to know about it.\nNow I am really off to court.\n\n","date":"November 6, 2013 at 8:50 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50180","author":"John Klotz","site":"shroudstory"},{"title":"Consider Rogers","post":"You could try Acc. Chem. Res. 1990, 23, 77-83.\n\n","date":"November 6, 2013 at 9:12 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50182","author":"Hugh Farey","site":"shroudstory"},{"title":"Consider Rogers","post":"‘If you have a peer reviewed source supporting McCrone’s determination that the Shroud was a painting, I would like to know about it.’\nJohn, you are completely missing the point. I am only talking about the hypothetical case of the Shroud being subjected to new comprehensive tests and then seeing whether there is any material evidence to back McCrone or not. This follows from earlier posts that suggest that McCrone’s results were not to be trusted because he was personally ….well, you name it.\nI do not take the various STURP tests of 1978 as definitive for all time.The team did not even include any expert on ancient linens and was largely self-appointed.  Some would query the tests as not even definitive in their own time. Now we have thirty-five years of enormous developments in all the tests that need to be made on the Shroud and, if it like many other artefacts from the ancient world that new tests have been applied to, the results might well show something that no one researching the Shroud has yet conceived of.\nUntil recently there were books on the horses of St. Marks that showed with all kinds of ‘evidence’ that they were fourth century BC. Then when work was done on the gilding method (in the British Museum labs, dare I say!), it was found that it would have been impossible to have made them before the second century AD. This is the way research works.\nAre you really saying that the 1978 tests, such as they were, are really invulnerable to being challenged by more advanced methods?\n\n","date":"November 6, 2013 at 9:48 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50186","author":"Charles Freeman","site":"shroudstory"},{"title":"Consider Rogers","post":"\nJohn Klotz :\nIt’s the detailed report of the STURP team and the peer reviewed articles that demonstrated that fact\n\nIt is interesting/curious to me to see how is important, for the people in this blog, if an article is published under the control of the mechanism of the “peer review” (I ma speaking now indipendently from the Shroud or mcCrone etc. etc.). Most of you are not European?\n\n","date":"November 6, 2013 at 9:22 am","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50184","author":"Andrea Nicolotti","site":"shroudstory"},{"title":"Consider Rogers","post":"Michael Gordin in his The Pseudoscience Wars focuses on Immanuel Velikovsky and his Worlds in Collision , a mishmash of ideas about Venus hitting the earth and changing the course of history.   The Velikovsky camp had their own supportive magazines but you had to be ‘peer-reviewed’ before you could get an article accepted. So to rephrase an old saying: ‘Who peer reviews the peer reviewers?’ Are the papers to be read at next year’s conferences ‘peer-reviewed’?\n\n","date":"November 6, 2013 at 2:46 pm","url":"https://shroudstory.com/2013/11/02/consider-rogers/","cat":"news_&_views","id":"comment-50208","author":"Charles Freeman","site":"shroudstory"}]
