[{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"It’s not Ray Rogers’ integrity I question, but his objectivity. What made him turn by degrees into a hatchet man on behalf of authenticity, writing critiques and papers on anti-authenticity thinking? Why were there no caveats attached to his first reference to Roman-era linen when first bringing starch coatings and saponins into the Shroud literature? It seems to coincide roughly with his discovery that the TS image could be stripped off fibres with adhesive tape, and was exceedingly thin, below the resolving power of the light microscope. Why immediately invoke a ‘starch impurity coating’ when any botanist could have told him to first consider whether the image might reside on the primary cell walls of the flax fibres, assuming the latter survive retting? PCWs are in the same range of thickness as that proposed by Rogers (200-600nm),roughly the same as gold leaf.\nWhy do the likes of Barrie M.Schwortz and others (invariably non-scientists) persistently portray criticisms of a scientist’s objectivity and hypotheses as constituting a personal character attack? Science would never progress if one was forbidden to question the objectivity of scientists, living or dead. Rogers must surely have realized that by volunteering to work on the TS his objectivity would come under a bigger microscope than the one he used to cast doubt on the legitimacy of the radiocarbon dating.\nThere’s a sense in which Barrie M.Schwortz is as guilty, if not more so, of making unjust character slurs on the folk he collectively lumps together as impugning the “integrity, character and credentials” of the late Raymond Rogers. For my part I have occasionally felt the need to remind folk it was not “Dr.” Rogers or “Professor Rogers” but Mr. Rogers (he had no formal research training, which in no way precludes doing first class research). I suggested he had been “used” by those who provided him with TS threads of dubious origin and/or uncertain chain of custody, and that the peer-reviewed journal  (Thermochimica Acta) to which he submitted his final paper on the allegedly spliced/dyed threads was one that he helped to found and had been a longtime editor. Given he was close to death in 2005 and knew it, I understand that speed was of the essence in choosing a journal (his “own”). By the same token, a little less bandying around of the term “peer-reviewed” might be in order for so controversial a paper as his last, one whose objectivity (again) is very much in question if based on little more than suggestions of sampling error or atypical fibres. What’s a typical fibre anyway if one hasn’t ALSO sampled from across the entire TS? People in live glass houses  etc etc.\nRIP Raymond N.Rogers, a gifted chemist and experimentalist, but susceptible as we all are to unconscious bias that can compromise objectivity, sometimes without one being fully aware of it.\n\n","date":"December 10, 2014 at 5:25 am","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175510","author":"Colin Berry","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"“Why do the likes of Barrie M.Schwortz and others (invariably non-scientists) persistently portray criticisms of a scientist’s objectivity and hypotheses as constituting a personal character attack?”\nLet me think… because you’ve used personal character attacks against Ray Rogers? because they have been posted on this blog?\n\n","date":"December 10, 2014 at 12:11 pm","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175562","author":"anoxie","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"Wow, that’s awesome.\n\n","date":"December 10, 2014 at 8:08 am","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175523","author":"Andy","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"There are some clarifications to make, and these are the following:\n– It is obvious that Ray Rogers was a a serious scientist and would not publish anything to fool people. I only take exception to what should be called not “unconscious”  but “conscious bias” that could be detected in his approach, and that was positivism.\n– On the other side of the spectrum are those who have been called “miraculists”, included among these is the following interviewee:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nIt was a mistake to put this interview on the “black list” in the last shroud.com update simply because it was an interview and not a paper. In the fifth paragraph of the introduction it is clear not only that the reader is invited to judge for himself the responses in the interview but also that what is claimed is being prepared to be published in a peer-reviewed journal. That being so, I am willing to respond to any doubts about the questions asked, the rest will have to wait for peer review. On my part, I can say that I work independently, am not anyone’s spokesman, and there is a lot more to come that will have to wait till 2015.\n– It has been commented more than once on this blog that only chummies were allowed to publish what they wanted to say  — rubbish or not — in Shroud newsletters and other publications. So why complain if Shroud researchers have to post their articles and papers on other websites, beyond the realm of Shroud studies? Curiously, the same researchers who have their papers on Shroud websites and newsletter also post their material on other sites and why is this so?\n– As for peer review, Dr. Frederick Zugibe had his paper on the Jospice Mattress Imprint posted on a Shroud website without peer review. I was not given a chance, only when my article on the topic was run on an e-mail list from Ohio. In my article I dwelt on the partial head image that Dr. Zugibe failed to tackle. Why? It was convenient for him, he was proposing bilirubin. Father Francis 0’Leary had emphasized this head image.  \n– Lastly, I have noted that there there is a cult-like devotion to Ray Rogers in some Shroud circles as though what he wrote is gospel truth. That has to be rejected in view of the positivism I detected in his approach. It is not that I am in favour of the “miraculists”, but I do believe that if the Shroud did indeed wrap the body of Jesus then the image is there for a purpose. Why should only Jesus’ body have been lying like bread baking in an oven, waiting for a Maillard effect or some other process? Were other bodies lying in air-conditioned tombs?\nThe answer to this question will be sought in the article to be published in the beginning of next year.\n\n","date":"December 10, 2014 at 9:15 am","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175532","author":"Louis","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"Hello, Louis. I am amazed that apparently 99% of shroud skeptics completely ignore the Jospice Mattress Imprint. I know that Hugh Farey knows about it, but the other skeptics don’t even bother. Since it is the only other documented (photographed) case that can be compared to the Shroud of Turin, one can assume that the majority of skeptical theories can be thrown out the window. The only other skeptic that can probably have a say on the Jospice Mattress Imprint is Colin Berry since he is a scientist, and I remember that Piero asked him about it, but Berry said that the subject didn’t interest him. That he would rather “stick to the details that interest him”. However, he did say that he was open to new ideas, so We can hope that at some point in the future, Colin Berry can join in the conversation on it. The other skeptics can only give out their amateur opinion if they ever have interest in it. Do you know if any member of the STURP team, apart from Barrie Schwortz, knows/knew about it? Do you also know if there are other possibilities apart from the bilirubin hypothesis professed by Dr. Fred Zugibe or in your case, telergy?\n\n","date":"December 10, 2014 at 1:58 pm","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175583","author":"Uriel","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"Hello Uriel\nIt is possible that Shroud sceptics ignore the imprint because they are unwilling to admit that Parapsychology, recognised by the UN, can explain some things. It would be wrong to confuse this field with Spiritualism, although, unfortunately this  appears to have been done in some cases by London’s SPR. C.G. Jung was a co-founder of the Society, had dabbled in the occult through the influence of relatives and it was mod during the period. He then gave it up and moved to other areas. See my article “What did Jung see in the Shroud?” on the Collegamento pro-Sindone website.\nPiero has attributed the imprint to something to do with the mattress dye. Does it explain how the partial head image got to the mattress? No, it doesn’t and the same can be said about bilirubin. :\nhttps://www.academia.edu/4691379/Can_the_Jospice_Mattress_imprint_be_compared_to_the_Image_on_the_Shroud\nIn First World countries the undertaker is called when a person dies and the work is quick. That is not so in many Third World countries, where the body of a poor man can lie for hours on a mattress on a stretcher waiting for relatives, if any, who can give a decent burial. Sometimes the body lands on the tables of students of medicine. I have seen bodies being offered for black magic rituals. That is the world we live in. Anyway, the point is that no imprints have been seen in these cases.\nIt has also been said in England that it is the work of an artist. I have chosen to ignore this view because the interview-article, the link to which is given above, has the scientist saying that it was a Kirlian process. That is closer to the telergy I proposed. Once again, the partial head image — emphasised by good Father Francis O’Leary, with whom I had some contact — is ignored in the case proposing an artist’s image.  \nI can’t say with certainty if all STURP members knew/know about the imprint. Most of them probably did/do because it was Ian Wilson who brought the topic into the debate on the Shroud. When I asked him whether he believed that it was the same process that formed the Shroud image and the Mattress imprint the response was negative. That meant we were talking the same language and it was good.\n\n","date":"December 10, 2014 at 3:09 pm","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175592","author":"Louis","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"Thank You Very Much for the information, Louis. These subjects are quite fascinating to me, and it is great to know from an expert who has studied them in depth. Keep up the great research!\n\n","date":"December 10, 2014 at 3:24 pm","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175594","author":"Uriel","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"You’re welcome, Uriel. Some research on psychical energy in psychics — I prefer to say psychics instead of “mediums” —  will be done in situ next year, after two articles are published. It is research that can drain you of most of your energy, both physical and mental, when you are witnessing some phenomena.\n\n","date":"December 10, 2014 at 4:35 pm","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175605","author":"Louis","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"Louis,\nYesterday I have appreciated your attempt to clarify.\nWe should avoid (as much as possible) the cult of personality and I believe Rogers himself\nwould have agreed with us on that  on this behavior more moderate …\nIn any case [if I am right] Barrie Schwortz wrote that Ray was graduate, but Colin disagreed about the ability by Ray Rogers to do advanced research\n(perhaps because Rogers “was not “Dr.” Rogers or “Professor Rogers” but Mr. Rogers” …)\nBut …\nNow I ask to you:\n“Please, for Jospice Imprint… doesn’t speak only about Parapsychology, there are also questions regarding Chemistry and Materials Science.\nFirst of all: the mattress was made of Polyamide and then it was not polypropylene.”\nSorry…\nI don’t believe you was able to search the entire truth\nbecause you refused to take into account the cold dyeing of polyamide.\nThrough doing and learning, people\nacquire their beliefs and attributes.\nHere we are not hooded and fanatic persons.\nHere the story:\n>At 5.55 a.m. Les died.\n>At that point, no-one could have guessed how important Les’ death was to become.\n>When other nursing duties had been completed, Les’ body was washed and prepared for the undertakers who arrived at approximately I 1. 00 a.m. [My note: It seems to me that here there is a problem of exact time! Perhaps = 11.00. So, if I am right … there were 5 hours (of “cold dyeing”) at disposal!]\n>One of the nursing staff was detailed, immediately Les’ body was taken away, to wash down the bed and the mattress cover, in preparation for the admission of a new patient. She scrubbed away but found the task was taking much longer than she had first thought.\n>There were some difficult stains which were proving to be particularly obstinate. Scrub as she might, they seemed to be indelible. …\nLink:\nhttps://www.shroud.com/pdfs/imprint.pdf\nSo…\nDo you want to continue to indicate the strange story of the partial head imprint without taking into account the possible cold dyeing for polyamide?\nWe should develop a new document on the issue that takes into account the knowledge of Chemistry of Materials Science and Applied Microscopy.\nI am waiting for your reply and I hope you\nwant to answer on that question before the beginning of Next Year.\nThank you in advance.\n\n","date":"December 11, 2014 at 8:33 am","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175701","author":"piero","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"Errata corrige:\non this behavior \nInstead of:\non that on this behavior\n— —\nWe have to search what is the affinity of the substrate\n(polyamide) for different types of biological fluids.\nFor anionic dyestuffs dyeing the treated substrate\nwas rolled up and rotated at a temperature of 20°-60°…\nBut, in our case, we can not go over 30 degrees Celsius.\nWe have to explore what is the best condition of\nbiological fluids fixation.\nWe also need to find which is the minimum time required\nfor effective fixation of “biologic dyeing.”\nI think this requires some preliminary experiments.\nWhat is your opinion?\n\n","date":"December 11, 2014 at 8:51 am","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175703","author":"piero","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"Excuse me, but unfortunately I have to do a fix yet!\nFor dyeing with anionic dyestuffs, the treated substrate\nwas rolled up and rotated at a temperature of 20°-60°…\nInstead of:\nFor anionic dyestuffs dyeing the treated substrate\nwas rolled up and rotated at a temperature of 20°-60°…\n— — —\nI have found a text:\nHandbook of Biological Dyes and Stains:\nSynthesis and Industrial Applications\nR. W. Sabnis \nISBN: 978-0-470-40753-0\nA complete, up-to-date resource of information on more than 200 dyes and stains\nHandbook of Biological Dyes and Stains is the most comprehensive volume available on the subject, covering all the available dyes and stains known to date in the literature for use in biology and medicine. Top dye expert Dr. Ram Sabnis organizes the compounds alphabetically by the most commonly used chemical name. He presents an easy-to-use reference complete with novel ideas for breakthrough research in medical, biological, chemical, and related fields…\n— —\nUnfortunately I have not read this text…\nand … we’ve all had the experience of someone lying to us…\nIn any case I am curious about the effect of washing the polyamide samples (polyamide samples dyed … or only stained) with biological detergent liquid… and see what\nhappens.\nSo,\nI suggest to you to read also other chemical (or bio-chemical) texts…\n\n","date":"December 11, 2014 at 9:16 am","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175707","author":"piero","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"A bit off-track but interesting to those who are in the realm of Shroud studies for the sake of religion. The truth is that Jesus did not exclude anybody:\n http://www.salon.com/2014/11/03/why_conservative_christians_would_have_hated_jesus_partner\n\n","date":"December 10, 2014 at 1:05 pm","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175576","author":"Louis","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"I believe the embrace has been extended further by the current pope. Dogs, cats and possibly all animals may be heaven bound. http://www.theguardian.com/world/2014/nov/27/pope-francis-hints-animals-heaven  This is one interpretation of recent comments he made. Others in the church hold to the position of the previous pope, Benedict XVI. He firmly posted a “No Entry” sign for all non-humans..\n\n","date":"December 10, 2014 at 6:22 pm","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175609","author":"aljones909","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"That is Pope Francis’ personal opinion, it is not an ex-cathedra  pronouncement. Unfortunately there are a great many things that have to be addressed that lie beyond the purview of the Bible. Jesus had things to tell us about our lives and he himself did not bother about everyday life. Does that ring a bell? It does. He did not reveal everything.\nSchweitzer thought that the key to Jesus’ secret lay in the parables and he was right. They continue to be enigmatic. The main problem was that he also judged them to be open to the interpretation of a selected few, and that is somewhat Calvinist.\n\n","date":"December 10, 2014 at 8:08 pm","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175622","author":"Louis","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"I didn’t know Rogers so I can’t speak to his character, nor am I competent enough to judge his work. What I see here is his colleague, Barry, standing up for his posthumous reputation. It’s not about science, it’s about human friendship. And I have no problem with that.\n\n","date":"December 10, 2014 at 1:48 pm","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-175581","author":"David Goulet","site":"shroudstory"},{"title":"Remembering Ray Rogers at the St. Louis Conference","post":"Reblogged this on Best of Shroud Story.\n\n","date":"July 11, 2015 at 6:21 pm","url":"https://shroudstory.com/2014/12/10/remembering-ray-rogers-at-the-st-louis-conference/","cat":"news_&_views","id":"comment-205312","author":"Dan","site":"shroudstory"}]
