[{"title":"A bit of interweaving in the Arizona sample?","post":"Read page 201 (http://forums.randi.org/showthread.php?t=226761&page=201) of the merged thread, comments #8011 to #8021. It is hilarious.\n\n","date":"June 29, 2013 at 9:32 am","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38393","author":"Paulette","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"– This is the forum/thread I’ve been participating on since 2/12.  I haven’t done very well and could use a lot of help — especially, with research and answers to their numerous questions and claims.\n– For instance, how do we explain the “banding” that remains identical from the main body of the Shroud to, and through, the sample — if we think that  significant reweaving is required to account for 1300 years in the dating?\n– Thanks.\n— Rich Savage (Jabba)\n\n","date":"June 29, 2013 at 10:32 am","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38395","author":"Rich Savage","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"Rich,\n Benford and Marino in their investigation sought out reweave experts who had no trouble spotting the invisible reweave and identifying but they were familiar with the invisible reweave. After the first hullabaloo they checked even further. It was identified by experts on the French, invisible reweaving process.\nAn excellent article on the invisible reweaving by Benford and Marino is located at\nhttp://www.shroud.com/pdfs/histsupt.pdf\nThey first came to attention of the Shroud community in 2000 by  presentation a Shroud Conference at Ovieto, Italy. Barrie Schwartz was there and was impressed, so he published there paper on Shroud.com\nRay Rogers called Barrie objecting to his publishing items from the “lunatic fringe” and that he could rebut them in fifteen minutes. Schwortz challenged him to do just that. Rogers hung up and examined some fibers from the Raes sample that had been given to him in 1978.\nHe didn’t call back in five minutes, but when he did he exclaimed, “They’re right!”\nActually, the findings by Rogers had been presaged twelve years before when a laboratory was contacted by Oxford to examine some fibers found in their sample. The results of that examination were never revealed by Oxford but shortly after the announcement of the C-14 results, an article was published about the Oxford fibers that totally presaged Rogers, Benford and Marino by 12 years. see\nhttps://shroudstory.com/2013/06/25/cotton/\nwhich contains a copy of a BSTS report published two years later in 1990.\nYou might also check:\nhttps://shroudstory.com/2013/06/27/an-modest-inquiry-from-john-klotz/\n\n","date":"June 29, 2013 at 11:47 am","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38398","author":"John Klotz","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"Rich, you belong over here. That is a good question about the banding in the C14 sample. I wasn’t aware that there was any. Do you have a picture?\n\n","date":"June 29, 2013 at 1:33 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38401","author":"Paulette","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"Paulette,\n– Sorry not to respond sooner — have a lot to read and think about…\n– I don’t have a picture, but I’ll see if I can get a copy of Jackson’s paper claiming to show how the banding continues through the region that the sample was taken from.  I do wonder about his use of “region” to describe what he sees — does the banding clearly go through the sample itself, or just through the general area?  I’m biased, and hoping the latter.\n— Rich\n\n","date":"June 30, 2013 at 1:12 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38422","author":"Richard Savage","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"Rich, try this:  https://shroudstory.com/?s=banding \n\n","date":"June 29, 2013 at 1:38 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38402","author":"Paulette","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"Paulette,\n– Whew!  Interesting stuff.\n— Rich\n\n","date":"June 30, 2013 at 1:14 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38423","author":"Richard Savage","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"Paulette,\n– I don’t quite understand Rogers’ explanation for banding itself, and don’t think I can effectively communicate what I’m tripping over.  Do you have an explanation, or know of a link with an explanation?\n— Rich\n\n","date":"June 30, 2013 at 2:24 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38427","author":"Richard Savage","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"None of the references above, I’m sorry to say, is completely satisfactory. There is no doubt that ‘almost invisible’ re-weaving exists, and there is an excellent London firm that specialises in it. However, the term ‘invisible’ is not meant to mean that such a repair is wholly undetectable, and Benford and Marino’s blurred pictures of large areas of tapestry are not convincing evidence that it is.\nLook, at as high a magnification as you can, at the Schwortz photo above. Is it uniform? Or is about half of it different from the other half – either in two separate areas, or simply half the threads whereever they are, are different from the others? Or is it fortuitously true that this sample is in fact all old, or all new?\nRogers’s famous splice, which was subsequently analysed by Villarreal, shows two bits of cotton butt-joined together and glued with a darker-coloured water soluble gel. Can you see anything like this in the sample above?\nAs for the banding, I think the distinct continuity of the weft threads, at least, would be shown in the “transmitted light” photos taken by Barrie Schwortz, and the “X-ray” photos taken at the same time by the STURP team. Unfortunately the versions of these on the internet are not of sufficiently high resolution to follow them closely enough. Are the originals any clearer?\n\n","date":"June 29, 2013 at 2:16 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38403","author":"Hugh Farey","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"For those that can access it there is a very good good radiograph of the top left hand corner (as you look at it) of the Shroud , exactly the spot where the Raes sample and the radiocarbon -14 samples came from- but larger than that .eg. about 40cms by 30cms as Fig. 7 in Rogers and Schwalbe’s article ‘Physics and Chemistry of the Shroud of Turin’ in Analytica Chimica Acta, Vol. 135 (1982) . Rogers and Schwalbe used it to show that the banding, which is clearly shown, went across the seam which runs along the top of the cloth through into the main body of the Shroud. There is a clear line at the bottom of the radiograph e.g. on the left side of the Shroud,, where the Raes sample was taken from, but the radiocarbon-14 samples that actually went to the labs are much further in, beyond this line. if there was reweaving then it did not disturb the bands that run from the top of the Shroud well into its main body. But isnt’ this what John Jackson said in his article claiming that the rc dates were contaminated by carbon monoxide? It is ironical that Rogers himself used a radiograph in 1982 that seems to be evidence against his own argument twenty years later but perhaps other can see reweaving that  Jackson and I cannot see. Anyone able to post this radiograph which i assume is the property of STURP ( no acknowledgment is given in the 1982 article)?\n\n","date":"June 30, 2013 at 4:55 am","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38417","author":"Charles Freeman","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"Quote from John Jackson ‘A New Radiocarbon Hypothesis’ , Turin Shroud Center of Colorado, May, 2008,(para one).\n ‘One hypothesis is that the linen sample used in the radiocarbon dating actually came from a medieval ‘re-weave’.While this hypothesis has been argued on the basis of indirect chemistry, it can be discounted on the basis of evident bandings in the 1978 radiographs and transmitted light images of STURP. These data photographs show clearly that the banding structures (which are in the Shroud) propagate in an uninterrupted fashion through the region that would, ten years later, be where the sample was taken for radiocarbon dating.’\nI assume that the radiograph in the Rogers article of 1982 is from the  STURP collection referred to by Jackson and we must leave it to them ( or John Jackson) to publish it so everyone can have a look.\n\n","date":"June 30, 2013 at 5:04 am","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38418","author":"Charles Freeman","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"Damn, I see the threads he’s talking about. It looks possibly like a smaller type thread weaved in between thread 18&19. Two threads can actually been seen, a main thread apart, one below the other. Sure looks like a mending  to me.\nInteresting…\nR\n\n","date":"June 29, 2013 at 9:04 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38411","author":"Ron","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"It is evident that more research on the threads will be needed and very likely that new findings will emerge. But, coming to Randi, who is said to have researched occult and the paranormal, two very different things, one must presume that as a magician he can easily detect sleight of hand. In the case of Sai Baba (India), challenged by Dr. Abraham Kovoor (Sri Lanka) and parapsychologists from different countries, the history is known. So much for magic. How could Randi research genuine paranormal phenomena, which are spontaneous? Would he judge Abraham Lincoln to have been a liar, leaving aside Mary Todd Lincoln’s interests? It is known that the mind is capable of neutralizing space and time in genuine paranormal phenomena. Would Randi judge Jesus to have been a magician? Magicians do not heal and cure, and the secular and sceptical Jewish archaeologist Shimon Gibson has acknowledged that it was precisely because of his healing and curing activity that made Jesus hated and feared by the High Priests, leading to the crucifixion.\n\n","date":"June 30, 2013 at 5:28 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38435","author":"Louis","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"Louis,\nThe answer may well lie in the quanta. Some scientists are exploring the ability of hum sonsciousness to act independemt of sp[ace and time. There is an intersting, and intriguing video of Stuart Hameroff who is head of a consciousness project at University of Arizona. Yikes, don’t let Jull find out.\nI cite the video in a blog piece I wrote last year that I think Dan Picked up. http://johnklotz.blogspot.com/2012/08/michael-redux-quantum-mechanics.html\nThe Hameroff video from “Through the Worm Hole” hosted by Morgan Freeman:\nhttp://johnklotz.blogspot.com/2012/08/michael-redux-quantum-mechanics.html\n\n","date":"June 30, 2013 at 5:37 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38436","author":"John Klotz","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"The Hameroff video is http://vimeo.com/39982578.\n\n","date":"June 30, 2013 at 5:37 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38437","author":"John Klotz","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"John, thanks for the lead, I will go through your blog the soonest possible because we have common interests. Some two years ago I received a book on theology published in England for review but the fact that the author sort of ignored the Gospel according to John kind of put me off. There are particles of Revelation in nature , Father Karl Rahner wrote, and I have seen scientist-theologians with whom such topics were discussed rejecting such a view, insisting that there was much more in nature than what the Jesuit theologian thought there was. The author of the book propounded such a view, but at the expense of rejecting John and thus concentrating only on the synoptics.  It depends on how phenomena in nature are interpreted and Rahner did not have access to information about the universe that we now have.\n\n","date":"July 1, 2013 at 6:51 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38486","author":"Louis","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":" \nLa esquina Raes-C14 ANTES de cortar las muestras. Está muy desestructurada.\nCarlos Otal\n\n","date":"July 1, 2013 at 3:10 am","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38454","author":"Carlos","site":"shroudstory"},{"title":"A bit of interweaving in the Arizona sample?","post":"Nice find Carlos, thank-you.\nR\n\n","date":"July 3, 2013 at 12:04 pm","url":"https://shroudstory.com/2013/06/29/a-bit-of-interweaving-in-the-arizona-sample/","cat":"carbon_14_dating","id":"comment-38567","author":"Ron","site":"shroudstory"}]
