[{"title":"Brad H. Gore Says","post":"Has perhaps Brad Gore, one of the authors of Nature paper on C-14 (made in 1988 on the Turin shroud) some answers to the following questions?\nMany thanks in advance.\n-1) In the Nature report it is stated that “The results … yield a\ncalibrated calendar age range with at least 95% confidence for the\nlinen of the Shroud of Turin of AD 1260 – 1390….”\nHow do you reach a 95% confidence level if the corresponding Chi-\nsquare value (reported in Table 2) is 6.4?\n-2) R. Van Haelst and others corrected the errors written in the\nNature report and obtained the following conclusion. The results of\nradiocarbon measurements of Arizona, Oxford and Zurigo labs yield a\ncalibrated date of 1280-1300 BC with only a significance level of\n1.2%. These results therefore furnish the conclusive evidence that\nthe sample used by labs are NOT homogeneous in C-14 content.\nWhich are your comments to this statement?\n-3) The strip cut from the Shroud in 1988 was similar to a rectangle\nof ~21 mm x 81 mm, but only a part of it of ~17 mm x 41 mm was used\nfor dating; why, from Nature report it results: “a strip (~10 mm x 70\nmm) was cut”? Was perhaps dated a different sample by the labs or was\nit only a mistake?\n-4) One of the fundamental hypotheses of the 14C method is: no\ncontamination exists in the sample so all the 14C measured derives\nfrom the vegetable under consideration.\nThe body image formation process is still not explained in the Turin\nShroud image.\nHow can you be sure that this fundamental hypothesis is verified in\nthe present case and how can you demonstrate that there was no any\nchange in the chemical structure of the linen fibers, also in terms\nof C-14, due to the image formation? (A. Adler, R. Rogers and others\ndemonstrated that there was a chemical change in the image fibers).\n-5) From Table 2 of Nature report, it results, for Sample #1, a mean\nradiocarbon date from Arizona lab of 646 ± 31 years instead of 646 ±\n17 years. Why it was never corrected this mistake?\n-6) The mistake in question (5) derives from a previous formula in\nwhich the right 17 value was used instead of the wrong 31. In\naddition, using 31 instead of 17 in the mean date from Arizona lab of\n646 ± 31 years, resulted a significance level of 4.17% that was\nrounded to 5% to accomplish the predefined limit that allowed a\ncombination of results. These data lead to think to a possible\nmanipulation.\nWhat is your comment?\n-7) Using the corrected value of 17, a significance level of 1.2%\nresults, very lower than the limit of 5%.\nWhy the data were combined? Why the measurement were not repeated as\nit should have been done?\n-8) In Nature report, just before the Conclusions it is written: “The\nresults, together with the statistical assessment of the data\nprepared in the British Museum, were forwarded to Professor Bray of\nthe Istituto di Metrologia ‘G. Colonetti’, Turin, for his comments.\nHe confirmed that the results of the three laboratories were mutually\ncompatible, and that, on the evidence submitted, none of the mean\nresults was questionable.” Do you still agree with this statement?\n-9) Someone has observed that even if there is some mistake in the\nNature report, all the results confirm a medieval age of the Turin\nShroud. Do you agree with this observation?\nIf so, how do you explain that the results are not a clear clue of\ncontamination in the sample?\n-10) Don’t you think that a sign of contamination (of about 200\nyears) in very few square centimeters of fabric can lead to a\ncontamination of the order of thousands years in some square meters\nin the same fabric?\n-11) Why the initial proposed procedure, that foresaw the sampling in\nvarious locations of the Turin Shroud was not followed during the\n1988 sampling? What was the information that allowed the scientist to\nsurely suppose that the Shroud has a uniform content of C-14 in all\nits area?\n-12) According to B. Walsh and others, instead of a uniform model, at\nleast a linear model, for the content of C-14 in the Turin Shroud\narea, should be assumed.\nAre they wrong?\n\n","date":"September 28, 2008 at 6:39 pm","url":"https://shroudstory.com/2008/09/28/brad-h-gore-says/","cat":"carbon_14_dating","id":"comment-131","author":"Giulio Fanti","site":"shroudstory"},{"title":"Brad H. Gore Says","post":"We are certainly still in need of information to answer Brad Gore’s question.  What we know is that the samples taken in 1988 dated to 14th century.  We also know that the samples had a position dependent age gradient which may be due to random differences in the calibration of the AMS laboratories or may be due to some property of the sample that caused a position based variation in the amount of C14 present.  We don’t know which.\nFinally we know that the sample contained anomalous cotton which is not commonly present in the shroud as a whole and so indicates that there is something clearly unrepresentative about the sample site.  Some suggestions have been that the site was the site of a 15th century sample which was taken and the area invisibly rewoven using French invisible reweaving technology.  This suggestion has been criticized, but not eliminated from consideration.  Samples of threads from the sample are give a positive test for vanillin while shroud fibers in general do not, again indicating that the sample area is anomalous.  So while there is not particular reason to doubt the 14th century AMS result (although there are statistical problems) there is quite strong reason to doubt that the sample was truly representative of the shroud as a whole.  There is also quite a lot of other data which calls into question the 14th century result.  However much of that data is historical in character and somewhat fragmentary.  The Pray codex, the report of Robert de Clari from the 4th crusade and other historical data suggests the shroud is much older than the carbon date.  So until a more statistically satisfactory, multi-site test is conducted the date we currently have seems to have been generated on a non-representative sample.\nRegards, Ray Schneider\nmember of the Shroud Science Group\n\n","date":"September 28, 2008 at 7:52 pm","url":"https://shroudstory.com/2008/09/28/brad-h-gore-says/","cat":"carbon_14_dating","id":"comment-133","author":"Ray Schneider","site":"shroudstory"},{"title":"Brad H. Gore Says","post":"Thanks Brad. After Christopher Ramsey you are the first physicist who accepts courageously an open discussion.\nMy answer to your series of questions is very simple. The first document of the National Hungarian Library exhibits 4 Miniatures over a “Codex”, named “Codex Pray”. This document has been scrutinized by Professor E. Poulle, emeritus director of the famous “école des Chartes” de Paris, membre de l’Institut. It is authentic and it has been assembled before 1192. But the man who painted these miniatures must have seen, in Constantinople, the true Shroud of Turin before 1169 (starting of the war between Hungary and Byzance). Consequently, the date proposed (1325), with its very low standard deviation value found by the 3 labs, must be considered as a true “outlier”, which cancels the methodology used.\nOne of its two parts must have failed: the “soft” one (sampling, interpretation…) or the “hard” one (AMS and calculus). You are the only who could tell me which?\nIf you have some doubts concerning the validity of this statement, please let me know, I can enter into more details.\nBest Regards,\nMarcel\n\n","date":"September 28, 2008 at 9:50 pm","url":"https://shroudstory.com/2008/09/28/brad-h-gore-says/","cat":"carbon_14_dating","id":"comment-134","author":"Marcel ALONSO","site":"shroudstory"}]
