[{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"Considering all the work in this area is advisable.\n\n","date":"February 14, 2014 at 9:52 am","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-79347","author":"Andy","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"I strongly advise you to accept my past words about the AFM controls\non irradiated linen fibrils (…. with SSNDT [exposed in parallel] as witness\nmaterials in order to publish an interesting study) …\nProf. Alberto Carpinteri is the Editor in Chief of Meccanica and he is an expert in Building Science.\nB.T.W. :\nDo you remember my indications about Structural Mechanics and\nAFM three-point bending test ?\nWell …\nI think that prof. Carpinteri (= an expert in the field of Structural Mechanics !)\nwill be happy to receive the adequate answer … because linen fibrils\ncan be properly evaluated by qualified experts\nusing AFM techniques, etc. (see also : Raman analysis techniques).\n\n","date":"February 14, 2014 at 10:59 am","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-79360","author":"piero","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"Quote from Barrie: “the only apparent new information it includes is the possibility that the proposed neutron radiation was produced as a by-product of a major earthquake.”\nQuestion about that:  Wasn’t the same hypothesis that was proposed by Giovanna De Liso in 2010 at the Shroud workshop in Frascati, Italy?  (here’s the link for her paper: http://www.acheiropoietos.info/proceedings/DeLisoWeb.pdf)\nIf it deal with the same sort of hypothesis, then Barrie, I think we can say that there’s really nothing new under the sun…  By the way, I’ve read the paper of De Liso last year and wasn’t impress at all by the kind of result she got versus the reality of the color that composed the Shroud image.  In my mind, it was far from being a close match…\n\n","date":"February 14, 2014 at 5:44 pm","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-79438","author":"Anonymous","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"The Quebecois Yanonymous is way off the beam with his comments about De Liso’s paper. That he wasn’t impressed by the paper says more about his close-mindness to worthwhile experimental ideas than it does about De Liso’s paper.  If he paid as much attention to the distinctions between the Carpenteri paper and de Liso’s 12 years of experiments, that he gives to academics and his other heroes, he might come to realise that most physicists would ascribe a particulate mass to the neutrons mentioned by Carpenteri, whereas Radon gas, which De Liso claimed was an essential factor in obtaining her images emits gamma radiation, essentially an electro-magnetic wave with only a notional mass at the quantum level of h.(nu)/c^2, an entirely different matter. de Liso nowhere mentions neutrons! How many experiments towards an understanding of the Shroud image has Yanonymous ever attempted?\n\n","date":"February 15, 2014 at 12:03 am","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-79501","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"Hey De Liso’s fanatic, you know what Rogers would have done with such a paper?  Crush it into pieces…  Something can produce a coloration on linen that can look like the Shroud but if that doesn’t reproduce exactly all the known chemical and physical characteristics of the image, that’s irrelevant…  Rogers was damn clear about the fact that the Shroud image WAS NOT the product of any high energetic radiation and Fazio and Mandaglio independently confirmed this conclusion.  That’s enough for me to understand we should look elsewhere for a viable solution to the Shroud image.  \nLast thing:  I’m not Yannick.  Is it possible for you to stop looking at the same of the person who write a comment and concentrate on the comment itself?\n\n","date":"February 15, 2014 at 6:09 pm","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-79645","author":"Anonymous","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"Last thing I want to say: You have all the right to believe that De Liso’s weak hypothesis can be relevant to the Shroud.  That’s your freedom.  But I also have one and mine say to me:  look elsewhere!\n\n","date":"February 15, 2014 at 6:20 pm","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-79650","author":"Anonymous","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"Just a question from someone just starting to study the shroud.\nThere are two claims I’ve seen related to the earthquake theory.\n1) That it possibly messes up C14 content which could lead to incorrect dating, and\n2) That the emissions possibly created the image on the cloth.\nThese two claims need not both be correct.  And temporarily granting 1, that still leaves me with a question:\nFor claim 2), how was this seriously proposed given the back and front of the shroud show frontal and dorsal images?\n\n","date":"February 17, 2014 at 2:16 pm","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-80084","author":"Justin","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"Hi Justin.\nThere is some dispute as to how clear the image on the back of the shroud is, or even if it is really there at all. Judge for yourself at http://shroud.wikispaces.com/PROPERTIES.\nHowever, assuming such an image exists, Giulio Fanti thinks it corresponds quite well to experiments involving coronal discharge (see http://www.ubthenews.net/topics/documents/corona.pdf). His (and other) explanations for this are somewhat sketchy, but seem to depend on the idea that the cloth/air interface is significant, while the thickness of the cloth itself is not. Presumably the neutron or proton bombardment hypothesis would suggest that the energy of these particles would be absorbed quickest at the cloth/air interface too, and thus mark only the surfaces of the cloth.\nOther explanations could invoke the purely surface deposition of a sensitive chemical due to evaporation gradients, which could then be preferentially affected by whatever agent is hypothesised.\n\n","date":"February 17, 2014 at 3:25 pm","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-80099","author":"Hugh Farey","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"Quote: “However, assuming such an image exists, Giulio Fanti thinks it corresponds quite well to experiments involving coronal discharge (see http://www.ubthenews.net/topics/documents/corona.pdf).”\nComment:  Fanti or another fan of the high-energetic discharge hypothesis should give us also a rational explanation for why, if their hypothesis is correct, there would only be an image of the hair (and maybe a few other facial features) on the backside of the Shroud, while there would not be anything for other parts that are almost as dark on the frontside of the Shroud (like the chest or the thighs for example).  Seriously, this kind of wild explanation (“somewhat sketchy” to say the least) is ludicrous and show you another very good example of how poor a scientist Fanti really is…\nAnd above all this, I should say that Fanti’s claim about the presence of a possible second image on the backside of the Shroud has been done in very poor scientific conditions (while using bad photos for image analysis) and has also been completely dismiss by the Turin Centro whos members have had the opportunity (unlike Fanti) to examine the backside of the Shroud up close and personal in 2002…  For all those reason, I think we should consider the conclusion of the Centro as being the correct one, unless a new series of direct researches on the cloth should confirmed (beyond all reason) the claims of Fanti.\n\n","date":"February 18, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-80418","author":"Anonymous","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"Additional comment:  And if Fanti’s claim about the presence of a second image should be independently confirmed one day, it is pretty evident that his corona discharge hypothesis will not be the one who would stand on top of the list of the possible explanation for such a bizarre feature.  For example, Rogers’ own proposal of explanation was much more rational in my mind.\n\n","date":"February 18, 2014 at 4:47 pm","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-80419","author":"Anonymous","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"Hi Hugh, thanks for the response.  I think I may have misspoke.  I was referring to the image of the back of the man on the shroud.  It seems like if the source of the image was from below the body, as it presumably would have been if it stemmed from crushing rock during an earthquake, that you would not get an image of the back of the man, but only the front of the man.  That assumes the man was laying face up, of course.  Does that make more sense?\n\n","date":"February 18, 2014 at 10:16 pm","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-80480","author":"Justin","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"Yes it does. And you make a very valid point. As I said above, Giulio Fanti’s explanation for his coronal discharge theory, and by extension any explanation for the earthquake proton/neutron emission theory, are vague as to specific details. While Fanti thinks he can see a ventral image on the outside of the cloth, he says there isn’t a dorsal image, which means he rejects an image formation process at the rock/cloth interface. The X-ray style ‘neutron imaging’ hypothesis also loses credibility at this point, and even Rogers’s chemical reaction / evaporation gradient hypothesis is weak here.\nThe general idea, I suppose, is that the image was formed at material interfaces, namely (from the bottom up) rock/cloth, cloth/body, body/coth and cloth/air. However each of these has problems of its own, and should not necessarily by grouped together and explained in the same way. People who have recognised this, such as Jackson and Piczek, think that both body and cloth were floating in the air.\n\n","date":"February 19, 2014 at 4:28 am","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-80534","author":"Hugh Farey","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"Quote: “It seems like if the source of the image was from below the body, as it presumably would have been if it stemmed from crushing rock during an earthquake, that you would not get an image of the back of the man, but only the front of the man.”\nComment:  How sweat it is to see someone using good old logic to discard a wild hypothesis about the Shroud!  BRAVO AND KEEP ON RELYING ON RATIONAL THINKING INSTEAD OF RELIGIOUSLY BASED IMAGINATION…\n\n","date":"February 19, 2014 at 11:37 am","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-80619","author":"Anonymous","site":"shroudstory"},{"title":"Aftershock of the Maybe-An-Earthquake-Did-It Earthquake","post":"I should have end up my comment by saying this: “as Fanti and many others usually does.”\n\n","date":"February 19, 2014 at 11:38 am","url":"https://shroudstory.com/2014/02/14/aftershock-of-the-maybe-an-earthquake-did-it-earthquake/","cat":"carbon_14_dating","id":"comment-80620","author":"Anonymous","site":"shroudstory"}]
