[{"title":"Look at what happened between 1988 and 2015","post":"Not necessarily. Who said the Resurrection involved radiation?\n\n","date":"April 23, 2015 at 5:58 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197278","author":"Louis","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"From the Gospels we know that Jesus handed over his spirit to Father at his death. After that de died. As Jesus told at the cross, then the Soul (may be spirit) of Jesus went to paradise with the Soul of the thief. After three days Jesus Soul (or spirit) came back to his body.\nAs I mentioned previously no one knows what sort reactions would happens during the resurrection process.  During that resurrection process radiation could have happened. Todate, except the Father and Son no one knows about this process. \nScientists are still struggling to create a living micro-organisms in the lab. So far they failed to  do that. However thay can create life with using another living organism. So to create new life from nothing they have to undertand the resurrection mechanism.\n\n","date":"April 23, 2015 at 4:57 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197346","author":"Sampath Fernando","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"The Turin Shroud is more real today because the 1988 carbon dating has been questionned.\nThe leading explanation is an external contamination by cotton fibers.\nWhat kind of non invasive experiments would you carry out to test this hypothesis? direct examination of shroud fibers, UV/VIS reflectance and fluorescence measurements as well as Raman spectroscopic measurements…\n\n","date":"April 23, 2015 at 6:22 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197282","author":"anoxie","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Now you’ve done it, anoxie.  You’ve attracted Piero to this thread — watch out for interminably long responses of scientific fol-de-rol……\n\n","date":"April 23, 2015 at 7:30 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197293","author":"Nabber","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Hi Nabber, don’t worry, there is a very short answer to my comment.\n\n","date":"April 23, 2015 at 7:58 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197299","author":"anoxie","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"All of the above.\n\n","date":"April 23, 2015 at 9:33 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197303","author":"David Goulet","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"All of the above, has been done.\n\n","date":"April 25, 2015 at 2:53 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197473","author":"anoxie","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"The damage was done with the dirtiest site of the Shroud chosen for cutting the sample. There should be direct examination of the Shroud fibres,preferably near the site from where this sample was cut.\n\n","date":"April 23, 2015 at 6:31 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197285","author":"Louis","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Louis, was the Shroud sufficiently cleaned of Thymol contamination?  If not, there would only be a repeat of an erroneous C-14 date.\nPost from Larry Schauf, on this site, dated  April 30, 2012 at 1:19 pm \n“Ray Rogers (Senior STURP Chemist) was ADAMENT that the Shroud could never be cleaned sufficiently of the Thymol (natural carbon) it was stored in to carbon date it accurately. Therefore, ONLY if all scientists agree and prove that it’s clean of the thymol should it ever be carbon dated again.” \nBest,\nPS  I deleted one “accurately” from Larry’s post.  He used the word twice.\n\n","date":"April 23, 2015 at 5:47 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197352","author":"Angel","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Hi Angel\nI was told that Thymol contamination was detected on the Shroud some three years ago. Contamination is indeed a serious problem and I agree with Ian Wilson that this is a major hurdle when it comes to radiocarbon dating.\n\n","date":"April 25, 2015 at 7:02 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197586","author":"Louis","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Hi Louis,\nAnd that is about the time I saw the Shroud was contaminated with thymol or maybe it was even stated by someone on this site.  Supposedly, worms were found and thymol was used to disinfect the Shroud’s reliquary.\nI would love to see the chemical procedure for either neutralizing or eliminating the thymol contamination from the linen.\nBest,\n\n","date":"April 25, 2015 at 7:47 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197590","author":"Angel","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Angel, I did come across this, which is perhaps worth repeating: “The Late Glacial and Holocene development of vegetation in the area of a fossil lake in the Skaliska Basin (north-eastern Poland) inferred from pollen analysis and radiocarbon dating,” by Piotr Kolaczek et al, in Acta Palaeobotanica (53(1). The authors find that their radiocarbon dating of old peat bogs was improved by treating their macrofossils in glycerine-thymol-ethyl alcohol mixture, and then rinsing them with alcohol. They say: “The interesting fact is that most of the dates from the Skaliska Basin carried out from macrofossils treated by a mixture of glycerine, thymol and ethyl alcohol (but pretreated by rinsing them in alcohol) reflected a reliable age in comparison with that deduced from palynological analysis. The aforementioned observations give a far-reaching possibility of dating profiles investigated in the past, from which macrofossils have already been identified and collected (and thus preserved in glycerine-thymol-ethyl alcohol mixture).” They clearly do not think that even ancient (3000 BC) material is likely to be ruined from a radiocarbon dating point of view by preserving it in thymol, so 2000 year old material would be even less so. Rogers was guessing, not unreasonably, but experiment does not seem to have borne out his concerns.\n\n","date":"April 24, 2015 at 1:20 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197375","author":"Hugh Farey","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Hi Hugh,\nIf contamination by Thymol is ruled out, why not just cut a piece of the Shroud the size of a postage stamp from an uncontaminated area and throrougly clean this sample?  Then perform the non-destructive tests (microscopy, spectroscopy, etc.) prior to C-14 dating the cloth.\nThen a textile expert could perform a re-weave on the space left in the cloth where the sample was removed.  Seems easy enough.  :)\nBest,\n\n","date":"April 25, 2015 at 4:47 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197573","author":"Angel","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Well quite. Actually you wouldn’t need anything like a postage stamp size now. I think a single weft thread, extracted from the space between the two figures, could provide a whole set of results.\n\n","date":"April 25, 2015 at 5:09 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197576","author":"Hugh Farey","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"If only a thread is required for dating the cloth, what is the hold up?  I don’t believe this to be the case or the Shroud would already have been re-tested.  It’s been close to three decades since the initial results.\nMy thoughts are either Thymol contamination ruined any chance for further testing or a second sample was, in fact, secretly re-tested and another erroneous date resulted.  In the latter case, since the dating was performed in secret, the church would be reluctant to submit the cloth publicly to scientists for a second C-14 dating (knowing the outcome), but instead would trumpet the importance of faith over authenticity.  Seems perfectly logical :)\nBest,.\n\n","date":"April 25, 2015 at 6:31 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197581","author":"Angel","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"“If new carbon 14 tests show similar results” is a fanciful statement intended to get folks’ dander up.  It is a meaningless statement.\n\n","date":"April 24, 2015 at 10:31 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197463","author":"Andy","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Rogers proved the image was not made by radiation.  The article presumes something that is impossible.\n\n","date":"April 24, 2015 at 10:32 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197464","author":"Andy","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Rogers concluded the image was not formed by radiation. His conclusions were certainly not proof, nor would he have claimed they were.\n\n","date":"April 25, 2015 at 1:34 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197470","author":"Hugh Farey","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"An unusual concession by me. Hugh is right.\nThere was an unfortunate blow-up between Rogers and Jackson becasue Rogers sharply criticized a Jackson article on image formation. I think that colors the live Jackson critique of the reweaving-repair thesis. At St. Louis, Jackson who was supposed to moderate a panel discussion began with what I believed was a disingenuous description of the Rogers findings [not by name] on the composition of the sample area.\nIt wasn’t just cotton contamination, but a finding the linen fibers in the samples were new [medieval] linen not created from flax by the same methods used circa 30 CE. In fact, the procedures to turn flax into linen used on the fibers of the main body of the shroud ceased circa 1000 CE. \nThus a dispute about how much the sample area was “contaminated” as that word is commonly understood begs the question of how many new linen fibers were used to repair the frayed edge of the Shroud circa 1500 or so,\nAlso, one huge point: the cotton fibers that Oxford found and discarded before the sample was destroyed were “yellow.” I have seen cotton fields in the US and I don’t recall seeing any yellow cotton just a lot of white balls of cotton natural in the fields. Linen does not dye well and Rogers thesis is that the yellow cotton strands were inter woven to give the fibers color that matched the aged kinen which was graudally darkening (light pollution anyone?)\nRogers also conceded that the Maynard reaction was not an complete explanation of the image formation process. There was something else.\nI would point out in my inexpert opinion based upon my human observations, there is one source of radiation that can cause color changes without destroying its object. It’s called light. Museums must sometime guard their treasures against light pollution. When the Mona Lisa was subjected to multi-spectral digital imaging, the company that did it had to use special light sources designed to safe guard the Mona Lisa from the light.\n“He was the light of the world, and the light shone  in the darkness and the darkness did not comprehend it.”\n\n","date":"April 25, 2015 at 7:03 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197502","author":"John Klotz","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"How would you state the results of Rogers work in this respect, Hugh?\n\n","date":"April 26, 2015 at 7:30 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197680","author":"Andy","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Hi John,\nYes, Rogers did proclaim the Maillard reaction was doubtful; yet, the image formation is (more than ikely) as Di Lazzaro postulates, some type of radiation that is unknown to science that produces a supernatural flash of light.  \nBest,\n\n","date":"April 25, 2015 at 7:33 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197589","author":"Angel","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Angel,\nThanks for correcting me. I’ll have to remember Maillard Maillard. That’s what I get for posting on the fly (and the typos).\n\n","date":"April 25, 2015 at 8:30 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197592","author":"John Klotz","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"No problem, John.   I do it all the time.  \nUsually, I want to spell it Mallard, instead of Maillard.\nAt least you didn’t write “profit: instead of “prophet.”    :)\nBest,\n\n","date":"April 25, 2015 at 9:09 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197600","author":"Angel","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Why people are ignoring Prof. Fanti’s dating results. Did anyone challenge his methodology and results?\n\n","date":"April 26, 2015 at 1:14 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197615","author":"Sampath Fernando","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Prof. Fanti’s dating experiments were certainly not ignored. I even bought his Mistero della Sindone to try to understand them better. His work was discussed in detail on this site, starting, I think, in March, but certainly occupying most of April 2013. Try these headlines: \n“Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD”\n“Sales and Amazon Reviews of Fanti’s New Book”\n“A Critical Review of Giulio Fanti’s New Book: Unreliable Results Because of Inadequacy of Methods”\n“A Committee Far Removed from Padua”\n“Revisiting Giulio Fanti’s Dating Methods”\nBasically the provenance and representativeness of his samples, his failure to publish his calibration graphs, his somewhat arbitrary manipulation of some of his errors, the huge diversity of his different dates and the random averaging of results from widely different  methods all received criticism which has not been seriously contended. His follow-up scientific paper related to this work made no mention of the Shroud at all.\n\n","date":"April 26, 2015 at 2:13 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197618","author":"Hugh Farey","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Thank you Mr. Farey. So both C-Dating results and Prof. Fanti’s results are controversial. However still people like to use controversial Carbon Dating results rather than Prof. Fanti’s results.\n\n","date":"April 26, 2015 at 7:46 pm","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197682","author":"Sampath Fernando","site":"shroudstory"},{"title":"Look at what happened between 1988 and 2015","post":"Not quite. The radiocarbon dating procedure, selection, results and calibration are known in detail and have been published. Authenticists and non-authenticists have plenty to discuss. Fanti’s conclusions are almost entirely unsupported by experimental data, so there is not a lot to discuss. Neither authenticists nor non-authenticists have much to say about them.\n\n","date":"April 27, 2015 at 1:11 am","url":"https://shroudstory.com/2015/04/23/look-at-what-happened-between-1988-and-2015/","cat":"carbon_14_dating","id":"comment-197697","author":"Hugh Farey","site":"shroudstory"}]
