[{"title":"Los Alamos National Laboratory team of nine scientists prove carbon 14 dating of the Shroud of Turin wrong","post":"Seriously Mr Porter, you would not know journalistic accuracy if it came up and bit you on the patoot.\nAlso, the fact that you have a monopoly on shroud devotee sites (meaning the majority of them are either run, directed, administed or owned by you, does not make the drivel you post on the internet as “proof” valid.\nYou should be ashamed at your dishonesty.\n\n","date":"May 20, 2009 at 8:43 am","url":"https://shroudstory.com/2008/08/19/los-alamos-national-laboratory-team-of-nine-scientists-prove-carbon-14-dating-of-the-shroud-of-turin-wrong/","cat":"carbon_14_dating","id":"comment-496","author":"buttonfresh","site":"shroudstory"},{"title":"Los Alamos National Laboratory team of nine scientists prove carbon 14 dating of the Shroud of Turin wrong","post":"Ask yourself: Which groups of scientists analyzed samples of the Shroud of Turin that were NOT representative of the whole? Was it the three world-renowned dating labs at Oxford, Zurich, and Arizona who had relatively large swatches of the Shroud given to them by the official Vatican team who sampled the Shroud under the observation of numerous witnesses and video cameras and who got their samples from an area of the Shroud that was carefully studied for months to be sure it was representative? Or was it the group of Los Alamos scientists (or engineers?) who had three threads (!) of cotton (!) when the Shroud is well-known to be composed of linen and who got their threads from a sample taken unofficially (!) and against the wishes of the Vatican and without proper chain of custody? Really, be serious: Who do you wish to believe?\n\n","date":"September 1, 2011 at 2:53 am","url":"https://shroudstory.com/2008/08/19/los-alamos-national-laboratory-team-of-nine-scientists-prove-carbon-14-dating-of-the-shroud-of-turin-wrong/","cat":"carbon_14_dating","id":"comment-3751","author":"Steven Schafersman","site":"shroudstory"},{"title":"Los Alamos National Laboratory team of nine scientists prove carbon 14 dating of the Shroud of Turin wrong","post":"Radio dating procedure itself was not wrong. No one questioning the validity of research from those three world-renowned dating labs.\n@Buttonfresh: pardon me, but I’ve read no dishonest on this article, as it simply report the press release presented in event held by a respected university.\n@Steven: The Los Alamos National Laboratory (LANL)  is one of two laboratories in the United States where classified work towards the design of nuclear weapons is undertaken. LANL is a United States Department of Energy (DOE) national laboratory. It’is one of the largest science and technology institutions in the world. It conducts multidisciplinary research in fields such as national security, space exploration, renewable energy, medicine, nanotechnology, and supercomputing.\nThe team for this research is consists of 9 scientists, lead by Robert Villarreal. He worked for U.S. Department of Energy for 45 years, began as a Research and experimental Chemist and Nuclear Reactor operator in 1962. As a Research Chemist, he provided technical support to several Nuclear Reactor projects. In 1991, he began work at the Los Alamos National Laboratory (LANL) as a Section Leader and Team Leader and continued to work as a Nuclear, Analytical, Instrumental and Radiochemist. He has received numerous achievement awards for innovative performance, including the Director’s Distinguished Performance Award for an individual, both from Argonne National Laboratory and LANL, and he was honored with the DOE Analytical Laboratory Manager’s Hall of Fame Award. He is the author of numerous technical reports and publications, of which the most recent is entitled “Compilation of Less-Known Nuclear Material Characteristics and Verification Techniques,” June 2006. In February of 2008, he published “Technical Guide to the Observation and Recognition of an Actinide Nuclear Weapons Material.\nRaymond Rogers was eminently qualified. Rogers was a highly regarded chemist at the Los Alamos National Laboratory. He had been honored as a Fellow of this prestigious UCLA laboratory. In his home state of New Mexico, he was a charter member of the Coalition for Excellence in Science Education. For several years he served on the Department of the Air Force Scientific Advisory Board. He had published over fifty peer-reviewed scientific papers in science journals. He was one of many scientists selected to study the shroud in 1978. He was director of chemical research for the international Shroud of Turin Research Project (STURP).\nAll of their findings on Shroud of Turin are conform to proper scientific methods and fully accepted by science community (please note that term “fully accepted” doesn’t mean there were no critic against it, the same as “big bang theory” is fully accepted but also contested with several other theories. One greatness of science is it’s openness to be challenged and reexamined).\nFor your information, about a year before Rogers’ paper was published, in early 2004, the Journal of Research of the National Institute of Standards and Technology (U.S. Department of Commerce, NIST, U.S. Government Printing Office) published an important paper by Lloyd A. Currie. Currie, a highly regarded specialist in the field of radiocarbon dating and an NIST Fellow Emeritus, wrote a seminal retrospective on carbon 14 dating. Because the Shroud of Turin was such a famous test, Currie devoted much of his paper to it.\nLike Rogers, Currie dismissed any argument that radiocarbon labs had done anything wrong in dating the Shroud of Turin. Currie also rejected, as Rogers also had done, the theories of scorching effects or contamination caused by a bioplastic polymer. Significantly, Currie acknowledged that disguised mending (from which the sample was taken) was a viable explanation. He cited the work of Rogers and Arnoldi. He found it credible.\nSo, for conclusion: The Radio Carbon Dating is undoubtedly CORRECT. However, the sample is simply WRONG (or, quoting Robert’s opinion, it’s “the worst possible sample”).\n\n","date":"September 18, 2012 at 12:46 am","url":"https://shroudstory.com/2008/08/19/los-alamos-national-laboratory-team-of-nine-scientists-prove-carbon-14-dating-of-the-shroud-of-turin-wrong/","cat":"carbon_14_dating","id":"comment-16433","author":"Vivine","site":"shroudstory"},{"title":"Los Alamos National Laboratory team of nine scientists prove carbon 14 dating of the Shroud of Turin wrong","post":"Vivine. So how do you rate (or did Currie rate)  the textile expert  Mechthild Flury-Lemberg’s rejection of Ray Roger’s, and others,’reweaving’ theory based on her own meticulous examination of the cloth? There are two reasons for placing her credibility higher than Rogers. 1) Textiles were her specialist field. 2) She was able to examine the shroud as a whole and would have spotted the reweaving if there had been. \nThe quotations below are from her article that can easily be accessed on the British Society for the Turin website, Issue No.65, pp 10-27.\n‘The theory that repairs had been done to the corner areas in the Middle Ages, unfortunately is based on a false presupposition. The necessity of repairs to the corners has been postulated without ever examining the need for it. The real reason for the theory has been the desire to find a plausible explanation for the unsatisfying result of the carbon-14 analysis. Similar wishes, although understandable, have lead all too often in the history of the shroud to untenable theories. . . .\nThough the Turin shroud is burdened with the dust of centuries and with greasy dirt deposits on the corners its weaving structure is cohesive and untouched even at the corners. Therefore at no time has the need to reinforce the corner parts arisen! . . .\nEqually lacking any trace of evidence on the shroud is the hypothesis that a patch fixed onto the same minute spot which had been removed as a sample has falsified the result of the analysis. Where exactly had the patch been attached? How big was it? Was it so small that it covered only the sample area? Answers to these questions are lacking in the hypothesis of Benford/Marino and Rogers. They can only be given in a competent way by textile experts. One of them, who was present when the sample was taken, the late Gabriel Vial, confirmed repeatedly that the sample was taken from the original cloth! This affirmation seems to be unacceptable to a natural scientist [I assume she means Rogers et.al.] even if it comes from such an excellent textile scholar as Gabriel Vial who moreover made this judgment in his very own field of expertise.’\n\n","date":"September 18, 2012 at 5:35 am","url":"https://shroudstory.com/2008/08/19/los-alamos-national-laboratory-team-of-nine-scientists-prove-carbon-14-dating-of-the-shroud-of-turin-wrong/","cat":"carbon_14_dating","id":"comment-16443","author":"Charles Freeman","site":"shroudstory"},{"title":"Los Alamos National Laboratory team of nine scientists prove carbon 14 dating of the Shroud of Turin wrong","post":"“She was able to examine the shroud as a whole and would have spotted the reweaving if there had been. ”\nThe TRUE fact is Mechthild Flury-Lemberg examined the Shroud corner YEARS AFTER the C14 sample was taken off…\n\n","date":"September 18, 2012 at 7:09 am","url":"https://shroudstory.com/2008/08/19/los-alamos-national-laboratory-team-of-nine-scientists-prove-carbon-14-dating-of-the-shroud-of-turin-wrong/","cat":"carbon_14_dating","id":"comment-16449","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Los Alamos National Laboratory team of nine scientists prove carbon 14 dating of the Shroud of Turin wrong","post":"The other true fact is in order to really be able to spot an invisible French reweaving made by a most  skillful specialist, the suspected textile area shall be examined under extreme raking light.\n\n","date":"September 18, 2012 at 7:15 am","url":"https://shroudstory.com/2008/08/19/los-alamos-national-laboratory-team-of-nine-scientists-prove-carbon-14-dating-of-the-shroud-of-turin-wrong/","cat":"carbon_14_dating","id":"comment-16450","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Los Alamos National Laboratory team of nine scientists prove carbon 14 dating of the Shroud of Turin wrong","post":"…and/or alterrnative lights.\n\n","date":"September 18, 2012 at 7:19 am","url":"https://shroudstory.com/2008/08/19/los-alamos-national-laboratory-team-of-nine-scientists-prove-carbon-14-dating-of-the-shroud-of-turin-wrong/","cat":"carbon_14_dating","id":"comment-16451","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Los Alamos National Laboratory team of nine scientists prove carbon 14 dating of the Shroud of Turin wrong","post":"Dan:\n¿Puede usted bajar de mi blog la fotografía que muestra la zona de la Sábana ANTES de ser cortada para el C14?\nCreo que es una fotografía POCO conocida\nSe aprecia el GRAN DETERIORO de la zona que fue cortada, sin necesidad de ser experto textil……\nEs suficiente COMPARARLA con la fotografía siguiente en mi blog una vez cortada la muestra.\nCreo que TODOS sabemos distinguir, sin ser expertos, cuando una prenda de vestir tiene su tela DETERIORADA. \n \nhttp://lasabanaylosescepticos.blogspot.com.es/2006/01/la-zona-de-donde-se-cort.html \n[no recuerdo de dónde la obtuve, por lo que no puedo poner el link de la fotografía primera]\nCarlos Otal\n\n","date":"September 18, 2012 at 8:33 am","url":"https://shroudstory.com/2008/08/19/los-alamos-national-laboratory-team-of-nine-scientists-prove-carbon-14-dating-of-the-shroud-of-turin-wrong/","cat":"carbon_14_dating","id":"comment-16458","author":"Carlos Otal","site":"shroudstory"}]
