[{"title":"Low Level Fraud? and more","post":"It is NOT routine that a radiocarbon date is rejected because of other evidence. It may be that labs are blamed when the real reason is poor sampling and thus results may be suppressed. That is what Elisabetta Boareto is talking about.\n\n","date":"October 11, 2013 at 7:55 am","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47001","author":"Paulette","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"One interesting thing, the dates 1260-1390 were announced on press release on 13th October 1988, however, “Nature” received paper ON 5 DECEMBER. With unacceptable Chi^2 value of 6.4, which meant that the RESULTS ARE INCONCLUSIVE and should be rejected. The true date of the Shroud was thus UNKNOWN (the 1260-1390 was just only average of the Shroud and possible alien contaminants). However on 13th October it was PUBLICALLY announced that the Shroud was a FORGERY, and all who thought otherwise were idiots, while MAINTAINING SILENCE on unacceptable Chi^2 value. This is nothing but MANIPULATION. Only after such sensational announcement the results were sent to “Nature”, which in turn, COULDN’T AFFORD to simply reject the paper.\nIn my opinion, the place for Tite, Sox, Hall, Hedges, was definetly in prison. Even despite the mesurements themselves were properly done.\n\n","date":"October 11, 2013 at 8:12 am","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47009","author":"O.K.","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"Statistical analysis is based on the supposition (indeed requirement) that sampling is entirely random. But that was not the case: the three labs were given contiguous specimens, i.e. adjacent thirds. For randomised sampling, the entire strip would have been placed on a grid with letters up one side, numerals up the other, and then samples allocated by drawing letters and numerals at random, e.g. B7, H2, C5.\nSince the sampling was not random, and since the high chi  squared value simply means that there was a trend, the assumption seems to be in the Shroudie literature, here included, that the trend could have extended across the entire fabric and produced a much greater age elsewhere. But one cannot conclude that, for the simple reason that a single specimen was taken from one corner, so no conclusions can be drawn as to the results outside of the sample area.  What the trend would seem to imply is that there was indeed a systematic factor at work, but it was probably little or nothing to do with a systematic C-14 gradient, and everything to do with the labs having chosen clean-up procedures that differed in detail.\nTwo criticisms could be made of the labs – first that they consented to proceed with just the single strip, and second that there was no randomized sampling within that strip.\nAcquiescence to the first may been based on a “let’s cut our losses” principle. OK, they may have thought, the design, if one can so dignify being fobbed off,  does not permit one to make statements about the age of the entire Shroud, only that of the corner, and the statistical analysis is of use only in detecting non-random variation based on methodological differences re clean-up etc. \nThe second may be based on the idea that the project was so compromised by the failure to provide multiple random samples that to then adopt randomized sampling within the single test strip would look a trifle ridiculous – serving merely to highlight the failure to treat the entire Shroud as the sampling frame.\nThe next step should be self-evident. Repeat the entire radiocarbon dating using a rigorously designed and implemented sampling frame. Use the same clean-up procedure for all the samples. Three labs should not be necessary if one has complete faith in just one of them to do the job professionally. I see no evidence that any of the three labs were less than professional in carrying out their tasks. I wish the same could be said for those who made the decision to take that single corner specimen, dividing it between three different, prestigious research centres. That was to make a mockery of the entire effort, and it is scandalous that the blame is now being placed where it does not belong with wild talk of “fraud” and “prison”and TV documentaries that hint at dark conspiracies.  Scandalous! Whatever happened to Christian charity?\n\n","date":"October 11, 2013 at 11:15 am","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47026","author":"colinsberry","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"Colin,\nI would have asked earlier but was embarrassed at forgetting my statistics! You mention that the Chi2 test demonstrates a ‘trend.’ A trend of sorts was demonstrated by Atkinson and Riani in their statistical analysis of the 12 individual carbon dates submitted to the Nature paper, basically from slightly earlier to slightly later along the C14 dating strip. They do not suggest that this is obviously due to contamination, nor that the medieval date is seriously affected, but a trend appears evident. Would the Chi2 test be a measure of that?\n\n","date":"October 11, 2013 at 12:45 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47035","author":"Hugh Farey","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"Deviation from postulated statistical distribution of the results. The high values of Chi2 have a very little chance of being obtained if the postulated distribution is correct. That means that the chance that our null hypothesis (the t5 distribution of the results centered around 691 BP, that means 1260-1390) is correct, are very slim.\nIn other words: the results ARE NOT RELIABLE.\n\n","date":"October 11, 2013 at 1:46 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47054","author":"O.K.","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"However even had Chi2 been within acceptable boundaries, that would NOT exclude that the datings were wrong due to rewaeving or any other reason.\n\n","date":"October 11, 2013 at 1:47 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47055","author":"O.K.","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"O.K. you wrote, “In my opinion, the place for Tite, Sox, Hall, Hedges, was definetly in prison.” \nMine is they should have been put into professional and mediatic quarantine.  That would have been ok (no pun intented).\n\n","date":"October 11, 2013 at 1:02 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47043","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"The true fact is NOT ONLY the carbonists but ALSO the two textile experts + cardinal Ballestero’s scientific advisor + the operator should also have been put into professional and mediatic quarantine.\n\n","date":"October 11, 2013 at 1:19 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47044","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"In italy we call it a… fiasco.\n\n","date":"October 11, 2013 at 1:21 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47046","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"Colin: “Since the sampling was not random, and since the high chi squared value simply means that there was a trend, the assumption seems to be in the Shroudie literature, here included, that the trend could have extended across the entire fabric and produced a much greater age elsewhere.\nNo, rather that the trend extended far enough to understand that beyond a point, even a centimeter or so, the cloth might have tested older. It is a REASONABLE POSSIBILITY, not assumption, and therefore the testing CANNOT be thought of as necessarily valid. Your idea that the Chi2 measurement can be ignored – cut your losses – because the non-scientific CLIENT didn’t do a good job of randomizing is just plain silly science by some made-up inspired alternative scientific method. No, the fact is that the radiocarbon dating labs were partner participants and failed miserably. It was a FIASCO, like in a keystone cops movie.\n\n","date":"October 11, 2013 at 1:32 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47051","author":"Paulette","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"Paulette: only if the sub-samples had been randomised – so that a significant trend (p<0.05) could or might be discerned against background noise. But sub-sample allocation was not randomised, making significance testing a futile exercise. In any case, there were systematic differences in methodology, so nothing whatsoever can be deduced about regions of the linen even 1cm away from the sample. That's my opinion and I'm sticking to it.\n\n","date":"October 11, 2013 at 1:48 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47056","author":"colinsberry","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"“Nothing whatsoever can be deduced about regions of the linen even 1cm away from the sample.”\nThat’s right. The other parts of the Shroud can be dated to 14th century as well as 1st or any other. We cannot conclude on the measures performed outside the cut sample. \nThe rest are attempts to shift responisbilties from archidiocese to laboratories and vice versa. However, both sides can be blamed for 1988 carbon-dating fiasco.\n\n","date":"October 11, 2013 at 1:56 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47060","author":"O.K.","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"Dear Oxford, Arizona, Zurich: Show me a location map of the sub-samples. Show me the raw numbers. No, not me, the world. My extra-credit students would have fun with this. It is much better to argue about statistics with numbers. Oh, why can’t you? Can you spell fiasco?\n\n","date":"October 11, 2013 at 1:49 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47058","author":"Paulette","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"\nO.K. :\nHowever even had Chi2 been within acceptable boundaries, that would NOT exclude that the datings were wrong due to rewaeving or any other reason.\n\nRe-weaving is a mental construct (think handy cop-out). It is non-science. Indeed, it is anti-science. There is scarcely any analytical or forensic result that cannot be challenged by claiming the sample has been tampered with.\nSensible folk do not give such notions the time of day unless there is compelling evidence to back it up. Stating it could have happened, and expecting others to prove a negative is not a valid option in science. It’s called denialism.\n\n","date":"October 11, 2013 at 1:54 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47059","author":"colinsberry","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"Colin, there is evidence for reweaving. That makes it a legit challenge. The labs have no defense because they don’t have or are not making records available.\n\n","date":"October 11, 2013 at 1:57 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47061","author":"Paulette","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"I have tried really hard to find some reweaving, both in the area immediately adjacent to the C14 sample site, on the riserva piece, and on the piece of the Arizona sample examined by Freer-Water and Jull. There are good photos of these, easily examinable in terms of individual threads, and there is genuinely no evidence at all of reweaving there.\nOther suggestions have referred to those rather weirdly coloured “quad mosaic photos.” These I’m afraid I find utterly unconvincing. A patch of dark green around the C14 area is considered evidence of patching, although exactly the same colour is found among the wrinkles and patches of the side seam, while the fact that a huge swathe of the main cloth comes out bright blue receives no consideration at all.\nThen there’s the cotton, which according to different analysts varies from “small traces” to 60% to all of it. It is famously noted that the Oxford laboratories sent a few “rogue threads” to a laboratory in Derbyshire; one wonders why they didn’t notice that most of their sample was made of it! Similarly Raes reported “small traces,” while Villarreal’s threads were entirely cotton. This is not yet evidence.\n\n","date":"October 11, 2013 at 3:15 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47080","author":"Hugh Farey","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"Colin, oh, it is possible to statistically randomize with robust models. I think there is a paper on that hosted at the London School of Economics. I think it has been done.\n\n","date":"October 11, 2013 at 2:00 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47062","author":"Paulette","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"The burden of proof belongs with the labs. They are silent.\n\n","date":"October 11, 2013 at 2:02 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47064","author":"Paulette","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"The burden of proof now lies with the Turin custodians. They should give the go-ahead for immediate re-testing to exonerate the labs for a “fiasco” that was not of their making. Blame should be laid fairly and squarely at the door of those whose decision it was to fob off the labs with a tiny corner specimen, and who remained silent when mischievous talk of re-weaving crept into the literature.\n\n","date":"October 11, 2013 at 2:07 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47067","author":"colinsberry","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"I’m not saying church authorities are not to blame in large measure. But the labs should have walked away or cautioned Nature and produced raw ‘geographic’ results. Where are the grown-ups in this fiasco. More tests would be good. Absent that the labs need to admit their failure as the scientists at the table or allow suspicion to go on forever. Colin, you are a scientist. You are smart. Would you have allowed the Turin custodians to fob off these cloth samples on you?\n\n","date":"October 11, 2013 at 2:16 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47070","author":"Paulette","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"I seem to recall saying here many moons ago that I would have walked away in disgust – but would have stayed in Turin long enough to down a few Morettis and Peronis – and have gone and paid homage to the steps down which the Minis charged in The Italian Job.\n\n","date":"October 11, 2013 at 2:29 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47075","author":"colinsberry","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"I’ll buy.\n\n","date":"October 11, 2013 at 3:51 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47082","author":"Paulette","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"There’s a great quote I’ve seen about C-14 for which can’t remember the source.  It basically says if the C-14 results are good, they’re trumpeted in the article text, if the results are questionable, it’s relegated to a footnote and if the results are bad, they’re completely left out.  I’ll hunt a bit for it when I get a chance to see if I can find.\n\n","date":"October 11, 2013 at 11:34 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47146","author":"Joe Marino","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"Micheal Winter, quoted in Petrosillo & Marinelli’s “Enigma of the Shroud”, at the end of the chapter about Viking horn dated to 2006 AD.\n\n","date":"October 12, 2013 at 5:46 am","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47181","author":"O.K.","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"O.K., thanks for the reference.  Here is what it says, “A well-known specialist of the subject, Michael Winter, does not hesitate to declare this in writing, ‘If a Carbon 14 dating confirms our theories, we show it clearly in the main text; if it contradicts them, but not completely, we relegate it to a footnote; if it contradicts them completely, we hide it from everybody.'”  Marinelli’s/Petrosillo’s original source is cited as “Giuseppe M. Pace, Sindone e C14, CPS, November/December 1988, pg. 50.”\n\n","date":"October 12, 2013 at 11:26 am","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47233","author":"Joe Marino","site":"shroudstory"},{"title":"Low Level Fraud? and more","post":"2 other details to my previous posting.  The page # that the quote appears on in the Marinelli/Petrosillo book is 141.  “CPS” stands for Collagemento Pro Sindone,” which used to be print and is now totally online at http://www.shroud.it.\n\n","date":"October 12, 2013 at 12:31 pm","url":"https://shroudstory.com/2013/10/11/low-level-fraud-and-more/","cat":"carbon_14_dating","id":"comment-47240","author":"jmarino240","site":"shroudstory"}]
