[{"title":"Mark Oxley’s Paper is a Must Read","post":"Prof. Jull has told Prof. Fantie that they received two pieces from Turin, one larger and one smaller. call them L and S. That’s not news. Everybody knows that. But the revelation that Arizona cut L into three pieces and only used two of the pieces L1 and L2 for C14 and saved the third piece L3 is a shocking revelation. So where is L3 and where is S and which is the piece that Prof. Jull kept in his office. Does Prof Fantie know???? Talk about chain of evidence and accountability. Sounds like we need thje wikileaks bunch to find out what is going on in Tucson.  Good find Prof. Oxley.\n\n","date":"January 21, 2011 at 11:49 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","id":"comment-2254","author":"David Wilson","site":"shroudstory"},{"title":"Mark Oxley’s Paper is a Must Read","post":"The actual quote from Mark’s paper is: “In a letter dated 9 February 2010 to Prof. Giulio Fanti, Prof. Jull of the University of Arizona stated that the sample vials were opened on Sunday, 24 April 1988, and that they received a sample in two pieces labeled “53,8 mg”. However they measured the weight to be 52,8 mg. The larger sample was cut into three pieces, weighing 12,39 mg, 14,72 mg and 11,83 mg. Only the last two were used for radiocarbon dating. The piece weighing 12,39 mg was retained and appears to have been the sample used by Prof. Jull for the examination reported in his paper in Radiocarbon. What happened to the separate smaller piece is not made clear, although Prof. Jull stated that it was not used for measurements.”\n\n","date":"January 21, 2011 at 11:56 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","id":"comment-2255","author":"B&B","site":"shroudstory"},{"title":"Mark Oxley’s Paper is a Must Read","post":"This subject was initially covered when Domenico Anzellotti wrote, “I would inform you that Prof. Gian Marco Rinaldi, after a communication with Prof. Fanti, January 12 added a postscript to his article “Autogol a Tucson” at http://sindone.weebly.com/autogoltucson.html . . . it seems that Arizona laboratory used only 27 mg. from the 53 received and that the laboratory retained 2 pieces! (bold emphasis mine)\nCazab then asked ““And the next question is : in 1988 was it possible for Tucson to do measurements with only 3 mg (27/8=3.375) ?”\n\n","date":"January 21, 2011 at 12:47 pm","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","id":"comment-2256","author":"Anon from Manhattan","site":"shroudstory"},{"title":"Mark Oxley’s Paper is a Must Read","post":"Radiocarbon is a peer-reviewed journal but Jull is indeed the editor, so if there was peer-review, one has to wonder how rigorous it would have been.  This is very similar to the late Dr. Walter McCrone’s peer-reviewed journal “The Microscope.”  He published one or two Shroud articles in there, but that was literally his own journal, so once again, one has to wonder about the rigor of any article written by a principal of the journal.  The circumstances of Jull’s article, much like the Arizona samples, will likely remain murky.  (I was not even tempted to say “will likely remain shrouded in mystery.)\n\n","date":"January 21, 2011 at 8:04 pm","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","id":"comment-2259","author":"Joe Marino","site":"shroudstory"},{"title":"Mark Oxley’s Paper is a Must Read","post":"Arizona laboratory had four pieces wich weighed: 12.39, 14.72, 11.83 and 13.86.\nLet’s remember that Donahue writing to Fr. Bonnet Eymard gave the weight of 14.27 instead of 14.72.\nhttp://www.crc-internet.org/shroud3.htm\nThis is important because it shows that the weights provided by Prof. Van Haelst on page 5 of the paper “RADIOCARBON DATING THE SHROUD OF TURIN THE NATURE REPORT” (http://www.shroud.com/vanhels5.pdf) were the right ones and they came directly from the Laboratory..\nBut Prof. Van Haelst writes also that those weights were taken after the cleaning procedure by Dr. Toolin.\nIs this information also from the Laboratory?  is it correct? or this is one of the many inaccuracies given by the Laboratory?\n\n","date":"January 23, 2011 at 7:33 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","id":"comment-2264","author":"domenico","site":"shroudstory"},{"title":"Mark Oxley’s Paper is a Must Read","post":"– At this point (10/3/2012), I can’t seem to get a coherent version of Oxley’s paper.  http://www.shroud.com/pdfs/oxley.pdf only gets me hieroglyphics.  Any suggestions?\n— Rich\n\n","date":"October 3, 2012 at 8:36 pm","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","id":"comment-17202","author":"Richard Savage","site":"shroudstory"},{"title":"Mark Oxley’s Paper is a Must Read","post":"The link and paper work and show just fine for me Richard. Try checking your settings and/or reset them to default…or update your Adobe Acrobat reader? \nBy the way, what are you doing way back here in Jan 2011 posts? It’s good you did post here though, otherwise I wouldn’t have ever found these comments! Although some links don’t work any longer, a couple of comments here are GOLD! Especially nos. 3, 4 and 5. With a slight emphasis on Cazabs question posted in comment 3, which I believe was never ‘properly’ answered and in which, if it is true that all labs used UNDER THRESHOLD WIEGHT samples, …then on this basis ALONE, the testing done in 1988 can be dismissed entirely! \nR\n\n","date":"October 4, 2012 at 9:20 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","id":"comment-17223","author":"Ron","site":"shroudstory"},{"title":"Mark Oxley’s Paper is a Must Read","post":"Ron,\n– Unfortunately, you are speaking to a computer neanderthal.  Though I’ve been using computers since the late 70’s, I seem to have learned about them only what’s been forced upon me.  I don’t seem to have the “acrobat” reader; I just have the “Adobe Reader.”  Is that good enough?\n– And then, to be honest, I don’t know what, exactly, my “settings” are, or how to reset them to default…  You can see my problem…\n– But, don’t feel obliged to teach me — it’s something I should have been doing FOR MYSELF all along.  I’ve been immature for a long time.\n– Unless you have a possible quick solution, no worries — I should quit being lazy, and figure this out for myself.  For someone as backwards as me, bringing him up to speed through email should be quite difficult.\n– Someone had directed me to Oxley’s paper.  In Googling it, I was quickly sent to Dan’s blog — and here I am.\n– I’ll let you know of my progress.\n— Rich\n\n","date":"October 5, 2012 at 8:00 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","id":"comment-17239","author":"Richard Savage","site":"shroudstory"},{"title":"Mark Oxley’s Paper is a Must Read","post":"Richard, I believe it may have been I who referred you to the paper by Oxley. You can find that paper along with many others at http://www.shroud.com. Try opening the paper on the site, then just click ‘File’ on the Menu bar and then ‘save as’; if there is an issue with your Adobe it should ask you to upgrade. Just click ‘upgrade’ and ‘yes’ to download. Then ‘run’ the program. You should be able to read it then and it will be saved in the folder of your choice….hope that helps.\nANYWAYS, the issue above dealing with the sample weights, amazingly, is very rarely mentioned by anyone, and I would think it being a ‘technical’ issue to the testing, or more precisely too ‘proper’ testing of the samples, goes to the heart of the c14 results and ‘technically’ is a major problem!…Some of the samples would have had less then 2mg carbon for testing!! Unless someone can substantiate that back in 1988, proper results could be achieved from such low carbon weights, the c14 results on this issue alone is not only suspect but nullified.\nR\n\n","date":"October 5, 2012 at 9:57 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","id":"comment-17243","author":"Ron","site":"shroudstory"},{"title":"Mark Oxley’s Paper is a Must Read","post":"Ron,\n– Also, I’m happy to be of help, and I should be able to use the comments above for my own benefit — even if I’m not able to read Oxley’s paper.  Thanks again.\n— Rich\n\n","date":"October 5, 2012 at 8:07 am","url":"https://shroudstory.com/2011/01/21/mark-oxleys-paper-is-a-must-read/","cat":"carbon_14_dating","id":"comment-17240","author":"Richard Savage","site":"shroudstory"}]
