[{"title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia","post":"I find the reported comments from Professor Gonella absolutely intriguing, as Ian Wilson who was an observer at the sampling, writes the matter up quite differently in “The Shroud” 2010, see chapter 7 – ‘What’s in a date?’ particularly his paragraphs on p.87! \n“When the Vatican’s Brazilian-born Professor Carlos Chagas put forward a well-researched protocol involving seven seven named laboratories in radio-carbon dating the Shroud, some of them using the old Libby method, others the new AMS method, Gonella went feral.  On all sides stances were taken and angry messages exchanged.  Even I found myself an intermediary in the cross-fire. When the dust began to settle, it was Turin who had won. On 10 October 1987 Cardinal Ballestrero calmly faxed all interested parties that the seven laboratories had been reduced to three, chosen on the basis of their experience in the field of archaeological radiocarbon dating.  The three were Oxford, Zurich, and Tucson (Arizona) – all of them AMS laboratories.  The stipulated ‘experience’ criteria was the very reverse of the truth, the rejected Harwell alone having vastly more experience than all three of the chosen ones put together.”\n“Although whatever went on behind the scenes remains far from clear, Gonella had got his way, and at daybreak on 21 April 1988 representatives of the three chosen laboratories duly assembled at Turin Cathedral old sacristy … … While the scientists watched from the pews, the Shroud was solemnly brought into the room and unrolled before them.”\n“Incredibly, it was only at this point that Gonella and his close friend Giovanni Riggi proceeded at length to deliberate on the best location from which to take the sample that was to be apportioned between the three laboratories.  Some have claimed that the debate between the two scientists took two hours. … … etc” \nThere seems to be a total mismatch between the objective observations of an experienced recognised authority, Ian Wilson, and the current defensive recollections of events by Professor Gonella.  A fascinating study in subjective perceptions of events versus their actual reality!  Gonella’s attack on Chagas “to get the undersigned out of the way”, seems bizarre in view of the fact that it was Gonella and Ballestrero who were party to the actual final decisions, notwithstanding Chagas’ proposed protocol, which they had set aside.\n\n","date":"May 13, 2012 at 12:43 am","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","id":"comment-11319","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia","post":"I agree Dave, it seems bizarre and stinks of rotten fish! Prof.Gonella was in charge or atleast dictating from ABOVE! How can he put the blame on Chaga? The whole c14 thing as I’ve said before was a FIASCO. Those to blame were both individuals in the diocese, seemingly, Gonella and also ALL involved in the c14 testing, yes I’m including Tite et al. and ALL labs here. Everything from the changing of protocols, to the elimination of the STURP preposals, to the single sample, to the ‘secret’ non-filmed escapades in the ‘other room’ to the irregularities in the numbers in the Nature report, to the below threshold weight of the tested samples; One must be blind to not see a bizarreness to the whole thing, lending to the very possible conclusion of a conspiracy here!..It is very irritating that most do not see this.\nR\n\n","date":"May 13, 2012 at 7:39 am","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","id":"comment-11323","author":"Ron","site":"shroudstory"},{"title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia","post":"And still, after 24 years, a recombination of separatedly analized subsamples yields a trend. In this trial of the C14, the recent detection of this spatial trend stands as an unexpected last-minute wittness pointing out that after all, the analyses were carried out correctly. Perhaps, on an medieval reweaving but regarding the C14 test itself, correctly.  Even if we go to the conspiration theory, this can help identify where to look for the secret scheme. Certainly, not at the laboratories.\n\n","date":"May 13, 2012 at 12:00 pm","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","id":"comment-11324","author":"Gabriel","site":"shroudstory"},{"title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia","post":"The best line about the C14 fiasco I’ve ever heard come from Russ Breault.  He said in an interview, in order to explain why the original protocol was changed at the last minute (leading to the dating fiasco we know), M. Breault said briliantly something like this :  “The Turin autorities prefered aesthetic over a proper scientific set-up.” \nI think M. Breault put the finger on the real problem, which is that the authorities were afraid to do some damage to their precious relic and that’s why they decided to change the protocol.  So, I don’t believe in the conspiracy theory.  I believe we should blame it mostly on fear of damaging the cloth instead…  And I think this is understandable to some extent, but in bad scientific conditions like that, I really wonder why they did a C14 test anyway ?  In my mind, you must do it properly or you’re better to do nothing at all, especially on an important test like that !\n\n","date":"May 13, 2012 at 9:11 pm","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","id":"comment-11334","author":"Yannick Clément","site":"shroudstory"},{"title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia","post":"That is quite a simpleton answer to the fiasco. So the ‘authorities’ didn’t want extensive damage to the Shroud, so what? THere were lots of other places samples could have been retrieved without extensive damage. Moreover, more extensive examination of the choosen area(s) was warranted, which never occurred. Yes I agree the sampling should have never gone forward at the exact point when the ‘authotrities’ decided to change the protocols, but they did. Who then is to blame for this very ‘unscientific’ approach? Both the ‘authorities’ and the Labs, with the labs themselfs already being warned and with knowledge that a ‘proper’ testing could not be weighted….These labs had alot to gain by doing these tests, whatever the results, but moreso if they could claim the Shroud a fraud. Remember AMS was relatively new to the scene, this test ‘of the century’ would put them all on the map and make some people famous. The Nature report is so full of questionable information, I am not alone in questioning it’s ‘peer-review’; this I conclude from many writings to this issue. Who by chance in 1988-89 had the expertise in AMS radiocarbon dating to actually peer-review the paper anyways?…I wonder.\nRon\n\n","date":"May 14, 2012 at 2:07 pm","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","id":"comment-11349","author":"Ron","site":"shroudstory"},{"title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia","post":"Ron: “These labs had a lot to gain by doing these tests, whatever the results, but more so if they could claim the Shroud a fraud. etc” Hits the nail on the head!  Wilson writes:-\n“Not long after this [Oct 1988] Hall’s Oxford AMS laboratory received funding of a million pounds, bringing into being a permanent professorship post that was immediately filled by the British Museum’s Dr Michael Tite, while Harwell’s Libby method laboratory quietly went out of business.”  ‘Nuff said!\n\n","date":"May 15, 2012 at 5:16 am","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","id":"comment-11362","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Breaking News: Emanuela Marinelli’s Carbon Dating Paper from Valencia","post":"Dave obviously we have read much of the same literature, at present I am re-reading “The Rape of the Shroud” by Meacham. Just happened to finish reading Ch 3-4. The whole true story of events are written in there and by someone who was intimately involved with many of the ‘movers’ back then. Hall’s lab not only received a huge sum from some less scrupulous “businessmen” but also for finding the Shroud not authentic!! Hall also apparently received quite a “hefty sum” for allowing a certain broadcaster exclusive coverage of his dating of the Shroud. It’s pretty obvious where his intentions lay and I venture to state; It had nothing to do with finding or publishing the truth.\nI’d highly suggest to others here, if you haven’t already, to pick up Meacham’s book. It is a fascinating and eye-opening read of the whole situation which occurred around the c14 dating and the “wrongly condemned and violation” of the Shroud.\nR\n\n","date":"May 16, 2012 at 3:00 pm","url":"https://shroudstory.com/2012/05/12/breaking-news-emanuela-marinellis-carbon-dating-paper-from-valencia/","cat":"carbon_14_dating","id":"comment-11389","author":"Ron","site":"shroudstory"}]
