[{"title":"More on the Carbon Dating of the GJW,  ‘Gospel of Jesus’ Wife’ Fragment","post":"I have followed this matter reasonably closely since the alleged discovery was first announced by Karen King. There are clearly agendas at work, not only from Dr King’s religio-feminism, but also from those with an opposing religious viewpoint, particularly from those with an evangelical bent. So far I have seen little that either proves or disproves authenticity. The papyrus C-14 date range 650-870CE may show that it is not an original 4th century text or not, depending on how much confidence one is prepared to assign to these particular tests.  That another laboratory can come up with a Ptolemaic date for the same artifact must raise questions on the method. We have seen enough debate on this site for the 1988 dating of the TS, to know that not all are prepared to accept the method as infallible and that issues can arise. \nThe use of papyrus as a writing medium was replaced in the West by parchment and vellum around the 3rd century.  However it continued to be cultivated and used by the Arabs of Egypt down to the 9th century when the making of paper from other plant fibres rendered papyrus unnecessary. However the use of papyrus for books and documents continued sporadically down to the 12th century. \nIf there is any substance to the 650-870 dating, then it may be that the fragment is part of a later copy of an earlier gnostic text, or not. It is equally conceivable that notwithstanding the dating results, that it is indeed a 4th century original. And of course it may just as equally be the work of a master forger. We have been here before! \nOne aspect that begs further discussion is the Rahman spectroscopy tests on the ink, which would seem to place the fragment in ancient times. That needs further resolution. \nPerhaps this fragment will remain like the much debated Vinland Map uncertain, and just as indeterminately conjectural, and even as controversial.\n\n","date":"April 11, 2014 at 7:43 am","url":"https://shroudstory.com/2014/04/11/more-on-the-carbon-dating-of-the-gjw-gospel-of-jesus-wife-fragment/","cat":"carbon_14_dating","id":"comment-98330","author":"daveb of wellington nz","site":"shroudstory"},{"title":"More on the Carbon Dating of the GJW,  ‘Gospel of Jesus’ Wife’ Fragment","post":"Loved reading your well-informed insights Dave re GJW… and wholeheartedly agree!\n\n","date":"April 11, 2014 at 10:02 am","url":"https://shroudstory.com/2014/04/11/more-on-the-carbon-dating-of-the-gjw-gospel-of-jesus-wife-fragment/","cat":"carbon_14_dating","id":"comment-98360","author":"clublu22014","site":"shroudstory"}]
