[{"title":"More Tetherd Cow Ahead on the Shroud of Turin","post":"Dan:\nYou’ve kind of missed my point, either willfully or accidentally. I don’t really care if the Turin Shroud is ‘the burial cloth of late-Second Temple era crucifixion victim’ or a forgery or a tea-towel. What I’m saying is that the concept of the Turin Shroud being the burial cloth of Jesus Christ of Nazareth is hooey. As I’m sure you are aware, the evidence that has been offered up over the years in favour of this idea has been voluminous and contradictory. The discovery of pollen grains that were testament to the shroud’s pedigree was quickly thrown into question. Impressions of ‘flowers’ on the shroud are plainly nothing more than paradolia. A plausible method for the formation of the human figure (other than painting with pigments) has never been advanced. The carbon-dating, which was sought for decades as the ultimate decider, was rejected by Shroudies when it didn’t return the desired result: there was something wrong with the dating (the data set was wrong/the sample was tainted by atmospheric carbon/the piece of cloth was taken from an anachronistic repair). As I pointed out, even the Bible itself contradicts the science that has come from the shroud – the amount of aloes and spice that was brought to the tomb by Nicodemus and used on the body was ‘a hundred pounds in weight’. That’s an awful lot of spices for absolutely no trace to survive in the cloth, especially if pollen allegedly did. This pattern of ‘moving the goalposts’ and cherry-picking the data is well known to any observer of pseudo-scientific belief: If the results don’t fit the preconception, then there is something wrong with the method, not the conclusion.\nLet’s first address the question about seeking proof that Jesus Christ was resurrected… But it isn’t so. I seldom hear it from any shroud researcher.\nWhat? Of of course it’s about acquiring proof, and of course no-one’s going to admit that’s what it’s about (especially to themselves) for the reason I gave: seeking evidence indicates lack of faith. And not just lack of faith in the resurrection, but lack of faith that Jesus even existed as the character he is concocted to be. (Quite obviously, establishing proof that the shroud is Jesus’ burial cloth implies proof of the story of the resurrection – if it didn’t, and it was just about Jesus being a normal mortal man, then the whole ideology of the Christian church surely collapses like a deck of cards).  If it’s not about all that, then what is it about? Some abstract historical pursuit of a quasi-religious artifact? There are many of those and none of them attract the kind of zealots that swarm around the Shroud of Turin.\nQuite the opposite, people who did talk about their faith (and that wasn’t a big topic) expressed the view that the shroud has nothing to do with their faith.\nI really can’t believe that you are quite that naive. So, um, these people are just history students who happen to be obsessed to the point of fanaticism with this one religious relic? Oh, don’t get me wrong – I’m sure that if the shroud turned out to be a fake (or some other mis-identified personage) the discovery wouldn’t alter anyone’s faith, but I bet you’re all kinda hoping that it is Jesus. Because, deep down, that would sort of ‘help the faith along’, wouldn’t it? Your guess that there was ‘one atheist’ in a crowd of believers at the Ohio conference is telling – I don’t think any other truly scientific enterprise would throw that statistic.\nBut the evidence does not support the argument that it is fake.\nPerhaps not, but there is a truckload of evidence to suggest to the sensible observer that the shroud is not the burial cloth of Jesus Christ. That it is a fake is plenty more plausible than that particular piece of wishful thinking. We know for certain that religious fakery has been rife through the ages, and when it comes to the Christian ouevre, particularly around the time that carbon dating and the historical records of the Catholic church place this particular piece of cloth.\nLet me make you a prediction Dan: when the carbon dating data is re-examined, the evidence will still be unequivocal. In fact, if the Jacksons, or anyone else, manage to get a different segment of the cloth tested, I predict that the data will, once more, indicate something contradictory to the idea that the Turin Shroud is the burial cloth of Jesus Christ, and when that happens, a whole new reason will be advanced as to why the method is faulty.\nPlease feel free to revisit Tetherd Cow at that time and tell me if my conjecture is wrong.\n\n","date":"August 27, 2008 at 1:31 am","url":"https://shroudstory.com/2008/08/26/more-tetherd-cow-ahead-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-16","author":"anaglyph","site":"shroudstory"},{"title":"More Tetherd Cow Ahead on the Shroud of Turin","post":"That should have read:\n“when the carbon dating data is re-examined, the evidence will still be equivocal“. Rather than unequivocal. I don’t think we’ll ever get unequivocal evidence from the shroud.\n\n","date":"August 27, 2008 at 3:49 am","url":"https://shroudstory.com/2008/08/26/more-tetherd-cow-ahead-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-17","author":"anaglyph","site":"shroudstory"},{"title":"More Tetherd Cow Ahead on the Shroud of Turin","post":"Skeptics can claim whatever fits their hate for religion and God ,nevertheless its not  honest to doubt the accuracy and meaning of scientific studies like the Robert Villareal´s and his team from Los Alamos National Laboratory .\nAs we know this study confirms once more that the radiocarbon sample was taken from a rewoven area  ( the late professor Raymond Rogers himself a researcher who followed the scientific method applied to the Shroud of Turin  had already concluded that in 2005) so 1988 carbon dating can no longer be an argument against authenticity.\nAll other evidences namely historical documents ( skeptics always «ignore » pre 1356 facts that proof Shroud´s existence before that time like Robert de Clari´s text, the sermon of Gregory Referendarius , Pray Codex , Codex Vossianus Latinus and so on ) forensic data and the chemical and physical properties  of the image point to only one conclusion- THE IMAGE OF JESUS CHRIST after all the inflicted sufferings as the Gospels talk about-  true science tells us the image was not man made and even now with most advanced technologies its not possible to  produce even the face of the Man of the Shroud ( remember that the claimed 3 D encoding of the last experiment to my knowledge by Nathan Wilson – the Shadow Shroud  was reliably debunked by the french expert in computer image processing  Christophe Mignot who is not a shroud researcher )\nAs Dan Porter says in his amazing website SCIENCE CANNOT RULE OUT A MIRACLE BUT IT CAN AND DOES RULE OUT FAKERY\nThe only logical conclusion (obviously not explained by science ) is that the Shroud of  Turin was the silent witness of that unique event CHRIST ´ RESURRECTION\nSo what else culd it be ?\n                                 greetings\n              Maria da Glória\n\n","date":"August 27, 2008 at 9:34 pm","url":"https://shroudstory.com/2008/08/26/more-tetherd-cow-ahead-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-24","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"More Tetherd Cow Ahead on the Shroud of Turin","post":"Whether the shroud is the work of a human hand (forgery, hoax, as pseudo-sceptics would say), or whether it was accidental/incidental involving a corpse under unobserved circumstances is beside the point. Also, the carbon dating problem pales into significance as far as believers or pseudo-sceptics are concerned, because the real matter at hand is the image itself. \nLook at the number of ‘sceptic’ websites and papers trying to explain away the phenomenon (e.g. http://skepdic.com/shroud.html, http://www.freeinquiry.com/skeptic/shroud/, etc.). Aside from their disagreements over carbond dating analysis, pollen analysis and the apparent discoveries of paint pigments, they still fail miserably in one vital area that they arrogantly claim to have the monopoly over: objective reality.\nThe objective reality of the shroud is the image contained therein or thereupon. The idea that the image created on the shroud is the work of a painter seems, quite frankly, ridiculous, and as it stands, it is also impossible. As the shroud dates from at least the early renaissance period, perhaps earlier (and if the pseudo-skeptics want to have it both ways, earlier still), you are faced with the fact that the greatest painters of that period: Giotto, Fra Angelico, Uccello, Pisanello were not of a sufficient technical skill to present anything near photo-realistic depictions on panel. Even if you attribute the shrouds earliest historical mention to a later period you would still have to concede that artists such as Leonardo, Raphael and Giorgione (and that really is pushing the limits historically) still didn’t have sufficient technical capabilities to create thoroughly realistic work. But most importantly, the shroud, if a work of hand, would not just be a remarkable piece of photo realistic work, the actual application of the paint is the most telling factor. For the image to have been painted on the shroud would have taken a painter an effort so great that he would have to be able to apply correct weights of paint or pigment, from a loaded brush or other hand-held device, with a technique employing pointilism, so accurate as to be executed under conditions that would require a microscope, without error, and with such perfection as to enable a 3D image to appear using a VP-8 Image Analyzer, and of course, imagining the entire image while executing the painting, back, front and inside out to all match perfectly while taking into account perspective distortion and blood flow into relevant parts, and one last thing – the whole image would be done in negative! All of this would have to have been done by a painter WITHOUT A SINGLE MISTAKE. The microscope has shown that quite clearly.\nWhat pseudo-sceptics don’t seem to understand is that they can’t simply sweep something under the carpet like this and hope that it goes away. No matter what the argument is regarding the age of the cloth, or even of whether it corresponds to Christ, nobody has been able to explain how the image could have been made. No painter from hundreds of years ago had the time, resources or skill to paint that image. No painter now has the time, resources or skill to paint that image. If they do, they simply have to replicate it and prove to us that it’s a forgery, but they can’t. No painter can. Some crude attempts to recreate it have been attempted, but they are certainly not as accurate, and are light years away from similar when viewed under a microscope. And so the pseudo-sceptics in their desperate attempt to debunk it remain unable to explain how a supra-genius master painter/forger had the time, skill and resources available in the 14th century to create this wonder, while nothing else exists in the world of anything near the same level of technical accomplishment. I find it both disappointing and depressing that human beings can be so dishonest and ignorant of this obvious fact. \nIt’s the duty of science to understand how the image came to be on the cloth. If we ever understand how it did happen by a means other than painting, we still have no means of proving that this is the shroud of Christ.\n\n","date":"March 8, 2009 at 6:32 am","url":"https://shroudstory.com/2008/08/26/more-tetherd-cow-ahead-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-295","author":"S J Miller","site":"shroudstory"},{"title":"More Tetherd Cow Ahead on the Shroud of Turin","post":"Very intresing argument. Sceptics should listen more carfully and pay atention to you’re arguments. Great stuff\nJake\n\n","date":"April 19, 2009 at 7:03 am","url":"https://shroudstory.com/2008/08/26/more-tetherd-cow-ahead-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-380","author":"Jake Geneva","site":"shroudstory"},{"title":"More Tetherd Cow Ahead on the Shroud of Turin","post":"SJ Miller: \nYour reasoning is foggy and unfocussed. What do you mean by:\n>>Whether the shroud is the work of a human hand (forgery, hoax, as pseudo-sceptics would say), or whether it was accidental/incidental involving a corpse under unobserved circumstances is beside the point. Also, the carbon dating problem pales into significance as far as believers or pseudo-sceptics are concerned, because the real matter at hand is the image itself.?\nThat makes absolutely no sense. Of course the genesis of the image is not ‘beside the point’. That’s the whole point, surely? \n>>and of course, imagining the entire image while executing the painting, back, front and inside out to all match perfectly while taking into account perspective distortion and blood flow into relevant parts, and one last thing – the whole image would be done in negative! All of this would have to have been done by a painter WITHOUT A SINGLE MISTAKE. The microscope has shown that quite clearly.\nContrary to what you say about ‘nobody has been able to explain how the image could have been made’, and as I have already pointed out, this would have been a trivial undertaking – merely paint a body with some kind of pigment and wrap it in a cloth. Why do you keep repeating the stupid notion that critics insist it was ‘painted’? I never said that, and as far as I know, NO-ONE who is critical of the shroud says that. (And there’s no evidence of blood flow, as I’m sure you are totally aware – that’s pareidolia and conjecture at best)\nYour elaborate demonstration that a even a painter of genius couldn’t have made the image is meaningless. ANYONE could have painted a body and wrapped it in a cloth. Even unintentionally, unguents or oils could have made a life-like impression of a body. Aging does the rest. As I’ve said before, the fact that it’s a negative is completely UNSURPRISING, even though you seem to have trouble with that – it’s a natural consequence of the higher contours of the form being in heavier contact with the cloth.\nAnd, just to be clear here, I’m not a ‘pseudo-sceptic’, whatever that is. I’m a dyed-in-the-wool total skeptic. I don’t equivocate.\n\n","date":"April 19, 2009 at 7:13 am","url":"https://shroudstory.com/2008/08/26/more-tetherd-cow-ahead-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-381","author":"anaglyph","site":"shroudstory"}]
