[{"title":"New Paper: The Missing Corners and the Radiocarbon Date","post":"Bacterial and/or mould contamination has been considered before and the evidence for sporadic ‘spotting’ is qute compelling, but much of Pam’s evidence for her cutting and reweaving hypothesis is considerably less so.\n1) Her photos with arrows showing water douse marks after the fire of 1532. As Guerreschi has shown, the outer two arrows point to waterstains that are not associated with the fire at all. The middle arrow shows how very little water actually penetrated the shroud as a result of the fire. Either way, even the big stain almost completely misses the C14 cut-off corner. The other cut-off corner does largely coincide with a larger and more diffuse stain (still not associated with the 1532 fire though), but then so do four other areas along that edge of the shroud, none of which show substantial mould or bacterial damage.\n2) Garza-Valdez’s bacteria. Those who examined the shroud in 1978 think this is vastly overplayed. To me, it is true, those little purple wiggles look like bacteria, but others claim they are no more than microfibres stripped off the fibres themselves. It is clear that even if they exist these bacteria have had little or no effect on the integrity of the cloth, and do not need (and did not need) to be cut away.\n3) Terpene and cotton contamination. Pam has confused two separate pieces of research here, which cannot be eaily reconciled. The photo of an alleged piece of intertwined threads of cotton on end and flax the other – and not stuck together with anything – is a different thread from the one examined by Villarreal, where the two pieces were butt-joined, not intertwined, both cotton, and stuck together with gum. Given this contradiction, it is obvious that neither of these observations can be considered representative of the radiocarbon area as a whole.\n4) The weave pattern. The first photo is the somewhat indistinct one used by Benford and Marino to show that one side of a herringbone ‘spine’ is more irregular than the other, which some textile ‘experts’ agreed may be evidence that the two were not of consistent manufacture. Actually an enlargement of any randomly selected part of the shroud on Shroud 2.0 shows similar irregularities. The second set of pictures does not show the C14 dating sample, or in fact any sample of the shroud at all. Caspar von Uffhofen, from whose work is was taken, says it is an ilustration put together entirely for illustrative purposes by Mssrs Castaldi and Bara.\nI do not consider that the mouldy corner cut-away hypothesis has been established at all.\nHowever, I don’t think the wiping of the cloth with a slightly sticky cotton cloth is unlikely. I suggested it a while ago when I first noticed that the Holland backing cloth under the shroud was considerably lighter than the exposed areas, and thought some stain might have been applied on the more visible areas to try to make them less conspicuous. Such a stain would have almost no effect on the radiocarbon date, but could perhaps account for the chronological gradient observed by Riani and Atkinson.\n\n","date":"April 23, 2014 at 10:26 am","url":"https://shroudstory.com/2014/04/23/new-paper-the-missing-corners-and-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-102778","author":"Hugh Farey","site":"shroudstory"},{"title":"New Paper: The Missing Corners and the Radiocarbon Date","post":"Fact is, that the shroud never get lost!!\nAny substance normally consumed after 100 years\nIf you see that it even survived a fire\nBut this shroud after 2000 years is quite\nin strokes. And that alone is a miracle.\nI have no doubt more, in fact\nThe shroud strengthened my faith and\nThe paintings now hang on the walls.\nRemember that everyone saw Jesus\ntoaal deformed and beaten so badly\nAnd they saw him die on the cross.\nWhat amazed me is that 500 people\nsaw it alive. And the dead from the grave came\nand they went to Heaven with it. They will be much\nmore secrets for us than we even held\nmar imagine. But the biggest secret is now\nuncovered by Ray Downing and his team.\nAnd I think these people are elected. By Jesus\n\n","date":"April 23, 2014 at 7:16 pm","url":"https://shroudstory.com/2014/04/23/new-paper-the-missing-corners-and-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-102955","author":"Angel Wynton","site":"shroudstory"},{"title":"New Paper: The Missing Corners and the Radiocarbon Date","post":"I don’t believe a waterstain is required to justify the disinfection/re weaving hypothesis. There are many other water stains on the shroud. Why only those two were reworked. I think the more plausible cause is that these edges are the most handled parts of the cloth. I have a life-size replica and I can’t tell you how obvious that is. Any person who consider displaying the shroud or handling it will have no problem realizing this. The shroud is enormous and if you want to do anything with it you have to hold those two corners, over and over and over again. It goes without saying oil from the skin together with bacterial flora associated lodges on those corners more than anywhere else. Most of the historic depictions i have seen display the frontal image to the left, which would leave the damaged corners on the top side, where they were held as the shroud was dangling from balconies in big events. The rest of the paper makes sense to explain what a ” curator ” would consider doing after significant damage and deterioration to those corners.\n\n","date":"April 23, 2014 at 9:35 pm","url":"https://shroudstory.com/2014/04/23/new-paper-the-missing-corners-and-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-102987","author":"Mike M","site":"shroudstory"},{"title":"New Paper: The Missing Corners and the Radiocarbon Date","post":"Its more easy even, cause the Shroud is a real healing cloth!\nThat means, everyone who touch the shroud and are sick…?\nThose people get  heald right away, but its behind glas.\n\n","date":"April 24, 2014 at 4:54 am","url":"https://shroudstory.com/2014/04/23/new-paper-the-missing-corners-and-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-103120","author":"Angel Wynton","site":"shroudstory"},{"title":"New Paper: The Missing Corners and the Radiocarbon Date","post":"Re pieces having been removed from the Turin Holy Shroud:\nIn the High Book of the Grail (late or early 12th c CE), the Grail is a most holy relic of the Lord and of his passion and death (this is made abundantly clear by the vision that accompanies its 1st appearance to Gawain). It is virtually equivalent to Christ’s burial shroud. In the healing of Perceval/Perlevaus  (P/P) with the lord’s own burial shroud (saintisme drap), which Dardrane P/P’s sister, fetches from the Graveyard Perilous, P/P lies powerless to avenge the Widow Lady, conquer his enemies and reconquer their land until the very same burial shroud has touched his face and a piece of it is removed…\n\n","date":"April 24, 2014 at 6:55 am","url":"https://shroudstory.com/2014/04/23/new-paper-the-missing-corners-and-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-103150","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"New Paper: The Missing Corners and the Radiocarbon Date","post":"Typo: late 12th or early 13th c. CE)\n\n","date":"April 24, 2014 at 6:57 am","url":"https://shroudstory.com/2014/04/23/new-paper-the-missing-corners-and-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-103152","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"New Paper: The Missing Corners and the Radiocarbon Date","post":"We now have a PDF file.\n\n","date":"April 24, 2014 at 9:26 am","url":"https://shroudstory.com/2014/04/23/new-paper-the-missing-corners-and-the-radiocarbon-date/","cat":"carbon_14_dating","id":"comment-103207","author":"Dan","site":"shroudstory"}]
