[{"title":"BSTS Article by Hugh Farey","post":"Sorry, carbon-dating for dummies here, but is Hugh suggesting in this article that the C-14 points to a 1290 AD average date? This puts it much earlier than the current medieval proponents’ theories, but what is the significance of that? If one believes it is a man-made artifact, the technology exists at any time in history to have made it – 1290 included, no?\n\n","date":"January 21, 2015 at 3:09 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185179","author":"David Goulet","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"Generally, yes, the average date for the Shroud is 691+/-31 years BP, which correspondence to about 1280 AD. The calendar date ranges for the C-14 dating of the Shroud are 1262-1312 for 68 % confidence level, and 1262 -1312 ,1353-1384 at 95 % confidence level (see http://www.shroud.com/nature.htm Table 3). This means that there is 68 % and 95 % probability that the actual date of the origin is somewhen  within mentioned time intervals –assuming of course that the measuremnts and sample were correct (the latter is main point of controversy).\n\n","date":"January 21, 2015 at 3:19 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185180","author":"O.K.","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"Yes, David G., I am indeed suggesting that the date is indeed earlier than previously suggested, as the post-1325 components can be safely ignored. It is important to realise that statistics, although a useful tool, must be sensibly interpreted. For instance, the “Nature” dates are from 1260 – 1390 (midpoint 1325), when the Shroud is generally accepted as having been displayed in 1350. Consequently, a more sensible interpretation of the Nature dates, would be 1260 – 1350 (midpoint 1305). My own interpretaton, ignoring the post-1330 ‘bump’ gives about 1260 – 1320 (midpoint 1290). A significant feature is that this gives a spread of +/- 30 years, which is quite satisfactory. If we follow the Nature data, and include the post-1330 bump, and the impossible post-first-appearance 1390, then we get a spread of +/- 65 years, which seems excessive but is an artifact of the calibration curve.\nTo those who don’t really grasp statistics, it seems crazy that if two people count 70 and 80 cows in a field, there is a statisitical probability that there are in fact only 4, but that’s how they work!\n\n","date":"January 21, 2015 at 6:28 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185218","author":"Hugh Farey","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"“To those who don’t really grasp statistics, it seems crazy that if two people count 70 and 80 cows in a field, there is a statisitical probability that there are in fact only 4, but that’s how they work”\nApparently it works everywhere except in New Zealand …\n\n","date":"January 21, 2015 at 10:53 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185269","author":"PHPL","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"100 years off is common for radio carbon dating.  What is surprising, is that their averaging technique gave the perfect range in relation to the historical documents known in 1988. The overall result looks so great in a paper.\nThe chi square value at 6.2 for the Shroud remains the key flag that the results appear contradictory. Compared to the the other radio dating dates, the Shroud is an outlier.\n\n","date":"January 21, 2015 at 3:59 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185185","author":"Mario Latendresse","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"The failure of several statistical tests, begining with the simplest chi square is important indicator that something was wrong here. But the presence of a gradient (and not just a high scatter) is even more important. It suggests systematic error and is not only consistent but even expected with regards to the interpolated material (reweaving) theory -which in fact, is only reliable theory able to explain that fact.\n\n","date":"January 21, 2015 at 4:08 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185188","author":"O.K.","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"What is surprising, is that their averaging technique gave the perfect range in relation to the historical documents known in 1988. \nThis is rather coincidence. The first documented appearance in Lirey in 1356 falls within C-14 interval (and only within 2 sigma range) purely by accident, I think.\n\n","date":"January 21, 2015 at 4:11 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185189","author":"O.K.","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"Not according the my new calculation.\n\n","date":"January 21, 2015 at 6:29 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185219","author":"Hugh Farey","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"Oops! Pressed Post too soon. The Shroud was first displayed some 60 years later than the midpoint of my range, and about 20 years later than the two-sigma range limit. That seems fine to me. To an authenticists, this is a stunning coincidence, and although Stephen Jones idea that the odds against it are astronomical is absurd, it is certainly unlikely. To a non-authenticist, of course, there is no surprise at all to find that the shroud radiocarbon dates to exactly the time when its history begins.\n\n","date":"January 21, 2015 at 6:34 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185221","author":"Hugh Farey","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"“To a non-authenticist, of course, there is no surprise at all to find that the shroud radiocarbon dates to exactly the time when its history begins.”  \nExcept the evidence is clear:  there is plenty pointing to an earlier existence than the date of 1356.  The nay-saying on this blog by anti-authenticists against the Pray Codex is downright embarrassing.  Oh yes, ” the 4 L-shaped holes on the Codex shroud actually hearken back to architectural practices on many ancient buildings….”  Indeed, rank poppycock.  Just one example of bad scholarship.\n\n","date":"January 22, 2015 at 8:26 am","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185372","author":"Nabber","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"There is indeed plenty of evidence in favour of a 1st century, authentic origin for the Shroud; but I’m afraid I don’t think the Pray Codex is part of it, for reasons much discussed elsewhere. You are right, however, that the ‘L-shaped’ circles have not been satisfactorily explained. I did at one point speculate that they, and the diagonal strip of crosses, represented a crude way of delineating the corner of the sarcophagus (Architectural practices?), but have to agree that I have not seen any evidence to confirm that idea. \nI am not familiar with the quotation. Who’s it from? It’s a bit over-assertive unless supported with evidence, but not necessarily poppycock, nor bad scholarship.\n\n","date":"January 22, 2015 at 11:38 am","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185402","author":"Hugh Farey","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"I echo Hugh in asking for the source of the quotation as in the exhaustive discussion we had on the Codex I don’t ever remember anyone coming up with it. There was a discussion on whether the holes on the sarcophagus lid on the Codex are an attempt to reproduce the holes drilled in the lid placed over the original tomb in the (? tenth) century, a point given some support by the Crusader crosses on the Codex at a time, the 1190s, when there was Crusade fever in Hungary.\nBut he Pray Codex has become an article of faith for which some Shroudies would be prepared to go to the stake. I still wait for an explanation of how someone saw the Shroud with the two images of a bloodstained and scourged man and then reproduced the poker holes but failed to show any of the wounds and scourge marks on the body of Christ that  was being laid out our or any sign of images on the discarded grave clothes.\nThe real question that fascinates me is why authenticists cling to the Pray Codex when they continually tell us that the evidence for the authenticity of the Shroud is overwhelming. Why then need the Codex which, even if it did show the Shroud, only takes its history back to the 1190s and no further – almost within the range of Hugh’s carbon  dating?\n\n","date":"January 23, 2015 at 3:43 am","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185633","author":"Charles Freeman","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"It takes considerable imagination to see the shroud in the pray codex.\n\n","date":"January 23, 2015 at 5:15 am","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185647","author":"PHPL","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"“To my way of thinking this plays into the mended shroud explanations…”\nTo my way of thinking much has been written way more convincingly about this issue.\n\n","date":"January 22, 2015 at 3:59 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185456","author":"anoxie","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"“It takes considerable imagination to see the shroud in the pray codex.” -PHPL\nIt takes considerable imagination to see PHPL comments as anything but cynical and jumping-on-a-(very small) bandwagon.  You’re considerably outnumbered by keen observers.\n\n","date":"January 23, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185793","author":"Nabber","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"“You’re considerably outnumbered by keen observers.” I really wish I knew. Most determined pro and non authenticists are convinced that their views are majority ones, but really we have no way of knowing at all. Contributors and observers to this blog are, I think, mostly pro, but commenters on other sites seem mostly non, and some distinctly anti. Nor is it possible to decide whether these views are held on the basis of an examination of the evidence, or a conviction based on hearsay or the authority of others. It would be interesting to know.\n\n","date":"January 23, 2015 at 6:28 pm","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-185816","author":"Hugh Farey","site":"shroudstory"},{"title":"BSTS Article by Hugh Farey","post":"The three C-14 dating laboratories did not obtain the same value for the C-14 date of the Shroud, and more than one statistical analysis of their results indicate that there is only a 5% chance (or less) that the three values are within the measurement uncertainties of each other.  It should therefore be concluded that there is probably something causing the difference.  When the three values are plotted with their measurement uncertainties as a function of the distance of the sample points from the end of the Shroud, the slope or gradient to the values is obvious.  I believe that I know why there is a slope to these values.  Last year, I used the MCNP nuclear analysis computer code to calculate the effect of neutrons being released homogeneously from the body of Jesus in the resurrection.  I reported my results at the Shroud conference in St. Louis in 2014.  The title of my presentation was “MCNP Analysis of Neutrons Released from Jesus’ Body in the Resurrection.”  This PowerPoint presentation and the narration to it are available at shroud.com or by doing a Google search on the title.  In these computer calculations, when I assumed that neutrons are homogeneously released from Jesus’ body (probably due to the resurrection), my results agree with three items:  the uncorrected C-14 date for the Shroud of Turin of 1260 AD, the correct slope of the C-14 date across the three sample locations, and the correct C-14 date for the Sudarium of Oveido of about 700 AD.  Therefore, the three C-14 dates have a slope or gradient as a function of distance from the end of the Shroud because of the distribution that the neutrons naturally take in the tomb when they are emitted homogeneously from the body.  The shape of the neutron distribution in the tomb assuming that neutrons are homogeneously emitted from Jesus’ body is a cosine shape.  The sample location used in the C-14 dating was near the feet at the bottom of the Shroud.  Thus, the neutron density was near a minimum at the sample location due to the cosine shape, but increasing rapidly as you move the sample point away from the end of the shroud again due to the cosine shape.  So the cosine shape of the neutron distribution in the tomb explains the slope across the three C-14 dates obtained by the three laboratories.  This is evidence that there were neutrons released from Jesus’ body, and if so, then some of the neutrons would have been absorbed in the N-14 in the Shroud to produce new C-14 atoms in the Shroud which would be indistinguishable from the original C-14 atoms in the Shroud, which would produce a much more recent C-14 date than the actual date for the Shroud.  In other words, if Jesus was resurrected from the dead, then radiation including neutrons may have been emitted from the body in the process, and if neutrons were emitted from Jesus’ body while it was in the tomb, then C-14 dating would be expected to give a more recent date than the actual date.     Robert A. Rucker (robertarucker@yahoo.com)\n\n","date":"July 17, 2015 at 4:18 am","url":"https://shroudstory.com/2015/01/21/bsts-article-by-hugh-farey/","cat":"carbon_14_dating","id":"comment-206006","author":"Robert A. Rucker","site":"shroudstory"}]
