[{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"Dan I am sure that you would support, and I hope make strong moves to use your influence, to campaign for  a new radio-carbon -14 dating. After all, in the past twenty-five years r-c dating has become more scientifically accurate and it should be able to avoid the criticisms of the 1988 dating. Maybe it would also pinpoint a more precise date within or outside of the 1260-1390 period.\nThose of us who stick to the presumption of the 1988 dating standing do so\na) because in relation to the three possible alternatives, a swapping over of samples by the Cardinal and Tite,  some form of contamination ( many different contaminants, soot, sweat, carbon monoxide suggested) or an invisible rewoven patch selected as the sample, critics of the testing disagree so violently among themselves – e.g see Antonacci’s critique of Raymond Rogers’ 2005 paper-  that the independent observer cannot be convinced that a single clear refutation of the 1988 testing has been proposed by the critics b) There is not a hint in any of these critiques that resolution of the problems proposed would lead to a radio-carbon 14 dating in the first century.\nOnly those who are absolutely committed  to supporting one date or the other have anything to fear from a retesting and as STURP has been among the main critics of the 1988 tests, it is presumably their primary responsibility to call for a new test by at least three independent radio-carbon-14 laboratories. STURP would presumably provide observers  who would be present alongside textile and radio-carbon 14 experts to make sure that representative samples of the whole Shroud are chosen. As  shroud or burial cloths undoubtedly did exist in the tomb of Jesus in c. 30, there is just a possibility they survived and I for one would not rule that out.\n\n","date":"April 28, 2012 at 11:32 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10911","author":"Charles Freeman","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"A previous (very?) similar paper was presented at the Frascati Conference (2010). For a free copy, see http://www2.lse.ac.uk/statistics/research/RAFC04May2010.pdf. Hang on for some interesting combinatorial analysis in that paper. It lends credence to the theory of an odd sample.\n\n","date":"April 28, 2012 at 2:05 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10914","author":"latendre","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"thank you ! ..\n\n","date":"April 28, 2012 at 2:47 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10916","author":"Tornike Chiboshvili","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"The four authors’ article “Carbon Dating of the Shroud of Turin: Partially Labelled Regressors and the Design of Experiments” on http://www2.lse.ac.uk/statistics/research/RAFC04May2010.pdf has the same abstract as their April 2012 article. It says\n“We conclude …that there is a significant trend in the longitudinal coordinates”, \nand its final conclusion is:\n“Due to the heterogeneity of the data and the evidence of a strong linear\ntrend the twelve measurements of the age of the TS cannot be considered\nas repeated measurements of a single unknown quantity. The statement of\nDamon, Donahue, Gore, and eighteen others (1989) that “The results provide\nconclusive evidence that the linen of the Shroud of Turin is mediaeval” needs\nto be reconsidered in the light of the evidence produced by our use of robust\nstatistical techniques.” (all on page 4)\nThis doesn’t mean that the twelve radiocarbon measurements themselves were invalid, but that the mean date from these twelve measurements is not representative for the single Shroud. The strong linear trend in the twelve measurements suggests that the Shroud did not radiocarbon age homogeneously, but in way that systematically depended on the longitudinal distance of a certain subsample – one of the twelve – to some (central) location of the Shroud.\n\n","date":"April 28, 2012 at 2:51 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10917","author":"Adrie","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"The only point in further C14 dating would be if a rigorous valid representative sampling protocol was designed and adhered to.  In 1988 the Vatican’s scientific advisor, Brazilian-born Professor Carlos Chagas had put forward a well-reseached protocol, involving seven named laboratories some using the old Libby, others the new AMS methods.  This was rejected by the Turin guardians, Cardinal Anastasio Ballastrero and Professor Luigi Gonella, despite the higher professional standing of Chagas.  The Turin street-fighters won out.  Incredibly, it was only when the scientists were assembled immediately prior to the sampling that Gonella and his close friend Giovanni Riggi began to deliberate on the best location for a SINGLE sample, a debate that took them two hours. [Source – Wilson “The Shroud” 2010]. \nIn the present politico-religious climate of over-protection and aversion to further scientific testing, I shouldn’t think that any further sampling for C14 or any other kind of testing is likely to happen any time soon!  Stated present objectives are said to be directed at conservation rather than analysis.  Further worthwhile testing (apart from C14) also seems to have been compromised by the 2002(?) “restoration”.\n\n","date":"April 28, 2012 at 5:21 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10920","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"Quote from the paper : “The twelve results from the 1988 radio carbon dating of the Shroud of Turin show surprising heterogeneity.”\nFor me, it’s not at all surprising if you consider the findings of Ray Rogers (BTW, those findings were rejected by Fanti, who simply reject about anything Rogers has ever said or wrote…) and the probability of a medieval invisible repair in that particular part of the Shroud.\nAt the same time, this kind of heterogeneity in one single little sample would be VERY SURPRISING if we consider other hypothesis to explain the medieval dating of the Shroud, like the supernatural hypothesis proclaimed by Jean-Baptiste Rinaudo in France…  \nAnd by the way, in a recent book published in France (last year) written by Brice Perrier, the author cite Fanti who was defending Rinaudo’s hypothesis !!!  Incredible !!!  Fanti have always claim that the Shroud body images were done by a Corona discharge and here, just to be able to stand one more time against Ray Rogers, here he is to defend another supernatural hypothesis involving a bombardment of protons and neutrons that have nothing to do with a Corona discharge !!!\nJust with this little example, we can see the kind of ridiculous thinking that goes on in M. Fanti’s mind and, even more, we can note how he belong to the anti-Rogers clique that pollutes the Shroud world…  A real bad joke.\n\n","date":"April 28, 2012 at 6:12 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10923","author":"Yannick Clément","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"I completely disagree with Dan when he says in his post that ”This just adds to the mountain of information that completely invalidates 1988 carbon dating of the shroud”\nThis journal belongs to the JCR is peer-reviewed, has an impact factor of 1.851 and is in position 19 out of 97 in the field of COMPUTER SCIENCE, THEORY & METHODS.\nTo me at least, it means that the methodology followed support the conclusion that there\nis a spatial trend in the Shroud.\nThe only apportion of this paper is that there is a spatial trend in the C14 proportion as we move from the border to the central part of the Shroud.  However, the maximum and minimum C14 counts across the 12 subsamples still support the idea of  a medieval artifact. The lack of homegeneity in the samples moves between C14 counts associated to medieval datation boundaries. \nIf there is a trend, it only indicates a different behaviour in different areas, which may well be associated to a more intensive handling and thus contamination in peripheric areas of the linen. Or perhaps to any other effect but please note, that if the sample belonged to a medieval reweaving, as so often has been stated, the trend still seems to be there. For this reason, I think that the detection of a trend does not invalidate anything: it could be explained in the case of being a sample belonging to the original linen and also in the case of a medieval reweaving.\nThe kind of lack of homogeneity that the presence of a trend indicates is not a chaotic one. It represents a smooth and ordered change in C14 counts with distance thus indicating that most probably a physical effect (I pointed out one but it can be any other) is behind this trend. We cannot forget that the boundaries still are associated to a medieval datation.\nIf the lack of homegeneity among the 12 subsamples were really chaotic with datations moving let’s say between 3000BC and 1600 CE and randomly distributed among the subsamples, this would represent a solid argument against coming with an average datation (medieval or not).\nAs a conclusion, in my opinion, the results presented in this paper do not contribute the  least to invalidate the 1988 carbon dating. Furthermore, a trend and not a chaotic distribution  sort of indicate a rigourous and systematic methodology applied by the different laboratories whose results when combined, are solid enough as to conform a discernible trend. Please, remember that this statement also applies if a medieval reweaving (a very reasonable option in the light of widely published results) had been tested.\nI don`t agree either with Charles Freeman and Daveb when they sort of say that a new C14 test is needed. This is also a common place in many comments here. I have in many occasions written comments about this issue ,so I will summarize my point by saying that in 1988 it was thought that the C14 test was appliable to virtually everything. Now there is more than enough evidence to state that this test cannot be used with the Shoud and new datation strategies should move towards other techniques.\n\n","date":"April 28, 2012 at 7:00 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10927","author":"Gabriel","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"Gabriel, I understand what you say.  And here’s a quote from you : “As a conclusion, in my opinion, the results presented in this paper do not contribute the least to invalidate the 1988 carbon dating.”  I agree to some extend.  But, you must not forget all the things found by Rogers that are well enough to show that the part of the Shroud that was dated was not representative at all of the rest of the cloth.  By the way, Alan Alder, prior to Rogers, did some spectroscopic analyses at the end of the 90s with some very good technique like fourier transform infrared spectroscopy and publish them in his book “The Orphaned Manuscript”.  He was able to put his hands on 3 threads that came from the zone directly adjacent to the C14 sample.  Personally, I don’t think we have any good reason to really doubt the findings he made during those examinations, simply because many of them just confirmed ancient conclusions reached by the STURP team before, and also, concerning his examination of the threads coming from the border of the C14 sample, it was pretty much confirmed by Rogers later on.  And what was found by Adler in the spectrometric signature between threads coming from the C14 region and other non image threads coming from other parts of the cloth ?  A drastic difference indicating, without any doubt, that the chemical composition of the C14 region was dramatically different thant the rest of the Shroud.  \nSo, I think Rogers and Adler findings are well enough to understand that the C14 sample that was dated in 1988 was not representative of the whole cloth.  Personally, I think a new radiocarbon dating will be necessary, but it will need to be done properly with multiple samples taken from different parts of the cloth.  I also agree with you that if other precise dating techniques exist that can be applied to ancient cloths, why not used them ?  But I think that another C14 would be interesting nevertheless to, at least, prove even more the invalidity of the first dating done in 1988, because I’m sure that, no matter what would be the result of a new C14 test, it would be different from the first one !  If other good method exist, I think it would be great to see a protocol of dating involving more than one single technique like the C14…\n\n","date":"April 28, 2012 at 9:05 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10929","author":"Yannick Clément","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"I believe Ray Rogers said that any further C14 dating of the shroud would be impossible because of the preservative that is now used to keep insects from damaging it. It is an organic insecticide, I think, and cannot be removed during any cleaning process so it will always be a contaminant and will always skew the C14 results. If that is true you can forget any future testing of the main cloth. \nI think he said the only thing left to test is the charred bits removed during the restoration as they were removed before the new chemical preservative was used.\n\n","date":"April 28, 2012 at 9:56 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10931","author":"Chris","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"That’s right.  And this charred material was preserved by the Turin authorities.  That could make some good samples to analyse.  But anyway, I think they could date some threads from other parts of the Shroud, just to see the difference…  I don’t think Rogers opinion was definitive about the real effects on C14 dating of the Thymol cleaner used inside the Shroud reliquary.  I think it was more of a “could be problematic” kind of opinion.\n\n","date":"April 28, 2012 at 10:04 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10932","author":"Yannick Clément","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"I wonder if it is possible that the Vatican has already tested the shroud again. If the they had, then it might explain the apparent drift they have had as of late towards authenticity.\n\n","date":"April 29, 2012 at 12:11 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10935","author":"Tim","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"You can forget about that unless you love conspiracy tales like The Da Vinci Code and stuff like that.  Personnaly, I really don’t think so.  I think that, after the 2002 restoration, the authorities took all the different samples and data they gathered and put them in a safe with all the other data that were already there since the first scientific investigations of 1973, 1978 and 1988.  And then, wisely, they said to themselves (wisely I think) :  Let’s wait some time until the dust settles…\n\n","date":"April 29, 2012 at 6:49 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10969","author":"Yannick Clément","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"I cannot agree with the statement, that the existence of a smooth spatial trend in the data does not invalidate the conclusion. The simple fact is that such a trend, whether smooth or chaotic, should not exist. It was also not observed in the control samples. The presence of the trend proves that the experimentators were not measuring age, but something else, most probably age combined with some unknown factor x. As long as this unknown thing that was measured is not identified, no conclusion can be drawn. Stating that the age determination remains valid, implies that you already know something about the nature of the factor x that causes the trend. But the nature of that factor is completely unknown; there are only wild & uneducated guesses, and it is impossible to rationally predict the impact of factor x on an hypothetical measurement done on some other part of the Shroud. The only rational conclusion is, that a new 14C experiment should be done, with a different protocol, involving sample taking at different parts of the Shroud, and documenting the geometry of the subsamples. Too bad that the laboratories did not document this geometry, thereby involuntary destroying evidence that they had in their hands.\n\n","date":"April 29, 2012 at 2:18 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10942","author":"Jos Verhulst","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"If the radiocarbon datation is to be invalidated it is because the tests were carried out (as Rogers/Yannick suggest) on a medieval reweaving. But not because we detect a trend. My point is that this trend could be present in both cases (reweaving and original cloth) and would not contribute the least to distinguish between them.\nJos, I think that there is -please read again my previous comment- a significative difference between having a trend and not having anything but a chaotic distribution. But I agree with you when you say that the conclusion is that the 1988 C14 test was measuring two combined effects:age and something else.\nI tend to think that this x factor could be explained by a higher contamination of samples in peripherical areas, but it could be any other.\nAnd we come to my point why C14 test is not appliable here. In 1988 it was not known, but now we know that in cases like the Shroud there is always a x factor interfering datation!\nIt is precisely the presence of a trend that indicates that there is a discernible x effect! This x factor or any others are also likely to appear if new C14 tests are carried out. The C14 is a technique of the 80’s and cannot overcome this limitation, regardless fully representative samples are taken.\nTo be honest, I would like to stress the idea that another implication of the presence of a trend obtained from a combination of results independently obtained at different laboratories is that these labs did a good job. Otherwise a random combination of poorly analyzed samples would have never given the result of a trend 24 years later and most probably detect the existance of a x factor. I know a lot of people will disagree with me but I think in the light of this paper there are grounds to support my previous statement. It is also fair to recognize it after so much criticism.\nIn my opinion, these are the major reasons why the Church-which always gets very qualified scientific advice- will never carry out new C14 tests (not conspiration theories). I think we will see new tests in the future ( very distant future I am afraid) but not based on an obsolete technique like C14.\n\n","date":"April 29, 2012 at 4:19 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10943","author":"Gabriel","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"G at #7: “I don`t agree either with Charles Freeman and Daveb when they sort of say that a new C14 test is needed.” \nI made no advocacy for further C14 tests – that came solely from Charles.  My message was the simple obvious statement that any further C14 tests would be pointless unless there was a rigorous truly representative sampling protocol, and I doubted that any further C14 tests would be likely. \nAs yet I have not bothered to read the subject paper, although advanced statistical analysis is well within my technical competence.  I am sceptical that any trend has any true significance concerning the Shroud, for the following reasons:  1) I cannot imagine that the very small corner sample taken can in any way be representative of the whole; 2) The work of Rogers in stating that the sample had significant levels of vanillin and cotton contamination indicates that the sample could not be representative; 3) The sample therefore appears to be a patch; 4) I have seen enough costly errors made during my technical career resulting from poorly informed extrapolation of non-representative data;  5) Based on what else we can deduce about the age of the Shroud, I would expect to see a jump in the results rather than a persistence in the alleged trend, that is if C14 has any relevance to this artifact, which indeed seems to be in some question. \nI am intrigued that Gabriel sees C14 as an obsolete technique.  I should really like to be informed of what other scientific dating techniques might be available, more appropriate, as from her comment I take it that she does seem to have some other techniques in mind.  Would these techniques be immune from any skewing as a reult of the 2002 “restoration / conservation” activity.  Presumably any such new methods attempted would also need the assurance of being adequately representative of the whole, and not just from itty-bitty corners!\n\n","date":"April 29, 2012 at 6:12 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10944","author":"daveb of wellington nz","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"Daveb, I am afraid I misunderstood your point regarding the C14. Sorry for that.\nI would be great if you could share with us your opinion on this paper.\nRegarding why I think C14 is not appropiate/obsolete and which new techniques may be promising ,I have extensively written in this blog my points of view so I would not like to repeat myself.\nBasically, my position is based in the following scientific literature\nC14\n(1) H.E. Gove, S.J. Mattingly, A.R. David, L.A. Garza-Valdes. A problematic source of organic contamination of linen.Nuclear Instruments and Methods in Physics Research B 123 (1997) 504-507\nNew approaches based on trace elements\n(2)Takako Inoue, Kengo Ishihara and Kyoden Yasumoto.International Journal of Clothing Science and Technology Vol. 22 No. 2/3, 2010 pp. 174-186.”Comparative analysis of hand properties and compositions of trace elements in linen fabrics produced in different regions” in: International Journal of Clothing Science and Technology, Vol. 22 No. 2/3, 2010\n(3) Emily R. Schenk and Jose R. Almirall. Elemental analysis of cotton by laser-induced breakdown spectroscopy. May 2010 / Vol. 49, No. 13 / APPLIED OPTICS\n\n","date":"April 29, 2012 at 8:45 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10947","author":"Gabriel","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"@Gabriel “I would like to stress the idea that another implication of the presence of a trend obtained from a combination of results independently obtained at different laboratories is that these labs did a good job”.\nThere are two possible interpretations. On the one hand, there is the ‘conspiracy interpretation’, based on the fact that factor x correlates not only with a spatial gradient, but also with a temporal gradient: the measurements that were made later, also produced an older age for the Shroud. If factor x has spatial and not temporal/sequential significance, which seems by far the more probable interpretation, your conclusion is certainly valid. However, the labs did a good job only with respect to the measurements proper. They did an extremely lousy job as far as the documenting of the spatial distribution of the samples & subsamples is  concerned. The statistical processing of the results was also terrible.\n\n","date":"April 29, 2012 at 7:26 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10945","author":"Jos Verhulst","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"Jos, I agree 100% with this comment. I would add that the weak swivel of the C14 datation process is at the sample selection stage, not at the analysis stage.  If significant errors had been made, the peer-review process of a journal like Nature would have detected them. 24 years later an independent confirmation of this unexpectedly arises with this trend.\n\n","date":"April 29, 2012 at 8:53 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10948","author":"Gabriel","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"Why do you think they did so bad with the statistical processing ?  Because science (Rogers, Adler, etc.) has proven since 1988 that the radiocarbon sample was not homogeneous at all (chemically speaking), unlike any other part of the Shroud where chemical homogeneity was proven to be very good.  And since that part of the Shroud was not chemically homogeneous at all, all 3 labs get results different from one another in a way they wouldn’t normally expect from a tiny sample of some square centimeters.  Because of that, making those result fit into one single general dating result was a hard taks for them and they worked very hard to get there. \nThis FACT that the C14 sample was not homogeneous at all is a very good sign that there was some kind of manipulation in that region (most probably before the 1532 fire, since Adler has proven that threads of the C14 region were affected by a water stain).  And the findings of Rogers and Adler of materials that are not present anywhere else on the Shroud are also clear signs of some kind of manipulations in that region.  I don’t think we should have great doubts about that.  All those facts formed a good portrait that point in one direction :  the radiocarbon labs did a decent job in 1988 but they did it on a single sample that was not representative of the main cloth and that was probably repaired before 1532.  If we used Ockham razor principle, there’s do doubt at all that the medieval invisible repair is the most likely answer to explain the medieval date given by the labs in 1989.\n\n","date":"April 29, 2012 at 7:32 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-10972","author":"Yannick Clément","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"It is not a fact that the C14 sample was not homogeneous chemically. It was only claimed that the sample was chemically different than the main Shroud. This was interpreted as an anomaly and the result of a repair. I challenged both in my recent article “Internal selvedge in starched and dyed temple mantle – No invisible repair in Turin Shroud – No Maillard reaction” http://jesusking.info/Internal%20selvedge.pdf .See also Dan’s recent post https://shroudofturin.wordpress.com/2012/04/30/paper-chase-new-paper-challenges-rogers/\n\n","date":"April 30, 2012 at 3:28 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-11011","author":"Adrie","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"Adrie, you should listen to Alan Adler presentation at the first conference in Dallas in 1998.  Here’s the link to listen to it : http://shrouduniversity.com/podcasts/aladler.mp3\nYou’ll see that the spectroscopic analysis done by Adler leave no doubt about the FACT that the radiocarbon sample zone was not homogeneous at all !!!  And this FACT is in total agreement with the great difficulty that the C14 labs had to make all the data fit into one “coherent” conclusion !!!\nI wish you a good listening !!!  Listen carefully…\n\n","date":"May 2, 2012 at 3:49 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-11072","author":"Yannick Clément","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"Hello Yannick, I listened carefully and reread the article (Adler et al., Further Spectroscopic Investigations …, in The Orphaned Manuscript, http://holyshroudguild.org/orphaned-manuscript.html).\nAdler had 3 radiocarbon threads: a warp thread from the outer edge of the sample, one from the inner edge, and a weft thread from the middle. From each thread (which may have consisted of about 188 fibers in cross section, cf. the F15001 thread) he took 5 fibers: 1 from each end, 1 from the middle, 1 from the inside, and 1 at random (Adler at ca. 6:46). Of each fiber he made a FTIR spectrum and found a great deal of variability between even the 5 spectra from a single thread. \nThis can be explained. Adler wrote that each RC thread had an encrusted coating, looked scorched and waterstained, and had dirt deposits/microdebris (p. 94). Also, each would have had (ancient) cotton spun in (2-20%, Fanti, Rogers). So, the RC sample was practically homogeneous at thread level. But at fiber level there was much more variability, because a fiber from a single RC thread can be either:\n– cotton or linen\n– with a very thick, or very thin, or no coating\n– scorched or unscorched\n– with or without dirt deposit\nbecause a fiber can be either from the inside of the thread, from the outside of the thread, from the top of the weave, or from the intersections of the weave. This may vary even along the length of a single fiber.\nThe only-top-of-the-weave surface fibers from the main Shroud sticky-tape samples, on the other hand, “were removed from the tape, and their identity as to type verified”: Adler picked and cleaned 5 fibers of the non-image type, 4 of the waterstain type, 4 of the scorch type, 2 of the serum-coated type, 2 of the image type, etc. (p. 94). No wonder that the FTIR spectra of a type were identical. E.g., a chosen and cleaned non-image non-scorch non-waterstain fiber from the sticky-tapes, is only linen, with a very thin coating, unscorched and without dirt deposit. Of course there were spectral differences between the types.\nImportant is that the differences between the unchosen RC fibers were not very big: the spectra (p. 99) show that the threads were not entirely different from each other. They have roughly the same peaks, although of different relative intensities. Also the text doesn’t read the threads are different from each other, just that there is “more variation in the patterns” than in the non-image type (p. 96). Adler wrote: “There is insufficient evidence to conclusively demonstrate the presence of any adventitious linen in the radiocarbon sample area. … In fact, the FTIR data for the radiocarbon sample … shows physical characteristics of both the waterstain and scorch regions of the cloth” (p. 98). This corroborated that the RC area visibly belongs to a waterstain and scorch area: “you can tell by just looking at it” (Adler at 4:06-4:17).\nNow, a RC subsample that was RC dated, was not a fiber, not even a thread, but a piece of cloth, in which the variability among a thread’s fibers will have averaged out. So, the chemical variability at fiber level alone can not explain the strong linear trend shown by the twelve (thoroughly cleaned) pieces of cloth in the carbon dating. Only a substantial residue of carbon-containing handling dirt (inside the hollow fibers) that systematically varied over the twelve subsamples, might perhaps explain it. Or systematical irradiation …\n\n","date":"May 4, 2012 at 4:31 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-11106","author":"Adrie","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"\ndaveb of wellington nz :G at #7: “I don`t agree either with Charles Freeman and Daveb when they sort of say that a new C14 test is needed.”\nI made no advocacy for further C14 tests – that came solely from Charles. My message was the simple obvious statement that any further C14 tests would be pointless unless there was a rigorous truly representative sampling protocol, and I doubted that any further C14 tests would be likely.\nAs yet I have not bothered to read the subject paper, although advanced statistical analysis is well within my technical competence. I am sceptical that any trend has any true significance concerning the Shroud, for the following reasons: 1) I cannot imagine that the very small corner sample taken can in any way be representative of the whole; 2) The work of Rogers in stating that the sample had significant levels of vanillin and cotton contamination indicates that the sample could not be representative; 3) The sample therefore appears to be a patch; 4) I have seen enough costly errors made during my technical career resulting from poorly informed extrapolation of non-representative data; 5) Based on what else we can deduce about the age of the Shroud, I would expect to see a jump in the results rather than a persistence in the alleged trend, that is if C14 has any relevance to this artifact, which indeed seems to be in some question.\nI am intrigued that Gabriel sees C14 as an obsolete technique. I should really like to be informed of what other scientific dating techniques might be available, more appropriate, as from her comment I take it that she does seem to have some other techniques in mind. Would these techniques be immune from any skewing as a reult of the 2002 “restoration / conservation” activity. Presumably any such new methods attempted would also need the assurance of being adequately representative of the whole, and not just from itty-bitty corners!\nRight on Dave! Forget all other things; Dave’s points 1 and 2 go to the heart of the matter here. I for one do not accept the 1988 c14 results as being legit, not at all. We must remember this was not 12 separate samples, it was 12 pieces of the same sample and definately “not representative of the whole”. This sample area was also ‘proven’ by STURP research, including infrared images of the area prior to 1988, to be unlike the rest of the Shroud surface, studies, everyone simply ignored!. Anyone who still backs or even contemplates the 1988 c14 dating as being a point against the Shroud’s authenticity, should really get thier heads out of their behinds and do some research on radiocarbon dating, seriously!! No expert in RCD truthfully, would ever accept the conclusions of the 1988 tests considering it’s complete non-adherence to BASIC protocol. It’s a no brainer, the 1988 Radiocarbon dating was deficient, end of story. Moreover Rogers finding of lignin/vanillin in the fibrels is an important ‘clue’ to the Shroud’s real age, yet most will just disregard this evidence or claim Rogers was just wrong…It’s a bad joke.\nThere is at this point in time absolutely ‘nothing’ that refutes this Shroud from being from the first century, (scientifically) speaking, and I strongly believe anyone who argues that point should have their head examined.\nOh and here is another clue to the LACK of protocol or standards in the RCDing done in 1988…Clue word; weight …None of the samples tested met the minimum standard weight required for PROPER TESTING! …I call that FAIL!\nR.\n\n","date":"May 2, 2012 at 4:22 am","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-11054","author":"Ron","site":"shroudstory"},{"title":"New Peer Reviewed Paper on the Carbon Dating of the Shroud of Turin.","post":"Guess you never saw the article, “The Great Holy Shroud Dating Fraud of 1988, by\nD. J. McDonnell\nhttp://www.ewtn.com/library/ISSUES/STURP.TXT\nA new Italian documentary titled “La Notte de la Sindone” or “Night of the Shroud,” was shown at the Shroud Conference in Spain recently and will be out on DVD sometime in September 2012,\nhttps://shroudstory.com/2012/05/04/the-night-of-the-shroud-premiered-in-spain-by-rai-in-valencia/\nBest,\nAngel\n\n","date":"August 24, 2012 at 9:54 pm","url":"https://shroudstory.com/2012/04/28/new-peer-reviewed-paper-on-the-carbon-dating-of-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-15458","author":"Angel","site":"shroudstory"}]
