[{"title":"New Shroud Documentary To Air On Discovery Channel In December","post":"But what about the french scientiest who showed that he made a shroud using  cloth instead of a brush and a cadaver to make the three d impresisons? what about the fact that  jewish customs demanded the body be WASHED before burial so where did the blood come from? would they have actually LEFT the thorn crown in there? what about the thousands of historical innacuracies with the crucifixion? what about the fact the the three othee gospels copied off of mark and mark wrote in allagory and we cant even confirm the writer of the gospels? the gospel documents carbon date to the time of the destruction of the temple, which probably inspired the writer to speak out against rome  and its well known ancient jews DID feel that every suffering they experienced was ebcause they thought they offended God, so this writer was offering them an explaination for the destruction. how about all the coincidental references with the torah scriptures?and let me tell you another FACT: the romans BURNED THE BODIES IN LIME PITS AFTER THE CRUCIFIXION so the bodies wouldn’t spread DISEASE. whoever thisis, the long haired look was probably common at that time.\nthehistory channel has also gone commercial and gotten away from being about history so it can’t be taken too seriously.\n\n","date":"December 15, 2008 at 4:48 am","url":"https://shroudstory.com/2008/12/01/new-shroud-documentary-to-air-on-discovery-channel-in-december/","cat":"carbon_14_dating","id":"comment-226","author":"uncleduke316","site":"shroudstory"},{"title":"New Shroud Documentary To Air On Discovery Channel In December","post":"uncle duke is all over the place. He needs to go back and read the bible. ALL THE PROPHECIES WERE FULFILLED. GOD DOES NOT MAKE MISTAKES. IF HE WANTED US TO KNOW WHAT JESUS LOOKED LIKE THEN WE WOULD KNOW. OH, AND SCIENCE IS WRONG WE DIDN’T COME FROM APES. READ GENESIS, WHERE GOD SAID LET US MAKE MAN IN OUR OWN IMAGE, HE WAS TALKING TO JESUS, NOT ADAM, BECAUSE ADAM WASN’T CREATED AS YET.\nSCIENCE WILL NEVER ERADICATE GOD, HE IS THE CREATOR. BAD THINGS HAPPENS IN OUR LIVES BECAUSE OF OUR OWN MISTAKES WE WERE BORN WITH FREEWILL, BLAME ADAM. THIS IS WHY GOD HAD TO SEND JESUS SO WE DON’T HAVE TO LIVE WITH SIN, NO MATTER WHAT WE HAVE DONE. WE WILL BE FORGIVEN IF WE ASK GOD GOD BLESS YOU\n\n","date":"April 1, 2010 at 12:50 am","url":"https://shroudstory.com/2008/12/01/new-shroud-documentary-to-air-on-discovery-channel-in-december/","cat":"carbon_14_dating","id":"comment-1214","author":"ANGEL","site":"shroudstory"},{"title":"New Shroud Documentary To Air On Discovery Channel In December","post":"I’m allowing your comment although it is really off topic. One can believe in evolution as I do, and still be a Christian and believe in the Resurrection. The Bible is not a science book.\n\n","date":"April 1, 2010 at 1:42 am","url":"https://shroudstory.com/2008/12/01/new-shroud-documentary-to-air-on-discovery-channel-in-december/","cat":"carbon_14_dating","id":"comment-1218","author":"Episcopalian","site":"shroudstory"},{"title":"New Shroud Documentary To Air On Discovery Channel In December","post":"What French scientist? I know Joe Nickell, an American, spent some time attempting to duplicate the 3D effect. He didn’t do a totally bad job. But he copied from the shroud and did not start with real body or even a statue, which isn’t all that difficult. What he was not able to do was reproduce the detail or get the saturation details correct. \nWas Jesus washed. Keep in mind, if you are going to rely on custom, that the burial may not have been complete if indeed Passover was about to begin. And by the way, there are forensic experts such as Fred Zugibe, the head of forensics for Rockland County, NY, who argue that the body indeed might have been washed. Dead bodies, undisturbed, normally don’t bleed. But slight movement can cause blood to flow out of a body. It isn’t cut and dry.\nWould they have left the thorn crown in there. Most shroud researchers see no evidence of this. This hypothesis comes mainly from Alan Whanger. But, yes, they might have left it in there, probably would have. Blood shed in death was considered near sacred and items of clothing and anything else with the blood on it would probably have been buried.\nYour theories about the Gospels have merit and are recognizedd by many scholars. I tend to agree with much of what you say. I don’t think however that John was copied from Mark. Matthew probaby was derived in large measure from Mark or possibly Q, a hypothetical earlier lost source. Luke was also probably sourced from Mark or even Matthew.\nI agree that we cannot confirm the authors. Luke seems to be the real McCoy and Matthew and Mark may be attributions to oral traditions ascribed to them. John may have been John of Patmos or the “beloved disciple” who may or may not have been John.\nAs for one or more of the authors trying to explain the destruction of the Temple, I think the idea has merit. But I think it is a matter of degree and tone and not an attempt at pure allegory or metaphor.\nActually, the fact you mention about lime pits is partly correct. There is no evidence of burning but, yes, crucifixion victims were thrown into shallow pit grave and lime was used to prevent disease. Many of the victims were left on their crosses (and poles in some cases) as carrion for birds and wild dogs. John Dominic Crossan, who until his retirement taught at St Paul University (Catholic) has made a great deal about this and suggested that Jesus may not have been buried. But the Gospels don’t speak about normal circumstances but a premitted exception. Archeological evidence has proven that at least one other individual (known not to be Jesus) was crucified and buried in a tomb with the spike still through his foot. \nYou refer to the coincidental references to the Torah Scriptures (actually the references apply more broadly to Old Testament literature). Many scholars think that indeed those references were not merely coincidental but a literary device known as historizing prophesy. That is quite possible. It does not diminish their significance, in my opinion. \nThanks for your comments.\n\n","date":"December 15, 2008 at 1:09 pm","url":"https://shroudstory.com/2008/12/01/new-shroud-documentary-to-air-on-discovery-channel-in-december/","cat":"carbon_14_dating","id":"comment-227","author":"episcopalian","site":"shroudstory"},{"title":"New Shroud Documentary To Air On Discovery Channel In December","post":"With great sorrow I couldn´t watch Discovery Channel´s documentary « Unwrapping the Shroud » aired last sunday night because portuguese Discovery Channel scheduled other programs and I don´t even know if it will be aired.\nSo ,trying to know people opinion about the subject I read the comments on this blog and I was surprised with so much inaccuracies stated by Mr « uncleducke 316 ».\nWhen he mentions  «the french scientist » I guess it`s about an experience that took place in June 2005 in Paris Natural History Museum sponsored by Cercle Zéthetique ( a kind of atheist society ) in which Paul Eric Blancrue ( he´s not a scientist but an historian and declared atheist who holds a skeptic website against Shroud´s authenticity ) purportedly would produce ( not a shroud ,\nas uncleduke 316 states) a face like the one in Turin Shroud in 5 minutes with all his properties namely 3D encoding.\nTo achieve this task  iron oxide mixed with a gelatin binder was applied over a cloth moulded on a bas relief of Christ´s face inspired on the Shroud of Turin\nObviously the result is quite different from the original, just to mention:\n-The image is not superficial, iron oxide particles go deep in the threads and there is cementation of fibers .\n-It is chemically different ( real Shroud Face results from change in color of a superficial impurity layer composed of starch residues and polysaccharides in topmost thread fibers -there is no cementation and colored fibers are side by side with colorless ones ).\n-That face shows obvious distortion, has sharp boundaries ,and appears quite different from the original .\nMr. uncleduke 316 should visit the website http://www.suaire-science.com and read Dr. Thibault Heimburger´s article on that subject , compare the images and make his own opinion\n-The alleged 3D encoding was debunked by a computer sciences and image software expert- engineer Christophe Mignot who isn´t even a shroud researcher- who after studying that face , «shadow shroud´s face »from Nathan Wilson experiment, and the real Shroud´s Face concluded that only the real one had true 3D encoding\nAs Episcopalian says there is the possibility that the Man of the Shroud was cleaned before entombment by a scanty washing but that doesn´t  preclude remaining blood stains over the body and new blood oozing from the wounds as forensic pathologists like Pierre Barbet , Robert Bucklin and Frederick Zugibe stated .\nIt´s just preposterous to say that  «they left the crown of thorns » .\nIt was not a crown of thorns ,forensic analyses of scalp forehead and back of the head of the Man of the Shroud concludes that the multiple puncture wounds namely injury to forehead arteries and veins were produced by a kind of helmet of thorns that was obviously removed when the body was placed and covered by the Shroud\nIf Mr. uncleduke 316 reads my comment and  honestly thinks to have got reliable information  I´ll be very pleased.\n                                              greetings\n                            Maria da Glória\n\n","date":"December 16, 2008 at 11:28 pm","url":"https://shroudstory.com/2008/12/01/new-shroud-documentary-to-air-on-discovery-channel-in-december/","cat":"carbon_14_dating","id":"comment-228","author":"maria da glória gonçalves barroso","site":"shroudstory"},{"title":"New Shroud Documentary To Air On Discovery Channel In December","post":"great information on your website.  i am excited to take the time to read the everything.\nandrea\n\n","date":"December 17, 2008 at 8:35 pm","url":"https://shroudstory.com/2008/12/01/new-shroud-documentary-to-air-on-discovery-channel-in-december/","cat":"carbon_14_dating","id":"comment-229","author":"Andrea Williams","site":"shroudstory"},{"title":"New Shroud Documentary To Air On Discovery Channel In December","post":"It really doesen’t matter about the carbon dating to prove or disprove if it is an imprint of Jesus. The story of Jesus is based on the Bible and the Bible has proof it is not.  See John 20: verses 6&7…*(6) “went into the sepulchre, and seeth the linen clothes lie, (7) And the napkin, that was about his head, not lying with the linen clothes, but wrapped together in a place by itself.”  Therefore if your belief in Christ is of the Bible and not someone you invented yourself it states that the burial clothes of Christ was in 2 pieces and wrapped not just laid across his body.  Perhaps that verse was put there so we wouldn’t start worshipping a piece of cloth ! *King James Bible\n\n","date":"February 8, 2009 at 12:32 pm","url":"https://shroudstory.com/2008/12/01/new-shroud-documentary-to-air-on-discovery-channel-in-december/","cat":"carbon_14_dating","id":"comment-262","author":"marion","site":"shroudstory"}]
