[{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"Steve, \nThere is on Shroud.com a remarkable chronology prepared by Joe Marino and Edwin Prior that is thoroughly sourced and buries the C-14 tests. Among other things that is a quote from the principal of one of the labs that pioneered AMS C-14 dating that the entire dating process was a “shoddy enterprise.” See http://www.shroud.com/pdfs/chronology.pdf (Entry #12, p. 7) \nIt was a disgrace and lingering in the background is the specter of actual fraud and blatant violations of the scientific protocols both proposed, and adopted, for the C-14  procedure.\nI can not judge the efficacy of Fanti’s work right  now, but before this decade is out, I believe that there is a better than even chance, that even the most biased mind will be confronted with the reality of a First century origin for the Shroud. Unless the individual is a pseud-skeptic indulging in pseudo-science to validate his atheistic beliefs.\nJohn Klotz\nhttp://johnklotz.blodspot.com\n\n","date":"March 29, 2013 at 11:00 am","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28718","author":"John Klotz","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"The scenario being proposed here is so outlandish as to be complete crackers. Pardon me if I leave Stephen E. Jones to his wild conspiracy theories.\n(He also needs to remember that it is living scientists whose name and reputations he defames. Maybe he thinks he is safe from libel laws in Australia. Possibly he is, but I still think his line in character slurs is despicable).\n\n","date":"March 29, 2013 at 12:13 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28722","author":"colinsberry","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"It’s typical that Colinberry would actually post this response and conveniently forget that the people in charge of the 3 tests had violated at least 13 different protocols. Protocols that the STURP team had made a proposal for, but were conveniently ignored by the the people in charge of the tests. Protocols that would have saved all researchers a ton of headache, but thank God that Ray Rogers acted As a true scientist would and followed the evidence where it took him.\nBut then again, we all know how unbiased Colin is and has no dog in this hunt right? ;)\n\n","date":"March 29, 2013 at 1:11 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28726","author":"Bippy123","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"And Colin never defames the reputation of scientists. Nooo. Not one of these C14 scientists in 1988 had the professional courage or scientific acumen to walk away from what was a massive example of pseudoscience. That’s right, Colin, pseudoscience.\n\n","date":"March 29, 2013 at 1:39 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28727","author":"Paulette","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"Many moons ago, I said pretty much the same myself –  that the radiocarbon scientists should have walked away. What we don’t know is the kind of pressures – applied or self-imposed – that might have made them stay and make do with a bad job. \nApplied? It could have been put to them that aborting in a big blaze of publicity risked having the Vatican withdraw its invitation, and the dating might then have never happened. \n Self-imposed? The labs might have lowered their sights and said that their chief interest was in validating their state-of-the-art  methodology, for which they would be happy to test adjacent samples cut from an inconspicuous corner in the interests of statistical homogeneity, and that it was for the Turin custodians or Vatican to decide how many samples to cut out, bearing in mind that each one defaces a precious ‘icon written in blood’ to use Pope Emeritus Benedict’s description, authentic or otherwise.\nIn other words – a ranging shot experiment for starters, instead of a statistically-conclusive answer for the entire Shroud all in one go. Personally. I’d still have walked away, while staying long enough to sample the delights of Turin, one of the few major cities in Italy I have yet to visit.\n I’ve always wanted to drive a Mini down those steps at speed (Michael Caine, “Italian Job”). Italian Job – now there’s an expression to conjure with…\n\n","date":"March 29, 2013 at 2:20 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28732","author":"colinsberry","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"It was Riggi who decided about the cutting of the sample, and together with Gonella, made a big mess. The scientists took what was given to them. Curiously Riggi is said to have been known for “rigorous methodology”, BSTS Newsletter, 67.\n\n","date":"March 29, 2013 at 1:52 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28729","author":"Louis","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"Took what was given to them? They had no knowledge of how improper this sampling was? Not one of them said wait a minute? Scientists?\n\n","date":"March 29, 2013 at 2:02 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28731","author":"Paulette","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"All this had the approval of Cardinal Anastasio Ballestrero, OCD the relic’s papal custodian, who was apparently influenced  by “Carmelite spirituality,” where there are no “material supports.” The prelate — at least then — was just as sceptical about the Shroud’s authenticity as the scientists. It looks like whether just one or seven pieces were cut for the dating would make no difference to them, so they took what was given.\n\n","date":"March 29, 2013 at 2:24 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28733","author":"Louis","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"No one is blaming the people at the c14 labs, I know I certainly am not.\nIt was the people in charge of the c14 protocols that I blame. Sturp should have been in charge of the c14 tests as it showed that their recommendations for testing were the most thorough . Of course Colin wouldn’t agree but then that’s why Sturp has many peer reviewed papers on the shroud and Colin has none.\n\n","date":"March 29, 2013 at 3:02 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28737","author":"Bippy123","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"You’re right, Bippy. I really must get cracking on the peer-reviewed thingy. Firstly, however, I seek your advice. Am I allowed to team up with a journalist, and write a book for the Easter market, ahead of the tiresome business of peer-review? \nSecondly, am I allowed to do a Ray Rogers and launch my own journal (Sindonologica Acta?), one that years down the line will look kindly on the submissions of a long-standing member of its Editorial board? \nWhat do you reckon is my best move, to avoid any suspicion of beating the system? Or should I just stick to reporting my ideas and kitchen-research findings on the internet, doing a passable imitation of popular science blogger?\n\n","date":"March 29, 2013 at 3:32 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28742","author":"colinsberry","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"Does anyone  have a clue as to what happened? You can’t say that you trust the labs and it’s too bad STURP wasn’t involved.  The fact is at a meeting in Trondheim, STURP was proposed to give advice on the sampling area since it had conducted rigorous scientific analysis of the composition of the Shroud. STURP also proposed that the C-14 test be concurrent with new tests to following-up on its 1978 tests. \nIn the end, the C-14 labs objected to anymore tests because the C-14 would determine if they were necessary. STURP was kicked out of the process altogether. The Labs argued that  if the C-14 determined that the Shroud was medieval, then there wouldn’t be a need for further tests. I kid you not. Somebody should have smelled this a long way off but everybody was trusting the integrity of the labs. That was a huge mistake. As they say: “Trust but verify.” There was no verification by independent entities.\nThat was a mistake. The protocols were violated from the very beginning. The selection of samples from only one location chosen by textile “experts” who didn’t know about, or didn’t care about, the scientific findings of STURP that would have eliminated the site chosen because of visualized contamination with quad mosaic photography and several other analytical studies.\nYou can read about it in the chronologies I cited in another post. The chronologies are detailed and sourced. It’s really a remarkable work. https://www.shroud.com/pdfs/chronology.pdf\nJOHN C. KLOTZ\nhttp://johnklotz.blogspot.com\n\n","date":"March 29, 2013 at 4:13 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28747","author":"JOHN kLOTZ","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"I found many factors why STURP was kicked out of the C14 procedures. The desire by the Church and Centro to remove STURP altogether started with the fiasco of Dr. McCrone’s publication and public discourse with fellow STRUP members. This event was followed by an unauthorized announcement by Father Filas’ six generation of copy prints to eliminate “screen frequency noise” on a continuos tone print to prove his hypothesis of the lepton coin………. And, the final collateral damage to STURP was the passing of King Umberto.\n\n","date":"March 29, 2013 at 7:37 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28762","author":"Giorgio","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"Giorgio,\nCan you name any group or individual who contributed more solid scientific data on the Shroud than STURP? McCrone, was like the C-14 Labs, someone who began with an agenda. Ray Rogers and STURP paid a terrible price for not understanding what McCrone was about. He damaged some thier samples and delayed serious blood work with his audacious and ridiculous claims of finding paint. You should really read Heller and Adler about McCrone. It was STURP who proved what a fool McCrone was. He was a one trick pony playing off his “successful” debunking of the Vinland map. Problem was that 15 years later, long after STURP, McCrone was debunked on the Vinland map.\nThe STURP findings were published in peer-reviewed scientific Journals. The only peer-reviewed journal that published the C-14 findings was Nature, and a few years later Nature admitted that the C-14 had NOT closed the issue of the Shroud’s authenticity.\n\n","date":"March 29, 2013 at 9:10 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28772","author":"John Klotz","site":"shroudstory"},{"title":"Of provenance, chain of custody, proper care and suitability of samples","post":"If I’m not mistaken Ray resigned over the McCrone’s fiasco for many years. Yes, McCrone was fixated that it was some type of tempera technique and that an artist painted the Shroud. It’s been a while I read “A Chemical Investgation of the Shroud” by Heller and Adler but what I do recall is they debunked McCrone’s hypothesis. All in all, I think STURP did a wonderful job in their research of providing hypothesis for further studies. However, what is lacking is a chain of custody, proper care and suitability of samples stated in the title of this thread.\n\n","date":"March 29, 2013 at 10:22 pm","url":"https://shroudstory.com/2013/03/29/of-provenance-chain-of-custody-proper-care-and-suitability-of-samples/","cat":"carbon_14_dating","id":"comment-28779","author":"Giorgio","site":"shroudstory"}]
