[{"title":"Okay, we will need to wait several weeks","post":"I look forward to it, but I have to say without real expectation. “Beyond the shadow of any reasonable doubt” is an interesting phrase, especially in the mouth of one already convinced by the “overwhelming” evidence for authenticity. The task will be to convince reasonable doubters that they are wrong, not to confirm the true believers in their faith.\nMy advice will no doubt be worthless in this circumstance, but on behalf of the ‘reasonable doubters’ I feel obliged to offer some.\n1) An opinion is not evidence. (So-and-so declares that the blood is real blood)\n2) Guesswork is not evidence. (The scourge marks match the ends of a Roman flagrum)\n3) A question is not evidence. (Who could have painted such an accurate portrait?)\n4) Incredulity is not evidence. (An artist would never have painted a nude Jesus)\n5) Ignorance is not evidence. (No-one knows how it could have been painted)\nLarry Schauf’s entertaining article in Catholic Answers, featured here a little while ago, postulated the trial of a fictitious thief, whose conviction depended on the Shroud being authentic. I was pretty sure I could get him aquitted. Stephen Jones appears to be collecting evidence for the prosecution of a real person, working for the Arizona Radiocarbon Laboratory, whose conviction also depends on the Shroud being authentic. I’m pretty sure I can get him aquitted too.\n[As a bit of a sideline, Stephen’s “fraud” hypothesis has shifted from a single KGB mastermind hacking into all three computers via the internet to three KGB operatives each working in their own labs. However, only one of these is currently the object of his accusation. I do hope he will look carefully at (and of course accuse one of them) Rupert Housley, Ian Law and Colin Perry, of the University of Oxford and also minor signatories of the 1988 Nature paper. They are all still alive and working, and their email addresses are easy to find…]\n\n","date":"April 16, 2014 at 10:02 am","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","id":"comment-99932","author":"Hugh Farey","site":"shroudstory"},{"title":"Okay, we will need to wait several weeks","post":"I look foward to it, but expect little by way of credence. Credence, by the way, is not Mr. Jones forte, as he obligingly had to rewrite the hypothesis. Is that not a sign that we can’t take him seriously?\nThis hypothesis can be dispelled in myriad ways,.but one can offer some. Namely: \n1) These early networks (including ARPANET) were purpose-built – i.e., they were intended for, and largely restricted to, closed communities of scholars.\nand 2)  The Computer Fraud and Abuse Act and the Electronic Communications Privacy Act, made it a crime to break into computer systems. The radoicarbon group would hardly have stood by.\nOf course, those allegiant to the dating will hardly be impressed. I, Assuredly, will refuse to be taken in until new evidence is adduced.\n\n","date":"April 16, 2014 at 10:33 am","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","id":"comment-99939","author":"David Bowman","site":"shroudstory"},{"title":"Okay, we will need to wait several weeks","post":"I am obviously relieved to note that we have people like Hugh Farey on this website. I highly appreciate your intelligence, objectivity and common sense  Hugh.\n\n","date":"April 17, 2014 at 2:07 pm","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","id":"comment-100366","author":"PHPL","site":"shroudstory"},{"title":"Okay, we will need to wait several weeks","post":"That’s very kind, but I am in good company. daveb, Kelly and several other regular commenters are equally (perhaps more!) worthy of respect.\n\n","date":"April 17, 2014 at 5:50 pm","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","id":"comment-100430","author":"Hugh Farey","site":"shroudstory"},{"title":"Okay, we will need to wait several weeks","post":"\nHugh Farey :\nI look forward to it, but I have to say without real expectation. “Beyond the shadow of any\nreasonable doubt” is an interesting phrase, especially in the mouth of one already convinced by the “overwhelming” evidence for authenticity. The task will be to convince reasonable doubters that they are wrong, not to confirm the true believers in their faith.\nMy advice will no doubt be worthless in this circumstance, but on behalf of the ‘reasonable doubters’ I feel obliged to offer some.\n1) An opinion is not evidence. (So-and-so declares that the blood is real blood)\n2) Guesswork is not evidence. (The scourge marks match the ends of a Roman flagrum)\n3) A question is not evidence. (Who could have painted such an accurate portrait?)\n4) Incredulity is not evidence. (An artist would never have painted a nude Jesus)\n5) Ignorance is not evidence. (No-one knows how it could have been painted)\nLarry Schauf’s entertaining article in Catholic Answers, featured here a little while ago, postulated the trial of a fictitious thief, whose conviction depended on the Shroud being authentic. I was pretty sure I could get him aquitted. Stephen Jones appears to be collecting evidence for the prosecution of a real person, working for the Arizona Radiocarbon Laboratory, whose conviction also depends on the Shroud being authentic. I’m pretty sure I can get him aquitted too.\n[As a bit of a sideline, Stephen’s “fraud” hypothesis has shifted from a single KGB mastermind hacking into all three computers via the internet to three KGB operatives each working in their own labs. However, only one of these is currently the object of his accusation. I do hope he will look carefully at (and of course accuse one of them) Rupert Housley, Ian Law and Colin Perry, of the University of Oxford and also minor signatories of the 1988 Nature paper. They are all still alive and working, and their email addresses are easy to find…]\n\nI, too, am in favor of objectivity and systematic scientific investigation in anything regarding the Shroud and support reasonable doubt, I think it’s healthy.\nHowever, postulate 1 differs from 2-5 in that empirical evidence carries more weight than a mere opinion or guesswork-unlike the others listed below it, there is some scientific data available here, you know-and it is the collective evidence which should be considered.  Both those from chemical studies & immunological studies.  It is unknown if other components might also be present in addition to those characteristic of blood.  It has not been scientifically established if such blood was transferred from a body or applied at some later time, or both.  Unanswered questions, yes, but there’s more to it than the 2-5.\n\n","date":"April 17, 2014 at 2:45 pm","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","id":"comment-100377","author":"Kelly Kearse","site":"shroudstory"},{"title":"Okay, we will need to wait several weeks","post":"As a postscript to my previous comment, if there was a single result included in the context of  all existing data that suggested a blood component (for example, immunoglobulin) were of cow or dog origin, would it more readily be accepted that it’s real blood?  Would many skeptics now change their tune regarding the strength of the previous evidence-that it is, now in fact, characteristic of real blood, as this supports the notion that it was obviously added on.  \nInvestigation of blood components is only part of it, though, the counter question would be if it’s not blood, then what is it?  The possibility of paint and/or pigments was part of the evaluation as well.\n\n","date":"April 17, 2014 at 4:04 pm","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","id":"comment-100398","author":"Kelly Kearse","site":"shroudstory"},{"title":"Okay, we will need to wait several weeks","post":"You’re right, Kelly, but I wanted to guard against a simple “Adler says it’s blood” statement as a piece of evidence in its own right, which some commenters are prone to do. The evidence is firstly what Adler observed: that when exposed to hydrazine vapour and then formic acid vapour the blood fluoresced with red spots indicative of porphyrins, or that microspectrophotography showed a positive Soret absorption, and only secondly the conclusions he drew from his observations, that these (and others) gave “positive presumptive evidence for identification of the alleged blood areas on the shroud of turin as, in fact, containing blood.”\nNot that the fact that there is blood on the Shroud says anything at all about its antiquity.\nAnd of course the ‘counter-question’ is not evidence at all. Questions are not evidence.\n\n","date":"April 17, 2014 at 5:46 pm","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","id":"comment-100427","author":"Hugh Farey","site":"shroudstory"},{"title":"Okay, we will need to wait several weeks","post":"Yes, one has to remember that blood cults featuring real blood were very common especially in Germany from the thirteenth century onwards. I have a whole chapter on them in my ‘Holy Bones’. So Hugh is right to say that the presence of blood, even human blood, on the Shroud says nothing about authenticity in itself as there are other relics or phials of Jesus’s blood ,etc, documented amend they can’t all be authentic.\nThere also remains some doubt that the red on the Shroud is actually blood. Certainly the professor of physiology  I consulted on this said he was not convinced by the articles I sent him. So surely the questions here should be left open until further analysis is done.\n\n","date":"April 18, 2014 at 11:17 am","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","id":"comment-100758","author":"Charles Freeman","site":"shroudstory"},{"title":"Okay, we will need to wait several weeks","post":"\nHugh Farey :\nYou’re right, Kelly, but I wanted to guard against a simple “Adler says it’s blood” statement as a piece of evidence in its own right, which some commenters are prone to do.\nThe evidence is firstly what Adler observed: that when exposed to hydrazine vapour and then formic acid vapour the blood fluoresced with red spots indicative of porphyrins, or that microspectrophotography showed a positive Soret absorption, and only secondly the conclusions he drew from his observations, that these (and others) gave “positive presumptive evidence for identification of the alleged blood areas on the shroud of turin as, in fact, containing blood.”\nNot that the fact that there is blood on the Shroud says anything at all about its antiquity.\nAnd of course the ‘counter-question’ is not evidence at all. Questions are not evidence.\n\nAh, but then this presumptive evidence was extended by further testing-\nAnd yes, questions are not evidence, but experimental data was generated to research this question, that was what I was referring to.\n\n","date":"April 17, 2014 at 6:05 pm","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","id":"comment-100437","author":"Kelly Kearse","site":"shroudstory"},{"title":"Okay, we will need to wait several weeks","post":"Fair enough.\n\n","date":"April 17, 2014 at 6:11 pm","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","id":"comment-100440","author":"Hugh Farey","site":"shroudstory"},{"title":"Okay, we will need to wait several weeks","post":"Charles:\nas there are other relics or phials of Jesus’s blood ,etc, documented amend they can’t all be authentic.\nReally Charles? Have you performed all necessary research on the subject? Calculated all the volume of blood they contain? Checked blood types?\nOr just it is your sceptical dogma that they can’t be all (or any of them) authentic?\n\n","date":"April 18, 2014 at 2:29 pm","url":"https://shroudstory.com/2014/04/16/okay-we-will-need-to-wait-several-weeks/","cat":"carbon_14_dating","id":"comment-100848","author":"O.K.","site":"shroudstory"}]
