[{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"Why are the feet of Christ always cut off in these reproductions of the Pray Manuscript? It would certainly be of interest to see how the feet are drawn.\n\n","date":"May 21, 2012 at 10:42 am","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11493","author":"Jos Verhulst","site":"shroudstory"},{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"Jos, I would think it has to do with the fact on the ‘front’ image of the Shroud and particularly the feet area, it is very faint, almost indiscernable. They (artists) maybe didn’t want to add any conjecture to the images!.Basically just “draw what you see”. The only problem I have with Stephens’ post is that he, along with others, put too much weight on the forehead mark of the upper drawing. Can this actually be discerned as a blood mark, or could it just simply be a smudge?\nI personally discern what seems to be two seperate cloths in the lower picture, one bundled up and extending slightly beyound the Shroud to the Alpha symbol. I still to this day have not heard anyone mention any relevance to this, but it seems clear to me. I also have not had the luxury of viewing other drawings Stephen points to in the book sited, so I could be wrong on my point about the forehead marking.\nR\n\n","date":"May 21, 2012 at 11:40 am","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11497","author":"Ron","site":"shroudstory"},{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"Oh I forgot to add, I’m with Russ Breault on this, “that this illustration with it’s poker holes is like a DNA sample”, proving unequivocally that the Shroud is older then the C14 carbon dating tests would like us to think. Basically nullifying the tests results.\nR\n\n","date":"May 21, 2012 at 11:54 am","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11498","author":"Ron","site":"shroudstory"},{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"The feet are present in Image 4  on this link  presumably post-Resurrection, being  the last one labelled “Christianity” in the series, but are unremarkable. \n What is remarkable are the hands. Why is the nail wound unequivocally on the palm of at least one of the hands if the artist had previously seen the Shroud? Dare I mention also that the artist who is clearly no Da Vinci also seems to like little circles as a decorative feature, though not necessarily L-shaped… ?\n\n","date":"May 21, 2012 at 11:23 am","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11496","author":"colinsberry","site":"shroudstory"},{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"Geez Colin seriously, the picture you linked too is definately not post ressurection, it is Christ on the cross! I don’t see any nail wounds in the palms!!! Where do you see these? Yes this was no De Vinci, but he got his point across. So what about the ‘little circles’ sure they can be decorative in a regular design, but on their own in the middle of the sheet? Colin your just reaching for straws here.\nR\n\n","date":"May 21, 2012 at 4:04 pm","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11503","author":"Ron","site":"shroudstory"},{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"Ignore the Crucifixion picture, Ron. Go to the list underneath the picture headed Illustrations. Then go to No 4 headed ‘Christianity’ for the post-Resurrection picture. Alternatively, click on this link .\nYou’ll find those little circles not just in the tomb scenes (where they are somewhat lost among the ? herring weave) but on the Crucifixion and post-Resurection scenes too. There are other reasons for thinking that the “L-shaped” holes in the tomb picture were not intended to represent “poker holes”, but I seem to recall you did not accept my line of argument on a previous occasion, so i shan’t try to shift you from your view.  If you want to believe that the artist chose to incorporate one particular feature – one hardly likely to have been in Joseph of A’s purchase at the linen merchants – unless from a fire sale –  while omitting so many others – the beard, the scourge marks, the blood etc etc, then that’s fine by me. Folk are free to believe what they want…\nSubmitted at 21:20 UK time. Any delay in appearing is due to my comments here being held back for vetting.\n\n","date":"May 21, 2012 at 4:21 pm","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11504","author":"colinsberry","site":"shroudstory"},{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"Okay sorry the link took me to the first drawing and I assumed that was the one you were talking about. Image 4 does show the wounds in the palms, but in essence it means little has the artist could have misrepresented what he saw on the Shroud since it is quite hard to see where exactly the nail wounds are if your looking at the original “real-life’ image, not a photo of the Shroud or a positive of it.\nYour still grasping at straws Colin ;-)\nR\n\n","date":"May 21, 2012 at 4:36 pm","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11506","author":"Ron","site":"shroudstory"},{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"Yes, Ron, artists are notoriously unobservant of the detail of their subjects…  ;-)\n(You will not have seen my previous comment that would have steered you more quickly in the right direction, since it is still flagged as “awaiting moderation”)\n\n","date":"May 21, 2012 at 4:47 pm","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11507","author":"colinsberry","site":"shroudstory"},{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"Well if you look at figure 4, the artist also left out any nail wounds on the feet. So my one thought that the artist could not discern the feet or where the nails entered the feet, stands. As for the little circles it seems to me he uses them as decorative detail. Usually on clothing, belts etc;.but really without any care. So that is why I along with others believe the 4 holes conspicuously placed in the middle of the shroud and ‘L’ shaped, is depicting the burn holes and not decorative.\nAnyways the lack of lower body detail or accuracy to the Shroud raised another thought/ recollection. These drawings were done approx 10-12 years before the sack of Constantinople, now taking from the discription of the Shroud by the french knight in 1204 being raised in a church and most likely showing the image, but possibly only waist high, as depicted by several artists after the disappearance of the Shroud and called “The man of sorrows”. I think It plausible that’s all this artist had seen and was working from….So he had no idea about the lower extremities of the Shroud image?!\nR\n\n","date":"May 22, 2012 at 5:15 pm","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11547","author":"Ron","site":"shroudstory"},{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"Oh and Colin about why he would show the ‘L’ shaped burn holes over other details, maybe it’s because those burn holes would be the most prominent thing one would see on the Shroud, at that time.\nR\n\n","date":"May 22, 2012 at 5:28 pm","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11548","author":"Ron","site":"shroudstory"},{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"Only Illustration 3 seems to pertain to the Shroud, and I think the comparisons may be limited to: prostrate form on cloth (i.e. not mummy wrapped); crossed hands (but no wounds shown); no thumbs showing; indications of herring bone weave; (Muhawiyah?) poker burn holes; possibly some others(?).  I think we would have to say that the artist has definitely seen the Shroud.  However Colin is right.  Illustration 4, which has the same artistic style as 3 (and therefore likely the same artist), definitely shows the wound in the palm of the left hand, and at the wrist junction on the right hand.  Depending on whether or not the artist appreciated that the original image is a negative reflection, the wound in one of the wrist-hands is covered by the other hand and therefore not visible.  The significance of wrist nailing probably would not occur to the artist, who in 1192-95 may have had only a limited understanding of anatomy.  Illustration 4 also shows the wound in the side, but he could easily have got that from a gospel account, although it is also clear on the Shroud negative.\n\n","date":"May 22, 2012 at 1:47 am","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11531","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Or the artist of the fake knew of the Pray Manuscript and incorporated these signs into his forgery","post":"The circles in the tomb scene, and I could only see four of them set out as an “L”, seem to correspond to the poker holes on the Shroud.  The circles on Illustration 4 seem to be merely decorative are on the seat and on some of the robes.  With his apparent liking for little circles as a motif, why has the artist limited them to only four on the tomb scene – it looks like a deliberate depiction of poker holes to me. \nRon’s posting #2 above mentions a second bundled up cloth – looks like the head cloth mentioned in the gospels.  So it looks like the artist was using the gospel accounts as his main reference, but he had also seen the Shroud.  \nThe script under the picture in Illustration 4, with its series of what appear to be 4 line music staffs studded with dots, seems to be scored for cantors, so presumably the manuscript was intended for liturgical use.\n\n","date":"May 22, 2012 at 4:29 pm","url":"https://shroudstory.com/2012/05/21/or-the-artist-of-the-fake-knew-of-the-pray-manuscript-and-incorporated-these-signs-into-his-forgery/","cat":"carbon_14_dating","id":"comment-11545","author":"daveb of wellington nz","site":"shroudstory"}]
