[{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"It’s an interesting artifact and may well be connected to the Templars, the Mandylion and the crusades. However it is not clear that it is connected to the shroud. In one article (http://www.cirac.org/Abstract.htm), Gazay writes: “The icon of Templar Mandylion has four very particular characteristics of the TS head: the mark ” E ” on the face, some marks of blows on the cheeks, a swollen nose, a bifidus beard.” I’m not sure if he is referring to representations of the Mandylion in general, or to this particular ‘calvary,’ but I do not see any of the characteristics he describes on the accompanying photo.\n\n","date":"February 20, 2013 at 11:59 am","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25052","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"For the 1000 time, I’ll say it again : there are well enough historical, artistic and, even more, physico-chemical evidences to easily understand that the Mandylion hypothesis of Wilson is completely incorrect.  Historians should start to look elsewhere for once in order to find a better hypothesis to explain the Shroud’s obscure years.\nAnd if you don’t believe me (or, most likely, don’t WANT to believe me), I suggest you to read again my paper about the numerous problematic facts regarding this weak hypothesis.  Here’s the link again: https://shroudofturin.files.wordpress.com/2012/06/clc3a9ment_questions-about-the-mandylion-hypothesis-of-wilson_2012-06-28.pdf\nI suggest also anyone’s interested by this hypothesis to read the very clever paper written by Charles Freeman called “The Shroud of Turin and the Image of Edessa: A Misguided Journey”. Here’s the link: http://cybercomputing.com/freeinquiry/skeptic/shroud/articles/freeman_shroud_edessa_misguided_journey/index.htm\nAnd finally, here’s the most important thing you should read that could maybe (and finally) convince you of the impossibility of Ian Wilson’s hypothesis concerning the idea that the Shroud and the Mandylion were one and the same relic:  Please read CAREFULLY AND WITH AN OPEN MIND the quote #64 of my paper entitled “Raymond N. Rogers’ observations and conclusions\nconcerning the body image that is visible on the Shroud of Turin”.  And don’t forget to read also very carefully the personal comment I have add just after the quote from Rogers. Here’s the link for my paper: http://shroudnm.com/docs/2013-01-10-Yannick-Clément-Reflections-on-Ray-Rogers-Shroud-Work.pdf\nI hope this will be sort of an eye-opener for some reader…  The physico-chemical evidence that come from the Shroud is clear :  The face region on the Shroud was never more exposed to light, air, dust and dirt than any other parts of the cloth where we see a body image !  PERIOD.  Sorry to disappoint all the Wilson’s fanatics out there !  I say this with a big smile on my face because I truly expect to be unable (once again) to change anyone’s mind…  It’s been a while now since I have stop believing I could do so here on this blog.  Anyway, I thought it was important to emphasize the observations made by Rogers and Adler that are truly relevant to the subject of the Mandylion hypothesis of Wilson.\n\n","date":"February 20, 2013 at 4:38 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25073","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"Please read carefully and with an open-mind the quote #63 of my paper entitled “Raymond N. Rogers’ observations and conclusions concerning the body image that is visible on the Shroud of Turin”, along with the personal comment I have added right after.  You can read it with this link: http://shroudnm.com/docs/2013-01-10-Yannick-Clément-Reflections-on-Ray-Rogers-Shroud-Work.pdf\nAfter reading this part of my paper that emphasize some very strong physico-chemical evidences against Wilson’s hypothesis, I hope some of you will start to understand that such an hypothesis is most certainly incorrect (with a 99.9% level of confidence) !!!  The face region on the Shroud has never been more exposed to light, air, dust and dirt than any other parts of the cloth where we see a body image and that’s the PHYSICO-CHEMICAL REALITY.  Sorry, but that doesn’t leave too much space for an error of judgment…  Wilson’s hypothesis must be regarded as incorrect.  Completely incorrect.  Historians must start to look elsewhere if they really wants to find a proper explanation for the Shroud’s missing years.\n\n","date":"February 20, 2013 at 5:38 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25080","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"Forget this second comment of mine which is almost the same as the first one.  This is due to a problem with my Explorer page.\n\n","date":"February 20, 2013 at 5:39 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25081","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"A dogmatic assertion which neither Yannick Clement, nor Byzantine Art historians, and not even Ian Wilson can make one way or the other.  They are all entitled to their views, but they may have been the same object, or else they may not have been.  Some one thousand years later, it cannot be known one way or the other.  Theories and speculations may be offered or criticised, but they can neither be asserted nor denied as indisputable facts one way or the other!  Both possibilities remain open!\n\n","date":"February 20, 2013 at 5:54 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25084","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"Paper and link can be found at: “Relations of a Breton Calvary with the Shroud and the Templar Knights” by Francois Gazay (France), DEST electronic and computer engineer, expert on image processing and scientific writer;  2005 Dallas Symposium, http://www.cirac.org/Mandylion.pdf   \nGazay interprets the date on the sculpture as 1304.  I have yet to read the paper in detail, but already some comments occur to me.  \nGazay makes the assumption that Shroud & Mandylion were one and the same object, thus following the Ian Wilson theory, which is commonly challenged by Byzantine Art historians and others.  It is curious that the Calvary has the likeness of the Mandylion presentation in a frame showing landscape aspect.  If they were the same object, then in 1304, already the Mandylion would have been taken out of its frame, and be then recognised as the Shroud.  It is unlikely that it would then be reinstated in its frame.  If so this would have happened well before 1204, when the Shroud was then known (Patriarch of Constantiople’s complaint to Pope on crusaders’ despoliation).  Alternatively they were in fact two separate objects – possibly the Mandylion was a copy of the face on the Shroud, hence the alleged likeness.  \nDaniel Scavone has maintained the view that the Knights Templar worship of a head was a fabrication by the inquisitors who had previously  levelled the same charge against the Cathars.  Any Templar admissions of the head were generally made by lowly ranked knights who would not have been privy to the secrets of the inner circle.  It is therefore not conclusive that the Templars did in fact worship a head.\nHowever some Templars may have known about the Shroud, particularly if they had some links or association with the families of Othon de la Roche or the de Charnays, notwithstanding that Breton is on the west of France and Lirey / Bensancon are in the east.  The Templars would still be active in 1304, as the first arrests under Philip the Fair did not occur until 1307, Jaques de Molay being burnt at the stake in 1314.\nWhen I first saw the article, I immediately thought of the keramion, the clay tile said to be found with the Mandylion in Edessa about 525 AD.  Does anyone know what the keramion looked like, or what happened to it? Did it look anything like the Shroud face, and could the Calvary have been modeled on the keramion?\n\n","date":"February 20, 2013 at 5:39 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25082","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"This is a “Veronica”, not a copy of the Turin Shroud. Compare with this photo of another Calvary in Brittany. It is the magnificent Calvary of Notre-Dame de Tronoën:\n\n(The photos in this website can be enlarged up to high resolution.) At the basis of the left pillar there is a Saint Veronica with her veil. Here is a detail of the Veronica:\n\nThis Calvary is dated at 1456-1460. At this date, the representations of the Veronica had already long been frequent and widespread in Europe.\n\n","date":"February 20, 2013 at 6:10 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25085","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"The only snag is the Breton calvary of the “Park ar Groaz ru” is only dated… 1544 CE.\n\n","date":"February 20, 2013 at 8:53 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25094","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"The detail in the Notre-Dame de Tronoen mentioned by Gian, shows a woman holding up an imprinted veil, and it seems clear enough that this is certainly meant to be a representation of “Saint Veronica”.  In the Breton Calvary described by Francois Gazay, the figure appears to be cherub-like (a head with wings), which Gazay says implies that this veil was not made by human-hands.  Gazay also claims to identify certain Shroud-like facial features in the 1304 Breton Calvary.  These are probably not so apparent in the Tronoen case. \nThe story of the Veronica begins with the 2nd-century so-called proto-“Acts of Pilate” which the early church Fathers knew about, but these Acts were redacted and added to over the next 150 years or so, and the legend of Veronica grew and developed with the redactions accordingly. \nA few factors incline me to some skepticism about the story of the Veronica, along with the Mandylion.  We may acknowledge that there is some kernel of truth behind all such legends, but much of the time we can never know for certain what that kernel is.  Even allowing for Jewish aversion to images (and remember Luke was not a Jew), is it not surprising that in spite of having at least three such tales of Christ creating an image of himself, not one of them is mentioned in any of the gospels (not even Luke).  We have the Doctrine of Addai (Abgar legend) the Veronica, and the image we know on the Shroud.  Early portraits of Christ show him as a beardless Adonis, and St Augustine had no idea of what he looked like, despite three possible putative genuine portraits.  \nI suspect that both the tales of the Veronica and the Mandylion were the result of a type of “Chinese Whispers” emanating from rumours concerning the Shroud image, which only a select few knew about.  At some time the Shroud image was copied – perhaps its identity as a burial cloth was concealed as postulated by Wilson.  As these copies spread, perhaps the Veronica and Mandylion legends became associated with a few of the superior copies.  This would account for the common likenesses in the various reproductions, assertions of three distinct image creations, while allowing separate identities for the three objects.  \nI merely offer this as an interesting speculation, which I think has more credibility than other attempts at explanations.\n\n","date":"February 21, 2013 at 3:17 am","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25110","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"The most important thing to note concerning my comment of yesterday (and it’s very important!), it is the FACT that Rogers and Adler, while making their analyses on fibers samples of the Shroud, NEVER had the intention to back-up or discard the hypothesis of Ian Wilson regarding the Mandylion.  To me, this constitute a sure proof that there really is no bias for or against Wilson’s hypothesis in their results, which CLEARLY show that there is absolutely no particular part of the Shroud that has been more exposed than the others to light, air, dust and dirt. Effectively, Rogers and Adler were very clear about the FACT that there are no signs of a more intense natural oxidation of the linen fibers in one specific part of the cloth versus the rest of it, which, in itself, completely contradict the Mandylion hypothesis. \nEvery time there is a new historical research published on the subject of the Mandylion hypothesis, whether it is for or against it, there is ALWAYS a danger of bias (conscious or not) on the part of the author of the study. NODOBY CAN’T SAY THIS CONCERNING THE PHYSICO-CHEMICAL RESULTS OBTAINED BY ROGERS AND ADLER ! That’s why, to me, this physico-chemical evidence is much more credible and important than any historical study that has ever been published about the Mandylion hypothesis in order to judge if this hypothesis has some chances to be correct or not. And sadly for the partisans of Wilson’s hypothesis (who are ALL pro-Shroud fanatics at the same time… Funny!), what Rogers and Adler told us about the physico-chemical REALITY (this didn’t left a door open for any wild assumptions) is enough clear to understand that the face region of the Shroud HAS NEVER BEEN more exposed to light, air, dust and dirt than the rest of the cloth, which is exactly what would have happened for many centuries if Wilson’s hypothesis was correct.  \nTherefore, there is no other possible and credible conclusion to draw that this one: historians MUST look elsewhere in order to find a better explanation for the Shroud’s missing years, which can well be, in fact, simply due to a very long hiding of the relic during most of the time prior to the most probable public exhibition of it every Friday in the Blacherne Chapel in Constantinople before the sack of the city in April 1204. Note that this is exactly what Emmanuel Poule, a very good Shroud historian, was thinking in the face of the great lack of documentary evidence of a Shroud of Christ with a body image and bloodstains on it prior to 1204 and the testimony of Robert de Clari.  I agree that this is surely to most rational hypothesis that can be made right now and the gruesome aspect of the relic is most probably the great responsible for this very long hiding from the eyes of the public.\nIn conclusion, the most important thing to note is the FACT that Rogers and Adler’s findings regarding the physico-chemical homogeneity of the whole Shroud were made without any pro or anti-Wilson bias and, clearly, these results show that the face region of the Shroud was never more exposed to light, air, dust and dirt than any other parts of the cloth. I think the outcome of these findings is pretty evident regarding Wilson’s hypothesis! And here’s a final message to all the fanatics of Wilson out there: if you don’t like this reflection of mine, blame it on Rogers and Adler! I’m sorry for you but I simply followed the road they traced with their solid observations… Effectively, if we accept the results of their analyses as being professional, honest and scientifically sound, then there’s just one acceptable conclusion to draw: on the base of the physical and chemical observations they made, the Mandylion hypothesis of Wilson simply CANNOT be true! PERIOD.\n\n","date":"February 21, 2013 at 9:26 am","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25149","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"This is stale news again and the problem is that Gazay does not seem to be available for contact.\n\n","date":"February 21, 2013 at 9:31 am","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25151","author":"Louis","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"It might be stale news for Louis, but it was new news to me.  A check on the 2005 Dallas symposium summary on shround.com web-site summary didn’t seem to list Gazay’s paper for some reason, I had to Google for it.  Gazay’s web-site is given in his paper as: http://www.cirac.org/CV-FG.htm which I raised.  He was born in 1937, so if he’s still alive he’s now about 76.  His email is given as   .  Web-site has link to his assistant ‘Jennifer’, but language needs to be English.  Address in Europe: 78350 Les Loges en Josas (Paris area), France\nAddress in USA: 33137 Miami, Florida.  Hope that helps!\n\n","date":"February 21, 2013 at 3:41 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25189","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"Gazay’s email address in mine above didn’t copy for some reason.  Second try: frgazay@cirac.org .  Else contact Jennifer from web-site link.\n\n","date":"February 21, 2013 at 3:44 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25190","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"I should like occasionally to mention the author Ian Wilson’s name without being over-swamped by a case of verbal diarrhoea resulting from YC’s paranoia against the man.  \nYC: “Every time there is a new historical research published on the subject of the Mandylion hypothesis, whether it is for or against it, there is ALWAYS a danger of bias (conscious or not) on the part of the author of the study.” \nHe should consder taking his own advice, and get over it!\n\n","date":"February 21, 2013 at 3:54 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25192","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"I already did take my own advice Dave and that’s why I prefer to base my judgment on the physico-chemical evidences coming from the Shroud that were published by experts like Rogers and Adler instead of focusing on some wild assumptions published over the years by Wilson, Scavone, Markwardt and company that were mainly based on some far-from-being precise descriptions of the Mandylion! ;-)\nOn the contrary to the historical research, which is far from being a precise science, the physico-chemical data coming from the Shroud are very solid and very clear about the FACT that the face region of the cloth has never been more exposed to light, air, dust and dirt than any other part of the relic during the course of his long history and, alone, this important FACT is enough for me (as it should be for you too) to completely reject Wilson’s hypothesis because it leaves no room for wild assumptions and speculations, which is the favorite sport of Wilson and many others Shroud historians.\n\n","date":"February 21, 2013 at 4:27 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25196","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"FACT:  Whatever the original of the Mandylion might have been, whenever it wasn’t walled up in Antioch or Edessa, it was usually kept secure in one type of reliquary or another, hidden from the light and public view, only occasionally revealed to special visitors inside the interior room of a royal palace (probably without chandeliers), seldom exhibited for public veneration and then only inside the dim light of a cathedral, entirely consistent with Eastern secrecy concerning especially sacred objects.  It was never a picture on a wall or a tourist attraction for the general gaze, as has occurred with the Shroud at Lirey and Turin.  The apparent uniformity of the Shroud’s exposure to light, to the extent that it can be accurately ascertained, may not be nearly as significant as you imagine.\n\n","date":"February 21, 2013 at 5:47 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25203","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"Dave, please read my newest comment here: https://shroudstory.com/2013/02/22/david-rolfe-we-need-you/#comment-25289\nI answer the weak argument you mention.  Don’t worry, I’m well aware of it and once someone really start reflecting seriously about it, it become obvious that this cannot explain properly the homogeneity of the fabric in the light of the Mandylion hypothesis of Wilson.  Sorry but we know for a fact that the Mandylion was shown many times during its known history and the “Narratio de Imagine Edessena” even say that it was publicly displayed once every year after his arrival in Constantinople in 944, which is much more than the Shroud since the fire of 1532!  Also, you have to consider the obvious fact that there was no reliquary that was completely hermetic during that time! It’s evident that air and dust was able to affect the linen fibers of that cloth, particularly the exposed side, which show the face of the living Christ with no bloodstains or injuries…\n\n","date":"February 22, 2013 at 4:39 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25322","author":"Yannick Clément","site":"shroudstory"},{"title":"Paper Chase and Historical C14 Challenge: Relations of a Breton Calvary with the Shroud and the Templar Knights","post":"Thanks for the tip, David. It is useful because the link has been brought up to date. Around seven years ago attempts were made to contact François Gazay with the help of Serge Mouraviev but there was no success. This lead has been lying dormant for quite a while, so perhaps fellow Shroudies in France can help?\n\n","date":"February 21, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/02/20/paper-chase-and-historical-c14-challenge-relations-of-a-breton-calvary-with-the-shroud-and-the-templar-knights/","cat":"carbon_14_dating","id":"comment-25206","author":"Louis","site":"shroudstory"}]
