[{"title":"Paper Chase:  Mark Antonacci’s Hypothesis","post":"Careful reading – check.\nComment – oh, dear; I wish you hadn’t asked. We begin with 32 unique or unusual features. Unique compared to what, I ask myself? In what way is a lack of foreign materials or particulates unique? Or a non-diffuse image with sharp boundaries? Or a reduction of the cloth’s fluorescence? We are not told. Some of the 32 are generally thought of as descriptions of the image on the shroud, some are highly contentious, and some are literally meaningless (e.g. the shroud lacks two dimensional directionality). We are then told that all these features can only be explained by some form of collimated radiation.\nFrom this inauspicious beginning we are taken through an increasingly speculative discussion which, as it depends entirely on the shroud falling through a suddenly dematerialised body, is literally untestable. In spite of being told 48 times what “would” have happened, no evidence at all can be adduced to suggest that any of it actually did happen.\nAgain, much of the discussion makes no scientific sense. It is supposed that the body disintegrates in a burst of radiation, and the cloth then falls vertically through it. Before it starts to drop, the initial radiation affects the cloth in direct proportion to the distance of the cloth from the body. This relies on two assumptions that are not considered – firstly that the same amount of radiation is emitted from all parts of the body, and secondly that it travels vertically from the body. No justification for this is offered at all. Be that as it may, what happens next? We are told that the shroud begins to fall vertically through the body cavity. We are not told what the surrounding air would do. Does it rush into the cavity created by the suddenly disintegrated body, swooshing the cloth with it? If not, why not? Well never mind, let’s suppose the shroud falls uniformly downwards. After a very short time those parts that were in direct contact with the body are now within the body cavity, while those parts that were not are still falling through the air separating them from it. At that point, what is the difference between the radiation affecting the area still in the air, and the radiation affecting the part within the cavity? Does it make any sense to speculate? Well never mind, let’s keep going. Radiation consists of particles or energy going from somewhere to somewhere else. It does not consist of a vacuum “containing a small amount of some basic particles of matter such as protons, neutrons and perhaps electrons and gamma rays.” We must surely suppose that all these particles are moving fantastically fast. In which direction are they going? Surely they are shooting outwards from where they come from in all directions. In which case they will destroy the collimation we were hoping to achieve by the shroud dropping vertically through them.\nAnd so it goes. In the most literal scientific way, this description is non-sense from beginning to end. Sorry, but you did ask…\n\n","date":"September 18, 2013 at 7:20 pm","url":"https://shroudstory.com/2013/09/18/paper-chase-mark-antonaccis-hypothesis/","cat":"carbon_14_dating","id":"comment-44649","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  Mark Antonacci’s Hypothesis","post":"Antonacci’s paper may have been taken in by this Nigerian online-only outfit but no way no how was it peer reviewed by a scientist. Now I have some money I want to transfer to you.\n\n","date":"September 20, 2013 at 5:34 am","url":"https://shroudstory.com/2013/09/18/paper-chase-mark-antonaccis-hypothesis/","cat":"carbon_14_dating","id":"comment-44816","author":"Paulette","site":"shroudstory"}]
