[{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"How much taller can this house of cards get before … ?\n\n","date":"May 16, 2013 at 7:21 am","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33756","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"That’s a really well thought out answer there, Colins.\n\n","date":"May 16, 2013 at 7:41 am","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33759","author":"Paulette","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"Thank you. I was briefly toying with the idea of employing a different metaphor, one about this corner of cyberspace filling up rapidly with Bertrand Russell’s china teapots, but you have confirmed  that I made the right choice …  \nBottom line: don’t waste time on other people’s dud hypotheses when they have lack either the will or means to test them.  (But don’t deprive them of their fantasies either – just give a condescending nod and smile, and then move on).\n\n","date":"May 16, 2013 at 8:24 am","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33761","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"On the whole I think that the careless way the shroud was treated throughout most of its documented history militates against any great care being taken of it, even by Margaret of Austria. Even in the 19th or early 20th century it was crudely thumb-tacked to a frame. However, since then, it has enjoyed global prominence and detailed photographic inquiry. It occurs to me that the most probable date for secret invisible mending is in fact well into the 20th century, most probably in order to maintain the integrity of a fragile cloth. A corollary and a question immediately arise. The corollary is that much less new thread would be needed to alter the carbon dates appropriately, and therefore any interweaving would be that much less conspicuous, and the question is – is there any evidence to suggest the age of the supposedly interpolated material? Why has it always been supposed to be 16th century or earlier?\n\n","date":"May 16, 2013 at 9:29 am","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33765","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"If you’re right about 20th century contamination, Hugh, it would presumably take only a thread or two with close-to-current C-14 levels to produce an erroneous 1260 to 1390 dating for 1st century linen. So those rogue threads would have to remain in the sample that was taken for radiocarbon analysis, right, and not diverted to other purposes, like, er, being used 17 years later by a dying man to undermine confidence in the radiocarbon dating? \nIsn’t there a problem there? Those rogue threads might well be the very ones that Rogers was covertly provided with, courtesy of Gonella, allowing him to meticulously document all those alleged anomalies that he was at such pains to point out in his 2005 paper.\nQuote from Rogers:\n“On 12 December 2003, I received samples of both warp and weft threads that Prof. Luigi Gonella had taken from the radiocarbon sample before it was distributed for dating. Gonella reported that he excised the threads from the center of the radiocarbon sample.”\nToo many cooks, far too many cooks, and too much fancy footwork, then as now …\nAll it takes is a few more mg of linen from equally inconspicuous locations on the Shroud to stop this nonsense once and for all. Or do some have a vested interest in maintaining the present muddied water status quo  namely a “discredited” radiocarbon dating, such that the host of this site can confidently aver in his margin notes that “the carbon dating, once seemingly proving it was a medieval fake, is now widely thought of as suspect and meaningless”. \nNo, some might think it is the house-of-cards arguments that are raised against the dating that are suspect and meaningless…\n\n","date":"May 16, 2013 at 10:24 am","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33773","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"So up until the 2005 paper Rogers shows no dog in this fight. He stands by the science. He even expects to debunk the invisible weave theory. To everyone’s surprise, including his own, Rogers agrees with the theory based on his scientific findings. Who got to him, Colin? The Illuminati? God? The Mafia? Maybe it wasn’t cancer that killed him…hmmm.\n\n","date":"May 16, 2013 at 11:38 am","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33779","author":"David Goulet","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"\nDavid Goulet :\nSo up until the 2005 paper Rogers shows no dog in this fight. He stands by the science. He even expects to debunk the invisible weave theory. To everyone’s surprise, including his own, Rogers agrees with the theory based on his scientific findings. Who got to him, Colin? The Illuminati? God? The Mafia? Maybe it wasn’t cancer that killed him…hmmm.\n\n“Shows no dog in this fight” is an expression I have not before. But if it means non-partisan in a scientific sense, then that is only partly true, and maybe untrue. \nWhile it is apparent that Rogers rejected a “miraculous flash of light” explanation for the Shroud image, he substituted his own naturalistic explanation based on that Maillard hypothesis which presupposed a 1st century AD scenario for what happens when a deceased man is placed in a burial shroud. His seriously flawed vanillin-dating idea  (there being no chemical clock comparable to radionuclide decay) was intended to have us accept a dating much earlier then a medieval one. So Rogers was essentially an ‘authenticist’, at least when he started to publish work based on his STURP-acquired samples. The idea that he remained totally objective in a scientific sense is, sad to say,  wishful thinking, as shown by the use he made of a few threads of dubious history and/or origin in 2005 in an attempt to demolish the 1988 radiocarbon dating. That paper ought never to have been accepted for publication in a peer-reviewed journal (but then it was ‘his’ journal in a manner of speaking).\n“Who got to him”? Peer pressure probably, if the truth be told. He was a member of STURP, after all. Nobody likes to find themselves in a minority of one. How many members of STURP accepted the C-14 dating as the definitive answer on authenticity,  and didn’t immediately try to move physical, and/or chemical heaven and earth to debunk it?  (And when all else fails, cite “overwhelming” historical evidence instead, like, you know, those few pen and ink sketches in an obscure Hungarian codex that “unequivocally” show those “poker holes”).\n\n","date":"May 16, 2013 at 12:07 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33782","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"So if I buy into your narrative, Rogers was looking for a way to discredit the C-14 dating all along (perhaps to safeguard his potential legacy/work with Maillard reactions or perhaps bowing to peer pressure). Desperate to achieve this before he passed away, he compromised his scientific principles, as well as his personal integrity, by accepting evidence he knew was inadmissible and giving authentists the ‘published’ results they had already set-up in advance.\nIs there a scientist(s) involved with Shroud research you do find above reproach?\n\n","date":"May 16, 2013 at 1:09 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33788","author":"David Goulet","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"“Is there a scientist(s) involved with Shroud research you do find above reproach?”\nNot many in Shroudology, I have to say. In fact, I’m racking my brains right now to think of a single Shroud researcher whom I would regard as totally dispassionate, totally objective. But then, who finances Shroud research, unless there is some probably non-articulated but desired outcome that the researcher is supposed to divine and respond to sympathetically?\nOne has to ask what attracts researchers to Shroud research in the first place. An opportunity to bask in a little media limelight after a dull, but otherwise worthy career? I mean to say, if you were a competent but otherwise obscure porphyrin chemist, wouldn’t you get a buzz from having Barrie Schwortz tramp his world-wide lecture circuit, hyping you up as one of the worlds “foremost blood experts”?\n\n","date":"May 16, 2013 at 1:35 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33791","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"“Not many in Shroudology,” – does this include the C-14 labs, or are they exempt?\n\n","date":"May 16, 2013 at 3:16 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33796","author":"looneytombs","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"As far as I’m aware, the C-14 labs did what was asked of them. They dated the samples of linen that the Turin custodians and Holy See deemed could be sacrificed. The rest is just shroudological pique and backbiting. You will see little or no genuine effort on the part of the authenticists to have the dating repeated on extra sampling sites.  Why not? I for one would  be happy to see it repeated, as I’m sure would the radiocarbon labs.That’s why I have no hesitation in declaring the latter “exempt”.\n\n","date":"May 16, 2013 at 4:20 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33800","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"Denials notwithstanding, yet again we see criticisms of persons involved in so-called “Shroudology” without addressing the issues raised. \nI personally considered the Benford-Marino paper well-researched and adequately documented, but with only one matter that I could take issue with. I also note that Mme Flury-Lemburg still appears to be in denial over the possibility of “reweaving”, despite the fact that Michael Ehrlich routinely carries out such invisible reweaving at the present time (or at any rate in 2005 when the paper was written). Flury-Lemburg’s understanding of such reweaving is that it would be evident on the backside of the cloth, whereas Ehrlich’s more painstaking process does not. I also note the Preface comment: \n“This paper was peer-reviewed by two scholarly history journals, Viator and the Journal of Medieval History. Neither journal suggested any major or substantive corrections. The minor amendments suggested by the peer reviewers were included in the final version of this paper.”\nThe matter I have a problem with is due to an attributed comment by the custodian’s scientific advisor Prof Piero Savarino: “In the 1998 booklet, he stated that the 1988 C-14 testing might have been erroneous due to “extraneous thread left over from ‘invisible mending’ routinely carried out in the past on parts of the cloth in poor repair” (Savarino and Barberis, 1998: 21).” This clearly suggests that there are other areas of patching on the Shroud which may be either known or unknown.\nA fairly recent comment by Thibault Heimburger stated that no cotton was found anywhere else on the Shroud, only the area from which the C-14 samples were taken. I can only conclude if the two separate comments by both Savarino and Heimburger are both correct, that it was mere chance that the C-14 sample included a cotton thread (although there was also said to be gum arabic and other clues) and the more usual procedure in such work would be to remove such extraneous cotton thread on its completion. It is strangely coincidental that the one area of the cloth which was used for the C-14 testing was also the only area that included remnant cotton.\n\n","date":"May 16, 2013 at 5:06 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33804","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"Does Savarino’s comment support my idea that the reweaving was more likely to be 20th century than any other?\n\n","date":"May 16, 2013 at 7:44 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33826","author":"Hugh Farey","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"Scientists in the pro-authenticity camp have openly requested that samples be taken from extra sampling sites. Now whether that is worthwhile is controversial because carbon dating simply does not have the infallibility imparted to it. There are Shroud books with a more balanced approach where issues relating to carbon dating are clearly explained.\n\n","date":"May 16, 2013 at 6:36 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33811","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"I submit while Colin may be a fine Scientist, he knows nothing of relics and believer’s care for them.  I find his statement you included to lack that connection.  That is ignoring the physical evidence Rogers proved from the remainder of the samples & in his paper.\n\n","date":"May 16, 2013 at 7:02 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33817","author":"Andy Weiss","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"Personal attacks do not help further the cause of the Shroud or pro-authenticity Shroudies. Much on the contrary, it is probably one of the causes why both Rome and Turin have sort of distanced themselves from the realm of studies, ignoring all the pleas. Does it have to be repeated again and again that the message sent by Benedict XVI to the last Dallas Conference also had also something to do with this? It is foolish to think that this blog is not being monitored.Rogers presented a viable hypothesis, which should be taken seriously, but it is one among many hypotheses and nothing has been “proved” so far.\n\n","date":"May 16, 2013 at 7:50 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33827","author":"Louis","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"\nAndy Weiss :\nI submit while Colin may be a fine Scientist,.\n\nIf one looks at his postings one would certainly doubt it. Especially if one knows the scientists and science not just from bragging  in the internet :LOL:\nA man clearly has a psychosocial deficiency and compensates it by verbal pirouettes of strange resentment. Which causes are not that hard to decipher, though :-)\n\n","date":"May 16, 2013 at 8:18 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33833","author":"jesterof","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"Don’t feed the trolls.\n\n","date":"May 17, 2013 at 1:40 am","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33848","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"Relax Giorgio.The comment was not addressed to you.\n\n","date":"May 17, 2013 at 9:28 am","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33868","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"I now know who “jesterof” is, thanks to a little carelessness on her part with choosing an email address. Yes, she is medically qualified, as stated earlier. All the more reason I would say for not indulging in amateur psychiatry on a public forum. \nI shall continue to regard her as a troll, and avoid this site, until I receive an apology and assurance she will desist in future from making troll-like personal attacks.\n\n","date":"May 21, 2013 at 1:41 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-34222","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"CSB: “Don’t feed the trolls.”  It’s not new! Compare the following: \n– Discipline of the Secret in early Christianity – ‘Disciplina Arcani’ Protestant theologian, Jean Daille, 1666;\n– “give not that which is holy unto the dogs, neither cast ye your pearls before swine, lest they trample them under their feet, and turn again and rend you” Matthew 7:6 (the Sermon on the Mount);\n– Paul’s counsel that ‘the “uninitiated and dull of hearing” be fed with milk, and not with meat’; I Corinthians 3:1-2. In accord, Hebrews 5:12-14.\nReferenced in “ANCIENT EDESSA AND THE SHROUD: HISTORY CONCEALED BY THE DISCIPLINE OF THE SECRET” By Jack Markwardt 2008,\nhttp://ohioshroudconference.com/papers/p02.pdf\n\n","date":"May 17, 2013 at 4:58 am","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33856","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Paper Chase:  Nobody Goes to the Trouble. Oh, Yes They Might.","post":"the self-proclaimed scientific trolling himself is preying for the feed.\nor attacking ad hominem the deceased scientists  is not trolling?\noh, I beg your pardon, it is “scientific discussion” :LOL:\n\n","date":"May 17, 2013 at 1:16 pm","url":"https://shroudstory.com/2013/05/16/paper-chase-nobody-goes-to-the-trouble-oh-yes-they-might/","cat":"carbon_14_dating","id":"comment-33882","author":"jesterof","site":"shroudstory"}]
