[{"title":"Paper Chase: The Turin Shroud by Jonathan Allday","post":"Here’s a link to the guy and his achievements.\nhttp://www.linkedin.com/pub/jonathan-allday/51/a49/210\nHe co-authored a book on A-Level Physics (preparation for UK university entrance)  in 2001 and currently holds a senior ICT position in an English secondary school. Maybe Hugh Farey knows him, or knows of him. \n“Physics Education” is a journal for physics teachers, especially ones who retain an interest in research and seek a forum for reporting their own and their students’ projects.\nSome say you never really understand your own subject until you have to teach it. I’d concur (broadly) with that.\n\n","date":"October 29, 2013 at 4:33 am","url":"https://shroudstory.com/2013/10/29/paper-chase-the-turin-shroud-by-jonathan-allday/","cat":"carbon_14_dating","id":"comment-49073","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: The Turin Shroud by Jonathan Allday","post":"PS: Here’s a link to the home page of ‘Physics Education’.\nhttp://iopscience.iop.org/0031-9120/\n\n","date":"October 29, 2013 at 4:51 am","url":"https://shroudstory.com/2013/10/29/paper-chase-the-turin-shroud-by-jonathan-allday/","cat":"carbon_14_dating","id":"comment-49075","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: The Turin Shroud by Jonathan Allday","post":"I hope Steve follows this. I’d like hear (read) how deeply he goes into the issue of sample selection.\n\n","date":"October 29, 2013 at 5:12 am","url":"https://shroudstory.com/2013/10/29/paper-chase-the-turin-shroud-by-jonathan-allday/","cat":"carbon_14_dating","id":"comment-49078","author":"John Klotz","site":"shroudstory"},{"title":"Paper Chase: The Turin Shroud by Jonathan Allday","post":"I don’t know Jonathan Allday, but a quote from his article turned up on the randi forum a while ago.\n“There have been few opportunities for the scientific investigation of the Shroud, and those that have taken place have generally posed as many questions as answers. However, one piece of research seems to have closed the issue of its authenticity conclusively. In 1988 the results of radiocarbon dating of fibres from the Shroud were announced, seemingly pinning the origin of the cloth to between 1260 and 1390. Place this information alongside other pieces of evidence, such as a memorandum to the Pope from Bishop d’Arcis of Troyes c. 1389 in which he claimed to be aware of the artist who had faked the Shroud and that it was ‘cunningly painted, the truth being attested by the artist who had painted it, to wit, that it was a work of human skill and not miraculously wrought or bestowed’, and the argument for the Shroud being a fake is quite convincingly made. …\nOne might have thought that straightforward physical analysis of the cloth would be sufficient to distinguish between a painting and an image produced in some manner by physical contact with a body. Unfortunately, almost every single point made by a scientist, with an established reputation in a relevant field, concerning the image on the Shroud has been contested by an equally reputable scientist with a different point of view. The fact that scientists disagree, and often disagree vehemently, should be a matter brought to the attention of students of all ages. …\nThere have been many attempts to simulate the image on the Turin Shroud, including a painting being impressed onto a cloth in a manner similar to a brass rubbing. A judgment of success can only be subjective, but to date no reproduction has been able to produce the 3D nature of the image with the level of detail in negative! With our 21st century technological sophistication, we are so far defeated.”\nA couple of years ago David Rolfe was on the hunt for teachers who used the shroud, with the idea of putting together a ‘teaching pack’ that might be made available. A couple of us responded, but I don’t recall Allday being one of them. I’ll try to attend his lecture if I can get away from work early enough to get there!\n\n","date":"October 29, 2013 at 5:51 am","url":"https://shroudstory.com/2013/10/29/paper-chase-the-turin-shroud-by-jonathan-allday/","cat":"carbon_14_dating","id":"comment-49083","author":"Hugh Farey","site":"shroudstory"}]
