[{"title":"Piezonuclear What?","post":"http://arxiv.org/pdf/0910.3501v1.pdf is instructive, I think.\n\n","date":"February 15, 2014 at 11:17 am","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79590","author":"Hugh Farey","site":"shroudstory"},{"title":"Piezonuclear What?","post":"Quote: “The online petition, started 24 May, urges Profumo not to spend public research money on what it calls projects “without, at least for the moment, any scientific foundation.” The petitioners argue that INRIM’s work on piezonuclear reactions would “bring discredit to the whole research system.”\nMy comment:  I’m sure Fazio and Mandaglio in Italy would agree to sign such a petition and I’m also sure Rogers, if he was here today, would also be willing to sign it.  And when I think at all the money the University of Padua has given to Fanti for his dating research (and related researches) on highly questionable samples (samples that they should knew would NEVER BE ACKNOWLEDGE BY THE VATICAN AS UNQUESTIONABLE SAMPLES FROM THE SHROUD), I wonder why there have not been the same kind of petition in that case.  Maybe that’s because Fanti’s research was considered much more “anecdotal” without too much danger of discrediting the whole Italian scientific community…\n\n","date":"February 15, 2014 at 6:05 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79643","author":"Anonymous","site":"shroudstory"},{"title":"Piezonuclear What?","post":"Yannick, did Ray Rogers get his fibres directly from the Church?\n\n","date":"February 15, 2014 at 6:10 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79646","author":"Louis","site":"shroudstory"},{"title":"Piezonuclear What?","post":"From Gonella, the Church idvisor.\n\n","date":"February 15, 2014 at 6:18 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79649","author":"Anonymous","site":"shroudstory"},{"title":"Piezonuclear What?","post":"And did Gonella have the Church’s permission?\n\n","date":"February 15, 2014 at 6:27 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79652","author":"Louis","site":"shroudstory"},{"title":"Piezonuclear What?","post":"Don’t know. Anyway, one thing’s for sure: Rogers researches, unlike the one made by Fanti, was not funded with money given by a university…\n\n","date":"February 15, 2014 at 6:31 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79653","author":"Anonymous","site":"shroudstory"},{"title":"Piezonuclear What?","post":"Yannick, so, you see, Rogers and Fanti obtained their fibres in the same way. Many of your comments and papers are good, however you will lose your standing if you resort to personal attacks. Professor Giulio Fanti is not in for money, he is a very serious scientist and his research has gone beyond the Turin Shroud, involves a lot of hard work, material, travelling and so on. If Ray Rogers did the same amount of research he would also need money. The fruits of Professor Fanti’s research will be known after his papers are ready.\n\n","date":"February 15, 2014 at 7:06 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79658","author":"Louis","site":"shroudstory"},{"title":"Piezonuclear What?","post":"You miss the point.  My point was:  is it correct for a public university to spend bug $$$ on that kind of research that will NEVER been accepted by the Vatican has being valid?  I don’t think so.\nAnd for the professionalism of Fanti, sorry but I don’t share at all your enthousiam.  I know for a fact that this guy is dishonest intellectually when it comes to Shroud research.  The infamous paper that he wrote in 2010 with some other members of the SSG is a proof of this.  \nAnother person (I prefer to not mention his name) who wrote this infamous paper (a paper by the way that had one goal: to try to back-up the hypotheses of Fanti and DiLazzaro – 2 of the co-authors of the paper – about the image formation) once told me personally that Fanti never even wanted to mention Rogers’ very possible hypothesis concerning the chromophore in this paper and that all he wanted to mention was his personal hypothesis regarding the primary cell wall of the linen fiber!!!  The truth is: if it wasn’t for some pressure done by the other co-author of the paper that I just mentioned, their 2010 paper would never have even mention Rogers hypothesis at all, which is a total shame for a paper that was supposed to present the reality of the Shroud image…  \nQuestion: Why does Fanti did not wanted to mention Rogers’ hypothesis concerning the chromophore in this 2010 paper?  Simple: because if Rogers’ hypothesis should be right, this would prove with a very high level of confidence that Fanti or DiLazzaro’s hypotheses (or any other hypothesis involving energetic radiations) are not the solution to explain the Shroud image!\n\n","date":"February 15, 2014 at 7:34 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79661","author":"Anonymous","site":"shroudstory"},{"title":"Piezonuclear What?","post":"You should read “big $$$” and not “bug $$$”. Sorry.\n\n","date":"February 15, 2014 at 7:35 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79662","author":"Anonymous","site":"shroudstory"},{"title":"Piezonuclear What?","post":"Yannick, it is one scientist contesting another scientist, but that is part of science isn’t it? Professor Fanti has still not published much of his research and we still have a long way to go when it comes to image formation. If part of Fanti’s research was contested by Turin so was Rogers’ paper. The paper by Fanti and Maggiolo was contested only verbally by one of the scientists linked to Turin and not only no paper was published, the microphotographs were not made available.\nTake it easy, you can write down what I’m saying today, 15th February, 2014, we Shroudies will have more news regarding image formation this year, and it will not be along the lines of what Rogers thought.\n\n","date":"February 15, 2014 at 8:05 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79669","author":"Louis","site":"shroudstory"},{"title":"Piezonuclear What?","post":"You really sound like a fan of Fanti and also a partisan of the hypothesis that something supernatural can explain the Shroud image…\nImportant note: Fanti was not only contesting Rogers hypothesis, he wanted to make believe this was irrelevant while it is far from being proven that his impurity hypothesis is no good regarding the Shroud.  That’s precisely why the other co-writer made pressure on Fanti for him to accept the inclusion of a mention about Rogers hypothesis (even though he still managed to cast doubts over it (without any solid arguments to back this up) while doing everything he could to make believe the image is really located Inside the primary cell wall (while this is far from being proven).\n\n","date":"February 15, 2014 at 8:58 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79683","author":"Anonymous","site":"shroudstory"},{"title":"Piezonuclear What?","post":"Yannick, can’t you stop resorting to personal attacks? I said take it easy, we will see more image-formation hypotheses this year and not along the lines Rogers proposed.\n\n","date":"February 15, 2014 at 9:27 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79688","author":"Louis","site":"shroudstory"},{"title":"Piezonuclear What?","post":"What do you mean by saying “not along the lines Rogers proposed” if it’s not something related to the supernatural?\n\n","date":"February 15, 2014 at 10:49 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79700","author":"Anonymous","site":"shroudstory"},{"title":"Piezonuclear What?","post":"And what make you think “we will see more image-formation hypothèses this year?\n\n","date":"February 15, 2014 at 10:50 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79701","author":"Anonymous","site":"shroudstory"},{"title":"Piezonuclear What?","post":"Sorry, Yannick, if this is a bait I have not swallowed it. I did not think anything, it is the scientists who are thinking, and as there are ethical standards to follow, their views or findings will only be revealed at the correct time. But, of course, I am inclined to prompt so that the scientific thinking moves forward.\n\n","date":"February 16, 2014 at 10:18 am","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79798","author":"Louis","site":"shroudstory"},{"title":"Piezonuclear What?","post":"There is absolutely nothing wrong with believing that the Shroud image may have formed wholly or partly supernaturally. It is not a view I hold, and by definition a miracle is not subject to scientific investigation, but there is no evidence to deny it, and considerable belief in associated supernatural events.\nAs for the funding brou-ha-ha, this has nothing to do with the Shroud at all. Although they have a personal interest in the Shroud, both Carpinteri and Fanti have research interests well beyond that specific, which may or may not be worth funding. Carpinteri wants to research piezonuclear emission, whose very existence is hotly disputed, while Fanti has been working on an alternative to radiocarbon dating, by the mechanical testing of very small fibres. This may turn out to be worthwhile for some archaeological artifacts, although almost certainly the Shroud will not be one of them.\nOne wonders what Anonymous would say about the funding of a chemist instead of a physicist trying to investigate an alternative to radiocarbon dating, say by quantifying vanillin loss in aging textiles. Would that be worth funding?\n\n","date":"February 16, 2014 at 11:31 am","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79812","author":"Hugh Farey","site":"shroudstory"},{"title":"Piezonuclear What?","post":"Professor Giulio Fanti is a serious scientist and a respectable person and I repudiate the insinuations that he is having a good time with the funds, something like saying he is filling his belly with campari and spaghetti alla carbonara, and I am not the only person who has objected to the personal attacks directed at him in this blog.\nIf he obtained the funds from the university it is because they approved his projects and they know what kind of person he is and, as I wrote earlier, his research has also gone beyond the Turin Shroud, but involves topics that are related to the relic, however the material is vast and it takes a lot of time to prepare the results.\nI think that Dr. Rogers was also a serious scientist and knew what he was doing, and only take exception to a paper he wrote involving evolution, where he implied that it was a automatic process, failing to explain where the rationality came from.\n\n","date":"February 16, 2014 at 12:52 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79821","author":"Louis","site":"shroudstory"},{"title":"Piezonuclear What?","post":"You miss again my point Louis…  Here the real question we have the right to ask: Was it correct for the University of Padua to give big $$$ to Fanti for his Shroud research on highly questionable samples (samples that they should knew would NEVER BE ACKNOWLEDGE BY THE VATICAN AS UNQUESTIONABLE SAMPLES FROM THE SHROUD)?\nPersonally, I would answer “no” without any hesitation…  Note: the main question do not concern if Fanti is a credible scientist or not; the question concern the validity of his samples and why a university agreed to fund such a project of research that was entirely based on such questionable samples.  Looking from the outside, it seem to me that it is because Fanti is most probably very persuasive.\n\n","date":"February 16, 2014 at 6:13 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79872","author":"Anonymous","site":"shroudstory"},{"title":"Piezonuclear What?","post":"Hugh F: “One wonders what Anonymous would say about the funding of a chemist instead of a physicist trying to investigate an alternative to radiocarbon dating, say by quantifying vanillin loss in aging textiles.” \nAs my one-time country-man Baron Rutherford of Nelson once commented,  “All science is either physics or stamp-collecting!” Rutherford? He’s the PHYSICIST who won the Nobel Prize in CHEMISTRY in 1908 for his ground-breaking research in Nuclear Physics, including the discovery of NEUTRONS! I had great-uncles who were with him at Nelson College in NZ.  \nOther delightful quotable quotes from Rutherford can be found on Wiki, including “An alleged scientific discovery has no merit unless it can be explained to a barmaid.”\nhttp://en.wikiquote.org/wiki/Ernest_Rutherford \nHe also had a reputation for intoning the words of “Onward Christian Soldiers” while working at the Cavendish laboratory in Cambridge.\n\n","date":"February 16, 2014 at 3:12 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79838","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Piezonuclear What?","post":"His methods were so unconventional that after his death his laboratories at Cambridge were sealed for 40 years, and then required considerable decontamination before being declared fit for use again. Having left Manchester in 1919, that University was less aware of the risk Rutherford posed to health, and even in 2004 his laboratories there were still heavily contaminated with mercury. See http://www.theguardian.com/education/2008/oct/21/universityofmanchester-research\n\n","date":"February 16, 2014 at 4:42 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79849","author":"Hugh Farey","site":"shroudstory"},{"title":"Piezonuclear What?","post":"The dangers to health were of course not known or appreciated in Rutherford’s own time.  Marie Curie is reported as keeping vials of radium in her bed-room as a sort of night-light so she could admire the greenish glow before going to sleep.  She paid the ultimate penalty of terminal cancer as a result.  The dangers to health from radioactivity only became evident I think with the atomic bombs, firstly at Nagasaki and Hiroshima, and later on with the ongoing nuclear tests at Nevada, the Pacific, and also in Australia. NZ has I think compensated for Rutherford’s legacy, in its historical protests at the persistent French nuclear tests in the Pacific (our back yard), its prohibition of nuclear ships in our waters, and by a former Prime Minister David Lange in a widely publicised Oxford Union debate with an American nuclear advocate televangelist Jerry Falwell, broadcast internationally. A famous Lange quote to Falwell: “I can smell the uranium on your breath!” \nAn official quote concerning the Cambridge contamination: “Appropriate measures were taken many years ago in consultation with the appropriate authorities to assess and deal with the situation resulting from the use of these materials. The 1977 investigation confirmed that there is no contamination in the Old Tower” \nConcerning Manchester: Steps were also taken to elimnate the contamination. \nConclusion??: “Never trust a scientist!”\n\n","date":"February 16, 2014 at 7:22 pm","url":"https://shroudstory.com/2014/02/15/piezonuclear-what/","cat":"carbon_14_dating","id":"comment-79881","author":"daveb of wellington nz","site":"shroudstory"}]
