[{"title":"Cat Among the Pigeons","post":"\nHugh Farey :\nThis suggests to me that some attempt was made to stain the backing cloth to make it ‘fit’ the shroud better, quite possibly by smearing it with a cotton pad damp with a mixture of dye and gum arabic. Such a process would only affect the surfaces in contact with the cloth (which is why the backing cloth under the Shroud stayed white) and liberally scatter cotton, dye and gum over the margins of the shroud.\nNeedless to say, all this gunk was removed and had no effect on the C14 dating.\n\nIs this consistent with Thibault’s observations ?\n\n","date":"January 21, 2014 at 1:23 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73959","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hugh wrote,“Benford and Marino’s ﬁrst approach was to use some almost neglected results from the 1978 STURP investigation, namely the so-called ‘quad-mosaic images…” Hugh then added, “The next attempt to recognise invisible weaving was to try to observe it on close-up photos.”\nI think this is completely backwards. I believe that Sue Benford and Joe Marino started out with the close-up photos. That was pretty much all that was being used as evidence when Ray Rogers was involved. I don’t think Sue and Joe paid any attention to the quad-mosaics, at least in writing or in presentations, before their article in Chemistry Today in 2008. Maybe Joe can confirm this. Am I right? I think you have it wrong, Hugh.\nI’m a bit troubled when Hugh writes of the close-up photos, “These were of rather poor quality at the time, but nevertheless evinced remarkably conﬁdent conﬁrmations of its presence from several expert tailors.” \nTailors? Textile experts?\nIs Hugh looking at the same pixel density photos that Sue and Joe were using? Or was he looking or at web based quality image files (72dpi)? \nHow does he know that these are remarkably confident confirmations? Did he consult textile experts? Is this personal judgment? I’d like to know a little bit more in this area. \nOn occasion, Hugh has made it clear that he sits on a fence when it comes to authenticity. It’s a percentage thing, this way or that way. I’m sympathetic to this. I get it. But then I read this article in BSTS and I think that but for an adjective here and another one there — or by the turn of a phrase like remarkably confident —  and this article, itself, sits on the fence. I could pencil it up and pretty much say how confident I am in Sue and Joe’s work. I was. I remain so.\nIconoclastic? Maybe. I’ve been there. I’m there now and then. Some backwards history? Been there, too. Cat among the pigeons ? I guess it depends:\n\n","date":"January 21, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73963","author":"Dan","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"There is one response in the thread “The idea of something…” Sitting on the fence? Could be, but about to jump on the side of anti-authenticity….\n\n","date":"January 21, 2014 at 1:56 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73965","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Not wholly, but it is as close as I can get! He is convinced that the cotton he saw was integral to the original flax fibres, although in varying proportions. He also distinguishes between ‘ancient’ and ‘modern’ cotton, although it is not clear when ‘ancient’ became ‘modern.’ However he does agree that only the upper surfaces of the cloth are discoloured with some form of colourant.\nIncidentally, the article on the Invisible Patch in Barrie’s new shroud.com update has mysteriously lost some diagrams, which I hope we will be able to rectify shortly.\n\n","date":"January 21, 2014 at 1:57 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73966","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I’m transplanting my question from another thread in case you missed it. \n“Hugh, you seem quite convinced the C-14 testing, and subsequent results, are impeccable. Do you see any problems at all for the C-14 data? Any potential Achilles heel at all?’\nIs it possible to clean a C-14 sample too well?\n\n","date":"January 21, 2014 at 2:12 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73967","author":"David Goulet","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Not at all i would say.\nYou can’t have 1/ a superficial “gunk” (made of cotton/dye/gum) and 2/ cotton fibers in the core of individually coated threads.\nImage from the LANL are unequivocal.\n\n","date":"January 21, 2014 at 2:19 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73969","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"John Tyrer has been forgotten, and the other suggestion is to read what Ian Wilson has to say about contamination in his last Shroud book.\n\n","date":"January 21, 2014 at 2:18 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73968","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I’m jumping about here as posts come so thick and fast.\nMy first comment above was to anoxie. As for the LANL findings, I thoroughly recommend Robert Villarreal’s lecture about them on YouTube, where you will find he is much more uncertain about them than might be expected. He does not find the images at all unequivocal.\nAs to Benford and Marino. Both their Ohio presentation (http://www.ohioshroudconference.com/papers/p09.pdf), and their Chemistry Today paper (http://shroud.com/pdfs/benfordmarino2008.pdf) begin with the Quad Mosaic evidence, as if they considered that the most significant. I agree that their 2000 didn’t even mention it though, so you’re probably correct about the chronology.\nIt’s perfectly true that there are no clear photos of the weaving discrepancies observed by the various expert tailors. The same poor quality photo is reproduced in their 2000 and their 2008 papers. It would be good if Joe could confirm or deny that that was the photo used. Now, of course, one would use Shroud 2.0, as I did.\nBy doing so, I believe I have a much better idea of the inconsistency of the thickness of the threads of the shrouds than the tailors consulted. And I can see the same inconsistency all over the shroud, not just in one tiny place. And forgive me for using the term tailor instead of textile experts. I mean no disrespect; certainly not. However, to me a textile expert is a university academic, while a tailor is a practitioner. Joe makes very clear that his experts are tailors, but not that they are academics. I have no doubt that they can be just as knowledgable however, and do not automatically therefore elevate Mechtilde Flury-Lemberg’s opinions above theirs.\nAnd yes, I agree. I’m a scientist. Sitting on the fence is what we do best…\nCan anything be wrong with the impeccable C14 tests? Well yes. The Riani and Atkinson paper is very persuasive, and I find it very odd that nobody from the radiocarbon dating cares to defend themselves against the very serious accusations of incompetence and fraud which have been levelled against them. However the idea that water soluble contaminents are likely to have affected the procedure I think is weak, and the oft-quoted but vague assertion that radiocarbon dating is often wrong is weaker still. There are anomalous radiocarbon dates, to be sure, but they are nearly always easy to explain. I do not know of any such dates that are currently baffling.\n\n","date":"January 21, 2014 at 2:44 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73973","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\nOhio shroud conference :\nVillarreal also revealed that, during testing, one of the threads came apart in the middle forming two separate pieces. A surface resin, that may have been holding the two pieces together, fell off and was analyzed. Surprisingly, the two ends of the thread had different chemical compositions, lending credence to the theory that the threads were spliced together during a repair.\n\nA superfical gunk on an homogeneous thread ?\n\n","date":"January 21, 2014 at 3:00 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73975","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Watch Villarreal himself on YouTube at “Shroud of Turin Ohio State University Villarreal Lecture Part 3 of 5.” The statement that the two ends of the splice that split were of different composition is a misunderstanding of his words. After comparing two FTIR standards (cotton and linen) to show the difference, he goes on to look at the two ends of the splice (called Region 1 and Region 2), and says: “Both regions, Region 1 and Region 2, are cotton. It’s very definitely not linen.” The ends were glued together by a ‘brown crust,’ which was identified as a ‘terpene resin.’\n\n","date":"January 21, 2014 at 4:29 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73984","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Haven’t contributed anything to this website for ages and it seems that the same old debates are going on.. and on, with very little light on the issues. But it does seem that people like Hugh are working through some of the deadwood and making those who believe that the case for the authenticity of the Shroud is watertight tighten up their act. That can only be healthy! perhaps i ought to tune in more!\n\n","date":"January 21, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73985","author":"Lyfe","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Amen, Lyfe. Glad to see there’s still someone here (or  looks in occasionally) who appreciates a spirit of free enquiry, unfettered by those hard-nosed ‘agendas’.\n\n","date":"January 21, 2014 at 4:46 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73987","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Do you accept this conclusion (this thread is definitely not linen) ?\n\n","date":"January 21, 2014 at 4:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73986","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Yes. Quite a lot of threads are not linen. I don’t know if this is exclusive to the radiocarbon corner, and I certainly don’t think these cotton threads have been interwoven with worn out bits of Shroud. But they’re surely there…\n\n","date":"January 21, 2014 at 4:55 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73991","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Why do you suppose the Shroud is described as “linen”, Hugh? Where’s the definitive evidence that it’s 100% linen,  and not a cheaper linen-cotton blend?\nSpeaking as someone who has had to pay a hefty premium to experiment with forming Shroud-like images on 100% linen, I’d fully understand why someone might choose a cheaper cotton-linen blend  for a burial shroud – whether 1st or simulated 14th century –  especially as an appreciable amount of cotton can be incorporated with scarcely any difference in feel or appearance – except under the microscope.\n(I did say I would give this site a miss, but felt the need to give you some moral support, Hugh, given your brave ‘free-thinker’ stance that has somehow survived your elevation to the dizzying heights of the Shroudie Establishment).\n\n","date":"January 21, 2014 at 5:18 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-73999","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Why not use all cotton then if cost is such a factor? Wh o would care?\n\n","date":"January 21, 2014 at 5:27 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74003","author":"David Goulet","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\nHugh Farey :\nYes. Quite a lot of threads are not linen. I don’t know if this is exclusive to the radiocarbon corner\n\nExactly, you don’t know. You don’t know if your sample is representative of the whole shroud.\nDon’t you understand this is what invalidates the protocol of the radiocarbon dating ?\n\n","date":"January 21, 2014 at 5:38 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74008","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Nah, you don’t get me like that, anoxie. I didn’t say that the sample that was tested was not representative of the whole shroud; I suspect it was. What I’m not sure about was the extent of the cotton contamination which, as I have said, I think is not integral to the shroud and was removed before the dating process. Good try, but no cigar there.\n\n","date":"January 21, 2014 at 6:33 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74019","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hugh,\nUnlike you or I, Ray Rogers searched the Shroud for interwoven cotton fibers such as he had seen on the Raes and than carbon sample piece that he got from Gonella via Tom D’Muhala. They weren’t there. He had at his disposal fiber samples  from the main body of the Shroud.\nBetween your surmises without factual foundation and Rogers report of what he saw and didn’t see, (as well as Villarreal and Brown) you’ll have to excuse me  if I take Rogers at his word. Also, it appears that Oxford was informed during the carbon dating that it samples had interwoven cotton fibers. It was from a pass from Kim Driesbach thrown to Ian Wilson to the BSTS Newsletter in 1990. (Excuse the football analogy but the Super Bowl in the US is a week form Sunday.)\nI don’t know why you have so much respect for the carbon dating labs who deliberately ignored and refused to consider the STURP reports and the scientists who devoted themselves to STURP. The STURP scientists were not all Christian zealots as Harry Gove and David Sox alleged. They were well qualified men and women tackling an intriguing problem. Some were Catholic, some were Protestant, some were Jewish and some were agnostic. They were all well qualified scientists tackling an interesting “fun” project. Gonella later complained about the carbon labs tactics that “It was blackmail. The STURP team has earned our support and we should be careful of Monday morning quarter backing. (Oops, there I go again).\nMaybe its time for you to give-up the H.L. Menken act and accept the truths that the scientists of STURP reported.\n\n","date":"January 21, 2014 at 6:36 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74021","author":"John Klotz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\nDavid Goulet :\nWhy not use all cotton then if cost is such a factor? Wh o would care?\n\nLinen was especially prized in hot climates, feeling cool against the skin. It’s also easily distinguished from cotton by its coarser weave. A rich man might have chosen a burial shroud for a revered acquaintance that would seem to be up-market linen to mourners, viewing from a distance, but maybe (and understandably) have cut costs by having an appreciable fraction of interwoven (or inter-spun) cotton.\n\n","date":"January 21, 2014 at 5:38 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74007","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"But a medieval French artisan wouldn’t be concerned with that because the plebes wouldn’t know the difference anyway. Though your explanation would make sense for Joseph of Arimethea. Or are you suggesitng that the artisan was thinking like Joseph?\n\n","date":"January 21, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74011","author":"David Goulet","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Sorry, but your medieval pilgrims were not plebs. They were your first generation Thomas Cook tourists, who did their research before setting of. They expected to see linen, as per NT, but would probably not have been able to distinguish between pure linen and a cheaper linen-cotton blend.\n\n","date":"January 21, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74016","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"In the end, the simple fact that they only dated one sample (divided in 3 pieces) in 1988 make the result suspicious, because it’s impossible for the lab to be certain if what they dated was totally representative of the main body of the Shroud.  Truly, another C14 dating would help to settle this issue once and for all (or maybe not if it’s not done properly)…\n\n","date":"January 21, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74010","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Addition:  As Al Adler said it so well in a conference presentation he did in 1998, there is a huge difference between “precision” and “accuracy”.  In the case of the 88 dating, it is probable that their dating of the only sample taken was “precise”.  But, because of the reason I explain above, it is impossible for the same labs to claim with great scientific certainty that their results are “accurate” versus the true age of the main body of the Shroud.\n\n","date":"January 21, 2014 at 5:49 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74013","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Wilson has correctly pointed out in his book why another C14 test will not help clear the doubts.\n\n","date":"January 21, 2014 at 5:48 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74012","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"If it’s done properly while using many samples taken at different spots where there are no evident signs of contamination, I don’t know why such a dating could not help us see more clearly versus the true age of the Shroud.  And by the way, Meacham has a complete opposite point of view versus Wilson and, pardon me, but I tend to listen more carefully to what a real archaeologist who know C14 dating very well has to say than a journalist and a popular book writer…\n\n","date":"January 21, 2014 at 5:51 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74014","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Sorry, what you have stated is incorrect. You should read the book first, written by a historian with an M.A. from Oxford. I have no doubt that Meacham is a good archaeologist but Wilson’s knowledge is far superior. .\n\n","date":"January 21, 2014 at 5:57 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74017","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Wilson is not an archaeologist and has not professionally been involved with carbon dating ancient artifacts. Meacham is an archaeologist and has experience with carbon dating. Read his stuff. I like much of what Ian has written and he deserves a great deal of credit for what he has done, and hopefully will do. He had enormous influence in directing attention to the Shroud.  But as a Catholic I have enough problems with an :”infallible” pope without giving the same deference to an infallible Oxonian. Now if he was a Nortre Dame graduate …\n\n","date":"January 21, 2014 at 6:51 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74025","author":"John Klotz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Anyone who reads Wilson’s book knows that he has studied the 1988 C14 dating carefully, cited a number of archaeologists and cases, presenting his point of view in his usual elegant manner, but never claiming to be infallible.On the contrary, he is the first one to weigh the evidence impartially, even when it comes to papers claiming that the dating results were skewed.\nAs far as I know, the Pope never claims to be infallible as a man, the Church only says he is infallible when he issues an “ex cathedra” document, and that has New Testament support. This of course is valid for anyone who believes it is the 2000-year-old Apostolic Church with roots in scripture. Whether individual Catholics believe in papal infallibility or not is another story.\n\n","date":"January 21, 2014 at 7:30 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74030","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Quote: “I like much of what Ian has written and he deserves a great deal of credit for what he has done, and hopefully will do.”\nMy opinion:  I dislike much of what Ian has written and he deserves not at all to receive all the credit he got over the years.  This guy is the real Dan Brown of sindonology and has contributed greatly to make sindonology look like a sick joke.\n\n","date":"January 22, 2014 at 11:44 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74093","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Back to the “medieval French artisan.” I don’t believe the Shroud was made by a medieval French artisan….\n\n","date":"January 21, 2014 at 6:35 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74020","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Some clarifications about the order and circumstances of the invisible reweave theory.\nWe did not start out with the Quad Mosaic photos when we first presented our theory in 2000.  We had shown some experts photos that included a very high-quality photo of the C-14 area that’s in the excellent book by Gino Moretto (of the Shroud Museum in Turin) called Shroud Guide.  It was only brought out in 2008 in the Chemistry Today article from 2008 and the presentation made at the Ohio Shroud conference that year.\nRegarding the experts we showed it to, one was Thomas Ferguson & Co. Ltd, world-renowned makers of Double Damask Linen, another was Louis Harner of Albany International Research Company, and the third was European-trained weaver David Pearson, owner of the French Tailors in Columbus, Ohio, who was very familiar with the French invisible reweave technique.  I will leave it to others to decide if the fact that they aren’t academics is significant.\nGoing back to the Quad Mosaic, there’s a very fine article on Barrie’s site about it at http://www.shroud.com/pdfs/quad.pdf, with some important comments by the late Jean Lorre, an imaging expert from the Jet Propulsion Laboratory in Pasadena, California.\n\n","date":"January 21, 2014 at 6:48 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74023","author":"Joe Marino","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Thanks, Joe. I wonder what your experts would make of the Shroud 2.0 app? As I say, I have no problem with them being genuine experts in their field, but still doubt that the photos they examined were good enough for confident identification of interpolated threads.\nJohn, Rogers had no opportunity to examine the shroud for interwoven cotton, only stray fibres on sticky tape slides. Nor is their any suggestion in the BSTS article to which you refer that the cotton fibres identified by the Oxford team were integral to any linen threads. By all means take Rogers, Benford and Marino, Villarreal and Brown at their word. They are, or were, people whose integrity I do not doubt for a moment. But do not be blind to the inconsistences I have pointed out both within and between their discoveries.\nSimilarly, I have always had the greatest respect for the STURP team and their discoveries. Their papers are models of scientific reporting. I often disagree with their conclusions, but seldom with their observations. I do not know in what sense the Radiocarbon labs ignored or rejected their findings – neither of these groups of scientists selected where to take the radiocarbon sample from. Can you make any of this clearer?\n\n","date":"January 21, 2014 at 7:45 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74031","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hugh said: “Rogers had no opportunity to examine the shroud for interwoven cotton, only stray fibres on sticky tape slides.” That is incorrect. Not only did Rogers examine the actual Shroud in close detail, so did Jackson and Jumper and Pellicori and Devan and many others. I have posted a pdf with some photos I made during the 1978 exam that shows this clearly. The last photo is Rudy Dichtl purchasing the infamous “white cotton gloves” that left modern cotton on the surface of the Shroud. Here’s the link: http://www.shroud.com/pdfs/sturpmicroscopy.pdf  I hope this is helpful.\n\n","date":"January 21, 2014 at 8:56 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74036","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Yes, I’m sorry, Barrie; the context was in connection with the patch hypothesis, which sent everybody back to the main part of the shroud to check for cotton. By then, of course, there was no opportunity to look at the shroud itself. I do know that no interwoven cotton was found during the 1978 examination, although even then it was not possible to identify similar fibres except by microscopic analysis.\n\n","date":"January 22, 2014 at 4:08 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74058","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Thanks Barrie!  This really set the Rogers’ story straight… right from the horses’ mouth  (as in work-horse)!\n\n","date":"January 22, 2014 at 12:00 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74097","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hugh,\nYou are really insulting to a good scientist. Roger samples were stray fibers. They were taken from selected positions on the Shroud so that a good picture could be given of the whole. There location was cataloged. \nCan you cite me an authority other than you own pseudo-skepticism that states Rogers only has samples of stray fibers. If you took the time to read what actually happened at Turin in 1978, you would know that  first they spent 2 years preparing for their 120 hours.\nIn addition, detailed microscopic examinations were made and no cotton was detected other than stray cotton that was easily distinguishable form the intertwined cotton found in the Raes and carbon samples. Maybe you should acquaint yourself with some back issues of the BSTS newsletter.\n\n","date":"January 21, 2014 at 8:05 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74032","author":"John Klotz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hugh is not insulting anyone. He’s bending over backwards not to offend scientists (especially those not here to defend themselves). He’s pointing out gaps he sees between observations and conclusions. Can we get back to evidence based discussion and stop with the judgements.\n\n","date":"January 21, 2014 at 10:12 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74038","author":"David Goulet","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"correction:\nRogers’ samples were NOT stray fibers.\n\n","date":"January 21, 2014 at 8:06 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74033","author":"John Klotz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"There are two papers published in “Textile Horizons” by the late John Tyrer on shroud.com and these can be enlightening when it comes to the cotton and the question of cleaning linen for carbon dating.\n\n","date":"January 21, 2014 at 8:09 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74034","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"That’s why I was curious about the control samples. Were they linen, cotton or a mix of both?\n\n","date":"January 21, 2014 at 10:14 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74039","author":"David Goulet","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\ncolinsberry :\nSorry, but your medieval pilgrims were not plebs. They were your first generation Thomas Cook tourists, who did their research before setting of. They expected to see linen, as per NT, but would probably not have been able to distinguish between pure linen and a cheaper linen-cotton blend.\n\nMost of those pilgrims never even had access to a Bible, let alone had any clue what Jesus’ burial cloth would have been made of. They would have believed the Bishop if he said ‘This is the Shroud of Christ on the very shower curtain provided by Joseph of Arimethea.’\n\n","date":"January 21, 2014 at 10:17 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74040","author":"David Goulet","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hey Hugh…\n\nthought this site might be necessary for you and yours to review!\n\n","date":"January 22, 2014 at 12:20 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74047","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Annette,\nThanks for your post. This is a clip from a Discovery Channel program, Unwrapping the Shroud, broadcast in December 2008.It’s available onn Amazon. Sue Benford passed away the following year during Holy Week. Her appearance in the video is a rare opportunity for us “newbies” to see and know her in the flesh. There were also clips from Barrie Scwortz’s five hours of taped interview of Rogers that he made in 2004.\nOne really big regret I have in my life is that although I followed the Shroud from  afar (I read Ian’s first book in 1978) I never got to know some of these individuals who are for the time being beyond my knowing except through their video appearances and writings.\nI really suggest (as was suggested two years ago to me by Barrie), if you are serious about the Shroud you must get a copy of John Heller’s Book “Report on the Shroud of Turin.” (Also available from Amazon) He and Adler were quite a pair. We are indeed blessed with their work. I really wish I could have known them, but in a very real way, I have come to know them very well.\nI am sorry, but sometimes when I read the blogs and the comments of the pseudo-skeptics, I hear mice squeaking at lions.\n\n","date":"January 22, 2014 at 1:02 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74050","author":"John Klotz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"John Klotz. ‘I am sorry, but sometimes when I read the blogs and the comments of the pseudo-skeptics, I hear mice squeaking at lions.’\nJohn- we have been here before but let’s at least use language with precision. A ‘skeptic’ is someone who has doubts about evidence- it is a perfectly honest position to be in and is the default position of scientists and historians as well as many other academic disciplines.\nA ‘pseudo-sceptic’ is someone who pretends to be sceptical about, say, ‘x’ but  who actually knows that ‘x’ is true. That is not a very honourable position. So please only use ‘pseudo-sceptic’ when you have evidence that someone knows something for certain but pretends they are sceptical about it. I, as a professional historian, live with scepticism simply because most historical evidence is fragmentary, contradictory or difficult to interpret.The Shroud is a prime example of this!\n\n","date":"January 22, 2014 at 5:06 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74062","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"John, I’m so with you here!  The mouse that roared going on for the most part with this can’t see the forest for the trees anti-Shroudies!  BTW… did you ever see the 1983 interview of John Heller by Merv Griffin? It was a YouTube video that lasted about 6 months about two years ago and then was pulled.  It was a very insightful video to Heller’s Book Report on the Shroud with some timeless in depth questioning by Merv Griffin.\n\n","date":"January 22, 2014 at 12:05 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74098","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Please don’t forget the contributions made by John Jackson and Flury-Lemberg to this debate- both were sure ( Jackson on the evidence from banding, Flury-Lemberg from her personal close up examination in 2002), that there had been no reweaving.\n\n","date":"January 22, 2014 at 4:22 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74059","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"And I see that Ian Wilson rejects reweaving as well according to pages 129 onwards of his 2010, The Shroud. So it seems that Hugh has some quite impressive support on his side.\n\n","date":"January 22, 2014 at 11:11 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74091","author":"Lyfe","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I wonder if John Jackson & Flury-Lemberg put their high powered microscopes (as did Ray Rogers in 2005) to the area of the 1973 Raes Corner / 1988 C14 testing area  would they be so resolute in their assertion that there is no reweaving in this area.\n\n","date":"January 24, 2014 at 2:10 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74418","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"So I’m insulting to scientists? I’m sorry you feel that. In this post I have mentioned Robert Villarreal, whose lecture is fascinating and who clearly did not feel that the LANL findings were definitive, Ray Rogers, whose discovery of gum arabic and rose madder I consider significant and whose vanillin work even more so, and John Brown, whose photographs of threads and fibres deserve to be very carefully studied although I do not agree with his observations. I also have the utmost respect for, and have corresponded with, Riani, Atkinson, Ramsay and Professor Timothy Jull, whose peer-reviewed paper in the world’s most respected journal of carbon-14 dating John Kotz described as “silly.” I am certain that Joe Marino finds my contrary opinions irritating (so would I if it was the other way round!) but I have the greatest respect for his hypothesis, which would certainly be the biggest counter to the accuracy of the carbon dating if only it could be established clearly and consistently that the threads that were carbondated were indeed a medieval interpolation. That this it has not been established, and why I think so, I hope I have made clear.\nCan I show that Rogers did not take samples of whole threads from the main body of the shroud? He never mentions doing so. A few threads had been extracted, and were so few that they were given names. I only know of the “Zina thread” and the “Tamar Thread,” although that seems to have been of dubious provenance. Heller & Adler, McCrone and Rogers himself refer to fibres, fibrils and microfibres attached to the sticky tape slides, but not threads. “Report on the Shroud of Turin” makes no mention of the extraction of threads from the main body of the shroud.\n\n","date":"January 22, 2014 at 4:40 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74061","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"This is a response to Charles Freeman,\nCharles, \nI dispute your definition of pseudo-skeptic and I would refer to the work of Marcello Truzzi who I believed may have coined the phrase. A pseudo-skeptic is one who pretends to be open minded when asking questions but in fact is seeking to validate a contrary, pre-existing belief.  I would suggest that the “atheist pope” Richard Dawkins is also the world’s leading pseudo-skeptic because he seeks to validate his atheism. The existence of any God is beyond question to him. There is no god and that’s that. Thus he discards everything in scripture. He may seem to hedge, but he uses too many semantic tricks. There’s the way he treats Teilhard in the God Delusion for example.\nBut now to your main point (I think).\nI really can’t spend much time debating. The STURP team examined the Shroud with extremely precise optical instruments. Rogers found no gum arabic encrustations on the rest of the Shroud and no vanillin which was found on the samples from Raes and the carbon dating sample. \nI would recommend that you read Emanuella Martinella’s paper submitted at the 2012 Valencia conference. It’s 30 pages long, has 256 footnotes and 52 items in its bibliography. https://www.shroud.com/pdfs/marinelliv.pdf \nAlso, have you ever read John Brown’s paper and examined his micro photographs which some of which had resolutions of 3000X+ taken by a scanning electron microscope (SEM) http://www.shroud.com/pdfs/brown1.pdf\nTo be honest with you, I am much less impressed with titles and hyphenated European names, but Dame Isabel Pizcek supported Rogers report when it was initially challenged by some in Turin, but supported by others because eyeball examination or handheld magnifying glass  (ala Fleury-Lemberg) can not compete with SEM The whole carbon dating affair wreaks of medieval skullduggery.\nI really have to take a break from the blog. I have been looking for an appropriate theme for my Chapter 14 which was originally entitled The Shroud and the KISS of Occam’s Razor. But some interesting reading has now led me in a slightly different direction. Oh, I will mention the KISS of Occam’s Razor, but the title in chief will be something I have been mulling over since the very beginning: “Provenance and Providence.”\nNow you will  have to excuse me. I have a date with a beautiful, but tragic Medieval princess and a concert to attend by the Red violin.\n\n","date":"January 22, 2014 at 6:42 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74068","author":"John Klotz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"‘The whole carbon dating affair wreaks of medieval skullduggery.’\nI love it!\n\n","date":"January 22, 2014 at 9:10 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74077","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Thanks for the video clip, Annette. I won’t go through it in detail, but it does not refute any of my previous arguments. Some of it is transparently wrong as can be confirmed by anybody with an iPad or a few of the 1978 STURP papers. The very opening sentence, for example: “The herringbone weave, that is so consistent throughout the main body of the shroud…” This is nonsense. The herringbone weave is irregular, in some places extremely so, and the thickness of both warp and weft threads varies irregularly throughout the shroud, the thickest threads being up to 5 times thicker than the thinnest.\nSurely I cannot be the only person in the world who has actually seen French reweaving. It is extremely clever and painstaking work, but pefectly visible under a microscope where the new threads lie alongside the old. It is very well illustrated by the top photos at http://www.askandyaboutclothes.com/forum/showthread.php?120259-My-first-go-at-reweaving. In this repair, three or four white threads, perhaps 10 to 20 mm long, have been threaded alongside broken verticals, joining up a break of a few millimetres. It looks as if horizontal blue threads have been added too, but they are less clear. In the video Sue Benford describes the threads as having been twisted together, which would be even more obvious. I have searched hard for this kind of evidence (how I would love to find it!) on Shroud 2.0 without success.\nHas anybody else whose blind faith in everything that confirms their prejudices and blind rejection of everything that doesn’t even looked?\nI thought not.\nIs it just me getting old that I get irritated by people who direct me to look at things they clearly have not really looked at themselves? Why don’t you read this, says John, or look at that, says Annette. Well I have, and in detail, and they don’t say what you think they say. Further on in the video Ray Rogers, in voiceover, describes looking at the ultraviolet photos of the shroud. The photos which accompany this are patently obviously not ultraviolet photos – they are quad mosaic scans – and more absurdly still, they are not even of the radiocarbon corner of the cloth! The camera actually zooms in on an area next to the body’s buttocks.\nHas anybody else whose blind faith in everything that confirms their prejudices and blind rejection of everything that doesn’t even noticed?\nI thought not.\n\n","date":"January 22, 2014 at 11:29 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74092","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hugh, now wait a minute here… you’re refuting Rogers completely!  While I respect your independent scrutiny of Barrie’s Quad Mosaics, Barrie will have to weigh in on your observation that they are not even of the RadioCarbon (Cotton rewoven) corner.  And as far as French reweaving, I had my St. John Knits from Sax Fifth Avenue French rewoven in the 1980’s.  I never could tell where those former holes were in my suits.  I admit, the suits were woolen not cotton or linen but with a French-reweave someone in 1988 like textile expert Flury Lemberg or C14 specialist Mike Tite could easily have been deceived and hid their embarrassment.\n\n","date":"January 22, 2014 at 12:19 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74099","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Not necessarily. Rogers may not have known what was being shown under his voiceover. And why wait for Barrie? The quad mosaics photos are all on his shroud.com website. All you have to do is to look at them. Go on – after all, I watched the video on your recommendation!\n\n","date":"January 22, 2014 at 3:39 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74123","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I’ve looked at Barrie’s Quads many times, always believing the greenish area was of the Raes Corner.  So are you the only researcher saying that this greenish area is from under the buttocks… far removed from the Raes Corner and on the opposite (dorsal) side?  Thanks Hugh; you are truly giving a teachable moment here, but there are so many contradictions rather than bona fide clarifications.\n\n","date":"January 22, 2014 at 3:57 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74128","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Well done for making a start anyway.\nThe six quad mosaic images are at https://www.shroud.com/gallery/index.htm, close to the bottom. Two of them are enlargements of others. Three of the remaining four show exactly the same colouration: namely a pale blue upper, bright yellow middle and orange base, with green lower left-hand corners. The fourth has a blue central smudge which does not extend as far as the other three.\nIn his article “Some Details about the STURP Quad Mosaic Images” (https://www.shroud.com/pdfs/quad.pdf) Barrie Schwortz quotes Jean Lorre, as follows:\n“There was a strong illumination brightness falloff from the centre. This was eliminated by dividing each image by a flat field.”\nWell it wasn’t, was it? Each of the images is brighter in the centre than it is around the edges. The flat field process may have diminished the brightness falloff, but it didn’t eliminate it, and that’s important. What Lorre is clearly explaining is what was hoped, or expected, not what actually happened. Let’s go on.\n“We wanted to enhance the colour to reveal subtle colours which might betray spatial variations in chemical composition. […] we greatly exaggerated the colour saturations while preserving the original hues and intensities.”\nA noble idea, but it didn’t work. Lorre wishes so much that it had, that he loses all touch with his own images in his next sentence.\n“These colour images should be interpreted as a chemical composition map.”\nShall we take him at his word? Shall we agree that the blue bands across the top of three of the quad images really represent different chemicals from the yellow and orange below them? What might these blue bands be? They may be found across the front of the thighs, the head, and the buttocks. Shall we?\nOr shall we agree that the illumination of the areas of the shroud by the photographic lights are responsible, and the colours have nothing to do with the chemical composition of the shroud at all.\nOh, and the image described as “ultraviolet” by Rogers? It’s the shape of the patches which gives it away. It’s the one captioned Quad Mosaic Dorsal Legs, which shows the bloodstained feet at the top, and nearly reaches the buttocks at the bottom. The camera zooms meaningfully into the bottom left hand corner of this image, apparently under the impression that it is looking at the medieval patching of the radiocarbon corner.\nYer gotta larf, han’t yer…\n\n","date":"January 22, 2014 at 4:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74134","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"If you weren’t so British and so polite.. I’d think you were daft!  I’ve looked at these quads over and over and I do not see the greenish dark area any where’s near the buttocks or head area.  I see light blue bands, oranges and pinks… but at that infamous Raes Corner on the ventral lower leg area I clearly see a dark greenish patch… what is this patch Hugh?  Why is it so abnormally different from the rest of the Shroud?\n\n","date":"January 22, 2014 at 5:17 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74139","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"You haven’t looked at all the green patches in all the pictures have you? I can tell!\n Look again at your video. Start at 8:40. Listen to the commentary: “When we went back and looked at the ultraviolet photographs…” At this point the video shows the quad mosaic photograph of the back of the legs of the body, as far away from the radiocarbon corner as can be. You can clearly see the bloodstains of the feet at the top of the photo. “Here is this area that is significantly darker – it doesn’t fluoresce as much…” The camera is panning down and across to the bottom left hand corner of the quad mosaic picture of the Dorsal Legs. “It’s just this area around the Raes sample and where the radiocarbon sample was cut.” We have reached a close up on the lower left hand area of deep green, and then cut back to Rogers.\nYes there is a green patch over the lower left hand corner of the ventral lower legs (where it appears over the radiocarbon corner), but there is also a green patch on the lower left hand corner of the dorsal lower legs (where it appears just to left of the upper thigh), and a green patch on the lower left hand corner of the ventral torso (where it appears level with the groin) , and a green patch on the lower left hand corner of the dorsal torso (where it appears next to the back of the head). In fact every quad photo has a green patch in its lower left hand corner. The green patch is not abnormal. The green patch appears in the same place on every photo. So does the blue patch. So does the rest of the colouring. The green patch is not peculiar to the radiocarbon corner. It is an artifact of the photographic lighting.\nI don’t think I can make it clearer than that.\n\n","date":"January 22, 2014 at 7:25 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74160","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Dear all,\nCongratulations to Hugh for his interesting BSTS paper.\nI now have to read it carefully. At the first look, there are some misunderstandings in it.\nI have to write an “Answer to Hugh Farrey” as soon as possible.\nThank you for your patience.\n\n","date":"January 22, 2014 at 5:20 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74140","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"No Hugh, you can’t make it clearer… but where you see green patches in other frames after 8:40, I see only a blur of green in the charred patched holes.  I don’t see what you seem to see so readily: “The green patch appears in the same place on every photo.”  I only hear Rogers upset that the 1988 C-14 labs didn’t first check with the tests (viz. Barrie’s photographs/Quad Mosaics) and an overwhelmingly prominent green patch unlike any other on the Shroud in that one Cotton-Pickn Corner!   But thanks.  I am grateful for your insights. I just wish others would reference your insights directly, rather than referring us to more written “scientific” findings, or dance around what you are saying.\n\n","date":"January 22, 2014 at 8:29 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74164","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Last chance. http://i.imgur.com/Mxfe7kS.png. I hope it works!\n\n","date":"January 22, 2014 at 9:05 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74169","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Very nice… Hugh, very clear…  I’ll have to think about this more and read Morgan’s paper recommended by Joe Marino.  (Something that I was hoping I wouldn’t have to do tonight).  Do you think you could email John Morgan with your concerns Hugh?  Thanks for all your help.  I think I’m turning pretty green now.\n\n","date":"January 22, 2014 at 11:11 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74180","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Does this mean that the reweaving patch job has been totally debunked? If so, does this mean that the 1988 carbon dating was correct after all?\n\n","date":"January 23, 2014 at 2:21 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74195","author":"Luis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"No and no.\n\n","date":"January 23, 2014 at 3:12 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74201","author":"Dan","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"No and no, indeed. I think modified would be a good word, but we still have the rose madder, the gum arabic, the shreds of cotton and above all the vanillin fighting gamely for contamination.\n\n","date":"January 23, 2014 at 4:24 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74205","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"From threads to shreds…\n\nDavid Goulet :\nHe [Hugh] is pointing out gaps he sees between observations and conclusions. Can we get back to evidence based discussion and stop with the judgements.\n\nHere are the gaps i can see between observations and Hugh’s conclusions:\n1/ how can you talk of superficial contamination (superficial gunk and bla bla) whereas cotton has been found interwoven with linen, whereas R1 is a whole thread (not shred).\n2/ how do you explain the difference between the amount of cotton found in the Raes/radiocarbon sample and  threads from main parts of the shroud.\n3/ how do you know the cleaning process could have separated linen from cotton :\n\nHugh Farey :\nall this gunk was removed and had no effect on the C14 dating.\n\nSeriously ?! Give me a break. Hugh’s conclusions are speculations based on misunderstandings.\n\n","date":"January 23, 2014 at 5:40 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74210","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"No one has ever shown that the cotton has been woven into the Shroud. Gilbert Raes pointed out that cotton and flax were often spun and woven by the same workers and so cotton fibres may have drifted into the spinning and weaving process. \nAs there are so few cotton fibres found on the Shroud it would need an intensive examination of the Shroud to see whether they were  all over the Shroud but as Jull said some of these fibres may have drifted in anyway from bags in which the Shroud was folded. \nI think Raes suggested that there were more cotton fibres  on the edges because they would have been left over fibres in the loom from earlier cotton weaving.\nAs linen and cotton were both readily available in medieval Europe and the textile workers tended to work in either, I have never understood why these ‘invisible weavers’ would not have used  flax to make any repairs.Please can someone who supports the cotton reweave illuminate us about this.\nIt also needs stressing that not a single cotton thread has been found, only fibres, and this is compatible with what Raes and Jull have suggested- a drifting in of fibres from elsewhere, perhaps as early as the spinning process..\n\n","date":"January 23, 2014 at 7:32 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74220","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\nCharles Freeman :\nAs there are so few cotton fibres found on the Shroud it would need an intensive examination of the Shroud to see whether they were  all over the Shroud but as Jull said some of these fibres may have drifted in anyway from bags in which the Shroud was folded.\n\nSo few cotton fibres ? \nOn the main Shroud ? yes\nOn the radiocarbon/Raes samples ? no:\nWhen LANL has conducted FTIR analysis, they could only find cotton, not linen.\nWhen Thibault has intesively studied R7 he has found cotton, mainly around the thread, but into the core too, eliminating an external contamination.\nHave cotton fibers drifted from bags which contained the Shroud into the core of Shroud fibers in the radiocarbon area ? Mr Jull is not running out of imagination but i don’t buy it.\n\n","date":"January 23, 2014 at 9:28 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74233","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":":\n‘When LANL has conducted FTIR analysis, they could only find cotton, not linen.’\nPlease elaborate what this cotton was and where it came from.\n‘When Thibault has intesively studied R7 he has found cotton, mainly around the thread, but into the core too, eliminating an external contamination.’\nI think everyone is agreed that some cotton FIBRES may have drifted in as early as the spinning process because as Raes argued ( and it was his specialist area) cotton and flax were often spun in the same area. In fact in Cremona, northern Italy, the linen and cotton guilds actually merged.\n‘Have cotton fibers drifted from bags which contained the Shroud into the core of Shroud fibers in the radiocarbon area ? Mr Jull is not running out of imagination but i don’t buy it.’\nThis is only a suggestion- much more likely that Raes is right and that they drifted in an an earlier stage but to suggest that in all its frequent unravellings and displays, nearly every year in the open air in seventeenth century Turin, the Shroud was never in contact with cotton is going too far.\n\n","date":"January 23, 2014 at 10:06 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74239","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\nCharles Freeman :\nPlease elaborate what this cotton was and where it came from.\n\nPlease, refer to the protocol of the 1988 radiocarbon dating.\n\n","date":"January 23, 2014 at 10:40 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74243","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Anoxie- well here is the 1988 protocol-please let me know which one of these refers to cotton:\n‘On April 17, 1988, ten years after the S.Tu.R.P. project had been initiated, British Museum scientific director Michael Tite published in Nature[26] the “final” protocol:\nthe laboratories at Oxford, Zürich and Tucson would perform the test;\nthey would receive one sample weighing 40 mg., sampled from a single portion of weave;\nthe laboratories would receive two more samples, clearly distinguishable from the original one—a decision calling on the ethical dependability of the laboratories;\nsamples would be delivered to the laboratories’ representatives in Turin;\neach test would be filmed;\nthere would be no comparison of results (nor communication) between laboratories until the results be certified as definitive, univocal and complete;\nthe proportional counter method would not be used because it required gram quantities rather than milligram quantities of shroud material.’\n\n","date":"January 23, 2014 at 11:37 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74248","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"No one, as you can see. No reference to the composition of what they dated.\nOne has to trust them, it was linen… until you find cotton.\n\n","date":"January 23, 2014 at 1:11 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74259","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Anoxie- I am sorry I don’t get the point- no one suggests anything but that the Shroud is overwhelmingly linen.\nWhat I am interested is in the following:\n‘When LANL has conducted FTIR analysis, they could only find cotton, not linen.’ I just want to know what this analysis was, what is was done on, etc, as I , and perhaps others reading this discussion, know nothing about it and it seems very mysterious as no one has yet proved that cotton makes up more than a tiny, tiny part of the Shroud and that only in fibres. This analysis might suggest otherwise so please let us know about it!!\n\n","date":"January 23, 2014 at 2:15 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74264","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Also, although cotton was known in Roman times, it was much more common in the medieval period when vast quantities were being imported into Italy and spun into yarn there. If we have too much cotton in the Shroud someone might even suggest the whole thing was woven in medieval times. The basic point is, of course, that no one has found cotton thread or explained why the so-called invisible weavers would have used it instead of flax if they were seeking a perfect fit-even down to the banding. I think the cotton thesis is all a red herring – or a red (rose) madder herring perhaps, and can be safely disregarded as having anything to do with any reweaving.\n\n","date":"January 23, 2014 at 2:22 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74267","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I have been reluctant to enter this particular debate. I happen to be pre-occupied with other projects important to me right now, the matter’s complicated, the quad mosaic issues are obviously contentious as to what various experts say they observed, and it’s uncomfortably close to the limits of my technical knowledge. \nMarino & Benford had their reasons for doubting that the sample was representative, apparently based on photographs, rather than the mosaics, which seem to have been something of an afterthought. Several known experts in invisible reweaving they consulted reinforced their suspicions. This was enough for them to persuade Ray Rogers to look into the matter further. Rogers may have considered the mosaics, but I believe his investigation was very much more thorough. He confirmed the rose madder, the gum arabic, the shreds of cotton and the vanillin issues. \nHugh is concurring with this finding, but now seems to be saying that it reduces to a question of contamination.  Elsewhere he has stated that all such contamination would have been removed for the C14. I’m not sure whether we know this or not, quite likely it’s correct.   \nWhat could be the purpose of these foreign materials, if not for an invisible reweave? Elsewhere Charles has cited John Jackson & Flury-Lemburg. Jackson was pursaded by the uniformity of banding that there was no reweave. Was not one purpose of the materials to mask the reweave by ensuring such uniformity. I suspect that Flury-Lemburg was very likely unfamiliar with the skills of the specialists that Marino & Benford consulted. \nI am left with the impression that the quad mosaics and what other investigators have made of them, seemed to have added little to the usefulness of the debate. There remain the spectre of the foreign material and the question of vanillin. Probably they do indicate the likelihood of reweave.  But otherwise it makes the site highly suspect, and so it cannot be considered as representative of the whole.\n\n","date":"January 23, 2014 at 5:46 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74214","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"‘Charles has cited John Jackson & Flury-Lemburg. Jackson was pursaded by the uniformity of banding that there was no reweave. Was not one purpose of the materials to mask the reweave by ensuring such uniformity. I suspect that Flury-Lemburg was very likely unfamiliar with the skills of the specialists that Marino & Benford consulted.’\nAre you suggesting that these elusive invisible weavers were actually able to reproduce banding so perfectly that  the STURP photographs did not show the reweave? They really were geniuses, especially as they may have been working in cotton rather than the original flax.\nIt may well be that Flury-Lemberg was unfamiliar with the specialists consulted by Benford and Marino. They work with modern techniques (did any of them know anything about ancient textiles?- I think not any more than anyone in the STURP team did), she works with ancient textiles and weaving methods. They were given some photos to look at, Flury-Lemberg worked on the actual cloth. I know which I prefer!!\n\n","date":"January 23, 2014 at 7:42 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74222","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"P.S. Gabriel Vial also stressed with photos, the very wide variety in thicknesses in the yarn used on the Shroud, a point Hugh has also made. This means that one can hardly expect consistency in the Shroud’s weave anyway! There is no standard perfect Shroud weave against which any other part of the Shroud can be judged.  (Photographs in his article ‘Le Linceul de Turin-Etude Technique, CIETA Bulletin 67, 1989,pp.11-24.)\n\n","date":"January 23, 2014 at 7:48 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74223","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"This makes terrific logical sense dave… good summation. Thank you.\n\n","date":"January 23, 2014 at 8:36 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74225","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"How many times have I been moved to write “wise words” after something daveb has written? Oh, well, I’m doing it again.\nHowever, moving on:\nThe photo in Morgan’s paper shows two adjacent areas of backing cloth coloured in very different ways. The ‘missing corner’ section is brown, but the area which had been covered by the Raes sample is white. Something similar is apparent in Barrie Schwortz’s transmitted light photos too. Seeing as this photo cannot be easily reconciled with Miller and Pellicori’s UV setup and photos in their Biological Photography paper, I surmise that this photo is a visible light photo – albeit somewhat modified.\nDisappointingly, I cannot find a picture of the radiocarbon corner, including the backing cloth, taken after the sample was cut, but before the Holland cloth was replaced. Can anyone help?\nBecause I predict (dangerous), that the area that had been concealed under the radiocarbon sample area will be as white as the area that had been under the Raes sample area.\nHow to explain this? Was something smeared over that corner, and, for that matter, the burn holes as well, after the shroud had been stitched to the Holland cloth, to try to make the colours more uniform? Did it include a mixture of madder root dye and gum arabic? And was it applied with a cotton pad? Are shreds of cotton, dyed with madder and glued down with gum arabic, found along the edges of the shroud adjacent to the Holland cloth – including the edges of the burn holes?\nIt’s new, it’s revolutionary, and you read it here first, folks!\nNow, anoxie.\n1) I don’t think it has been satisfactorily demonstrated that cotton fibres are anywhere an integral part of the spinning of any of the thread in the the shroud, or of the weaving of the cloth.\n2) As the amount of cotton per thread varies, according to observer, from 2% to 100% in the radiocarbon area, I have no difficulty in supposing that fibres in different proportions can be found anywhere on the shroud.\n3) Had the cotton been an integral part of the threads being tested, the cleaning process would not have removed it. Being only a surface contaminent, it was picked off, vacuumed off, or shaken off with ultrasound.\nI agree with the speculative nature of much of my posting. Please point out my ‘misunderstandings’ however, if you really think there are any, so that I can improve my speculations!.\n\n","date":"January 23, 2014 at 7:06 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74217","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"That speculation should be very easy to prove/disprove. The old backing cloth, which I assume is kept somewhere safe, can be sampled from the exposed region and compared to the region that was covered by the shroud. If this contamination was easily removed by the cleaning technique, how do you account to the abnormal chi value and large variances in dates achieved by the same lab dating two ends of the sample?\n\n","date":"January 23, 2014 at 9:17 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74232","author":"Mike M","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Got it!!\n\nThe Raes sample area is clearly delineated at the bottom right, and the radiocarbon sample area across the top. These two areas are the same colour. The rest of the Holland cloth, which I claim was deliberately discoloured, probably soon after being attached to the shroud in 1534, is clearly darker.\nNow for some experiments with madder root and gum arabic…\n\n","date":"January 23, 2014 at 10:05 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74238","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Charles, \nRe # 70\nQuote: ‘On April 17, 1988, ten years after the S.Tu.R.P. project had been initiated, British Museum scientific director Michael Tite published in Nature[26] the “final” protocol:\nthe laboratories at Oxford, Zürich and Tucson would perform the test;\nthey would receive one sample weighing 40 mg., sampled from a single portion of weave;\nthe laboratories would receive two more samples, clearly distinguishable from the original one—a decision calling on the ethical dependability of the laboratories;\nsamples would be delivered to the laboratories’ representatives in Turin;\neach test would be filmed;\nthere would be no comparison of results (nor communication) between laboratories until the results be certified as definitive, univocal and complete;\nthe proportional counter method would not be used because it required gram quantities rather than milligram quantities of shroud material.’\nCotton aside, just how many of these procedures were followed?\n\n","date":"January 23, 2014 at 1:59 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74260","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"“Cotton aside, just how many of these procedures were followed?”\nSo typical of this site. When you have nothing useful to say, try putting someone else on the spot with a question.\n\n","date":"January 23, 2014 at 2:06 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74262","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Nothing useful to say? Are you saying Charles posted rubbish on this site?\n\n","date":"January 23, 2014 at 2:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74268","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hugh and Charles are the only two people right now posting anything useful  (well, “concrete”) on this site. The fact they are both Brits (like me) has nothing whatsoever to do with my observation. Good ideas and observations can come from anywhere on the planet. Right now it’s coming from a (probably) 150 mile radius.\n\n","date":"January 23, 2014 at 2:37 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74272","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"You appear to be the exception to that 150 radius theory.\n\n","date":"January 23, 2014 at 2:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74275","author":"David Goulet","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I am still waiting for two “concrete” responses.\n\n","date":"January 23, 2014 at 3:28 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74278","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Charles, the most expert and detailed analysis of the LANL findings is on YouTube, as I mentioned earlier, called “Shroud of Turin Ohio State University Villarreal Lecture.” Robert Villarreal appears very unused to public speaking, is hesitant and hopelessly unfamiliar with the projection equipment, but what he has to say is well worth persevering for. It is he who unequivocably describes the famous thread that came apart in the middle as cotton through and through, apparently butt-joined and stuck together with a ‘terpene resin.’ I do not dispute his findings, but I don’t think they provide any support for the patch hypothesis.\n\n","date":"January 23, 2014 at 2:31 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74271","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Yes, the key point is that expert restorers/ reweavers would never have used cotton  to repair linen when flax was equally available. So those who make a great play about the cotton either need to explain why they might have done so in this case or give an alternative explanation for its presence. If Raes was right about it coming in in ancient times in theiddle East then anywhere where we find cotton would be part of the original cloth. But perhaps he was not right in dating it to ancient times. Please can someone who supports the idea that the cotton is part of a reweave explain why it would have been used instead of flax!\n\n","date":"January 23, 2014 at 6:59 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74302","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"My understanding is that “shroud flax” was darker than  “fresh flax”, fresh cotton being less resistant to staining than freh flax would be a good substitute in this situation. I.e. to match the colour of the patch with the old flax.\n\n","date":"January 23, 2014 at 8:46 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74319","author":"Mike M","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Dyes apparently work better with cotton than with flax.\n\n","date":"January 23, 2014 at 10:22 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74327","author":"jmarino240","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Joe – so is only the cotton the reweave? You can’t have it both ways. If they decided to use cotton for the reweave instead of flax because it could be dyed  then we can ascertain the exact extent of the reweaving from the cotton that has been found on the Shroud as by your argument no  linen would have been used in the reweave because it would have been impossible to fit it in. If so the cotton would not have been in sufficient quantities to affect the radiocarbon date.Or was there a reweave using both linen and cotton- if so you need to explain why they used both.\nI really would appreciate a direct reply from you or someone else as there is a crucial unresolved problem so far as the cotton enthusiasts are concerned. Thank you .\n\n","date":"January 24, 2014 at 3:42 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74350","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Charles,   2 good sources to check and/or recheck are:   http://www.youtube.com/watch?v=YWyiZtagxX8 at  about the 26:00 mark and also  http://www.shroud.com/pdfs/benfordmarino2008.pdf.   Many thanks for all your insightful observations.\n\n","date":"January 24, 2014 at 7:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74474","author":"jmarino240","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I’m having that trouble too. Scientists like to try to falsify a hypothesis in order to demonstrate its veracity (or otherwise), but I’m not sure what hypothesis I’m trying to falsify!\n– The reweave was made of cotton because it was easier to dye.\n– The reweave was made of linen, but there were a few cotton threads mixed up with the thread because of the environment in which it was spun.\n– The reweave was made with a deliberate mixture of linen and cotton.\n– The LANL researchers reveal interesting truths about the reweave.\n– The LANL researchers were mislead by their instruments are their findings should be rejected.\n– Those parts of Robert Villarreal’s lecture which seem to concur with the patch hypothesis should be assumed correct, while those parts of it which dispute the patch hypothesis should be rejected.\nAny or all of the above…\n\n","date":"January 24, 2014 at 4:34 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74356","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Well, I just don’t think there was ever a reweave- and I side with Jackson, Flury-Lemberg and, dare I say it, Wilson on this- hence Hugh as well. I think the cotton is a chance contamination as there is no sigh of any thread despite some desperate attempts to find some. There is no evidence that the encrustations that Rogers spotted were dye- that was his own unsupported speculation.\nI understand that the British Society for the Shroud does not take a pro or anti authenticity stance. So as an objective editor i am sure that Hugh will present and welcome papers from both sides of the debate- in fact it would be betraying the aim of the society not to take sides if he did otherwise. It looks as if he will be able to commission some very interesting articles that will move some of these sterile debates on. Good luck to him\n\n","date":"January 24, 2014 at 5:18 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74360","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I have not seen anything 100% concrete, whether they come from Brits or not.\n\n","date":"January 23, 2014 at 2:45 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74276","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\nCharles Freeman :\n I just want to know what this analysis was, what is was done on, etc, as I , and perhaps others reading this discussion, know nothing about it and it seems very mysterious as no one has yet proved that cotton makes up more than a tiny, tiny part of the Shroud and that only in fibres.\n\nI thought you knew about LANL’s analysis.\nAnyway, ironically enough, they’ve been fooled by their tool… as the C14 daters were fooled by the precision of the measure neglecting the protocol sampling.\nRobert Villareal concluded the threads were made of cotton (no linen, no impurities), whereas Thibault observed microscopically that the same thread (R7) was overwhelmingly made of linen, but with a significant amount of cotton fibers (up to 20%), a part of which in the core of the thread.\n\n","date":"January 23, 2014 at 3:29 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74279","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\nLouis :\nI am still waiting for two “concrete” responses.\n\nRe-read Hugh Farey’s response to Annete Cloutier above, and her acknowedgement that she has been received a courteous, considered and detailed reply.  Look and learn all  those authenticists who operate by casual insinuation and trumped-up charges. Hugh’s responses are a model for us all (myself included).\n\n","date":"January 23, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74281","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"CB: Re-read Hugh Farey’s response to Annete Cloutier above, and her acknowedgement that she has been received a courteous, considered and detailed reply. Look and learn all those authenticists who operate by casual insinuation and trumped-up charges. Hugh’s responses are a model for us all (myself included).\nSorry, I would advise newcomers on the Shroud scene to begin at kindergarten, that is, start reading Ian Wilson’s 1978 Shroud book.\nAs for the responses of the person you mentioned, I have seen plenty of insinuations, however life teaches us that politics makes strange fellows.\n\n","date":"January 23, 2014 at 5:27 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74288","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I am following Ian Wilson’s views closely right now, on Hugh’s latest BSTS page,  especially re the Machy Mould that has received scarcely a mention on  this site, despite it focusing on “concrete” history of the Shroud, circa mid-14th century. \nForgive me if I take  no lectures about alleged “kindergarten” level while a major dimension of the Shroud’s early recorded history is ignored here. \nI responded to Wilson’s first post on the Machy Mould over a year ago, and an presently preparing  a response to his update.\nWhat Machy Mould do I hear you say?  Quite. That says it all.\n\n","date":"January 23, 2014 at 5:54 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74294","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Insinuations? “… from the person you mentioned ….” I hope I don’t insinuate. If I don’t agree with you, or think your conclusions unfounded, I hope I explain clearly where I think you are mistaken. I think “insinuation” is a perjorative word, and very much hope Louis is unable to substantiate his claim with even one example, let alone “plenty.”\n\n","date":"January 23, 2014 at 6:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74297","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"As early as Nov 1973, Gilbert Raes, a textile expert from Ghent, was given four samples, (two threads and two pieces): weft thread 12mm, warp thread 13mm, Piece 1 – 40mm × 13mm (main corner); Piece 2 – 40mm × 10mm (side strip); \nHe found: Piece 1, main cloth: warp–38.6 threads/cm, 16.3 tex (gm/km); weft–25.7 threads/cm; 53.6 tex (gm/km);  Piece 2, side strip: warp–18 tex (gm/km); weft – 25.7 threads/cm;  73.1 tex (gm/km).  \nHe discovered traces of cotton in Piece 1, “gossypium herbaceum”, Middle East origin; absent in Piece 2; An interim deduction was that the cotton was loom contamination and that therefore the cloth was of Middle East provenance.  Subsequently in 1978, the STURP team failed to find cotton elswhere within the cloth, apart from minor surface detritus. The conclusion therefore had to be revised that the area around Piece 1 was somehow unique. This is the area from where the C14 samples were taken. \nCharles: “Are you suggesting that these elusive invisible weavers were actually able to reproduce banding so perfectly that the STURP photographs did not show the reweave?”  Yes!! \nFirstly these “invisible weavers” are hardly elusive. One of the modern practioners consulted by Benford & Marino are identified as Mr. Michael Ehrlich of ‘Without A Trace, Inc.’ in Chicago. Its website (www.withoutatrace.com) may be consulted to discover the type of work they do. I recall that B&M also consulted others similarly engaged.  \nIn their 2005 paper “New Historical Evidence Explaining the “Invisible Patch” in the 1988 C-14 Sample Area of the Turin Shroud;” http://www.shroud.com/pdfs/benfordmarino.pdf , they provide a review of the history of weaving in Europe. They make a case for Savoy dowager duchess Margaret of Austria as carrying out the repairs. In her time 1520-60 there were some 30 to 40 master weavers prominently known throughout France, most quite capable in the skills of French reweaving. Others have suggested that the work may have been commissioned by Princess Clotilde following the 1868 exposition. Clotilde would have had access to such resources. Flury-Lemburg was apparently unaware of the art, notwithstanding her knowledge of ancient textiles. She clearly believed that such mending would have been apparent on the under-side, whereas the practice of “invisible reweavers” was to make the mending invisible on both sides. \nCSB: “So typical of this site. When you have nothing useful to say, try putting someone else on the spot with a question.” Louis’ question I believe was intended to be rhetorical. It is evident that few of the final protocols were followed. \nCSB: “Hugh and Charles are the only two people right now posting anything useful (well, “concrete”) on this site.” merely means “I refuse to believe anything not in accord with my own preconceptions!”\n\n","date":"January 23, 2014 at 4:40 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74284","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Daveb, the some of the concrete came from you and is that because I put Charles in a “spot”, as Colin said?! Now what about the rest of the concrete? Is it being imported in England from NZ?\n\n","date":"January 23, 2014 at 5:47 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74293","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"“I refuse to believe anything not in accord with my own preconceptions!”\nUnlike you, DaveB, I am a published scientist. Had my life’s biochemical and nutritional  research been based purely on preconceptions, I would not have my extensive archive of published work, most of it highly cited.  \nEven in the area of science/religion,  some of us are always open to new ideas*. Indeed, that is what some of live for – outside of the warmth of friends and family – i.e. new insights. new perspectives, and once in a while (hopefully)  the mind-blowing variety. The only mind-blowing perspective on the Shroud was Secondo Pia’s iconic “positive – negative” image – which I have gone to some lengths to explain as a happy accident of producing a scorched-on negative image.\nSo spare me your  putdowns Dave. They do not stand up to objective analysis. My science has always been targeted – towards verifiable fact. One day you and others will have to confront the facts.\nNope, I recognize this is not the most eloquent or persuasive of defences – but then that’s not our strong suit –  we scientists – in defending ourselves. Some of us prefer to let the criticism pass over us – to let the passage of time determine who was right, who was wrong. Thanks to the Daves, Klotz’s. Clements etc I for one can no longer be bothered to discuss specifics here.  The Shroud for me is  a done deal – a medieval  image/visual metaphor of a slow-roasted Templar –  probaby Jacques de Molay no less- last of the Grand Masters- take it or leave it.\n*Science is about the world of ideas. Few, outside of science, understand what is meant by “the world of ideas”.\n\n","date":"January 23, 2014 at 5:24 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74286","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Wow Colins… just have to say I don’t understand your logic let alone your “science”.  Joe Nickels tried to reproduce the Image on linen.. he got the shadowy results somewhat like the TS’s Image, but no 3-D information!… You say you reproduced an Image on linen with 3-D information?  Why wasn’t it published?  Did you also produce the same 120 marks of scourges, the wounds on the head, side, feet, wrists so we can clearly see this and say Wow:  this must be the Jesus of the Gospels… until you can be so creative, I really must say that I can’t get into your science or logic about the Shroud.\n\n","date":"January 23, 2014 at 6:58 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74301","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Colin… just wanted to add that I’ve followed your web page and you’re very colorful but while you can refute the date with the 1988 C14 testing of the fabric… still, I remain unsure about the medieval theory with the unique and enigmatic formation of the Image that wreaks of a 1st century Roman crucifixion.\n\n","date":"January 23, 2014 at 7:12 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74306","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Sorry about the absence of science and logic. I just post occasionally on my stream of consciousness blog detailing faltering attempts to reproduce the Shroud image. There’s still a way to go admittedly (but precisely how far cannot be gauged  while there is no access for bona fide  researchers like myself to the actual Shroud, something that I hope Pope Francis or his closest advisers will rectify if reading this). I only need a quick peek, with a hand lens, and permission to ruck up a fibre or two, and maybe take a tiny scraping of blood to confirm the presence or absence of bilirubin and/or protoporphrin IX. \n  I did research on bilirubin at the University of Pennsylvania Hospital Medical School a few years before STURP was assembled, and would have been only too happy to have been consulted re  methodology and would have been able to advise how it could be detected conclusively, rather than relying on inadequate colorimetric and spectroscopic tests that are non-specific. There’s simply no alternative to chromatography and mass spec if one’s wanting to persuade sceptical professionals (like myself) that bilirubin is present on the Shroud given its sensitivity to light and photodegradation.\n\n","date":"January 23, 2014 at 7:27 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74308","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Thanks Colin… quick reply and explains your position succinctly.  Just wondering about further testing… with the thymol used to preserve the TS instead of argon do you really think that the absence or presence of bilirubin and/or protoporphrin IX could be determined?  I understood that the thymol alters the chemistry extensively.\n\n","date":"January 23, 2014 at 7:35 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74310","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Colin: I am still waiting for the concrete you promised on behalf of two commenters whose spokesman you chose to become. Why is it taking so long to come? After all, you said it falls within a 150-mile radius in England.\n\n","date":"January 23, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74290","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"All this endless debate could be resolve if the Vatican could allow a new C14 dating of many samples (tiny ones) taken from various locations on the Shroud.\nIt strikes me to see how many pro-Shroudies are against the idea to perform such a test…  Makes me wonder if their faith in the authenticity of the Shroud is just a mirage…\n\n","date":"January 23, 2014 at 5:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74292","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hullo Anonymous,that seems to be a sweeping statement as there are many in the pro-authenticity camp waiting for fresh C14 dating, including those who believe the relic demonstrates the Resurrection. If you read “The Shroud: the 2000-year-old-mystery solved” you will understand why this may not necessarily bring correct results.\n\n","date":"January 23, 2014 at 9:05 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74321","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Colin Berry:\n“I am following Ian Wilson’s views closely right now, on Hugh’s latest BSTS page, especially re the Machy Mould that has received scarcely a mention on this site, despite it focusing on “concrete” history of the Shroud, circa mid-14th century.\nForgive me if I take no lectures about alleged “kindergarten” level while a major dimension of the Shroud’s early recorded history is ignored here.\nI responded to Wilson’s first post on the Machy Mould over a year ago, and an presently preparing a response to his update.\nWhat Machy Mould do I hear you say? Quite. That says it all.”\nReply: It is obvious that newcomers have to begin with Ian Wilson instead of depending on spoonfeeding. The “Brit” historian never said he was proclaiming gospel truth and has always been open to corrections that could help fill the gaps. But where is the concrete you promised on behalf of others?\nAlso, since you insist that it is Jacques de Molay we see on the Shroud, let us keep science aside for a while and turn our attention to history. Have you read the Chinon Parchment? Why did Philippe le Bel suppress the document and swiftly dispatch the Templar Grandmaster to the stake? Why did he have his drummers around the stake?\nMost important of all, since you imply that de Molay was scorched, can you let us know where he is buried?\n\n","date":"January 23, 2014 at 6:17 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74296","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Forgive me, Louis, but I feel you are making insinuations. It seems that you are waiting for some “concrete” from Colin, “on behalf of two commenters.” I’m guessing, because you seem reluctant to name us, that you mean myself and Charles Freeman. Well, don’t be shy. I’m here, and very willing to give you something concrete to work on.\n1) For instance, I claim that the Discovery Channel video “Unwrapping the Shroud” is pitifully misleading when it underplays a commentary about a UV photo of one end of the Shroud by displaying a Quad Mosaic photo of the other end.\n2) For instance, I claim that all the quad mosaic photos taken by the STURP team show substantial areas of blue across the top half, which I deny can represent differences in chemical composition.\n3) For instance, I claim that three different scientists of unimpeachable integrity have come up with totally different estimates of the amount of cotton to be found in the ventral ‘missing corner’ area of the Shroud which are inconsistent with a single reweaving operation.\n4) For instance, I claim that the Holland cloth is bright white under the Shroud, but has been stained on its exposed areas in an attempt to match the Shroud more closely.\nAre those statements concrete enough? Now, here’s a challenge for you. Take my statements one by one (numbered for easy reference) and say whether you agree with me or not, and if not, why not.\n1) Is the Discovery Channel video misleading or not? Does it show the wrong picture or not?\n2) Do the quad mosaic pictures have blue areas or not? Do the blue bands represent different chemcal composition or not?\n3) Do Fanti, Heimburger and Villarreal give different admixtures of cotton in the so-called patch reweaving or not? Are their findings consistent?\n4) Is the Holland cloth different colours beneath and outside the Shroud or not? Is it painted to match the Shroud or not?\nThere you go, Louis. Concrete. Be bold. Be brave. Stop insinuating and face up. Am I right or am I wrong?\n\n","date":"January 23, 2014 at 6:52 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74300","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"1/ it’s Discovery Channel.\n2/ forget quad mosaic.\n3/ \n\nanoxie :\nAnyway, ironically enough, they’ve been fooled by their tool…\nRobert Villareal concluded the threads were made of cotton (no linen, no impurities), whereas Thibault observed microscopically that the same thread (R7) was overwhelmingly made of linen.\n\nFTIR spectrum of old cotton blended with old linen +/- impruities from crust ? Hard to interpret,\n4/ yes, it looks dirty.\n\n","date":"January 24, 2014 at 2:22 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74344","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hugh Farey, #94\nQuote:\nInsinuations? “… from the person you mentioned ….” I hope I don’t insinuate. If I don’t agree with you, or think your conclusions unfounded, I hope I explain clearly where I think you are mistaken. I think “insinuation” is a perjorative word, and very much hope Louis is unable to substantiate his claim with even one example, let alone “plenty.”\nReply: Webster’s says insinuation is “the act of saying something bad or insulting in an indirect way”. I did not receive any explanation ADDRESSED TO ME where it was clear where you thought I was mistaken in a recent comment. What I saw was an insinuation about something I had written when commenting on the point of view of another Shroudie to whose website Dan had drawn our attention.\nI do not like commenters posting comments while underestimating someone else’s intelligence. Unfortunately a “group mind” has been formed on this blog and it is being contagious, newcomers on the Shroud scene inheriting the characteristics of some of the older Shroudies, part of an “inner circle” which decides what can be published, what should be suppressed, what should be ignored, doors only open to chummies who dance to a pre-determined tune. Why be surprised that many scholars whose contributions could be of immense importance have refused to enter the realm of Shroud studies? Are they blindfolded? Is their intelligence also being underestimated?\nTo go more deeply into this “group mind” we have Gustave le Bon, who influenced Freud. I dislike using capital letters when commenting but have to do so to drive my point about (bad) insinuations. As the new editor of the BSTS newsletter I think you should be aware that what is written on this blog is monitored in Turin and Rome, and at the rate things are going no one should be surprised that petitions to the Pope are ignored.\n\n","date":"January 23, 2014 at 7:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74307","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Mr. Farey, let me tell you the following: it is not advisable to concentrate on the microscope, be one-track minded and neglect other studies, there is a lot to learn from humanities. I was not referring to any of the items you listed in # 106. As editor of the BSTS newsletter you should remember what you posted on the blog, I’m not going into spoonfeeding.\n\n","date":"January 23, 2014 at 7:50 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74312","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\nAnnette Cloutier :\nThanks Colin… quick reply and explains your position succinctly.  Just wondering about further testing… with the thymol used to preserve the TS instead of argon do you really think that the absence or presence of bilirubin and/or protoporphrin IX could be determined?  I understood that the thymol alters the chemistry extensively.\n\nIt’s the easiest thing in the world to detect bilirubin and protoporphyrin IX by a combination of TLC and mass spectrometry – but neither was used (apparently) by Adler or Heller.  What’s more, neither accompanied the STURP team to Turin, so were reliant on others’ specimens (sticky tape etc) and explanations for how or where the samples were taken and subsequently protected.\nAs for thymol, I have already challenged  (on this site) Rogers’ claim that thymol could react chemically with cellulose, allegedly invalidating  the C-14 dating , have invited folk to consult with the American Chemical Society for a second opinion. Yes, I know thymol has a phenolic OH group, and yes, I know that cellulose has -OH groups that could theoretically be available for making ether  linkages by chemical condensation  with elimination of water, but a lifetime of working in biochemical labs tells me that reaction would not go in practice- not through chance contact under normal environmental conditions.\n\n","date":"January 23, 2014 at 7:53 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74313","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Thanks Colin… hope you get your opportunity sooner than later to do that most needed ultimate test!\n\n","date":"January 23, 2014 at 8:31 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74318","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Righto Colin, after you convince us Shroudies that Drs Adler and Heller were wrong you will also have to tell us where Jacques de Molay was buried after he was scorched.\n\n","date":"January 23, 2014 at 9:17 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74322","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\nLouis :\nRighto Colin, after you convince us Shroudies that Drs Adler and Heller were wrong you will also have to tell us where Jacques de Molay was buried after he was scorched.\n\nOne of my earliest recollections of this site was being invited to provide technical background for why I rejected Adler’s bilirubin ‘story’ which I was told would be sent to the SSG. I duly obliged, but have since heard nothing, absolutely nothing. One of its members later queried (on this site) my view that the colorimetric diazo test was not specific for bilirubin, being given by phenols etc, and I told him how the test might have been done so as to make it specific (TLC of ethyl anthranilate azo pigments). That was followed by total silence, then by the news that STERA’s President is STILL telling TV audiences that bilirubin was for him the clincher after having it explained to him personally by Alan Adler. Repeat: the bilirubin story is almost certainly a fantasy, and is not based on authoritative analytical data. Given that Rogers deployed mass-spectrometry on Shroud blood, e.g. to detect hydroxyproline, then why wasn’t that same fingerprinting technique used to confirm the presence of bilirubin? Why was reliance placed on Adler and Heller’s spot colour tests or spectral data, neither of which on their own constitutes hard evidence, and are at best merely suggestive.\nJacques de Molay?  Do I need to remind you that he was first slow-roasted, and then reduced to ashes? So why are you referring to his place of burial? There was no burial – so it’s not clear what the purpose of your comment was. Are you being deliberately obtuse?\n\n","date":"January 24, 2014 at 6:02 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74364","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Well, I’m truly sorry if I’ve offended you, Louis, but now I’ve no idea what you’re talking about. If you think I have insulted you in an indirect way I’m appalled at my lack of sensitivity, as it was most certainly unintended, and apologise unreservedly.\nNow can I assume that you agree with all my concrete points above?\nOh, and please, don’t worry about my relationship with Rome or Turin. I have no doubt whatever that if my contributions to this blog are indeed being monitored, there are huge smiles of relief that at last an independent scientist, with no particular axe to grind in favour of or against the shroud, is showing an interest.\n\n","date":"January 23, 2014 at 8:21 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74317","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"That’s all right, Hugh, no hard feelings. The reference was to the Jospice Mattress. I have not yet read your comments in # 106 but will do so shortly when more time is available as these require careful scrutiny.\nWhat worries me is the relationship of the realm of Shroud studies with Rome and Turin, which could have been better. Your approach to the Shroud is correct and I am sure the authorities are looking for good science, so it will depend on you to back your comments with hard evidence.\n\n","date":"January 23, 2014 at 8:56 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74320","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Pope Francis, if you are reading this blog, please allow new testing of the Shroud. I’ll put a little something extra in the collection basket — anything to get us over this soul-sucking impasse.\n\n","date":"January 23, 2014 at 11:54 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74333","author":"David Goulet","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"David, I wouldn’t pray too hard for this request… the Shroud will always mean something different no matter what for each individual:   every pope, religious, scientist, businessperson, historian, artist, writer, et al  because of its unique mystery.  It’s good we can debate it.  It’s good there is this forum.  It’s good we can share information about it all so freely without having to rupture our purses.\n\n","date":"January 24, 2014 at 12:08 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74335","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Note for Colin:\nRe tests for bilirubin & protopophyrin IX, etc: As I understand it, the reasons why John Heller resorted to physics tests, was that attempts to dissolve bloodstain material had been unsuccessful.  During the 1969-76 secret commission under Cardinal Pellegrino, Prof Frache (expert in forensics, blood, a Waldensian Protestant, Modena U) & Prof Filogamo (expert on blood analysis, Turin U) had attempted to analyse the blood-stains. I believe the solvents attempted were: acetic acid, oxygenated water, glycerin of potassium. However the granules could not be dissolved, so that their attempts were unsuccessful. John Jackson had reported this to John Heller at some later date when he was recruiting him for the STURP project. At that time Heller’s Institute staff had been working with blood porphyrins and had learned how to make them fluoresce. The fact that attempts to dissolve blood-stain samples had failed seems to have been the determining factor to resort to “microphotospectrometry”.  \nI should like to know if the tests that you propose require the samples to be dissolved, and if so can a suitable solvent not used by Frache & Filogamo be identified that can still preserve the integrity and value of the test.  Or do the tests that you propose be achieved with the bloodstains still in solid state?\n\n","date":"January 24, 2014 at 7:18 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74367","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"There was a discussion last November on this site to which I contributed some comments, subsequently made into a post on my own site.\nhttp://shroudofturinwithoutallthehype.wordpress.com/2013/11/11/heres-what-alan-d-adler-could-should-have-done-to-investigate-the-porphyrins-of-those-anomalous-shroud-bloodstains/\nYes, I know about the solubilization problem, but was highly critical of the resort made to hydrazine (“a chemist’s sledgehammer”) given that it’s a powerful chemical reagent (both a base and a reducing agent) that can/could  chemically modify the tetrapyrroles that one is trying to isolate and identify. One is supposed to use INERT solvents for that purpose.\nMy suggestion was to use a Folch solvent partition (mainly chloroform and methanol in the lower organic layer, and mainly methanol and water in the upper aqueous layer) but to do it in the presence of a cationic detergent, e.g. cetyltrimethylammonium bromide, which is very good at taking organic anions, even quite polar ones, into the organic layer, from which it can then be concentrated by solvent evaporation and then spotted onto TLC plates or injected into a GLC or HPLC  column.  Since protoporphyrin IX in blood is an organic anion, due the presence of two propionic acid side chains, as are the bile pigments (bilirubin etc) derived from it by ring scission, so I’m fairly confident that model systems based on aged, degraded blood would confirm that tetrapyyroles could be separated from ‘gunge’ with that extraction medium with no risk of chemical modification.\n(There are uncertainties regarding the iron and the strength of its chelation by the porphyrin, but let’s not get bogged down in too much detail).\nSo much for the technical detail. But there’s a wider issue here. Scientists should not go making confident claims to have confirmed that blood on the Shroud is definitely of human origin, when it’s clear from the small print, to which you allude, that analytical difficulties had been encountered, necessitating resort to extreme measures more suited to the chemical than biochemical laboratory.  Oh, and Alan D.Adler was NOT a blood specialist. He was a synthetic organic chemist, specializing in porpyhyrins. I frankly do not understand why he, with limited physiological and biochemical know-how,  was invited to be a member of STURP, and in any case, neither he nor John Heller accompanied the team to Turin, being content to work on samples that had been harvested by others.\n\n","date":"January 24, 2014 at 8:08 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74369","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I wonder what blood solvents Tryon and Mattingly used in 1993 when they confirmed Adler’s find of AB+ male DNA.\n\n","date":"January 24, 2014 at 5:34 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74458","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Colin says:\nJacques de Molay? Do I need to remind you that he was first slow-roasted, and then reduced to ashes? So why are you referring to his place of burial? There was no burial – so it’s not clear what the purpose of your comment was. Are you being deliberately obtuse?\nReply: I am not being obtuse, I’m looking for the rationale behind your comment. If I understood you correctly, de Molay was first slow-roasted, wrapped in the Shroud, unwrapped and then tied again to the stake to be reduced to ashes. Is that what you are saying?\nI would dismiss this theory, coming as it is from Baigent, filled with hatred of Catholicism, clutching at straws in attempts to do away with belief in the divinity of Jesus. He has written another book to get Jesus out of the way and has been laughed out of court even by non-Christians.\n\n","date":"January 24, 2014 at 8:21 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74371","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"“If I understood you correctly, de Molay was first slow-roasted, wrapped in the Shroud, unwrapped and then tied again to the stake to be reduced to ashes. Is that what you are saying?”\nNope. I have never said that. Why impute to me absurd claims that I have never made?\n\n","date":"January 24, 2014 at 8:50 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74374","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"So please explain how it was done.\n\n","date":"January 24, 2014 at 9:00 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74375","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Colin’s following the theory that the Shroud made on a heated bas relief of some kind and the resultant image was intended to represent a slow roasted Templar. He is not claiming that the actual roasted body was used. That would be tinfoil-hat territory.\n\n","date":"January 24, 2014 at 9:15 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74377","author":"David Goulet","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Thanks David. I’m glad someone round here takes the trouble to familiarize themselves with others’ claims before passing judgement.\nHere’s a summary that I wrote back in April 2012. Please note the last sentence, Louis.\nSUMMARY: Hypothesis: the scorch-like image on the Shroud of Turin, at least the initial Mark 1 version, was not of the crucified Jesus Christ, nor 1st century AD. It was of much later medieval origin, in agreement with the carbon-14 dating of the linen, and was that of a Knight Templar, probably Geoffroi de Charney, reputed to be the uncle of the similarly  named Geoffroi de Charny, first known owner of the Shroud, which he displayed in the small village of Lirey.\nDe Charney-with-the – “e”was hideously and slowly tortured and executed by slow roasting in 1314 on the orders of King Philip IV of France, along with other Knights Templar, notably Jacques de Molay.  The evidence is to be found by closely examining the Lirey badge, a pilgrim’s  lead-cast souvenir, recovered from the Seine in 1855 close to the site of the Templars’ execution. The badge shows a Shroud-like depiction of a man who bears little or no resemblance to Jesus Christ, and who appears on close scrutiny, the knees especially, to have been roasted to death, not crucified, with a grill-like structure on the edge of the badge previously (mis?)interpreted as an “open tomb” (see Ian Wilson’s Historical Notebook). The artist who produced the Mark 1 version of the Shroud on which the Lirey badge was closely modelled was probably commissioned by  (?)nephew Geoffroi de Charny  to find a way of  pointedly marking his uncle’s gruesome death and the extinction of his Templar line in a deliberately  ambiguous manner, one that could be mistaken by the casual observer for crucifixion, and not bring further retribution to the holder. To do that he chose an unusual but not unknown pyrographic art form – scorching an image onto linen using hot metal or ceramic templates, probably bas-relief as a visual metaphor for death by slow incineration.\n\n","date":"January 24, 2014 at 9:20 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74379","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"First, I want to say that I have not read much of the current debate, so I hope I will not address an issue that was already raised…\nI have a good question for Hugh :  In your recent BSTS paper, why didn’t you address all the findings and conclusions that were draw by Al Adler in two papers he wrote during the 1996 and 1998 (“Updating Recent Studies on the Shroud of Turin” and “Further Spectroscopic Investigations of Samples of the Shroud of Turin”), which seems to demonstrate that there was an important chemical difference between the C14 sample of 88 and the main body of the Shroud.  I read your interesting paper last evening and I was very surprised to note that you did not addressed any of Adler’s findings and conclusions versus the C14 dating of 88…  \nIs it because Adler never officially linked his findings with the idea of an invisible reweaving?  In the end, never mind the reason, I think it is a mistake on your part to have completely ignore Adler’s findings and conclusions regarding the C14 corner because it is a fact that he was the very first to scientifically challenge the C14 dating results with any kind of credibility by analysing some threads that came from the area where the C14 sample had been taken.  Also, you must know that his findings were often used by the defenders of the invisible reweaving hypothesis to back-up their conclusions…\nSub-question:  Is it possible that, based on Rogers and Adler’s findings, there could have been a strong contamination of the C14 zone, without being related to a possible invisible reweaving?  In other words, would it be possible to build a different hypothesis that would be based on those findings in order to explain a possible 1300 years shift in the dating result?  In the end, is it possible that the C14 corner was highly contaminated (so much that it would have shifted the result from the first to the 13th Century) and that such a high contamination came from something else than a invisible reweaving?\nFinally, it’s also interesting to note that your own highly suspicious conclusion concerning the reweaving hypothesis is pretty much the same as the one that was draw in 2009 by Pierre de Riedmatten, who is the president of the Montre-nous ton visage association in France.  Are you aware of the paper he wrote that year, which was centred around the C14 dating of 88 with a strong rebuttal of the reweaving hypothesis?\n\n","date":"January 24, 2014 at 9:28 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74381","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hugh, I can’t agree with this hypothesis… (1) a scorch with iron would produce a smooth surface of the fabric scorched… flattening the fibrils of the linen… the fibrils of the Shroud are neither flattened nor refined to a smoothed shiny surface as an iron would do.  (2) Others notably John Jackson, Joe Nickel, et al tested this scorching hypothesis many times… and could not reproduce the 3-D information nor the X-ray of the (teeth, hands, etc ) information.\n3) No bodily decomposition was found on the Shroud… 4) the prominent wounds on the Shroud cannot be reproduced by painting nor drawn in by any genius artist to match in 3-D information and negative quality.  If you think for a second that Geoffroi de Charney could have reproduced his uncle’s imagine to look like his Lord Jesus Christ… such a feat of photography should be able to be done today.  But it cannot be replicated now, and common sense would say that it wasn’t done in the 13th, or 14th centuries!\n\n","date":"January 24, 2014 at 11:19 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74397","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hi Annette. Is this the De Charnay hypothesis? Credit where it’s due; it’s not mine, it’s Colin’s. But I will reply to your specific points, if you like.\nI, Colin and Thibault Heimburger have spent a lot of time on the scorch hypothesis and there is more to do. At the moment I’ve gone off it, but may be reconverted after further experiment!\n1) I don’t think anyone suggests trying to ‘paint’ the Shroud with a hot iron! It would be a very clumsy way of doing things, almost certainly burn holes right through, and, as you say, flatten the weave noticeably (although who’s to say it might not have recovered since then?)\n2) Both Colin and I have demonstrated that a very good 3D effect can be achieved using an appropriate model with which to make contact with the cloth. Although intensity drops off very sharply when contact is lost, considerable variation in intensity can be achieved by variation in pressure. A hot brass face pressed downwards onto a cloth supported by a soft pad gives darker scorches where the nose is in contact than where the cheeks are, for example.\nThe scorching experiments by the STURP team did not address this because they were not designed to.\nAs for teeth and X-ray fingers, I’m sorry but I don’t see them, and don’t believe they are there.\n3) Eh? I’m not sure whether bodily decomposition is relevant here. There is a hypothesis (described in http://www.shroud.com/pdfs/n78part11.pdf) by Giovanni Fazio that the warmth of a dead body might have selectively stimulated chemical reaction on a pre-prepared sheet, but even he does not associate it with biological decomposition.\n4) The wounds on the Shroud can easily be reproduced by painting, do not necessarily reflect 1st century Roman crucifixion practices accurately, and have no 3-D information or interesting negative quality. I think you are confusing the bloodstains with the image.\nAs for the overall hypothesis, I’m not persuaded either, but I certainly wouldn’t ignore it. Stranger things have happened.\n\n","date":"January 24, 2014 at 2:21 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74420","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Colin, # 130. So Geoffroy de Charny produced a shroud depicting his ancestor claiming that it was the Shroud of Christ? That clashes with the historical data obtained by Wilson, but one will have to wait for the paper you promised to write.\nAll I will say now is that Baigent, Lomas and Knight produced similar speculation, contributing to nothing. As a Brit you probably know that Lord Ripon took a very courageous decision, defied Queen Victoria, and did a lot of good.\n\n","date":"January 24, 2014 at 10:02 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74385","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I have to say, I find your comments here increasingly ill-informed and of scarcely any relevance to my own interest in the provenance of the the Shroud. For that reason, I will leave you to your own deliberations. However I cannot let that comment of yours go unchallenged, namely that what I have said clashes with the historical “data” (your term) obtained by Wilson. According to Wilson’s recent update on the Machy Mould, there are scarcely any data on the Lirey period, and such as exists is self-contradictory.\nHere are his own words (followed by a link to the 7 page pdf):\n“As Shroud historians have long recognised, the big problem about\nthe Lirey expositions is that the surviving documentation about them is so\nfragmentary and so seemingly contradictory. Thus there is no mention of\nthe Shroud in the documents relating to the foundation of the Lirey\nchurch in 1353. Then in May 1356 we have local bishop of Troyes Henri de\nPoitiers on record as warmly approving an unspecified ‘cult’ – often\nassumed to be showings of the Shroud – that Geoffroi had instituted at\nLirey. Only four months later Geoffroi was dead on the battlefield of\nPoitiers, he and all others in France having been far too preoccupied with\nbattling invading English for any Shroud showings to have been staged\nduring that time. And yet from 1389 we have the famous memorandum of\nBishop Pierre d’Arcis, a successor to Henri as Bishop of Troyes, claiming\nthat ‘thirty-four years or thereabouts’ earlier (i.e circa 1355) Bishop Henri\nhad taken great exception to some showings of the Shroud that were being\nheld at Geoffroi de Charny’s Lirey church, and on diligently investigating\nthe matter, Henri had apparently found evidence of fraud, duly putting an\nend to any expositions being held in Lirey for well over three decades.”\nhttp://www.shroud.com/pdfs/n78part7.pdf\nSo, not content with mangling my claims for the Shroud, you have now treating Ian Wilson’s with the same cavalier disregard, and then attempting to turn it all into a theological rant with your bizarre reference (presumably) to Lord Ripon’s switch from Anglicanism to Catholicism.  \nSorry, I have better things to do right now than try and make sense of your comments, or correct your errors and misunderstandings.\n\n","date":"January 24, 2014 at 10:59 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74393","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Colin… I can’t believe your still using the old: But Bishop Pierre d’Arcis excuse that the Shroud was a painting and he knew the painter!  Everyone knows or should know by now that the Shroud had it’s substitute shrouds… (notably at St. Etienne’s in Besancon (cf. Dan Scavone Daniel Scavone, Shroud the Missing Years, Ohio Conference 2007, and\nShroud.com/scavone.htm)… D’Arcis was concerned that Lirey was getting a good influx of cash whilst his diocese was suffering from all the fervor created by the exposition of the Lirey Shroud.  He may have known the painter of the substitute Shroud at St. Etienne’s but he surely didn’t know the artist of the Shroud at Lirey.\n\n","date":"January 24, 2014 at 11:35 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74398","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hugh, right, the DeCharnay/ DeMolay roasted Templar hypothesis is Colin’s… but please explain your reply:\nThe wounds on the Shroud can easily be reproduced by painting, do not necessarily reflect\n1st century Roman crucifixion practices accurately, and have no 3-D information or interesting negative quality.  \nWhy should they have  3-D information  or negative quality information… The wounds are there… what an artist to show such accuracy on legs, and torso back and front!  Those scourging’s are there and most sindonologists agree it was inflicted by a Roman flagrum… I don’t know that an artist could have painted them in… we’ve ruled out painting when it comes to the Image.    \nI’m wondering how you can be so attentive to this blog.  It’s mind boggling how well you respond to everyone… I am grateful.  I’m wondering too if there’s a chance we could have the luxury of meeting you in St. Louis at the October 2014 Shroud Convention.\n\n","date":"January 24, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74462","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Ooh, flattery will get you anything.\nStill,\nWhen I say the wounds can be reproduced by painting, I mean they are fairly easy to simulate using paint, blood or a mixture, although until what they were actually made of is established, it will be impossible to replicate their chemistry. It was their shapes I was thinking of.\nMuch to most people’s surprise, we have very little idea of what a Roman flagrum (or flagellum) looked like. None have ever been found, and there are a few illustrations on coins and the like, all different. It was obviously some kind of thonged whip, but how many thongs or tips, and what the tips might have been made of, is anyone’s guess (see Mel Gibson’s Passion film). It may be that the marks on the shroud exactly match a Roman flagrum, or it may be that a painter just came up with a good idea. The two designs of Roman flagrum that copies have often been made of and photographed were based specifically on measurements made of the Shroud itself, and do not even resemble the ancient illustrations.\nMuch to most people’s surprise, we have no idea whether people were nailed through the palms, hands or lower arms. Although elaborate demonstrations with real corpses have shown how a hanging body would be too heavy for a dead weight on the arms, many Roman descriptions mention a sedile or seat, sometimes described as a horn sticking out, on which the victim sat, removing all the weight from his arms altogether. It may be that the nails through the wrists thing exactly match a Roman crucifixion, or it may be that a painter just thought it might be a good idea (perhaps he experimented on corpses too!).\nMuch to people’s surprise, blood does not trickle down the outside of hair. It oozes out from the scalp and mats it into a bloody mass. Google news pictures of terrorists bombs for confirmation. To be fair, some people have supposed that the blood flows down the side of the face were imprinted on the shroud from the cheeks, whereafter the shroud realigned itself horizontally to receive the image of the hair, which was thus out of register with the blood flows. However this does not account for the trickles which appear at the back of the head.\nMuch to people’s surprise, blood does not zigzag out of a stab wound to the chest, it flows straight down. To be fair, some people have surmised that the bloodflow from the chest occurred after the body had been taken down from the cross and the original blood had been washed off, and stained the cloth as the body was wrapped or draped with it. This is quite a reasonable scenario.\nYou mentioned earlier that the wounds could not be “drawn in by any genius artist to match in 3-D information and negative quality.” All the blood flows are now fairly uniform pinkish stains, and do not display any particularly interesting features in terms of any relationship between their colour intensity and distance, which is the basis of the 3D effect, or in terms of their negativity (they just turn green).\nDelighted to be of assistance!\n\n","date":"January 24, 2014 at 6:53 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74465","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Nothing will be stated till your paper is ready and posted. I have not used theological rant, merely shown a link between Baigent, Lomas and Knight and Lord Ripon, but nothing to do with Anglicanism.\nDon’t forget: you told Dan that he was quasi-Catholic and Hugh Farey had to to tell you (elsewhere) that he is Catholic. Why? Who has a theological or anti-theological agenda?\n\n","date":"January 24, 2014 at 11:18 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74396","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Your attempts to draw me into your mire of half-truths, misunderstandings and total irrelevancies will not succeed. When you have something concrete to say on the subject of the Shroud’s provenance I’ll start listening (not before).\nOh, and I haven’t a clue what you are referring to re a “paper in preparation”. I don’t do formal papers. I’m a blogger who does informal postings, the kind that invite and display comments, presently with nothing new to say (but may respond to Ian Wilson’s interesting BSTS posting in December on the Machy Mould).\n\n","date":"January 24, 2014 at 1:31 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74411","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Let me tell you something: I am not indulging in half-truths and show no total irrelevancies.\nWhen you cannot answer a query you say you have other things to do and come back after a while without answering the query. Did you answer my query above? No, you didn’t. Why are you interested in who is Catholic, who believes in what? That is irrelevancy. You still have time to check the link between Baigent, Lomas, Knight and Lord Ripon, who broke the link.\nAs for misunderstandings, it is you who are not clear. I was referring to the paper, which you now call response, you said you would write.\n\n","date":"January 24, 2014 at 2:11 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74419","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"(Mouthing his same old authoritative mantras) Dr. Ig. Co.SBerry boasted: “I am a published scientist. Had my life’s biochemical and nutritional research been based purely on preconceptions, I would not have my extensive archive of published work, most of it highly cited. […] The Shroud for me is a done deal – a medieval image/visual metaphor of a slow-roasted Templar – probably Jacques de Molay no less- last of the Grand Masters- take it or leave it.” \nIf this is all “the concrete” and “new” scientific and archaeological idea “the Brit High-Priest” of biochemistry and nutrition can come up with and offer us after hours and hours of studies and research (2011-2013), all his “science” and “archaeology” only pertain to the fictitious realm of very cheap ideas and mere figments of the imagination of a man losing it. Methinks he relies too much on his pseudo-authoritative “postconceptions” and just really can’t discriminate between a fantasy and a fact when it comes to analyze Shroud photographs or that of the Lirey Pilgrim Badge.\nA mountain lion among the cats among the pigeons\n\n","date":"January 24, 2014 at 11:49 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74404","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Hi Max. So you have returned with heavy artillery?\n\n","date":"January 24, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74407","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Anonymous, thank you so much for your very pertinent comment, which sent me scurrying back to Adler’s papers! Sadly, the second, ‘Further Spectroscopic Investigations of Samples of the Shroud of Turin,’ seems only to be available in his book “The Orphaned Manuscript” which is completely unobtainable. Even more sadly, that particular chapter is not accessible via Google books.\nThe other paper you mention, ‘Updating Recent Studies on the Shroud of Turin,’ is available, at http://www.sindone.info/ADLER.PDF, but makes slightly disappointing reading in that it refers to, but does not explain or describe, various experiments that might be relevant.\nAdler characterises the radiocarbon area as “in an obviously waterstained area just a few inches from a burn mark.” This is slightly disingenuous, I feel. Benford and Marino rather precisely demonstrate that the edge of the nearest waterstain passes through the ‘riserva’ part of the sample rather than the dated section, and, of course, most of the Shroud is just a few inches from a burn mark. A quick sketch of the area of the Shroud gives precious little choice of where else to take the sample from, and I often wonder where other people would have taken it from if they had found themselves in Giovanni Riggi’s place.\nThe only actual finding described by Adler in this article is summarised by Figure 1, which shows FTIR spectra for various threads. Adler says: ‘The patterns seen in Figure 1 are all distinguishably different from one another clearly indicating differences in their chemical composition.” I’m afraid I disagree with this. The differences between the ‘image,’ ‘non-image,’ and ‘radiocarbon warp’ spectra are qualitative rather than quantitative, and seem well within the limits of experimental variation. Villarreal discusses this very well in his Ohio lecture.\nAdler goes on to claim that “peak frequency analysis” shows that the radiocarbon and Shroud fibres are different, but without showing any data as evidence, and also mentions the “scanning electron microbrobe data that showed gross enrichment of the inorganic mineral elements in the radiocarbon samples.” I believe he may be referring to his discovery that 2% of the radiocarbon sample was aluminium, but again, he gives no data.\nFinally he says that “the radiocarbon sample fibres appear to be an exaggerated composite of the waterstain and scorch fibres.” I don’t even know what this means, but it seems to be contradicted by his own Figure 1 (where the radiocarbon sample is more like the non-image sample than either the waterstain or the scorch), and his aluminium finding (which is not present in either the waterstain or the scorch).\nOf all of this it seems that it is his aluminium finding which is most quoted by those looking for support for the patch hypothesis. Alum, it seems, was a common medieval mordant for madder root dye, and fits in rather better with Rogers’s finding than his own gum arabic, which is a sticky glue which dissolves when wet.\nAll in all, I think that the aluminium finding is relevant to my article, and agree that I should have included it. I would have if I had known about it!\nHowever, as has been commented elsewhere, there is no way in which 16th century surface contamination could be responsible for changing a 1st century date into a 13th century one. The proportions of the two must be about 60% medieval to 40% ancient to achieve the mixture, and even the dullest of observers must have noticed that amount, even with a hand lens.\n\n","date":"January 24, 2014 at 1:54 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74413","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"For Adler’s book, some years ago, I’ve bought a copy of it via the Holy Shroud Guild.  You should contact Giorgio from the Guild’s website about that and see if he still got a few copies to sell. This book is a must for any Shroud researcher.  I’ll come back soon with a nice question for you following your above comment.\n\n","date":"January 24, 2014 at 2:42 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74424","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"“However, as has been commented elsewhere, there is no way in which 16th century surface contamination could be responsible for changing a 1st century date into a 13th century one. The proportions of the two must be about 60% medieval to 40% ancient to achieve the mixture, and even the dullest of observers must have noticed that amount, even with a hand lens.” \nBut it is not merely “surface contamination” if it was a reweave! Benford & Marino had proposed that it was Savoy Dowager duchess Margaret of Austria that commissioned the reweave around 1505. At this time they claim there were some 30 to 40 prominent master weavers in France, most of them familiar with the process. However another possible candidate for the reweave would be Princess Clotilde following the 1868 exposition. She is known to have carried out repairs including replacing Valfre’s backing cloth with a red silk one. Significantly, 1868 was the last exposition permitted to be hand-held (Why? Resulting damage to the cloth when exhibited in this manner?) Subsequent expositions had to be carried out in a frame! A 19th century date would have resulted in a greater skewing of the C14 date than 16th c. would have.  Perhaps Hugh can provide the percentage of 19th c. contamination required to skew a 1st c. date to the 13th c. ??\n\n","date":"January 24, 2014 at 3:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74439","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Perhaps Hugh can provide the percentage of 19th c. contamination required to skew a 1st c. date to the 13th c. ??\nDave, we discussed this long ago:\nhttps://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/#comment-46168\nhttps://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/#comment-46169\n\n","date":"January 24, 2014 at 3:47 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74440","author":"O.K.","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Here’s my other question for Hugh: I understand that your paper was centered on the invisible reweaving hypothesis, but based on the findings of Adler and Rogers (which are hard to discard at first sight, except if we believe they analyzed unrelevant samples or C14 samples that were contaminated after 88 – these 2 scenarios seems highly unlikely to me), wouldn’t it be possible to think that there could have been a dating error of 13 centuries or so in 88 that would have been caused by a MIX of some surface contamination (or even a real tiny invisible reweave) AND some unknown contamination that affected the inner part of the linen fibers (thus provoking a change in their C14 content)?\n\n","date":"January 24, 2014 at 3:24 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74428","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"In other words:  Wouldn’t it be possible to think that the important contamination that could have provoke a drastic change in the C14 result could be much more complex than just one single cause like an invisible reweaving done during the 16th Century?  Why not a combination of factors (including maybe even the fire of 1532).\n\n","date":"January 24, 2014 at 3:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74430","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"In the end Hugh, can’t we at least agree that, based on Adler and Rogers findings, it seems pretty obvious that the corner that was dated with the C14 method in 88 was somewhat not representative of the main body of the Shroud?  In my mind, the question that remains to be answered is :  How different (both physically and chemically) this part of the Shroud really was from the main body of the cloth and is it possible that such a difference is enough to account for an erroneous dating result of 13 centuries or so?\n\n","date":"January 24, 2014 at 3:32 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74434","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"In my mind, it is almost impossible to answer this question.  That’s why I still maintain that the best thing the Vatican could do to get closer to the truth regarding the Shroud’s true age is to allow a new C14 dating done more properly than the one of 88, which should include many samples taken from various places on the cloth and with the use of proper sampling and decontamination methods (the best ones the lab could use).\n\n","date":"January 24, 2014 at 3:37 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74436","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Sorry.  I should have wrote “the best ones the LABS could use”…  Would not be a good idea to ask only one lab to date the Shroud…\n\n","date":"January 24, 2014 at 3:38 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74437","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\nLouis :\nLet me tell you something: I am not indulging in half-truths and show no total irrelevancies.\nWhen you cannot answer a query you say you have other things to do and come back after a while without answering the query. Did you answer my query above? No, you didn’t. Why are you interested in who is Catholic, who believes in what? That is irrelevancy. You still have time to check the link between Baigent, Lomas, Knight and Lord Ripon, who broke the link.\nAs for misunderstandings, it is you who are not clear. I was referring to the paper, which you now call response, you said you would write.\n\nSorry, I can’t make head nor tail of any of this. You must try to express yourself more clearly. I am not a mind reader. What “query”? Why are you so hung up on what you call a paper in preparation? I merely said (in passing) that I was thinking of doing a response to Ian Wilson’s most recent Machy paper. The latter  was mentioned as an example of a ‘concrete’ contribution to Shroud literature, in contrast to all the interminable nitpicking on the radiocarbon dating (to which my answer is – bravo to Hugh and Charles for addressing the (‘concrete’) specifics re alleged patching etc – but if folk here don’t like the 1260-1390 dating, then there’s a simple remedy –  lobby the Vatican to have it re-tested with an upgraded protocol. JUST STOP BANGING ON INCESSANTLY –  REPEATING YOURSELVES OVER AND OVER AGAIN.\n\n","date":"January 24, 2014 at 3:34 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74435","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Another idea well worth pursuing. Firstly, although I am certain that what I have previously described as “gunk” (i.e. surface contamination including any wandering cotton fibres, wax, silk, oils, paint and any other debris) would have been removed by the cleaning process, I cannot be sure that a fast dye would be. I have some madder root soaked linen drying in my laboratory as I speak, mordanted with alum. I shall give it a week to dry, then wash it with acids and alkalis as described in the Nature paper to see if it all disappears or not. Watch this space!\nHowever, even if I didn’t wash it all away, its tiny mass compared to that of the cloth itself would mean that its effect on the carbon content of the shroud would be trivial and quite possibly not measurable within the experimental accuracy of the dating process.\nAnother idea might be simply to increase the number of C14 atoms within the molecular structure of the linen itself. This is difficult to do just by burying the sample in charcoal, (you could shake it off) but was thought to be possible if carbon atoms from, say, the gas carbon monoxide were to diffuse into the cloth, either reacting with it or simply exchanging carbon atoms by some atomic diffusion process.\nGood plan, and it was tried out, but didn’t work. See “https://c14.arch.ox.ac.uk/embed.php?File=shroud.html” for Chrstopher Ramsay’s explanation. What’s more, it was predicted not to work as no such effect has been observed on any other artifact.\nNevertheless, one experiment does not constitute a definitive rebuttal, and there is a (pretty faint) possibility that the circumstances uniquely surrounding the Shroud could have led to a C14 enrichment. Ray Roger’s, for example, thought that the thymol with which the Shroud has recently been treated as an antibiotic might interact with the linen (making subsequent radiocarbon dating impossible), and if something similar to that had happened in the past, then it might have distorted the date appropriately. Thymol itself has not been observed to have any effect on radiocarbon dating, as it happens, so all is not lost from a new sampling point of view.\nFire is unlikely to have had any effect. For a start many archaeological radiocarbon dates have been satisfactorily established using charcoal from cooking fires, and secondly part of the dating process involves the complete combustion of the sample under test.\n\n","date":"January 24, 2014 at 4:29 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74448","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Intervening posts have appeared while I was writing the above!\nI can’t agree that any parts of the linen of the shroud are likely to be sufficiently different in terms in terms of carbon content that any two random threads would date more than 100 years apart, let alone 1000, I’m afraid, and that includes the image and burn hole edges. Somewhere in a safe in Turin are bags of charred threads pulled away by Mechtilde Flury-Lemburg. They would do very nicely!\n\n","date":"January 24, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74449","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"But what if most of the C14 corner was not originally “part of the linen of the Shroud”?  What if most of the C14 corner would be composed of medieval cotton AND medieval linen?\nI just ask this in order to push your reflection.\n\n","date":"January 24, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74450","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Well now we’re back where we started. If the C14 corner was so threadbare that only one third of the original material remained, and if it were rewoven with 16th century threads so that two thirds of the area were now 16th century and one third still original, then yes, the area woud date to the 13th century. However, to my mind, and in spite of some interesting observations about dye, mordant, gum, vanillin and cotton threads, I do think there is sufficient evidence for such a hypothesis to be accepted without serious reservations.\n\n","date":"January 24, 2014 at 4:53 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74451","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"One thing’s for sure:  this corner is somewhat different in his physical and chemical content and this should be enough to put high suspicion on the accuracy of the 88 dating.  In such a context, a new C14 dating is truly needed to settle the record straight.\n\n","date":"January 24, 2014 at 5:07 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74454","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Freudian slip!! I mean, of course, I do NOT think the patch hypothesis can be accepted without serious reservations!\n\n","date":"January 24, 2014 at 6:55 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74466","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Right, most of us are familiar and easily understand Benford & Marino’s 2000 Orvieto hypothesis, and the 2005 reinforcement given by Ray Rogers.  When Hugh writes about Adler’s study of the  C14 testing area being like the rest of the Shroud… I (and I dare say most of us) become lost once again in this “on the fence”  posture.\n\n","date":"January 25, 2014 at 11:08 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74547","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Well isn’t that fun? What good is a detective story if it’s obvious who did it in Chapter One?\n\n","date":"January 25, 2014 at 11:53 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74551","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"The query is still there, but it is not important. I am more interested in reading any response to the Machy paper you may write.\nThe Vatican is not in a hurry to decide anything about fresh carbon dating of the Shroud, and that is because the Church does not believe that faith depends upon relics, if some Shroudies do that is their point of view. There are millions of Protestants and Orthodox Christians and even Catholics who are not interested in relics. It does not seem that the 1988 CD test decided the issue once and for all and IW’s last Shroud book has a very balanced point of view.\n\n","date":"January 24, 2014 at 4:54 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74452","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"#157 was addressed to Colin.\n\n","date":"January 24, 2014 at 4:57 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74453","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Ian Wilson now thinks that the Machy Mould was used to produce a later, down-market version of the Lirey badge. His reasoning is to my way of thinking quite up-market. I for one am pleased at his change of mind, having  a year ago (almost) developed an entirely independent line of thinking that also put the Machy Mould-derived badge after the Lirey one, now in the Cluny Museum, but for entirely different reasons,i.e. as a clever marketing exercise that morphed a Mark 1 shroud depicting a barbecued Templar, scorched into the linen from a metallic template or similar,  into the one we know today. But I doubt there will be many folk on this site, yourself included, who will welcome my continuing pursuit of this line of thought, so I’ll stop here. \nContinue to fight the good fight (Hugh and Charles), no matter where your thoughts may lead. It’s the quality of those thoughts that some of us appreciate, not the final destination. Those who accuse us of seeking merely to confirm preconceptions clearly have not the slightest idea as to what makes a genuine researcher tick.\n\n","date":"January 24, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74459","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I welcome any pursuit of the truth in Shroud research, but am wary when it comes to those who demonstrate preconceptions.\n\n","date":"January 24, 2014 at 6:08 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74463","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"My main point regarding the C14 dating is simply to say that there are too many serious pieces of evidence that suggest it was taken from a somewhat anomalous zone (which is not hard to believe at all when we take time to look at the area in question and its history of being handled so many times), which can only lead to one rational conclusion:  Let’s make another round of C14 dating, but much more properly this time…\n\n","date":"January 24, 2014 at 5:39 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74460","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"The sampling area is clearly anomalous, and unrepresentative of the whole, never mind the details.  No other area was sampled.  To assert the truth of an hypothesis on such ambiguous evidence would never be accepted in any other scientific endeavour.  It merely demonstrates wishful thinking on the part of skeptics and anti-authenticists, not to say their poverty of scientific reasoning. Precisely the same poverty of thought that Yves Delage encountered from the Science Academy in 1905, dominated as it was then by so-called free-thinkers and agnostics. Some things never change!\n\n","date":"January 25, 2014 at 3:45 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74509","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"So why did John Jackson and Flury-Lemberg not spot the anomaly, and Wilson agree with them that there was no reweaving?\nI still want to clarify the problem of the cotton. There simply is not enough cotton used to sway the carbon-14 date so if there was a reweave that swayed the date it could not have been as a result of a cotton reweave. But why would they have mixed cotton and linen in the reweave?\nI suppose they might have found some perfectly matched linen in order to do the reweave, but then, with a deadline to meet, it ran out!  ‘Darn’ said one invisible weaver to another , I might not be able to see you, but I think we are going to be in real trouble if we don’t finish by midnight, that is when we become visible again, so we will just have to fill in the bits we haven’t finished with cotton and dye them to match – and just hope nobody notices!!\n\n","date":"January 25, 2014 at 4:14 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74512","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"My point is that it is bad science to assert any kind of conclusion from such a poor sampling protocol. Just reflect on the stringent sampling protocols for drug testing for instance. For some 10 years I was engaged in designing sampling systems for a significant Corporate’s Internal Audit function, together with various other sundry applications of Applied Statistics. So I know more than a little about drawing conclusions from sampled data.  The laboratories may have had a good grip on the theoretical and technical physics aspects of Carbon 14 dating. But it is only too obvious that they had little idea on how a proper and persuasive scientific conclusion can be reached when they accepted such a poorly constructed sampling regime for their testing, peer reviews notwithstanding.  Of the three persons mentioned, only John Jackson was any kind of a scientist. Whether any of Jackson’s previous research work had depended on his being able to design appropriate sampling protocols, I am unable to comment. For any further understanding of the problem, I can only recommend any elementary Applied Statistics text book. It does turn out that the sampled area in this case was anomalous, and merely illustrates the folly of it.  If it had turned out that the date reached conclusively proved a 1st century date, these very same scientists would have been the first to object at the sampling regime.\n\n","date":"January 25, 2014 at 6:11 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74520","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I’m interested in daveb’s comment (although I appreciate that it is a commonly held view, not just his), that “To assert the truth of an hypothesis on such ambiguous evidence would never be accepted in any other scientific endeavour.”\nA fairly similar problem to the Shroud arose in deciding where to take the samples from two garments and a pillow associated with St Francis in 2005. The details are in ‘AMS Radiocarbon Dating of Medieval Textile Relics: the Frocks and the Pillow of St Francis of Assisi,’ M. Fedi et al, Science Direct, 2009. (Behind a paywall, I’m afraid).\nBeginning with “dating of materials connected to faith is always a delicate matter,” which has a famiiar ring to it, the authors discuss where, exactly, they took their radiocarbon samples from.\n“Samples were taken following the advice of a textile conservator, who examined the manufacture of the relics. No darns or patches were present.” Sounds familiar?\n“Anyway, [interesting adverb…] we decided to sample several pieces from each frock.”\nFrom one ‘frock,’ “supposed to have covered St Francis just in the moment of his death,” the team took seven samples, about 1cm2 each, three from the hem, two from the end of one of the short sleeves, one from the side, and one from slap in the middle of the back. The frock was made of several pieces of wool sewn together, and the samples came from different pieces. The samples were washed in an ultrasound bath, then in hydrochloric acid, but not in sodium hydroxide as it was thought detrimental to wool.\nOne of the hem samples and the one from the side fell to pieces during cleaning and couldn’t be used. The others gave dates of between 1155 and 1225, a 70 year spread which was assumed consistent. This compares with the Shroud findings (12 samples from the same place) of between about 1225 and 1315, a 90 year spread.\nSt Francis died in 1226, which fitted this frock (and the pillow, as it happens) well. The other frock was dated to about 1300, and was therefore considered not a genuine relic, although the authors say, rather charmingly, that “these data are not to be read in a negative way, since the result of its dating can anyway be a valuable element for the reconstruction of the history of religion during Middle Ages.”\nThe circumstances of the two radiocarbon datings make interesting comparison, I feel. One important point is that, even in 2005, a 1cm2 area is considered a minimum sample for accurate dating, whereas in 1988 every laboratory subdivided its sample further and tested each one separately. No wonder their experimental error bars were so much bigger, especially those of Tucson, which dated roughly 0.2cm2 pieces.\n\n","date":"January 25, 2014 at 6:48 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74524","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"There were a couple of sentences I found most interesting in this  paper:   “In any case, the most important aspect of this work, from the point of   view of physicists working in the field of AMS dating, is the methodological  one  concerning sampling strategy.  First, sampling should always be done in   agreement with and under the guidance of scholars and people involved in  the  historical or archaeological problem.  In addition, whenever possible,   collecting several samples from the object to be dated (as we did in the case  of  the two frocks) is definitely the right approach in order to reduce the   possibilities of ambiguities.”\n\n","date":"January 25, 2014 at 6:49 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74595","author":"jmarino240","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\ndaveb of wellington nz :\nThe sampling area is clearly anomalous, and unrepresentative of the whole, never mind the details.  No other area was sampled.Charles Freeman :\nSo why did John Jackson and Flury-Lemberg not spot the anomaly\n\nBecause they did not look for it ?\nHas Dr Flury Lemberg ruled out the presence of cotton ? Any quotation ?\n\n","date":"January 25, 2014 at 6:57 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74525","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"‘Because they did not look for it ?’ I can’t speak for John Jackson but I do know that many people claim to respect his opinion as someone who has examined the Shroud in minute detail.\nYou clearly have not read Flury-Lembeg’s article (‘The Invisible Mending of the Shroud, the Theory and the Reality’)  because she refutes the reweaving theory from her own intensive examination of that corner of the Shroud.\nThe areas for the radiocarbon dating  that were examined microscopically found some fibres of cotton which were removed. They were a tiny proportion of the whole and would not have much affected the dating if they had been left there, if there were indeed a different date from the main part of the cloth.So far as I know no one has examined the cloth in sufficient detail to see whether there are cotton fibres scattered around the rest of the Shroud. I would assume that some would be found but  if Gilbert Raes was right and the cotton came in from a previous use of the loom more cotton fibres might be found in the parts of the Shroud woven nearest the loom.\nWe still have the problem that adding up all the cotton fibres that have been found that they are not enough to affect the R14 date so I cannot see why the presence of these cotton fibres is at all relevant to the debate.  I suppose that if fibres are found in other parts of the cloth and embedded in the yarn, it might be argued that this suggests a medieval date for the weaving as we know cotton and flax were processed in the same medieval workshops but let’s leave that until there has been a microscopic examination of the Shroud.\nI notice I have some leads from Joe Marino follow up and wonder whether they will answer my basic question why are these minute cotton fibres relevant to the carbon 14 dating? Please, please someone answer me!\nI don’t think Gabriel Vial’s findings from his own examination of the cloth have been given the prominence they deserve. Hugh has noted them. It is that there were wide discrepancies in the thickness of the yearn used in weaving the Shroud- this was certainly not a top level cloth as Wilson seems to believe. If you look at a top level linen table cloth or napkin you can see how the yarns are the same thickness. In comparison the Shroud is rough and ready and simply for this reason there are anomalies throughout the original weave. Vial also noticed places where the weavers had made mistakes. Please read his article in the 1989 CIETA Bulletin. As i said before there is no perfect area of the Shroud that can acts a model for judging the rest.\nSo I leave the question: Why is the presence of cotton fibres on the Shroud an issue so far as the carbon-14 dating is concerned?\n\n","date":"January 25, 2014 at 1:55 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74560","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"The sample was taken from an anomalous site, also the dirtiest part of the Shroud, so invisible darning cannot be ruled out and it remains one among several hypotheses about how the carbon dating results may have been skewed.\n\n","date":"January 25, 2014 at 7:48 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74529","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I have now reread Joe Marino’s  and Sue Benford’s paper and seen the I Tube again. There is some vague talk about cotton fibres being used in the reweave but nothing about the percentage of the sampled  cloth that they make up. An impression, backed by no evidence at all, is left that the reweave was largely cotton but we know from the microscopic examination of the C14 samples that is not the case. Both Arizona and Oxford were able to spot the tiny number of cotton fibres and remove them. I am afraid I am more convinced that ever that the cotton thesis is a red herring- there was never enough cotton in the C14 sample to make the slightest difference. If you want to sustain the ‘cotton reweave’ claim, please provide us with a PERCENTAGE, with supporting evidence, of how much cotton was in the samples actually tested in the labs- you can base it on material from the surrounding area if you want.\nOver to anyone who can enlighten us.\nBTW Joe –  as someone who has actually been inside one of the pyramids, I love Sue’s theories about pyramids, especially as related to the Shroud.\n\n","date":"January 25, 2014 at 2:24 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74562","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Charles what about Raes’ 1973 study of the corner mostly cotton… did he have a percentage?\nWhat about Flury-Lemberg saying that the seam was that of the Herodian Jews of Masada (1st century Jews). So wouldn’t the seam be contrary to the 13th century hypothesis and the 1988 C14 dates?\n\n","date":"January 25, 2014 at 3:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74571","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Charles,   The Chemistry Today article ends:   The exact ratio of patch versus original threads is not determinable  by photographic analysis alone; however, a well-supported estimate,  based upon weave-pattern changes, has been posited (2) reflecting  approximately 60 percent of the C-14 sample consisting of 16th Century  threads while approximately 40 percent were 1st Century in origin. The  radiocarbon date was calculated using the percentage of observed 16th  Century (representative date used AD 1500) versus 1st Century  (representative date used AD 75) weave types appearing in the Oxford sub  sample. The radiocarbon calculations were derived using the following  mathematical calculations and in consideration of the above hypothesis. The  question asked was what percent cal AD 1500 + percent cal AD 75  radiocarbon would be required to derive an average age of cal AD 1210  (~Oxford results)? Using standard Measured Conventional Before Present  equivalents, the formulas for calculation become 0.9003 = (x) (0.9558) +  (1-x) (0.7851). Solving for X (where X ~ percent cal AD 1500 carbon  present) X = 0.6749 ~ 67 percent.   Dr. Thibault Heimburger posted recently that he would responding soon to   Hugh’s BSTS article on the invisible reweave theory, so I’m looking forward  to  his post.   Glad you liked Sue’s theory regarding the pyramid.  She was a  remarkable  woman.  I lost her almost 5 years ago and still miss her  terribly.\n\n","date":"January 25, 2014 at 4:03 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74574","author":"jmarino240","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"C.F: “You clearly have not read Flury-Lembeg’s article (‘The Invisible Mending of the Shroud, the Theory and the Reality’) because she refutes the reweaving theory from her own intensive examination of that corner of the Shroud”\n“Intensive examination”. False. She did not look carefully at the C14 corner because she was not there in 1988. And her paper is full of mistakes re Rogers’ findings. She obviously did not understand anything about Rogers’ claims. She did not look (to my knowledge) at the threads of the border of the C14 sampling area in 2002 with a microscope. She did not took any piece of threads and she did look at them through a microscope.  \nCF: “The areas for the radiocarbon dating that were examined microscopically found some fibers of cotton which were removed”.\nFalse. Oxford found a “rogue fiber” at the surface of his sample. Probably the labs did look quickly at the surface of the samples with a microscope. No more. I repeat: it is ABSOLUTELY impossible to know anything about the number and the location of cotton fibers in a thread without separating the fibers of the threads. This was NOT done by the labs. \nCF: ” An impression, backed by no evidence at all, is left that the reweave was largely cotton but we know from the microscopic examination of the C14 samples that is not the case.”\nMicroscopic examination? By whom ? By the labs? No. Did they remove some threads of their samples? No. Did they divide the threads into fibers ?. No. Did they perform any kind of chemical investigation?  No.  \nCF (171): ” I still want to clarify the problem of the cotton. There simply is not enough cotton used to sway the carbon-14 date so if there was a reweave that swayed the date it could not have been as a result of a cotton reweave. But why would they have mixed cotton and linen in the reweave?”\nProbably because cotton is much more able to retain the dye found by Rogers than linen.\nAnd: CF (177): “If you want to sustain the ‘cotton reweave’ claim, please provide us with a PERCENTAGE, with supporting evidence, of how much cotton was in the samples actually tested in the labs- you can base it on material from the surrounding area if you want.”\nPlease, (re)read\nhttp://www.shroud.com/pdfs/thibaultr7part1.pdf\n(and parts 2 and 3)\nIt is a complete misunderstanding of the problem.\nThe anomalous C14 corner is made of many “modern” (16 th century ?) blended cotton/linen THREADS mixed with few ancient linen threads (from the Shroud main part).\nIn the “modern” blended threads both linen and cotton fibers are “modern”.\nWe know that because of the lignin/vanillin Wiesner tests.  \nI will not re-write my paper quoted above.\nI’ll post tomorrow my answers to some of your comments but please re(read) my previous paper on shroud.com carefully.\n\n","date":"January 25, 2014 at 5:32 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74585","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"No one is denying that there are cotton fibres ( N.B. for the hundredth time, not threads), around and Gilbert Raes assumed that they were prevalent in his edge because they may have drifted in from a loom used for weaving cotton. We know that cotton and flax weavers worked together in the medieval period so the presence of tiny cotton fibres is hardly surprising.  Thibault has analysed several of the Raes threads and has done valuable work at confirming  that there are cotton fibres around but, as he shows, they only form a small part of the total linen. He provides no more than speculative evidence that there are cotton fibres further into the Shroud, into the area where the radiocarbon samples were taken. He seems to have found a thread or two that may have had the fibre drift in before or during the spinning, and so give the impression of being embedded.\n(N.B. Thibault- your articles don’t come up on my Mac but they do on my wife’s Mac! This was the case some weeks ago too so I transferred your articles then onto my computer.)\nI am not surprised Flury-Lemberg misunderstood Rogers’ article- it is very difficult to understand largely because it is so speculative and and has so few references to back his assertions, especially on vanillin. He suddenly talks about ‘pristine replacement material’ without saying what independent evidence of his own he has for this. No wonder, Flury-Lemberg took him, and Benford and Marino to task, asking simple questions such as ‘if there is reweaving ,where did it begin and end or was it an identical path to that taken out for the sampling’.\nBut I come back to the question I asked at the beginning: what percentage of cotton is assumed to be in theC14 samples. Although I cannot find the evidence to back this in his articles ( please quote such evidence if I have missed it), Thibault has at least come up with a  clearly stated conclusion.\n‘The anomalous C14 corner is made of many “modern” (16 th century ?) blended cotton/linen THREADS mixed with few ancient linen threads (from the Shroud main part).\nIn the “modern” blended threads both linen and cotton fibers are “modern”.’\n‘Many ‘ and ‘few’ seems rather vague but if we take  Benford and Marino’s 60 per cent new, 40 per cent old (which seems to give rather too high a figure for ‘few’), Thibault seems to be asserting that 60 per cent of the threads in the radiocarbon sale are blended linen/ cotton threads. I hope he will give fuller evidence for this blend and not why it has never been spotted by anyone.\n Thibault  asked : ‘Microscopic examination? By whom ? By the labs? No.’\nI could refer him to an article by somebody called Thibault Heimberger that reads as follows ‘In 1988, the textile experts looked at this area with binocular microscopes and later the laboratories [by this I assume he means all three of them]  performed some observations with the microscope on their samples.’\nIs it really possible that three laboratories missed the blended threads? They were ,after all, just testing what they had been given and there would have been no skin off their noses if the Shroud had proved to be a linen/cotton blend- after all such cloths were often made with alternative cotton and linen threads and they would simply have reported it as such.\nHas anyone else seen them?\nIf there are blended threads in the C14 samples , what percentage of the blend is cotton? We return to Thibault’s analysis of one Raes thread, R7.\n‘Conclusion: there are many cotton fibers in the outer part [sic] of R7. However, it must be noticed that the total number of cotton fibers (23/96=24%) is certainly an overestimation because 1) it is difficult if not impossible to count exactly the number of fibers gathered in groups 2) many of the cotton fibers are small [sic] and certainly come from long cotton fibers which had been broken (perhaps during the handling process: cotton fibers are obviously more brittle than flax fibres).’ \nSo if 24 per cent is an overestimation, let’s settle for 20 per cent, still probably too high. There is no evidence to support this at all but let’s assume that R7 is typical of the blended threads that Thibault argues make up the ‘modern’ repair. If we take the ‘modern’ threads at 60 per cent of the sample, and the cotton as making up 20 per cent of the ‘modern’, then we have a cotton content of some 12 per cent of the total sample. Yet, this was missed by the microscopic examination Thibault accepts that the labs undertook.\nThen there is the problem of why 20 per cent of cotton (and remember this is probably way too high) and no more was added to the linen. What would be the point of this if the majority of the addition was linen?\nI go back to my original conclusion that the cotton had drifted in as fibres, some of which were present when the flax was being spun, but overall the cotton is a red herring so far as radiocarbon dating is concerned because it formed too small a proportion of the total to sway the date in any significant way.\n\n","date":"January 26, 2014 at 6:49 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74648","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"\nHugh Farey :\nOoh, flattery will get you anything.\nStill,\nWhen I say the wounds can be reproduced by painting, I mean they are fairly easy to simulate using paint, blood or a mixture, although until what they were actually made of is established, it will be impossible to replicate their chemistry. It was their shapes I was thinking of.\nMuch to most people’s surprise, we have very little idea of what a Roman flagrum (or flagellum) looked like. None have ever been found, and there are a few illustrations on coins and the like, all different. It was obviously some kind of thonged whip, but how many thongs or tips, and what the tips might have been made of, is anyone’s guess (see Mel Gibson’s Passion film). It may be that the marks on the shroud exactly match a Roman flagrum, or it may be that a painter just came up with a good idea. The two designs of Roman flagrum that copies have often been made of and photographed were based specifically on measurements made of the Shroud itself, and do not even resemble the ancient illustrations.\nMuch to most people’s surprise, we have no idea whether people were nailed through the palms, hands or lower arms. Although elaborate demonstrations with real corpses have shown how a hanging body would be too heavy for a dead weight on the arms, many Roman descriptions mention a sedile or seat, sometimes described as a horn sticking out, on which the victim sat, removing all the weight from his arms altogether. It may be that the nails through the wrists thing exactly match a Roman crucifixion, or it may be that a painter just thought it might be a good idea (perhaps he experimented on corpses too!).\nMuch to people’s surprise, blood does not trickle down the outside of hair. It oozes out from the scalp and mats it into a bloody mass. Google news pictures of terrorists bombs for confirmation. To be fair, some people have supposed that the blood flows down the side of the face were imprinted on the shroud from the cheeks, whereafter the shroud realigned itself horizontally to receive the image of the hair, which was thus out of register with the blood flows. However this does not account for the trickles which appear at the back of the head.\nMuch to people’s surprise, blood does not zigzag out of a stab wound to the chest, it flows straight down. To be fair, some people have surmised that the bloodflow from the chest occurred after the body had been taken down from the cross and the original blood had been washed off, and stained the cloth as the body was wrapped or draped with it. This is quite a reasonable scenario.\nYou mentioned earlier that the wounds could not be “drawn in by any genius artist to match in 3-D information and negative quality.” All the blood flows are now fairly uniform pinkish stains, and do not display any particularly interesting features in terms of any relationship between their colour intensity and distance, which is the basis of the 3D effect, or in terms of their negativity (they just turn green).\nDelighted to be of assistance!\nYou’re right!  I was much surprised!  What’s the 10% your giving to the Image having been formed to?  (Something like an alien communication from a parallel Universe?  Something which may have formed the Image on Guadalupe or Manoppello?)","date":"January 25, 2014 at 3:54 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74573","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"JMarino #179\n “Dr. Thibault Heimburger posted recently that he would responding soon to Hugh’s BSTS article on the invisible reweave theory, so I’m looking forward to his post.”\nLet’s hope the response materializes, and that when it comes, it’s as a guest posting or comment, and not one of those Planet Zog pdfs that invite or admit no comment, far less riposte, yet earn pride of place in this site’s margin listings\n\n","date":"January 25, 2014 at 4:20 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74577","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Colin,\nI will choose the mean I want for my answer. Pdf or guest posting….\nIt depends on the length of my paper, the size of the pictures etc..and Dan’s agreement.\nI do not understand why you hate pdf papers !\nThe advantage is that you can find a pdf paper much more easily than any kind of guest posting. \nI am sure that if you want to write a pdf paper on this blog, Dan will agree.\nIn any case, I am and I will remain free.   \n.\n\n","date":"January 25, 2014 at 6:01 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74589","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Were you to find a means of allowing  comments onto the end of a pdf, Thibault, then fine, I might agree. Until then, the pdf format is a means of insinuating adverse opinion, usually critical of others, sometimes implicit, sometimes explicit,  while remaining immune oneself from criticism. Your critique of the scorch hypothesis names no names, but is so obviously directed at me. \n Sorry, but it’s not the modern way of doing things. Internet interactivity is king. One has to move with the times. Forget pdfs etc. They are so yesterday, nay, so last century.\n\n","date":"January 25, 2014 at 6:16 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74591","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Thibault Heimburger: “We know that because of the lignin/vanillin Wiesner tests.”\nHere we see the difference between a medic – relying on his “tests” – and a scientist – for whom “tests” mean nothing unless or until independently validated. \nRogers’ vanillin tests have never been independently validated. Why should they be, when chemical processes, unlike radionuclide decay,  are subject to environmental conditions? Get off your high horse, Thibault. You are seriously irritating.\n\n","date":"January 25, 2014 at 5:50 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74588","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Environmental conditions? Yes.\nRogers took into account those environmental conditions.\nAnd Adler performed the same tests on samples from various locations on the Shroud.\nNo lignin/vanillin in Adler’s tests.\nHow do you explain the whole sets of experiments ?\nWhy not to write something about the lignin/vanillin experiments? (taking into account all the available data)\n” Get off your high horse, Thibault. You are seriously irritating.”\nIrritating to you. Certainly.\nYou are certainly an expert re bilirubin (to be discussed). Nothing more.\nI’ll not answer to insults.\n\n","date":"January 25, 2014 at 6:52 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74598","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Lignin? Vanillin? Who knows what oxygen and/or other oxidants (modern day ground-level ozone?) can do over the centuries, or even years to lignin, destroying its vanillin, sometimes slow, sometime fast We have no baseline data, no reference data. \nRogers was always dubious to me, for a whole number of reasons (lack of PhD training, career focus on chemical explosives, significant but not Shroud-related,   for unwisely accepting a thread or two of surreptitiously acquired shroud thread or two  for post-retirement home experimentation, publishing in his “own” journal, to say nothing of that curious and arguably partisan  anti-scorch dossier, hydroxyproline etc)  \nSorry. Not impressed. OK, so it’s a gut -feeling thing, but in the absence of solid scientific data, that’s what one so often has to rely on where shroudology’s so-called science is concerned – gut feeling. Gut feeling says that the case for post-88, post radiocarbon-dating  stick-in-mud authenticity is based on pseudo-science.\nI’ve just this minute posted something new to my own site, but won’t give a link or fear of being accused of self-promotion.\n\n","date":"January 25, 2014 at 7:28 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74600","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Personally, my opinion versus the C14 dating of 88 can be summarized like this:  There are enough evidences now to conclude with good confidence that the C14 corner that was dated was different in its chemical and physical content versus the main body of the Shroud. I don’t know what is the true reason (or reasons) that lead to this reality, but the fact that the C14 corner was not representative of the whole cloth remais anyway.\nAnd to me, that’s well-enough to seriously doubt the accuracy of the C14 results and, consequently, I don’t think the Vatican need more reason that this to go ahead with a new C14 project (which should be included in a more elaborated test plan, which should include a large spectrum of analyses related to forensic science, physico-chemical science, ancient textile science, history of ancient burial practices, archaeology, etc.)    \nIn other words, the point I want to make is this:  It’s not so important to know if there really was a medieval repair done in the C14 area (and personally, I seriously doubt that we will ever find enough solid evidences to totally prove this hypothesis one day).  The only thing that really matters (at least in order to scientifically defend and to sell to the public the idea that a new C14 test is truly needed) is the scientific findings of Adler, Rogers and some others that are solid enough to prove that a physico-chemical difference truly existed between the C14 corner and the main body of the Shroud.  In such a context, a new C14 test should be seen by the Vatican as a “must” and they should not be shy to do whatever it takes to plan it and to do it in a near future…\n\n","date":"January 25, 2014 at 8:44 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74604","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Correction: In my first paragraph, you should read: “…but the fact that the C14 corner was not representative of the whole cloth REMAINS anyway.”\n\n","date":"January 25, 2014 at 9:20 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74607","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Well said Anonymous. It is not representative of the shroud, Period. The C14 is invalid and needs to be redone on a representative. Multiple sample. Anything further is speculative at best.\n\n","date":"January 26, 2014 at 10:43 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74672","author":"Mike M","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"YOU GOT IT!  And trying to find what is the true cause of the non representative reality of the C14 corner is SECONDARY.  And because there is no agreement among experts about that yet (I doubt there ever will), this should not be seen by the Vatican as a reason to avoid doing a new C14 test that would be done much more properly this time…\n\n","date":"January 26, 2014 at 7:29 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74737","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Thank you for these precisions Thibault, obviously, the anomaly of the C14 corner regarding the content of vanillin is another strong argument pointing to a flawed sampling.\n\n","date":"January 26, 2014 at 6:55 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74649","author":"anoxie","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"The vanillin/lignin discrepancy is a definite piece of evidence suggesting a medieval (or later) provenance to some aspects of the Shroud. The point is not, I think, exactly how much there is in this area or that, but that there is a discrepancy at all. However, I should like to know whether any other ancient textile has been tested and found to contain no vanillin (Rogers frustratingly gave no reference for his Dead Sea Scrolls “and other very old linens” claim), or whether any other medieval textile has been tested and found to contain vanillin (Rogers frustratingly gave no reference for his “other medieval linens” claim). Could the vanillin he found have derived from the madder root that he also detected, I wonder?\n\n","date":"January 26, 2014 at 10:23 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74666","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Oh dear, what about this? The phloroglucinol-hydrochloric-acid test test for lignins produces a bright red colour. Madder root dye mixed with a water soluble gum is a bright red colour. If the phloroglucinol-hydrochloric-acid test was applied by pipette to an old dry thread not stained with madder it would not go bright red, but if applied to a similar thread stained with soluble madder, it would go bright red, regardless of lignin content. Just a thought…\n\n","date":"January 26, 2014 at 10:35 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74670","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I don’t believe that either Colin or Hugh ever had any samples of the Shroud from any place on the Shroud to test or examine. Neither do I. And neither has ever  published a peer reviewed papers on the Shroud   Neither have I. The best we can do is understand and interpret for ourselves the facts that others have revealed. That takes a critical eye.\nRay Rogers did test actual specimens from the Shroud and whatever attempt critics like Colin may make at tearing down Rogers reputation, they are literally mice squeaking at a giant. \nIt bothers me that they have the time to question Rogers science having no practical experience with the Shroud. However here are a few facts: Rogers did not work in isolation. When he had a result he shared it with colleagues for their confirmation or opinion  When he found Vanillin on the carbon and Raes samples, he went back and tested his the samples from the main body of the Shroud and found no (or only trace) Vanillin. Whatever any imperfections may be claimed, the one thing is absolutely clear: the tests for Vanillin on the carbon-Raes  samples and the test for vanillin on the main body of  the Shroud gave dramatically different results. That means they were chemically different.\nOther than ignorantly rejecting Rogers findings of a difference, how would the skeptics explain the difference. Accepted science, not personal theories, please..\n\n","date":"January 26, 2014 at 11:25 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74676","author":"John Klotz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"‘He [Rogers] tested his the samples from the main body of the Shroud and found no (or only trace) Vanillin.’ One of the many problems with Rogers’ papers, is as Hugh pointed out, his lack of references to key assertions. (Why did the peers who reviewed it not pull him up on this?)\nCan we have the reference please for these tests on the whole Shroud and confirmation that they specifically tested vanillin because I have seen it stated that no texts specifically for vanillin have ever been done on the Shroud.\n In the debates recorded on Shroud .com for 21st January, 2006, John Jackson again went into the fray (against Rogers, as he had done over reweaving- did these two have problems with each other?) and argues that the vanillin might have been destroyed in the fire of 1532 within a few seconds. I have no idea whether vanillin is so easily removed by heat but if it were we would have no means of knowing whether there was vanillin on the Shroud in 1531 or not. It might still have had its full complement.\nI am not a scientist but have read enough science to know that many of these debates contain no science at all, just vague assertions which when challenged simply melt away without any coherent responses. That is why I was so relieved that Thibault has actually put forward a clear statement regarding the content of the ‘patch’; that it had ‘many’ bonded linen/cotton threads, even if I would have preferred if he had been able to quantify what he meant by ‘many’. I can only assume he means 60 per cent unless he tells us otherwise. At least that is something we can look for in photographs of the Shroud and test out his hypothesis.\n\n","date":"January 26, 2014 at 12:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74685","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Rogers was not a giant. He was a very good man and a very capable scientist. He advanced our knowledge of the Shroud, but he had some blind spots too (we all do). I don’t think putting anyone on a pedestal is helpful. Comparing one scientist to another and judging them based on how much they agree with our own beliefs is unwise.\n\n","date":"January 26, 2014 at 9:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74760","author":"David Goulet","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Seeing as how Mr.Klotz is still being obnoxious, and refuses to accept my scientific credentials, he will have to be content with what others have to say about Rogers’ so-called vanillin test.\nFor a start, it’s probably not a vanillin test at all. It could be measuring any number of lignin degradation products. According to this abstract, phloroglucinol /HCl gives only a weak colour with vanillin, and is more likely to be measuring other substances, notably hydroxycinnamyl aldehydes.\nBut what do I know, not being a thermochemist with a background in safety testing of chemical explosives (Mr.R.Rogers). \nProtoplasma. 2002 Oct;220(1-2):17-28.\nO-4-Linked coniferyl and sinapyl aldehydes in lignifying cell walls are the main targets of the Wiesner (phloroglucinol-HCl) reaction.\nPomar F, Merino F, Barceló AR.\nAbstract(my bolding)\nThe nature and specificity of the Wiesner test (phloroglucinol-HCl reagent) for the aromatic aldehyde fraction contained in lignins is studied. Phloroglucinol reacted in ethanol-hydrochloric acid with coniferyl aldehyde, sinapyl aldehyde, vanillin, and syringaldehyde to yield either pink pigments (in the case of hydroxycinnamyl aldehydes) or red-brown pigments (in the case of hydroxybenzaldehydes). However, coniferyl alcohol, sinapyl alcohol, and highly condensed dehydrogenation polymers derived from these cinnamyl alcohols and aldehydes did not react with phloroglucinol in ethanol-hydrochloric acid. The differences in the reactivity of phloroglucinol with hydroxycinnamyl aldehydes and their dehydrogenation polymers may be explained by the fact that, in the latter, the unsubstituted (alpha,beta-unsaturated) cinnamaldehyde functional group, which is responsible for the dye reaction, is lost due to lateral chain cross-linking reactions involving the beta carbon. Fourier transform infrared spectroscopy and thioacidolysis analyses of phloroglucinol-positive lignifying plant cell walls belonging to the plant species Zinnia elegans L., Capsicum annuumvar. annuum, Populus albaL., and Pinus halepensisL. demonstrated the presence of 4- O-linked hydroxycinnamyl aldehyde end groups and 4- O-linked 4-hydroxy-3-methoxy-benzaldehyde (vanillin) end groups in lignins. However, given the relatively low abundance of 4- O-linked vanillin in lignifying cell walls and the low extinction coefficient of its red-brown phloroglucinol adduct, it is unlikely that vanillin contributes to a great extent to the phloroglucinol-positive stain reaction. These results suggest that the phloroglucinol-HCl pink stain of lignifying xylem cell walls actually reveals the 4- O-linked hydroxycinnamyl aldehyde structures contained in lignins. Histochemical studies showed that these aldehyde structures are assembled, as in the case of coniferyl aldehyde, during the early stages of xylem cell wall lignification\nOh, and there’s a couple more quotes about Rogers’ novel so-called chemical clock, based on non-specific colorimetric testing that I came across yesterday. I’ll see if I can track them down thus providing Mr.Klotz with more third party opinion, seeing as how he’s not willing to give serious consideration to my own.\n\n","date":"January 26, 2014 at 12:34 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74683","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Here as promised, those two quotations. There;s plenty more out there, all ridiculing Rogers’ claim to have developed a reliable chemical clock:\nFirst quote: “According to Jay Ingram, host of the Daily Planet TV science program on Discovery Channel: “He’s got things completely backwards. He is supposed to be testing the shroud to see how old it is, not deciding in advance that it is older and then concluding that vanillin might be a good clock to prove it. This is bad science. The only way this could be taken seriously would be if Rogers had tested a wide variety of cloths, [of known ages], decided that dwindling amounts of vanillin served as a clock, then — and only then — tested the shroud.” Ingram also criticized the (sic) “Staining is a rough guide to the presence of vanillin and cannot detect very small amounts.” \nSecond quote: “Malcolm Campbell, a botanist at the University of Toronto said: “In biological sciences, a scientist would be hard pressed to get their paper published if they ever attempted to quantify vanillin on the basis of this (phloroglucinol/HCl) staining technique.”\n(Rogers of course published in his “own” journal, Thermochimica Acta, that obvious portal for all new and exciting breakthroughs in sindonology).\nI shall now leave Mr. Klotz to fulminate further at my audacity in daring to cast doubt on the work and/or conclusions of one of the greats of sindonology (to say nothing of chemical explosives testing). No useful purpose is served in attempting to engage further with that very uptight individual.\n\n","date":"January 26, 2014 at 12:53 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74686","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"A TV host and a botanist — wow really heavyweights there. Heavier than me I guess. \nBut what happened to stepping into the unknown for the greater glory of science? Noble when you do it, but absurd when others do it.\n\n","date":"January 26, 2014 at 9:02 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74757","author":"David Goulet","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"But I never so much as intimated they were heavyweights, David. They were simply other folk, one a science communicator and generalist, the other a specialist,  expressing opinions broadly matching my own, as evidence, if any were needed, that I am not out on a limb where Rogers’ chemical clock is concerned (about which I shall be saying more shortly on my own site, pointing out what I believe to be a major flaw in its operation at the molecular level, comparable to the problem of the dribbling  of melted wax on a candle-clock).\nTo be honest, I cannot think of any one  individual whom I would describe as a heavyweight of Shroud studies. It is usually access to specialist instrumentation that gives one individual an edge over another, but that may be temporary, depending on their interpretive skills and/or objectivity – or deficiency thereof. The fact is that all of us, STURP era and beyond, are for the most part self-or chum-selected, and none of us can claim to be more than middle-weights.That’s not necessarily a reflection on our own abilities, but more on the multidisciplinary nature of the problem, one that requires each of us to become a Jack-of-all-trades whether we wish to or not.\n\n","date":"January 27, 2014 at 4:35 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74802","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I agree with John Klotz’s opening premise absolutely: “The best we can do is understand and interpret for ourselves the facts that others have revealed. That takes a critical eye.”\n\n","date":"January 26, 2014 at 1:05 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74687","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"There was no chemical analysis of the sample in 1988 and Mme. Mechthild Flury-Lemberg was not around, as she should have been. What we know is that Professors Giovanni Riggi and Luigi Gonella took a long time arguing about from which site the sample had to be taken, and the representatives from the laboratories kept quiet.\nI therefore asked Charles to let us know how many of the protocols he cited in one recent comment were followed and Colin accused me of putting him in a “spot.”\n\n","date":"January 26, 2014 at 1:56 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74695","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"In this discussion I have been asking for evidence of any reweave and in particular trying to clarify if there was any evidence of enough cotton fibres for them to have any relevance in the C  14 debate . So far no one has come up with any evidence for there being more than a small amount of cotton and if Thibault is right this was a small part of what was overwhelmingly a LINEN reweave . So one asks why deliberAtely weave in any cotton at all? Answers please!\nit is much more likely that Gilbert Raes who was a specialist and allowed to take off his own sample was right  in suggesting that these tiny fibres just drifted in and were never deliberately added.\nI am not sure why Louis suddenly asks me about the protocols- I have never raised them as an issue and cannot see why they are relevant to the issues I have raised .\nConclusion.Was the cotton deliberately added or not? So little has been found and only in fibres . A deliberate addition would surely have been in whole threads. I side with Raes on these having just drifted in and this means that they are totally irrelevant to the  C 14 debate.\n\n","date":"January 26, 2014 at 2:41 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74699","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"“I am not sure why Louis suddenly asks me about the protocols- I have never raised them as an issue and cannot see why they are relevant to the issues I have raised.”\nThanks Charles. I was about to make the same point. Intrusions of off-topic “whataboutery” have stalled or derailed far too many discussions. Sadly it’s become an all-too-common spoiling tactic.\n\n","date":"January 26, 2014 at 3:09 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74702","author":"colinsberry","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"JK: “the tests for Vanillin on the carbon-Raes samples and the test for vanillin on the main body of the Shroud gave dramatically different results. That means they were chemically different.” \nCSB: “… it’s probably not a vanillin test at all. It could be measuring any number of lignin degradation products. According to this abstract, phloroglucinol /HCl gives only a weak colour with vanillin, and is more likely to be measuring other substances, notably hydroxycinnamyl aldehydes.” \nSo it’s Vanillin, Schmanillin! The fact remains that whatever the cause of the Wiesner reaction, THE RESULTS SHOWED A CHEMICAL DIFFERENCE! Ergo, they’re anomalous! So we have differences in: Wienser reaction, cotton content, rose madder, gum arabic. The sampling area was not representative of the whole. It is faulty science to assert a scientific conclusion that ANY kind of testing of the sampled area implies a property of the whole. \nLouis: “What we know is that Professors Giovanni Riggi and Luigi Gonella took a long time arguing about from which site the sample had to be taken, and the representatives from the laboratories kept quiet.” The Riggi-Gonella argument lasted some two hours, and evidently demonstrated no understanding of what constituted a representative sampling protocol to draw a valid and durable scientific conclusion! \nHF: “The point is not, I think, exactly how much there is in this area or that, but that there is a discrepancy at all.” The full set of discrepancies necessarily demonstrates that no valid conclusion can be draw from testing the area sampled!\n\n","date":"January 26, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74704","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Thanks, Daveb. See # 205 below\n\n","date":"January 26, 2014 at 4:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74706","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"An all-too-common spoiling tactic is to avoid a complete picture of what preceded the 1988 CD test. A lot of things went wrong from beginning to end in 1988, a point of view supported by other commenters on this blog. But, to cut a long story short, let us start with the fact that the papal custodian Cardinal Anastasio Balestrero ignored the letter sent to him by Dr. Harry Gove et al. The letter warned that “fundamental modification in the proposed procedures may lead to failure” The number of laboratories were reduced to three and the protocols prepared by Dr. Carlos Chagas, President of the Pontifical Academy of Sciences, were rejected apparently due to the pressure exerted by Professor Luigi Gonella.\nThere was some discussion a few days ago about the laboratories in which thread Charles commented a few things, defending them against what he considered could be judged as libel. It is obvious that the laboratories wanted to be in the limelight and chose to ignore the protocols, that is why he was asked about them.\nOne bad mistake STURP made was to not include a textile specialist in the team and no expert from this field was present when the sample was taken. As I. Wilson wisely noted, “the choice of site for that one sample being well documented as having been subjected to prolonged, repeated handling throughout centuries.” Worse, no chemical analysis of the sample was made. God knows what else was in the sample other than just pure linen. \nSo what we have here is a succession of errors that makes Rogers paper worthy of consideration. Rogers was not a religious scientist, he had no axe to grind.\n\n","date":"January 26, 2014 at 4:24 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74705","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"But one of the problems of Rogers’ paper is that  he created the idea of the cotton being dyed. If Thibault is right and the cotton is embedded in linen it would have been impossible and unnecessary to dye it. In fact unless the reweave was totally cotton there would be no point in dyeing at all. This is where Rogers went wrong in his speculations. Where he seems to have been right is in saying that the encrustations would have been dissolved in the clarning process,\nI suspect , but I have no evidence for this, that gum Arabic was added to seal the cloth against decay and needed to be applied at the top here because it was where the linen was most threatened by the sweaty hands of the clergy. In short , it is impossible to envisage a situation where cotton fibres would have been dyed (how do dye a tiny fibre anyway, let alone one bonded with linen)and the sooner we drop this unwarranted assertion by Rogers and move on the better!\n\n","date":"January 26, 2014 at 4:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74710","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Charles, see # 209\n\n","date":"January 26, 2014 at 5:24 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74715","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Sorry, the response is in # 210, or it may change to # 211!\n\n","date":"January 26, 2014 at 5:26 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74716","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Does anyone know what ever became of the cutaway seam in the C14 area taken by Riggi in 1988?  Was his private study ever made public?\n\n","date":"January 26, 2014 at 5:04 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74713","author":"Annette Cloutier","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Riggi brought the textile fragments to San Antonio, Texas, where they were lost in a dating attempt by Garza-Valdes.\n\n","date":"January 26, 2014 at 7:16 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74734","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"A balanced comment, awaiting a response from those who have more data. Who knows, perhaps the cotton was dyed to make it match the colour of the relic made dirty in the site threatened by the sweaty hand of the clergy.\n\n","date":"January 26, 2014 at 5:05 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74714","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Am I right in following Charles’ logic as follows?\nIn order to achieve a medieval date for a first century cloth, the reweave must have made up at least sixty per cent of the total sample.\nCotton only made up at most twenty per cent of the reweave (Thibault Heimberger’s research) and so eighty per cent of the reweave must have been linen.\nBut linen does not take dye so in principle the ‘new’ linen would have looked different unless the weavers used yarn that was indistinguishable from the original linen.\nBut if they had found yarn that was indistinguishable then they would not have needed to add dyed cotton to it, especially as that would have made it more unlikely that the reweave would have remained invisible.\nSo the cotton is likely to have drifted in as fibres as was the original claim of the textile expert Gilbert Raes and not been added by the invisible weavers. In addition Charles seems to argue that it would have been impossible to have dyed fibres of cotton or cotton that was bonded with linen as Thibault claims it was.\nSo Rogers was wrong to call the added material he found a dye because it is impossible to imagine a scenario where cotton would have needed to have been dyed. But it could have been a sealant covering this whole area of the cloth to protect it.\n have I got this right? I am looking forward to hearing some responses.\n\n","date":"January 26, 2014 at 6:57 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74729","author":"Lyfe","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Lyfe- thanks for putting that together!\n I think that it is important to state that this is not some mad idea of my own but relies on experts in ancient textiles who actually examined the Shroud and they all agree. Gilbert Raes took a sample back in the 1970s, first discovered the tiny cotton fibres and used his expertise to suggest that they had drifted in from a workshop where cotton and flax were being woven together. In 1988, the church may have finally decided where the sample came from but the choice was confirmed  and supported later by the two ancient textile experts who were present, Professors Vial and Testore. In 2002, Mechthild Flury-Lemberg, in charge of the restoration of the Shroud , also saw no reweave and published a paper pointing out that in her expert opinion there had never been any need to reweave that area anyway. (She specifically endorsed the work of Vial, saying that this was after all his specialist area.) She challenged the supporters of Rogers, Benford and Marino to show where the reweave began and ended.\nFlury-Lemberg was supported by John Jackson, a big  name among those who believe in authenticity,  who showed from the photographic evidence that the banding was intact and so,again, there had been no reweaving. I don’t have much time for Ian Wilson but some see him as the super-guru of Shroud studies and he also supports the idea of there not being a reweave.\nSo the weight of expert opinion is overwhelmingly against any reweave. This makes the whole idea of dyed cotton redundant and if Rogers had thought through his speculation that the additions, ‘encrustations’ he called them, were dye he would have realised that it would not work in practice when there was so little cotton as a percentage of his proposed  reweave. But he was an ill man and can be forgiven! What is extraordinary is how uncritical those who read his paper have been. No one seems to question the idea of a dye and see how flimsy, or non-existent, was his evidence that the encrustations were a dye, rather than, say, a sealant.\nBut enough said- responses to this  seem to be to cough and change the subject. Although I have been to Turin three times, gone through the Shroud Museum, been taken by the custodian to the chapel behind the museum to see the life-size copy of the Shroud there ( as well as the life-size one in the chapel next to San Lorenzo), I have never seen the original- so i will rest my case on those who have seen it close-up AND who dealt with ancient textiles as their professional career.\n\n","date":"January 27, 2014 at 3:49 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74790","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Lyfe- one more point- as you seem actually to have taken my argument on board!\n.When he examined the Shroud in 1988, in the two hours  while they were choosing the sample , Gabriel Vial looked over the whole cloth and took photos and then wrote an article in his findings for the French textile magazine CIETA Bulletin who published it the next year, 1989. He showed that the thickness of the yarn used for the weaving varied considerably. This meant that that the nature of the weave varied according to how the different thicknesses of the yarn just happened to be entered into the weave. It could be, but I have no evidence that this is the case, that the apparent discrepancies between parts of the Shroud are actually the result of this. He also noted areas where the weavers had made mistakes. An important paper.\n\n","date":"January 27, 2014 at 4:04 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74795","author":"Charles Freeman","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Are we beng unfair in assuming that all medieval bishops went about with sticky, sweaty hands mired in filth? Did they have no respect for the Shroud at all? Didn’t they ever wash their hands? Or wear gloves? How very unsavoury.\nAnd, on a completely different thread, so to speak, is there any evidence that the place from which to take the radiocarbon sample was considered at all, by anybody, prior to Giovanni Riggi picking up his scissors and saying, “Where from, boys?”\n\n","date":"January 26, 2014 at 7:03 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74731","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Quote: “…is there any evidence that the place from which to take the radiocarbon sample was considered at all, by anybody, prior to Giovanni Riggi picking up his scissors and saying, “Where from, boys?”\nIf we believe the testimony of William Meacham (ref. : The Rape of the Turin Shroud), the one who push the issue of taking the sample from this corner of the Shroud was Luigi Gonella, the scientific adviser for Turin Archbishop and, as Meacham’s wrote, this was due to the fact that he (and most certainly also all the “Turin clan”) did not wanted to “affect” the look of the relic by taking samples from parts of the cloth that were close to the image and also because this corner was already “damaged” with a missing part that had been taken at an unknown date.\n\n","date":"January 26, 2014 at 7:42 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74741","author":"Anonymous","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Mediaeval bishops are not portrayed wearing gloves while holding the Shroud during expositions and even St. Francis de Sales is recorded to have felt embarrassed after being chided when sweat from his forehead fell on the Shroud. With all those vestments, who could blame him and the prelates?\nThey seemed to have shown much more respect for the Shroud than Cardinal Anastasio Ballestrero before the 1988 dating and evidence for this appears in a photograph in one of the BSTS newsletters, where he appears leaning over the relic. It is even doubtful that Professor Luigi Gonella believed in authenticity, therefore the careless manner in which the sample was taken.\n\n","date":"January 26, 2014 at 7:32 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74738","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Fair enough. It’s the thumb tacks that I find a bit… tacky…\n\n","date":"January 26, 2014 at 7:43 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74744","author":"Hugh Farey","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Well, the damage has been done and we are now crying over spilt milk. This is because of what happened in mediaeval times and in 1988, but, more recently, photographs of the restoration show no gloves being used….\n\n","date":"January 26, 2014 at 8:13 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74749","author":"Louis","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"I guess whoever fried de Charny must have added the burn holes after seeing the Hungarian Pray Manuscript! yeah right\n\n","date":"January 26, 2014 at 11:19 pm","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74768","author":"don","site":"shroudstory"},{"title":"Cat Among the Pigeons","post":"Nice to see some wit at last! Pray manuscript 1192, Knights Tamplar Jacques de Molay & Geoffrey de Charnay executed 1314! But still a better call than Leonardo, died 1519!\n\n","date":"January 27, 2014 at 2:42 am","url":"https://shroudstory.com/2014/01/21/cat-among-the-pigeons/","cat":"carbon_14_dating","id":"comment-74783","author":"daveb of wellington nz","site":"shroudstory"}]
