[{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thank you Paul, Very objectively stated. Also sorry to report no news of the video tape.\n\n","date":"May 25, 2013 at 7:56 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34719","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I just finish to read Mr. Maloney’s interesting comment and here are, for me and in order, the 3 most probable causes of the light contamination of the Shroud with madder rose that was found in only 2 of the 32 sticky tape samples collected by STURP in 1978 and not found anywhere by Mr. Maloney himself in all the 26 sticky tape samples collected by Max Frei in 1978:\n1- The numerous manipulations and the numerous folding and unfolding of the cloth over the centuries.  Note:  This hypothesis of mine, which I still consider as the most probable explanation for the light contamination found by McCrone, came to my mind because of one important scientific fact reported by Al Adler in his book The Orphaned Manuscript in which he indicated that the dried surface of every bloodstains on the Shroud have been abraded a lot over the years, which caused an important scattering of microscopic blood particles all over the cloth, in bloodstained areas as well as in unstained areas on the cloth.  And as Adler said, this can only have been caused by the numerous manipulations, folding and unfolding of the cloth over the centuries.  Note that these numerous manipulations of the Shroud have to be considered as a solid historical fact.  So, if that’s what really happened for the dried surface of the bloodstains, then I think it’s fair to assume that a similar transfer mechanism could have also spread some tiny particles of madder rose in some places of the cloth, even if these contaminated spots are located pretty far from their supposed original place, i.e. the C14 corner, which is probably a repaired area of the cloth where madder rose had been easily found by Rogers and independently confirmed later on by John Brown.\n2- A contamination coming from one or many of the 52 True Copies that were laid cloth to cloth and image to image on the original.  Note:  I didn’t thought about this possibility but, after reading the comment of Mr. Maloney, I came to the conclusion that this type of contamination must be seen as almost as probable as the transfer mechanism I placed in no.1.\n3- An accidental contamination coming from a weaver’s workshop.  Note:  Since there was probably a medieval repair work done by a very skilled weaver in the C14 area with the use of madder rose, it is also fair to presume that a tiny contamination of some small parts of the cloth could have been  accidentally caused during this repair work (or during another possible unrecorded repair work – think about the other damaged corner of the Shroud).  \nIn the end, no matter what could have caused this light contamination, I think we can forget McCrone’s own hypothesis for the simple and good reason that, since the STURP investigation, we know for a fact that the image on the Shroud is NOT a painting or any other form of artwork…\nThank you Mr. Maloney for your comment and thanks also for the McCrone’s map of STURP samples.  Now I know why I was lost with the numbers and letters :  it’s simply because Barrie Schwortz used a different system of numbers and letters for his own map of samples! \nBut there is one thing that remain unsolved and that’s this quote from Benford and Marino’s paper that was also presented in Columbus in 2008: “An archaeologist, the late Dr. Eugenia Nitowski, who obtained numerous Shroud fibers from (Raymond) Rogers, conjectured that the red particle contaminates discovered by Kohlbeck were the burial spices Aloes and Myrrh. However, this assumption was based solely on her comparison of the debris with reference photos of the suspected substances and not via chemical analyses. She reported: “The study could go no further (beyond photo comparison), because of the inability to perform testing which would either remove or destroy materials from the tapes.” Along with the lack of any chemical characterization of the debris, the fact that the singular yarn (1FH) with the impurities came from the ventral missing-corner-exposed-medieval Holland cloth and not the main Shroud, argues strongly against Nitowski’s assumption that the debris was from burial spices. Based on the Quad-Mosaic data and Roger’s findings, it is far more plausible that the 1FH impurities were also red Madder and Gum Arabic as chemically-verified by Rogers in multiple adjacent samples.” \nQuestion #1 for Joe Marino: Why do you refer to only one sample in which there could have been found some traces of madder rose while McCrone and Maloney talked about 2?\nQuestion #2:  Can you tell me where is located the sample #1FH?  I don’t find it in McCrone’s map given by Mr. Maloney…  Does it came instead from Barrie’s map?\nQuestion #3:  Along with the presence of madder rose, you seem to think that there was also some traces of Gum Arabic in this sample 1FH…  Is it a proven fact?  I ask this because McCrone’s own finding only talks about the presence of rose madder and Mr. Maloney also talks only about rose madder without any reference to the presence of Gum Arabic…  This question is somewhat important here because if it’s a proven fact that there was also some traces of Gum Arabic along with the traces of madder rose, then the hypothesis of contamination I placed at #2 in my list would no longer be a viable one I’m affraid and the ones I placed at #1 and #3 in my list would gain even more credibility!\nSo Joe, I hope you will take some time to give me some answers concerning these 3 questions.  Thank you in advance!!!\n\n","date":"May 25, 2013 at 4:57 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34779","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Here’s another message for Mr. Maloney:\nI think the work you do concerning the pictorial atlas of the many kinds of particles and fibers and other trace “contaminants” that can be found on the 26 Max Frei sticky tapes could well be very important in order to improve our understanding of the Shroud, but I am very suspicious about one important missing aspect of your work, which is the lack of spectrometry or chemical testing to ascertain the physical identity of the individual particles or fibers.\nBy not doing this, I really think you open a wide door for critics coming from outside as much as from Inside the pro-Shroud world.  That’s why I would like to give you this suggestion:  Before the official publication of your interesting work, why don’t you find one specialist in the field of spectrometry and/or chemical analyses, so that he could do some independent analyses of your conclusions? \nOf course, such a counter-analysis would represent a huge task but I definitely think this is the only credible path to follow if you want to avoid critics as much as possible and if you really want your work to be very significant for Shroud research.  You say that you used the very same techniques as Walter McCrone and Eugenia Nitowski…  Have you noticed how much their works have been criticized over the years and how much doubts have been shed on their conclusions?  I would be very sad to see the same thing happening to your own work because I’m truly convinced that you’re one of the few scientists involved in Shroud research nowdays that is able to keep is faith in his back-pocket while doing his scientific work on the Shroud.  \nThat’s why I hope you’ll consider seriously my friendly advice to you.\n\n","date":"May 25, 2013 at 5:33 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34781","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I’m not satisfy concerning the advice I just give you.  So, I’ll write it again that way: Before the official publication of your interesting work, why don’t you find one specialist in the field of spectrometry and/or chemical analyses, so that he could do some independent analyses in order to determined the validity of your conclusions?\nNow, it’s better…\n\n","date":"May 25, 2013 at 5:36 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34782","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Paul don’t you believe that the major problem has been the nomenclature in the TS research defining what is present on these sticky tape. Isn’t it possible that Nitowski analyzes that Myrrh is in fact madder rose that Rogers was referring to? Remember, Kohlbeck’s 6BF analysis that McCrone insisted was iron oxide was refuted successfully since Cargile oil shouldn’t have effected an inorganic matter such as iron oxide. Kohlbeck’s finding supported   Sue Bedford’s theory of the invisible weave since she believed that the Iron Oxide was in fact  madder rose. Sue Benford’s hypothesis was based on the chemical reaction of the iron oxide towards the Cargile oil.  My humble opinion is, until the nomenclature isn’t defined, then we should except  opposition towards Ray Roger’s last paper.\n\n","date":"May 25, 2013 at 6:10 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34786","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Yannick wrote:  Question #1 for Joe Marino: Why do you refer to only one sample in which there could have been found some traces of madder rose while McCrone and Maloney talked about 2?\n Question #2: Can you tell me where is located the sample #1FH? I don’t find it in McCrone’s map given by Mr. Maloney… Does it came instead from Barrie’s map?\n Question #3: Along with the presence of madder rose, you seem to think that there was also some traces of Gum Arabic in this sample 1FH… Is it a proven fact?\nLet me answer question 2 first.  1FH is a designation from a mapping system that Eugenia Nitowski put together to chart samples given to her by Rogers.  It was a Holland cloth patch examined by Kohlbeck but not returned to Rogers.  We referred to only one sample with madder rose based on the Nitowski map as opposed to 2 samples that Maloney and McCrone referred to on McCrone’s map.  It’s not proven that gum arabic was on 1FH–we just said it was plausible based on the Quad-mosaic data and Rogers’ findings.\n\n","date":"May 25, 2013 at 6:32 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34789","author":"Joe Marino","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thank you Joe.  So, if I understand correctly, the sample analyzed by Nitowski (1FH) never was analyzed by Rogers or by McCrone right?  This 3rd sample contaminated with madder rose seem to mean that madder rose can definately have been scattered in various places of the cloth and, if it’s true, then I think my #1 hypothesis is truly the most probable and, if it’s true, it can be seen as another piece of evidence to back-up your own hypothesis of an invisible repair.\nNow, I’ll wait patiently for your answers to my 2 other questions.  Thanks again!  One thing’s for sure:  when it comes to samples of the Shroud, things are not easy to understand!\n\n","date":"May 25, 2013 at 6:45 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34791","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Oh…  Forget about my last comment in which I was waiting for the answer to my 2 other questions because I just realize that you answered them all in one shot!!! ;-)  Thanks again Joe. \nComment concerning the possible presence of Gum Arabic along with the possible madder rose in the sample analyzed by Nitowski:  Where is this sample now?  Who owns it?  Would it be possible to do some more chemical analyses of this particular sample?  I ask this because a confirmation of the presence of madder rose and Gum Arabic in an area of the cloth located so close to the C14 corner would truly represent a great piece of evidence to back-up your own hypothesis!  I’m sure Joe also got the answer for this question…\n\n","date":"May 25, 2013 at 6:49 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34792","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Yannick wrote:  “Now, I’ll wait patiently for your answers to my 2 other questions.”  I did reply to the other questions in the next 2 sentences:  “We referred to only one sample with madder rose based on the Nitowski map as opposed to 2 samples that Maloney and McCrone referred to on McCrone’s map” was in response to question 1 and “It’s not proven that gum arabic was on 1FH–we just said it was plausible based on the Quad-mosaic data and Rogers’ findings” was in response to question 3.  It seemed to flow better to start with question 2 and when I originally responded I didn’t specify the other 2 questions.\n\n","date":"May 25, 2013 at 6:54 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34793","author":"jmarino240","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"There was no chemical analysis of the sample taken for the 1988 carbon dating\n\n","date":"May 25, 2013 at 6:57 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34794","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Good point\n\n","date":"May 25, 2013 at 7:05 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34796","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Joe can you and Paul give me your hypothesis what Dr. McCrone is stating with these remarks?\nDr. McCrone writes in “Judgement Day for the Turin Shroud” page 82 on Dec 26 1978, starting with 3-CB a heavy image area, blood from the lance wound using low magnification (10% +10% oli) I could see a heavy crustacean (of blood?) – too red”!  Page 84 on Feb 2 1979 he writes, “I have spent a lot of time looking at the tapes especially the red particles. There are a lot of them and they are definitely inorganic. hundreds of fiber are well-coated with these deep red particles. They are the same particles Pellicori and Evans show in their low power photomicrographs they say this is blood- I say it is an inorganic compound.  In our archives I have more notes written by Dr. McCrone which was not published. ” Dr. McCrone writes  on June 13th 1979, “Sample 3AF (finger image) shows the largest percentage of colored fibre examined it closely the fibers are un-uniform colored over lengths exceeding weave units hence the color is not a surface effect-possible mechanism includes heat or liquid treatment. There are in this sample and others a number of yellow amorphous tubular flaked like a material resin. ( I thought in the part they could be aloes or etc).”\n\n","date":"May 25, 2013 at 7:04 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34795","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Giorgio, you have raised good questions. Though the doubts will have to be cleared by the experts, it looks like the particles have something to do with McCrone’s insistence on red ochre and vermilion, probably coming from other sources like icons and paintings that are said to have been pressed over the Shroud to impart holiness. The last part you quoted seems to point  to a lot more contamination.\n\n","date":"May 25, 2013 at 7:29 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34801","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Agreed. We need revaluation by the experts.. That’s why I don’t believe we’re just looking at the dorsal area 3-AB and 3 AC. It would seem to me we might be dealing with much more contamination then just those two isolated areas.\n\n","date":"May 25, 2013 at 8:22 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34810","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Joe, here’s my previous questions (just in case you missed it):  These are questions concerning the possible presence of Gum Arabic along with the possible madder rose in the sample analyzed by Nitowski: Where is this sample now? Who owns it? Would it be possible to do some more chemical analyses of this particular sample? I ask this because a confirmation of the presence of madder rose and Gum Arabic in an area of the cloth located so close to the C14 corner would truly represent a great piece of evidence to back-up your own hypothesis! I’m sure you can answered these questions…\n\n","date":"May 25, 2013 at 7:18 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34797","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Regarding Giorgio’s question about McCrone’s statements and Yannick’s question regarding who now owns the Nitowski samples, I’ve been forwarding other comments to Paul and will let him address both areas.\n\n","date":"May 25, 2013 at 7:25 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34798","author":"jmarino240","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thanks Joe!  Last question for you:  Can you confirm to me that both McCrone and Nitowski have only analyzed samples that were taken by STURP and not by Max Frei or Riggi?\nBy the way, if you forward my previous question to Mr. Maloney, it would be a very good thing to give him also the comment I wrote just for him.  Would be nice if you could give him the link of this comment of mine, which is :  https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/#comment-34781\nThank you for doing this.  I just want to be sure Mr. Maloney will read this.\n\n","date":"May 25, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34800","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Here is  quick reference of Dr. McCrones notes on 3-3-79\n1FB – No indication of red (blood)\n3EB – Strong indication of Fe2O3\n3FB – slight ”                               ”\n6AF – strong ”                             ”\n6BF – very strong ”  ”\n1GB – Clean no Fe2O3\nCan we conclusively state that the Fe203 McCrone is referencing  is not the madder rose that Roger’s seen on 3 AB and 3 AC ?\n\n","date":"May 25, 2013 at 7:27 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34799","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Just a remark about McCrones findings regarding FeO3.\nRemember that Adler and Heller recalled that FeO3 is the natural product of burned blood. They found FeO3 particles in the burned blood areas and in the margins of the water stains (another mechanism).\n3EB- Strong indication of FeO3\n3EB is close to a burned area and (probably) a waterstain\n3FB- Slight indication of FeO3\n3FB is far from any scorched area and in the middle of a water stain \n6AF strong ..\n6AF is close to a burned area\n6BF very strong…\n6BF (Lance wound area) in a burned area and a water stain.\nOf course, MC used these findings to prove that there is a strong correlation between the “blood” density and Fe2O3. But Adler’s findings are also consistent with MC’s observations.\nLook at 6 AF. Here there is almost no visible blood but MC found a “strong indication of Fe2O3”.\nJust some thoughts.\n\n","date":"May 29, 2013 at 4:10 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35288","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Agreed. We need revaluation by the experts.. That’s why I don’t believe we’re just looking at the dorsal area 3-AB and 3 AC. It would seem to me we might be dealing with much more contamination then just those two isolated areas.\nGiorgio, the laboratories talk about contamination as though it is an easy thing to remove, but it really appears to be something easier said than done. The object is linen, specifically, the Turin Shroud, which has passed through many places, probably in many different lands,held by so many hands and a lot more. The last part you quoted in #12 gains a lot of importance.\n\n","date":"May 25, 2013 at 8:32 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34811","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Ditto Louis\n\n","date":"May 25, 2013 at 9:13 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34816","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Giorgio, we have agreed about contamination. As for the colour of what is said to be blood stains, the Australian Dr.Loy is reported to have affirmed that the blood of people who die after a trauma is very red.\n\n","date":"May 25, 2013 at 9:25 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34819","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Louis said : “As for the colour of what is said to be blood stains, the Australian Dr.Loy is reported to have affirmed that the blood of people who die after a trauma is very red.”\nMy comment :  Very interesting information Louis!  This tend to confirm Al Adler’s hypothesis concerning the reddish aspect of the blood on the Shroud that would be due to a higher than normal level of bilirubin in the blood that would have been caused by the long and intense tortures suffered by the Shroud man.\nPersonally, I still believe that Adler’s hypothesis is most rational and probable to explain the reddish aspect of the blood on the Shroud!\n\n","date":"May 26, 2013 at 5:20 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34906","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Yannick wrote, ” These are questions concerning the possible presence of Gum Arabic along with the possible madder rose in the sample analyzed by Nitowski: Where is this sample now? Who owns it? Would it be possible to do some more chemical analyses of this particular sample?”  \nPaul responded:  “Dr. Nitowski is now deceased.  I tried reaching relatives and close friends but, with the exception of a cousin in New Jersey, I received no answers.  No one knows where her samples are today–and it has been several years, now, that Jeannie passed away.  Sorry I could not be more informative about this.\nRegards,\nPaul\n\n","date":"May 25, 2013 at 9:09 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34814","author":"Joe Marino","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thanks Joe and Paul!\nThis is very sad to see how bad the monitoring of the samples taken from the Shroud has been done!!!!  In my opinion, this is due in good part to the very bad decision of Turin in 1978 and 1988 to have not taken a legal procedure in order to be certain to always follow the trace of the samples that were taken from the Shroud.  I’m sure this could have been done properly and legally doen and we would not be in this crappy situation today…  Even the taking of some samples (like the ones taken by Riggi and Gonella in 1988 after the C14 sampling) is very questionable and should definately have been done much more properly and not in secret.  This kind of additional sampling was not even part of the original protocol of research and, if an agreement could have been obtained from the Church authorities anyway, this should have been done on record and publicly, at the very least…  The whole situation of the samples taken from the Shroud is one of the worst crap I’ve ever seen in science.\n\n","date":"May 26, 2013 at 6:00 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34910","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Giorgio wrote, “Joe can you and Paul give me your hypothesis what Dr. McCrone is stating with these remarks?…”\nPaul responded:  “I would not be able to present the following as an hypothsis–rather, it would be more like a “personal guesstimate”.  STURP learned early on that McCrone was heading toward a finding that the image was caused by iron oxide.  This was disturbing to them.  I called and talked with Dr. Robert L. Feller [paint chemistry and art conservation at the Carnegie Mellon University in Pittsburgh, PA] and he knew McCrone’s penchant for the light microscope (as opposed to other technological approaches like spectrometry and sophisticated chemical analysis).  He told me that McCrone liked to identify things by using his eyes.  Indeed, McCrone once said something similar to me when he hoped that his work (such as with the particle atlas) would “save” the light microscope.  And, in fact, McCrone was famous for his ability to see things under the eye of the scope and proffer a professional opinion about it.  But Feller believed that McCrone was old-fashioned (that is not his word–that was simply how he felt about it) in his use of the microscope.  Feller suggested that the microscope would be well served by supplementing it with other, high tech, approaches.  In other words, McCrone was giving his “opinion” about things of which he had long experience.  But McCrone had never heard of the compilation of work on the True Copies by Don Luigi Fossati in his earliest work so he developed the first thing that came to his mind, born of that long experience and the logic that emanated from it.  \nBut McCrone was not the only one to puzzle over the color of “blood” on the Shroud.  Adler, himself puzzled over it and with experimentation told me that he could duplicate the “redness” of the blood by assuming that the Man of the Shroud was a victim of blood trauma where the billirubin was some 500 times concentrated.  Dr. Gilbert Lavoie told me that he and Adler were working on this possibility and that Lavoie had, in his refrigerator, a sample of tramatized blood taken from a man who had suffered from a chain gang beating.  To my knowledge, little further was done on this because Adler passed away from a severe brain hemmorage–a tragic loss to us all.  One might ask Dr. Lavoie for input on this matter.\nBut, to another question put to me by the late lawyer, Benjamin Wiech–why does the blood color appear to keep changing?–I responded that it will depend on the lighting that illumines it.  The “true” color is not seen unless the full spectrum of light shines on it.  (Sunlight is the best resource for this–but, of course, we do not wish UV rays to damage the Shroud and so that is usually filtered out).  \nWe must also remember that McCrone was limited in another way:  He was not a direct on-site participant scientist who could examine the fibers of the Shroud under the Wild M-400 microscope in it textile context in the way that Sam Pellicori and Mark Evans could.  He could only see the fibers removed from the Shroud as a “remainder” after the fact on the sticky tapes that STURP (i.e. Ray Rogers) had removed from the cloth with the “torque applicator”.  And these samples were truly from the surface because Ray and Joan Janey (later Mrs. Ray Rogers) designed the instrument to do exactly that–to remove only surface material.  McCrone had no way to use a tungsten probe and part the crowns of the threads to examine them from side to side to draw conclusions while in Turin.  He also did not have the value of discussing various ideas with other participants on-site in Turin to help formulate a modulated hypothesis.  Indeed, McCrone apparently did not even avail himself of some excellent technicians in his own employ at the McCrone Research Institute in Chicago–and unfortunately I have momentarily misplaced my copy of the book Barrie Schwortz edited for Ray Rogers so I cannot now remember the name of the technician (Anderson?????) who suggested to McCrone that his own Ramen Spectroscopy showed a blood signal–not iron oxide.  Thus, it may have been a very personal thing–an inability to change his mind about his own initial belief that it was iron oxide because to do so would mean he could not “save face.”  And, after all, the inorganic pigment–iron oxide–did not change color.  But blood does not usually stay red–for it will turn brown then black with time.\nI know of many scientists who found themselves in this professional predicament.  Forgive the following excursus as an example: The late Glenn Seaborg (for which the element “seaborgium” is named), tells the story that he became convinced that the periodic table should be changed and re-formated.  So he went to his doctoral advisor at the University of Chicago and suggested the idea.  But his advisor, committed to the old way it was formated, said, “Well, I wouldn’t go public with that if I were you. It will ruin your reputation.”  The old professor could not change from his commitment to the older view of the periodic table.  But look in any modern book of chemistry and examine the periodic table–that is the way Glenn Seaborg had proposed it and now it is the accepted view.\nI cannot say that this was McCrone’s problem.  And it will probably never be known with certainty since McCrone is no longer able to discuss the matter.  I do know, from my own talks with him, that McCrone did seriously believe that what he saw on the Shroud tapes was largely iron oxide as the image pigment.  I often agreed with him on the finding of iron oxide–but I told him that the True Copy issue was a major clouding of the answer and since, as I noted above that McCrone did not have the advantage of seeing the Shroud personally with his own eyeballs, he drew his conclusions and stated them publically based for the most part on light microscopy.  He wanted to make a convert of Fr. Rinaldi and hoped that I, too, would eventually “see the light.”\nScience is often a personal thing.  After all, we are all humans and it takes the voices and views of many and the accumulated data of scientific observation to get to the final objective truth.”  \nRegards,\nPaul\n\n","date":"May 25, 2013 at 9:11 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34815","author":"jmarino240","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Yannick wrote:  “Can you confirm to me that both McCrone and Nitowski have only analyzed samples that were taken by STURP and not by Max Frei or Riggi?”\nMcCrone analyzed samples of Frei’s but I don’t know if he incorporated them at all into the map that Paul attached.  McCrone & Nitowski would not have been given access to any Riggi samples.  I forwarded to Paul a 2nd time your suggestions about his research and also asked him to comment on the Frei samples vis-a-vis McCrone.\n\n","date":"May 25, 2013 at 9:19 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34817","author":"jmarino240","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Joe Please thank Paul for me for his response. His “personal guesstimate”. is well respected.\nGio\n\n","date":"May 25, 2013 at 9:22 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34818","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Paul Maloney wrote:\nDear Yannick and Giorgio,\nAbout the use of spectroscopy and chemical analysis, I could not agree with you more!  But I am not a physicist or an analytical chemist (I am an archaeologist) and I do not have access to the sophisticated equipment–often found only in well-funded laboratories–needed to conduct such work.  Moreover, I know from personal experience with the microscope that I have already spent more than a thousand hours just doing the photomicrography on the Max Frei tapes.  The further work that would be needed by a physicist (using various types of spectroscopy) or an analytical chemist would involve the need for further extensive in-depth funding and specialists in various forms of spectroscopy and other arenas to do what really needs to be done.  But someone has to start somewhere.  By compiling this photo-visualization of the particles, fibers, and botanical traces on the Shroud, it provides other specialists with an “outline” whereby professionals can enter the picture and begin to flesh out the story of the Shroud in better and more illuminating detail than I ever could.  \nMoreover, by stating that I am not using spectral analysis or chemical probing, I give a “heads up” to these other specialists to come to the fore and do what they do best.  Additionally, if I tried to employ such equipment as a non-professional, I would quite certainly engender the kind of criticism you hope I’ll be able to avoid.  But, I am happy to work as an advisor with these scientists if they wish.  I should, however, state that I no longer have direct access to the Max Frei Tapes–only to the some 7000 Kodak transparencies I made between Jan. 1986 and July 1993.  The tapes are now curated by Dr. and Mrs. Alan D. Whanger, Prof. Emeritus at Duke University, in Durham, North Carolina.  \nNaturally, I would wish to conduct much of this work in a non-destructive fashion.  Chemical analysis would, by its very nature, be destructive.  Even doing proper palinology (as Max Frei did on the 1973 tapes) required him to cut tiny incisions in the form of a “T” in the tape to remove each pollen grain he selected and re-mount it separately on a microscope slide.  He did this many times.  But it does do “damage” to the tapes.  And if the pollen grains were coated with some sort of coating, as Giovanni Riggi di Numana told me many of his own pollen grains were coated, then an acid would be needed to remove that coating before proper pollen analysis could be done.  And it would be important in that case to discover the composition of the coating BEFORE that coating was removed because it could contain a very important clue as to the original (tomb?) environ from which it had come.  So many technicians and consultants would have to come together to plan carefully how to use the wealth of material on the Max Frei Tapes.\nWith all best wishes,\nPaul\n\n","date":"May 25, 2013 at 9:28 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34821","author":"jmarino240","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thanks again to Joe and Paul.  This is another comment I have printed on paper and that I will read more carefully later on tonight.\n\n","date":"May 26, 2013 at 6:19 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34916","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"One wonders how work on the tapes is possible now that Dr. Whanger stepped out of the minefield. Professor Danin insisted that Uri Baruch did a good job on the tapes.\n\n","date":"May 25, 2013 at 9:39 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34823","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nLouis :\nGiorgio, we have agreed about contamination. As for the colour of what is said to be blood stains, the Australian Dr.Loy is reported to have affirmed that the blood of people who die after a trauma is very red.\n\nDo you have a link?\nI have stated before and stay by that – the wild perception of “very red” is just subjective opinion, and the color of the blood STAINS could vary depending on the multiple factors.\n\n","date":"May 25, 2013 at 9:46 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34824","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Jesterof, yes I have. It is the book “The Blood and the Shroud: New Evidence that the World’s Most Sacred Relic is Real”.\n\n","date":"May 25, 2013 at 9:54 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34827","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"“Traumatized blood” is, probably, the term used by Mr. Maloney to describe blood hemolysis and yes, hemolysis can occur after trauma, or as a a part of rhabdomyolysis as well The result is very high levels of bilirubin ( as a metabolite of hemoglobin wich is now free in the bloodstream since the erythrocytes are broken ( hemolyzed)\n\n","date":"May 25, 2013 at 9:58 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34828","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nLouis :\nJesterof, yes I have. It is the book “The Blood and the Shroud: New Evidence that the World’s Most Sacred Relic is Real”.\n\nThank you, Louis, I’ve already deciphered what is meant by this in more common terminology for me :-)\n\n","date":"May 25, 2013 at 9:59 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34829","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"You’re welcome, Jesterof. It would be nice for you to share what more you can discover with us.\n\n","date":"May 25, 2013 at 10:04 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34830","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nLouis :\nYou’re welcome, Jesterof. It would be nice for you to share what more you can discover with us.\n\nA lot :)\nOne question – from the “blood threads” I had the impression that the description of the “too red” is actually about one stain in the forehead. Now here I learn that it was Walter McCrone who actually first expressed the surprise, but if he was viewing particles of ferrous oxide and not blood, his description of color is irrelevant.\nUpon viewing the photographs of the Shroud I do not have the impression that any of the blood stains are “very red” and as is confirmed here by the response of Mr. Maloney the color obviously differs depending on the light source and that nobody have seen the Shroud in the bright sunlight.\nCan you clarify for me, please, which blood is deemed to be “too red” – one stain on the forehead or is it something else?\n\n","date":"May 25, 2013 at 10:13 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34832","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"You’re right about Dr. McCrone, and that was exactly what was meant in #13. From what can be understood in the literature, the “too red” or “very red” refers to the blood in general, that is, to the post-mortem blood. Hope this helps. I can’t say anything about the colour depending on the light source and presume that the scientists who studied the stains would have known that.\n\n","date":"May 25, 2013 at 10:26 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34836","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Paul Maloney wrote,\n“Hi Giorgio,\nThanks for the summary listing of reference to McCrone’s notes of 3/3/79.  But, actually, may I offer aslight correction to your remark about iron oxide and madder rose.  It was McCrone who saw both the madder rose (not Rogers) AND the iron oxide and that McCrone’s main conclusion was that iron oxide was the basic ingredient in the image color.”\nRegards,\nPaul\n\n","date":"May 25, 2013 at 10:39 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34837","author":"Joe Marino","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thank you Paul for the correction. I believe you too have the Kodachrome slides of McCrone’s 3-CB as well as Nitowski’s. Is it possible to  give me the specific physical description of the matter rose that Roger’s observed in slide 3-CB? \nbelow is a description of a warp fiber from the radiocarbon sample Dr. Rogers observed.\nThermochimica Acta 425 (2005) 189–194\nStudies on the radiocarbon sample from the shroud of turin\nRaymond N. Rogers\nFig. 3. Warp fibers from the radiocarbon sample, 800\n×\nin water. The gum\nis swelling, becoming more transparent, and detaching from the fibers.\nIf I’m not mistaken Nitowski might have addressed this in 1985 paper.\nAs you know her work was scrutinize and some what dismissed by Dr. Adler and others but I’m afraid to report she did have the ears of Turin. \nTHE LOSS OF THE IMAGE:\nA CONSERVATOR’S REPORT\nON THE SHROUD OF TURIN\n\n","date":"May 26, 2013 at 8:18 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34870","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nLouis :\nGiorgio, we have agreed about contamination. As for the colour of what is said to be blood stains, the Australian Dr.Loy is reported to have affirmed that the blood of people who\ndie after a trauma is very red.\n\nHi Louis, \nDid Dr. Loy confirm this relative to trauma specifically or just that he had previously observed old (ancient) blood that had a red color?  Dr. Loy was a molecular archaeologist-when trying to look up contact information for him a couple of years ago, I saw that he had passed away in 2005.\n\n","date":"May 26, 2013 at 2:31 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34849","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Hullo Kelly\nYes, I did also read some time ago about Dr. Loy’s death.Unfortunately the book which I asked Jesterof to consult isn’t within reach now, but if I remember correctly Dr. Loy was saying that ancient blood can retain a very red colour if it was the result of a traumatic death. This was clearly the reason why his opinion was cited in the book. Presumably he dealt with cases of violent death in the ancient world, cases similar to Lindow Man, found in England, and so he was an authority on the subject. Hope this helps and I wish you success in your endeavours.\nBest.\n\n","date":"May 26, 2013 at 10:49 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34878","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Well, if somebody was an expert exactly on the discussed area then it won’t be prudent to intervene.\nI am not an expert on the ancient stains, but in the previous thread and again here I can also tell that I do not see any reason for the stains which are called “blood” but in reality not necessarily are the stains from the whole blood, should not differ in color – the components of the fluid staining the cloths vary, so will the color.\n\n","date":"May 26, 2013 at 3:28 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34894","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\njmarino240 :\nGiorgio wrote, “Joe can you and Paul give me your hypothesis what Dr. McCrone is stating with these remarks?…”\nPaul responded: \nBut McCrone was not the only one to puzzle over the color of “blood” on the Shroud.  Adler, himself puzzled over it and with experimentation told me that he could duplicate the “redness” of the blood by assuming that the Man of the Shroud was a victim of blood trauma where the billirubin was some 500 times concentrated.  Dr. Gilbert Lavoie told me that he and Adler were working on this possibility and that Lavoie had, in his refrigerator, a sample of tramatized blood taken from a man who had suffered from a chain gang beating.  To my knowledge, little further was done on this because Adler passed away from a severe brain hemmorage–a tragic loss to us all.  One might ask Dr. Lavoie for input on this matter.\nBut, to another question put to me by the late lawyer, Benjamin Wiech–why does the blood color appear to keep changing?–I responded that it will depend on the lighting that illumines it.  The “true” color is not seen unless the full spectrum of light shines on it.  (Sunlight is the best resource for this–but, of course, we do not wish UV rays to damage the Shroud and so that is usually filtered out).\n\nHi jesterof,\n1. Was wondering how a bilirubin level 500 times concentrated would compare relative to the levels observed in a patient suffering liver failure or jaundiced newborn?  I realize that these are different scenarios that are apart from trauma & torture leading to death, but just looking for something to understand as a relative comparison.  Also, in terms of laboratory experimentation to create a blood simulacra, are these the levels that are necessary?  Adler remarked in one of his spectra descriptions using finger stick blood samples, that the amount of protein (albumin) they added was too high, so this would be in excess of that.  \nAny numbers on bilirubin levels for normal versus elevated versus extreme traumatic death?\n2. Also, your opinion that the color of the blood on the Shroud is not unusual, that it is not redder than expected, based on your experience has been discussed before.  You also reference it in this thread-would like to just touch on that again, if okay.  \nAs quoted above, Adler seemed puzzled by it.\nI just want to understand your viewpoint, not trying to make you scream or anything. \nTo clarify, do you believe that the color of the blood on the Shroud is not unusual, period, for any dried, aged blood, or that the color of the blood on the Shroud is not unusual for someone that had undergone such experiences of physiological & psychological stress?\nFor those of us that aren’t experienced with observing lots of blood first-hand on a regular basis, an issue that has been commented on before by others is the question of relatively fresh blood versus that which is months, years, many years old-that is, if observation & experience with one necessarily equates with the other.  I don’t view this as a criticism, just an open question.  I also think from the discussion above, there seems to be the idea that perception of the blood color can be highly influenced by the conditions in which one is viewing it, particularly when photographs are used.     \nFinally, a general comment regarding McCrone and the blood:\n   A few weeks ago I spoke with Dr. Henry Lee, the forensic examiner in several high profile cases (OJ, Jon Benet Ramsey, Lacy Peterson).  In the conversation, he mentioned that McCrone had contacted him several times about survival of blood proteins (globulins, albumin) and the electrophoretic analysis of aged bloodstains.  Don’t know if this was to learn more regarding the tests that he, himself, was conducting-he found it difficult to solubilize the samples in general-or if he might have had some (private) second thoughts.  I have read McCrone’s book and especially enjoyed reading the correspondence between him and Fr. Rinaldi-I believe some of these are also available at the Holy Shroud Guild website \nThanks again for your time\n\n","date":"May 26, 2013 at 5:02 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34857","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Hello Kelly, One day when I get more time I’ll be updating the site with more correspondences between Dr. McCrone and Father Rinaldi. In the mean time, here is a link that isn’t password protected.\nhttp://holyshroudguild.org/dr-mccrones-theory-on-how-an-artist-could-have-painted-the-shroud.html\n\n","date":"May 26, 2013 at 7:53 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34866","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"To clarify, do you believe that the color of the blood on the Shroud is not unusual, period, for any dried, aged blood, or that the color of the blood on the Shroud is not unusual for someone that had undergone such experiences of physiological & psychological stress?\nYes. Fro the different photos I see over the web I do not see any unusual “too red” stains  on the Shroud.\nthere seems to be the idea that perception of the blood color can be highly influenced by the conditions in which one is viewing it, particularly when photographs are used. \nyes, it is not only the perception from above it is reflected in the discussion iin books ( I can not tell you which ones, but while on that previous thread I was researching the issue and it appears that the light used is very important)\n\n","date":"May 26, 2013 at 9:20 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34871","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Was wondering how a bilirubin level 500 times concentrated would compare relative to the levels observed in a patient suffering liver failure or jaundiced newborn? I realize that these are different scenarios that are apart from trauma & torture leading to death, but just\nlooking for something to understand as a relative comparison. Also, in terms of laboratory experimentation to create a blood simulacra, are these the levels that are necessary? Adler remarked in one of his spectra descriptions using finger stick blood samples, that the amount of protein (albumin) they added was too high, so this would be in excess of that.\nAny numbers on bilirubin levels for normal versus elevated versus extreme traumatic death?\nthe normal level of bilirubin depending on the system used is \n    Direct bilirubin: 0.1 mg/ dl to 0.3 mg/ dl (1.7 mmol/ l to 5.1 mmol/ l)\n    Indirect bilirubin: 0.2 mg/ dl to 0.8 mg/ dl (3.4 mmol/ l to 12.0 mmol/ l)\n    Total bilirubin: 0.3 mg/ dl to 1.0 mg/ dl (5.1 mmol/ l to 17.0 mmol/ l)\nNIH.gov gives the upper limit of total level as 1.9 mg/dl\nLiver failure can be with both very high and very moderate bilirubin levels, level for one patient might be nit that toxic for the other and yellowness of the skin and mucosa differs as well.\nBilirubin level 500 times higher the normal will take some time to accumulate, so that particular level is probably not a reference here ( if trauma patient is being treated than it might accumulate, but if one dies, probably not)\nI have to leave now and will be back in the evening and will answer the questions gladly.\nIn general just as a remark – it is difficult to predict one’s body response to any one given factor to have a simulacra since as I have stated before – clinical picture and actual picture depends not on one factor of bilirubin, there are much more in the clinical picture we are discussing and all of them might have influence on the results. Therefore singling out bilirubin is a bit puzzling for me ( therefore the comment about screaming :-))))\n\n","date":"May 26, 2013 at 9:30 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34873","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Jestreof wrote: “clinical picture and actual picture depends not on one factor of bilirubin, there are much more in the clinical picture we are discussing and all of them might have influence on the results. Therefore singling out bilirubin is a bit puzzling for me”. 50% agree as light or pre-mordanting along with carbon monoxide could account for intensified bloodstains.\n\n","date":"May 26, 2013 at 2:01 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34890","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Jesterof, you are slowly putting an end to the harping on the issue of bilirubin, so for the time being there is no reason to scream.\n\n","date":"May 26, 2013 at 3:25 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34893","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Louis I was just joking :-) it was mostly with reference to the very long thread on br. hirudo, where the singled issue of bilirubin was discussed\n\n","date":"May 26, 2013 at 3:30 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34895","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I know you were Jesterof, and it would be nice and enlightening if both you and Kelly can contribute more to the study of the blood stains\n\n","date":"May 26, 2013 at 3:52 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34897","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"While discussing the color of blood stains and what can interfere with that I found Alan Adler book where the experiment of evaluating the old blood stains on the lien is described and compared to the Shroud in terms of the waveform absorption( the link below).\nI have to make a remark, however – while reading this and other materials I developed the impression that everybody is discussing the bloodstain on the Shroud as a bloodstains from the WHOLE blood ( if you cut yourself with a knife the blood coming from the wound will resemble the whole blood the most, but if you fell down and scratch your knee, the bloodyish fluid coming from the surface will not be the whole blood – and those will stain differently) when i reality the majority of stains on the Shroud are not the whole blood at all – and therefore the characteristics of those stains including their color can differ from the expected one from the whole blood.\nhttp://books.google.com/books?id=J2jBnDN3VxMC&pg=PA30&lpg=PA30&dq=spectral+data+of+the+Shroud+blood&source=bl&ots=zenDjCt69-&sig=WmPZiDBpkxQp61QSspVy4ZjVddk&hl=en&sa=X&ei=F3djUc-uOYmi8gTL1oCIBw&ved=0CKoBEOgBMA0#v=onepage&q=spectral%20data%20of%20the%20Shroud%20blood&f=false\n\n","date":"May 26, 2013 at 5:03 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34904","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Very good remark concerning the fact that most bloodstains on the Shroud came from exudates of humid blood clots and not whole blood in liquid form.  Adler was very specific about that in his articles concerning the blood and I think this could have had some impact on the reddish aspect of the bloodstains on the cloth…  One thing’s for sure:  If someone in the future would want to reproduce the color of the bloodstains on the Shroud while using a high level of bilirubin, this person will have to do his experiment on dried blood clots that could become humid again on their surface before leaving a mirror image on the cloth.  I have to assume that Adler did his color experiments while using exudates of blood clots…\n\n","date":"May 26, 2013 at 6:14 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34914","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Yannick wrote, “Can you confirm to me that both McCrone and Nitowski have only analyzed samples that were taken by STURP and not by Max Frei or Riggi?”\nPaul responded:\nHere’s the “chain of possession” for the STURP tapes.  Joe Kohlbeck was a good friend of Ray Rogers.  So after Ray got the STURP tapes back from McCrone he sent them to Hercules (to Joseph Kohlbeck) in Salt Lake City, Utah.  While Kohlbeck was studying these tapes he heard of an archaeologist (Dr. Eugenia[Jeannie] Nitowski) who was studying the Shroud of Turin.  So he called her because she lived nearby in a Carmelite Monastery.  They got together and both studied the tapes with Nitowski doing much of the microscopy on the tapes.  It was at this time that I contacted Nitowski on a related matter and she, in turn, sent me some of the STURP tapes!!  I, in turn, sent them first up to Dr. Zugibe, President of ASSIST, and when I got them back from him I forwarded them up to Dr. John A. DeSalvo in Minnesota (John is Vice President of ASSIST) who personally hand delivered them to Ronald Youngquist of the 3 M company–where this tape material had begun their “life” in Shroud research many years before.  Youngquist put together a professional team of scientists at 3M to do their own study.\nMeanwhile, Ray talked with Joe on the phone and discovered what Joe had done.  Joe had loaned the tapes to Jeannie Nitowski.  “WHAT??????”   Ray was upset.  Upon further probing he learned that Jeannie had sent them to “Paul Maloney General Projects Director at ASSIST”  Ray was more upset, “WHAAAAT????!!! ASSIST what?  Paul who????  Then, being the curious kind of guy I am, I called Ray not knowing he was upset with everything that had happened.  But Ray was still upset that the “chain of possession” had been violated.  Actually, there is something to be said for Ray’s concern.  It was his worry that the tapes might be contaminated with how someone else might use them and thereby vitiate their value.  It’s a worry I would still have with the Max Frei Tapes.  So when I got Ray on the phone he went ballistic!  He demanded that the tapes be returned post-haste pronto immediately!  Ray and I later became good friends.  But for the moment I was a phantom stranger who had no pedigree at all!  So–sadly–I had to return the STURP tapes to Ray.  3M never did get a chance to conduct the planned scientific testing they wanted to do.  But I did, indeed, understand Ray’s concern and agreed with it.\nI think while Joe Kohlbeck may have taken some samples for testing in his lab at Hercules, I don’t think Jeannie compromised the tapes in any way.  Her goal was only to do visual photo-microscopy and I have a wealthy album of Kodak transparencies representing the work she did.\nI can assure you that neither Ray Rogers, nor Joseph Kohlbeck, nor Dr. Nitowski ever saw any of the Max Frei Tapes.  They only had access to the STURP tapes.  Moreover, the Riggi materials were in the form of dusts–not mounted on microscope slides at the time and they were not sent by Riggi to Ray, or to Joe, or to Jeannie for additional analysis.\nBest regards,\nPaul\n\n","date":"May 26, 2013 at 4:47 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34903","author":"Joe Marino","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thanks again to Joe and Paul for this answer.  I will print it and read it more carefully later tonight…\n\n","date":"May 26, 2013 at 6:06 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34913","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Hello Joe did you ever had time to forward Paul my message #38?\n\n","date":"May 26, 2013 at 6:21 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34917","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I think you mean 39–about slide 3-CB?   Yes, I did send to him.\n\n","date":"May 26, 2013 at 6:44 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34920","author":"Joe Marino","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nJoe Marino :\nI think you mean 39–about slide 3-CB?   Yes, I did send to him.\n\nI stand corrected. Thank you sir\n\n","date":"May 26, 2013 at 7:03 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34923","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nYannick Clément :\nLouis said : “As for the colour of what is said to be blood stains, the Australian Dr.Loy is reported to have affirmed that the blood of people who die after a trauma is very red.”\nMy comment :  Very interesting information Louis!  This tend to confirm Al Adler’s\nhypothesis concerning the reddish aspect of the blood on the Shroud that would be due to a higher than normal level of bilirubin in the blood that would have been caused by the long and intense tortures suffered by the Shroud man.\nPersonally, I still believe that Adler’s hypothesis is most rational and probable to explain the reddish aspect of the blood on the Shroud!\n\nCan I scream now? :-)\n\n","date":"May 26, 2013 at 5:43 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34907","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Why would you?\n\n","date":"May 26, 2013 at 6:01 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34911","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Jesterof and Yannick, between Adler and McCrone I would vote for the former. Jesterof, its too early to scream, let’s wait till Giorgio posts some of that correspondence on the HSG website.\n\n","date":"May 26, 2013 at 6:16 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34915","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Here’s a questioning that came into my mind after the reading of Mr. Maloney’s comment :\nIs it a PROVEN FACT that the sample 3-CB has been taken from a bloodstained area of the cloth?  \nIn his comment, Mr. Maloney wrote this: “3-CB, however, APPARENTLY, is on a blood-flow across the back, just below the 1534 patch also on the side-strip side of the cloth.”  The fact that Mr. Maloney use the word “apparently” seem very ambiguous here…  I really wonder if this particular sample really came from the blood flow across the back or not because, in my mind, after watching this particular zone of the cloth with the Shroud Scope of Mario Latendresse, it seems to me that this area is located just outside the blood flow in question, in a non-image zone where there are some scorches from the 1532 fire, which shows a color pretty similar to the evident blood flow that is located beside.  I wonder if these particular scorches could not have been wrongly taken for a part of the blood flow across the back or if it is really a PROVEN FACT that there is also a portion of the long blood flow across the back there.  In other words, is it a PROVEN FACT that some blood material has been found in this sample 3-CB?  And even if this was the case, how can we be certain that this blood material was not originally located just beside and have not been move there because of the numerous manipulations, folding and unfolding of the cloth over the centuries?\nThe reason I ask these questions about the sample 3-CB is simple:  Since the area that has been sampled doesn’t appear to show any body image, if it could be proven that there really is a continuity of the blood flow there, then this would be another good piece of evidence to think that there really has been 2 different configurations of the Shroud over the body:  a first one, which probably became very tight at some point because of the transfer of the enshrouded body from a central place in the tomb to a final resting place inside a wall, and that has lead to the transfer of many humid blood clots on the cloth but no body image and a second one (the final one, probably more loose without the use of any strips except maybe around the feet) that has lead probably to the transfer of some other humid blood clots on the cloth, as well as the formation of the body image.  \nTo my eyes, I’m pretty sure that there is a continuity of the blood flow across the back and outside the body image on the other side of the body image (away from the side-strip) but I’m not so sure that there really is the same kind of continuity of the blood flow on the side of the side-strip, i.e. in the area where the sample 3-CB was taken.  That’s why I wonder if this assumption (reported by Mr. Maloney) has been scientifically proven or if it is just another assumption that still needs to be scientifically confirmed? \nSo, I hope Mr. Maloney himself or Joe Marino will read this comment of mine and can bring me the correct answers!  Thank you in advance for taking time to do this for me (and surely, for many other bloggers who will read this)!\nFinal message for everyone:  Of course, you’re free to comment on my personal hypothesis of two different configurations of the cloth before the formation of the image, but that’s not the main point here…  The main point is the questions I asked concerning the presence or not of blood in the area where the sample 3-CB was taken.\n\n","date":"May 26, 2013 at 6:56 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34921","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\njesterof :\nWhile discussing the color of blood stains and what can interfere with that I found Alan \nAdler book where the experiment of evaluating the old blood stains on the lien is described and compared to the Shroud in terms of the waveform absorption( the link below).\nI have to make a remark, however – while reading this and other materials I developed the impression that everybody is discussing the bloodstain on the Shroud as a bloodstains from the WHOLE blood ( if you cut yourself with a knife the blood coming from the wound will resemble the whole blood the most, but if you fell down and scratch your knee, the bloodyish fluid coming from the surface will not be the whole blood – and those will stain differently) when i reality the majority of stains on the Shroud are not the whole blood at all – and therefore the characteristics of those stains including their color can differ from the expected one from the whole blood.\nhttp://books.google.com/books?id=J2jBnDN3VxMC&pg=PA30&lpg=PA30&dq=spectral+data+of+the+Shroud+blood&source=bl&ots=zenDjCt69-&sig=WmPZiDBpkxQp61QSspVy4ZjVddk&hl=en&sa=X&ei=F3djUc-uOYmi8gTL1oCIBw&ved=0CKoBEOgBMA0#v=onepage&q=spectral%20data%20of%20the%20Shroud%20blood&f=false\n\nJesterof,\nThanks very much for your previous answers \nSo, does this mean you are somewhat revising your opinion regarding the red color of the Shroud  bloodstains or am I off base here?  I couldn’t really tell from reading this if that was partbof what you were saying\nAlso, a quick follow up regarding the 500x bilirubin and the serum level values you gave.  In whole blood, the concentrations are expressed relative to blood volume.  How would such quantitation apply to dried bloodstains-testing threads via microspotting techniques or spectroscopy? \nAgain, many thanks for your time\n\n","date":"May 26, 2013 at 6:57 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34922","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"It’s getting to like Dear Abby here! LOL\n\n","date":"May 26, 2013 at 7:04 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34924","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nYannick Clément :\nWhy would you?\n\nYou missed all the fun ))))\n\n","date":"May 26, 2013 at 7:13 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34925","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Sorry, I don’t understand a word of what you’re talking about…\n\n","date":"May 26, 2013 at 7:21 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34928","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I was talking about a very long thread on br.hirudo where I expressed my surprise on the description of the color as “too red” and the hypothesis of bilirubin was discussed there (as was also a concept of blood stains being not from the whole blood only and how it influences the color).\nPersonally, I am not sure bilirubin can be blamed – it is very unstable and to expect that it will last centuries just to make some stain look “too red” in a subjective evaluation is not very convincing to me.\nThat’s why I joked that if I hear bilirubin and too rd one more time I’ll scream.\nYou missed that thread so you did not understand the context.\n\n","date":"May 26, 2013 at 7:54 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34935","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thanks for the precision.  But concerning Al Adler’s hypothesis, I learned from Mr. Kearse that he did some coloration test with different level of bilirubin and the one that came out closer to the color of the Shroud blood was the one with a very high level of bilirubin.  I know that this doesn’t prove that the color would still be red 2000 years later, but don’t you think that this bilirubin hypothesis makes plenty of sense in the context of the Shroud on which we see the body image of a crucified victim who had been very badly tortured?  In such context, everytime I will expect to see a level of bilirubin in the bloodstains much higher than normal!  So, why this hypothesis proposed by Adler would not be the solution for the unusual aspect of the blood color?  Sometimes, the most simple answers are the best.  And this time, this simple answer of Adler fits perfectly well with the context of the burial cloth of a crucified victim.  In my mind, this simple fact give Adler’s hypothesis some crédits.\n\n","date":"May 26, 2013 at 8:08 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34939","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nKelly Kearse :\nJesterof,\nThanks very much for your previous answers\nSo, does this mean you are somewhat revising your opinion regarding the red color of the Shroud  bloodstains or am I off base here?  I couldn’t really tell from reading this if that was partbof what you were saying\nAlso, a quick follow up regarding the 500x bilirubin and the serum level values you gave.  In whole blood, the concentrations are expressed relative to blood volume.  How would such quantitation apply to dried bloodstains-testing threads via microspotting techniques or spectroscopy?\nAgain, many thanks for your time\n\nNo, quite to the contrary – I stand by that the color of the blood stains is not “too red” it is actually what to be expected. And I am still surprised that the notion of “too red” which started by McCrone ( who was actually describing NOT blood and his description of color is irrelevant) was not scoffed off at the very beginning.\nHowever, I did not see the original live. But, the others did not see it in a sunlight either.\nSubjective description of “too red” is just subjective.\nA.Adler description of the experiment is not confirming the subjective vision ( I am talking about the absorption wavelenght)\n\n","date":"May 26, 2013 at 7:18 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34926","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"The too red aspect of the blood on the Shroud is something that already bugged many STURP members while they were in Turin in 1978!  So, thinking that McCrone started this issue is completely wrong, I’m sorry.\nThere is a good difference of tonality of color between the blood on the Shroud and most ancient blood and that’s a well-recognized fact and this fact MUST BE PROPERLY EXPLAINED.  But let’s think about it:  If Adler was right about the high bilirubin level, maybe you’re right after all by saying that the reddish aspect of the blood on the Shroud is normal.  But you should precise that it is normal IN THE CONTEXT OF SOMEONE WHO HAD BEEN BEATEN, SCOURGED, CROWNED WITH THORNS AND CRUCIFIED PRIOR TO HIS DEATH…\nBy the way, you should note that this isn’t the case for the blood on the Sudarium (at least not for the blood that was shed in life and that is supposed to have come from the nape of the neck).  So, if Adler is correct with his hypothesis, that would mean the Sudarium was probably NOT in contact with the same traumatized head…\n\n","date":"May 26, 2013 at 7:27 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34929","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nGiorgio :\nIt’s getting to like Dear Abby here! LOL\n\nGuilty as charged-just want to know his opinion\nSigned,\nInquisitive in Idaho\n\n","date":"May 26, 2013 at 7:19 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34927","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\njesterof :\n\nKelly Kearse :\nJesterof,\nThanks very much for your previous answers\nSo, does this mean you are somewhat revising your opinion regarding the red color of the Shroud  bloodstains or am I off base here?  I couldn’t really tell from reading this if that was partbof what you were saying\nAlso, a quick follow up regarding the 500x bilirubin and the serum level values you gave.  In whole blood, the concentrations are expressed relative to blood volume.  How would such quantitation apply to dried bloodstains-testing threads via microspotting techniques or spectroscopy?\nAgain, many thanks for your time\n\nNo, quite to the contrary – I stand by that the color of the blood stains is not “too red” it is actually what to be expected. And I am still surprised that the notion of “too red” which started by McCrone ( who was actually describing NOT blood and his description of color is irrelevant) was not scoffed off at the very beginning.\nHowever, I did not see the original live. But, the others did not see it in a sunlight either.\nSubjective description of “too red” is just subjective.\nA.Adler description of the experiment is not confirming the subjective vision ( I am talking about the absorption wavelenght)\n\nDid the idea of “too red” really start with McCrone?  I was under the impresssion that members of the STURP team looking at the whole cloth were impressed by the color of the blood-McCrone was not part of the group that went to Turin.  Did Adler hear this originally from McCrone or did he reach his opinion independently?\nNot to try your patience, but sorry, I just don’t know what this statement means “A.Adler description of the experiment is not confirming the subjective vision ( I am talking about the absorption wavelenght)”.\n\n","date":"May 26, 2013 at 7:32 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34931","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"The link I provided is to the book by Alan Adler and the experiment where he stained an old linen with blood and then in a year they tested it spechtometrically and compared to the Shroud stains. He gives the wavelength of absorption both for the Shroud and the experimental cloth – that figures to not stand out.\nOne has also to remember what light source is being used in the stain evaluation as it differs a lot on the resultant absorption wavelength described.\n\n","date":"May 26, 2013 at 7:59 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34937","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nAlso, a quick follow up regarding the 500x bilirubin and the serum level values you gave.  In whole blood, the concentrations are expressed relative to blood volume.  How would such quantitation apply to dried bloodstains-testing threads via microspotting techniques or spectroscopy?\nAgain, many thanks for your time\n\nThe concentration are still going to be in the same values, as will be the Hgb value. There should be a conversion method used, but those are the details of the technique.\n(Has anybody tested the Hgb concentration of the stains? It might answer the question what kind of bodily fluid stained it)\nhere is a description of the patent which actually uses the spectrophotometry of a dried blood sample on a paper to detect hemoglobin concentration.\n I do not see any problems with analogue for detecting the bilirubin concentration of the dried stain\nhttp://www.google.com/patents/US20120257188\n\n","date":"May 26, 2013 at 7:34 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34932","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nJesterof and Yannick, between Adler and McCrone I would vote for the former. Jesterof, its too early to scream, let’s wait till Giorgio posts some of that correspondence on the HSG website.\n\nI would too, since he is the only one talking about blood. However, I think he might have been unconsciously pushed in that direction by McCrone who was not even talking of blood\n\n","date":"May 26, 2013 at 7:39 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34933","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Jesterof, you have only read part of the reports, other than Dr Adler there were drs. Heller, Baima Bollone and Rodante talking about blood.\n\n","date":"May 26, 2013 at 8:02 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34938","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Well, I have also seen the photos by my own eyes and I trust them more then the reports I have not read :-)\nIrony aside – is there an online link to any of those?\nThanks\n\n","date":"May 26, 2013 at 8:20 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34944","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\njesterof :\n\nAlso, a quick follow up regarding the 500x bilirubin and the serum level values you gave.  In whole blood, the concentrations are expressed relative to blood volume.  How would such quantitation apply to dried bloodstains-testing threads via microspotting techniques or spectroscopy?\nAgain, many thanks for your time\n\nThe concentration are still going to be in the same values, as will be the Hgb value. There should be a conversion method used, but those are the details of the technique.\n(Has anybody tested the Hgb concentration of the stains? It might answer the question what kind of bodily fluid stained it)\nhere is a description of the patent which actually uses the spectrophotometry of a dried blood sample on a paper to detect hemoglobin concentration.\n I do not see any problems with analogue for detecting the bilirubin concentration of the dried stain\nhttp://www.google.com/patents/US20120257188\n\nThanks for the link and the reply.  Here’s my issue-in the link, this is a dried blood sample of known volume-it’s easy to trace backwards and normalize the amount, because the original volume is known-the concentration is expressed per unit volume.  But, how does one accurately determine the relative volume of blood contained within a thread or tape lift from an aged, dried bloodstain?  What volume do you normalize it to?  A thread that received more blood transferred relative to one that received less will appear to have a higher concentration of that protein per surface area, even though the overall levels in the original blood should be equivalent.  Is  quantitation from dried bloodstains (of unknown volume) really equivalent to such a test as described in the link?  I would think there would have to be another protein to normalize it to, similar to normalizing it per unit volume.\n\n","date":"May 26, 2013 at 7:54 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34934","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Kelly, I honestly do not understand your question. The units used are just the units used, it is an agreed method, the spectrophotometry uses the wavelength absorption and then they have to use some mathematical conversion tables. I am not the mathematician or statistician and those details are beyond my knowledge. I can dig on-line to it, but I just do not see what is the confusion.\nIf we calculate the concentration of the substance it does not matter what we will refer to – a stain or serum of the alive patient. You may calculate it by using the presented method by the dried sample on a paper ( and it will tell you how much of the substance is per volume unit of blood, or serum, since those are commonly agreed values of reference) or by measuring the whole amount in a sample of blood which will be exactly 100 ml – but the latter is just impractical.\nI believe it is an area of analytical chemistry which I’ve studied back in medical school, but forgive me, I have forgotten it long time ago :-)\n” A thread that received more blood transferred relative to one that received less will appear to have a higher concentration of that protein per surface area, even though the overall levels in the original blood should be equivalent. ”\nNo it would not. Because they do not calculate ABSOLUTE amount of any substance in that particular point, but adjust it accordingly  to the unit of measurement.\n\n","date":"May 26, 2013 at 8:09 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34940","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"If you calculate how much does the stain weighs and then how much of that weight is hemoglobin ( as an example) an you get that it is half the weight of the whole stain you may refer to it as hemoglobin concentration is 50% of the stain which is also the unit measurement. How will you covert those practically absolute numbers to the relative numbers of units per volume one has to ask the mathematician\n\n","date":"May 26, 2013 at 8:15 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34943","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nYannick Clément :\nThanks for the precision.  But concerning Al Adler’s hypothesis, I learned from Mr.\nKearse that he did some coloration test with different level of bilirubin and the one that came out closer to the color of the Shroud blood was the one with a very high level of bilirubin.  I know that this doesn’t prove that the color would still be red 2000 years later, but don’t you think that this bilirubin hypothesis makes plenty of sense in the context of the Shroud on which we see the body image of a crucified victim who had been very badly tortured?  In such context, everytime I will expect to see a level of bilirubin in the bloodstains much higher than normal!  So, why this hypothesis proposed by Adler would not be the solution for the unusual aspect of the blood color?  Sometimes, the most simple answers are the best.  And this time, this simple answer of Adler fits perfectly well with the context of the burial cloth of a crucified victim.  In my mind, this simple fact give Adler’s hypothesis some crédits.\n\nThe hypothesis by itself is  valid.\nThe problem is – I do not see those pictures as “too red”\nThey are NORMAL. as they are supposed to be – to my eyes and I am used to all kinds of blood stains – from whole blood, from blood stinged bodily fluids and so on. To dried stains also. Obviously, not ages old, but if the stain form different body fluids with addition to blood do stain in different color when they are fresh or just have dried a day ago, I do not see any reason why should not they differ centuries later as well.\nThen, somewhere I’ve read that “too red” is referred only to ONE stain as a spike of the absorption waveform to 650nm and all others are below 500nm.\nBut below 500nm is totally where they are expected to be!\nSo do you, personally, know which specific stains are refereed as “too red”, what absorption wavelength are they and what method was used to evaluate them?\n\n","date":"May 26, 2013 at 8:27 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34945","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"All I can answer is this: please read my comment #69!  The fact that many STURP members were bugged by the reddish aspect of the blood on site in Turin in 1978 can be easily confirmed by Barrie Schwortz…  He said this many times in interviews.\n\n","date":"May 26, 2013 at 8:31 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34947","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"The fact that they are budged doe not prove anything.\nNeither of them watched the Shroud in a sunlight.\nThe source of light especially for the photos does change the color and one might not see the diference.\nPeople have individual color perception and it is subjective.\nThat’s why I’ve asked – do you know about which particular stain they are talking about, what method of spechtrophotometry was used and what is the absorption wavelenght of the stain in question – everything else is just poetry.\nFrom the top of my head I do not recall the STURP membber being very much exposed to a lot of blood and it’s stains.\nWith one exception  Robert Bucklin might have seen those.\nDid HE also referred to the blood stains as “too red”.\nNot the physicists, not the photographers, not the chemists – this one person might have the right to determine what is “too red” in a blood stain as he has seen the others as well.\n\n","date":"May 26, 2013 at 8:41 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34951","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"You got a good point here:  I don’t remember that medical experts like Barbet (who saw the Shroud in sunlight in Turin in 1933) or Bucklin have said a word concerning a potential problem with the color of the blood on the cloth.  Good point.  Maybe this whole issue started because of some STURP members that were not at all medical experts and who only thought (because of a problem of perception as you said) that the blood was too red…  Maybe you’re right after all.  And maybe the blood on the Shroud doesn’t show too much difference of tone compared to the blood on the Sudarium of Oviedo after all.  Only a blood expert who could have seen both cloth in sunlight (not photos but the real cloth) could tell…\n\n","date":"May 26, 2013 at 8:56 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34960","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"After reading many comments here from Mr. Kearse and jesterof, I ended up with a very bad headache!  I remember now why I never was interested to go into science at school… ;-)\n\n","date":"May 26, 2013 at 8:29 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34946","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nYannick Clément :\nAfter reading many comments here from Mr. Kearse and jesterof, I ended up with a very bad headache!  I remember now why I never was interested to go into science at school…\n;-)\n\nYou may scream :-)\n\n","date":"May 26, 2013 at 8:33 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34948","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I think I will back-off instead!!! ;-)\n\n","date":"May 26, 2013 at 8:57 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34961","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Jesterof, re. # 76 With all this talk about — you said it  —bilirubin, go to\nhttp://www.ohioshroudconference.com/papers/p04.pdf\nand  —you said it — for blood, go to\nhttp://www.ohioshroudconference.com/papers/p19.pdf\nThis is just for a start and you will have piles to read, so maybe you get get hold of a nice Shroud book to save time.\n\n","date":"May 26, 2013 at 8:37 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34950","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Ha, that is what is needed. Thanks, Louis.\nAlready the first link answered some questions  – it is actually while exposed to bright UV light when the color of the stains starts to be different ( so my eyes are just fine ))))\nThat is when UV shines directly, the color brightens – now, I have the answer to the bilirubin question – because it reacts to the UV light.\n\n","date":"May 26, 2013 at 8:52 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34957","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\njesterof :\nKelly, I honestly do not understand your question. The units used are just the units used, it is an agreed method, the spectrophotometry uses the wavelength absorption and then the\ny have to use some mathematical conversion tables. I am not the mathematician or statistician and those details are beyond my knowledge. I can dig on-line to it, but I just do not see what is the confusion.\nIf we calculate the concentration of the substance it does not matter what we will refer to – a stain or serum of the alive patient. You may calculate it by using the presented method by the dried sample on a paper ( and it will tell you how much of the substance is per volume unit of blood, or serum, since those are commonly agreed values of reference) or by measuring the whole amount in a sample of blood which will be exactly 100 ml – but the latter is just impractical.\nI believe it is an area of analytical chemistry which I’ve studied back in medical school, but forgive me, I have forgotten it long time ago :-)\n” A thread that received more blood transferred relative to one that received less will appear to have a higher concentration of that protein per surface area, even though the overall levels in the original blood should be equivalent. ”\nNo it would not. Because they do not calculate ABSOLUTE amount of any substance in that particular point, but adjust it accordingly  to the unit of measurement.\n\nFor microspottingtechniques: The adjustment is precisely the problem.  if you have no adjustment, nothing to normailize it to, then you can’t accurately quantitate the value. I realize they do not calculate absolute amount, it is adjusted or normalized-that’s where the issue is-how do you calculate unit volume for a thread, tape lift to make the adjustment?  It is like trying to calculate speed by knowing how far someone ran, but not having an accurate measurement/value for time.  Or knowing how much money someone has in their pocket from work, but not knowing how many hours they were there and trying to determine their wage.  For whole blood, serum, or pipetting a known amount of blood as shown in the link, no problem, you can make the adjustment easily.  The figures shown express the amount there per unit volume because they know the amount of volume that was used.  For a sample dried on a thread, or a tape lift, this is a great unknown-you can tell how much is there, but per what unit volume?\nFor spectroscopy, my understanding is that this is semi-quantitative at best-a relative comparison can be made between heights of particular peaks to evaluate their general representation, but without something to compare it to, can you truly quantitate how much is there?\n\n","date":"May 26, 2013 at 8:49 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34953","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I think we will need to find an analytical chemist here to explain, but I do not see the problem.\nIf they know how to calculate this in forensic pathology ( and they do and use it because one can find tons of clues in one’s blood and a stain as a proxy) I would assume that is not as problem to do in respect to the Shroud as well.\n\n","date":"May 26, 2013 at 9:00 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34963","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\njesterof :\nIf you calculate how much does the stain weighs and then how much of that weight is hemoglobin ( as an example) an you get that it is half the weight of the whole stain you may\nrefer to it as hemoglobin concentration is 50% of the stain which is also the unit measurement. How will you covert those practically absolute numbers to the relative numbers of units per volume one has to ask the mathematician\n\nI don’t think the sensitivity is there for this to work-don’t think you could determine how much of the weight of a thread, tape-lift was a particular component\n\n","date":"May 26, 2013 at 8:52 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34956","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I did not talk about it reference to this one, just as an example that we are not using absolute amounts but units so one can measure the amounts by sampling of a smaller amount or by different methods, like using the angles of refraction depending on the amounts of refracting substances or wave absorption\n\n","date":"May 26, 2013 at 8:55 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34959","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Message to jesterof:  can you tell me your speciality and your scientific background please?  Just to know who’s the man in front of me!  Thanks!\n\n","date":"May 26, 2013 at 8:58 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34962","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I am a physician.\n\n","date":"May 26, 2013 at 9:01 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34964","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Ok…  I guess that’s good enough for me. :)\n\n","date":"May 26, 2013 at 9:02 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34966","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"One more question to jesterof:  Since Rogers proved that a 25 years old bloodstain (he used whole blood in liquid form for his experiment) could stay red if the cloth has been washed with saponaria, do you think that if the cloth have really been washed with this substance (remember that no one has ever been able to confirm the presence of any trace of saponaria on the Shroud), this could have had some kind of impact on the color of the blood we can see today on the cloth?\n\n","date":"May 26, 2013 at 9:02 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34965","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"there are plenty of compounds which will react with blood components and will change the color, or the pH, or the clotting time, or the fibrinolysis time.. or else.\nBlood is a very complex matter and there are many factors which will interfere with it and will change it characteristics.\nBut I finally have the answer to my question and am happy I am not color-blind ( it is almost impossible anyway, but) – the unusual brightness is visible ONLY when exposed to the bright UV irradiation – as sunlight. It is not visible in-house.\nso your statement ” on the color of the blood we can see today on the cloth” is wrong – as neither you, nor me can see it on the cloth – it can be seen only upon exposition to UV light.\nWe have a witness to this – Antoine Legrand – who have seen the Shroud upon exposition in a bright sunlight in 1931 and then much later in the 60s – have noticed that the color is not bright carmine anymore – because he actually have seen the Shroud exposed to sunlight. This is all in Louis’s first link.\n\n","date":"May 26, 2013 at 9:15 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34967","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Please read my comment #83…  I report the same thing concerning Barbet who also saw the Shroud Under sunlight in 1933 (or 1931 I’m not sure) and who never said a word in his book about a potential problem with the color of the blood.  For Barbet, it seemed that the Shroud blood appeared totally normal for ancient bloodstains coming from exudates of blood clots.  This fact has always bugged me versus all that was said by others concerning the so-called problem of the reddish aspect of the blood.  Now, I start to think that maybe you’re right after all and that there is possibly nothing wrong or special with the color of the blood on the Shroud…\n\n","date":"May 26, 2013 at 9:27 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34970","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"“The hypothesis by itself is valid.\nThe problem is – I do not see those pictures as “too red”\nThey are NORMAL. as they are supposed to be – to my eyes and I am used to all kinds of blood stains – from whole blood, from blood stinged bodily fluids and so on. To dried stains also. Obviously, not ages old, but if the stain form different body fluids with addition to blood do stain in different color when they are fresh or just have dried a day ago, I do not see any reason why should not they differ centuries later as well.”\n I don’t think you have to go to centuries later, but I think you have to consider things past just a few days.  The general consensus of most forensic scientists is that as blood ages, over time, it becomes brownish to black in color.  That is from being used to all kinds of blood stains in their line of work-fresh, few days old, months old, years old, etc.  I don’t want to speak in their place, but I believe they might consider that normal as it is supposed to be-I do respect your opinion, but therein lies the dilemma-the time component is viewed as an important one\n\n","date":"May 26, 2013 at 9:17 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34968","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nKelly Kearse :\n“The hypothesis by itself is valid.\nThe problem is – I do not see those pictures as “too red”\nThey are NORMAL. as they are supposed to be – to my eyes and I am used to all kinds of blood stains – from whole blood, from blood stinged bodily fluids and so on. To dried stains also. Obviously, not ages old, but if the stain form different body fluids with addition to blood do stain in different color when they are fresh or just have dried a day ago, I do not see any reason why should not they differ centuries later as well.”\n I don’t think you have to go to centuries later, but I think you have to consider things past just a few days.  The general consensus of most forensic scientists is that as blood ages, over time, it becomes brownish to black in color.  That is from being used to all kinds of blood stains in their line of work-fresh, few days old, months old, years old, etc.  I don’t want to speak in their place, but I believe they might consider that normal as it is supposed to be-I do respect your opinion, but therein lies the dilemma-the time component is viewed as an important one\n\nBut it IS brown. When you look upon it on the photos, or in the building – it is normal brownish color and not “too red”. as old blood is supposed to be\nIt changes color (brightens) only upon exposition to bright sunlight or UV light – which explains immediately why bilirubin was brought up at all – it is bilirubin which brightens it up, because it reacts with UV light.\nThanks to Louis’s link I finally have had the answer to my question and I was right ( in terms that I do not see those stains “too red” at all, because they are not on the presented photos).\n\n","date":"May 26, 2013 at 9:23 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34969","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Your posts jesterof are fabulous because, as you did, I start myself to see more clearly about this issue!!!  I think you’re right…  And note what I reports concerning Barbet!  Even if he did saw the Shroud Under sunlight in Turin in 1933 I think, he still wrote in his book that the bloodstains he saw were surely caused by exudates of humid blood clots and not by whole blood that would have been in a liquid form (a very important fact that was confirmed later on by Baima Bollone and Adler and that Zugibe never seemed to understood).  Never in his book did Barbet mention a problem concerning the color of the blood HE DID SAW on the Shroud!\n\n","date":"May 26, 2013 at 9:32 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34971","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thanks, Yannick, when I read about Barbet I recalled one of the threads you have been talking about him.\n\n","date":"May 26, 2013 at 9:36 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34973","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I guess that’s because, as a doctor on the battle fields during WWI, he surely was well aware of the fact that any bloodstains look more red under the sun…  And it’s true that when you look at positive pictures from the Shroud (like the ones we can see on Mario Latendresse Shroud Scope website), it is VERY DIFFICULT to distinguish between a bloodstain and a light scorch!  This proves that what you said to Mr. Kearse is true: But it IS brown. When you look upon it on the photos, or in the building – it is normal brownish color and not “too red”. as old blood is supposed to be.\nVery good point!\n\n","date":"May 26, 2013 at 9:38 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34974","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"The main question that remains unanswered is this:  Who started all this “blood is too red” issue?  Since Barbet published his book around 1950 and never address that issue, I’m sure this so-called “problem” (which is like a Pandora’s box) was published later on, probably before STURP went to Turin.  Maybe that’s why some members of STURP had some preconcieved ideas about a potential problem with the color of the blood…  That would explain many things.  I really would like to know who started this whole issue.\n\n","date":"May 26, 2013 at 9:41 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34977","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"And if he never mentioned color being “too red” and he is a physician, that means he did see those stains as normal stains and nothing more…\n\n","date":"May 26, 2013 at 9:42 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34978","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"EXACTLY!  People like Daveb or Ron will surely tell that I’m biased over Barbet because he is a Frenchman, but I will say it again:  This guy is, along with people like Vignon and Rogers, the scientist who, in my mind, understood the Shroud better than anyone else.  And what’s the most extraordinary thing about Barbet is the fact that, even if he did saw the cloth live in Turin in 1933, he did all his work from close-ups of Enrie’s photos (of course, along with some experiments with real corpse or body parts)!!!  The same is true for Vignon.  This prove how these guys were clever.\n\n","date":"May 26, 2013 at 9:48 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34980","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Agreed. My hat is off to them.\n\n","date":"May 26, 2013 at 9:53 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34982","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"YC’s comment is bloody impertinent! I have not posted a single comment in this thread, and I have never made any criticism against le medecin Pierre Barbet, but instead I have often quoted and cited him favourably on this site elsewhere! Any bias is totally inside M Clement’s brain! Likewise I recall not a single criticism against Barbet from Chris! There’s a lack of good will being demonstrated here!\n\n","date":"May 27, 2013 at 3:36 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34999","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I think YC was being cheeky about ‘the French connection’ – I didn’t read his comment as implying you had an anti-French bias, rather that he may be a bit too pro-French. It’s not a lack of goodwill, more like a lack of posting too hastily on his part. That’s how it read to me anyway.\n\n","date":"May 27, 2013 at 9:31 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35011","author":"David Goulet","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Daveb, if you’re honest, you’ll agree with me that you often criticized my French-Quebecer root…  That’s why I add your name along side of Ron, who is, I admit, the one who often criticized me for considering Barbet as one of the greatest Shroud researcher of all time.  Sorry if my comment has offended you…\n\n","date":"May 27, 2013 at 10:11 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35012","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Apology accepted, but your charge of any anti-French bias is again misplaced. I had a great-grandfather from Lorraine, who served with the French Army maintaining survey instruments in Northern Africa during the colonial era. He came to this country in 1865 setting up a jeweller’s business on the West Coast during the height of the Gold Rush there. His sons attended Nelson College with the great NZ physicist Earnest Rutherford. I was consistently top of my French classes at college. I have met a married couple from Quebec who showed the greatest refinement in manners. But I find that the question of sound and proper judgement in such matters is a personal quality independent of any provincial stereotyping, a faculty which in my mind you have too often failed to demonstrate.\n\n","date":"May 27, 2013 at 5:27 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35049","author":"daveb of wellington nz","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Jesterof,\nOf course: a few more questions! Want to get this straight:\n1. Would bilirubin be stable over this amount of time?  Also, doesn’t uv treatment break down bilirubin-treatment of jaundiced newborns, etc?  Would breakdown products show a similar effect?\n2. If  the Shroud was taken out and uv light was specifically, uniquely filtered out, you would observe a “shift” in appearance from red to brown?  If the epsilon stain were examined as such, one side filtered, one side not, you would see a brown/red split?\nThanks again for your time\n\n","date":"May 26, 2013 at 9:44 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34979","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Would bilirubin be stable over this amount of time?\nNow, that is the question :-) well, if it was found in the stains – then it has stayed there. Why and how – I don’t know.\nYhe treatment of ALIVE jaundiced newborns and fixed stains on the Shroud – is a totally different issue.\nYou do not have to expose the babies to the UV light – bilirubin is cleared from the blood all the time by the very body – it is one of it’s functions. UV light just help to prevent the kernicterus by changing the bilirubin from it toxic form to non-toxic ( to the brain)\n2. If the Shroud was taken out and uv light was specifically, uniquely filtered out, you would observe a “shift” in appearance from red to brown? If the epsilon stain were examined as such, one side filtered, one side not, you would see a brown/red split?\nThat I do not know – one has to read the description of the experiments for the details.\nTheoretically if one puts a shield unpermeable to the UV light and then one part is irradiated and observed and the other as well – there should be a split. I do not know how practically possible is it to accomplish this, though – the stains are not large\n\n","date":"May 26, 2013 at 10:02 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34984","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nYannick Clément :\nThe main question that remains unanswered is this:  Who started all this “blood is too\nred” issue?  Since Barbet published his book around 1950 and never address that issue, I’m sure this so-called “problem” (which is like a Pandora’s box) was published later on, probably before STURP went to Turin.  Maybe that’s why some members of STURP had some preconcieved ideas about a potential problem with the color of the blood…  That would explain many things.  I really would like to know who started this whole issue.\n\nWell, by Louis’s link one can assume it was actually described after the Shroud being outside the Cathedral for Exposition in 1931 in a bright sunlight by many – some of the witnesses were able to see the Shroud later and were even surprised it is not that bright anymore ( the above mentioned Lagrand), but others did not and since most of the people are not medical doctors and often do not pay attention to such details, the legend of being “too red” rolled out into the masses :-) So you are right, some memebers of STURP team might have had the preconcieved ideas about the coloring.\nHowever, one has to read the exact words told by STURP members in order to judge, because I suppose they did know it is “too red” only under special conditions – as it was known to researchers before – the folks repeating the idea did not bother to remeber the difference and the words ( probable) ” it is very bright upon sun light exposure” changed just to “it’s too bright” – this is a standard psychological turn, since if most of the people won’t consider “sunlight ( or UV) exposure” to be the most pertinent part of the sentence.\nJust speculating :-)\n\n","date":"May 26, 2013 at 9:52 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34981","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\njesterof :\nWould bilirubin be stable over this amount of time?\nNow, that is the question :-) well, if it was found in the stains – then it has stayed there.\nWhy and how – I don’t know.\nYhe treatment of ALIVE jaundiced newborns and fixed stains on the Shroud – is a totally different issue.\nYou do not have to expose the babies to the UV light – bilirubin is cleared from the blood all the time by the very body – it is one of it’s functions. UV light just help to prevent the kernicterus by changing the bilirubin from it toxic form to non-toxic ( to the brain)\n2. If the Shroud was taken out and uv light was specifically, uniquely filtered out, you would observe a “shift” in appearance from red to brown? If the epsilon stain were examined as such, one side filtered, one side not, you would see a brown/red split?\nThat I do not know – one has to read the description of the experiments for the details.\nTheoretically if one puts a shield unpermeable to the UV light and then one part is irradiated and observed and the other as well – there should be a split. I do not know how practically possible is it to accomplish this, though – the stains are not large\n\nOkay-thanks very much-no more questions tonight, promise :)\nEnjoyed this discussion\n\n","date":"May 26, 2013 at 10:05 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34985","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Likewise :)\nGood night, everybody.\nIt was a great discussion.\n\n","date":"May 26, 2013 at 10:07 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34986","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Good night Jesterof, and be prepared,you will have a lot more research to do.\n\n","date":"May 26, 2013 at 11:13 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-34990","author":"Louis","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Hello again jesterof (& others),\njesterof-I would like to begin by saying thank you again for the recent discussions -more questions to follow below, of course, but I hope you don’t view this as an interrogation-it is certainly not meant to be.  Also, although it may appear that by asking so many questions, I am trying to challenge your viewpoint(s), this is not the case, I ask questions because I am interested.  Respond as time (or patience ☺) permits, this is not designed to be an overwhelming barrage. BTW, a respite is soon forthcoming, at least from me, in a few days I will be away without any internet access for 2-3 days. \nSome of the posts seem to get bumped around-I will number these comments to help keep them straight and make things easier to follow.\n1. In the link provided by Louis (Faccini article), when I look at those images, which are a computerized processing of the TS image, they appear very brownish to me, as well, absolutely, though, to be honest, to my untrained eyes, it looks as though the contrast is dialed way up here, more than in some other photographs.  This is one of the problems, I suppose, that how an image is enhanced, contrasted, photograph can influence the perception of color.  I bring this up not to disagree, just wanted to comment that, I too, see the stains in these images as quite brownish.   \n2A. In the other link provided by Louis (Goldini article), the last part of the paper discusses a model in which the differential appearance of the blood color “observed under special circumstances” (sunlight, without protective glass) is a result of a molecular change in the blood, some type of previous “neutron upset” that facilitates subsequent penetration of UV rays. It’s been proposed by some investigators that the blood was affected during the process that created the image.  \nComments/thoughts on this mechanism related to color and/or persistence of bilirubin over long periods of time?\nThis “charging/changing” of the blood by a uv or energetic burst (Resurrection event) so that it now, upon subsequent exposure to uv light, it appears differentially colored than when not viewed under uv,-do you think this “changing” could be explained by the Shroud simply being exposed to the sun throughout its history, including public exhibitions, draped over balconies, etc., similar to the natural effect of leaving a fabric out in the sun for a prolonged period of time?\n2B. In Jackson’s 1991 paper (“An unconventional hypothesis to explain all image characteristics found on the Shroud image”), he proposes that “it is reasonable to ask if analogous chemical changes [concurrent with image formation] might also have been induced in the blood.” He notes that “the off-elbow bloodstain is brown, whereas the blood flow to which it is connected on the forearm is red, suggesting a possible chemical difference between on-and off-image bloodstains”  The idea is also discussed in the 2006 paper by Fanti (“RGB analysis of the blood color: on-image and out-of image”), where the conclusion is made that “the on image blood color is really different from that of the out-of-image blood”.  Any comments/thoughts here? Do you see a relative difference in this area?  If so, could this be explained by physical, natural effects, different area/background of cloth, etc.?  Does it make sense that the proximity to the body could be an important factor relative to the color perception of the blood?\n[As an addendum, answer the 2A, 2B series as you are comfortable here.  I do not have an agenda other than engaging in a discussion-this is not an entrapment nor recruitment exercise.  Natural, supernatural, some combo-for me personally, I don’t want to automatically rule anything in or rule anything out-I want to look at the data and try to interpret it as objectively as possible-how science measures the supernatural, I don’t have a clue, don’t think it can, other than if something out of the known, natural laws did happen, there must be a definable, molecular basis left as a result.  If it’s there, it’s there-if it’s not, it’s not.  I am comfortable remaining open to considering all of the above possibilities.  Anyway, enough said, that’s my two cents worth (again) on that, interested here in your comments.\n3. Here’s a paper written by a physician, Nels Svensson, which I think you might find interesting if you haven’t already seen it. \nhttp://www.acheiropoietos.info/proceedings/SvenssonWeb.pdf\nFigures 10-13, Table 1 discusses a bilirubin experiment & blood color.  This was performed by dripping whole blood onto cloth.  The comment is made that in this experiment, the bilirubin is mainly composed of conjugated bilirubin, whereas in Adler’s hypothesis most of the bilirubin would be in the free form. \nThoughts on the results?  Also, any affect, influence of differential fluorescent/absorbance of uv with conjugated & unconjugated bilirubin?  Does conjugated bilirubin fluoresce more/less with uv relative to unconjugated bilirubin?  Would this support the idea of uv influence on appearance of the Shroud bloodstain color?  Physiologically, (for the Shroud man) we are dealing primarily/almost exclusively with free bilirubin?  \nThe comment is made in the paper that “it is certainly difficult to find blood samples with high levels of free bilirubin.”  Experimentally, could one examine the idea of  uv -> bilirubin: RED, no uv -> bilirubin: BROWN using a microscopic approach by evaluating blood containing increasing amounts of exogenously added bilirubin using filters to selectively block the uv?  Or a similar microscopic approach (selective filtering on & off) to examine Shroud fibers?\n4. A comment on the Rogers’ experiment of spotting blood onto untreated versus Saponin-treated cloth in relation to blood color. Saponin-treated samples showing persistence of red color, untreated samples don’t. The bilirubin content of the samples is presumably in the normal range and regardless, the blood samples are the same, simply divided in half.  Why the difference?\nI have always found these results interesting-even though Saponin is hemolytic, and therefore is going to increase the amount of hemoglobin that’s released relative to the control group, eventually any released hemoglobin will oxidize to a brownish color; and the red blood cells in the control group will dehydrate and rupture and their contents will be released as well, essentially evening things out.\nPerhaps the influence of the effect that Saponin may have been overly emphasized (at least in my mind), because of the proposal that Saponin has left a thin layer of carbohydrates behind which could be important in image formation.  \nImage formation is a separate issue. Regarding the blood, maybe there’s nothing that magic about Saponin-treatment at all-any hemolytic detergent, reagent would produce the same effect that was observed by Rogers-What’s important is that the rbc contents are released due to the consequence of holes being formed in the membrane as the cells are ruptured on the hemolytic Saponin-treated cloth.  Everything is spilling out.  Hemoglobin, bilirubin-could hemoglobin, the porphyrin ring be split by detergent action to create biliverdin/bilirubin? For the rbcs in the non-treated cloth, it’s more like a slow leak, eventually the membrane will dry out and collapse onto itself, with relatively minimal damage by comparison.  This is why in preparing samples of old blood for microscopy, rbcs can become rehydrated, resealed and return to what looks like a somewhat preserved, typical morphology.  As the cells on the non-treated cloth dry, it’s like stacking blankets upon one another, most of the contents (hemoglobin, breakdown products) remain “within”, not released. \nIn the case of the Shroud blood, physiologically the rbcs are already being ruptured/breaking down-no need for Saponin-treated cloth to play any role here necessarily-if the cloth was treated, might enhance it over the top, lysing residual intact rbcs.\nWould be interesting to compare saponin-treated cloth with cloth treated with other hemolytic reagents-either soaked onto the cloth, or rbcs lysed in suspension, then transferred to the cloth-following color with time.  Additionally, maybe some similar type of filtering system could be applied here.\nOkay, there we go.  Again, appreciate your time.\n\n","date":"May 27, 2013 at 10:46 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35016","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"2A. In the other link provided by Louis (Goldini article), the last part of the paper discusses a model in which the differential appearance of the blood color “observed under special circumstances” (sunlight, without protective glass) is a result of a molecular change in the blood, some type of previous “neutron upset” that facilitates subsequent penetration of UV rays. It’s been proposed by some investigators that the blood was affected during the process that created the image. \nThe “upset” by neutrons is referred to an experiment conducted by Italian group of researchers. As I understand they do not used the Shroud samples, they irradiated blood samples with a high level of bilirubin by neitrons. After that they tested one sample in the oven heating and the other one by UV light ( both were irrdiated by neutrons first). The first did not change it color, the other did in 30 minutes to bright red. They conclude that irradiation “upset” the blood and that is why the color changed.\nOne might agree with this or not, but the other experiments described above have shown that the blood sample with bilirubin changed the color upon UV irradiation without any “neutron upset”.\nPersonally, I do not think any “neutroen upset” has anything to do with the blood color change.\n\n","date":"May 27, 2013 at 11:48 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35018","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"2B. In Jackson’s 1991 paper (“An unconventional hypothesis to explain all image characteristics found on the Shroud image”), he proposes that “it is reasonable to ask if analogous chemical changes [concurrent with image formation] might also have been induced in the blood.” He notes that “the off-elbow bloodstain is brown, whereas the blood flow to which it is connected on the forearm is red, suggesting a possible chemical difference between on-and off-image bloodstains” The idea is also discussed in the 2006 paper by Fanti (“RGB analysis of the blood color: on-image and out-of image”), where the conclusion is made that “the on image blood color is really different from that of the out-of-image blood”. Any comments/thoughts here? Do you see a relative difference in this area? If so, could this be explained by physical, natural effects, different area/background of cloth, etc.? Does it make sense that the proximity to the body could be an important factor relative to the color perception of the blood?\nThis questions I am not able to answer, because I did not read the article you are referring to and can’t remember the photographs to prove the thesis of the color difference depending on stain placement relatively to the image.\nThe difference in color might be so slight that it is visible only upon direct visualisation, and is lost through screens and photos.\n\n","date":"May 27, 2013 at 11:52 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35019","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Figures 10-13, Table 1 discusses a bilirubin experiment & blood color. This was performed by dripping whole blood onto cloth. The comment is made that in this experiment, the bilirubin is mainly composed of conjugated bilirubin, whereas in Adler’s hypothesis most of the bilirubin would be in the free form. \nAdler is correct. In the hypothesis where bilirubin comes as a result of hemolysis indirect ( unconjugated) bilirubin is more abundant than conjugated ( direct).\nBilirubin is conjugated to hialuronic acid in the liver.\n\n","date":"May 27, 2013 at 11:55 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35020","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"everything else – later. have to run.\n\n","date":"May 27, 2013 at 11:55 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35021","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"thoughts on the results? Also, any affect, influence of differential fluorescent/absorbance of uv with conjugated & unconjugated bilirubin? Does conjugated bilirubin fluoresce more/less with uv relative to unconjugated bilirubin? Would this support the idea of uv influence on appearance of the Shroud bloodstain color? Physiologically, (for the Shroud man) we are dealing primarily/almost exclusively with free bilirubin? \nSince UV light is used in treatment the newborn jaundice, which nature is hemolysis and therefore an unconjugated bilirubin one may make a conclusion that it is this form of bilirubin more sensitive to the UV irradiation. Shroud man had bilirubin from hemolyzed erythrocytes as well, so it will confirm the changes of the color.\nIn terms of the article by Swensson – he alos makes the fundamental mistake assuming the color of the stain is different observed upon normal conditions. But as we already know, it is brightening the color ONLY upon exposure to UV light, which Swennson did not conduct.\nTherefore his co clusions are irrelevant.\nThe person in his experiment was a liver failure patient which is mostly conjugated bilirubin, but it doe not matter, since he omitted the crucial point in the experiment – irradiating the spots with UV light.\n\n","date":"May 27, 2013 at 12:17 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35023","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"4. A comment on the Rogers’ experiment of spotting blood onto untreated versus Saponin-treated cloth in relation to blood color. Saponin-treated samples showing persistence of red color, untreated samples don’t. The bilirubin content of the samples is presumably in the normal range and regardless, the blood samples are the same, simply divided in half. Why the difference?\nbecause of the chemical reaction with saponin .\n\n","date":"May 27, 2013 at 12:20 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35024","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I have always found these results interesting-even though Saponin is hemolytic, and therefore is going to increase the amount of hemoglobin that’s released relative to the control group, eventually any released hemoglobin will oxidize to a brownish color; and the red blood cells in the control group will dehydrate and rupture and their contents will be released as well, essentially evening things out.\nFree hemoglobin from the hemolyzed erythrocytes will react with saponin residues, or other elements, as was proven by Dian Soran in 1977 ( described in the Swansson article).\nThis chemical reaction will either slow or change the process of oxidation.\nFree hemoglobin oxidize to brownish color. Hemoglobin-something else complex can oxidize to a different color.\n\n","date":"May 27, 2013 at 12:25 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35025","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Everything is spilling out. Hemoglobin, bilirubin-could hemoglobin, the porphyrin ring be split by detergent action to create biliverdin/bilirubin?\nNo, I do not think so. First of all there was already bilirubin in the blood and hemolysis as well – because of the trauma and process called rhabsomyolysis – and therefore I would suspect there would be myoglobin in the blood stream as well – the way myoglobin interferes with the color and process of oxidation – I have no idea – that’s to be tested. So by the time the body was covered by the cloth – there was enough bilirubin in the blood and other products as well.\nWhy I assume there would be rhabdomyolysis? well, the extreme torture of the man of the Shroud together with dehydration will certainly result in such a process.\nYou have to realize, that all the described is not occurring instantaneously, including metabolizing of hemoglobin to bilirubin – and the amount and time and conditions are all dependet on individual characteristics – one person have the fulminant process, whereas the other one will have it much slower. One will have an extreme hemolysis, the other one might have the kidney failure due to dehydration more pronounced, the third might have heart insufficiency – and  all three subjected to the same torture.\n\n","date":"May 27, 2013 at 12:34 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35026","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"As a final remark – I do not think saponin was the cause of hemolysis, but it might have been the additional factor for the “fixing” the hemoglobin – in a chemical reaction with it and therefore impeding the oxidation process. It might have also had the effect on bilirubin stability – just a thought.\n\n","date":"May 27, 2013 at 12:37 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35027","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\njesterof :\nEverything is spilling out. Hemoglobin, bilirubin-could hemoglobin, the porphyrin ring be split by detergent action to create biliverdin/bilirubin?\nNo, I do not think so. First of all there was already bilirubin in the blood and hemolysis as well – because of the trauma and process called rhabsomyolysis – and therefore I would suspect there would be myoglobin in the blood stream as well – the way myoglobin interferes with the color and process of oxidation – I have no idea – that’s to be tested. So by the time the body was covered by the cloth – there was enough bilirubin in the blood and other products as well.\nWhy I assume there would be rhabdomyolysis? well, the extreme torture of the man of the Shroud together with dehydration will certainly result in such a process.\nYou have to realize, that all the described is not occurring instantaneously, including metabolizing of hemoglobin to bilirubin – and the amount and time and conditions are all dependet on individual characteristics – one person have the fulminant process, whereas the other one will have it much slower. One will have an extreme hemolysis, the other one might have the kidney failure due to dehydration more pronounced, the third might have heart insufficiency – and  all three subjected to the same torture.\n\nHey jesterof,\nI was just referring to the blood added to the saponin treated cloth here-the Rogers experiment-things were spilling out due to saponin\n\n","date":"May 27, 2013 at 12:45 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35028","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\njesterof :\nAs a final remark – I do not think saponin was the cause of hemolysis, but it might have been the additional factor for the “fixing” the hemoglobin – in a chemical reaction with it and therefore impeding the oxidation process. It might have also had the effect on bilirubin stability – just a thought.\n\nDitto for this one as the above remark-when I mentioned I had found the saponin results particularly interesting, it was precisely because of some type of interaction or “fixing” like this that might be occurring-the molecular basis for this is interesting, even apart from any results with the Shroud.  I’d like to see the chemistry of the reaction extended from the ’77 observation.\n\n","date":"May 27, 2013 at 12:50 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35030","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Mr. Kearse, I would like to underline the fact that, in all you said, you forget one possible explanation concerning the fact that the blood on the Shroud appears redder under UV light (under the sunlight for example) and this is what jesterof told us last evening, i.e. that it is truly possible that there is NOTHING UNUSUAL AT ALL WITH THE BLOOD ON THE SHROUD!\nI based this hypothesis on 2 major points:\n1- jesterof told us that, in his mind, there is nothing strange with the fact that the blood on the Shroud, that appears brown normally, become redder under the sun or under another source of UV light.\n2- Doctor Pierre Barbet is, to my knowledge, the only Shroud researcher who’s also an expert concerning blood who was able to see the Shroud in sunlight during the 1933 exhibition (he said he saw it at less than 1 meter of distance!) and since he never address the issue of the so-called “blood appear to be redder than normal” problem in his book, I have to assume that, in his eyes of experts, there was no problem at all with the color of the blood he saw in sunlight with his own eyes.\nIn the end, if the blood really become redder than normal under the sun (I want to underline the “if” here), maybe this can simply be due to the presence of a level of bilirubin much higher than normal and nothing else.  After all, maybe Adler was right after all!\nI also want to tell people to be very prudent concerning the claims made by people like Fanti and Jackson who, this is evident, wants to use every little thing they can to link the Shroud image with the Resurrection of Christ!  Personally, since both of them are not expert in blood at all and both are members of the supernatural fringe, I don’t have any time to waste in listening their “theories” concerning the blood because I know this is only biased thinking based on the “I think I see syndrom”…  \nYou do what you want but personally, I prefer by far to listen to experts in blood like Barbet and Adler.  Both have seen the Shroud in person in Turin (Adler saw it in 1997) and both have conclude instantaneously that the stains could not have been made of anything else than blood, while never seem to have been bothered by the so-called reddish aspect of it.  This speaks very loud to me.  That’s why I think that if the blood is really redder than normal under the sun, this difference must not be thought as being supernatural in any way… \nQuestion to conclude my comment:  Don’t you think that if the color of the blood would have been so strange, Adler and Barbet (both experts in blood who saw the Shroud at very close range) would have had some doubts before they conclude that this was surely the real blood of a crucified man?  Don’t you think that they would have been much more prudent in their claim?  The fact is this:  When they saw the Shroud live in Turin, both expert IMMEDIATELY conclude that this could not be anything else than real blood…  Again, this simple fact is very telling for me.  I really don’t think we should start thinking that the blood on the Shroud is so unusual that it must have been submitted to a burst of UV light!  Religiously biased science is truly the worst thing that ever happened to the Shroud of Turin…\nNote:  The critics contained in this comment only concern guys like Fanti and Jackson who have publicly stated that they believed the Shroud image to have been formed during the Resurrection of Christ…\n\n","date":"May 27, 2013 at 12:59 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35031","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Important precision concerning my previous comment :  Barbet is not only the only blood expert to have seen the Shroud in sunlight during the 1933 exhibition, but to my knowledge, he’s the only blood expert to have seen it that way (and at very close range) in all the history of Shroud science…  I think this is truly an important fact concerning the question of the color of the blood.\n\n","date":"May 27, 2013 at 1:20 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35032","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nYannick Clément :\nMr. Kearse, I would like to underline the fact that, in all you said, you forget one possible explanation concerning the fact that the blood on the Shroud appears redder under UV light (under the sunlight for example) and this is what jesterof told us last evening, i.e. that it is\ntruly possible that there is NOTHING UNUSUAL AT ALL WITH THE BLOOD ON THE SHROUD!\nI based this hypothesis on 2 major points:\n1- jesterof told us that, in his mind, there is nothing strange with the fact that the blood on the Shroud, that appears brown normally, become redder under the sun or under another source of UV light.\n2- Doctor Pierre Barbet is, to my knowledge, the only Shroud researcher who’s also an expert concerning blood who was able to see the Shroud in sunlight during the 1933 exhibition (he said he saw it at less than 1 meter of distance!) and since he never address the issue of the so-called “blood appear to be redder than normal” problem in his book, I have to assume that, in his eyes of experts, there was no problem at all with the color of the blood he saw in sunlight with his own eyes.\nIn the end, if the blood really become redder than normal under the sun (I want to underline the “if” here), maybe this can simply be due to the presence of a level of bilirubin much higher than normal and nothing else.  After all, maybe Adler was right after all!\nI also want to tell people to be very prudent concerning the claims made by people like Fanti and Jackson who, this is evident, wants to use every little thing they can to link the Shroud image with the Resurrection of Christ!  Personally, since both of them are not expert in blood at all and both are members of the supernatural fringe, I don’t have any time to waste in listening their “theories” concerning the blood because I know this is only biased thinking based on the “I think I see syndrom”…\nYou do what you want but personally, I prefer by far to listen to experts in blood like Barbet and Adler.  Both have seen the Shroud in person in Turin (Adler saw it in 1997) and both have conclude instantaneously that the stains could not have been made of anything else than blood, while never seem to have been bothered by the so-called reddish aspect of it.  This speaks very loud to me.  That’s why I think that if the blood is really redder than normal under the sun, this difference must not be thought as being supernatural in any way…\nQuestion to conclude my comment:  Don’t you think that if the color of the blood would have been so strange, Adler and Barbet (both experts in blood who saw the Shroud at very close range) would have had some doubts before they conclude that this was surely the real blood of a crucified man?  Don’t you think that they would have been much more prudent in their claim?  The fact is this:  When they saw the Shroud live in Turin, both expert IMMEDIATELY conclude that this could not be anything else than real blood…  Again, this simple fact is very telling for me.  I really don’t think we should start thinking that the blood on the Shroud is so unusual that it must have been submitted to a burst of UV light!  Religiously biased science is truly the worst thing that ever happened to the Shroud of Turin…\nNote:  The critics contained in this comment only concern guys like Fanti and Jackson who have publicly stated that they believed the Shroud image to have been formed during the Resurrection of Christ…\n\nI would disagree with you-I don’t think I omitted that possibility, for example this comment at the end of 2A, “This “charging/changing” of the blood by a uv or energetic burst (Resurrection event) so that it now, upon subsequent exposure to uv light, it appears differentially colored than when not viewed under uv,-do you think this “changing” could be explained by the Shroud simply being exposed to the sun throughout its history, including public exhibitions, draped over balconies, etc., similar to the natural effect of leaving a fabric out in the sun for a prolonged period of time?draping over balconies, etc.”  This sound like a totally natural process to me…\nI would also modify your statement in that I would consider a high amount of bilirubin in the blood an usual situation-so things are not entirely normal-but of course, with a perfectly natural explanation and physiological basis given the conditions that exist.\nI simply do not accept the notion that if a scientist believes in the Resurrection, he or she must be disqualified in terms of integrity or honesty or good science practice.  The Shroud could be the product of totally natural events or supernatural events or some combination.  No one knows, including yourself.  Ironically, if not for the efforts of one of those whom you criticize in organizing a research team, guys like you would have a lot more free time and a lot less to talk about.  I did not become interested in the Shroud to try to prove the Resurrection.  I’m not sure how you would.  I don’t know about anyone else.  In my opinion, this constant personal criticism is rude-it dilutes the discussion from being data driven.  It makes me not want to listen to anything you have to say.  Please, enough with this constant hounding and attacking of others personal views, including mine.  It is like listening to someone over & over trying to be converted to a religious sect.\n\n","date":"May 27, 2013 at 1:55 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35034","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"My critics were not directed against you at all Mr. Kearse.  Read again my final note.  It was directed against the so-called scientists who are seeking to prove the Resurrection using the Shroud.  You just said « I did not become interested in the Shroud to try to prove the Resurrection »…  If it’s not a bullsh** statement on your part, then why are you mad at me for giving a friendly advice of being prudent to all the readers out there who will see the supernatural links made by Jackson, Fanti et al. between the blood on the Shroud and a burst of UV light that you reported in your previous long post?\nI have nothing against any Christian scientist, as long as this person keep his faith in his back-pocket while doing his scientific research…\n\n","date":"May 27, 2013 at 2:25 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35038","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Yannick you sometimes presume to know the motivation of others. That’s not good science. As Kelly has rightly pointed out, it’s best to keep to the facts. I also think it a good habit to reread others’ posts at least twice before commenting on them (I try to do this but don’t always succeed). At times it feels like you post too quickly, in the excitement of the debate. I would hate for people to start ignoring your posts because you always ask excellent questions and share solid theories.\n\n","date":"May 27, 2013 at 4:17 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35042","author":"David Goulet","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I know the motivation of guys like Fanti and Jackson because they publicly state them!  They wrote so many papers which tried to sell the idea that the image come from a burst of something at the time of the Resurrection than it would take someone naive as hell to not understanding what kind of motivation these guys have…\nPlease read this comment of mine and I dare you to say you disagree with me: https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/#comment-35046\nAM I THE ONLY ONE AROUND HERE WHO KNOW HOW A SCIENTIST SHOULD ACT???  Come on!  On this subject, I highly recommand everyone to read the first portion of Rogers book…\n\n","date":"May 27, 2013 at 5:05 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35047","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Typo there-an unusual situation\n\n","date":"May 27, 2013 at 1:58 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35035","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Yannick wrote:  “Is it a PROVEN FACT that the sample 3-CB has been taken from a bloodstained area of the cloth?”\nPaul responded\nI got my McCrone slide out and read the inscription he put in the margin.  It is as follows:  “Madder Rose” “Linen fiber” “Medusa (blue)” “Sample 3-CB”  \nThere is good reason why I used the word “apparently” and added my own commentary regarding the important photographs that Barrie Schwortz took in 1978 the sample removals.  The round magnetic markers which Dr. Tom D’Muhala laid down in each site cannot easily be “duplicated” by the pen-drawn marks which McCrone tried to do to simulate the rectangular area of the STURP sticky tape.  Such drawings are always to be seen as McCrone’s interpretation of where the samples came from.  In order to be scientifically precise one could have wished that it might have been possible to actually photograph the sticky tape samples in situ before they were removed from the Shroud (as was more easily possible with the Frei tape sampes).  But, this was not feasible because in every case the “torque applicator” was applied (which limited the pounds per square inch pressure on the Shroud), the instrument covers up the actual sample site from which the tape was removed (in other words, blocks the view).  \nMoreover, there was so much going on during that spectacular week of STURP’s work on the Shroud, that it would have been nearly impossible to get photographs without disrupting the schedule.  Barrie, for example, could not photograph the first seven sample sites where Max Frei took samples on the image-side of the Shroud because, when Frei and Aurelio Ghio first came into the room at 11:00 pm, they set to work immediately to removing their samples.  It was hectic and their work was “without warning” for Barrie.  \nBut, I have not yet had a chance to get my own collection of Barrie’s invaluable documentation photos to double check.  I suspect that there is room for “free variation” left or right, up or down, in any attempt to reconstruct exactly and precisely where the samples really did come from (whether it was STURP’s or Frei’s–but, as noted above, far easier with Frei’s that with STURP’s samples).  \nMoreover, it may be irrelevant given the fact that we know the Shroud was rolled and unrolled, folded and unfolded over the centuries so that a single particulate–in this case a linen fiber on 3-CB–may have moved a distance (however short) from the original site on which it was first deposited.  Thus, it is terribly difficult to be more “scientific” when we prefer scientific precision.  It’s a condition, I think, we will have to live with unless and until there is a future opportunity to do further work with the actual Shroud and address these questions anew with a more precise sampling technique and a rigorously planned photo documentation methodology.  Barrie and I have actually talked about the disadvantages of taking photos at an angle when we could wish for a direct overhead view.  But those were the situations Barrie had to face and work with on-site and he did an absolutely tremendous job of capturing on film the action that was taking place.  I continue to be amazed (and immensely appreciative) at all the data that was gathered by STURP given their limited time, schedule pressures, and the non-clean room circumstances under which they operated. \nSorry it would not be possible to be more precise about this–given the nature of the situation.\nBest regards,\nPaul\nGen. Proj. Dir., ASSIST\n\n","date":"May 27, 2013 at 2:05 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35037","author":"Joe Marino","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thanks again to Joe and Paul for this answer.  Again, I will print that out and read it more carefully later on…\n\n","date":"May 27, 2013 at 3:38 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35040","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Dr. McCrone’s book, “Judgement Day of the Shroud” McCrone drops the term Madder Rose and uses more generic terms such as agglomerates or red ochre to explain slide 3 CB. Dr. Kohlbeck insists it has to be organic since Cargille type A  changed the appearance as well as the color of the agglomerates. I provided a link to three images. 2 are from Kohlbecks work displaying with and without Cargille type A on sticky tape 6 BF. The last image is from Dr. McCrone slide of 3 CB. Joe can you ask Paul if he can tell me  what would be the physical attributes that a researcher would indicate Madder Rose if any is present in these slides? I promise if I get a chance to see Paul in person I’ll buy the man one whopping IPA.\nThanks\nGiorgio","date":"May 27, 2013 at 3:52 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35041","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nYannick Clément :\nMy critics were not directed against you at all Mr. Kearse.  Read again my final note.  It was directed against the so-called scientists who are seeking to prove the Resurrection\nusing the Shroud.  You just said « I did not become interested in the Shroud to try to prove the Resurrection »…  If it’s not a bullsh** statement on your part, then why are you mad at me for giving a friendly advice of being prudent to all the readers out there who will see the supernatural links made by Jackson, Fanti et al. between the blood on the Shroud and a burst of UV light that you reported in your previous long post?\nI have nothing against any Christian scientist, as long as this person keep his faith in his back-pocket while doing his scientific research…\n\nSorry, but I don’t think your advice is given in the manner of being friendly and prudent-it’s more often given more as a mandate-but enough of this.  It’s stupid.  For the record, I am not mad at you, Yannick.  I just don’t need to keep going there…every….single….time.  Keep the discussion data driven.  Watch my back pocket and anyone else’s you care to.\n\n","date":"May 27, 2013 at 4:35 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35043","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Calm down Mr. Kearse.  I’m not mad at you either.  I just found it strange that everytime I criticize those who are using their “science” to prove the Resurrection (in the cases of Jackson and Fanti, THIS IS AS EVIDENT AS THE NOSE IN ANYONE’S FACE), you seem to jump to the ceiling like the critic was directed against you personally, while it’s not.  Read again the note I carefully wrote at the end of my previous comment and you’ll understand that I never criticize you in this post.\nI just want people to be aware that some people, who are no expert in blood, are trying to convinced other people that the Resurrection must have been the cause of the so-call reddish aspect of it, while, as jesterof said last evening, it is probably normal that this kind of traumatic blood (and possibly any other ancient blood) become much more red under sunlight (or another UV light source)!  \nDon’t you see what kind of bullsh** game these supernatural fanatics are playing?  Why is it a crime to criticize those who pretend to do science while their motivation is evidently elsewhere than finding the real truth concerning the Shroud, whatever this truth might be?  When a scientist make public claims that the Resurrection of Christ has been the cause of the image and possibly also the cause of the reddish aspect of the blood (which is, in fact, wrong outside a UV lighting), while he knows that science is far from having been able to discard every possible natural explanations, I ask you the question: At that moment, what happen to the independence of mind that, as a scientist, he MUST HAVE TO DO GOOD SCIENCE???  How can a religiously driven science be a good science anymore?\nIf my critics directed against these kind of so-called scientists have offended you, I’m truly sorry…  But I hope you will understand now that my principal motivation is to defend the integrity of Shroud science in front of a bunch of religious freaks.\nOne last question:  Beside some Christian faithful and maybe some supernatural lovers, who the hell will buy their pseudo-scientific crap, especially when it come to find a proper explanation for the image?\n\n","date":"May 27, 2013 at 4:55 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35045","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"One last and important comment:  Until science can completely discard every single natural explanations concerning the image and the reddish aspect of the blood under UV light (remember folks that it is far from being the case, even if STURP came out empty of a complete explanation), I’m sorry but it is completely anti-scientific to try to find a supernatural explanation for these things.  Deep down in my heart, I know that this is not how it is suppose to be.  Deep down in my heart, I know that this is not how any scientist who is independent of mind on the subject would act.  And deep down in my heart, I know that Rogers agree with me presently while sitting on his cloud…\n\n","date":"May 27, 2013 at 5:02 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35046","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Yannick,\nGo to your room!\n\n","date":"May 27, 2013 at 6:27 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35053","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Hello Kelly can you do me a favor and go to this link and give me your opinion about these three slides.\n\nAlso jesterof is welcomed too.\n\n","date":"May 27, 2013 at 8:33 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35064","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Kelly go to sleep!  ;-)\n\n","date":"May 28, 2013 at 8:24 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35108","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"What about them?\n\n","date":"May 27, 2013 at 8:45 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35065","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Is this blood? Madder rose? red ochre? The yellow amorphous tubular flaked like material resin? 6 BF and 3 CB are both from the spear wound.\n\n","date":"May 27, 2013 at 9:05 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35070","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"There is an expression that the wise man can learn more from the fool, than the fool from the wise man. I’m not directing that at anyone in particular, just thought it was a truism to keep in mind when exploring the the good, the bad and the ugly of Shroud scholarship.\n\n","date":"May 27, 2013 at 8:57 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35067","author":"David Goulet","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Giorgio wrote, “Joe can you ask Paul if he can tell me what would be the physical attributes that a researcher would indicate Madder Rose if any is present in these slides?”\nPaul wrote:\nIt is most unfortunate that I am not a chemist–I really wish I were!  I don’t personally know what the chemical and physical characteristics of rose madder are.  But, as the name implies, “rose” has a rosy color when impregnated in a linen fiber.  It is not a permanent color because it is of organic origin (the plant is Rubia tinctoria).  The extract, purpurin, is more permanent than rose madder.  Joe Kohlbeck, on the other hand, is both a microscopist and chemist with Hercules Industries in Salt Lake City, Utah.  His observation about the change of color in cargille oil is significant and one you can “take to the bank.” \nIt is a pity that McCrone did not include an index of STURP tapes and where he discusses them in his book.  It would make the use of his book a lot easier.  He does note “a few visible red fibers and particle agglomerates” on p. 86 (in his description of color figure 15, but this is a brief reference to a 10x macroscopic view of STURP tape 3-FB.  And, by the way, there is a discrepant description of tape 3-CB which, in the list on p. 93, (which he adapted from his 1880 article “Light Microscope Study of the Turin Shroud, II (THE MICROSCOPE, no. 28, nos. 3 & 4) McCrone labels as from the right side wound.  Well, yes and no.  If he were to have maintained that the blood flow across the back (on the dorsal end of the Shroud) is from the right side wound which is on the frontal end of the Shroud, then, yes because McCrone believes an artist painted that blood run as having originated from the perforation in the side which is on the frontal end of the cloth.  But, as I noted in a previous comment, I am not certain that we can be absolutely, scientifically positive that this sample actually came from directly upon the flow across the back.  That’s why I used a qualification: in McCrone’s map of tapes it was “apparently” from the flow.\nAnother reference to 3-CB is to be found in McCrone’s handwritten note on p. 137 where he finds an agglomerate particle that is “100 % vermilion.”  But, in fact, his study of this tape (on the subject of vermilion) begins on p. 126 which, I think was largely adapted from his 1981 article “Light Microscope study of the Turin Shroud, III” which he published in his own journal, THE MICROSCOPE, (no. 29).  Although McCrone appears to make much of this, STURP’s own studies failed to show up any concentration of vermilion (vermilion comes from mercury and should have showed up in their scans).  In any case, this is probably another example of a contaminant of a paint that might have come from one or more of the True Copies that were touched image to image and cloth to cloth to the original Shroud.\nHowever, back to rose madder, McCrone is not really interested in rose madder.  For him, it is only a contaminant that demonstrates that the Shroud was probably in an artist’s studio or, at least, exposed to an artist’s collection of pigments.  McCrone’s main thrust is that the image on the Shroud is not organic, but, rather inorganic–having been produced by the artist’s use of iron oxide using a “dry brush” technique that causes “snow fencing” (i.e. the accumulation of pigment on one side of a fiber).\nBest regards,\nPaul\nGen. Proj. Dir., ASSIST\n\n","date":"May 27, 2013 at 9:09 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35071","author":"Joe Marino","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thank you Paul I hope you like IPA’s.\n\n","date":"May 27, 2013 at 9:59 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35079","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Giorgio,\nThanks for the opportunity to view the pictures, but I really could not tell you.  I am not experienced in the microscopic identification of blood-my background is in immunology & cell biology.  My approach to identify the sample as blood would be to use molecular probes (antibodies) against specific blood cell markers, similar to the serological studies of Heller, Adler, & B. Bollone-additional probes have become available since the original studies that could extend the investigation-that is where my experience really lies.  Sorry I could not be of more help.\n\n","date":"May 27, 2013 at 9:18 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35073","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nGiorgio :\nIs this blood? Madder rose? red ochre? The yellow amorphous tubular flaked like material resin? 6 BF and 3 CB are both from the spear wound.\n\nSorry, that question is very far from what I feel comfortable with. I am not a pathologist who views slides every day for a living. In this instance you may need a forensic pathologist\n\n","date":"May 27, 2013 at 9:37 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35076","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"#148\nIt is most unfortunate that I am not a chemist–I really wish I were! I don’t personally know what the chemical and physical characteristics of rose madder are. But, as the name implies, “rose” has a rosy color when impregnated in a linen fiber. It is not a permanent color because it is of organic origin (the plant is Rubia tinctoria). The extract, purpurin, is more permanent than rose madder. Joe Kohlbeck, on the other hand, is both a microscopist and chemist with Hercules Industries in Salt Lake City, Utah. His observation about the change of color in cargille oil is significant and one you can “take to the bank.” \nAgreed. This was one of the major catalyst that promoted Sue Bedfords, invisible weave theory. Keep in mind, The area that Dr. Kohlbeck was working on was the frontal view of the spear wound. All he was trying to do is improve the resolving power by “floating the sticky tape” onto a microscope slide to photograph.  According to McCrone and Nitowski notes, slide 6 BF is similar by observation to slide 3 CB that it contains (agglomerates). According to McCrone, the agglomerates is iron oxide (red ochre artist pigment) Other say it’s blood (Very red) While in contact with cargile oil for three months the supposedly inorganic agglomerates now turns yellow and black and forms a yellow amorphous tubular flaked like material resin that Nitowski believes it’s either blood or myrrh. Kohlbeck also thought it was blood but after a lengthy discussion with Sue Bedford he agreed that it maybe the dye that was used in the invisible weave theory. He admitted to me he only concluded it was blood because of Dr. Heller’s work.\nSo back to my original point both McCrone failed to mentioned this in his book and Dr. Rogers should have addressed this issue as well in his last paper. As far as this reader is concern, I find all of these very confusing.\n\n","date":"May 27, 2013 at 10:16 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35080","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"This comment is a reply to jesterof comment #114:\nAfter reading with attention the part of Goldoni’s paper in which he reprint an extract of the final report of the Pellegrino commission which performed investigations on the Shroud from 1969 to 1976, I think we can assume that the “blood is too red” issue come from a bad understanding of a comment made by Antoine Legrand who was allowed by this commission to do an visual indoor examination of the Shroud…\nThe reports stated that it was at this occasion that Legrand made the observation that the color of the blood was not as bright as the color he saw during the 1931 exhibition of the Shroud, when the relic was exposed in open air and by the light of the sun.\nI really think that it is at this occasion that someone misunderstood Legrand’s observation and, as you say, changed the “it is very bright upon sun light exposure” to simply (and wrongly) “it’s too bright”…\nAnd since the Pellegrino commission ended his research work in 1976, just about the time the STURP team was formed, it is fair to assume that some members of the team heard about this wrong statement that the blood of the Shroud seemed to be too bright (or too red) and take it for granted.  That could easily lead us to think that, most probably, these team members had a preconceived idea versus the color of the blood when they went to Turin to examine the cloth in 1978.  And because of the important media attention concerning the work of the STURP team, this “blood is too red” issue (which is in fact a misunderstood issue that originated from a clever observation of Antoine Legrand during the 1970s) got more and more attention, so much in fact that it went on to stay alive until this day…\nI really think this guess of mine of what have started the “blood is too red” (or too bright) issue has some good chances to be very close to the truth.  Jesterof, what do you think?\nIf I’m right about that, then it is very unfortunate that Legrand never went on publicly to set the record straight versus this issue concerning the blood on the Shroud, which gives the impression that there is a real problem with the color, while it is very probable that there is none, considering the fact that it is a blood that was shed by a highly traumatized man…\n\n","date":"May 28, 2013 at 8:25 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35109","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Here’s a message for Paul Maloney :\nFirst of all, I want to thank you for all the interesting information you provided me in the last couple of days.  You little story concerning Ray Rogers’ samples and the way he reacted with you when he learned that Kohlbeck had given them away was nearly hillarious!  But at the same time, this story show how professional Rogers was as a scientist.  And it shows another sad reality:  the way the Shroud samples were handled over the years has not been great, scientifically speaking.  The chain of custody was often broken.  Many samples were damaged and some others really seem to have been completely lost.  All this mess could have been prevent if the Church authorities would have taken legal actions BEFORE the sampling was done by STURP and also by Riggi and Frei in 1978.  They should have made sure that every single sample taken from the Shroud would belong ONLY FOR A DETERMINED TIME to the person or the team who take them in order for them or for him to perform their testing and if the team or the person would have wanted to give them to another specialist during that period of time, this team or this person should have been legaly forced to inform the authorities every time.  Then, after the time that would have been determined, the samples should have been given back to the authorities, so that they could have stored them properly for future analyses or another time frame could have been legaly determined with the team or the person who took the samples, if this team or this person would have needed more time to do more tests and analyses on them.  That way, no chain of custody would have been broken and no sample would have been lost.  I hope that if there is another round of direct testing on the Shroud in the future, that will be the way the Church authorities will act versus the samples that will be taken.\nNow, concerning my question regarding the sample 3-CB and if it is a proven fact that it was taken from a bloodstained area, I can see by your answer that it is far from being the case!  So last evening, I check out Barrie Schwortz paper entitled “Mapping of Research Test-Point Areas on the Shroud of Turin” (published in 1982) and note that at the corresponding spot, the sample number was 12 (Original Test Plan ID #3B) and the description of the data point was “Serum/Blood”! \nSo, my question to Paul is:  Does it prove that this particular sample was really taken from a bloodstained area or was it just a simple assumption of the STURP team before they went to Turin, while they were planning their sampling procedure?  \nI guess Barrie Schwortz could help us here…\nI also note that there seemed to be a slight variation of location between Barrie’s location point on his own map and McCrone’s location.  Barrie’s point seems to be further away a little bit from the body image.  One thing’s for sure:  If it would be proven that there really were some bloodstains in this particular area (and not just some microscopic particles of blood that could have been scattered there), that would mean that this is another area of the cloth where there are bloodstains that are located outside the body image and I really think this would be important to prove such a thing, because it could potentially give us some precious information concerning the exact configuration (or, more probably, configurations) of the cloth around the body before and after it was finally placed in his final resting place (which was probably a stone tablet carved inside a stone wall of the tomb).\nI’ll wait for Paul’s reply…  Thanks!\n\n","date":"May 28, 2013 at 8:26 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35110","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I really think this guess of mine of what have started the “blood is too red” (or too bright) issue has some good chances to be very close to the truth. Jesterof, what do you think?\nFrom the information we have and know ( which might not be the whole information) it does seem as a chain of events which happened.\n\n","date":"May 28, 2013 at 4:08 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35132","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"As I said, if this is correct, it’s very sad that Legrand never set the record straight about that…  \nAnd here’s another question for you:  \nIn a previous comment (which gave me great lights about the whole issue), you mentioned this: “It (the blood on the Shroud) changes color (brightens) only upon exposition to bright sunlight or UV light – which explains immediately why bilirubin was brought up at all – it is bilirubin which brightens it up, because it reacts with UV light.”\nTaking that into account, here’s my personal opinion on the whole “blood is too red” issue: In the end, the reddish aspect considered too bright of the blood of the Shroud when it is exposed to sunlight (or another UV source) could be due to a level of bilirubin in the blood much higher than normal, just like it was described in Adler’s hypothesis.\nSo, the question is:  Do you think pretty much the same as me?  Or did I miss something from all the numerous comments you wrote in the last days?\n\n","date":"May 28, 2013 at 4:38 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35134","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Here, I would like, once and for all, explain my point of view versus those who think the Shroud image is directly related to the Resurrection of Christ :\nI don’t care if any Christian or supernatural lover out there believe this!  I don’t care at all, EXCEPT if this person presents himself as a real scientist and make belief publicly that there is good pieces of evidence on the cloth to support such a BELIEF.\nThat’s when I say:  ONE MINUTE!!!  STOP PLEASE!!!  THIS ISN’T SCIENCE NO MORE!!!  WE JUST WENT OFF-TRACK!!!\nIn other words, belief is ok.  Trying to use science to back-up such a belief is not science anymore.  It is called “religiously driven pseudo-science” in my mind.  And everytime I will see such acting on the part of someone presenting himself as a real scientist, you can be sure that I will raise the red flag of scientific integrity!  \nIn fact, the only honest thing a scientist could say about the image on the Shroud is this: FOR THE MOMENT (these words are very important), this image remains unexplainable, but that doesn’t mean a supernatural event is the cause of it.  That simply means that science is still searching a natural explanation that can account for its chemical and physical characteristics.  This research can well lead to a proper finding in the future.\nI think any scientist, believer or not, should agree with this kind of statement. Unfortunately, in the Shroud world, many scientists doesn’t seem to think like this…  And that’s what really bugs me!\nThat’s all I have to say about it and I hope people will finally understand my motivation for the numerous critics I’ve expressed over the years on this blog.  Now, can let’s talk about science…  real science!\n\n","date":"May 28, 2013 at 8:27 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35111","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nYannick Clément :\nAs I said, if this is correct, it’s very sad that Legrand never set the record straight about that…\nAnd here’s another question for you:  \nIn a previous comment (which gave me great lights about the whole issue), you mentioned this: “It (the blood on the Shroud) changes color (brightens) only upon exposition to bright sunlight or UV light – which explains immediately why bilirubin was brought up at all – it is bilirubin which brightens it up, because it reacts with UV light.”\nTaking that into account, here’s my personal opinion on the whole “blood is too red” issue: In the end, the reddish aspect considered too bright of the blood of the Shroud when it is exposed to sunlight (or another UV source) could be due to a level of bilirubin in the blood much higher than normal, just like it was described in Adler’s hypothesis.\nSo, the question is:  Do you think pretty much the same as me?  Or did I miss something from all the numerous comments you wrote in the last days?\n\nYES. I think exactly the same way. I am a little puzzled that bilirubin which is generally not a stable compound is still there, but it might something to do with it being “fixed” by reaction with something – maybe with saponin ( this is pure speculation, though).\n\n","date":"May 28, 2013 at 6:07 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35142","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thanks for this short and precise answer…\n\n","date":"May 29, 2013 at 8:25 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35201","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"http://www.acheiropoietos.info/proceedings/SvenssonWeb.pdf\nThis is the link provided by Kelly Kearse and you can find the description of the experiment By Diane Soran who washed the cloth in Saponaria weed and tested the hemolytic effect on red blood cells – the stains remined red even after 26 years.\nIf Saponaria has conservation abilities this might also be true for the biliribun – after all it is a hemoglobin metabolite.\n\n","date":"May 28, 2013 at 6:16 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35145","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"jesterof & Yannick,\nIn the experiment by Svensson, “he omitted the crucial point in the experiment – irradiating the spots with UV light”.  In the Soran experiment is interaction with Saponin\nsubstituting for UV irradation, here, or is it assumed that sufficient uv exposure was present when the experiments were performed?  \nHave Figures of the Soran results ever been published, or presented at a conference that was videotaped-if so, does anyone have a reference?  Not doubting the findings, have heard this referred to in the literature several times, have always been interested to see the actual results.\nRegarding the conservation abilities of Saponin, is this in reference to an interaction with the bilirubin or bilirubin products directly, or the conservation properties of inhibiting bacterial, fungal growth, and thus, degradation, or both?  \nYannick, what exactly is the best empirical evidence that the Shroud was once treated with saponin- weak background fluorescence?  I know historically there is evidence of the processing methods of linen, but am referring in relation to the STURP findings (Rogers).   Saponin glycosides were assayed for, but not detected, correct?  Anything else? I believe Heller & Adler developed a test with sulfuric acid-but this was negative-saponin products may no longer remain, etc.   \nA couple of months ago, with my back pocket securely fastened :) , I began some preliminary work with saponin, just comparing different methods for extraction for treatment of cloth-some of the earlier references used mild heating (in water), stronger heating, others (Adler & Heller) used 1% NaOH.  I tried all of these and found there was a significant difference in whatever extraction method was used. \nFinally, here’s a reference (non-Shroud related) on Saponin treatment & effects on erythrocytes: http://www.sciencedirect.com/science/article/pii/S0065128104700136\n\n","date":"May 28, 2013 at 9:49 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35161","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"In the experiment by Svensson, “he omitted the crucial point in the experiment – irradiating the spots with UV light”. In the Soran experiment is interaction with Saponin\nsubstituting for UV irradation, here, or is it assumed that sufficient uv exposure was present when the experiments were performed? \nI am talking exclusively about Soran, Swennsonn’s missing the UV irradiation did not yeald any results.\nSoran did not irradiate her spots by UV light, her spots were the result of hemolyzed erythrocytes ( because of the saponin conservation).\nAt least that is what one gets from the description in the article by your link\n\n","date":"May 28, 2013 at 10:11 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35162","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Finally, here’s a reference (non-Shroud related) on Saponin treatment & effects on erythrocytes: http://www.sciencedirect.com/science/article/pii/S0065128104700136\nOK, then it is proven independently that it does hemolyze erythrocytes by destroying their membranes ( duh, how would you otherwise hemolyze them? – sorry, couldn’t resist :-)\nThe question is – does it also bind the hemoglobin and prevents oxidation as one would assume from the short paragraph on Soran\n\n","date":"May 28, 2013 at 10:14 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35164","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\njesterof :\nIn the experiment by Svensson, “he omitted the crucial point in the experiment – irradiating the spots with UV light”. In the Soran experiment is interaction with Saponin\nsubstituting for UV irradation, here, or is it assumed that sufficient uv exposure was present when the experiments were performed?\nI am talking exclusively about Soran, Swennsonn’s missing the UV irradiation did not yeald any results.\nSoran did not irradiate her spots by UV light, her spots were the result of hemolyzed erythrocytes ( because of the saponin conservation).\nAt least that is what one gets from the description in the article by your link\n\nSo, uv is not absolutely necessary for the red color?\n\n","date":"May 28, 2013 at 10:24 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35165","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"“Have Figures of the Soran results ever been published, or presented at a conference that was videotaped-if so, does anyone have a reference? Not doubting the findings, have heard this referred to in the literature several times, have always been interested to see the actual results.”\nCouldn’t find anything on the web except referrals to her experiment.\nHowever, the Springer link is an independent proof of saponin hemolyzing abilities.Unfortunately, one can’t read the whole article – there could be further information which might answer at least partially the question of interest for us.\n“Regarding the conservation abilities of Saponin, is this in reference to an interaction with the bilirubin or bilirubin products directly, or the conservation properties of inhibiting bacterial, fungal growth, and thus, degradation, or both? ”\nChemical stability only. Just postulating, since it looks like saponin stabilyzes hemoglobin, it also can react with bilirubin ( which is a hemoglobin metabolyte down the road, with a similar chemichal structure )\n\n","date":"May 28, 2013 at 10:32 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35166","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nKelly Kearse :\n\njesterof :\nIn the experiment by Svensson, “he omitted the crucial point in the experiment – irradiating the spots with UV light”. In the Soran experiment is interaction with Saponin\nsubstituting for UV irradation, here, or is it assumed that sufficient uv exposure was present when the experiments were performed?\nI am talking exclusively about Soran, Swennsonn’s missing the UV irradiation did not yeald any results.\nSoran did not irradiate her spots by UV light, her spots were the result of hemolyzed erythrocytes ( because of the saponin conservation).\nAt least that is what one gets from the description in the article by your link\n\nSo, uv is not absolutely necessary for the red color?\n\nOf course not. There could be different mechanisms – I am speaking in general here – not specifically about the Shroud.\nSpecifically in the Shroud case it looks for me that it is bilirubin-related since the initial reference to the “too red” was under UV exposure and then mentioned that the color darkened.\nthere is also could be a combination of factors – we don’t know exactly by which mechanism ( chemical reaction) did the color reamined red in Soran’s case. Maybe it is slowing the oxidation process but not totally obliterating it – for hemoglobin and permanently stabilizing bilirubin – then ( I am grossly speculating here) for the Shroud situation it would have had double effect – stabilized bilirubin so it is still there in quantities enough to produce reaction under UV exposure and reaction with hemoglobin which might have faded with time, but changed the oxidation process\n\n","date":"May 28, 2013 at 10:38 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35168","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\njesterof :\nFinally, here’s a reference (non-Shroud related) on Saponin treatment & effects on erythrocytes: http://www.sciencedirect.com/science/article/pii/S0065128104700136\nOK, then it is proven independently that it does hemolyze erythrocytes by destroying their membranes ( duh, how would you otherwise hemolyze them? – sorry, couldn’t resist :-)\nLooks like pretty significant damage to the membranes-major disruption of protein association, protein aggregation, etc.  We actually evaluated the effects of multiple detergents on cells to select for those that were relatively mild to maintain protein:protein interactions in the lab.  Some were gentle enough that surface (membrane) proteins could be removed, yet the cells would still exclude trypan blue after treatment.  Saponin was way too harsh, major disruption.\nThe question is – does it also bind the hemoglobin and prevents oxidation as one would assume from the short paragraph on Soran  \nYes-that would be interesting to see.  If so, how might that integrate with Alder’s finding that most of the blood on the Shroud was in the oxidized form?\n\n","date":"May 28, 2013 at 10:43 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35169","author":"Kelly Kearse","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Here’s a question for jesterof, following his comment #159:  Do you think that the probable fact that “bilirubin is still there” in the bloodstains can be simply due to the very traumatic state in general and of the blood in particular of the Shroud man?\nIn other words, beside things like a presence of residues of saponaria that could have acted on the bloodstains (this is a possibility, I agree with you), don’t you think that the most simple, probable and rational explanation for the probable fact that “bilirubin is still there” remains the very probable and unusual presence of some high level of substances in the blood related to the traumatic state of the Shroud man at the time of death?  Of course, we can first think about the probable high level of bilirubin that could have had an impact on the fact that “bilirubin is still there”, but we can also think of other possible high level of substances like urea, lactic acid, etc…\nWhat is your opinion about that?  Maybe the answer simply lies in the fact that the bloodstains were made of highly traumatic exudates of blood clots?\n\n","date":"May 29, 2013 at 10:52 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35230","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"The trauma caused the bilirubin level to increase – we all have some normal level of it as erythrocytes are not immortal and hemoglobin from them has to be metabolyуzed. Iunder traumatic condition one has more erythrocytes to break down and release hemoglobin into the bloodstrem – therefore bilirubin levels rise ( it is hemoglobin metabolyte). So initial high level of bilirubin in the bloodstrem of the Shroud Man is due to trauma.\nBut bilirubin is generally unstable compound so in order to stay it should somehow be preserved – maybe by saponin? I don’t know and I don’t think anybody researched the issue ( I looked into that)\n\n","date":"May 29, 2013 at 1:19 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35261","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Because I’m pretty sure Adler was aware of that issue of the instability of bilirubin versus the long preservation it should have endure until today, I really wonder what was his own hypothesis about that.  I don’t think he ever addressed that particular issue publicly in his writings or during a presentation, but I might be wrong.  Would be nice to know what was his idea about that…\nBut I have to repeat my previous question to you jesterof:  Don’t you think that some other substances that could have been present in the traumatic blood of the Shroud man at the time of his death could have played a role (maybe crucial) in helping the bilirubin to get preserved in the bloodstains until today?  Is it possible that a high level of urea, of lactic acid or of some other substances like that (substances probably present in the blood in the context of a tortured body) could have been the main cause of the preservation of bilirubin until today?\n\n","date":"May 29, 2013 at 2:03 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35273","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Oh by the way, I wonder if the fact that the bloodstains were made of exudates of blood clots instead of whole blood could not also be another possible explanation for the probable good preservation of the bilirubin in these bloodstains.  What do you think jesterof?  Is it possible that the very particular nature of these stains could have helped for the preservation of the bilirubin until today?\n\n","date":"May 29, 2013 at 2:08 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35274","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"One last reply to jesterof:  In the end, is it also possible that, even though bilirubin is pretty unstable, that it could be preserved NATURALLY (without the help of anything special) in certain circumstances, especially if the bloodstained cloth has always been carefully preserved over the centuries?  Here, I think particularly about the very probable fact that the Shroud had been very rarely exposed to open air and, more importantly, to sunlight…\nIn such a context of a cloth well preserved and almost always kept in the dark and in a container of some kind, don’t you think that this could have been enough good conditions to have naturally preserved the high level of bilirubin inside the bloodstains for all these years?\nGood question, don’t you think?\n\n","date":"May 29, 2013 at 3:46 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35283","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Mr. Kearse wrote this in his comment #162 : “Yannick, what exactly is the best empirical evidence that the Shroud was once treated with saponin- weak background fluorescence? I know historically there is evidence of the processing methods of linen, but am referring in relation to the STURP findings (Rogers). Saponin glycosides were assayed for, but not detected, correct? Anything else? I believe Heller & Adler developed a test with sulfuric acid-but this was negative-saponin products may no longer remain, etc.”\nMy answer:  You’re right, neither Rogers or Heller and Adler were able to detect any traces of saponaria on the STURP samples, even though they did various analyses to detect it.\nMaybe this is due to the fact that saponaria traces has been “washed away” over the centuries.  Maybe also this is due to the fact that saponaria never was used to washed the final cloth and another kind of natural detergent was used.  It think it’s a proven historical fact that some ancient linen cloths were washed with other products than saponaria, but I must say that I never did any researches about that.  Some months ago, Dan posted something interesting about Pliny the Elder writings.  Supposedly, he never mentioned saponaria as the main product used to wash the cloths during Antiquity, but another kind of natural detergent made with olive oil.  Nevertheless, Rogers main source of information concerning the possible use of saponaria didn’t come from an ancient book written by Pliny the Elder but from Anna Maria Donadoni, who was a conservator at the Turin’s Museum of Egyptology and a true expert in ancient fabrics.  She told Rogers that washing the final linen cloths with saponaria was common during Antiquity…  In fact, this particular product was often used because it was able to make the cloth more supple.  \nSo, in the end, who knows?  I think the incapacity of STURP to detect traces of saponaria is probably due to one of the two possibilities I just mentioned…  And I don’t think that if the cloth was washed with another sort of detergent, this could make a noticeable difference concerning the image-formation hypothesis of Rogers because there are still many other possible sources of carbohydrate impurities that could have been left on the cloth after his final washing…\nAnd concerning your question “what exactly is the best empirical evidence that the Shroud was once treated with saponin?”, I can only talk for Rogers (and not for other STURP members).  Here’s the most relevant quote from Rogers book that can give you a proper answer: “Saponaria hydrolyzes to produce some aglycones that are fluorescent in the blue-white region, and the non-image part of the Shroud is weakly fluorescent with a maximum at about the correct wavelength, 435 nanometers.  The fluorescence support the idea that the cloth had been washed in struthium (note: I think this is another name for saponaria).”  Rogers also wrote that saponaria is toxic and it is potent preservative, which can explain the very good state of the linen, even today.  Finally, there is the finding of Rogers concerning the fact that saponaria is hemolytic, which could have played a role in the color of the bloodstains today.  For Rogers, there’s no doubt that this finding was another interesting clue to think that saponaria had really been used to wash the final cloth.\nBut all those clues are just what we can call “circumstancial evidences” and nothing more…  No doubt that more testing should be done on this question with more modern instrument and analytical methods.  While we all wait for this to happen, I think it would be great if some true expert in ancient textile could be found in order to see what they think of the possible use of saponaria in the context of an ancient burial linen cloth like the Shroud, possibly made during Antiquity.  I also think it would be nice if some experiments could be done on linen samples prepared with all the possible known method of manufacture that were used during Antiquity and see what kind of fluorescence can be produce (in order to see what could be the best match with the fluorescence of the Shroud and also in order to see what kind of carbohydrate impurities could be produced and where these impurities could be found on the cloth – only on the surface or deep inside the cloth).\n\n","date":"May 29, 2013 at 1:03 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35257","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"But I have to repeat my previous question to you jesterof: Don’t you think that some other substances that could have been present in the traumatic blood of the Shroud man at the time of his death could have played a role (maybe crucial) in helping the bilirubin to get preserved in the bloodstains until today? Is it possible that a high level of urea, of lactic acid or of some other substances like that (substances probably present in the blood in the context of a tortured body) could have been the main cause of the preservation of bilirubin until today?\nIt IS possible. However I do not know about any experimental proof of that. The blood in normal conditions is full of interesting possibilities, not to even to mention a gazillion combinations of reactions in the blood of person under stress and upon death.\nBut it has to be checked to verify.\n\n","date":"May 29, 2013 at 6:37 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35301","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nYannick Clément :\nOh by the way, I wonder if the fact that the bloodstains were made of exudates of blood clots instead of whole blood could not also be another possible explanation for the probable good preservation of the bilirubin in these bloodstains.  What do you think jesterof?  Is it\npossible that the very particular nature of these stains could have helped for the preservation of the bilirubin until today?\n\nof course there is – there is a lot of possible combinations – pleural fluid with addition of blood, lymph with blood, interstitial fluid with blood, urine with blood, gastric contents with blood, mucous with blood.\nI did write about it in the thread about br.hirudo.\nI order to find out one has to learn what stabilizes bilirubin in a blood stain.\n\n","date":"May 29, 2013 at 6:41 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35302","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nYannick Clément :\nOne last reply to jesterof:  In the end, is it also possible that, even though bilirubin is pretty unstable, that it could be preserved NATURALLY (without the help of anything\nspecial) in certain circumstances, especially if the bloodstained cloth has always been carefully preserved over the centuries?  Here, I think particularly about the very probable fact that the Shroud had been very rarely exposed to open air and, more importantly, to sunlight…\nIn such a context of a cloth well preserved and almost always kept in the dark and in a container of some kind, don’t you think that this could have been enough good conditions to have naturally preserved the high level of bilirubin inside the bloodstains for all these years?\nGood question, don’t you think?\n\nYes, it is a good question.\nI don’t see any reason why bilirubin should not be possibly preserved by allnatural means ( I actulally never even thought about anything suprnatural, since there are tons of possibilities).\nAbsence of light will slow bilirubin breakdown, but we still have the issue of very long time…\nOn the other hand, all references to bilirubin instability I know are to the bilirubin in liquid state, so, theoretically it is possible that simply drying will change it instability…\nBut again – I don’t know from the experimental standpoint and I do not have possibilities to test it.\nI did not find any web references to bilirubin stability/instability upon different physical state – I checked it when I was participating in the thread about br. hirudo\n\n","date":"May 29, 2013 at 6:46 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35303","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Thanks a lot for these replies jesterof!  I will print them out and read them more carefully later today.\n\n","date":"May 30, 2013 at 8:26 am","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35336","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Message for jesterof : After reading the answers you gave me concerning the 3 hypotheses I wrote down yesterday that could maybe explain the preservation of the bilirubin inside the bloodstains until this day, I first want to say that I agree 100% with you about the fact that, since there are plenty of possible natural explanations for this, there is absolutely no reason to imagine some supernatural cause, unless of course someone belong to the supernatural findge of the Shroud world and desperately wants to back-up his ideology!\nAlso, I want to say that while I read your answers, I realized that my three hypotheses (or a combination of two or three of them) have all some chances to be relevant in the case of the bloodstains that are present on the Shroud.  And since history of science has clearly showed that the simplest explanations are very often the correct ones, I think the solution for the preservation of the bilirubin for so long can well be found there.  Of course, a lot of proper testing under laboratory conditions should be done to verify my three hypotheses…\nFor the moment, my guess is that the very particular nature of the blood transfer that occurred on the Shroud (exudates of humid blood clots), along with the historical fact that the cloth has been well-preserved almost all the time inside some types of containers, away from open-air, sunlight and any other source of UV light, can well represent “enough” factors that have lead to the preservation of the bilirubin inside all the bloodstains of the Shroud (or at the very least, most of them).  Along with these two factors that we’re sure had some impact on the nature of the bloodstains, the possibility that there could have been some other substances in these stains that were related to the traumatic state of the Shroud man (like urea, lactic acid, etc.) has to be considered very seriously…  I really think that this other factor could also have had some impact on the particular nature of the bloodstains on the Shroud.  So, why not thinking that it could also had some impact on the preservation of the bilirubin inside these stains until this day?  Of course, what would really help to give credits to this hypothesis would be to confirm the presence of such substances in the bloodstains.  For the moment, I really don’t think any researcher have been able to confirm such a thing, not even Adler, but I really don’t think that he thought of performing some analyses to verify the presence of substances like urea or lactic acid in the blood samples that he had…  One thing’s for sure: I never read anything about that in his writings, and nothing more in Baima Bollone’s own writings.  If a new series of direct test should be allowed in the future, I hope this lack of testing for such substances (for bloodstained samples as well as body image samples) will be corrected!\n\n","date":"May 30, 2013 at 1:00 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35362","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Yannick, I can guarantee you that lactic acid, urea and the whole bunch of other substances were there in the bloodstream, as all of those are present in the bloodstream under normal conditions as well. Some of them do increase, some decrease under specific conditions of various illnesses and situations, some are even used as markers of certain conditions. It does not to be tested to prove they were there – it’s an axiom, if the stains are blood. \nwe don’t even know if simple drying of the blood does not serve as a preservation method.\nI tried to search the web to find out how do labs ( which offer the commercial kits) preserve bilirubin, but couldn’t find anything for longer than 2-3 weeks – if we d not know, it does not mean there is not known method or substance or else for bilirubin in the blood to stay stable.\nI do not think it is such an enigma, simply the issue is approached only from the Shroud point of view and it should be approached from lab technology point of view.\nPersonally, I would like to find out WHY the blood stains on the saponaria-treated cloth in the experiment stained in a bright red color and that stayed that way for 17 years.\nThis question is not answered and one can not explain it just by bilirubin amount, because there is no time for the blood in the sample to metabolize the hemolyzed hemoglobin to it’s metabolites. But it does stay red, becasue of hemolysis – so is it enough? I mean do the broken erythrocyte membranes serve as a preservation material against oxidation?\nWhen I read the materials on the experiments described I am very often left with impression – why was only this question asked, why not the logical next one, or was it asked an not reported?\n\n","date":"May 30, 2013 at 5:15 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35389","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Quote from jesterof : “Personally, I would like to find out WHY the blood stains on the saponaria-treated cloth in the experiment stained in a bright red color and that stayed that way for 27 years.  This question is not answered and one can not explain it just by bilirubin amount, because there is no time for the blood in the sample to metabolize the hemolyzed hemoglobin to it’s metabolites. But it does stay red, becasue of hemolysis – so is it enough? I mean do the broken erythrocyte membranes serve as a preservation material against oxidation?”\nHere’s the opinion of Rogers on this topic (we can find it in his book about the Shroud): “Incidentally, we found that Saponaria Officinalis are hemolytic; they break the membranes of red blood cells and release the red hemoglobin. Hemolysis is used to determine the hemoglobin content of blood.  WHOLE BLOOD darken as it ages on cloth; however, the blood spots on the Shroud are still QUITE RED after centuries of known history.  Diane Soran of Los Alamos tested hemolysis on Saponaria-washed cloth before we went to Turin.  The blood is still red on those 25 years old samples although the blood on the non-Saponaria-washed control samples is black.  This fact might help confirm that ancient technology was used to produce the cloth.”\nI hope this can help you jesterof…  Note that Rogers committed one important mistake in his lab experiment:  he used whole blood to reproduce the bloodstains on the Shroud while, since Adler’s analysis, we know that those stains were produced by exudates of blood clots and not by whole blood.  But I think we can forgive Rogers since he was not an expert on blood and also, he did his experiments BEFORE the analyses of Adler…  Also, I want to point out the term used by Rogers, who saw the Shroud live in Turin, to describe the color of the blood : “quite red”…  I think this goes very well with the observation made by Antoine Legrand in the 1970s concerning the fact that the bloodstains on the Shroud were not as red and bright when they are seen in a room with no sunlight than when they are seen under the light of the sun, as he was able to see them in 1931…  Obviously, the term “quite red” must not been understand as “bright red”.  Of course, we can think that, even inside a room, these stains are still redder than normal, but the difference versus other ancient bloodstains is surely not as great as some as said over the years and it can well be due to a high level of bilirubin inside these stains, like it was described by Adler.\n\n","date":"May 31, 2013 at 1:03 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35471","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"27 years\n\n","date":"May 30, 2013 at 5:16 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35390","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"No, it can not help, because I know this and my question is not about how Saponaria works in hemolysis, but what makes hemolyzed blood stay bright. In other words – does hemolyzed blood stay brighter vs not hemolyzed? And if so, is it only the hemolyzed blood by Saponaria washout or any way of producing hemolysis will work the same way.\n\n","date":"May 31, 2013 at 2:21 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35489","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"I guess this would need more testing right?\n\n","date":"May 31, 2013 at 2:42 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35494","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Yannick wrote [See message 156.]\nPaul Maloney wrote:  “Sorry I’m slow to respond.  I am in the throes of getting ready to leave for State College and, though I’ve not finalized my schedule, I’ve been attending to domestic projects–trying to take care of every detail before I’m gone.\nI’m not certain that I can offer much more by way of a cogent answer to your questions.  I’m reluctant to commit myself to speculation.  I’m the kind of person that likes to base my responses on the facts.  In a previous e-mail comment I noted that there is much we do not yet know about the Shroud.  And many of those questions, good questions they are, but I think are incapable of a factual basis until a scientific team can go back to the Shroud and address them directly by a fresh study of the cloth with its image.\nHaving said that, there are a few comments I can make.  First, to the comment about the Church Authorities having woefully mis-handled the scientific testing in 1978–this is something I think was completely irrelevant at that time.  The Church did not receive ownership of the Turin Shroud until March 1983 after the death of the former owner, the late Italian King Umberto II, who was living in exile in Portugal.  Fr. Peter Rinaldi, a personal friend of the King’s, shared some things with me as General Projects Director as I was in the midst of preparing a team for a new round of testing on the Shroud.  Technically, all of the samples taken from the Shroud were still owned by King Umberto II and made available to STURP for scientific study.  The custodian of the Shroud at that time was His Eminence Anastasio Cardinal Ballestrero who needed a science advisor to guide him because Cardinal Ballestrero was not himself a scientist.  Prof. Luigi Gonella of Turin Polytechnic was tapped for the job.  But I know from talking with Gonella personally, the goal was aimed toward the conservation of the Shroud–this totally aside from the effort to radiocarbon date the cloth–a project that was wrested away from the main protocol by Harry Gove.  As Adler once said, you cannot conserve a cloth, with an unexplained image, that also had blood on it.  So the samples were used to identify the various components of that cloth with the hopes that an idea about conservation might come forth.\nBut having said that, I must also add that Fr. Peter revealed to me that King Umberto was also very “liberally” disposed toward what science wanted to do with the cloth to determine its nature.  He even would have allowed the backing cloth to have been removed during that week that STURP was in Turin in October 1978.  However, Cardinal Ballestrero, the custodian, prevented that from happening.  There was, as Gonella said to me on an occasion at the Rye Town Hilton, in Ryetown, New York, (Nov. 21, 1987),  much  concern about conserving the stitches and repairs made by royalty over the centuries.  Gonella, himself, resisted the idea to remove any of the patches (or the backing cloth) for that reason and, I believe, Cardinal Ballestrero was seemingly of that same opinion.  But I don’t know who influenced whom–Gonella influencing Cardinal Ballestrero, or the other way around?\nSecond:  As I noted in a previous communique, I am an archaeologist, a trained historian [they say that an archaeologist is “an antique historian” :-)]  As such I have been trained to be extremely cautious about “arguments from silence” because there is always the danger that we humans may “read into” that silence to draw conclusions that the person of which we are asking it (and now deceased) would not want drawn–say, for example, Dr. Pierre Barbet.  It is true that he did not make any comment about the “redness of the blood” but this may be meaningless.  If no one asked Dr. Barbet about it he may never have thought to discuss it.  Thus, history conclusions should not be based upon arguments from silence.\nThird, Rogers was a dedicated scientist.  In fact, he was a very rigorous scientist!  As such he was a model to be much admired.  Rogers, the human, probably had many opinions about many things–and I know from my private phone discussions with him, in fact he did.  But Rogers, the scientist, did not always engage himself to answer questions that he had not carefully researched.  The registry of surprise that McCrone, or Rogers, or others, had not addressed some of the issues does not take into account the fact that someone who wanted to maintain his reputation for rigor, would, instead, want to spend some time researching it before answering the issue.  But Rogers was not a specialist in blood–a hematologist–he was technically a thermal chemist.  For example, he knew full well–and immediately, when the conservation commission opted for the intervention of Summer of 2002 on the basis that the burn areas on the Shroud might catch fire, or blow up–it was Rogers who blew up!!  Rogers knew that there was nothing at all to the fear that the Shroud might be subject to spontaneous combustion and destroy itself.  Instead, he lamented to me that much of historical value (not only the stitches and patches and backing cloth which Gonella had resisted having removed) but also the pre-1532 fire evidence when the fibers that surrounded those burn holes were tweezed away and lost to future science.  As for McCrone, he made himself abundantly clear that the redness of the blood was due to an artist’s pigment and nothing else.\nFinally, In a previous communique I also alluded to an employee of McCrone’s who had found an organic [blood?] signal on one of the STURP tapes, and in parentheses I mentioned the name “Anderson????”.  From McCrone, in his book JUDGEMENT DAY FOR THE TURIN SHROUD, (p. 126) I learned my spelling was off.  It was actually “Andersen.”  I located my copy of Barrie Schwortz’ book which he edited for Ray Rogers and could confirm that Mark Anderson was the person of whom I was referring. I looked up “Andersen [it is actually spelled “Anderson” there) and found the passage I was referring to:  p. 61 and I quote: \n    “Joan Rogers identified suitable fibers on the tape samples and prepared them for analysis.  She took tapes, fibers from non-image areas, and fibers from image areas to Instruments SA, Inc., in Metuchen, N.J. in December 1979.  The samples were analyzed by Dr. Fran Adar.  Similar samples were analyzed by Mark Anderson, McCrone’s MOLE expert in January 1980.”\n    “Anderson observed that most of the red flecks on the Shroud ‘bubbled up and turned black’ when he hit them with the laser beam.  This was an entirely different response than he got from authentic hemitite crystals.   He said it ‘acted like an organic phase’ (21 January 1980).  Walter McCrone refused to accept those observations.  If he wanted the image to be painted with hematite, no conflicting observations would be allowed.”\nI don’t know when I will be able to return to Quakertown and have access to my own computer and my research library.  I hope the above comments will suffice for the moment.  Many thanks.”\nPaul\nGen. Proj. Dir. ASSIST\n\n","date":"May 30, 2013 at 10:26 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35418","author":"Joe Marino","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"\nYannick Clément :\nI guess this would need more testing right?\n\nof course. that’s my point\n\n","date":"May 31, 2013 at 4:07 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35510","author":"jesterof","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"We both agree.\n\n","date":"May 31, 2013 at 4:32 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35514","author":"Yannick Clément","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"“Technically, all of the samples taken from the Shroud were still owned by King Umberto II and made available to STURP for scientific study”.\nI’m not to sure about that statement. When I get a moment I’ll elaborate further. In general the Vatican and Turin followed traditional protocol to the past King. However the Italian government could have intervene at anytime if they chose so. \nJoe, Please thank Paul for me. His efforts and time he spent on this forum was very appreciated.\nGiorgio\n\n","date":"May 31, 2013 at 8:27 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35540","author":"Giorgio","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Paul Maloney writes, “Please convey my thanks to all the participants and their wonderful questions.  Sorry I can’t be available for a time for further participation.”\n\n","date":"June 1, 2013 at 9:15 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35658","author":"Joe Marino","site":"shroudstory"},{"title":"An Important and Highly Informative Guest Posting by Paul Maloney","post":"Here’s a long reply to the last post written by Paul Maloney: https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/#comment-35418\nPaul, even if Barbet is not here no more to answer our questions, the fact is that he left us a very complete book about the Shroud in which he addressed all the possible issues that were important for him.  Like we cleverly say in French (personal translation):  Talks are flying away but writings stay!  In truth, the only things we can find about the color of the blood in his book are two short mentions of its particular color and only one of these use the term “special coloration” (remember that Barbet saw it in sunlight) without any attempt to explain it and any mention that this was seen as a real problem for him (or that it was a problem for other Shroud researchers like Vignon or Legrand) regarding the question of its authenticity.  Note that since I never read anything that was written by Vignon and Legrand, I’m still curious to learn if they talk specifically about the color of the blood somewhere and if they did, I wonder if they ever mention it as being a “problem” regarding its authenticity, but since Barbet don’t talk about a problem regarding the color of the blood while quoting these two researchers on the subject, I seriously doubt that they were considering it as a real problem…  Maybe Paul, you can tell me more about the writings of Vignon and Legrand on the subject.    \nAnyway, as I said the other day, the simple fact that Barbet IMMEDIATELY recognized that the bloodstains could not be anything else than bloodstains made with real blood exudates from blood clots is enough for me (as it should also be for you) to understand that the color of the blood was nothing close to be a problem in his mind of expert.  Or else, it’s evident that he would have had some doubts before shooting out loud: look, this is true blood!  That’s not at all the reaction he would have had if the color would had been problematic regarding the question of the authenticity of the blood.  The fact is this:  Barbet was SURE AND CERTAIN that the blood was real blood and he was also SURE AND CERTAIN that these stains were formed by exudates of humid blood clots and not from fresh blood that would have been in liquid form.  Note that Adler too had the same exact reaction when he first saw the Shroud in person in Turin in 1997!  \nThe very telling reactions that Barbet and Adler had in front of the Shroud versus the question of the authenticity of the blood, no matter is color (which is truly a secondary question that was not even addressed by Barbet publicly), is well enough to understand that theses stains on the Shroud are nothing else than real human blood that have stained the cloth versus a very particular process that was described first by Barbet (exudates of moistened or re-moistened blood clots) and then, later on, was scientifically approved and confirmed by Adler (and also Baima Bollone).  That’s what really matters in the end, and that was the main goal of the long comment of mine that was posted by Dan on his blog the other day…  \nQuestion for you Paul: WHAT ELSE DO YOU NEED TO BE CONVINCED THAT THE BLOOD IS REAL HUMAN BLOOD AND THAT ITS COLOR DOESN’T REPRESENT A PROBLEM REGARDING ITS AUTHENTICITY?  \nPersonally, what I’m convinced is this:  The bloodstains on the Shroud are real exudates of human blood clots that possessed a highly traumatic nature.  And if the color of the blood would have been as “problematic” and “unusual” as some people in the Shroud world would wanted us to believe (we both know that many “shroudies” wants to use this “particular color” to make another direct link with the Resurrection), both Adler and Barbet would never have reacted the way they did when they first saw the bloodstains on the cloth!  You can say anything you want, you will never convinced me of something else…  Their reactions (very much the same) were too much telling to mean anything else than there was no real problem for them concerning the color of the blood versus the question of its authenticity!  This is evident to me.  And if it is so, this can only mean one thing:  Both experts had already an explanation for it!  The only difference that remains is that we know Adler’s explanation while we don’t know the one of Barbet.  But in the end, it’s nothing important because it’s evident that if he didn’t had a natural and rational explanation for the color, Barbet would have been much more prudent in his claims that the blood was made of real human blood.  And I don’t believe that thinking that way makes me distort the historical truth.\nRemember that a lot of person at the time believed the Shroud and these stains to have been created by a medieval painter!  In that context, if Barbet would had been puzzled by the particular color of the blood, don’t you think like me that he would have had some hesitation before crying out loud publicly: this is blood! ?  Don’t you think like me that if Barbet would had been puzzled by the particular color of the blood, the painting theory would have come back into his mind, with the result that he would have had some serious doubts about its authenticity?  I REALLY THINK SO MY FRIEND!  Again, this is pure logical thinking versus the known historical facts.  I really don’t think this can be seen as a distortion of the historical reality or a free extrapolation from me.  \nAnd concerning McCrone’s claims, everyone must recognize that he was no expert in blood and, truly, the anecdote you gave us concerning Anderson’s conclusion and the way he reacted to it is enough to understand that he was doing a biased kind of science against the authenticity of the Shroud…  His conclusion versus the blood has absolutely no value in my mind, especially in the light of the conclusions of true experts like Baima Bollone and Adler… \nNow, to get back on the question of the color, I think jesterof (a physician) have brought us the proper way to look at it.  Here’s to me the most important comment he made about that “issue”: “The blood IS brown. When you look upon it on the photos, or in the building – it is normal brownish color and not “too red”. as old blood is supposed to be.  It changes color (brightens) only upon exposition to bright sunlight or UV light – which explains immediately why bilirubin was brought up at all – it is bilirubin which brightens it up, because it reacts with UV light. Thanks to Louis’s link (Goldoni – The Shroud of Turin and the bilirubin blood stains) I finally have had the answer to my question and I was right ( in terms that I do not see those stains “too red” at all, because they are not on the presented photos of the Shroud).”\nI agree completely with him about that.  In fact, when you look at any available picture of the Shroud out there, it’s easy to note that most of the bloodstains shows a color that is not very different from a light scorch.  So much in fact that when you look closely at scorched areas where there are also some bloodstains, it is VERY HARD to know what if it’s a scorch or a bloodstain…  This is a fact that show quite clearly that the “too red” problem have not be well described generally in the Shroud world.  As mentioned by jesterof, it really seem to be “too red” only when it is seen in sunlight or under another source of UV light.  And as he told us very wisely, there are tons of potential natural explanations for this.  Much more researches are needed to know the truth and, until some true expert can make a very large analysis of the “problem”, there’s absolutely no reason to think this can represent a real problem versus the known laws of nature…\nAnd concerning the question of the bad way the Shroud samples were handled after STURP investigation, I admit that you have a very good point regarding the fact that, during those years, the Vatican wasn’t the true owner of the cloth.  But having said that, you must recognize that things were still as bad as they were back then when the sampling job of Riggi (assisted by Gonella) was done in 1988, at a time when the Pope did owned the cloth!  Also, I think the Church authorities, as the official custodian of the Shroud in 1978, could have, at the very least, made the same suggestion as mine (i.e. taking legal procedures to follow the trace of every sample and make sure all of them could eventually return to Turin) to King Umberto!  So, I believe my critic is still relevant.  And I hope the next time the Church authorities will allowed a new series of testing on the Shroud, they will take legal actions to prevent such a mess in the future.  In my mind, since the Pope is the true owner of the Shroud, he should be recognized also as the true legal owner of any samples taken from it.  It’s not proper procedure to take a sample from the Shroud in catimini, away from any public eyes like Riggi and Gonella have done in 1988 and it’s no more proper procedure to give away samples from the Shroud to anyone as if they were Holy Relics, with the high risk of damaging them or even worse, of loosing their traces forever (like it seem to be the case for the samples owned for a time by Nitowski)!  I sure hope things will be much different in the future when the Pope will allowed new direct testing on the cloth…\nFinally, concerning Rogers and his experiments with Saponaria versus the color of the blood, I think we should be VERY PRUDENT versus the results he got for the simple and good reason that he used WHOLE BLOOD to stain his samples, while we know, thanks to Barbet and Adler, that the stains where not made like this but, on the contrary, were made out of exudates of moistened or re-moistened blood clots, which caused the formation of very precise mirror images of the wounds and blood flows on the Shroud.  So, right off the bat, Rogers experimental set-up contained one major experimental flaws and because of that, we must be very careful with the interpretation of the results and I think this kind of experiment should be redone by a blood expert who would use exudates of blood clots to stain his linen samples instead of whole blood in a liquid form…  I hope those who believe I always buy anything that comes from Rogers will take good note of this comment of mine!\nAnyway, even if we disagree on some “issues”, I thank you again Paul for your answers and for the time you took to write them down.\nFinal note #1:  I was really surprise to note that you never addressed the main point I brought in concerning the slight difference in the sample map of Barrie Schwortz versus the one of McCrone and the question I had concerning the fact that the test plan of STURP was considering the sample 3-CB of McCrone has a blood/serum sample…  I wonder why you didn’t said a word about this interesting “issue”?\nFinal note #2:  Concerning the other comment you wrote which was posted by Joe Marino the other day about the work you do for a pictorial atlas of the various particles and fibers you have found in the Max Frei sticky tapes, I understand perfectly that you’re no expert in spectroscopy or chemistry.  That’s precisely why I asked you to find a true expert in one of these fields in order to get a professional verification of your own conclusions.  With all your profesionnal experience, I can’t believe you don’t know anyone in these fields that could be interested to make at least a visual survey of your work (without any direct analysis of Frei’s samples). This would be a very good start in my mind before you could publish your work.  Of course, doing direct tests to scientifically verified your own conclusions would be much better but, as you say, this is not evident at all since this would need time, money and the proper equipments.  That’s why I think you should at least find an independent expert that could make the same kind of visual detection you did in order to get another profesionnal point of view to support and/or correct your own conclusions.  In my mind, it’s only after this professional check-up work could be achieve that you could publish your work without too much fear of being crushed to the ground by the critics.  And here’s one other advice I have for you to avoid too much critics: You should publish your pictorial atlas with the clear mention “PRELIMINARY CONCLUSIONS”.  This would be honest from you and this would also encourage others to eventually take the lead of your work in order to push it further…  I hope you will take good note of these friendly advices (if you didn’t already had them in mind).\n\n","date":"June 2, 2013 at 5:00 pm","url":"https://shroudstory.com/2013/05/25/an-important-and-highly-informative-guest-posting-by-paul-maloney/","cat":"carbon_14_dating","id":"comment-35762","author":"Yannick Clément","site":"shroudstory"}]
