[{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"The Archdiocese of Turin stepped in it again.\n\n","date":"March 30, 2013 at 4:02 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28881","author":"Paulette","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"John, The samples which were warf and weft threads that were given to Ray was on December 12, 2003.  These threads were not from a direct transfer from Gonella and most of the evidence we have show that they were procured in the 90’s and not by Ray.\n\n","date":"March 30, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28884","author":"Giorgio","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"On page 208 of the book by Fanti & Gaeta there is a table mentioning the Shroud samples that are in circulation, as known by the authors. For each sample, there are five entries: (1) date, (2) material, (3) first owner, (4) second owner, (5) third owner (ie: data/materiale/1° possessore/2° possessore/ 3° possessore). Here are the ten last entries of this table:\n(1) 1988/pezzo di tessuto denominato ‘riserva’/custodia pontifica/ – / –\n(2) 1988/pezzo di tessuto/ A.J.T.Jull/Museo statale dell’Arizona/-\n(note:the piece mentioned above is also illustrated in the book, fig.9; it is discussed in the 2010 Radiocarbon paper by Jull & Freer-Waters)\n(3) 2002/parte del materiale del 1978-88 (proveniente dall’aspiratore)/Fondazione 3M. G.Riggi di Numana/ M.Alonso/G.Fanti\n(4) 2002/parte del materiale del 1978-88/Fondazione 3M. G.Riggi di Numana/M.Alonso/G.Lucotte\n(note:Lucotte has written a book on his observations: http://www.amazon.fr/Vérités-Saint-Suaire-Gérard-Lucotte/dp/2357910178)\n(5) 2002/Parte del materiale del 1978-88 (proveniente dai filtri)/Fondazione 3M/G.Fanti/M.Alonso\n(6) 2002/Parte del materiale del 1978-88/Fondazione 3M G.Riggi di Numana/G.Fanti/G.Lucotte\n(7) 2002/Parte del materiale del 1978-88/Fondazione 3M G.Riggi di Numana/G.Fanti/M.Antonacci  A.Lind\n(8) 2002/Piccola parte del materiale del 1978-88/Fondazione 3M. G.Riggi di Numana/G.Lucotte/-\n(9) 2002/Prelievi vari (toppe, fili, polveri, residui vari)/Custodia pontifica/-/-\n(I suppose that this is the material discussed in the 2002 book by Mzchthild Flury-Lemberg)\n(10) 2009/Materiale della Fondazione 3M del 1978-88/Fondazione 3M/Politecnico di Milano/-\nThe authors believe that the list is probably incomplete (‘Data la difficoltà di reperire informazioni, la lista risulta probabilmente incompleta’ p.207)\n\n","date":"March 30, 2013 at 5:21 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28887","author":"Jos Verhulst","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"why don’t we settle this…Fanti et al get AUTHORISED threads, and apply the same methodology\n\n","date":"March 30, 2013 at 11:16 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28909","author":"Matthias","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"Wot – for an experimental design that assumes that if one ancient piece of fabric has only half the mechanical strength of another, then it must be twice as old? Please spare us more of this Mickey Mouse “science”…\n(Nope. not ad hom – just pro science).\n\n","date":"March 31, 2013 at 3:21 am","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28916","author":"colinsberry","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"Came we agree that Gonella held back a part of the Shroud from the C-14 area? I think I indicated before in an earlier post, that may be an intermediary and if the fury of commentary, I failed to reiterate that, then the purpose of the blog in focusing a paticipant on the story he is telling is very valuable. I have  said on occasion, the real tragedy of Teilhard de Chardin is that the Church by directing him nor to publish during his life time, denied him the opportunity to have is ideas debated and rethought in light of criticism. Otherwise, without publication, we are to paraphrase LBJ, “hollering down a rain barrel. \nIt  may have escaped notice but I did offer a description of the bind we may be in as to authenticity. I indicated that Gonella was dead and ray was dead but that there was an intermediary who has refused to come forward. I am for now not at liberty to name him or her because I regard the conversation where I learned that as confidential and I can not betray that confidentiality.\nHowever, there is something that is not confidential at all. Unlike the  Turin reaction to Fanti, Turin had a distinctly different reaction to Rogers peer-reviewed 2005 article. Indeed, it rebuked one Turin personality who attacked Rogers and fond his article useful for future scientific investigation.\nOne of the really important items on Shroud.com is a chronology of the C-14 controversy compiled by Joe Marino and Ed Prior. For anyone interested in the controversy it is a must read. http://www.shroud.com/pdfs/chronology.pdf\nItem #37 concerns Rogers 2005 paper and the reaction to it. (pp.20-21)\nIt relevant part (on page 21) covers the reaction to Rogers 2005 paper both here and abroad, particularly in Turin. First he was criticized by Msg. Ghiberti but the rebuttal to Ghiberti came, not from Rogers but “The Diocesan Commission for the Holy Shroud (in Turin)”\n“Physicist and artist Isabel Piczek wrote ―It is not good enough just to look (with the naked eye) for a re-woven patch. It is an invisible reweave, which requires microscopic and microchemical analysis (to discover). Rogers‘ paper has to be accepted. New discoveries always cause lots of controversy, but (Roger‘s report) should be trusted because it was published in a peer-reviewed journal (as cited by Muldoon, Shena. ―Was the Dating a Hoax?‖ Inside the Vatican, 13:2 [March 2005], pg. 25). Even after this data was released, Turin‘s Monsignor Giuseppe Ghiberti told an Italian newspaper, “I am astonished that an expert like Rogers could fall into so many inaccuracies in his article.” However, a short time after that, The Diocesan Commission for the Holy Shroud released another statement, saying that the study of Rogers was “very interesting” and would be the basis for a future study “on the chemical characteristics of the cloth and its possible inhomogeneity‖ (as cited in Muldoon, Shena. ―Was the Dating a Hoax?‖ Inside the Vatican, 13:2 [March 2005], pg. 25.) It cannot be emphasized enough that insofar as he was the only person to have access to main Shroud samples and samples from the C-14 sample area, Roger‘s judgment should carry enormous weight. To see Rogers‘ impressive resume, go to: http://www.shroud.com/pdfs/rogersresume.pdf .\nFrom page 34, Rogers, A Chemist’s Perspective on the Shroud of Turin (Barrie Schwortz, Colorado, 2008) (Available at Lulu.com):\n“The results of analyses on the Raes sample made it appear that the radiocarbon sample that was cut for dating in 1988 was not valid (Chapter IX). This naturally caused another controversy. The only way to settle the validity question was to obtain some threads from the authentic radiocarbon sample. However, in dealing with Shroud problems, every sample must be documented without any gaps. I finally received a documented sample of radiocarbon yarn segments, both warp and weft, on 12 December 2003. Professor Luigi Gonella had pulled these segments from “the center of the sample” in 1988 at the time of sampling. Their history was known from that date.” \nSchwortz was the “publisher” of Rogers posthumous  book and, along with Rogers’ wife,  was carrying out Rogers’ dying request. The words are Rogers’.\nFrom Thermacimica Acta \n“On 12 December 2003, I received samples of both warp and weft threads that Prof. Luigi Gonella had taken from the radiocarbon sample before it was distributed for dating. Gonella reported that he excised the threads from the center of the radiocarbon sample.”\nPlease note, that in neither of these statements does Rogers say he received the threads “from” Gonella.”\nThere is no evidence that Rogers received them without authorization. Indeed, the reaction of the Turin authorities, indicates that they were well aware of his source. Life would be simpler if the individual who was intermediary for this sample would come forward. Alas, life and the Shroud, are not simple.\nTime eventually runs out for us all.\n\n","date":"March 31, 2013 at 6:41 am","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28937","author":"John Klotz","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"Happy Easter all. \nJohn I like to ask you a question. Now that you know who the mystery intermediary person is would you advise him to make a statement to be published on Shroud.com?\nAlso, don’t you agree if the Thermacimica Acta paper cited full disclosure detailing the chain of custody we wouldn’t be having this discussion?  That would leave many to believe that in fact they were from unauthorized samples.\n\n","date":"March 31, 2013 at 8:59 am","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28942","author":"Giorgio","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"Giorgio,\nThe man has refused entreaties from at least one internationally known personality. I only know of him through Heller’s book. There is one tactic that when I am about ready to publish, write it as I learned and then ask him to confirm or deny, promising to include his denial as well or his refusal to comment.\nThe time is not right for that. Stateside we call it “hard ball.” Right now, I can’t do that. Trust me.\n\n","date":"March 31, 2013 at 12:30 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28955","author":"John Klotz","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"Fair enough. However It’s almost been two years that he has avoided to answer the question.  And in my life’s inference growing up  in Jackson Heights Queens, while sporting my Savage Skull’s colors, we learned very quickly that silence is a virtue. Unless you don’t mind looking down the barrel of a Saturday night special. Simply put to non-New Yorkers, no matter what is said now, I will maintain a suspicion until the true CoC is disclosed.\n\n","date":"March 31, 2013 at 12:53 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28958","author":"Giorgio","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"Matthias (#4) has given the best suggestion, but it must not be forgotten that Saldarini, Poletto and, now, Nosiglia made it clear that they were having headaches with what was going on,so who are the scientists to whom they can give the authorised threads?\n\n","date":"March 31, 2013 at 11:19 am","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28947","author":"Louis","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"Poor, poor babies. We are dealing with the most remarkable item on the face of the earth. I am reminded of how one of my nuns from grammar school mocked school safety patrol members who said it was too cold to stand guard at street corners that day. “I wonder,” she said, ‘how they will withstand the freezing winds of Hell. That’s right Hell is both freezing and a fire.”\nI am not sure I accept the literal truth of Hell, but then again if dealing with the Shroud gives them a headache, imagine what kind of headaches they will endure.\nHas as been often said: “The hottest places in hell are reserved for those who, in times of great moral crisis, maintain their neutrality.”\n\n","date":"March 31, 2013 at 12:02 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28953","author":"John Klotz","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"On a more serious note, that’s a good question. It’s just the headache thing that put me off. I might suggest a five member committee  appointed by Francis: An American, a Frenchman, an Italian, and Englishman and a Spaniard to develop guidelines for the establishment of a new international study group. I can think of a Brit who spans many interests, an American who was a Sturp team member had founded the most widely followed Shroud web site. I am sure there are others who might have nominees from the other interests.\n\n","date":"March 31, 2013 at 12:09 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28954","author":"John Klotz","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"John, it is good that you added a serious note because we are talking about serious matters, matters that can influence people and affect their lives, even unconsciously. First of all, it seems that the Shroud is a secondary matter for the Church because it does not want the faithful to base their faith only on relics. What if there was no Turin Shroud? There is a lot more in the box and I am sure this is something blogmaster Dan will agree with ( see his post on PZ Myers).  For more, have a look at what New York Cardinal Timothy Dolan told ABC News’ George Stephanopoulos today, expressing opinions that were voiced more than a decade ago by the late Cardinal George Basil Hume, Archbishop of Westminster.\nIt has also been good to read that collinsberry is being taken seriously when he objects to personal attacks,character assassination and dogmatic statements expressed arrogantly, which are not at all conducive to good discussions.\n\n","date":"March 31, 2013 at 12:49 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28957","author":"Louis","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"In case anyone hasn’t notice, the militant atheists are eating our lunch. It’s Shroud science that I believe offers a scientific ground for a counter thrust. For those who are content with an “inerrrant” scripture, that’s fine for them except when we get to men and dinosaurs playing stick ball together they, and we, are losing the future.\nI won’t apologize for humor. A couple of people have noted: “I laugh so that I do not cry.”\n\n","date":"March 31, 2013 at 1:18 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28961","author":"John Klotz","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"Not even a thinker as deep as Pope John Paul II believed that the Shroud could offer a counter thrust.  One has to read what he said when he went to the Shroud exposition in 2000.\n\n","date":"March 31, 2013 at 1:44 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28962","author":"Louis","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"I do not concede that Pope John Paul II was a deep thinker. Yes, he was deft at PR. However, what harmed Benedict as much as anything else was the mess he made cleaning-up after JP IIs horrendous indifference to the pedophile scandal – and he was indifferent. Then there is the whole Legionnaire  of Christ problem. There are many good hearted and faithful Legionnaires. Their founder was a scumbag. That may be strong language, but where I come from its an accurate description of a priest who seduced seminarians at the same time he had female concubines and fathered illegitimate children. Benedict (then Cardinal Ratzinger) strove mightily to save JP II from the Legionnaire scandal.\nSpare me praise for John Paul ii. I’ll skip his canonization.\n\n","date":"March 31, 2013 at 2:04 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28965","author":"John Klotz","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"That is going off the track, the discussion is about the Shroud.\n\n","date":"March 31, 2013 at 2:28 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-28967","author":"Louis","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"In my opinion John Paul II was (more or less) a philosopher and a sociologist\n(and not a textile scientist !!!).\nIn any case …\nI want to quit with the strange (and various or … several) rumors\nabout the past Popes. These stories seem to be far from the analyses\nabout the famous relic.\n— —\nSo …\nI am curious about the point (the last. The number 10 of the long list …) indicated\nby Jos :\n2009 / Materiale della Fondazione 3M del 1978-88 / Fondazione 3M / Politecnico di Milano.\nI ask your opinion because in the book (by Fanti and Gaeta), at page 208 (= Appendice. Ricostruzione del percorso dei frammenti della Sindone, by Marco Conca),\nthere is not the name of the third owner for these samples …\nor holder…\nWhat is your opinion ?\nWhich were the exact agreements ?\nWhere is the inherent document ?\nWhere is the work carried out from the Milan Polytechnic ?\nIt seems a bit strange that Fanti was able to work with Pierandrea Malfi,\nwith Pietro Baraldi (Univ. of Modena) and Anna Tinti (Univ. of Bologna) [= FTIR\nand Raman controls], with the Max Planck Institute of Potsdam,\nbut he was not able to work with the Milan Polytechnic ! …\nWhat is the explanation for that fact ?\n— —\nBy-the-way :\nDo you know the FTIR-ATR technique ?\n— —\nThe FTIR-ATR absorption spectrum is characteristic of the given sample.\nThe FTIR-ATR absorption spectrum slightly differs from that obtained\nby the transmission method.\nThe analysis involves the  intensity and frequency of absorption peaks\ncharacteristic of chemical groups …\nThe penetration depth of IR beam can be controlled within some range\nby selecting an appropriate prism (selection of refractive index) and\nthe incident angle of beam.\n— —\nAt the end I have the unsolved questions :\nWhat is the effect of the CaCO3:Iron oxides ratio [… of the coating] on linen\nfibers, in the case of CD and/or VUV treatments ?\n… And on light fastness ?\nWhere are the inherent controls using the FTIR-ATR (or other techniques) ?\n\n","date":"April 3, 2013 at 11:06 am","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-29219","author":"Piero","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"Piero, more or less a philosopher and sociologist? If the authenticity of the TS can answer all questions the Church would concentrate all its efforts on researching the relic and, perhaps, think about closing down the Pontifical Academy of Science. I cannot answer the other questions you have raised because my field is not science, but I do not question the validity of the points you have raised nor the need for answers.\n\n","date":"April 3, 2013 at 11:29 am","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-29221","author":"Louis","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"Sorry … He was a great Pope … !\nI was in a hurry !\nI beg your pardon.\n— —\nBut … you have to take into account all the concrete\nscientific problems … if you want to consider the Holy Shroud\nand the scientific research … and the last works by Fanti.\n— —\nIn my opinion Fanti (takining apart the controversies)\nwas able to open the door and then we have to improve\nthe analitical works.\nI hope you want to know something about the works by Fanti\nand so you have to buy the book because (at least)\nthere are the explanations (about the three kind of controls).\n— —\nHow to show our ability to improve the evaluations ?\nPerhaps (before to manipulate [in a bad manner ?] the\nprecious thread coming from the Holy Shroud of Turin) we\ncan try to do something using the little samples taken\nfrom the controversial Sainte Coiffe of Cahors (France).\nDo you know that presumed relic ?\nSeveral year ago (in April 2002) I bought a book :\nLe témoin secret de la Résurrection,\nby Robert Babinet (the book was published in\nOctober 2001 …).\n— —\nLe “Soudarion” or Sainte Coiffe …\nWhat is your opinion about that particular relic ?\nI hope in your interesting answer.\n— —\nRegards,\nPiero\n\n","date":"April 3, 2013 at 12:31 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-29229","author":"Piero","site":"shroudstory"},{"title":"Res ipsa loquitur:  The facts speak for themselves.","post":"Piero, There can be no doubt that another door has been opened, it is the question of peer-review and the archbishop’s comments that have also to be addressed. No, no time was devoted to Cahors, though one article by Babinet (on the TS and the Knights Templar) was read and it was good. More attention has been devoted to incorruption, where more concrete information can be available, however the study is incomplete.\nBest.\n\n","date":"April 3, 2013 at 12:54 pm","url":"https://shroudstory.com/2013/03/30/res-ipsa-loquitur-the-facts-speak-for-themselves/","cat":"carbon_14_dating","id":"comment-29231","author":"Louis","site":"shroudstory"}]
