[{"title":"Reverend Know-it-all: Do you really think Jesus rose from the dead?","post":"Just an historical note of correction.  Pete Schumacher was the Production Engineer for the VP8 Image Analyzer that he produced in 1972.  Thanks.\n\n","date":"September 1, 2010 at 12:31 am","url":"https://shroudstory.com/2010/08/10/reverend-know-it-all-do-you-really-think-jesus-rose-from-the-dead/","cat":"carbon_14_dating","id":"comment-1414","author":"Andy Weiss","site":"shroudstory"},{"title":"Reverend Know-it-all: Do you really think Jesus rose from the dead?","post":"Just want to clarify, Pete Schumacher was the Production Engineer for the VP8 that was produced in 1972, not the 1960s.\n\n","date":"November 13, 2010 at 11:42 am","url":"https://shroudstory.com/2010/08/10/reverend-know-it-all-do-you-really-think-jesus-rose-from-the-dead/","cat":"carbon_14_dating","id":"comment-1685","author":"Andy Weiss","site":"shroudstory"},{"title":"Reverend Know-it-all: Do you really think Jesus rose from the dead?","post":"I understand that there are some questions floating around in the inner sanctums of the Shroud Science Group about the existence of travertine aragonite in Jerusalem’s limestone outcroppings. I am particularly concerned by a quote from Mark Antonacci’s book, “Resurrection of the Shroud: New Scientific, Medical, and Archeological Evidence,”  that reads:\nLimestone samples taken from other tombs located at nine different test sites in Israel were also analyzed by Dr. Levi-Setti – but only the sample taken from the Jerusalem tomb matched the limestone on the Shroud.\nOne might easily wonder why. Here is some more material I extracted from the book. It is mostly material from Kohlbeck, J. & Nitowski, E., “New Evidence May Explain Image on Shroud of Turin;” Biblical Archaeology Review, Vol. 12, No. 4, July/August 1986: \nAn important indication that the events depicted on the Shroud of Turin occurred not just in Palestine, but specifically in Jerusalem, is supported by an examination of the limestone in the Ecole Biblique tomb in Jerusalem. The Ecole Biblique provided researchers with access to the same rock shelf as the Holy Sepulcher and the Garden Tomb, both of which are considered the most probable choices for the actual tomb of Christ. Tombs in the Palestine/Transjordan area were carved out of limestone, which remains wet and pliable and which rubs off easily with the slightest contact. [Nitowski, E.L., “The Field and Laboratory Report of the Environmental Study of the Shroud in Jerusalem,” Carmelite Monastery: Salt Lake City UT, 1986] Calcium carbonate is the major component of limestone. The limestone in the Jerusalem tomb was determined to be in the form of travertine aragonite, rather than the more common travertine calcite. [Kohlbeck, J. & Nitowski, E., “New Evidence May Explain Image on Shroud of Turin;” Biblical Archaeology Review, Vol. 12, No. 4, July/August 1986] \nAragonite is less common than calcite and is formed under a much narrower range of conditions. The Jerusalem sample also contained small amounts of strontium and iron. [Nitowski; Kohlbeck & Nitowski] \nA calcium sample taken from a Shroud fiber on the foot has been compared to the calcium sample from the Jerusalem tomb. The Shroud sample was found to be in the form of aragonite, not the more common calcite, and also exhibited small amounts of strontium and iron. [Kohlbeck & Nitowski]\nThis match was confirmed by Dr. Ricardo Levi-Setti [Levi-Setti, R.G., et al., “Progress in High Resolution Scanning Ion Microscopy and Secondary Ion Mass Spectrometry Imaging Microanalysis;” Scanning Electron Microscopy, Vol. 2, 1985, pp.535-552] of the Enrico Fermi Institute at the University of Chicago. Dr. Levi-Setti analyzed the calcium from both the Shroud fiber and the Jerusalem tomb with a high-resolution scanning ion microprobe. The resulting graphs show that these samples are an unusually close match, except for minute pieces of flax that could not be separated from the calcium sample taken from the Shroud fiber and that caused a slight organic variation. [Kohlbeck & Nitowski] \nLimestone samples taken from other tombs located at nine different test sites in Israel were also analyzed by Dr. Levi-Setti – but only the sample taken from the Jerusalem tomb matched the limestone on the Shroud.” \nThis matter can only be resolved by an independent verification of travertine aragonite in Jerusalem outcroppings. Perhaps the too close of a match.\n\n","date":"September 15, 2011 at 4:48 pm","url":"https://shroudstory.com/2010/08/10/reverend-know-it-all-do-you-really-think-jesus-rose-from-the-dead/","cat":"carbon_14_dating","id":"comment-3883","author":"impman","site":"shroudstory"}]
