[{"title":"Richard Dawkins on the Shroud of Turin","post":"Lawrence Gardner in his book “Bloodline Of the Holy Grail’ advises that After Jacques De Moray of the Knights Templar was nailed to the wall as in a crucifiction and when almost dead was taken down and wrapped in the “Shroud of Turin’. Later he and his asst were burned at the stake. The Vatican is well aware of this but choose to milk it.\n\n","date":"October 31, 2009 at 7:26 pm","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-838","author":"Bruce Doige","site":"shroudstory"},{"title":"Richard Dawkins on the Shroud of Turin","post":"Not only he doesn’t know theology, which is not his field: it seems he doesn’t know elementary maths too, despite his studies and the Nobel prize to come. Or is he, more simply, a liar? \nThe 1989 Nature’s “peer reviewed” (LOL!) article in which the results of the dating were published has a 31 instead of a 17.\nWell, that (intentional?) “small error” makes the magic possible and the Shroud becomes a medieval fake, even if with the lowest acceptable confidence level (as I know, even lower that the minimum acceptable, indeed).\nBe honest! Make the calculation again! Done? Got that 17? OK, put it where it should be (i.e., where those “scientists” put the 31) and, P-O-O-F!!, radiocarbon dating of the Shroud becomes worthless.\nReal scientists should be honest and surrender to evidence. Believe me, that man if everything but a scientist.\n\n","date":"November 7, 2009 at 10:03 am","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-846","author":"Gabriele67","site":"shroudstory"},{"title":"Richard Dawkins on the Shroud of Turin","post":"Hello Readers,\nThe Carbon Dating Test is very sensitive to impurities in the specimen. All the specimens were taken from one spot of the shroud. So the results should have been within experimental error. The specimens should have been taken from near the burnt part of Shroud and from the area which was never repaired. These samples will certianly give totally different results.\nGod is so forgiving.\nAyaz.\n\n","date":"January 2, 2010 at 12:59 am","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-912","author":"Ayaz Ayaz","site":"shroudstory"},{"title":"Richard Dawkins on the Shroud of Turin","post":"“Real scientists should be honest and surrender to evidence.”\nThat is what scientist do every day. Meanwhile religion can suck any wild fantasy out of it’s thumb and try to sell it a gospel truth? What on earth makes any sane person think that his kind of superstitious rubbish makes any sense at all. Please stop attacking real science and scientists until you can come up with a fantasy that makes more sense\n\n","date":"November 2, 2011 at 5:37 am","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-4512","author":"Charl","site":"shroudstory"},{"title":"Richard Dawkins on the Shroud of Turin","post":"Has Professor Dawkins reviewed any of the evidence undertaken more recently regarding the nature of the Turin shroud, the image on it and its relationship to the sudarium of Oviedo?  The “It’s from the middle ages and nobody has any documentation of it from before then” line was pretty much blown out of the water yonks ago so far as I can see.  And, actually it appears to have been the scientists who screwed up. Again.  Because they didn’t bother to check their results or primary source material? The Professor does a lot of shooting his mouth off, sorry, expresses a lot of faith in his own opinions, for somebody who doesn’t always seem up to speed or particularly interested in others’ research.  If you want to see how much scientific enquiry goes on on the dawkins.net site visit richarddawkins.net/articles/644304-turin-shroud-resurrected.  There doesn’t seem to be much science or reason there from his disciples. More like the gibberings of pre-pubescent chimps trying to establish which Colobus monkey they’d like to abuse. Visit http://www.shroud.com/  for the beginnings of a more interesting and informed – and certainly more polite study, whatever your personal take on religion or 1st century philosophers.\n\n","date":"August 22, 2012 at 10:28 am","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-15356","author":"R K Moore","site":"shroudstory"},{"title":"Richard Dawkins on the Shroud of Turin","post":"Some of the most intriguing aspects of the shroud is the historical details that were not readily known in the middle ages. The loose braided hair, the wrist as opposed to palm wounds, the roman whip marks. All these contradict what was usually depicted in the religious icons of the middle ages. My personal belief is that the original body of Jesus was taken by his followers and is now in the possession of the vatican.\n\n","date":"February 15, 2014 at 2:22 am","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-79521","author":"Sergio Lobato","site":"shroudstory"},{"title":"Richard Dawkins on the Shroud of Turin","post":"Some of the correspondents appear to out-dawkins Dawkins with their same carelessness with facts, their wild speculations, and doctrinaire scientism when out of their depth of their own particular field in whatever unspecified expertise they might be able to lay claim to.\n\n","date":"February 15, 2014 at 6:06 am","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-79547","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Richard Dawkins on the Shroud of Turin","post":"#¨6 What is meant by “original body of Jesus”? Were there copies? If the “original body” is in the Vatican, there would be no Church and also no Vatican.\n\n","date":"February 15, 2014 at 9:14 am","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-79566","author":"Louis","site":"shroudstory"},{"title":"Richard Dawkins on the Shroud of Turin","post":"Of course there are copies. Every time a priest consecrates a host it becomes the real body and blood of Jesus. Not a metaphor but true flesh and blood. Thus a copy from the original.\nAnd why shouldn’t there be a church based on the teachings of Jesus, even if the claim of resurrection was off the table. Jesus also claimed he could build back the temple in Jerusalem back in 3 days. Here we are 2000 yrs later still discussing Jesus and his teachings….\n\n","date":"February 15, 2014 at 1:28 pm","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-79608","author":"Sergio Lobato","site":"shroudstory"},{"title":"Richard Dawkins on the Shroud of Turin","post":"Read #7\n\n","date":"February 15, 2014 at 2:05 pm","url":"https://shroudstory.com/2009/10/20/richard-dawkins-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-79613","author":"Louis","site":"shroudstory"}]
