[{"title":"Ridiculous ‘Shroud is fake’ article at Suite101.com","post":"No matter if the person who writes about the Shroud is religious  or non believer , should be careful about information sources and always seek the truth.\nEverybody knows Joe Nickell is an old anti-shroud authenticity and his arguments are indeed predictable- he mixes little relevant information with misleading one and conceals important data.\nI agree totally with your rebuttal but I´d like to add some stuff\nIt´s totally false that Gospels don´t  mention a burial cloth : you just have to read Matthew , Mark and Luke , all of them mention a cloth that wrapped Christ´s body.\nIf Joe Nickell knew the meaning of « othonia » he wouldn´t take John´s gospel as an argument , and besides he ignores the existence of a  tenth century document relative to Edessa cloth which corroborates the evidences that it was indeed the Shroud folded in a way to show only the face – obviously I’m takking about « Codex Vossianus Latinus» kept in Leyden University Lybrary.\nIt´s also ludicrious to say that the image should have distortions  , who says that ignores that scientific image studies concluded that whatever made the image acted in an orthogonal way paralell to the gravity line to impress «every surface area point » on the cloth; he also ignores the amazing work of Mario Latendresse explaining why the present distorsions are meaningless.\nAnd at last , to finish my long comments just a few words about  the so called modern fake- I guess it was Nathan Wilson´s Shadow Shroud whose image is completely different from a physical and chemically aspect and although his author claimed 3D encoding , such claim was debunked by Christophe Mignot a scientist not a Shroud researcher whose expertise is 3D image analysis ( in http://www.suaire-science.com )\nI recall Dan Porter´s sentence  «Science cannot rule out a miracle but it can and does rule out fakery »  . And till now science didn´t rule out the Shroud as a fake.\n                                           greetings\n                        Maria da Glória\n\n","date":"September 11, 2008 at 9:24 pm","url":"https://shroudstory.com/2008/09/11/ridiculous-shroud-is-fake-article-at-suite101com/","cat":"carbon_14_dating","id":"comment-105","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"Ridiculous ‘Shroud is fake’ article at Suite101.com","post":"ehh. 10x.\n\n","date":"May 23, 2009 at 12:21 am","url":"https://shroudstory.com/2008/09/11/ridiculous-shroud-is-fake-article-at-suite101com/","cat":"carbon_14_dating","id":"comment-501","author":"Phejusy","site":"shroudstory"}]
