[{"title":"Sabotage?","post":"The  sample taking was done at a very specific point of time. The preparations for the sample taking started very early in the morning hours, and there has to be some explanation for this way of operating. It looks almost as if a ritual of some kind was performed, that had to be kept in accordance with the stars. Just compare the constellation of Friday 3 april 33 with the constellation at the moment of the sample taking. Of course, the null hypothesis remains, that this is just coincidence. But when further strangeness is observed, the curiousness of the timing itself should be looked at.\n\n","date":"April 29, 2014 at 5:37 am","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-105600","author":"Jos Verhulst","site":"shroudstory"},{"title":"Sabotage?","post":"Irony is aristocratic.\n\n","date":"April 29, 2014 at 9:28 am","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-105767","author":"PHPL","site":"shroudstory"},{"title":"Sabotage?","post":"Ian Wilson vehemently dismissed any possibility of mischief making in the process, particularly aiming at Brother Bruno Bonnet-Eymard and talking about the fact that the idea seemed to have gained acceptance in continental Europe, meaning France of course.\nIn his interview, Daniel Raffard de Brienne, then president of the French Shroud organisation CIELT, said that there was no possibility of control, only manipulation. This “manipulation” appears to have been what Cardinal Anastasio Ballestrero was referring to in the interview he gave shortly before his death. The conclusion is of course left to individual Shroudies, but there is a clue in the recent e-mail from Bishop Marcelo Sánchez Sorondo, of the PAS, who is highly qualified and has received a number of important international awards.\n \n\n","date":"April 29, 2014 at 11:40 am","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-105850","author":"Louis","site":"shroudstory"},{"title":"Sabotage?","post":"Thanks, Louis, an interesting article. I was able to read it by zooming to 400%.  His views do not seem all that much removed from those of Scavone which we discussed recently, and he seems to reject the Templar hypothesis outright. The chest in Besancon is an interesting aspect to it.\n\n","date":"April 29, 2014 at 4:55 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-106026","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Sabotage?","post":"Daveb, thanks for the remarks. You must have noted in the introduction that, from my point  of view, there is something in favour of the Templar hypothesis and I am waiting for more material to be able to write something more. But first the article about Jesus in biblical archaeology which should be ready and posted as a pdf this week.\nDaniel Raffard de Brienne was a descendant of Walter V de Brienne, Duke of Athens, therefore it was inevitable that he had some axe to grind in ruling out the Templars. I felt sad for him because he was unable to get anyone to search the archives in Athens. The chest in Besançon is an important link, and who knows, there could have been a de Brienne – de la Roche connection, the latter giving the TS to the Knights Templar for safekeeping in some heavily guarded, impregnable monastery-fortress due to the situation in France.\n\n","date":"April 29, 2014 at 5:46 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-106061","author":"Louis","site":"shroudstory"},{"title":"Sabotage?","post":"Louis, do you have a website where I can read your writings?\n\n","date":"April 30, 2014 at 4:50 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-107140","author":"Chesterbelloc","site":"shroudstory"},{"title":"Sabotage?","post":"Hi Chesterbell, I write on many topics, mainly developments in biblical archaeology and studies, bits of history, theology and philosophy, Turin Shroud, science-theology dialogue, parapsychology, existentialism, Freud, Jung etc. Some of the material on the TS is on the Holy Shroud Guild website and you will find it by clicking on the folder, and other articles are scattered on different websites. A big pdf review-article on Jesus in biblical archaeology should be ready and posted tomorrow, it will be  Part III of “Jesus was not buried in Talpiot”. Feel free to contact me by e-mail if you need more information.\n\n","date":"April 30, 2014 at 5:51 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-107193","author":"Louis","site":"shroudstory"},{"title":"Sabotage?","post":"Louis, we have often discussed the Talpiot tomb on this blog, and I appreciate that you have carried out much research on the matter and have had access to various informed contacts.  Nevertheless, I still remain open to the possibility that it may in fact be the Jesus family tomb. My reason for this is the statistical probability of the combination of names which I consider a strong argument in its favour, controversy re the James ossuary notwithstanding. I recall that one of the participants, I forget whether it was either James Cameron or Tabor, was quite insistent that no bones were ever found in the Jesus ossuary, except for a small carpal bone, but there were fragments of linen. \nI have just looked for a more recent update, which you may like to follow up.  It is published on a Humanist site, written by Paul Donahue, and includes comment on a 587 page work “The Tomb of Jesus and his Family?” by James H Charlesworth, which contains reports by 28 scholars.  Take away the slight anti-religious bias, and despite Charlesworth’s claim that there was a consensus that it was not the Jesus family tomb, it left Donahue with the impression that this claimed consensus was not the case. \nI have no problems with the ossuary that claims to be that of a son of Jesus, as adoption was common in those times, but it would be politically astute to claim in public that Judah was in fact a brother not a son, for his own protectiion from the authorities.  \nThe article can be found at:\nhttp://thehumanist.com/magazine/march-april-2014/arts_entertainment/the-tomb-of-jesus-and-his-family \nYou may like to follow it up before publishing your own work.\n\n","date":"April 30, 2014 at 8:12 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-107315","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Sabotage?","post":"Hi daveb, thanks for the comments. I read the review by Donahue, an industrial chemist, a long time ago. He is very badly mistaken, a typical amateur. My review of the book is being given the finishing touches now and has two versions, one with and the other without two photographs I took, just for the sake of illustration and not essential. \nAll I can say now is forget the statistics, the James ossuary, the Jesus(?) ossuary, bones and some of the rest as much serious claims have been tackled. In my view what will be needed now is more work by several serious scholars, in another book.\n\n","date":"April 30, 2014 at 8:58 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-107353","author":"Louis","site":"shroudstory"},{"title":"Sabotage?","post":"I wish you well with the work. \nThe statistics should not be dismissed too lightly.  I carried out some analysis of my own a few years ago based on frequency of names, inscribed ossuary records and other sources (Witherington stats).  Excluding the James ossuary I calculated the probability of the 7 names appearing as 1 in 11,456; if the James ossuary is included it reduces to 1 in 38,140.  At the time of the first Jewish war, Tacitus estimated the population of Jerusalem as 600,000 persons, say maybe 80,000 families, which might match Josephus’ population estimate of 80,000 if he was only counting adult males.  There may have been say only 8 families with the 7 names, or only 2 if James ossuary included. I think this significant. \nI also carried a number of Monte Carlo simulations of 1000 runs each, based on the names frequency.  Sample result, in any simulation I only obtained 2 families in 1000 with the names Jesus, Mary, Joseph and any two others qualifying   For male only names, I only obtained 1 family in 1000 with Joseph, Jesus, Judah and Matthew. All the names were fairly common, but it is specific combinations which matter.\n\n","date":"May 1, 2014 at 1:42 am","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-107577","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Sabotage?","post":"Daveb, many thanks for the encouragement. You are an experienced civil engineer, dealing with “exact sciences”, and I take your work on the statistics seriously. But let me tell you that it will not help in this case, it is not me but the experts who have demolished the results. That, obviously, is the reason why Feuerverger disappeared from the scene, he seems to have cooperated with Jacobovici to distort the results, so wait and see. The pdf should be ready today, but probably available only tomorrow.\n\n","date":"May 1, 2014 at 12:50 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-108048","author":"Louis","site":"shroudstory"},{"title":"Sabotage?","post":"Thanks for the info, Louis. I look forward to reading more.\n\n","date":"May 1, 2014 at 12:30 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-108030","author":"Chesterbelloc","site":"shroudstory"},{"title":"Sabotage?","post":"You’re welcome, Chesterbell. The quest is for the truth and the pdf should be ready today.\n\n","date":"May 1, 2014 at 12:52 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-108052","author":"Louis","site":"shroudstory"},{"title":"Sabotage?","post":"Thanks again. It’s Chesterbelloc(for Chesterton and Belloc), by the way. The font cuts off the last couple of letters.\nOn the issue of the Talpiot tomb: we all know that Christianity was obsessed with relics almost from the beginning of the Church. If there was a tomb full of relics of the bones of Christian saints, I don’t believe it would have been untouched until the 20th century. Also, there are no 1st class relics of the Blessed Virgin Mary. Catholics and Orthodox believe that is because Her body was assumed into Heaven and she was, shall we say, one of the “first fruits of those who were asleep”, in a similar manner to the dead who were raised on the first Easter, according to the Gospel of Matthew. If her burial place was known, and her bones were there, the belief in Her assumption would have never taken hold. Also, why have an ossuary for Jesus if His body was raised? Even if His ossuary is empty, it would be strange to have one for someone who was, according to early belief, raised bodily from the dead. It all doesn’t add up. I would also wonder why a family that lived in Nazareth had a burial plot so near Jerusalem. I know that these things don’t pose a problem for non Christians, and the issue of the Blessed Mother doesn’t affect all Christians. But it makes no sense to me, historically or theologically.\n\n","date":"May 1, 2014 at 2:36 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-108125","author":"Chesterbelloc","site":"shroudstory"},{"title":"Sabotage?","post":"No need to thank me for anything. All I can say now that there is a is a lot more in the box, and it has been duly addressed in what I am writing.\n\n","date":"May 1, 2014 at 2:53 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-108135","author":"Louis","site":"shroudstory"},{"title":"Sabotage?","post":"Daveb and Chesterbelloc, the review of the “Jesus family”/Talpiot Tomb  can now be read in Part III of the article “Jesus was not buried in Talpiot”:\n https://www.academia.edu/6932766/Jesus_was_not_buried_in_Talpiot_Parts_I_II_and_III\n\n","date":"May 1, 2014 at 11:18 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-108456","author":"Louis","site":"shroudstory"},{"title":"Sabotage?","post":"Daveb and Chesterbelloc, there was a small modification in one of the captions of the photographs in the review of the “Jesus Family”/Talpiot Tomb book, Part III of “Jesus was not buried in Talpiot” so the link is now:\n https://www.academia.edu/6932873/Jesus_was_not_buried_in_Talpiot_Parts_I_II_and_III\n\n","date":"May 1, 2014 at 11:43 pm","url":"https://shroudstory.com/2014/04/29/sabotage/","cat":"carbon_14_dating","id":"comment-108472","author":"Louis","site":"shroudstory"}]
