[{"title":"Savage Treatment in Randi Land","post":"Cute title.\n\n","date":"July 27, 2012 at 8:14 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","id":"comment-14260","author":"Richard Savage","site":"shroudstory"},{"title":"Savage Treatment in Randi Land","post":"“…..it is understood that 3 cm2 has been retained by Prof. Gonella, and additional unnconsumed material may still be in the hands of the three laboratories that performed the dating measurements”. \n“Draft Protocol for future examinations of the Shroud of Turin”.(3 october 1988).\nhttp://freepages.religions.rootsweb.ancestry.com/~wmeacham/sturp88.pdf\n\n","date":"July 27, 2012 at 9:35 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","id":"comment-14262","author":"corneliotel","site":"shroudstory"},{"title":"Savage Treatment in Randi Land","post":"I have been blessed to see a copy of a drawing done by Gonella himself showing that, exactly has Rogers said, he took for himself some threads right in the middle of the sample (I mean in the middle of the whole complete single sample that was originally cut) used for dating the Shroud in 1988.  Since that day, I have absolutely no doubt at all concerning the validity of Rogers sample that hallowed him to proof that the corner used for dating the Shroud was not representative of the main cloth.  Rogers was not a liar and that drawing from the hand of Gonella himself was the best proof of that.  Unfortunatelly, since the Anti-Rogers crusade rages on in the Shroud world since he died in 2005, some people have tried very hard to discredit Rogers credibility, and the validity of his C14 sample was one sorry episode with a sad purpose like that among others…  Final note :  Trust me, Rogers sample was exactly what he said it was : a sample of a few threads that were kept by Gonella in 1988 and that come right from the middle of the whole C14 sample.  These few threads (if I remember well, Rogers received 2 of them) were probably taken when the whole sample was cut in 2 pieces, one for reserve and the other for the C14 labs.  So, you can sleep well tonight, Rogers samples were totally valid to challenge the C14 result of 1988.  No matter what the Anti-Rogers clan can think or make believe, this is another perfect proof of the rigor, profesionalism and honesty of Raymond N. Rogers.  I know this because I’ve seen the drawing done by Gonella in 1988…\n\n","date":"July 27, 2012 at 10:41 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","id":"comment-14263","author":"Yannick Clément","site":"shroudstory"},{"title":"Savage Treatment in Randi Land","post":"Jabba, regarding the trace element issue,  a recent paper (1) has shown that using a set of 11 trace elements (Al, Ti, Ni, As, Rb, Y, Mo, Ag, Cd, Ba, and La) it is possible to identify the region of the world a linen comes from. The authors have achieved to distinguish linens from Poland, Italy and Japan using those 11 trace elements.\nI think it would really be helpful to carry out the same analysis on the Shroud and clearly establish whether its linen comes from the Middle East (one point for authenticity) or from let’s say France.\nA second recent paper (in this case with cotton(2)) shows that particular combinations of trace elements can allow a correct identification of the state (in USA) the cotton comes from in 81% of the cases. In this case, the authors obtain “results of very clear and distinct clusters with no overlap”. I think that this sounds promising.\nFinally, there is a third paper written in 1988 (3) . Though one of the coauthors was a STURP member, to the best of my knowledge this paper has largely gone unnoticed.\nThey suggest that the use of 18O/16O ratios of cellulose and the D/H ratios of cellulose nitrate allows the separation of most linen samples from Europe from those originating in the Middle East when D. The authors say that it may be possible to use the isotope ratios of cellulose prepared from the Shroud of Turin to resolve the controversy concerning its geographic origin.\nI think that these papers show a promising path and in my view, the C14 path –recurrent requests for new tests- should definitively be left behind.\n(1)Takako Inoue, Kengo Ishihara and Kyoden Yasumoto.International Journal of Clothing Science and Technology Vol. 22 No. 2/3, 2010 pp. 174-186\n(2) Emily R. Schenk and Jose R. Almirall. Elemental analysis of cotton by laser-induced breakdown spectroscopy. May 2010 / Vol. 49, No. 13 / APPLIED OPTICS\n(3) DeNiro-M.J., Stenberg, L.D.,Marino,B.D.;Druzik-J.R. Relation between D/H ratios and18O/16O ratios in cellulose from linen and maize. Implications for paleoclimatology and sindonology Geochimica et Cosmochimia Acta, 52, 2189-2196,.1988\n\n","date":"July 27, 2012 at 2:22 pm","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","id":"comment-14266","author":"Gabriel","site":"shroudstory"},{"title":"Savage Treatment in Randi Land","post":"– I appreciate your responses (very interesting information) and will salt them away for future use, but it’s starting to look like we don’t have a good answer to the apparent similarity of trace elements between the Raes sample and the rest of the cloth — which seems like strong evidence against the invisible re-weave hypothesis.\n– Any suggestions?\n— Rich\n\n","date":"July 28, 2012 at 11:29 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","id":"comment-14277","author":"Richard Savage","site":"shroudstory"},{"title":"Savage Treatment in Randi Land","post":"So it’s “Savage Treatment ” to expect Rick/Jabba to actually support his assertions with facts and evidence? Wow.\nLook we understand that some people *need* the shroud to be real to shore up their weak faith but that doesn’t actually *make* it real. The evidence for the shroud being a medieval fake is far too strong and homogeneous to be doubted by a few scraps of dubious pseudo-science.\nAnd why continue the debate here? Why not come over to the JREF and deal with the science?\nwell actually we know why, the need to control the debate.\n\n","date":"September 23, 2012 at 9:57 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","id":"comment-16799","author":"Passing Stranger","site":"shroudstory"},{"title":"Savage Treatment in Randi Land","post":"Just a voice of reason, pointing out that Rich’s characterization of one “friendly and rational” person out of “60 opponents” blithely, but typically, ignores the fact that a broad community of rational scholars and enthusiasts has been asking “Jabba” to provide _evidence_ against the Carbon-14 dating in a thread spanning 89 pages and 3500 posts.  To date, the strongest “evidence” Rich has presented is that he “disagrees” with the experts (with no evidence).  The posters asking, repeatedly, for Rich to present his arguments, rather than, for instance, proposing odd limitations on the discussion, or stooping to unsupported libel against professional with whose conclusions he disagrees, have been more than patient, for JREF.  Rich’s problems have been of his own manufacture–he could easily defuse the entire situation my merely answering the questions put to him, straightforwardly and honestly, with no dodges about “not remembering” what has been said in previous posts.\n\n","date":"October 13, 2012 at 1:24 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","id":"comment-17577","author":"J Fred Slowvehicle Hintze","site":"shroudstory"},{"title":"Savage Treatment in Randi Land","post":"I won’t comment on Rich’s inabilities to answer your questions, but I will comment on the lack by anyone of the “rational scholars and enthusiasts” you mention to do their own ‘research’ on the matter… Why depend on poor Rich! These wnthusiasts cannot read for themselfs? For most on that site, i have noticed, have this type of understanding; quote; “The evidence for the shroud being a medieval fake is far too strong and homogeneous to be doubted by a few scraps of dubious pseudo-science.” unquote. If that is not the most rediculously stupid comment I have ever heard, I don’t know what is, and goes to show the actual lack of intelligence offered by anyone there. It is useless even trying to discuss any logic with these Neanderthals, yet Richard cannot see this and is just wasting precious time on the effort, as I have just done here responding to just another Neanderthal.\nR\n\n","date":"October 13, 2012 at 6:10 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","id":"comment-17583","author":"Ron","site":"shroudstory"},{"title":"Savage Treatment in Randi Land","post":"The limitations of the C14 dating are its sampling protocol and the absence of chemical/physical characterisation of the sample. These are facts.\nOn which data can we rely to invalidate/validate the dating ?\n– raw figures of the dating\n– characterisation of the reserve sample\n\n","date":"October 13, 2012 at 5:42 am","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","id":"comment-17582","author":"anoxie","site":"shroudstory"},{"title":"Savage Treatment in Randi Land","post":"\nRon :\nI won’t comment on Rich’s inabilities to answer your questions, but I will comment on the lack by anyone of the “rational scholars and enthusiasts” you mention to do their own ‘research’ on the matter… Why depend on poor Rich! These wnthusiasts cannot read for themselfs? For most on that site, i have noticed, have this type of understanding; quote; “The evidence for the shroud being a medieval fake is far too strong and homogeneous to be doubted by a few scraps of dubious pseudo-science.” unquote. If that is not the most rediculously stupid comment I have ever heard, I don’t know what is, and goes to show the actual lack of intelligence offered by anyone there. It is useless even trying to discuss any logic with these Neanderthals, yet Richard cannot see this and is just wasting precious time on the effort, as I have just done here responding to just another Neanderthal.\nR\n\nThank you for your “kind and rational” post.  Truly, the forces of good are blessed to have you wielding the banner of .Truth™, and across such thin ice…\nWhat explanations do you offer for the homogeneity of the carbon dates?  For the lack of witness to any “patch” by any researcher or expert who has actually, and demonstrably, handled the cloth?  For the lack of any suggestion of a way in which the tested area might have been patched, not just in such a way as to fool a host of scholars, but in such a way that mixing of extraneous material would produce three concordant dates in three different labs?\nDo keep in mind that “I want it to be so” is not an explanation…\nI do not “depend on” Jabba for my research–but as with all such things, it is the burden of the claimant to support his claims.\nThe cloth is a medieval artifact.  To overcome that evidence, evidence is needed…not supposition, not remote chance, not third-hand character assassination–evidence.\n\n","date":"October 19, 2012 at 12:22 pm","url":"https://shroudstory.com/2012/07/27/savage-treatment-in-randi-land/","cat":"carbon_14_dating","id":"comment-17873","author":"slowvehicle","site":"shroudstory"}]
