[{"title":"\nShroud Dating May Have Been Inaccurate - Radiocarbon Expert\n","post":"\n\nSunday, March 23, 2008Shroud of TurinCurrent controversy about the shroud of TurinIn relation to the current debate regarding the accuracy of the carbon dating, following which the Vatican announced the shroud to be a 14 century forgery, it is important to know that the carbon dating was correct but carried out on samples which were not from the original cloth. The church had absolutely no interest in providing a genuine sample of the shroud because it would show that the person, (presumably Jesus) who had been wrapped in it, was not dead but had survived the crucifixion. The amount of blood shown on the cloth could not have been from a person who had been dead for three hours, particularely taking into account that it was customary that the upper part of the body was elevated when entombed. Hence it would appear that the cloth provided by the church for carbon dating was an almost identically looking cloth dating from the 14th century.Earlier pollen tests carried out on the shroud had shown it to have originated from the area of Jerusalem from the first century.Erwin\n\n","author":"schweizer","date":"March 24, 2008 at 6:07 PM","url":"http://theshroudofturin.blogspot.com/2008/02/shroud-dating-may-have-been-inaccurate.html","site":"moore"},{"title":"\nShroud Dating May Have Been Inaccurate - Radiocarbon Expert\n","post":"\n\nErwin>Current controversy about the shroud of TurinThanks for your comment.>In relation to the current debate regarding the accuracy of the carbon dating, following which the Vatican announced the shroud to be a 14 century forgery,I am a Protestant, so I have no brief to defend the RC Church. But the fact is that Vatican never \"announced the shroud to be a 14 century forgery.\" As I pointed out in a recent post, \"Shroud of Turin may not be a fake after all! \", that was the invention of the British media.>it is important to know that the carbon dating was correct but carried out on samples which were not from the original cloth. If this is claiming that \"the carbon dating was correct\" then I don't necessarily agree that it was. It is very difficult to radiocarbon-date old linen, especially when it has wrapped a body, due to flax fibres being highly porous and comprised of microfibrils arranged in a rope-like spiral, giving it an enormous surface area that can absorb and retain younger carbon and then resist it being removed.As for \"carried out on samples which were not from the original cloth,\" this could be either from a fraudulent switch of a 14th century linen sample for the Shroud; or from the sample being from a re-woven patch of the Shroud. There is some evidence for both theories, but I am not yet convinced of either one.>The church had absolutely no interest in providing a genuine sample of the shroud because it would show that the person, (presumably Jesus) who had been wrapped in it, was not dead but had survived the crucifixion. This Kersten & Gruber (and others') conspiracy theory is implausible on at least two grounds: 1) the overwhelming preponderance of the evidence is that Jesus was dead (see below); 2) if the RC Church really thought that the Shroud showed that Jesus survived the crucifixion and wanted to cover it up, it has had plenty of opportunities to destroy the Shroud (including two fires, one as late as 1997) and also to distance itself from the Shroud's authenticity. But instead the RCC has gone to immense lengths to preserve the Shroud, and despite all the claims that the Shroud is a fake, the RCC has never agreed with those claims (despite media hype to the contrary). Moreover, even after the 1989 carbon-dating result, the RCC has continued to exhibit the Shroud in 1998 and 2000 as though it was the genuine article, with Popes John Paul II and Benedict XVI publicly stating their personal belief in its authenticity.It is in fact the \"Jesus ... was not dead but had survived the crucifixion\" theories that are themselves dead! Among the best evidence that Jesus did die on the Cross was provided by New York State medical examiner Dr. Frank Zugibe, who pointed out that \"If Jesus had been alive after the spear wound, the soldiers and others at the site would have heard a loud sucking sound caused by breath being inhaled past the chest wound\" (a fact no doubt well-known to the Romans soldiers, which is presumably why they did it):\"There are at least three signs on the Shroud that Jesus was dead when He was buried. First, the body of the man in the Shroud is in a state of rigor mortis, in which the muscles stiffen, keeping the body in the position the person occupied just prior to death. Such a state is complete in about twelve hours after death, begins to wear off in twenty-four hours, and disappears in thirty-six to forty hours. Of course, these times are variable and imprecise, and therefore somewhat unreliable. Closely related to rigor mortis is a state called cadaveric spasm, an immediate stiffening, a rather sudden contraction of the muscles that occurs quickly after some violent deaths. Rigor mortis is observable on the Shroud in several places. The head was bent forward, the feet were somewhat drawn up, and the left leg in particular had moved back toward its position on the cross. Especially visible in the three-dimensional image analysis of the Shroud are the retracted thumbs and the `frozen' posture of the chest and abdomen. As was also noted by Bucklin, the entire body was quite rigid and stiff, occupying some of the positions it did on the cross. The second evidence of death in the man of the Shroud is the post-mortem blood flow, especially from the chest wound. If the heart had been beating after burial, the blood literally would have been shot out onto the cloth. But the blood oozed out instead. Also, a comparatively small quantity of blood flowed, and there was no swelling around the wound. Finally, the blood from the chest, left wrist, and feet separated into clots and serum and was much thicker and of much deeper color than it would have been prior to death. Zugibe also mentioned a third piece of evidence based on his medical experience. If Jesus had been alive after the spear wound, the soldiers and others at the site would have heard a loud sucking sound caused by breath being inhaled past the chest wound. Zugibe related that when answering a distress call after a man had been stabbed in the chest, he heard the loud inhaling of the unconscious man all the way across the room. He saw this phenomenon as `a direct refutation of the theory that Christ was alive after being taken down from the cross.\" [Zugibe, F.T., \"The Cross and the Shroud,\" Angelus Books: New York NY, 1982, p.165]\" (Stevenson, K.E. & Habermas, G.R., \"The Shroud and the Controversy,\" Thomas Nelson Publishers: Nashville TN, 1990, p.113. Emphasis original)>The amount of blood shown on the cloth could not have been from a person who had been dead for three hours, particularely taking into account that it was customary that the upper part of the body was elevated when entombed. There in fact is not all that much blood on the Shroud (see above, \"a comparatively small quantity of blood flowed\"). And despite claims to the contrary, dead bodies can still bleed by oozing, even days after death, as the floor of any butcher shop will show.>Hence it would appear that the cloth provided by the church for carbon dating was an almost identically looking cloth dating from the 14th century.The RC Church did not provide the cloth, except by making the entire Shroud available for cutting off the sample. And the sample was cut off, not by a RC priest but by a scientist, the late Prof. Giovanni Riggi, in a videotaped ceremony which was attended by, amongst others, the British Museum's representaive and the chiefs of the three radiocarbon-dating laboratories.As I said above, it is possible there was a sample switch later (although I think it unlikely), but then it would have been done after the Shroud sample had been cut off, and was therefore no longer under the control of the RC Church.>Earlier pollen tests carried out on the shroud had shown it to have originated from the area of Jerusalem from the first century.Agreed, but that was from the same Shroud that the RC Church provided for the sample to be cut from. This also undercuts the RC Church \"had absolutely no interest in providing a genuine sample of the shroud\" theory, because: 1) the pollen samples were taken by  foresic scientist Max Frei at scientific examinations of the Shroud in 1973 and 1978. If the RCC thought the Shroud showed that Jesus survived the crucifixion, it would never have allowed those scientific tests, let alone allowed Frei, a Protestant, to take pollen samples from it.But no doubt this will make no difference to conspiracy theorists like yourself, to whom evidence against the conspiracy just shows how devious the RC Church was in making it look like there wasn't a conspiracy!Stephen E. Jones\n\n","author":"Stephen E. Jones","date":"March 25, 2008 at 12:07 PM","url":"http://theshroudofturin.blogspot.com/2008/02/shroud-dating-may-have-been-inaccurate.html","site":"moore"}]
