[{"title":"Shroud of Turin Opinion","post":"I am a Christian not a Catholic, but I still don’t believe this is the image of Jesus, simply because Jesus was not European.  The catholic church has this image of a blue eye blond hair Jesus, what man born in Bethelehem do you know that is blond hair blue eyed?  I think the roman church and its desire to have all things revolve around rome most likely created this image when catholicism became the official roman religion, when Theodosis the 1st made it a requirement for all roman citizens to be Christian, thats when Christianity became a religion and not a relationship with Christ.\nthis man is a very distict European man, not an Arabic Jew like Jesus was.\n\n","date":"April 6, 2009 at 2:34 pm","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","id":"comment-365","author":"mp","site":"shroudstory"},{"title":"Shroud of Turin Opinion","post":"I was wondering if you by any chance recorded the Disocvery Channel documentary: “Unwrapping the Shroud: New Evidence”\nIf not do you by any chance know where i can download this?\n\n","date":"April 8, 2009 at 9:14 am","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","id":"comment-369","author":"Tap","site":"shroudstory"},{"title":"Shroud of Turin Opinion","post":"I guess Mita Jain´s post is quite interesting nonetheless I don´t agree with several assertions. She doesn´t care wether the Shroud is authentic or a forgery for her the only thing that matters is that the Shroud is allegedly a symbol of peace and believing it is Christ´s burial cloth is not harmful. For a christian the central question of his faith is Christ´s resurection and that event is the main tenet of christian religion. The apostle St. Paul wrote that if Christ did not rise from the dead then our faith is vain and our preaching is vain.\nThe Shroud of Turin bears an image that has not yet been explained by scientific studies and probably will never be.\nMay be in a near future scientific studies will conclude that what caused the chemical changes responsible for coloring the uppermost fibers of Shroud´s threads was an electomagnetic energy with such a wavelength but that is as far as science can reach\nAs Mita Jain focussed 1988 radiocarbon dating was flawed and can no longer be a skeptic claim against Shroud´s authenticity.\nAs a longtime Shroud researcher with all knowledge I gathered from historical and scientific studies the SHROUD TURNS OUT AS AUTHENTIC and for me it does really matter if it is genuine.\nScience obviously cannot prove or disprove Christ´s resurection and also cannot prove that the image depicted on the Shroud belongs to Jesus Christ.\nBut the only logical conclusion we can infer is that it is an unexplained image of Jesus crucified naked body on a linen cloth and the result of a miracle and from a theological point of view that miracle was Christ´s Resurection.\nThat´s why I care if the Shroud is genuine it is a material legacy of Jesus Christ to mankind.\nLet´s think about this\n               best regards\n           Maria da Glória\n   CENTRO PORTUGÊS DE SINDONOLOGIA\n\n","date":"May 4, 2009 at 9:31 pm","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","id":"comment-443","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"Shroud of Turin Opinion","post":"“I believe that it doesn’t matter whether the shroud is actual or not. Even if it’s not real, if it can bring some kindness and peace to today’s human race, then there is no harm believing in it.”\nThat is nonesense. Truth matters, and faith in something that is not true is an abomination. \nThe image shure looks like a photograhic negative, and the claim that it was made using some kind of photographic process cannot be so easily be dismissed in light of the fact that it has been proven that such an image can indeed be produced using such a process. If the cloth had been wrapped around a face of a person, the image when the cloth is laid flat, would have been widened and not have the proper proportions.\n\n","date":"May 18, 2009 at 6:39 am","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","id":"comment-490","author":"CaptainVideo","site":"shroudstory"},{"title":"Shroud of Turin Opinion","post":"None of this should be viewed as a denial of the doctrine of the resurrecton, which I accept, but the shroud must be treated with objectivity and a healty dose of scepticism.\n\n","date":"May 18, 2009 at 6:45 am","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","id":"comment-491","author":"CaptainVideo","site":"shroudstory"},{"title":"Shroud of Turin Opinion","post":"I have found many links to information regarding the shroud, but I could not find one for my question. The Gospel of John states the following:\n20:4 So they ran both together: and the other disciple did outrun Peter, and came first to the sepulchre.\n20:5 And he stooping down, and looking in, saw the linen clothes lying; yet went he not in.\n20:6 Then cometh Simon Peter following him, and went into the sepulchre, and seeth the linen clothes lie,\n20:7 And the napkin, that was about his head, not lying with the linen clothes, but wrapped together in a place by itself.\n20:8 Then went in also that other disciple, which came first to the sepulchre, and he saw, and believed.\nObviously John describes the linen clothes in more detail than the other Gospel writers, however, this would seem to denote that the piece of cloth wrapped around the head was completely seperate from the other burial clothes.  Can someone please help me with this? Any thoughts? (Feel free to comment here, I will check back, or email semanticconduit@gmail.com) Thank you.\n\n","date":"June 5, 2009 at 12:59 am","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","id":"comment-544","author":"Sèamus O'Keeffe","site":"shroudstory"},{"title":"Shroud of Turin Opinion","post":"there is proof that the Shroud of Turin is real, it is encoded in 3d material and when you take a holographic image of the shroud and place it on a printer, it will print a photograph of our Lord….you can buy a used holographic image on ebay or else if you email me , I will send you the picture, free of course…seeing is believing…God bless you\n\n","date":"June 8, 2009 at 8:24 am","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","id":"comment-558","author":"Jan","site":"shroudstory"},{"title":"Shroud of Turin Opinion","post":"Hi Maria,\nIt was just my personal opinion that I value peace so much.\nNevertheless, I do respect views and faith of Christians, believers and researchers like you and others.\n\n","date":"June 19, 2009 at 7:55 pm","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","id":"comment-595","author":"Mita Jain","site":"shroudstory"},{"title":"Shroud of Turin Opinion","post":"http://www.reuters.com/article/scienceNews/idUSTRE5943HL20091005\nApparently an Italian scientist has managed to find a method to reproduce the Shroud image, using only materials and methods available in the middle ages.\n\n","date":"October 6, 2009 at 4:15 pm","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","id":"comment-798","author":"Felix","site":"shroudstory"},{"title":"Shroud of Turin Opinion","post":"If the shroud of Turin were authentic, a reference to it would have been recorded in the Bible. No such reference to it (or the Holy Grail or other such objects that cropped up later when the church rejected to the apostolic faith in favor of myths and old wives’ fables, and syncretism) exists, and furthermore the existence, preservation and veneration of such objects (idols) oppose the goals of actual Biblical Christianity, which is concerned with the worship, reverence and veneration of the living God who is incorruptible Spirit, not of dead idols made by corrupt human hands out of corruptible sinful materials. \nThe Shroud of Turin cannot be a witness to the resurrection of Jesus Christ. The natural world only brings general revelation which cannot save, not special revelation which can and does save. So, the only witness to the resurrection of Jesus Christ is human witness, both spoken by humans who believe the testimony of those who did see, and who live this testimony through faith as evidenced by the good works of the priesthood of believers. So, instead of promoting and defending the gospel as revealed in scripture, we defend a cloth that scripture attaches no spiritual significance to whatsoever, and in doing so we turn our eyes from the Creator to the created and thus violate Romans 1. \nI hope and pray that all would use this episode with the shroud of Turin to reject idolatry, reject myth, and see the merits of sola scriptura, solo Christo, sola gratia, sola fide and soli Deo gloria! See\nhttp://www.fivesolas.com/\n\n","date":"October 7, 2009 at 5:03 pm","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","id":"comment-799","author":"Job","site":"shroudstory"},{"title":"Shroud of Turin Opinion","post":"oh yes there is a reference to it in the Holy Bible: Luke 24:12,John 20:5,6,7 and see the clearest image of the Face on the Shroud at: http://holyfaceofjesus.wordpress.com\n\n","date":"January 14, 2011 at 8:55 am","url":"https://shroudstory.com/2009/03/12/shroud-of-turin-opinion/","cat":"carbon_14_dating","id":"comment-2210","author":"holyfaceofjesus","site":"shroudstory"}]
