[{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Max I consider this an amazing find, my congratulations. All the more opportune for me as I’m currently working on a PPT presentation for one of my local groups for next year, and am just about to start on the scourging slides. \nI don’t quite follow your referring to “both men”? In the two graphics with your article, the second graphic seems to be a cropped version of the first, except only for the epsilon next to the post. Are they in fact two different graphics in the Psalter? I followed the link provided, dropped on to the Psalter, and was able to scan through several pages, but it’s obviously quite a largish volume. I got the impression that the art work, showing various personages, was fairly consistent and uniform throughout, with only minor variations to features, general fashion and other signia.\n\n","date":"October 20, 2013 at 4:35 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48081","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Thank you, Dave.\n\n","date":"October 20, 2013 at 8:46 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48101","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"interesting, but a long bow to directly connect this to the shroud.\n\n","date":"October 20, 2013 at 6:17 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48084","author":"Matthias","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"I hadn’t come across the Stuttgart Psalter either, and it’s a fascinating book. There’s not enough in the picture above to make me think it’s evidence that the painter knew the shroud, and as usual context is all. Taking Max’s list (incidentally, daveb, I think “both” refers to the psalter and the shroud, not to two images in the psalter):\n– “Both men are stark naked with long flow of hair in the back. Part of the hair tied up like a\npigtail at the back of the head can be made out.” A quick browse through the psalter shows that this illustrator is not at all afraid of nakedness; there are naked bodies throughout, from various angles and in various details. I do not detect a pigtail. Actually I think Max misses a trick here; what is unusual is not that Christ is naked, but that he has his back turned.\n– “Both have arm(s) bound/crossed in front. Had both no scourge marks on the inner side\narms? This cannot be checked today any longer.” Scourgings are usually shown with the hands tied in front. Other configurations are not unusual, but the comparison here is rather weak evidence.\n– “Both have bloodied furrows/scourged marks in conjunction with two whips with lashes each fitted with doubled (metal) pellets implying two executioners.” The two executioners are not merely implied, they are illustrated. However this configuration (Christ between two men) is hardly artistically improbable, and again, I don’t find it evidence. The two whips do have three thongs each, but they are tipped with one pellet each, not two. There is no depiction of crossed wounds (from both sides) on the body.\n– “Both have almost feminine curved left hip & thigh (to be called later “the Byzantine curve”)” This is wholly subjective, and I disagree with it.\n – “Both are/were tied at tibiofibural level with left leg in front of right leg (TS man accurate\nForensic description: left leg in front of right leg with rope-mark in the tibiofibular fleshes).” There is no evidence at all of a rope injury on the calves of the shroud image. On the shroud image the left leg is not in front of the right leg, the left foot is on top of the right foot, almost 90 degrees from the position of the left foot shown on the psalter.\n– “Both show a most unnatural/awkward feet position.” The psalter is as good as the artist could manage at the time (drawing feet from the back was particularly difficult). The shroud might seem to need the feet to be tied together to stop them falling away from each other, but it is easy to adopt its pose.\n– “And last but not least, by means of a very curious tailed-Epsilon hand sign each time, the\nexecutioner on the left seem to point with his left hand index finger to his own head while the executioner on the right does point to Christ’s head with his left hand index finger too. Both left hand signs cryptically echoe the tailed-Epsilon-shaped like small blood rivulet we can observe on TS man’s forehead, just above his left eyebrow.” The fingers of the characters throughout this and many other early psalters are indeed very interesting. In many cases they are drawn quite sensibly, and without distortion, but in many others they exhibit the long, almost snaky appearance we see on this picture. They occur throughout the psalter and are not connected with this one image, let alone the epsilon bloodmark. The index finger is unnaturally long, the little finger has an absurd downward curve, and there are often only four fingers on each hand.\n\n","date":"October 20, 2013 at 6:36 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48085","author":"Hugh Farey","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"End not missing: \n• Finally it is important to note that at the time the anatomical-pathological studies were made, Barbet, Bucklin, Cameron, Zugibe etc  were not at all aware of the Stuggart Psalter miniature.\nMatthias, you wrote: “[It is ]a long bow to DIRECTLY CONNECT (upper cases mine) this to the shroud.” \nCould you account for the miniaturist “pre-forensic knowledge” of the TS image as eraly as the early 9th c. CE? Do you really think the intriguing tailed-Epsilon-shaped like hand sign is just coincidal? There are no less than FOURTEEN points of congruency… To me it amounts to a fingerprint identification.\n\n","date":"October 20, 2013 at 7:01 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48086","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Question ONE for Hugh, you wrote: “what is unusual is not that Christ is naked, but that he has his back turned.”  \nAbsent the Baptism of Christ iconography, if the depiction of a stark naked Christ is not UNUSUAL, could you provide me with miniatures, pictures depicting Yeshua STARK naked prior to the 10th c; CE, PLEASE?\n\n","date":"October 20, 2013 at 7:10 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48087","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Barbet, who was extremely familiar with the Greek and Roman classics concerning these matters, describes the usual process of scourging, the condemned facing the post that he was bound to (as shown above), but usually with his arms bound to a support above his head. Hence it is asserted that there are no scourge marks on the arms. I imagine that if the victim fainted during the scourging, then he was still held vertical so this wouldn’t be a problem during the business.  This may mean that the Psalter artist’s depiction with the hands bound as in the Shroud position could be significant. I’m curious about the epsilon by the post shown in the second graphic above. Is that on the original, or has it been inserted as a pointer? \nHugh mentions that four fingers on each hand are common in this psalter.  Zugibe considers that the four fingers shown on the Shroud are not due to Barbet’s assertion of thumb reflex retraction, but that this is the natural appearance of a relaxed hand from this view-point. Barbet experimenting with various amputations, did obtain thumb reflex actions, whether he was correct or not about the median nerve or Desot’s space.\n\n","date":"October 20, 2013 at 7:16 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48088","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Question TWO for Hugh,  you wrote: “I do not detect a pigtail.”\nActually, under magnifying glasses, right in the middle of the flow of hair at the back, a slightly darker longer stand of hair can be made out from the original miniature or a high definition photograph.\n\n","date":"October 20, 2013 at 7:20 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48089","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"You also wrote: “The two whips do have three thongs each, but they are tipped with one pellet each, not two. ” \nHave you really good eyes to see? Next time use a top magnifying glass and study the TWO whips from both high definition photograhs + the original miniature (since the two-pelleted end-lashes of he second whip appeared here masked).\n\n","date":"October 20, 2013 at 7:36 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48091","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Dave you wrote, “I’m curious about the epsilon by the post shown in the second graphic above. Is that on the original, or has it been inserted as a pointer?”\nThe TS Epislon has been inserted as a pointer in conjunction with the intriguing tailed-Epsilon-shaped like hand signs. In medieval miniatures, specific hand signs are REALLY/CRYPTOLOGICALLY/SYMBOLOGICALLY significant.\n\n","date":"October 20, 2013 at 7:26 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48090","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Question THREE, you wrote (about the pre-Byzantine curve) “This is wholly subjective, and I disagree with it.” \nOn the TS the left thigh image is LARGER than expected. This is a sindonographic FACT. Are you unable to discriminate between pre-Byzantine or Byzantine interpretation of the fact and the sindonographic fact itself?.\n\n","date":"October 20, 2013 at 7:43 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48092","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"“Larger” image of left thigh shall be understood here as slightly more panoramic thigh image.\n\n","date":"October 20, 2013 at 8:15 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48097","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"QUESTION FOUR, you wrote: “There is no evidence at all of a rope injury on the calves of the shroud image. On the shroud image the left leg is not in front of the right leg, the left foot is on top of the right foot, almost 90 degrees from the position of the left foot shown on the psalter.”\nMethinks you have not a very accurate forensic descriptive knowledge of the TS image. THERE IS EVIDENCE of a rope marking inTHE FONT FIBULAR REGION. THE LEFT FOOT IS IN FRONT OF THE RIGHT FOOT WHICH MEANS THE LEFT LEG IS IN FRONT OF THE RIGHT LEG.\nIn the miniature the almost 90 degrees from the position of the left foot is an artistic rendering/interpretation of the feet blood decals, which will result later in a lame Christ iconography.  The miniaturist was not a medical examiner and do seem to have had a hard time interpreting the feet blood decals on the Shroud now kept in Turin yet he managed to reach a rather tale-telling solution.\n\n","date":"October 20, 2013 at 8:03 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48094","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Question FIVE, Hugh, you wrote “it is easy to adopt its pose”. \nThis doesn’t mean it is a NATURAL one. Can you discriminate between natural and unatural pose as far as legs and feet are concerned? I very much doubt it.\n\n","date":"October 20, 2013 at 8:10 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48096","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Question six, Hugh you wrote: “[ long, almost snaky appearance of finger]  occur throughout the psalter and are not connected with this one image, let alone the epsilon bloodmark. ”\nCan you show me the same intriguing tailed-Epislon-shaped like hand sign in conjunction with a depiction of Christ/Christ head? How many can you detect in the whole psalter?\n\n","date":"October 20, 2013 at 8:21 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48098","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Correction: Can you show me the same intriguing tailed-Epislon-shaped like hand sign in conjunction with a depiction of Christ/Christ head/SHROUD-LIKE DORSAL IMAGE? How many can you detect in the whole psalter?\n\n","date":"October 20, 2013 at 9:14 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48105","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"NO QUESTION what really may be not that obvious to the layman’s eyes (Hugh’s) can just stare in the face of an old (yet not so old) Archaeological Image Cryptanalyst…\n\n","date":"October 20, 2013 at 8:29 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48100","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"I am not an art expert, just an observer who ha some questions, which I think are on point. I will give my inexpert answers and hopefully maybe someone with specific expertise can correct me,\n1. What is an artistic convention?\nI believe an artistic convention is that something is portrayed in a similar way across a series of works so that eventually with a specific class or culture, it is portrayed in the same way.\nFor example during the medieval ages, the crucified Christ was pictured with the nails driven through his hands and with a crown of thorns being a simple wreath.\nThose of course are not the conclusions drawn by most when analyzing the Shroud of Turin.\n2. Doesn’t a convention have to start some where with a singular representation, or does it simply blossom all at once in many different places with no single origin?\nI would suggest that a convention begins with a single model or inspiration that is then copied and spread.\n3. Do disparate conventions have  disparate origins?\nFor example, The Shroud of Turin shows no whip wounds on the chest.(Flogging with a whip on the chest would hasten death and possibly deny the executioners their crucifixion) Yet crucifixion renditions show flogging or lashes wounds on the chest. Am I correct that the Shroud does not?\n4. Would it be fair to expect that oldest representation of any particular convention would be the first?\n5. If all but one representation of a convention are paintings or works of art, and one isn’t and apparently predates the paintings or other works of art, is fair to say that the non-painting probably is the source of the convention?\n6. Am I being too obvious?\nWell, maybe so, but the origins of conventions that mimic the Shroud of Turin is, as many have already pointed out  (Vignon and Wilson among others) that supports an early date for the Shroud,\n\n","date":"October 20, 2013 at 9:06 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48103","author":"John Klotz","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Now couple the Stuggart Psalter stark naked Christ back view and the Pray Hungarian MS stak naked front view, then you’ve got a fairly accurate medieval record of the TS man.\n\n","date":"October 20, 2013 at 9:20 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48106","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Yes, it is intrigueing, but what about other miniatures in this mansucripts? There are several crucifixion representations in  Stuggart Psalter, and they are quite conventional, with little direct cnnection to the TS.\n\n","date":"October 20, 2013 at 9:23 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48107","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"O.K. you wrote: “There are several crucifixion representations in Stuggart Psalter, and they are quite conventional,” WRONG, they are typically Benedictine or Benedictine inspired artwork (see e.g. the San Damiano Cross)..Besides many scenes are missing in the psalter (Anointing/Burial of Christ, Visitatio at the Empty Tomb etc). Most of the Christ faces look almost coptic.\n\n","date":"October 20, 2013 at 9:33 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48110","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Both the Stuggart Psalter and Pray Hungarian  MS miniatures depicting a stark naked Christ are extrinsic proofs the TS radiocarbon carbon dating was skewed, no question.\n\n","date":"October 20, 2013 at 9:25 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48108","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Max, this is a very intriguing article and obviously you have put much time and work into it. Hugh’s comments are also fair observations and he made them objectively and respectfully. However your rebuttals to him – which should stand on their own – are filled with patronizing asides that really detract from your presentation.\n\n","date":"October 20, 2013 at 9:26 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48109","author":"David Goulet","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Actually, I did not put that much work and time in it…\n\n","date":"October 20, 2013 at 9:43 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48112","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"It is just a FLASH illustrative reply to Hugh’s comment on October 8, 2013 at 1:10 pm | #50 Reply |:\n“The Stuttgart Psalter is wonderful and I’m so glad Max mentioned it. It does indeed have a picture of a naked Christ being flogged. It seems to be dated about 825, which is probably early for such a thing. Has it anything to do with the Shroud? Not obviously.”\n\n","date":"October 20, 2013 at 9:48 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48114","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Critics for the sake of criticizing is one thing (destructive critics). Well-thought, accurate and scholarly critics quite another.\n\n","date":"October 20, 2013 at 9:56 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48116","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"David, how do you mean “observations [.. ]made OBJECTIVELY [upper cases mine]? Most of them were just biased!\n\n","date":"October 20, 2013 at 9:52 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48115","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Hugh’s alleged “rebuttals”  were filled with patronizing INsides… and his comments were forensically and iconographically biased. I can take critics if and only if they are well-thought and accurate.\n\n","date":"October 20, 2013 at 9:40 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48111","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"…and scholarly. Period.\n\n","date":"October 20, 2013 at 9:58 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48117","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Actually, I just would dream/love GENUINE Art Historians could made observations on the miniatures and/or my cryptanalysis…\n\n","date":"October 20, 2013 at 10:14 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48118","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Would Heirich Pfeiffer professor of Christian art history at the Pontifical Gregorian University in Rome disagree with my cryptanalysis or Medieval Art Historian Thomas De Wesslow?\n\n","date":"October 20, 2013 at 10:26 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48119","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Shall I repeat: JUST couple the Stuggart Psalter stark naked Christ back view and the Pray Hungarian MS stak naked front view, what do you think you ill get IF NOT a fairly accurate medieval record of the TS Image? How long  are Arch-sceptics to be blind-folded to the iconographic truth?\n\n","date":"October 20, 2013 at 10:43 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48121","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Yes, but could all other explanations be ruled out at this point?\n\n","date":"October 20, 2013 at 10:49 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48122","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"O.K.,\niconographically speaking, then how can you account for the early miniaturist pre-forensic insight/premonition/knowledge (if he was not depicting the burial Shroud dorsal image)? \nHow could he possibly be so accurate in his rendition in such a minimum space as that of a miniature while not being a medical examiner and without having any TS negative photographs at his disposal then?\nEnough with mystery. Let’s face the facts.\n\n","date":"October 20, 2013 at 12:01 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48138","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"JUST couple the Stuggart Psalter stark naked Christ back view and the Pray Hungarian MS stark naked front view, what do you think you ill get IF NOT a fairly accurate medieval record of the TS Image?\nShame that none of the 4 images in the Pray Codex shows a single scourge mark, as per TS, and just one of the 4 has a tiny spot on the forehead which is just that – a spot – and not an epsilon.by any stretch of the imagination.\nhttp://greatshroudofturinfaq.com/History/Greek-Byzantine/Pray-Codex/\nSo attempting to book-end those two images would not seem a terribly rewarding exercise for even the most perceptive of palaeoarchaeocryptic detectives. I stand to be corrected, and no doubt shall be, with immediate dispatch.\n\n","date":"October 20, 2013 at 11:10 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48129","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Mr CB, you’ll get your reply SOONt too re the PHM and you’ll get a BIG SURPRISE! This time it won’t be just a “flash illursrative reply”. I will prove beyon the shadow of a rational doubt you’re TOTALLY wrong. You can just see one side of the iconographic coin. SHAME indeed…\n\n","date":"October 20, 2013 at 11:45 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48135","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Reminder for Mr CB: a coin has two sides and even a third one…\n\n","date":"October 20, 2013 at 11:50 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48137","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Correction “End notes:”\nEnd notes: \n• This is a flash illustrative reply to Hugh’s comment  #50 on October 8, 2013 at 1:10 pm in Daniel Porter’s Shroud of Turin Blog:\n“The Stuttgart Psalter is wonderful and I’m so glad Max mentioned it. It does indeed have a picture of a naked Christ being flogged. It seems to be dated about 825, which is probably early for such a thing. Has it anything to do with the Shroud? Not obviously.”\n• It is important to note that at the time the anatomical-pathological studies were made, Barbet, Bucklin, Cameron, Zugibe etc  were not at all aware of the Stuggart Psalter miniature.\n• Iconographically speaking, most likely the early 9th c. CE Carolingian miniaturist-monk (from the Saint-Germain-des-Prés or Reims abbey that was under the Benedictine rule then), did not copy the Shroud dorsal image directly in situ but visually stored it and painted it back onto the painting surface at the risk of interpreting it. Less likely he copied it from another MS miniature.\n• Absent the Baptism of Christ iconography, the depiction of a stark naked Christ is very rare as far as Christological iconography is concerned prior to the 12th c. CE. From 1200 to 1350 CE, it is still rather uncommon.\n• Just couple the Stuggart Psalter stark naked Christ back view and the Pray Hungarian MS stark naked front view and you shall get a fairly accurate medieval record of the TS Image as extrinsic proof the TS radiocarbon dating was skewed.\n\n","date":"October 20, 2013 at 11:33 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48133","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"John Klotz makes a good point above about the origins of artistic convention. How wonderful it would be if we could spot the original behind any particular convention, and observe how its influence spread out both geographically and temporally. Unfortunately, this is very rarely possible, and anybody’s interpretation is open to dispute. The Christ Pantocrator is sometimes supposed to have been modelled on the statue of Zeus at Olympia, which may have moved to Constantinople in the 5th century, and representations of the holy sepulchre as a box rather than a temple may derive from Constantine Monomachus’s rebuilding work in Jerusalem. Although the transitions are gradual, the young beardless Christ and the temple-sepulchre disappear completely, replaced by their substitutes. The same cannot be said of any of the putative shroud-derived iconography. Naked Christs, whip, nail and spear wounds appear sporadically here and there, among various other interpretations, on and off for hundreds of years. Depictions of shrouds themselves are particularly inconsistent.\nIn the paragraph above, I have implied that artistic conventions derive from a particular image, but of course they may also derive from literature, in which case it would be more possible for images unrelated to each other nevertheless to look the same.\nTo take John’s specific iconographical details:\n1) Nails through the wrists. Whatever the shroud shows, very few artists have copied it. This is not evidence that the shroud was known about before the 13th century.\n2) The crown of thorns. Barbet was probably the first to suggest that the shroud shows a cap rather than a wreath. It appears that practically no artist agrees with him, before or after the 13th century. This is not evidence that the shroud was known about before the 13th century.\n3) No whip wounds on the chest. Very few images of the flagellation show any wounds at all. Those that do, show wounds all over the chest. This is not evidence that the shroud was known about before the 13th century.\nIt would be foolish to deny that there are some similarities between some aspects of the shroud and some depictions in medieval images. However, to claim that any of them became “artistic conventions” is, in my view, very far-fetched.\n\n","date":"October 20, 2013 at 12:13 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48139","author":"Hugh Farey","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"\nMax Patrick Hamon :\nO.K.,\niconographically speaking, then how can you account for the early miniaturist pre-forensic insight/premonition/knowledge (if he was not depicting the burial Shroud dorsal image)?\nHow could he possibly be so accurate in his rendition in such a minimum space as that of a miniature while not being a medical examiner and without having any TS negative photographs at his disposal then?\nEnough with mystery. Let’s face the facts.\n\nThe image in the psalter is intriguing, but is it evidence or just a clue?\nA sceptic, like Hugh or Collin, would go this way:\n* pre-forensic insight/premonition/knowledge: flogging was practiced in every epoch, and maybe an illustrator just saw someone being flogged and showed effects of this on the image. Besides it is hard to say something about “accuracy” presented on the image, just a few horizontal marks painted to represent scourges.\n* position of the flogged Christs, there are thousands of illustrated manuscripts so it is possible that on one example the location of the arms and feet, the representation of the naked Christ etc. would be the same as on the Shroud.\nHowever, in the second point I can see at least three similarities with the Shroud presented simultaneously (nudity, position of the arms, position of the hair, position of the feet is represented in wrong way). Can we estimate what is probability of obtaining those by pure chance?\n\n","date":"October 20, 2013 at 12:17 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48140","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Yes, one could have 10 or even 100 points of weak correspondence between two images, but they would not amount to proof of one inspiring the other, even if there were no common link. But there is a common link, in this instance, namely scripture. Each image corresponds to the scriptural account of the scourging, such as it is (somewhat spare on detail) , not to knowledge of the other\nAs for the supposed epsilon-forming fingers, again it’s weak: if the artist had wanted to make a big play of that Greek letter, he could have let us see the forehead, instead of just a rear view. But that would have created an anomaly anyway, since the whipping preceded the crown of thorns that made the epsilon blood flow. In any case, there is no scriptural reference to an epsilon, at least none that I’m aware of (while claiming no authority in that area) so the link between the fingers and the epsilon is what is known technically as a long shot. Oh, and if you look at ShroudScope, it would appear that the epsilon is what’s left of a longer blood flow from the hairline, the top portion of which has long since flaked away leaving just a faint signature of its longer more extended presence. In other words, the remaining  isolated “epsilon” is just an accident, having no linguistic or symbolic significance.\n\n","date":"October 20, 2013 at 12:40 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48144","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"I hate to sound like a lawyer, but then I am one. We deduce facts most often from circumstantial evidence.\nIf you had one Psalter indication, that wouldn’t prove very much. It’s the accumulation of circumstances that tend in one diretion with little tending in the opposite that allows a conclusion to be drawn. This Psalter alone does not prove anything. But when taken in conjunction with other representations, it points i a direction. There is enough uniqueness about the Shroud image that the appearance of its unique features in other works tends to  indicate its antiquity and thus its highly probable authenticity.\nBecause it is not a painting and was not created by ANY known process, it also points in the direction of the Resurrection.\nApplying the much applied, and misapplied Occam’s Razor, the Resurrection may actually be the simplest solution. All as some have said, if it is a fake, it’s a miracle.\n\n","date":"October 20, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48156","author":"John Klotz","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"\nHugh Farey :\n1) Nails through the wrists. Whatever the shroud shows, very few artists have copied it. This is not evidence that the shroud was known about before the 13th century.\n\nRemmeber Jerome’s  manus and authority of his Vulgate\n\nHugh Farey :\n2) The crown of thorns. Barbet was probably the first to suggest that the shroud shows a cap rather than a wreath. It appears that practically no artist agrees with him, before or after the 13th century. This is not evidence that the shroud was known about before the 13th century.\n\nRemember the Crown of Thorns purchased by Louis IX which was just a twisted circlet, because thorns had already dropped off! \nGenerally very few illustrations before 13th century show crucified Christ with the Crown of Thorns still on His head (the Gospel say nothing about that), and no representation before 1147 show Christ crucified with one nail across both feet. There is radical revolution in representation of Christ passion around 12-13th century, at the time when TS was supposedly in Constantinople.\n\n","date":"October 20, 2013 at 12:27 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48141","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Ah now that’s where I disagree. There was occasional increase in variation of the styles of depiction, nothing like “radical revolution.” None of the previous styles of representation faded away, just some new ones appeared. That’s not a revolution, and it’s certainly not a suggestion that the discovery of an “authentic” image meant that “inauthentic” images were no longer made.\n\n","date":"October 20, 2013 at 12:35 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48142","author":"Hugh Farey","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"You know, for some time I look at the crucifixes in churches and along the roads. 90+ % of them show Christ’s feet nailed with a single nail. And around 75+ % them have the right feet above the left, just like it is represented on the mirror image on the TS.\n\n","date":"October 20, 2013 at 12:40 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48143","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"The dorsal image of the shroud very clearly shows the imprint of the sole of the right foot, and not that of the left, showing that the left foot was on top of the right foot….\n\n","date":"October 20, 2013 at 2:35 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48148","author":"Hugh Farey","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Ok BUT in the miniature, the tree-quarter left back view of the Shroud-like figure is a mismash of both dorsal AND frontal TS images (the miniaturist’s rendition). Hence the left leg is in front of the right leg (an unnatural/awkward position). It stares you in the face! Cannot you still not get it?\n\n","date":"October 21, 2013 at 9:48 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48232","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"In other words, even if the miniaturist had a hard time to interpret the feet blood decal and mistook the right foot for the left one, he finally came up with a rather acceptable tale-tell solution as far as the left leg is in front of  the right leg/the left foot in front of the right foot. Mirror images were baffling then as they are still today…\n\n","date":"October 21, 2013 at 10:30 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48245","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"\nHugh Farey :\nThe dorsal image of the shroud very clearly shows the imprint of the sole of the right foot, and not that of the left, showing that the left foot was on top of the right foot….\n\nRemember that TS positive image (the one that can be watched with naked eye) is a mirror one\n\n","date":"October 20, 2013 at 3:51 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48150","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"And by the way, see http://en.wikipedia.org/wiki/Crucifix\nand galleries: http://commons.wikimedia.org/wiki/Category:Crucifixes\n\n","date":"October 20, 2013 at 4:01 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48152","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"No, no! The positive image of the shroud represents the marks made by the real dead body lying on the sheet. If I have a photo of the shroud beside me (which I do), with the dorsal image legs pointing towards my toes, which I have, it is clear that it is the right foot whose imprint is on the shroud, and so the left foot is on top of it. Try it!\n\n","date":"October 20, 2013 at 5:50 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48159","author":"Hugh Farey","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"\nTurn the photo upside down and you see. The chest wound which was actually on the right side here is on the left -contrary to usual depiction, which is reference to Ezekiel as far I remember.\nThe positive image is a mirror one, negative is the correct one.\n\n","date":"October 20, 2013 at 5:59 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48160","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"This only applies to the ventral image. On the dorsal image, which is the one which slows the feet most clearly, of the right foot is the clear one.\n\n","date":"October 20, 2013 at 6:06 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48161","author":"Hugh Farey","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Hugh is absolutely right\n\n","date":"October 21, 2013 at 5:25 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48196","author":"Matthias","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"No art historian am I, but I don’t see how any artists, medieval or otherwise, could have used the Shroud as a subject model to any great detail. For starters the image is so faint, able to be seen only at a distance in any detail, that I can’t imagine an artist getting much forensic detail from it. Some basic insights into body form, some facial features, a few blood lines – that’s about it. To suggest that artists prior to our modern time were able to discern dumbbell scourge marks seems a stretch. They would have been dealing with ‘the big picture’ and not the details we enjoy today with our technology. I also suspect the Shroud spent much time being seen by very few people at all — hidden away, or seen only by the residents of select towns where it was displayed by its owner at the time.\nI sit on the authentic side of the debate but I’m left asking, when presented with all crypto-images, why is there not one example of an artist portraying the Shroud clearly. Even the Pray Manuscript, which is by far the most intriguing, is not definitive.\nNow there may have been such pieces of art but they have been lost, or remain to be found. If the Shroud was widely displayed there should be more examples of artists representing it. Which circles back to my assumption that the Shroud was mostly hidden away for much of its existence.\n\n","date":"October 20, 2013 at 4:14 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48153","author":"David Goulet","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"‘No art historian am I, but I don’t see how any artists, medieval or otherwise, could have used the Shroud as a subject model to any great detail. For starters the image is so faint, able to be seen only at a distance in any detail, that I can’t imagine an artist getting much forensic detail from it.’\nHurrah! Great comment! It’s one of the reasons why the so called “Vignon markings” are nonsense. Some of them MIGHT make sense if ancient artists were privy to the modern photographic images, which of course they were not.\nThe Pray manuscript images, on the other hand, could easily be conceived as being based on a viewing of the faint image, as there is enough in that faint image to indicate a nude Christ with hands folded etc. , plus the L shaped holes would have been VERY prominent at the time (ie. predating later fire burn marks) and hence make great sense in depicting. \nThe faint image is also consistent with Wilson’s Mandylion hypothesis, with historical references to faint images etc\nSo, call me a skeptic of VIgnon etc, but a believer in the PM and the Mandylion hypothesis!\n\n","date":"October 21, 2013 at 4:41 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48194","author":"Matthias","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Max re. # 31 You wonder whether Father Heinrich Pfeiffer would disagree with your cryptoanalysis. Perhaps that would depend on what was the reaction of Sister Blandina Paschalis Schlömer to the paper you sent her on the second shroud. They conduct studies together. In my interview with Fr. Pfeiffer, excerpts from which are on the HSG website, the emphasis was on the “Veronica” and the TS and he did not reject the “Oviedo Cloth”. Your research on the Stuttgart Psalter is certainly worthy of appreciation. Now about the second shroud…\n\n","date":"October 20, 2013 at 4:45 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48155","author":"Louis","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Louis: According to the latin verison of Life of Adam and Eve, Adam was buried with three shrouds, so it is entirely possible that more linens were used:\nSee http://www.pseudepigrapha.com/pseudepigrapha/adamnev.htm\nXLVI 4: And the Lord said again to the angels Michael and Uriel: ‘Bring me three linen clothes of byssus and spread them out over Adam and other linen clothes over Abel his son and bury Adam and Abel his son.’\nSee also: Remi Van Haelst, THE SINDON MUNDA OF KORNELIMUNSTER, COMPIEGNE AND CAHORS http://resurrectionnowinc.blogspot.com/2011/01/shroud-images-throughout-world.html\n\n","date":"October 20, 2013 at 4:57 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48157","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Thanks for the lead, O.K. I hesitate to take pseudepigrapha very seriously because there is a lot of allegory, no one knows the true authors, and the dating of many documents is still being discussed. Of course, they do help us to judge what was on the minds of the people in that region during the period, concentrating on who copied whom.\nRemi van Haelst is a good scientist and I have taken note of the lead to read when there is time. By the way, it is good to see you have some encyclopaedic knowledge of Shroud history and related topics. Will we be soon receiving some more good news from you, something like a new Shroud newsletter, even if it is in Polish with English translation?\n\n","date":"October 20, 2013 at 6:11 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48162","author":"Louis","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Truly, I work alone, on rather amateur basis. But maybe in the future? I tried to contact some other researchers, but got no answers so far. If I get more time, more contacts, more friends, more attention…\n\n","date":"October 20, 2013 at 6:25 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48164","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Unfortunately that is a part of the story and you will have to live with it,and, most important, not give up.\n\n","date":"October 20, 2013 at 6:37 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48165","author":"Louis","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"\nHugh Farey :\nThis only applies to the ventral image. On the dorsal image, which is the one which slows the feet most clearly, of the right foot is the clear one.\n\nHugh, you really don’t realise it, or just don’t want to admit? Look once again. I am quite certain, I did it many times.\n\n","date":"October 20, 2013 at 6:22 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48163","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Anyone else care to join in? If the shroud shows the marks of a body, with the feet crossed one above the other, which one is on top, as seen in the dorsal image?\n\n","date":"October 20, 2013 at 7:04 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48169","author":"Hugh Farey","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Hugh: “it is clear that it is the right foot whose imprint is on the shroud”. Of course.\n\n","date":"October 20, 2013 at 8:09 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48174","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"I don’t normally comment on Dan’s blog, or even read the comments under his posts, but I must make an exception congratulate Max on his major discovery of this very realistic 9th century (820-830) depiction of Christ being scourged naked from behind, and particularly his noticing that the two scourgers’ fingers pointing to Christ’s head are unnaturally curved resembling the epsilon or reversed 3 bloodstain on the forehead of the man on the Shroud. \nThis is more evidence that the Shroud was in existence and seen in its full length in the 9th century. According to Ian Wilson’s chronology that would be even before the Shroud was taken from Edessa to Constantinople in 944. I have therefore taken the liberty of drawing Max’s discovery to the attention of Ian Wilson and Barrie Schwortz.\nI will also take the liberty of commenting on Max’s discovery on my blog. \nAgain my congratulations to Max on his major discovery and also my thanks to Dan for posting it.\n\n","date":"October 20, 2013 at 11:29 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48178","author":"Stephen E. Jones","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Thank you Stephen.\n\n","date":"October 21, 2013 at 7:29 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48217","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"How many folk here, reading the for Gospel accounts, none of which provide details of the scourging, would have imagined that both sides of the body had been comprehensively flayed, that there would be no fewer than 372 bloodstains, most of them scourge marks, with 159 on the front according to Faccini and Fanti? Am I not right in thinking that most here would have imagined the flaying as shown in the 9th century picture, applied to the back only? \nLeaving aside the credibility of someone being expected to carry a cross after so traumatic and life-threatening  an experience, and the fact that Pilate had intended scourging as a lesser presumably non-lethal punishment, isn’t MPH missing a crucial point, namely that if the artist had wanted to signal he had seen and been informed by the Shroud, he’d have shown the victim being flayed back AND front, contrary to common sense or (probably) popular supposition? He could then have added that extra detail of a reversed epsilon on the forehead, even if he hadn’t a clue what it signified, instead of playing tricks with the scourgers’  amazingly telescopic fingers.\nAs it is we have a version of events that provides no compelling evidence whatsoever that the artist had seen the Shroud and its version of events – one that is far more gut-wrenching  than might be supposed from the cursory reference to the scourging in the Gospels. So let’s not be in too much of a hurry to make another “dead cert” of this new evidence, as per the (in my view) over-hyped Pray Manuscript. Both are somewhat pedestrian renderings of biblical scenes,  with no solid and unequivocal evidence of “privileged  information” from having seen and been overly influenced by anything on the  (dare I say) quirky Shroud that so many  Shroudie true-believers see as “filling the gaps” in the Biblical record, even when the additional detail on offer is problematical and/or perplexing. \n(Hundreds of scourge marks, both sides, evenly spaced, rarely criss-crossing? Really?).\n\n","date":"October 21, 2013 at 1:18 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48183","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Typo: reading the four (4) Gospel accounts.\n\n","date":"October 21, 2013 at 1:28 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48184","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"PS: It’s not difficult to think(or dream up) reasons for why flogging would be restricted to the back only (thus making the Shroud image unexpected, apart from lacking any Biblical corroboration). First, you risk blinding the recipient – those tails being hard to target precisely. Secondly, one would think that scourging is a huge trauma just feeling one’s skin being ripped to shreds, without seeing it happen before one’s eyes on the frontal surface, with that adding to the clinical shock, with enhanced risk of the victim being rendered unconscious. But that would spoil the show for a Roman-style flogging, would it not – to have the victim prematurely black out, and have it reduced to a silent flogging of inert meat? So front-and-back flaying would probably be used only if the intention were to flog the victim to death – but that would conflict with the biblical account. So that 9th century image is a conventional perception of flogging – back only – entirely at odds with the Shroud’s extreme and hard-to-fathom version of events.\n\n","date":"October 21, 2013 at 3:41 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48191","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"\nGian Marco Rinaldi :\nHugh: “it is clear that it is the right foot whose imprint is on the shroud”. Of course.\n\nNothing can convince sceptics that left is left and right is right, and mirror left is right, and mirror right is left.\n\n","date":"October 21, 2013 at 4:38 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48193","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Two-one to the right foot being the one making the footprint. So far. Anybody else?\n– Robert Bucklin: “There is a reasonably clear outline of the right foot made by the sole of that foot … The left leg had been rotated and crossed over the right instep.” (http://www.shroud.com/bucklin.htm)\n– Stephen E. Jones: “There is a clearer image of the right foot, presumably because the left foot was nailed over the right foot.” (http://theshroudofturin.blogspot.co.uk/2013/02/the-shroud-of-jesus-25-bloodstains.html)\n– Petrus Soons: “The anatomical right foot is clearly visible, as is the tip of the left foot that seems to be crossed over the right foot.” (http://www.ohioshroudconference.com/papers/p24.pdf)\n– Remi Van Haelst: “The left foot lies over the right foot.” (http://www.shroud.com/vanhels2.htm)\n– William Meacham: “The feet indicate something of their original positioning on the cross, the left being placed on the instep of the right.” (http://www.shroud.com/meacham2.htm)\nI won’t go on, but I will ask why anybody should produce a crucifix that is so obviously the wrong way round? Just to confuse everybody, this is from an account of the execution of Jacques Molay. “The right foot was placed over the left so that the economical Imbert could secure both feet to the door with one nail.” (http://www.bbc.co.uk/dna/place-london/plain/A462458). Well, well, well.\nSo go back to your churches and your roadside crosses. OK says that 75% of them have the right foot on top of the left, in direct contradiction to what is shown on the shroud. Can this be true?\n\n","date":"October 21, 2013 at 5:32 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48197","author":"Hugh Farey","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"just checked de Wesselow’s book and he also says left over right\n\n","date":"October 21, 2013 at 6:36 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48204","author":"Matthias","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Hugh: “Two-one to the right foot being the one making the footprint. So far. Anybody else?”\nBoth feet, or rather, the undersides thereof, can leave an imprint if the subject is recumbent on the linen, and the lower free end of the latter is then turned vertically to capture an imprint of the soles (imaging mechanism unspecified).  So the criterion has surely to be based on which shows the better heel imprint, i.e. through resting directly on the cloth, and declaring that to be the supporting foot and thus winner.  On that basis I’d cast my vote for it being left over right, the latter with heel on fabric, as viewed in the dorsal ShroudScope Durante 2002 tan image (i.e. a non-reversed photographic positive). But I won’t put money on it, having realized myself to be under-endowed in genes for natural visuo-spatial ability .That’s down to generations of supposedly random coin-tossing  events in meiotic chromosomal exchange. and segregation, but where the die was clearly loaded so everyone else got the good bits.\n\n","date":"October 21, 2013 at 7:16 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48213","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"O.K., a sindonologist should be able to identify right and left on the Shroud. If I look at the Shroud in vertical position with the frontal image standing head-up, what I see on the right is the right sides of the body, and this holds for both the frontal and the dorsal images. If I want to see the dorsal image head-up, I have to rotate by 180 degrees and after that what I see on the right is the left sides of the body. This is easy to understand if you imagine a body involved in a cloth. If you are not convinced, take a doll, smear it with red ink on its right parts and black ink on the left parts, involve it in a cloth and look at the result.\n\n","date":"October 21, 2013 at 7:13 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48211","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"\nMatthias :\nHugh is absolutely right\n\nHugh is absolutely wrong, look once again at mirror positive image. The right foot seems to be on top of the left, but it is o f course wrong impression since it is a mirro one.\n\n","date":"October 21, 2013 at 5:34 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48198","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"See: ","date":"October 21, 2013 at 5:44 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48199","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"To convince Hugh that it’s left foot over right:\nGo to Shroudscope, Enrie negative horizontal image, with frontal image on left of picture. The wound on the right side is clearly visible on the upper half of the image, and therefore so will the right foot. Now in your mind’s eye, rotate the frontal image about the vertical mid-axis of the picture, until the feet meet. That is essentially the wrapping of the cloth over the head.  The wound on the right side will still be on the upper half, and the right foot will also be on the upper half of the picture. You should then see that the left foot is over the right. \nChange of topic: Refer Georges Ifrah’s history of numbers “From One to Zero”, chapter 3 ‘The first calculating machine, the hand’.  Ifrah gives very many examples of how important hand gestures became in ordinary human communication from ancient times through medieval times to quite recent human history. This arose because of the use of the hand as a quite sophisticated calculating machine. It was so common that there were many ribald jokes about mere numbers arising from their associated hand gestures. Whether the hand gestures in the miniature have any numerical significance would be guesswork, but hand gestures were important. The epsilon suggestion in the executioners’ hand gestures might not be dismissed too easily.\n\n","date":"October 21, 2013 at 6:00 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48201","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"I presume you mean ‘convince OK’ it’s left over right – Hugh already thinks it’s left over right as do I and the authorities quoted above. The sole of the right foot’s image is on the cloth, part of the heel of the left foot is visible\n\n","date":"October 21, 2013 at 6:40 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48206","author":"Matthias","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Matthias, and others, see: http://img707.imageshack.us/img707/3316/yqpm.jpg\nOf course left is above the right, but on the positive image it is REVERSED -and that’s what is seen by naked eye. And that’s why most crucifixes show right over the left, opposite what was in reality, and what is seen on the negative images which show the things correct. Hard to understand?\n\n","date":"October 21, 2013 at 6:44 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48207","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"OK…..no no no NO!\nGo to shroud scope, and the Durante horizontal image:\nhttp://www.sindonology.org/shroudScope/shroudScope.shtml\nnow pretend you are facing the cloth, the frontal image…what appears to be his left foot is actually his right foot. then you mentally fold the cloth over your head, what looks like the left foot on the dorsal image is actually the right foot.\nSorry you are wrong, no more debate required or necessary!!!!!!!!\n\n","date":"October 21, 2013 at 6:52 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48208","author":"Matthias","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"For the sake of disimbiguation, here my comparative list slightly revised:\n Re the Psalter miniature and TS dorsal-frontal image Christ-like figure connection, to the astute observer: \n●Both are stark naked with long flow of hair in the back; a hair flow that originally was braid from top into a narrow pigtail but has come half undone. In the miniature, the whole pigtail can be made out from top to tip as it appears slightly darker and longer in the hair flow.                                                                                                                                   ●Both have arm(s) bound and/or crossed in front. Had both no scourged and/or furrow marks on the inner side arms? This cannot be checked today any longer.                                                                                                                              ●Both have bloodied furrow and/or scourged marks in conjunction with two whips with lashes each fitted with doubled pellets implying two executioners.                                                                                                                 ●Both have almost feminine curved left hip & thigh (later to be called “the Byzantine curve”). In the miniature the pelvis is shown three quarters as a mishmash of the TS frontal and dorsal images.                                                                                                                            ●Both are/were tied at frontal tibiofibular level with left leg in front of right leg (TS man accurate Forensic description from both frontal and dorsal views: left leg in front of right leg with rope marking in the tibiofibular fleshes).                                                                                                                                   ●Both show a most unnatural/awkward feet position as the three-quarter back view stark naked Christ-like figure being flogged in the miniature combines the TS dorsal and frontal images to be readable.                                                                                                                                 ●And last but not least, by means of a very intriguing tailed-Epsilon hand sign each time formed with unnaturally curved fingers, the executioner on the left seem to point with his left hand index finger to his own head while the executioner on the right does point to Christ’s head with his left hand index finger too. Both left hand signs cryptically resemble the tailed-Epsilon-shaped like bloodstain pattern decal we can observe on TS man’s forehead, just above his left eyebrow.\n\n","date":"October 21, 2013 at 7:15 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48212","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Matthias, and others, see: http://img707.imageshack.us/img707/3316/yqpm.jpg\nOf course left is above the right, but on the positive image it is REVERSED -and that’s what is seen by naked eye. And that’s why most crucifixes show right over the left, opposite what was in reality, and what is seen on the negative images which show the things correct. Hard to understand?\n\n","date":"October 21, 2013 at 7:22 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48215","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"I give up!!!!! Good night!\n\n","date":"October 21, 2013 at 7:26 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48216","author":"Matthias","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Last but not least, thank you to Dan for posting my F.I.RE…and thank you too to Hugh for having me have to reply to him…..\n\n","date":"October 21, 2013 at 7:32 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48218","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Sligthly revised conclusion:\n All these 14 pieces of typological and accidental evidence put together, just fit into crucial evidence: the bloodied body burial cloth now kept in Turin was already in existence early in the 9th CE. The Stuggart Psalter miniature Shroud-like Christ does predate the radiocarbon date by no less than half-a-millennium.\n\n","date":"October 21, 2013 at 8:53 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48228","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Desimbiguation TWO:\nOn October 20, 2013 at 2:35 pm | #46 reply, Hugh Farey wrote:\n“The dorsal image of the shroud very clearly shows the imprint of the sole of the right foot, and not that of the left, showing that the left foot was on top of the right foot….\nMax Patrick Hamon\nOn October 21, 2013 at 9:48 am | #47 reply, I wrote:\n“Ok BUT in the miniature, the tree-quarter left back view of the Shroud-like figure is a mismash of both dorsal AND frontal TS images (the miniaturist’s rendition). Hence the left leg is in front of the right leg (an unnatural/awkward position). It stares you in the face! Cannot you still not get it? In other words, even if the miniaturist had a hard time to interpret the feet blood decal and mistook the right foot for the left one, he finally came up with a rather acceptable tale-tell solution as far as the left leg is in front of the right leg/the left foot in front of the right foot. Mirror images were baffling then as they are still today…”\n\n","date":"October 21, 2013 at 10:36 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48248","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Correction: he (the miniaturist) finally came up with a rather acceptable tale-tell solution as far as the left leg LOOKS (not is) in front of the right leg/the left foot in front of the right foot TO THE (MEDIEVAL) MINIATURE VIEWER.\n\n","date":"October 21, 2013 at 10:48 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48250","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Look once again:\n\nDoes everyone now understand? \nHugh: So go back to your churches and your roadside crosses. OK says that 75% of them have the right foot on top of the left, in direct contradiction to what is shown on the shroud. Can this be true?\nYes, exactly, in direct contradiction -because positive image of the Shroud is actually a mirror image! That’s why 75 % or so crucifixes since about 13th century show right foot on top of the left, contrary to what Barbet, Bucklin, Zugibe and others say! Because they work on negatives!\nSee http://en.wikipedia.org/wiki/Crucifix\nand galleries: http://commons.wikimedia.org/wiki/Category:Crucifixes\nLarge majority of them have right foot on top of the left. But before 1147 there was no example of crucifix showing feet nailed to the cross with a single nail. Nobody imagined it.\n\n","date":"October 21, 2013 at 12:04 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48263","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Actually, I could find only one example of crucifix with left foott over the right, overwhelming majority of them have right over the left, or in rare instances, both feet are nailed separately -this is the case of all crucifixes before 13th century.\nSee also:\nhttp://commons.wikimedia.org/wiki/Category:Paintings_of_Crucifixion_of_Christ\n\n","date":"October 21, 2013 at 12:27 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48267","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Never mind the feet. If the Shroud was so well known centuries before its first known public display at Lirey in 1357 or thereabouts, how come medieval artists (and earlier)  invariably show nail wounds in the palm, as distinct from wrist? Yet the wrist location was trumpeted back in the late 70s (” David Rolfe’s “Silent Witness” etc) as a major piece of scientific evidence underpinning the authenticity of the Shroud, based on mechanical and anatomical considerations of what a Roman nail could support without tearing.  But it was only after the ’88 radiocarbon dating that we saw the frantic search for wrist wound locations in medieval art, with the Pray Manuscript being held up as evidence (and highly dubious evidence at that).\nIf generations of artists pre-1357 had seen the Shroud, as we are led to believe,  then the wrist wound would have become a standard in Western art, and David Rolfe and others would have one fewer “clinching” point to make in their TV documentaries. The fact that the palm wound was seen as standard can be taken as evidence that no artist had seen the Shroud prior to its display at Lirey, sufficient to influence their art.\nIn fact, the Lirey medallion aka pillgim’s souvenir, aka Cluny medal, of the 1357 Shroud shows none of the hallmarks of death by crucifixion, generic or specific – no epsilon on forehead,  no lance wound (unless one accept’s Ian Wilson’s “blood belt” description)  no scourge marks, no crown of thorns, no nail wounds etc. It’s simply that of a naked man, not obviously Christ-like, with crossed hands in groin region, and a tormented tilt of the head. \nAlternative identification: Jacques de Molay, last Master of the brutally liquidated  (under Philip the so-called Fair) Knights Templar,  victim of both mock crucifixion (nailed to a door while imprisoned) and final roasting at the stake in 1314.\n\n","date":"October 21, 2013 at 12:57 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48270","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Reminder for Mr CB: De Molay at the time of his death was in his 70s. The TS man was 35-45 years old…\nMethinks tou have some homewok to do in Latin, Hebrew, Forensics or Medieval History before being peer-reviewed in TS Shroud literature……\n\n","date":"October 21, 2013 at 2:19 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48287","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"\ncolinsberry :\nIf generations of artists pre-1357 had seen the Shroud, as we are led to believe,  then the wrist wound would have become a standard in Western art, and David Rolfe and others would have one fewer “clinching” point to make in their TV documentaries. The fact that the palm wound was seen as standard can be taken as evidence that no artist had seen the Shroud prior to its display at Lirey, sufficient to influence their art.\n\nRemember Jerome’s manus and authority of his Vulgate.\n\n","date":"October 21, 2013 at 1:00 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48271","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"“Remember Jerome’s manus and authority of his Vulgate.”\nPlease explain in simple language what that means (it not being self-evident).  :-(\n\n","date":"October 21, 2013 at 1:05 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48273","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"manus used by Jerome in John 20,25 and 20,27 can mean either hand or palm. Up to 20th century Vulgate was considered the most authorative version of the Bible in the Catholic Church.\n\n","date":"October 21, 2013 at 1:12 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48274","author":"O.K.","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"\ncolinsberry :\n The fact that the palm wound was seen as standard can be taken as evidence that no artist had seen the Shroud prior to its display at Lirey, sufficient to influence their art.\n\nI believe Matthias (sorry I can’t recall exactly who) pointed out once that the wounds in wrist on the Shroud are not conclusively on the wrist. In fact, depending on one’s view, it could be the palms. I concur. To the casual viewer, pre-modern tech, the nail wounds would have been assumed to be in the palms and I don’t see an artist being that meticulous, or trained, to discern it may have been the wrists.\n\n","date":"October 21, 2013 at 1:28 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48276","author":"David Goulet","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"yes a few weeks ago I did some measurements on shroud scope and my own hand too (at 6 feet 2 and 200 pounds I’m a very convincing Shroud man imitator!). By my reckoning the wound is slightly below the mid point of the palm, and NOT on the wrist.\n\n","date":"October 21, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48302","author":"Matthias","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Methinks we are missing the point. The imagery of the Shroud, including wrist wounds, is said to have been reflected in pre-medieval art – as a pro-authenticity argument.  But as soon as one begins to question the few examples given, usually just one – the Pray Codex –  all too often there is a retreat from that position. Some then say that there was vagueness over the distinction between palm, wrist and arm in the classical languages (as if – given the importance of those separate terms). Others say that the artwork’s draughtsmanship  – usually fairly crude cartoon-like line drawings – think Pray Codex- is indistinct re palm v wrist – as indeed it is, given that we are not dealing with Da Vinci-style anatomical correctness. But that cuts both ways.\nIf the Shroud had been familiar to portrait artists, folk who surely have the keenest eye for detail re human anatomy – then the wrist location for the nail wound would have become standard, no matter what St.Jerome and others might have said. Artists take their cue from art – or so we are told – so let’s please be having some consistency.  One doesn’t expect to see a retreat from a position as soon as one challenges it – yet that is what we seem to be seeing re wrist v palm wounds. \nSorry to mention Occam’s razor again, but debating positions that offer too many escape routes through constant defensive additions of new qualifying assumptions are not calculated to impress. \nThe discovery of a nail wound on the TS man’s wrist, late 20th century, came too late to be fielded as an argument for authenticity (and claims it was there all along in ancient art, but we missed it, or those wrist locations can be found if one looks hard enough, provoke at best a yawn and “yeah, right”).\n\n","date":"October 21, 2013 at 2:03 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48283","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"I agree, mostly. I believe there was some general influence of the Shroud on art (the facial points of congruence for example), as only the face of the TS man was likely seen by most people (the Mandylion theory). \nAgain, I personally don’t believe the Shroud was seen, or as widely displayed, as others assume. Why it wasn’t? History knows, I don’t.\nColin is right in that it’s not fair to flip-flop on the impact of the Shroud on artists. There is a lack of clear evidence of Shroud influence on ancient artists — apart from the facial points mentioned above.\n\n","date":"October 21, 2013 at 2:33 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48293","author":"David Goulet","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"\nMax Patrick Hamon :\nReminder for Mr CB: De Molay at the time of his death was in his 70s. The TS man was 35-45 years old…\nMethinks tou have some homewok to do in Latin, Hebrew, Forensics or Medieval History before being peer-reviewed in TS Shroud literature……\n\n“Mr” in English is a courtesy title. So kindly stop using it as a discourtesy title (to press home your erroneous claim that I am lying about possessing a PhD). I do not expect on this site to be addressed as Mr. or Dr.  – Colin –  or nothing –  will do fine, but I do take great exception to being branded an imposter or liar , and feel it’s time for the site’s host to put a stop to this obsessive trolling by MPH once and for all.\n\n","date":"October 21, 2013 at 2:27 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48290","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Yes or No have you got a PhD in BIOchemistry, Mr CB?\n\n","date":"October 21, 2013 at 2:32 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48292","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Yes. I have given you a link. What else do you want? A signed copy of my PhD certificate? Can be done, but will cost (a crate of 1998 or 2000  Margaux will do very nicely).\n\n","date":"October 21, 2013 at 3:05 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48297","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"The fact remains though, your leech, barbecued Templar scorch theory and the very fact De Molay was in his70s when he was burned at the stake while forensically speaking the TS man was only 35-45 years old, makes me SERIOUSLY DOUBT you are a real scientist.\nAnother fact remains too, you JUST CANNOT be mistaken with the true Sir Colin Berry, PhD in biochemistry as you are just a… Mr.\n\n","date":"October 22, 2013 at 7:50 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48377","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Re his leech, roasted Templar scorch theory, when Mr CB claims as “Alternative identification: Jacques de Molay, last Master of the brutally liquidated (under Philip the so-called Fair) Knights Templar, victim of both mock crucifixion (nailed to a door while imprisoned) and final roasting at the stake in 1314.”\nThis makes me LOL How “scientific” and “scholarly” the man is just overlooking the historical and forensic facts De Molay at the time of his death was in his 70s and the TS man was 35-45 years old… And the Mr means B(science)…oh, really?\n\n","date":"October 21, 2013 at 2:29 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48291","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"On wrist nailing vs palm nailing:\n1) Barbet asserted from Enrie negative that nail passed through wrist. He claimed that nail passed through Destot’s space and severed median nerve resulting in reflex retraction of thumb into palm. His calculation of 207lb arm tension would result in tearing of the palm, but could be supported by wrist nailing. His experiments with amputated limbs seemed to support his assertion. Consequently there has been a tendency to accept his conclusion. \n2) The only mention in the scriptures of Jesus being nailed to the cross, rather than bound by ropes, is in John 20:25. Barbet asserts that nailing was the usual Roman practice in Palestine. Author of John’s gospel uses the Greek word ‘cheira’. Apparently this word can mean hand, wrist, or forearm. Jerome’s Latin Vulgate translates it as ‘manus’, hand. The Latin for wrist is ‘carpus’. As the Latin Vulgate was the primary authority, generations of artists showed the nails as passing through the palms of the hands.\nThe Greek word ‘cheira’ also occurs in Luke’s Acts of the Apostles at Acts 12:7, describing Peter’s release from prison. Again, Jerome tranlates it as “manus” rather than “carpus”. Consequently, most of the English translations have “and the chains fell from his hands”. A moment’s thought will realise that “the chains actually fell from his wrists”. More recent translations including USCCB translation use the word “wrists” for Acts’ ‘cheira’. \n3) Frederick Zugibe was highly critical of Barbet’s conclusions. He maintains that Barbet was confused about the location of both Destot’s space and median nerve, notwithstanding Barbet’s thumb retraction experiments. FZ considered that the thumb being hidden on the TS was merely because the natural relaxed position of the thumb in death or asleep is in the palm. He suggests an alternative path for the nail from the base of the palm with exit on the wrist as shown on TS. He illustrates an instance of this with a needle showing the path of a blade through the hand of an actual stabbing victim. The paper also includes several other interesting illustrations, including his crucifixion experiments. His crucifxion experiments involving foot support, ressulted in arm tensions of only about 65lb compared to 207lb when freely suspended by arms alone. This tension could be sustained by the path he proposes. \n“PIERRE BARBET REVISITED” BY Frederick T. Zugibe, M.D., Ph.D.\nhttp://www.crucifixion-shroud.com/Barbet.htm  \nI would be inclined to dismiss Zugibe’s argument that mystics normally receive stigmata in the palms, as there are important psychological factors at work in such cases. Otherwise, whether Barbet or Zugibe is correct, is a matter for other medical practioners in forensic pathology to comment on. We mere groundlings can only wait and watch!\n\n","date":"October 21, 2013 at 7:03 pm","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48309","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"I challenge everyone to measure on shroud scope the distance from the tip of the fingers to the wound mark. If I compare it with my own hand which seems to have similar dimensions to the shroud man hand, it comes out just slightly below mid palm.\nI’d be interested in others’ own measurements.\nI believe Barbet was wrong and the notion that the wounds on the shroud are on the wrists is one of a significant number of Shroudie myths that some pro-authenticitists churn out ad nauseum!\n\n","date":"October 22, 2013 at 4:17 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48346","author":"Matthias","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"so yes I definitely think Zugibe rather than Barbet is right.\n\n","date":"October 22, 2013 at 4:18 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48347","author":"Matthias","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"One problem I have with Zugibe’s explanation, is that none of the volunteers had a nail through their second inter-meta-tarsal space. Their feet were merely seat-belted to the upright. The Lisfranc’s space-line, the junction between the tarsal bone-mass and meta-tarsals could take considerable weight on a crucifixion nail, but I imagine the pain would soon become rather unbearable, and the crucifarius would then seek to transfer some of his weight back onto the arms, with a serious risk of tearing the palms, if nailing occurred as Zugibe describes. \nBarbet was successful at easily driving nails through amputated wrists, whether it was through the Destot space or elsewhere. Despite Zugibe, I believe that Barbet’s theory ought not to be dismissed too lightly without some further independent expert comment.  An experienced expert Roman executioner ought to know where to drive the nails for best effectiveness! Hence my final sentence above at #103.\n\n","date":"October 22, 2013 at 5:42 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48360","author":"daveb of wellingon nz","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"\nMax Patrick Hamon :\nThe fact remains though, your leech, barbecued Templar scorch theory and the very fact De Molay was in his70s when he was burned at the stake while forensically speaking the TS man was only 35-45 years old, makes me SERIOUSLY DOUBT you are a real scientist.\nAnother fact remains too, you JUST CANNOT be mistaken with the true Sir Colin Berry, PhD in biochemistry as you are just a… Mr.\n\nThere is a Professor Sir Colin Berry who is a distinguished pathologist. You could have found that out for yourself if you had bothered to make careful use of your search engine, instead of rushing to conclusions.\nhttp://www.leopoldina.org/fileadmin/redaktion/Mitglieder/CV_Berry_Colin_EN.pdf\n\n","date":"October 22, 2013 at 8:02 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48378","author":"colinsberry","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"The fact is I already knew for Sir Colin Berry more than a year ago… (who is rushing to conclusion)\nIn “a comment of yours” you were in denial of my professionalism (implicitly underrating me just as an “enthusiastic amateur” while OVERRATING YOU as a qualified expert which you are not as far as the Turin Shroud is concerned).\nMethought I had AN EVEN BETTER REASON than you  to be in denial of “your expertise”… BTW the Shroud Image? Warp side or weft side?\n\n","date":"October 22, 2013 at 8:59 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48390","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"…Which actually proves that I am right: you ain’t no SIR, just a Mr…\n\n","date":"October 22, 2013 at 9:01 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48391","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"An Intriguing 9th Century Image Suggestive of the Shroud – A Guest Posting by Max Patrick Hamon","post":"Methinks you just daydream yourself as Professor/Sir Colin Berry, PhD in biochemistry…  at times.\n\n","date":"October 22, 2013 at 9:06 am","url":"https://shroudstory.com/2013/10/20/an-intriguing-9th-century-image-suggestive-of-the-shroud-a-guest-posting-by-max-patrick-hamon/","cat":"carbon_14_dating","id":"comment-48392","author":"Max Patrick Hamon","site":"shroudstory"}]
