[{"title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong","post":"I thought this to be a compelling papaer. I found her comparison between the diamond shaped water stain pattern on the torso of Christ on the shroud and a similar pattern on torsoes of images of Christ dating from around 1300AD very interesting. Looking at that epitaphios image from about 1300AD, I have to say it almost certain that it was based on the shroud, therefore the notion that the shroud was man made in the 1300s somewhere in france or where ever is weakened. God bless.\n\n","date":"February 13, 2013 at 8:24 am","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","id":"comment-24138","author":"Matthias","site":"shroudstory"},{"title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong","post":"also, although not a scientist, I thought this seemed a very compelling argument for contamination affecting the C14 dating. New Pope – please allow for new tests!!!!\n\n","date":"February 13, 2013 at 8:38 am","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","id":"comment-24140","author":"Matthias","site":"shroudstory"},{"title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong","post":"going back to those images, so we have an epitaphios from Serbia from circa 1300AD VERY similar to the Shroud image, Serbia is adjacent to Hungary – with the similar Pray Manuscript depiction from about 1200AD. Then I have seen another Greek epitaphios from the 1200s with remarkable similarity to the Shroud image – this is all looking to be convincing evidence that the Shroud was in existence at least as early as 1200-1300 in this South eastern part of Europe. I think it is very hard to reconcile this evidence with Colin Berry’s theory that the image was created through scorching in France in the 1300s\n\n","date":"February 13, 2013 at 8:52 am","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","id":"comment-24142","author":"Matthias","site":"shroudstory"},{"title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong","post":"This paper is a must read! Pam Moon did a lot of research for this paper. Great job!\n\n","date":"February 13, 2013 at 11:58 am","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","id":"comment-24152","author":"Donn Reile","site":"shroudstory"},{"title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong","post":"1. Another paper that clearly indicates that C14 is not an appropiate technique to date an object like the shroud. I dont want to repeat myself on this blog but  a lot of papers point in the same direction. In my view, the evidence against c14 being appliable to the Shroud is simply overwhelming. My question is, what happened in the 80’s so that is was established that c14 was beyond any doubt the only way to know the truth? Why other suggestions made by STURP members like Druzik published in peer reviewd journals have largely been ignored or unnoticed? And how is it that this bias still persists and new c14 tests are requested once and again?\n2. If the facts described in this paper are really acting  on the Shroud they must have left distinctive tracks on the image. Much in the line of the works by Marion and Morgan,  a Principal Component analysis on the image could allow the detection of the mechanisms described by Pam Moon. That work would really be interesting.\n\n","date":"February 13, 2013 at 5:31 pm","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","id":"comment-24174","author":"Gabriel","site":"shroudstory"},{"title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong","post":"However, Colin has landed over there and has attacked Pam\nMoon’s integrity by calling her work pseudo science. Even though he\nwould never admit it, Colin must be really bothered by the\npossibility that this cloth may show an image of the Son of\nGod.\n\n","date":"February 13, 2013 at 7:18 pm","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","id":"comment-24179","author":"Randy","site":"shroudstory"},{"title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong","post":"I find this paper lacking. Pam Moon admits it is speculation. But that isn’t an excuse for not providing realistic estimates of required quantities. I doubt there is anything here that will move the date by more than a few years or decades at most. I still think the only viable explanation is the reweaving proposed by Benford and Marino, which is well supported by Rogers and others.\n\n","date":"February 14, 2013 at 4:00 am","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","id":"comment-24193","author":"Paulette","site":"shroudstory"},{"title":"SPECIAL PAPER CHASE: New Possibilities Why the C14 Dating of the Shroud May Be Wrong","post":"The basic problem with this paper can be illustrated starting from the sentence preceeding the conclusion: “If contamination caused a discrepancy of 15,000 years in the dating of fossil bones, the contamination identified by this paper could have caused a discrepancy of 1300 years in the Shroud of Turin”. This comparison between a shift from 35,000 years to 50,000 years on the one hand, and a shift from 700 years to 2000 years on the other hand, is simply inadequate. In a sample of age 700, about 88% of the 14C atoms still survive; in a sample of age 2,000, about 70% of the original 14C atoms did not decay. Ir order to push up the percentage from 70% to 88%, and using a recent biocarbon source with 100% of the 14C still present, about 60% of the original carbon in the sample has to be replaced by contamination mechanisms of all sorts. Of course, this replacement percentage of 60% becomes larger still when the contamination is produced by older carbon, dating from the 16th century, for example.\nBut in a sample of age 50,000 y, only 0,00155% of the 14C atoms survive (taking the half life = 5,700 y). In a sample of 35,000 y, 0,215% of the 14C survives. Suppose that we use contamination material of age 5,700 y (36% of the 14C still present). Then we need to replace only 0,55% of the carbon in the sample to produce a ‘rejuvenation’ from 50,000y=>35,000y.\nOf course, these are only some back-of-the-envelope calculations but they illustrate the main problem: in very old samples, contamination can easily have a huge impact on the age measurement, because there is only very few 14C left. But in ‘young’ samples (‘young’ a compared to the half life of 14C) it is much more difficult to significantly alter the measured age by contamination.\n\n","date":"February 19, 2013 at 5:52 am","url":"https://shroudstory.com/2013/02/13/special-paper-chase-new-possibilities-why-the-c14-dating-of-the-shroud-may-be-wrong/","cat":"carbon_14_dating","id":"comment-24800","author":"Jos Verhulst","site":"shroudstory"}]
