[{"title":"Special Request from Hugh Farey","post":"Hugh, I went on a search and I think I may have found something very like it. There is a similar diagram in a paper with the intriguing title “The scientific paper that AMSTAR successfully denied to those who attended the Dallas\nConference …, Could the Shroud’s radiocarbon date have been Skewed due to 16th century repairs?” by Joseph G. Marino and Sue Benford Ph.D, R.N.  Joseph Marino is a former Benedictine monk currently working at the Ohio State University Library. Sue Benford, is Executive Director of the Ohio Scientific Education & Research Association. \nThe diagram in the May 2010 Riani, Fanti et al paper seems to correspond to Fig 1 on p.2 of the Marino/Benford paper. It is labelled: “Illustrations showing the precise statistically-determined angular skewing of the dates corresponding with the individual laboratories with reference to the location of the samples received.” and is tagged “Copyright 2000, Marino & Benford (C-14 sample courtesy Ian Wilson)”. \nThe paper includes references to Raes, Adler, Walsh and various others. \nMy attempts to find the original Walsh paper on the web were unsuccessful. Apparently it seems necessary to contact Walsh for a copy of the Proceedings of the Richmond 1999 conference which is said to contain all the papers of that conference. You can find various references for this, e.g. search shroud.com site.\n\n","date":"May 1, 2013 at 7:35 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32450","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Correction: Fig 1 of Marino/Benford paper is tagged: ““Copyright 2000, Marino & Benford (C-14 sample photo courtesy Ian Wilson)”.\nIncidentally URL inadvertently omitted is:\nhttp://www.shroud.com/pdfs/n54part5.pdf\n\n","date":"May 1, 2013 at 7:40 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32451","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"A paper by Walsh at the 1999 Richmond conference can be retrieved through archive.org, for example here:\nhttp://web.archive.org/web/20040428023751/http://members.aol.com/turin99/radiocarbon-b.htm\nThe 1988 Shroud of Turin Radiocarbon Tests Reconsidered\nPart II\nPress here to return to Part I of this paper.\nBryan J. Walsh\nShroud of Turin Center\nRichmond, Virginia USA\nCopyright 1999\nAll Rights Reserved\nThis is the second part with the diagram. There is a link to the first part.\n\n","date":"May 1, 2013 at 11:03 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32480","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"I assume that Hugh is referring to Fig. 1 of the paper showing the very precise measurements (in millimeters) of the C14 samples.\nI do not know where those measurements of Fig.1 came from.\nFrom Gonella/Riggi documentation, I have only the precise weights ans shapes of the samples but not the measurements.\nPerhaps, I’ll be able to give you the answer soon.\n\n","date":"May 1, 2013 at 3:22 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32501","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Fig 1 of the Marino/Benford paper alludes to a photograph supplied by Ian Wilson who I understand was present during the sampling. His 2010 book “The Shroud” refers to the long ‘discusssions’ on the choice of the sampling site immediately beforehand.  I’m wondering if Marino/Benford are relying on a copy of his photo for deducing the measurements, i.e. measure the dimensions on the photo and then scale them accordingly?\n\n","date":"May 1, 2013 at 4:46 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32507","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Finding the Walsh paper online is terrific, Gian Marco, so thanks very much. However, it still is not perfectly clear to me where his diagram came from. Mark Oxley (http://www.shroud.com/pdfs/oxley.pdf) reproduces two diagrams from Riggi (one crossed out). Both, however, show the masses of the cut out sections, from the end of the cloth, as 52.8, 52.0, 39.6, 14.2 mg. In other words the two smallest pieces are side by side. In every subsequent drawing, such as in the Walsh paper, the two smallest pieces are separated from each other by the other two carbon dating pieces.\nThis is significant.\nDonahue (in his letter to de Cointet – https://shroudofturin.files.wordpress.com/2011/01/donahue.jpg) says that the Arizona pieces were cut into four subsamples of 13.86, 12.39, 14.27, 11.63 mg (though the last two figures have been amended by de Cointet). If Arizona received the two smallest pieces of the four, these masses must include the 14.2mg sliver. If Jull retained the 12.39mg piece, then Arizona could only have tested three pieces. This is in contradiction of the Nature report, which shows results for four pieces. Walsh does not appear to notice this.\nDe Cointet’s amendment to Donahue’s diagram – which he justifies by claiming Donahue wrote to him again – makes the total of the four pieces add up to 52.8mg. By luck or design, this is the same weight as the piece of carbon dating material furthest away from the sliver, according to Riggi’s diagram. I think de Cointet is trying to suggest that Arizona got one piece from either end of the four sample strip, the 52.8mg piece and the 14.2mg piece, and I think he is doing it to reconcile the fact that Arizona claim to have had five subsamples, four for testing and one for Jull.\nBut he forgets that this means that either Oxford or Zurich must have ended up with the 39.6g piece, which is incorrect.\nThe whole thing is riddled with inconsistencies.\n\n","date":"May 1, 2013 at 5:56 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32515","author":"Hugh Farey","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Hugh, both diagrams of Riggi are wrong. It is incredible how many mistakes Riggi could make, beginning with his wrong statements in 1988 and 1989. The order of the samples has been reconstructed from the photos. Usually the order (from the left, i.e. from the border of the cloth) is given as: Reserve, Arizona-small, Oxford, Zurich, Arizona-large. There are no doubts about the last three. I am note sure about the first two because it is possible that Arizona-small was cut from the left end of Reserve. It is not possible to decide because there are no clear photos of Arizona-small available.\nThe situation for the Arizona subsamples is not clear. Jull and Freer Waters have published the photo a piece that was not used for dating and is still kept in Tucson. This piece is not the small piece that had originally been delivered as a separate piece. It comes from the large piece (the upper part of it). It seems that also the small piece is still kept in Tucson but there is no clear proof. It is surprising thet Arizona did the dating with only two quarters of the available textile. Recently Barrie Schwortz went to Tucson and took photographs but he was told that there was another piece that was kept at the home of Donahue (who was absent at the time). It is to be hoped that Jull or somebody in Tucson will soon publish a clear photo (front and back) of the Donahue subsample. If they do not give a proof that the small piece is still extant, one might suspect that they dated it but had hidden away the result if it was an outlier.\n\n","date":"May 2, 2013 at 6:18 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32577","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Thanks, Gian Marco. Can I confirm the following, as far as you know?\n1) Arizona received one piece weighing about 39mg, and one piece weighing about 14mg.\n2) Donahue divided the big piece into three, so there were now four pieces, two weighing about 14mg, and two weighing about 12mg.\n3) At least one of these pieces (about 12mg) was not used for carbon dating, and retained by Jull.\n4) One of the three remaining pieces was cut in two, to provide four carbon dating pieces.\n5) They weighed about 14mg, 12mg, 7mg and 7mg.\nIs that correct?\nWas 7mg a sufficiently large sample for the carbon dating apparatus at the time?\nFurther:\nIf two pieces were reserved, then the remaining two pieces would both have to be cut in two to provide Arizona’s four carbon dates. The four test pieces would have weighed, 7mg, 7mg, 6mg, 6mg.\nIs that correct too?\nWas 7mg a sufficiently large sample for the carbon dating apparatus at the time?\nThanks very much.\n\n","date":"May 2, 2013 at 7:21 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32588","author":"Hugh Farey","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"I have just been reading Mark Oxley’s paper, whose information seems to derive from Harry Gove’s book ‘Relic, Icon or Hoax,’ in which it is supposed that the Arizona lab did indeed test samples of 7mg or less. Gove suggests that this was way below the 20mg required for an accurate dating. He also suggests that since the other two labs cut their 50mg samples into four, their results were meaningless as well. Has anyone got a copy of the instructions for the AMS carbon dating procedure for 1988? (Not really expecting the answer yes)\n\n","date":"May 2, 2013 at 2:20 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32641","author":"Hugh Farey","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Hugh, here are some data about the weight of the samples that was needed for radiocarbon dating in 1988, The 1989 Nature paper refers to a 1987 paper by Slota et al (Radiocarbon 29, 303-306) for the preparation of the graphite targets at Arizona. The paper is available here:\nhttps://journals.uair.arizona.edu/index.php/radiocarbon/article/view/1051/1056\nThey say: “The graphite powder is collected, weighed, and ca 1 mg (if available) is pressed into a standard target holder for accelerator 14C analysis. […] Samples as small as 0.3 mg have been successfully analyzed.”\nThe amount of carbon (graphite) in a textile sample should be about 25%. We do not know the amount of textile weight that was lost during pretreatment. It depends on the conditions of the textile and the cleaning method. Let us suppose that (at least) 5 mg of textile are needed for a graphite pellet of 1 mg. The Arizona lab used 8 pellets (four pairs). This would amount to 40 mg of textile. If they used only two subsamples (14.72 mg and 11.83 mg) the total amount was 26.55 mg. Therefore each graphite pellet was well below 1 mg.\nAt the 1986 Turin workshop (according to Gove in his book) the representatives of the laboratories were asked how much (pure) carbon they needed. The AMS labs answered with a figure between 1 and 5 mg.\nOn the other hand, still to-day the laboratories request a rather large amount of textile for the samples they receive. For example one laboratory indicates 20-50 mg. Another laboratory indicates 15 mg. Probably the labs prefer to work with abundant material, especially because archaeological samples may often be in bad conditions and suffer a rather large loss during pretreatment. Moreover very small samples may give less precise results.\n\n","date":"May 2, 2013 at 8:16 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32666","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Dave referred to a paper that myself and my late wife Sue Benford wrote.  The version he cited was in the British Society for the Turin Shroud Newsletter.  There is a more complete version at http://www.shroud.com/pdfs/marben.pdf.  In that version the colorized Wilson diagram has the caption “Proposed Carbon Dating Sequence from Actual Results.  So, it was a guestimate based on Wilson’ photo, Bryan Walsh’s diagram of “Distance from edge of Shroud cloth vs. Radiocarbon date in YBP” and the published results of the labs.\nRegarding Hugh’s question regarding the instructions for the labs, I assume he means the original protocol, which reads:\nCONCLUSIONS AND PROCEDURAL STEPS\nThe Turin Workshop on “Radiocarbon Dating of the Turin Shroud” was held from 29 September to 1 October, 1986. Twenty-two persons, representing the Archbishop of Turin, the Pontifical Academy of Sciences, and laboratories in France, Hong-Kong, Italy Switzerland, the United Kingdom and the USA, participated in the workshop. After\ntwo and one-half days of technical discussions, carried out in a spirit of amity, the following conclusions and procedural steps were agreed upon.\n1. This is the time for radiocarbon dating of the Shroud of Turin.\n2. A minimum amount of cloth will be removed, which is sufficient (a) to ensure a result that is scientifically rigorous and (b) to maximize the credibility of the enterprise to the public. For these reasons, the decision was made that seven laboratories will carry out the experiment: five accelerator-mass spectrometer laboratories and two small-counter laboratories. \n3. The samples should be taken from an unobtrusive part of\nthe Shroud, and from a portion which is not likely to yield other useful information. The samples should not include charred material. They should be prepared in a form, not too small, so as to allow reasonable pretreatment processes. In addition to the Shroud samples, the British Museum will also prepare and provide two control samples for each laboratory.\n4. For logistic reasons, samples for radiocarbon dating will be taken from Shroud immediately prior to a series of other experiments planned by other groups.  Selection of the material to be removed and the actual removal will be the responsibility of Mrs. Flury-Lemberg (Abegg-Stiftung, Bern, Switzerland). \n5. Seven samples containing a total of 50 milligrams of carbon will be taken from the Shroud. In addition, a single dummy sample will be prepared by the British Museum. These Shroud samples and the dummy sample will be distributed to the seven laboratories in such a way as to ensure that the seven laboratories are not aware of the identification of their individual sample. This distribution will be the responsibility of the following three certifying institutions: the Pontifical Academy of Sciences (Professor C. Chagas), the British Museum (Dr. M. S. Tite) and the Archbishopric of Turin (Professor L. Gonella). \n6. The taking of the samples will be done so that representatives from the seven laboratories will have complete knowledge of the process. Samples will be delivered by the three certifying institutions (See 5 above) directly and immediately to the representatives of the seven laboratories who will thereafter be responsible for the samples.\n7. At this time, a date will be chosen for submission of experimental results from the seven laboratories to the following three analyzing institutions: the Pontifical Academy of Sciences, the British Museum, and the Metrological Institute of Turin, “G. Colonnetti”. These institutions will keep the results in sealed envelopes until an agreed upon date, at which time they will be opened for statistical analysis.\n8. After the analysis of the experimental results by the three analyzing institutions, a meeting will be held in Turin between the three analyzing institutions and representatives of the seven laboratories to discuss the results of the statistical analysis with the objective of deciding the final result of the measurement program.\n9. The radiocarbon groups will, through correspondence, establish a common format for presenting the experimental results to the analyzing institutions. \n10. The cost of the experiments and the analyses will be borne by the participating institutions. Travel and living expenses entailed will be provided by the Pontifical Academy of Sciences unless other arrangements are made .\n11. Samples from the Shroud will be taken by May, 1987. It is hoped that the final result will be available by Easter of 1988. This final result will be published in an appropriate scientific journal as a collaborative paper.\n\n","date":"May 2, 2013 at 9:48 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32672","author":"Joe Marino","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"“Seven samples containing a total of 50 milligrams of carbon will be taken from the Shroud.” It should be specified that two of the labs used another method, not AMS, and requested a larger quantity. I copy a whole passage from Gove’s book (p. 155) describing what happened at the same 1986 Turin workshop:\n“I said that a year before Rochester had dated something like 15 micrograms of carbon but the accuracy was poor – that is an example of the sample size going down. For a standard dating like the shroud, 5-10 milligrams of carbon would be needed.\n“The other [four] AMS lab representatives gave estimates ranging from 1 to 5 mg finally settling on the latter. The [two] small-counter labs at Brookhaven and Harwell requested 10 and 15 mg respectively.”\nSubsequently in London, as a final request, the three chosen labs indicated at least 40 mg of textile each. This was more than strictly necessary but probably the labs wanted to have spare material in order to repeat a measurement if something went wrong.\n\n","date":"May 2, 2013 at 11:46 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32678","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Hi Joe,\nThanks very much for tuning in. What I really wanted wasn’t so much the Turin Protocol as the standard protocol (if there was one) that the Arizona AMS laboratory issued to people wanting to use its services. If a rich, independent archaeologist had found an old sheet in a cave and wanted Tucson to date it, he would, I suppose, have asked several questions. The two most important would be: “How much does it cost?” and “How much do you need?” followed, probably by: “How accurate/reliable will be the result?”\nIf I was told, we need 50mg, and then discovered that actually only half of that had been used, I would be wanting to know why, not having authorised the retention of any of my artefact by the laboratory.\n\n","date":"May 3, 2013 at 6:58 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32731","author":"Hugh Farey","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"From Joe Marino’s list above, it is evident that the listed protocols were not followed in several respects. Inclusion of Step 3, essentially requiring only a single site, immediately sets the stage for non-representative sampling, as appears to have been borne out by Adler’s and others’ subsequent examination.\nThere are several reasonably well-informed papers on the unsatisfactory way the whole business was carried out. As good a report as any is: “The setting for the radiocarbon dating of the Shroud”, by Emanuela Marinelli, Valencia, April 28-30, 2012, to be found at:\nhttp://www.shroud.com/pdfs/marinelliv.pdf \nAn interesting aspect of Marinelli’s paper is that he identifies specific examples of faulting dating by C-14 on various cloths, including Egyptian mummy cloths, where dating was out by hundreds of year, and even more. From the examples cited, it seems evident that C-14 can be no reliable age indicator in the case of ancient textiles. It is remarkable that the laboratorie agreed to such a non-representative method of taking samples.\n\n","date":"May 3, 2013 at 12:58 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32689","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Hugh, Dr. Jull, head at Arizona, is pretty good about responding to emails.  His address is:  jull@email.arizona.edu\n\n","date":"May 3, 2013 at 11:21 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32755","author":"Joe Marino","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Thanks again, Joe. Dr Jull has confirmed that two of the four samples were indeed retained, and the other two were cut into two again, making four samples of between 5mg and 7mg for dating. I have not pressed him on whether this was actually sufficient.\nDoes anybody know how much the Oxford or Zurich labs used, or whether they too kept back half their sample for further research and/or confirmation of the results.\n\n","date":"May 3, 2013 at 1:39 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32762","author":"Hugh Farey","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"No wonder everything went wrong, from beginning to end.\n\n","date":"May 3, 2013 at 2:39 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32767","author":"Louis","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Hugh, I’ve also had some correspondence with Ramsey at Oxford.  His address is christopher.ramsey@riaha.ox.ac.uk.  George Bonani’s address at Zurich is bonani@phys.ethz.ch .\n\n","date":"May 3, 2013 at 6:37 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32794","author":"Joe Marino","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Now this is a fascinating discussion. Hope we get more of this.\n\n","date":"May 3, 2013 at 8:00 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32800","author":"Chris","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Yes, it adds a new twist to scientific, er, reductionism…\nLike which is better – an accurate answer based on a single N mg mass of sample, with no indication of precision (repeatability) – or a more precise but less accurate answer based on duplicate 0.5N mg samples? \nAnd how does one describe the minimal requirements of one’s methodology – as requiring N, 0.5N or even 2N mg of sample? \nThe closest I ever came to having to address this predicament was in trying to improve the assay sensitivity for bilirubin-conjugating enzyme in needle biopsy specimens of human liver. The clinicians kept giving me undersize specimens, making it impossible to claim I had improved assay sensitivity…    :-(\n\n","date":"May 4, 2013 at 4:44 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32849","author":"colinsberry","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"\nHugh Farey :\n(…) Dr Jull has confirmed that two of the four samples were indeed retained, and the other two were cut into two again, making four samples of between 5mg and 7mg for dating. I have not pressed him on whether this was actually sufficient.\n(…)\n\nDo you find any problem with Jull’s answer?\n\n","date":"May 4, 2013 at 4:17 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32846","author":"David Mo","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Not at present, no. I simply want to know how many mg of an unknown fabric was considered necessary to achieve a dating measurement in 1988. There is carbon dating submission advice online (http://www.ess.uci.edu/ams/Sample%20Submission%201.htm), from the University of California, currently asking for 2.5mg of dry weight carbon-rich organic material. If that was the case 25 years ago, then the dating procedures carried out by Arizona seem to me beyond reasonable reproach.\n\n","date":"May 4, 2013 at 4:54 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32850","author":"Hugh Farey","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"\nHugh Farey :\nThanks again, Joe. Dr Jull has confirmed that two of the four samples were indeed retained, and the other two were cut into two again, making four samples of between 5mg and 7mg for dating. I have not pressed him on whether this was actually sufficient.\n.\n\n This is important information that you have obtained, Hugh. It changes many hypotheses. May we have some literal quotation from Jull’s writing/e-mail?\nThank you.\n\n","date":"May 5, 2013 at 1:56 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32937","author":"David Mo","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"In his email to me, Dr Jull writes [my notes in square brackets]:\nAccording to the notes I have, there was originally stated to be 53.7mg (by the persons who removed the sample – I suppose Riggi and Tite) which was in two fragments.\n[This measurement was therefore made in Turin.]\nThese were subdivided into a. 13.86mg, b. 12.39mg, c. 14.72mg and d. 11.83mg.  Obviously, these total 52.8mg not 53.7mg. The discrepancy was attributed by us to a weighing error, when the original sampling was undertaken.\n[These measurements were therefore made in Tucson. Jull assumes the Turin measurement was wrong. There may have been some drying out.]\n You are correct that last two of the pieces (c and d, as labelled above) were used for the dating and they were subdivided into two – making a total of four discrete samples for dating. \n[The mass of the ‘extra sliver’ was originally given as 14.2mg by Riggi, but it could be piece (a) above if it had dried. The mass of the largest tested sample could not have been more than 7.36mg.]\nEach of these 4 samples was processed as separate samples. In each case, the resulting graphite was run twice, resulting in 8 independent determinations. I think that the 2 determinations on each sample were combined in the Nature paper, but that the original data was provided to Dr. Tite, who was coordinating the publication.\nThe remaining material was retained in case of future work to reproduce the results, as is normal practice in any laboratory.\n[If so, then presumably the Oxford and Zurich labs did the same. I have not heard from Dr Ramsey or Dr Bonani yet.]\n\n","date":"May 5, 2013 at 4:13 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32944","author":"Hugh Farey","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Thank you, Hugh.\n\n","date":"May 5, 2013 at 4:39 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32945","author":"David Mo","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"From Jull’s letter, it is interesting that they dated each graphite pellet twice. I previously thought that they had obtained two pellets from each subsample. If the pellets were only four, and not eight, then the weight is compatible with about 1 mg for pellet and it is quite possible that they dated only two quarters of the total sample.\nThe results for each of the eight measurements are known (they were published by Remi Van Haelst).\nAs to Zurich, it was Bonnet-Eymard, I think, who said that they also had kept a spare fragment, but without a proof as far as I remember.\nIn the website of ETH Zurich (the Institute were the dating had been done) there are the photos of some of the subsamples, but not all. I have tried to reconstruct the jigsaw puzzle of the three fragments that are shown for the first half of the sample but have not succeeded. Any body will try?\nhttp://archiv.ethlife.ethz.ch/e/articles/sciencelife/turin.html\nBut for Zurich there is another problem. Two unpublished sheets of data, presumably a first version of the radiocarbon results, have appeared in an Italian documentary (La Notte della Sindone, The Night of the Shroud). Some of the results for Zurich are different from those that were published in Nature. I have published an article about these data in January 2013, but it is in Italian. I have already done an English transltion and it will soon be published on the internet.\n\n","date":"May 5, 2013 at 12:21 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-32965","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"In my previous message I said: “But for Zurich there is another problem…” An English translation of my article is now online with the title: “Two sheets of data of unknown origin with presumed results of the 1988 radiocarbon dating of the Shroud of Turin”\nhttp://sindone.weebly.com/uploads/1/2/2/0/1220953/c14_unpublished_data.pdf\n\n","date":"May 8, 2013 at 1:28 pm","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-33251","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"The picture in ‘Arizona Samples of the Shroud of Turin’ posted above is certainly the same sample as Jull’s. The picture in his paper shows a 0.5 x 0.5 mm square taken from the top right hand corner of the picture. The little wiggly blue thing he identifies as wax is visible on both photos, as well as idiosyncrasies of he fibres.\n\n","date":"May 6, 2013 at 4:17 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-33022","author":"Hugh Farey","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"Looking through Dan’s list of postings…\n1) The two sides of any piece of twill do look very different, and I have no reason to suppose that Jull’s piece of Shroud was not from the original. What we tend to call the front, image side, is very ribbed and the three-one aspect is quite easy to follow, but the other side is quite flat, and even in modern twill can look very like one-one if you don’t follow each thread very carefully. Why this should be I don’t know – something to do with the rolling of the cloth around a spindle as it is woven, I should think – and means that the ‘ridge’ threads are less compressed than the others, and bulge out on one side.\n2) One should not get carried away by the peer-reviewedness of scientific papers. Many are published by quite small laboratories, or universities or other institutions with the purpose of publishing their own work. They get set up by perfectly respectable honest people, and articles submitted to them get reviewed, mostly, by members of the same institution, who are more anxious than most not to discredit themselves. Some fields of research are so specialised that there are only a few people with the technical knowledge to review a new paper sensibly, and all the papers are circulated around the same small group, who may be colleagues. This is not dishonest, although obviously it is open to outside suspicion if something extraordinary gets through. The rest of us should examine all papers, peer-reviewed or not, on their premises and their conclusions for ourselves, and not assume that being peer-reviewed is an automatic guarantee of truth. The observations of McCrone, Rogers and Jull should not be discredited solely on the grounds of being published in their own journals, nor anything in Applied Optics or Nature (for example) assumed to be God’s truth on opposite grounds.\n\n","date":"May 6, 2013 at 4:54 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-33025","author":"Hugh Farey","site":"shroudstory"},{"title":"Special Request from Hugh Farey","post":"An email from Prof. Ramsey at Oxford:\n“As far as I am aware the whole material was used for the dating here – that is what the weighed components suggest – and we don’t have any remaining sample in our archives with these sample numbers.  I think the position taken here was that we only had permission for dating and not other research – and at that time, the measurements needed as much material as possible.  It is true that it is normal practice to retain some material for further checks in routine dating and we do normally do this – so I can see that other labs may have made different decisions.”\nApparently Oxford needed at least 16mg to produce reliable results (they cut their 50mg sample into three). Strange that Tucson needed only 7mg.\n\n","date":"May 7, 2013 at 11:47 am","url":"https://shroudstory.com/2013/04/30/special-request-from-hugh-farey/","cat":"carbon_14_dating","id":"comment-33173","author":"Hugh Farey","site":"shroudstory"}]
