[{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"This is my  comment for all of the Shroud’s blogs.  What is it about the fact of the Shroud being the actual burial cloth of Jesus Christ that scares the hot poop out of people???\n\n","date":"March 29, 2014 at 3:49 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94625","author":"ekmcmahon","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"And my response is, as usual: What is it about authenticists that makes them think people who disagree with them are scared? Is there any evidence of it?\n\n","date":"March 29, 2014 at 4:31 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94641","author":"Hugh Farey","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"I think if the Shroud is ever proven authentic it means the non-believer has to concede that the Christian faith is at least based on flesh and blood and that something unique happened to Jesus. It means the Christian faith is not merely based on composite myths or outright lies.\nThis doesn’t mean a single non-believer will ever convert, but it does remove their ability to dismiss the Christian faith as irrational and founded on wishful thinking.\nIt would be the equivalent of a Bigfoot researcher finding the bones of a sasquatch in the Oregon forest. It doesn’t prove Bigfoot currently exists, but one could not then dismiss every sighting as mass delusion.\nSome folks sleep better knowing Bigfoot isn’t really there.\n\n","date":"March 29, 2014 at 4:05 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94631","author":"David Goulet","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"Good points David, although I think there is a very good historical case for the truth of Christianity. See NT Wright in particular\n\n","date":"March 30, 2014 at 1:20 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94803","author":"Thomas","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":">Darn. Stephen left out two of my favorite historical items:\n1) The Hymn of the Pearl and 2) The Mozarabic Rite.  \nThey are coming. The Hymn of the Pearl is 2nd century and the Mozarabic Rite is 6th century. As my Revised #1 post indicated, I am going to list all the “historical evidence that the Shroud existed in the thirteenth century all the way back to the first century:”\nMy first step is to show beyond any reasonable doubt that the Shroud existed well beyond the lower limit of the C-14 dating’s lower limit of 1260, and therefore the C-14 dating was wrong.\nMy second step is to show that the odds are astronomical for the Shroud to be 1st century, yet C-14 date to 1325 +/- 65, and therefore there must have been fraud involved for the Shroud’s C-14 date to not just be any old date, but the too good to be true date ~25 years before the Shroud’s historical debut at Lirey, France in the 1350s.\nMy last step will be to lay out the case for the fraud to have been perpetrated, not by the labs, but by a computer hacker, or hackers, physically accessing each AMS control console computer in the three university C-14 labs at Arizona, Zurich and Oxford, and modifying each computer’s program which received output of raw uncalibrated C-14 dates from each lab’s AMS system and replaced the Shroud’s dates with dates, which when when calibrated, would cluster around 1325 +/- 65. \nMy prime suspect is the KGB employing as agents a ring of hackers, inside or outside the three universities, since the KGB has a proven track record of using at least one such ring of hackers, the Chaos Computer Club. The USSR in the late 1980s was facing the threat of breaking up (the Berlin Wall came down in late 1989). So with its atheist ideology and huge Russian Orthodox and Roman Catholic populations, the USSR would have felt very threatened by the prospect of a 1st or early century date of the Shroud. So even though it did not believe the Shroud to be authentic, it would have wanted to `take out insurance’ that the Shroud did not return a first or early century C-14 date.   \nBut as the school year has begun, I am again working part-time as a high school relief teacher. So my time is limited, and it is going to take many months to get to the end of this multi-part series. However, unlike Dan, I am in no hurry. I am enjoying filling in the gaps in my knowledge of the historical evidence for the Shroud’s existence back to the 1st century.\n\n","date":"March 29, 2014 at 7:57 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94724","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":".Concerning your highly controversial computer hacker theory, you should at least have the moral decency to contact the labs and ask them their opinion before exposing your theory.\n\n","date":"March 30, 2014 at 2:26 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94811","author":"PHPL","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":">you should at least have the moral decency \nAd hominem noted.\n>to contact the labs and ask them their opinion before exposing your theory.\nHugh Farey has already emailed Arizona’s Dr Jull and Oxford’s Prof. Ramsey for their response to my proposal and they have, not surprisingly, rejected it, albeit with fallacious reasoning and false facts. See my post, “Were the radiocarbon dating laboratories duped by a computer hacker?: My replies to Dr. Timothy Jull and Prof. Christopher Ramsey“.\nBut they would do that even if my proposal was true, that the labs UNKNOWINGLY were victims of computer hacker(s) in their 1988 C-14 dating of the Shroud.\nMy proposal is NOT that the labs KNOW that they were victims of a computer hacking and I said in one of my comments here that they would probably be unaware of it to this day and therefore would not welcome the thought that after all these years their 1260-1390 C-14 date of the Shroud was the result of them having been hacked.\nSo I am NOT accusing the C-14 labs of fraud. My proposal is that they were the VICTIMS of fraud, committed by a computer hacker or hackers.\nWhen I have finished my multi-part series, “Were the radiocarbon dating laboratories duped by a computer hacker?: Revised,” I will have more evidence to support my proposal, when I may then call it a theory. If and when that point is reached, I have not ruled out that I may formally submit my then theory to the Directors of each of the three laboratories for their comments.\nBut even then, I expect they would reject my then theory, even if it was true. It would be a HUGE embarrassment if the C-14 labs had been hacked in their dating of the Shroud and so they would have a strong motivation to deny it and would be unlikely to cooperate with requests for information to support my proposal.\nSo all that I can do is set out the evidence for my proposal and hope that someone who was involved in, or aware of, the hackings would come forward and confirm that my proposal was true.\n\n","date":"March 30, 2014 at 3:46 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94824","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"well this seems like a ridiculous theory.\nwhat I’m much more interested in (but maybe no one else…???) is Psuedonym’s (typo or intentional name?) quote from a Wilson book about a discovery that suggests templars in the late 1200s viewed a long linen cloth with the image of a man…sounds quite Shroud like\n\n","date":"March 30, 2014 at 5:13 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94841","author":"Thomas","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"Stephen Jones’ new photo definitely bears a striking resemblance to  the face on the shroud .May be that he and Jesus are identical twins ? Who knows.\n\n","date":"March 30, 2014 at 5:31 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94848","author":"PHPL","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"At least he isn’t afraid to be identified.\n\n","date":"March 30, 2014 at 8:58 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94887","author":"David Goulet","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":">now being forced to revise his thinking after seeing emails to Hugh Farey from two of the three lab directors.\nI was not “forced”. I had already stated in a comment, before the emails from Dr Jull and Prof. Ramsey were posted, confirming that their AMS control computers had never been online, that my alternative was that each of the three computers were hacked manually. When Prof. Ramsey confirmed that the AMS control console computers were not ever online, I thanked him for that and immediately modified my proposal to my alternative manual hacking of each of the three computers.\n>Has he determined if the AMS Control Consoles at all three labs had programmable computers \nThere is no such thing as a NON-programmable computer. Prof. Ramsey confirmed that the AMS control console computers were under the control of “software,” which is just another name for a program. When I get to that part of my series I will give further evidence about this. \n[…]\n>Anyways, Stephen has provided us with some historic information to consider.\nIndeed! Even though I have only posted historical evidence from the 12th and 13th centuries, it is sufficient to establish that the Shroud existed CENTURIES before the earliest, 1260, C-14 date of the Shroud. \nThe agnostic art historian, Thomas de Wesselow, has written of only ONE of those items of historical evidence:\n“The poker-hole patterns represented in the Pray Codex drawing, first noticed in 1998, are also the FINAL NAIL IN THE COFFIN OF THE CARBON-DATING RESULT. The cloth now in Turin must be at least three centuries older than the earliest date indicated by the radiocarbon age of the sample tested – a sizeable error. The 95 per cent confidence level the laboratories cited is meaningless, except, perhaps, as a measure of scientific hubris. Physics is not the only way to date the Shroud; HISTORICAL AND ART-HISTORICAL RECORDS HAVE THEIR PART TO PLAY, as do the various indications gleaned from medical, chemical and archaeological investigations. This broad spectrum of research indicates that THE SHROUD DATES NOT FROM THE MIDDLE AGES, BUT FROM ANTIQUITY.” (de Wesselow, T., 2012, “The Sign: The Shroud of Turin and the Secret of the Resurrection,” p.182. My emphasis).\nYou yourself Dan, state on your blog’s sidebar:\n“The carbon dating, once seemingly proving it was a medieval fake, is now widely thought of as suspect and meaningless. … Christopher Ramsey, the director of the Oxford Radiocarbon Laboratory, thinks more testing is needed. So do many other scientists and archeologists. This is because there are significant scientific and non-religious reasons to doubt the validity of the tests.”\nHow come the anti-authenticists on your blog don’t take issue with that?\nAnd if the carbon dating is wrong, how come it still `hit the bull’s eye’ of 1325 +/- 65, absent fraud, either by hacker(s) or by the labs? \nAs has been pointed out by you Dan, and by others on your blog, the various other explanations for how the Shroud can be 1st century yet its C-14 date is 1325 +/- 65, don’t hold water. At best they explain why the Shroud should have C-14 dated early but not 1st century.\nDan, I am continually being defamed on your blog (the latest that I am morally indecent), for being the only pro-authenticist who is publicly facing up to the key question: “how can the Shroud be 1st century, yet its C-14 date was 1325 +/- 65, just before the Shroud’s historical debut in the 1350s?”\nThe 1st century + 16th century = 1325 +/- 65 repair theory doesn’t do that. It would be a MIRACLE, absent fraud, if the mix of 1st and 16th century linen, just happened, to produce that `bull’s eye’ date.\n>Nice new picture of Stephen.\nThanks. My apologies for not changing my 1990s photo long before now.That photo of was taken on a holiday in Melbourne in 2007, cruising down the Yarra river.\n\n","date":"March 30, 2014 at 6:08 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94857","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":">Stephen Jones’ new photo definitely bears a striking resemblance to the face on the shroud .May be that he and Jesus are identical twins ? \nDan, the Holy Spirit has been prompting me for months to request that you, as Owner and Moderator of this blog, start taking action to curb the incessant personal attacks on me, a Christian who is seeking only to serve his Lord Jesus.\nRomans 12:19 states to Christians, “Beloved, never avenge yourselves, but leave it to the wrath of God, for it is written, `Vengeance is mine, I will repay, says the Lord.’”\nThat is, the Lord Jesus will avenge the personal attacks on me by those commentators defaming me and by you allowing them to do it.\nThose commenters and you may scoff at this, but they and you have been warned and now my conscience is clear.\n\n","date":"March 30, 2014 at 6:26 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94860","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"Hi Stephen. I’m sorry if you took offense to the twin comment. Frankly, I thought you would have found it amusing; my mistake. I don’t think the personal attacks are incessant, as you say. What we will certainly be discussing is your fraud theory as it unfolds in revised form. I don’t think it will be comfortable at all times. As for Romans 12:19, I guess I interpret that a bit differently. That’s okay, though, and the warning is noted. I’m not going to pre-moderate every comment like you do. But do watch for an upcoming “Report Abuse” button on my site, maybe in April.\n\n","date":"March 30, 2014 at 8:59 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94888","author":"Dan","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"To claim Jesus will avenge verbal attacks on you, when our Lord himself never took vengeance on those that crucified him, betrays a hubris that only damages your credibility.\nYou are not the only one to whom the Holy Spirit speaks.\n\n","date":"March 30, 2014 at 9:08 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94890","author":"David Goulet","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":">Has he determined if the AMS Control Consoles at all three labs had programmable computers\nI meant to add, but I could not remember the name, that one of those listed by Harry Grove as present at Arizona’s C-14 dating of the Shroud was “Art Hatheway” who was “connected with the Arizona AMS facility”:\n“The next morning at about 8 am (6 May 1988) I arrived at the Arizona AMS facility. … I would be the only one present outside the Arizona AMS group. Doug immediately asked me to sign the following statement: “We the undersigned, understand that radiocarbon age results for the Shroud of Turin obtained from the University of Arizona AMS facility are confidential. We agree not to communicate the results to anyone-spouse, children, friends, press, etc., until that time when results are generally available to the public.” It had been signed by D J Donahue, Brad Gore, L J Toolin, P E Damon, Timothy Jull and ART HATHEWAY, all connected with the Arizona AMS facility, before I signed. My signature was followed by T W Linick and P J Sercel, also from the Arizona facility.” (Gove, H.E., , 1996, “Relic, Icon or Hoax?: Carbon Dating the Turin Shroud,” p.262. My emphasis).\nA Google search on “Art Hatheway Arizona” (without quotes) had turned up an obituary of an “Arthur Loyal Hatheway” who was “Senior Staff Engineer at the AMS Lab in the Physics Department at U of A.” and a “computer programmer”:\n“Arthur Loyal Hatheway Obituary HATHEWAY, Arthur Loyal, born in Los Angeles on March 26, 1940 to Philip and Pauline Hatheway, went suddenly to Jesus on October 11, 2008. … In 2006, Art retired from his position as Senior Staff Engineer at the AMS Lab in the Physics Department at U of A. There his skills as COMPUTER PROGRAMMER and small instrument engineer, his thorough nature and precise workmanship, his understanding of chemistry and physics, as well as his abilities to invent and mentor, WERE PUT TO GOOD USE. Art met Jesus in 1992. This new relationship changed his perspective on life …”.\nI am NOT alleging that Art Hatheway was one of the hacker, just that there was at least one member of the Arizona C-14 lab staff who was a “computer programmer” and indeed a “Senior Staff Engineer,” which is indicative of a high level of sophistication of the Arizona C-14 lab’s computers, and presumably the other C-14 labs’ computers. \nAnd that presumably a major role Senior Staff Engineer Hatheway’s role was ensuring the AMS control console computer program controlled the AMS C-14 dating process:\n“The first sample run was OX1. Then followed one of the controls. Each run consisted of a 10 second measurement of the carbon-13 current and a 50 second measurement of the carbon-14 counts. This is repeated nine more times and an average carbon-14/carbon-13 ratio calculated. ALL THIS WAS UNDER COMPUTER CONTROL and the calculations produced by THE COMPUTER were displayed on a cathode ray screen.” (Gove, 1996, p.264).\nI had originally thought that the computer which controlled the AMS dating was different from the AMS control console computer, but according to Gove’s words above, they were ONE AND THE SAME. Now a lab does not need to employ a “Senior Staff Engineer” who is also a “computer programmer” and who “put[s] to good use” those “skills,” on a computer which Prof. Ramsey gave the misleading impression was little more than a calculator:\n“The software was very simple just outputting counts of 14C and currents measured. Age calculation was done offline and could just be done with a calculator, or by a simple program into which you typed the numbers from the AMS.” (“Comment Promoted: On the Hacking Hypothesis,” March 9, 2014).\nand which led Dan to question whether it was even “programmable”. \nNow Prof. Ramsey is highly computer literate, being himself a computer programmer, as the author of “OxCal” a computer “program … intended to provide radiocarbon calibration”:\nOxCal The OxCal program is intended to provide radiocarbon calibration and … For further information contact the author: Prof. … christopher.ramsey@rlaha.ox.ac.uk.”\nSo Prof. Ramsey presumably KNOWS VERY WELL that the AMS control system computers at Arizona, Zurich and Oxford were not little more than “a calculator” but were PROGRAMMABLE computers, controlling the entire complex AMS radiocarbon dating process as well as outputting the uncalibrated C-14 dates of each sample onto their screens.\nI personally find Prof. Ramsey’s (and Dr Jull’s) defensiveness significant. \nBut again, I repeat, that I am NOT alleging that the late Art Hatheway (or Prof. Ramsey) was one of the hackers. All I am seeking to establish is that the C-14 labs’ AMS control console computers were PROGRAMMABLE. And therefore HACKABLE!\n\n","date":"March 30, 2014 at 9:23 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94892","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"This may be of interest:\n“As the Internet evolved, one of the major challenges was how to propagate the changes to the software, particularly the host software. DARPA supported UC Berkeley to investigate modifications to the Unix operating system, including incorporating TCP/IP developed at BBN. Although Berkeley later rewrote the BBN code to more efficiently fit into the Unix system and kernel, the incorporation of TCP/IP into the Unix BSD system releases proved to be a critical element in dispersion of the protocols to the research community. Much of the CS research community began to use Unix BSD for their day-to-day computing environment. Looking back, the strategy of incorporating Internet protocols into a supported operating system for the research community was one of the key elements in the successful widespread adoption of the Internet.\nOne of the more interesting challenges was the transition of the ARPANET host protocol from NCP to TCP/IP as of January 1, 1983. This was a “flag-day” style transition, requiring all hosts to convert simultaneously or be left having to communicate via rather ad-hoc mechanisms. This transition was carefully planned within the community over several years before it actually took place and went surprisingly smoothly (but resulted in a distribution of buttons saying “I survived the TCP/IP transition”).\nTCP/IP was adopted as a defense standard three years earlier in 1980. This enabled defense to begin sharing in the DARPA Internet technology base and led directly to the eventual partitioning of the military and non- military communities. By 1983, ARPANET was being used by a significant number of defense R&D and operational organizations. The transition of ARPANET from NCP to TCP/IP permitted it to be split into a MILNET supporting operational requirements and an ARPANET supporting research needs.\nThus, by 1985, Internet was already well established as a technology supporting a broad community of researchers and developers, and was beginning to be used by other communities for daily computer communications. Electronic mail was being used broadly across several communities, often with different systems, but interconnection between different mail systems was demonstrating the utility of broad based electronic communications between people.\n[…] With the exception of BITNET and USENET, these early networks (including ARPANET) were purpose-built – i.e., they were intended for, and largely restricted to, closed communities of scholars; there was hence little pressure for the individual networks to be compatible and, indeed, they largely were not. In addition, alternate technologies were being pursued in the commercial sector, including XNS from Xerox, DECNet, and IBM’s SNA.8 It remained for the British JANET (1984) and U.S. NSFNET (1985) programs to explicitly announce their intent to serve the entire higher education community, regardless of discipline. Indeed, a condition for a U.S. university to receive NSF funding for an Internet connection was that “… the connection must be made available to ALL qualified users on campus.”\n\n","date":"March 30, 2014 at 12:41 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-94929","author":"Alexander Walker","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"Dan\n>I don’t think the personal attacks are incessant, as you say.\nAs the person at the receiving end of it them, they are.\nI have already unsubscribed from receiving both posts and comments on your blog, and if the personal attacks on me continue here for much longer, I am not going to read the comments on your blog.\nIf you continue to allow personal attacks on your blog, you will continue to drive away its polite members and all you will be left with are the impolite ones, who cannot make their points without insults.\nThe choice is yours. \nStephen E. Jones\n\n","date":"March 30, 2014 at 6:28 pm","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-95003","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"I decided to Google the name which was after Art Hatheway’s on Prof. Harry Grove’s list of those present at the Arizona lab’s 6 May 1988 dating of the Shroud. It was “T. W. Linick”. I found out his name was “Timothy W. Linick”. I then discovered that he died on June 4, 1989, aged 42, a few months after the Nature paper to which he was a signatory appeared, on February 16 of that year. Moreover, it was rumoured that Linick committed suicide.\nIt may be significant that Karl Koch, a self-confessed (after was caught) hacker who had worked for the KGB, died on May 23, 1989, less than 2 weeks earlier than Linick, in what appeared to be an execution designed to look like suicide.\nI Googled the names of other signatories to the 1988 Nature paper but found no other untimely deaths. However, as the Wikipedia article on Karl Koch notes, Koch’s fellow hackers Pengo (Hans Heinrich Hübner), and Urmel (Markus Hess) also confessed that they had worked for the KGB but were not eliminated.\nWhile I do not claim that Timothy W. Linick WAS a hacker, nor that his untimely death WAS suicide, let alone an execution by the KGB designed to look like suicide, it nevertheless is worth keeping in mind as a possible piece of the jigsaw.\nThis will no doubt be dismissed as a “conspiracy theory” by those who prefer mindless slogans to thinking. But it is a FACT that the KGB did CONSPIRE with hackers, notably Karl Koch, of whose death Wikipedia notes that, “there is little evidence supporting suicide and many believe that Koch was killed in order to keep him from confessing more to the authorities”. And it is a FACT that the KGB did CONSPIRE with hacker Markus Hess whom Clifford Stoll caught.\n\n","date":"March 31, 2014 at 2:24 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-95104","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"Dan\nWhen I posted the above comment, I received for the first time (from memory) the message:\n“Your comment is awaiting moderation,” \nIs this a new policy of yours that ALL comments are going to be moderated? If so, I applaud it.\nBut if it is a retaliation by you against me, because I warned you that if the personal attacks against me continued on your blog, I would cease reading and commenting on it, then this will have been my last comment on your blog (assuming you post it).\nStephen E. Jones\n\n","date":"March 31, 2014 at 3:10 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-95115","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"No it is not a new policy. Nor is this particular moderation directed at you; it was not retaliation. I have blocked certain people in the past for various reason but never because of beliefs and ideas and never to retaliate. That is not the way I do things. \nThe reason you received the message is because your posting contained more than three outbound links. There are other reasons for automatic comment moderation as well. One person keeps using certain profanities that I don’t want in this blog. Another has a tendency to be far too insulting to others. When a comment gets blocked I may approve it, edit it, or send it back for revision. Sometimes, algorithmically, a comment looks like spam even though it is not. I carry an iPhone with me at all times and it signals me every time a comment is awaiting moderation. It is three o’clock in the morning here as I clear your comment and write this to you. Even though we disagree, your comments are always welcome here. Everything said or written about the shroud should be subject to scrutiny. That includes what I say. of course.\n\n","date":"March 31, 2014 at 3:40 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-95122","author":"Dan","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":">The reason you received the message is because your posting contained more than three outbound links. \nThanks for the clarification. I was not aware of the 3 outbound links limitation, but I will in future keep such links to 3 or less.\n>Everything said or written about the shroud should be subject to scrutiny.\nI agree about “scrutiny” but I don’t agree that it includes defamatory imputations. I stand by what I said that if you continue to allow me to be defamed on your blog, by those who don’t like their position being subject to scrutiny, without lifting a finger to protect me, then I will no longer read the comments on your blog, nor comment on it.\n\n","date":"March 31, 2014 at 5:32 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-95142","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"I have discovered what make and probably the model of the AMS control console computer was. On Googling “Linick Arizona computer” (without the quotes) I found the paper, Linick, T.W., et al. 1986, “Operation of the NSF-Arizona accelerator facility for radioisotope analysis and results from selected collaborative research projects,” Radiocarbon, Vol. 28, No. 2a, pp.522-533.\nIn it the late Dr Linick, described the computerised process that Prof. Gove wrote of Arizona lab’s AMS control console computer, and wrote that it is a “DEC computer system”:\n “The DEC computer system largely controls the cycling of isotopes, accumulation of data, and calculation of results for each 15-minute run.”\n“DEC” stands for Digital Equipment Corporation, the maker of the powerful PDP and VAX range of minicomputer which were very popular in laboratories in the 1980s. However I have been unable to discover what model it was, e,g. PDP-11, VAX-11, etc.\nGoogling “DEC” and then selecting “images,” the Arizona Labs AMS control console computer in the photo on page 176H of Prof. Gove’s book (see my latest post), looks like a DEC VT-100 terminal.\nIf that is so, and given that Arizona’s AMS system was installed in 1981, its AMS control console computer was probably a 32-bit VAX-11: \n“In 1976, DEC decided to extend the PDP-11 architecture to 32-bits while adding a complete virtual memory system to the simple paging and memory protection of the PDP-11. The result was the VAX architecture, where VAX stands for Virtual Address eXtension (from 16 to 32 bits). The first computer to use a VAX CPU was the VAX-11/780, which DEC referred to as a superminicomputer. Although it was not the first 32-bit minicomputer, the VAX-11/780’s combination of features, price, and marketing almost immediately propelled it to a leadership position in the market after it was released in 1978. VAX systems were so successful that in 1983, DEC canceled its Jupiter project, which had been intended to build a successor to the PDP-10 mainframe, and instead focused on promoting the VAX as the single computer architecture for the company.” (“Digital Equipment Corporation: VAX,” Wikipedia, 10 March 2014).\nSupporting the VAX’s success was the VT52, one of the most successful smart terminals. Building on earlier less successful models (the VT05 and VT50), the VT52 was the first terminal that did everything one might want in a single chassis. The VT52 was followed by the even more successful VT100 and its follow-ons, making DEC one of the largest terminal vendors in the industry. With the VT series, DEC could now offer a complete top-to-bottom system from computer to all peripherals, which formerly required collecting the required devices from different suppliers.\nWhatever DEC computer system it was, whether a PDP or VAX, it CERTAINLY was programmable and therefore HACKABLE!\n\n","date":"March 31, 2014 at 8:10 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-95175","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"Dan, after I posted the above (with its 6 outside links) I realised that the text beginning with “Supporting the VAX’s success … ” should have been after “for the company” and inside the Wikipedia article reference, If you delete it, and this brief message, I will post it again with the error corrected.\n\n","date":"March 31, 2014 at 8:25 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-95180","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Stephen Jones’ Revised Hacking Theory Part I is Available","post":"I should have added, “my apologies”. Delete this also if you delete my other two comments.\n\n","date":"March 31, 2014 at 8:38 am","url":"https://shroudstory.com/2014/03/29/stephen-jones-revised-hacking-theory-part-i-is-available/","cat":"carbon_14_dating","id":"comment-95188","author":"Stephen E. Jones","site":"shroudstory"}]
