[{"title":"Strangest Quote Ever on the Shroud of Turin","post":"Coincidentally, I re-read this letter to NATURE (17 October 1991, p.598) only yesterday in going through some of my science journal articles on the Shroud.\nAccording to Wikipedia, Cesare Emiliani (1922-1995) was “one of the greatest geologists and micropaleontologists of the 20th century and the founder of paleoceanography … a Renaissance man, familiar with classical literature, fluent in many languages, and a valiant opponent of dogmatic attitudes and mental rigidity wherever found. In his later years he dedicated much time to introduce a calendar reform based on the Holocene calendar (HE) concept to eliminate the BC-AD chronology gap caused by the lack of a Year Zero.” Emiliani’s eminence may be why NATURE published such a strange letter.\nEmiliani’s opening comment in his letter was: “Pierre Busson laments the various problems arising from the radiocarbon dating of the Shroud of Turin. As I see it, there is only one problem: the dating itself. The Shroud of Turin is a religious object and, as such, it should never have been subjected to scientific scrutiny.”\nThat Science-Religion (Gnostic?) ultimate duality is very common in the USA and is supported by the US Supreme Court’s extreme separation of Church and State doctrine. It is a major defensive weapon of the Naturalist (“nature is all there is”) side in the USA’s Creation-Evolution struggle and tellingly Emiliani refers to “Creationists” being “even more guilty, for they have been mixing science and religion for years …” \nThat Science-Religion duality is also, in my opinion, a major (albeit largely unrecognised) theme in the Shroud debate, with even some leading Shroud pro-authenticity advocates claiming that science can never prove the Shroud to be the burial sheet of Jesus. Yet every day individuals are imprisoned and even executed on far less Forensic Science evidence pointing uniquely to them, than the evidence of the Shroud points uniquely to Jesus.\nWe are all blind to some extent to our motives (Ps 19:12; Jer 17:9), but many (if not most) scientists in particular don’t seem to even realise the possibility that their attempts to isolate “religion” from the real world of science is actually a subconscious attempt to isolate the Christian God (who they intuitively know exists – Rom 1:18-20) from their guilty conscience. \nIn the light of his comments in his NATURE letter, Emiliani’s crusade to “eliminate … BC-AD” from the calendar seems to be just another such attempt to cover himself with a “fig leaf” from the all-seeing eye of His Creator (Gen 3:7) by writing Jesus out of the Play that He Himself wrote, starred in, and directs!\nStephen\n\n","date":"January 28, 2010 at 8:49 pm","url":"https://shroudstory.com/2010/01/28/strangest-quote-ever-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-966","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Strangest Quote Ever on the Shroud of Turin","post":"Emilani was a respected scientist with a good sense of humor, as proved by his letter to Nature where he pulls the strings of religion fundamentalists who ridiculously believe that a painted cloth woven in the middle age was the shroud of Christ.\n\n","date":"April 16, 2010 at 8:20 am","url":"https://shroudstory.com/2010/01/28/strangest-quote-ever-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-1258","author":"Giovanni Muttoni","site":"shroudstory"},{"title":"Strangest Quote Ever on the Shroud of Turin","post":">Emilani was a respected scientist … he pulls the strings of religion fundamentalists who ridiculously believe that a painted cloth woven in the middle age was the shroud of Christ.\nThere are irreligious fundamentalists too. The late paleontologist Stephen Jay Gould famously included biologist Richard Dawkins in the category of “Darwinian Fundamentalism” in the June 12, 1997 issue of The New York Review of Books. \nBut because Naturalism, the philosophy that “nature is all there is” (“Naturalism (philosophy),” Wikipedia, 14 April 2010) (i.e. there is no supernatural, including God), so dominates science and our science-based culture generally, it is invisible to those whose minds have been fully taken captive by it (Col 2:8). \nTo Metaphysical Naturalists, it is simply “ridiculous” that the Shroud of Turin even could be the burial sheet of Christ, because that would imply that there is a God who can and does supernaturally intervene in the world, and to whom they might be accountable. \nSince Naturalism is unquestionably true for fully committed Naturalists, they cannot accept that there even could be evidence, let alone seriously consider it, that the Shroud is the burial sheet of Jesus, if that implies that the Gospels are true and that He rose from the dead.\nit is sufficient therefore for Naturalists to accept the best (or least worst) Naturalistic explanation of the Shroud’s image (e.g. it is just a medieval forgery, etc), combined with personally attacking (e.g. as “religious fundamentalists,” etc) those of us whose minds have not been captured by Naturalism, and can and do accept the evidence which overwhelmingly points to the Shroud of Turin being the very burial sheet of Jesus and bearing the image of His crucified and resurrected body!  \nStephen\n\n","date":"April 16, 2010 at 7:18 pm","url":"https://shroudstory.com/2010/01/28/strangest-quote-ever-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-1261","author":"Stephen E. Jones","site":"shroudstory"}]
