[{"title":"Superparamagnetism","post":"Skurka’s own theory takes Rogers’ scientific paper one step beyond, theorizing that the act of Christ’s “resurrection to a glorified body,” physically involved some sort of what we would call today a nuclear event. And that the effect of this on the cloth would result in a skewed radiocarbon reading.\nI am supporting Skurka’s Hypothesis.\nYes, it is necessary to discard the New Testament writers opinion about the Bodily Resurrection to explain the image on the TS. I don’t have any doubt to accept that Jesus resurrected with a Glorified Body.\n\n","date":"September 24, 2014 at 5:52 am","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","id":"comment-154856","author":"Sampath Fernando","site":"shroudstory"},{"title":"Superparamagnetism","post":"Did he even read Roger’s paper?  These abstracts we’re read by someone?\n\n","date":"September 24, 2014 at 6:50 am","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","id":"comment-154892","author":"Paulette","site":"shroudstory"},{"title":"Superparamagnetism","post":"How easily a notion follows, in the mind of its originator, the road past an idea, a suggestion, a hypothesis, a theory and a fact until it reaches the status of incontrovertible proof, without even a sideways glance at any actual evidence.\n\n","date":"September 24, 2014 at 8:12 am","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","id":"comment-154961","author":"Hugh Farey","site":"shroudstory"},{"title":"Superparamagnetism","post":"Superparamagnatism? I guess it makes sense.  And at this point, since it seeks to expiate the traditional view of the NT writers, wait a minute-so Mr. Skurka’s hypothesis can said to back Docetism?  So it’s Superparamagnetistic-expiate a la Docious?  You know, the sound of it is something quite atrocious.  But if we say it loud enough….I’m sorry. I couldn’t help myself.\n\n","date":"September 24, 2014 at 8:47 am","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","id":"comment-154989","author":"Josie Tyner","site":"shroudstory"},{"title":"Superparamagnetism","post":"Nicely done, Josie. :)\n\n","date":"September 24, 2014 at 9:51 am","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","id":"comment-155026","author":"David Goulet","site":"shroudstory"},{"title":"Superparamagnetism","post":"I was fascinated to see that, according to his Abstract, Mr. Skurka has obtained a radiocarbon date far in the future – AD 2,400.  Is this theoretically  possible?. I would love to know the figures.\n\n","date":"September 24, 2014 at 12:16 pm","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","id":"comment-155097","author":"Charles Freeman","site":"shroudstory"},{"title":"Superparamagnetism","post":"Dates into the future are found when there is more C14 in a sample than there is in the atmosphere, and extrapolating the decay-function forwards in time. There is about one atom of C14 per trillion of the carbon in the atmosphere, and the half life of carbon is about 6000 years. If a sample were found to contain about two atoms of C14 per trillion of the carbon, then we might estimate its date to be about  2000AD + 6000 years = 8000 AD. If some nuclear laboratory enriched a gram or so of pure carbon so that it was all C14, and then sent it to be radiocarbon dated, it would date to about 200000AD, if the machine was capable of calculating it!\n\n","date":"September 24, 2014 at 1:32 pm","url":"https://shroudstory.com/2014/09/24/superparamagnetism/","cat":"carbon_14_dating","id":"comment-155144","author":"Hugh Farey","site":"shroudstory"}]
