[{"title":"Surely You’re Joking, Mr. Jones","post":"I rather look forward to Stephen Jones’s “Case for the Prosecution,” and hope that I may be allowed to put the “Case for the Defence.” Probably here, as he does not admit of contradictory arguments on his own site.\nHe has already attempted to sway the jury by misrepresenting Robert Hedges, one of the radiocarbon scientists. It was the opinion of the radiocarbon team that it would be so improbable for extra neutron radiation to have given a 1st century cloth exactly the date proposed by the forgery hypothesis by chance that the idea could be effectively discounted, and it was much more likely that the Shroud was, in fact, datable to the time they dertermined. Jones, blithely assuming an incontrovertible 1st century date, uses this statement to mean that, since the probability of producing a 13th century date by chance was discountable, it must have been produced deliberately. He has ignored the fact that the radiocarbon scientists were referring specifically to random neutron radiation as the cause of the discrepancy, and implies that no process at all could result in a 13th century date by chance. In saying this he ignores the work of Benford, Marino, Rogers, Villarreal and Brown, all of whom have demonstrated that interpolated weaving could have produced a 13th century date entirely fortuitously.\nDe Wesselow is quoted as making a similar argument: “If the carbon-dating error was accidental, then it is a remarkable coincidence that the result tallies so well with the date always claimed by sceptics as the Shroud’s historical debut.” But this is only one half of an opinion. The other half says: “If the carbon-dating was accurate, then it is no coincidence at all that it tallies perfectly with the first known accounts of the Shroud’s appearance.”\nJones finds a 1st century provenance for the Shroud “overwhelming.” I, on the other hand, do not. However, even if it were, in fact even if it were proved, that would not of itself be evidence of fraudulent radiocarbon dating.\nI have no doubt that Jones will quote Harry Gove and Emanuela Marinelli at length, as they detail any amount of clumsiness, miscommunication and irregularity over the taking of the radiocarbon sample, none of which I dispute. And none of which is fraud.\nI look forward to the Prosecution’s opening statement…\n\n","date":"January 10, 2014 at 1:57 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-72915","author":"Hugh Farey","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"He’s wise to qualify his ‘fraud’ charge to a softer form of ‘scientific fraud’ but it’s still, for academics, a cannon shot across the bow. I will expect the lab(s) to take serious legal action against Jones to protect their integrity. Failure to respond to this public charge would be tantamount to admitting he was right. Mr Jones best be prepared to spend some time in court where the stakes will be much greater than winning opinions on a blog.\n\n","date":"January 10, 2014 at 2:33 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-72917","author":"David Goulet","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"Yes, he needs to be careful. The radiocarbon dating labs are serious professional organisations whose prestige depends on their credibility. An accusation of fraud against any one of them or any named living individual involved in the testing might well bring Mr. Jones some unwelcome attention. In English law the onus will be on him to prove the fraud.\nAs some may remember he accused me of knowing that the Shroud was authentic but deliberately writing articles to say that it was not in order to make money. As a freelance academic whose professional life depends on me being respected as such, I assume I could have taken him to court.  If I had, he would have had to prove that I knew the Shroud to be authentic (how could he have done that?) and that I had made money from something I had written about it. As I have never had a penny paid for anything I have written about the Shroud, I think i would have won the case hands down.\nBut then the judge would have turned round and said – ‘Well, who is this Jones guy? Does anyone take him seriously? Certainly he does not seem to have many visitors to his site and is very reluctant to accept alternative points of view. So really you can’t say that your reputation has been damaged, Mr. Freeman. I will just award you £1 to make the point that he was in the wrong and issue an injunction to tell him to stop making such claims.’\nSo perhaps it would pay Mr Jones to have professional legal advice before he goes further with his series.\n\n","date":"January 11, 2014 at 6:30 am","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-73027","author":"Charles Freeman","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"Stephen Jones ; ‘All that I can do is to set out the evidence for: . . .  2) the bias and dishonesty of those involved in the dating.’ Careful careful, Mr Jones. Just check  first whether any of them are still alive.\n\n","date":"January 11, 2014 at 6:36 am","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-73029","author":"Charles Freeman","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"Professors Jull and Ramsay spring immediately to mind…\n\n","date":"January 11, 2014 at 11:16 am","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-73051","author":"Hugh Farey","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"Jones should yank his posting right away.  Besides, it is in poor taste.\n\n","date":"January 11, 2014 at 7:47 am","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-73032","author":"Paulette","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"Agreed, Paulette, especially as the issues over the carbon-dating have already been explored in depth over 25 years. What is this series of articles going to add and what is his agenda/ audience anyway?\nI often feel that Mr. Jones might do well to take complete break from the Shroud and develop some other interests!\n\n","date":"January 11, 2014 at 8:13 am","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-73036","author":"Charles Freeman","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"So, Dan, do you think there was fraud?\n\n","date":"January 11, 2014 at 11:29 am","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-73053","author":"Paulette","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"No.\n\n","date":"January 11, 2014 at 1:14 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-73061","author":"Dan","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"The mistakes in the 1988 carbon dating started in Turin when Cardinal Anastasio Ballestrero, O.C.D., supposedly influenced by the Carmelite way of thinking — there are no material supports — left everything in the hands of Professors Giovanni Riggi and Luigi Gonella. There is evidence to support this allegation, and that is a photograph where the prelate appears leaning over the Shroud, published in one of the older issues of the BSTS newsletter.\nTo make matters worse, the protocols prepared by Professor Carlos Chagas were ignored and the rest of the story is known to everyone in the realm of Shroud studies.\nCardinal Ballestrero did give an interview to a Carmelite magazine shortly before he died, saying that he had been manipulated. What did he mean by that?\n\n","date":"January 11, 2014 at 12:56 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-73058","author":"Louis","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"From my reading of the interview, it does not seem to me that Ballestrero said to have been manipulated. Of course he said that there had been pressures (among others from sindonological circles) aiming at performing the radiocarbon dating (as is well known), but this does not imply that he had been manipulated. At any rate, here is the text of the interview (in Italian) if you can manage to understand it with the help of an automatic translation.\nhttp://www.mondosindone.com/Site/documenti/DSS001_10%20-%20intervista%20Ballestrero.pdf\nI have the issue of the magazine and the above text online seems to be adherent to the original. There may be some slight error in the transcription, for example “con più con intendimenti devozionali” (p. 21) has to be corrected to “non più con …” (no longer with). At the end of the previous page the sentence “Penso sia indiscutibile” has the “indiscutibile” in bold type, not so in the original. This sentence was in answer to a question about any intervention of freemasonry, but I have little doubt that there must have been a misunderstanding with the interviewer. In his answer Ballestrero does not mention freemasonry.\n\n","date":"January 11, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-73074","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"I read the interview years ago. Do you have an explanation for why Cardinal Ballestrero changed his mind?\n\n","date":"January 11, 2014 at 6:00 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-73087","author":"Louis","site":"shroudstory"},{"title":"Surely You’re Joking, Mr. Jones","post":"I don’t know. But I would think that Ballestrero had never explicitly endorsed a fake Shroud. In 1988 he had to announce the results of the laboratories, what else could he do?\n\n","date":"January 11, 2014 at 8:13 pm","url":"https://shroudstory.com/2014/01/10/surely-youre-joking-mr-jones/","cat":"carbon_14_dating","id":"comment-73102","author":"Gian Marco Rinaldi","site":"shroudstory"}]
