[{"title":"And then, too, we have two comments from Daveb of Wellington","post":"On paints, gum, dyes and patches. I’m detecting considerable inconsistency of thought surrounding this contentious issue. Judging from what I can understand of the ‘patch hypothesis,’ a small section of the shroud had become so threadbare that fewer than one quarter of it survived. Into this was woven, invisibly even under magnification, replacement threads of a different colour. Although the interweaving was invisible, the difference in colour was apparent, so a water soluble pigment, combined with a water soluble plant gum for adhesion, was smeared over the cloth to make the new area match the old perfectly. If this description is incorrect, I hope one of the exponents of the ‘patch hypothesis’ will correct it.\nAs it is, however, I’m surprised that even under close scrutiny, closer perhaps even than that of Flury-Lemburg, no evidence of the interwoven threads can be seen in the area immediately adjacent to the sample excision. I infer that the patching must have been confined to the 7mm or so closest to the side-strip. I consider that curious.\nNow for the paint. Rogers uses the word dye, which confused me for a while. A dye in its ordinary meaning is deeply absorbed into the structure of its substrate, and does not form a ‘coating’ and does not need a ‘gum.’ It is not affected by water, sweat, etc. A water-soluble paint is rather an odd choice to use to colour a corner of the shroud which is heavily handled. I consider that curious.\nIn a twill cloth, a patch smeared with thick paint has two distinct sides. Every thread is three-quarters painted and one quarter unpainted on one side, and three quarters unpainted and one quarter painted on the other side. Although we cannot see all around Thread No. 7 in John Brown’s photograph, what we can see does not conform easily to this description. I consider that curious.\nThere is a relevant corollary, albeit wholly unconnected to any ‘patch.’ Flury-Lemburg reproduces a photo (MECH16 in http://www.shroud.com/mechthild.htm) which shows the shroud lying image-down, the dorsal foot end, with the image side folded back over it. The difference in colour is staggering; the whole surface of the image side appears to be deeply stained. Even allowing for exaggerated contrast (not a feature of her other photo), there is something to be explained here.\n\n","date":"October 3, 2013 at 9:42 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46067","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Good questions Hugh\nI’ll try to answer as  soon as possible (probably next Sunday).\nBut I don’t understand what follows:\n“… Although we cannot see all around Thread No. 7 in John Brown’s photograph, what we can see does not conform easily to this description. I consider that curious.”\nCan you explain why what you see does not conform easily to your description of the process (which is true)\n\n","date":"October 3, 2013 at 2:50 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46080","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"I want to see evidence that the underside of the thread is mostly white with little brown patches, just as we can see that the top is mostly brown with little white patches. I think we can see enough of the side of the thread to hope that that would be partially visible, but it really looks as if the whole thread is brown, with just those two little white bits we see in the photo.\n\n","date":"October 3, 2013 at 5:11 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46092","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"It is not that easy to claim anything — on both sides. Read the book “The Shroud. The 2000-year-old mystery solved”, where the author wants to know why the big holes were left as they were.\n\n","date":"October 3, 2013 at 9:47 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46068","author":"Louis","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Good question. The patching of the “burn holes” was extraordinarily incompetent. It is difficult to see this from an ordinary photo unless you look carefully, but on the X-rays you can see how badly the patches cover the holes, in many cases leaving an area of exposed hole not covered at all. From top to bottom there are four sets of four holes arranged in pairs. Of the 16 holes, only 6 are completely covered. The sides of the patches are usually folded underneath by 1cm or so for neatness, but there are 7 instances where they have been so badly placed that they couldn’t do that without leaving too much exposed hole. It’s amazing that nobody supervised a better job.\n\n","date":"October 3, 2013 at 1:38 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46075","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"One wonders whether the people who supervised the job did not find a suitable piece of cloth for the patches. Whatever the case, IW raised a good question.\n\n","date":"October 3, 2013 at 2:01 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46079","author":"Louis","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"So who did the invisible weave? Pricess Clothilde of Savoy around 1868; Or as commissioned by Margaret of Austria, Duchess of Savoy at some time during 1508-1530, as asserted by Marino & Benford? \nConcerning Hugh’s comment on patching of the 1534 burn-holes, see: “Report of Poor Clare Nuns of Chambery” from book, written it seems in 1591, and printed in 1891, found at:\nhttp://www.shroud.it/CLARES.PDF   (Italian Shroud site, report in English, PDF is “secured”, can’t use copy & paste.)\n\n","date":"October 3, 2013 at 4:21 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46084","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"We don’t know. It may be either of them, or perhaps somebody else. The most important thing is that the invisible mending has been performed on the Shroud, less who has done it. However, the later date the smaller number of contaminants is required to shift the datings from 1st to 13th-14th century. If this had been performed between 1700-1900 the amount needed is 65 %, if in 1532, the amount is 75 % or so.\n\n","date":"October 3, 2013 at 4:28 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46085","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"A few basics of carbon-dating:\nThe basic equation is the law of exponential decay, basing on following differential equation:\ndN(t)/dt =-aN(t)\nwhere a & N are some constans. Solving it (it is one of the first differntial equations every student gets familiar with) we obtain:\nN(t)=N0 exp[-at]\nwhere N0 is the initial value, and a =1/8270 years (the halflife of carbon dating is 5370 years, thus 5730*ln(2)=8270 years.\nIn order to calculate the amount of contaminants (described here as x)  to shift the dates from time t1 to time t2 , we must solve the following linear equation:\n(1-x)*exp[-t1/8270]+x*exp[-t3/8270]=exp[-t2/8270].\nwhere t3 is the time where contaminants were added (for simplicitywe take the assumption that all were added at a single time:\nThe solution is:\nx= (exp[-t2/8270]- exp[-t1/8270])/(exp[-t3/8270]-exp[-t1/8270])\nThus we have one equation, but TWO parameters: t3, and x. Manipulating them we can change either x or t3\n* expressed in years BP, the callibration curve from years BP to BC/AD is available here:\nhttp://depts.washington.edu/qil/datasets/uwten98_14c.txt\nNote that the curve is not monotonic.\n\n","date":"October 3, 2013 at 4:43 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46086","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Correction: 5730/ln(2)=8270 years. \n2^(-t/5730 years)= exp[- (ln(2)*t/5730 years)=exp[-t/8270 years]\ne=2.71828…\n\n","date":"October 3, 2013 at 4:51 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46087","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Alternatively, we can visit http://dwb4.unl.edu/Chem/CHEM869Z/CHEM869ZLinks/www.all.mq.edu.au/online/edu/egypt/carbdate.htm, which does all the fiddly stuff for you so you can concentrate on percentages.\n\n","date":"October 3, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46090","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Thanks, O.K./Hugh, I actually understand all that stuff quite well, as I once had more mathematics than any one civilized human being ought, but am now a little rusty.  Query: I’m under the impression that the simple inverse exponential D.E. doesn’t tell the whole story because of sporadic changes in atmospheric C-14, e.g. nuclear bomb tests, sunspot and cosmic activity, so that a specific calibration curve is also required, or is that not the case?\n\n","date":"October 3, 2013 at 5:35 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46095","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Yes indeed it is, and to be fair to you I don’t know if the calculator I posted takes that into account. On the other hand I didn’t understand your table at all. What on earth does Delta 14C per mil actually mean? And how does the calendar year 1945 correspond to a 14C age BP of 190 years? It doesn’t really matter, as Christopher Ramsay and his team have produced the wonderful OxCal (easily found on Google), which produces fully calibrated results from a BP date, deriving its accuracy from the table you quote as well as several others. Using such a program, however, tends to improve the precision of the earlier calculator rather than alter its results.\n\n","date":"October 3, 2013 at 6:13 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46097","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Except for Princess Clothilde and the Poor Clare nuns, we do not know who else may have handled the Shroud for any invisible weaving, mending and so on. Who knows what may have gone unrecorded?\n\n","date":"October 3, 2013 at 4:56 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46088","author":"Louis","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"The other candidate is Blessed Sebastian Valfrè who performed some repairs in 1694.\n\n","date":"October 3, 2013 at 5:02 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46089","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Yes, that’s correct, I had forgotten about him, but the question is if there were other people who made repairs and whose work was not recorded.\n\n","date":"October 3, 2013 at 7:01 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46100","author":"Louis","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Blessed Sebastian Valfrè only made very coarse repairs (that still can be SEEN in the shroud). Historically and metrologically speaking, the best candidate for the INVISIBLE mending(s) is definitely Princess Clothilde (then with or without the help of the Master of upholstery in the Royal court of Savoy). It/they would perfectly fit with a 66% contaminant amount.\n\n","date":"October 4, 2013 at 6:01 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46122","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"\nHugh Farey :\nAlternatively, we can visit http://dwb4.unl.edu/Chem/CHEM869Z/CHEM869ZLinks/www.all.mq.edu.au/online/edu/egypt/carbdate.htm, which does all the fiddly stuff for you so you can concentrate on percentages.\n\nThis is something a little bit different than what I presented. The interpretation of those percentages is DIFFERENT than what I marked as X. And also DIFFERENT form 2 % about which Jackson speaks in his paper: http://www.shroud.com/pdfs/jackson.pdf\nHowever the three things are frequently confused.\n\n","date":"October 3, 2013 at 5:12 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46093","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"I don’t know how Jackson derived his 2%, or what it really refers to. “Only a 2% carbon contamination relative to the overall carbon in the sample would be required to move a first century date of the Shroud textile to the 14th century.”\nWell, a 50mg sample of linen contains roughly 22mg of carbon. If only 78% of this sample’s original C14 remains, the sample is about 2050 years old. If 80% of this sample’s original C14 remains (a 2% difference), the sample is about 1850 years old. So that can’t be it.\nIf 0.44mg of modern carbon was simply added to the shroud (2% more than the original amount), then 98% of the shroud’s carbon would be old, and 2% would be modern. This is insufficient to change the apparent date of the shroud by more than a few years. So that can’t be it either.\nAnyone got any better ideas?\n\n","date":"October 3, 2013 at 6:56 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46099","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"I have seen tables referring to the effects of contamination in which a small amount of contamination can affect radiocarbon dating substantially but the ones I saw were only relevant for much older material, up to 50,000 years old, and showed no effect for more recent dates.\n Perhaps Jackson saw different tables – from the ones I saw it would be impossible to extrapolate their findings to cover a cloth only 2,000 or less years old because they were specific only to much older materials. I am sure that Jackson, if he reads this, can confirm his original source.\n\n","date":"October 4, 2013 at 4:54 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46113","author":"Charles Freeman","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"To fill out my reply no.19, I came across a 1966 study – googling ‘effects of contamination on radiocarbon dating’ will doubtless bring up more recent work- that shows that if you have material whose ‘true’ age is 900 BP and ‘contaminate’ it with fifty per cent modern carbon, then the resulting date  is 440 BP, in other words you get a date roughly half way in between as one might expect. However, suppose you have material whose ‘true’ age is 30,000 BP and then ‘contaminate’ with fifty per cent modern carbon, the date comes out at 5,400 BP, not the c. 15,000 BP you might expect. So when people quote the effects of contamination on radiocarbon dates, it is essential that you know what dating period they are working in.The effects are enormous for older material but not for more recent materials.\n\n","date":"October 4, 2013 at 5:10 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46114","author":"Charles Freeman","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"\ndaveb of wellington nz :\nThanks, O.K./Hugh, I actually understand all that stuff quite well, as I once had more mathematics than any one civilized human being ought, but am now a little rusty.  Query: I’m under the impression that the simple inverse exponential D.E. doesn’t tell the whole story because of sporadic changes in atmospheric C-14, e.g. nuclear bomb tests, sunspot and cosmic activity, so that a specific calibration curve is also required, or is that not the case?\n\nYes, you should use years BP. Here you have the curve: http://depts.washington.edu/qil/datasets/uwten98_14c.txt\n\n","date":"October 3, 2013 at 5:42 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46096","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"I’ve been somewhat out of commission for a few days dealing with a sick dog.  I was preparing a posting consisting of various responses made at the “Shreds of Evidence” posting of 23 September, which overlaps somewhat with this one.  I was almost done when I somehow managed to lose all of the text of the posting.  I’m not in the mood to try and reconstruct tonight.  I’m going to be out of town this weekend.  I might try to start to reconstruct tomorrow night and finish early next week.\n\n","date":"October 3, 2013 at 9:39 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46104","author":"jmarino240","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"\nHugh Farey :\nI don’t know how Jackson derived his 2%, or what it really refers to. “Only a 2% carbon contamination relative to the overall carbon in the sample would be required to move a first century date of the Shroud textile to the 14th century.”\nWell, a 50mg sample of linen contains roughly 22mg of carbon. If only 78% of this sample’s original C14 remains, the sample is about 2050 years old. If 80% of this sample’s original C14 remains (a 2% difference), the sample is about 1850 years old. So that can’t be it.\nIf 0.44mg of modern carbon was simply added to the shroud (2% more than the original amount), then 98% of the shroud’s carbon would be old, and 2% would be modern. This is insufficient to change the apparent date of the shroud by more than a few years. So that can’t be it either.\nAnyone got any better ideas?\n\nHugh I’ll try to explain it to you.\nThe Shroud was dated to 1260-1390, that is 691 years BP. The carbon dated to 691 years BP has 92 % of the carbon “in the present moment” (that is year 1950). \nThe year 25 AD is equivalent of 1983 BP. It has 79 % of present-day carbon.\nThe year 1532 AD has around 96 % of present day carbon.\nLet’s take the Jackson’s 2 % at face value. But this is not old vs new ratio (which I marked as X) but ADDITIONAL carbon absorbed in 1532 or so, from carbon monoxide. That means the Shroud has 102 % of initial carbon.\nIt is easy to calculate now that carbon monoxide has C12/C14 ratio 8 times HIGHER than average in nature. THIS IS THE BASIS OF JACKSON’S HYPOTHESIS, which he describes in his paper. \nThe percentages means THREE DIFFERENT THINGS:\n1.) The old vs new ratio (assuming contamination has average C12/C14 ratio of its epoch). This is the 65-75 % I calculated.\n2.) The remaining (non-decayed) C14. This is 96 % for year 1532, 79 % for year 25 AD and so on.\n3.) Addittional carbon absorbed from atmospheric carbon-monoxide. This is Jackson’s 2 %\nHowever, as I said, the three things are frequently confused.\n\n","date":"October 4, 2013 at 5:38 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46118","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Of course C14/C12 ratio.\n\n","date":"October 4, 2013 at 5:39 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46119","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"It should be mentioned that Jackson provided Ramsey with his linen samples contaminated with the supposed carbon monoxide and the results of measurement were absolutely null. See from Ramsey note of March 2008:\nhttp://c14.arch.ox.ac.uk/embed.php?File=shroud.html\n“So far the linen samples have been subjected to normal conditions (but with very high concentrations of carbon monoxide). These initial tests show no significant reaction – even though the sensitivity of the measurements is sufficient to detect contamination that would offset the age by less than a single year. This is to be expected and essentially confirms why this sort of contamination has not been considered a serious issue before.”\nSubsequently there has been no news that Jackson succeeded in enriching samples with C14 according to his theory.\nI add that there is no rationale for supposing that the carbon atoms in the Chambéry chapel during the fire were enriched in the 14 isotope. Indeed, if the smoke came from rather old wood, the carbon atoms might have had slightly less isotope 14 with respect to the contemporaneous atmosphere.\nAs to the amount of the supposed contamination, for shifting the age from 30 AD to 1300 AD, in round numbers 500 atoms of 1532 carbon have to be added to every 100 original atoms.\n\n","date":"October 4, 2013 at 10:19 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46146","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"\nO.K. :\nIt is easy to calculate now that carbon monoxide has C12/C14 ratio 8 times HIGHER than average in nature. THIS IS THE BASIS OF JACKSON’S HYPOTHESIS, which he describes in his paper.\n\nThe proper equation is:\n100*0.79+Y*2*0.96=102*0.92\nWhere Y is C14/C12 ratio for carbon monoxide compared to average in nature.\nthus:\nY =(102*0.92-100*0.79)/(2*0.96) =7.85\n\n","date":"October 4, 2013 at 5:51 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46121","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Brilliant. Thanks OK; I misunderstood Jackson’s second paragraph. He’s a scientist I respect, so I knew there would be a sensible explanation. On a similar but irrelevant theme, I believe most marine carbon dates are also notoriously out of kilter with terrestrial ones because of the different uptake of C14 in a marine environment.\nBack on the shroud, I can see that it was a sensible experiment to attempt to “contaminate” modern cloth and observe if there was a change in apparent date. It is significant, however, that no such contamination was achieved.\n\n","date":"October 4, 2013 at 7:43 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46134","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Just in case O.K. could miss it: on October 4, 2013 at 6:01 am, #17, I wrote:\nBlessed Sebastian Valfrè only made very coarse repairs (that still can be SEEN in the shroud). Historically and metrologically speaking, the best candidate for the INVISIBLE mending(s) is definitely Princess Clothilde (then with or without the help of the Master of upholstery in the Royal court of Savoy). It/they would perfectly fit with a 66% contaminant amount.\n\n","date":"October 4, 2013 at 6:05 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46123","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Hi, Max.\nI didn’t understand how  66% contamination from additional material added in the 17th century account for a 14th century dating of a 1st century artefact. Could you walk me through that calculation, please?\n\n","date":"October 4, 2013 at 8:48 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46141","author":"pakeha","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Pick me! Pick me!\n1950 is called “the present” by radiocarbon boffins. The year 50 (1st century) is 1900 years BP, and the year 1650 (17th century) is 300 years BP.\nMy calculator (http://dwb4.unl.edu/Chem/CHEM869Z/CHEM869ZLinks/www.all.mq.edu.au/online/edu/egypt/carbdate.htm) tells me that after 1900 BP there is 79.466% of the original C14 left, and after 300 BP there is 96.436% left.\nIf 34% of the shroud is 1st century, and 66% is 17th century, then the overall percentage of C14 compared to the present day percentage is 90.6662%.\nThis corresponds (my calculator tells me) to a date of 810 BP, or the calendar year 1140 AD.\nI’m sorry, Max, but we’ll need a lot more contamination than that to make a 1st century cloth appear 14th century.\n\n","date":"October 4, 2013 at 10:43 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46149","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Hi Pakeha,\nSee my comments #35 & 36.\n\n","date":"October 4, 2013 at 12:20 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46156","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"BTW, the hypothetical contamination date was not the 17th c. CE but the 19th c. CE (1868 CE or 82 BP)\n\n","date":"October 4, 2013 at 12:22 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46157","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"See my unpublished 2007 paper in French (excerpts on his vey blog): LINCEUL DE TURIN : FAUSSE RELIQUE OU FAUSSE DATATION Carbone 14 ?\n\n","date":"October 4, 2013 at 6:19 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46124","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Besides, the use of detergent and/or employ of ancient soap formulae can skew the C14 dating as far as linen fabrics are concerned.\n\n","date":"October 4, 2013 at 8:27 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46139","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"If the ancient soap contained limestone or chalk, it could make the fabric appear older, assuming that the laboratory preparation didn’t remove all trace of it. If the fabric was washed in modern soap, it could make the fabric appear younger, again assuming it wasn’t removed in the cleaning process.\n\n","date":"October 4, 2013 at 10:29 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46147","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"As far as the TS C14 is concerned:\n1/ Animal and/or wood ashes mixed with living water (through an  evaporation-concentration process that occurred in the 1st c. CE) could make it appear younger in the 20th c. CE…\n2/ For a 1st c. CE linen cloth to appear 1260-1390 CE (690-560 BP), it needs a 66% contamination (according to the Director of an American radiocarbon lab + John Jackson) or only 50% (according to Pr Evin)\n\n","date":"October 4, 2013 at 12:10 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46154","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"In case number 1, contamination is at structure level and just cannot be eliminated.\n\n","date":"October 4, 2013 at 12:15 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46155","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"\nHugh Farey :\nPick me! Pick me!\n1950 is called “the present” by radiocarbon boffins. The year 50 (1st century) is 1900 years BP, and the year 1650 (17th century) is 300 years BP.\nMy calculator (http://dwb4.unl.edu/Chem/CHEM869Z/CHEM869ZLinks/www.all.mq.edu.au/online/edu/egypt/carbdate.htm) tells me that after 1900 BP there is 79.466% of the original C14 left, and after 300 BP there is 96.436% left.\nIf 34% of the shroud is 1st century, and 66% is 17th century, then the overall percentage of C14 compared to the present day percentage is 90.6662%.\nThis corresponds (my calculator tells me) to a date of 810 BP, or the calendar year 1140 AD.\nI’m sorry, Max, but we’ll need a lot more contamination than that to make a 1st century cloth appear 14th century.\n\nWrong, Hugh. Your claculator does not convert years BP (which in strict sense, are not difference between date1 and date2 !!!) into years AD/BC. Use data from here:\nhttp://depts.washington.edu/qil/datasets/uwten98_14c.txt\nFor example:\nBy definition:\n1950 AD || 0 years BP\nthen:\n1945 AD || 190 years BP\n1865 AD || 117 years BP\n1795 AD || 201 years BP\n1695 AD || 115 years BP\n1535 AD || 301 years BP\n1355 AD || 617 years BP\n35 AD     || 1940 years BP\n25 AD     ||  1983 years BP\nRemember, the level of C14 in enviroment changes with time, so actually the years BP have little in common with calendar years!!!\nResults for Damon et al:\nArizona 646 years BP\nOxford 750 years BP\nZurich 676 years BP\nUnweighted mean 691 years BP\n\n","date":"October 4, 2013 at 1:47 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46168","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Calculating this we have:\n|| Original date of the Shroud || Date of contamination || Result of measurement || X (new/old)\n|| 1983 BP                              ||  117 BP                       || 691 BP                          || 66 %\n|| 1983 BP                              ||  301 BP                       || 691 BP                          || 75 %\n|| 1983 BP                              ||  301 BP                       || 750 BP                          || 71 %\n|| 1983 BP                              ||  117 BP                       || 750 BP                          ||  64 %\nI don’t know where those 50 % quoted by Evin come from -probably from manipulating the boundaries (taking higher margin for original date of the Shroud, and the lowest possible margin for actual results).\n\n","date":"October 4, 2013 at 1:55 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46169","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"And one another thing. The actual results for Damon et all were  1273-1288 AD at 68 % confidence level, and 1262 – 1312, 1353 – 1384 AD  at 95 % confidence level. The double interval comes from the fact, that the callibration curve is not monotonic, so multiple solutions are possible!\nSee http://www.shroud.com/nature.htm\n\n","date":"October 4, 2013 at 1:59 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46170","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Well, fair enough as far as it goes. I shall recalibrate my own figures using your table (Stuiver 1998) and the online calculator to get the percentage of C14 from the BP date.\nFrom Stuiver The year 25 (1st century) is 1983 years BP, and the year 1650 (17th century) is 333 years BP.\nFrom the calculator (http://dwb4.unl.edu/Chem/CHEM869Z/CHEM869ZLinks/www.all.mq.edu.au/online/edu/egypt/carbdate.htm), after 1983 BP there is 78.672% of the original C14 left, and after 333 BP there is 96.052% left.\nIf 34% of the shroud is 1st century, and 66% is 17th century, then the overall percentage of C14 compared to the present day percentage is 90.1428%.\nThis corresponds (my calculator tells me) to a date of 860 BP, which the Stuiver table tells me corresponds to the calendar year 1195 AD. This is 50 years later than my earlier date, but Max will still need quite a bit more contamination from the 17th century to achieve his 14th century appearance.\nHow does that seem, OK? Does it make better sense?\n\n","date":"October 4, 2013 at 3:27 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46180","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"And suddenly I note that Max is saying the contamination was 19th century, not 17th. I won’t bore our readers with the calculation all over again, but the apparent age of the shroud if it is really a 33% 1st century cloth contaminated with 66% 19th century reweaving is about 1290 AD. I suppose that’s close enough to the 14th century.\n\n","date":"October 4, 2013 at 3:35 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46182","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"There appears to be some confusion as to whether repair was 19th or 17th century:\nMPH at #29: “Historically and metrologically speaking, the best candidate for the INVISIBLE mending(s) is definitely Princess Clothilde (then with or without the help of the Master of upholstery in the Royal court of Savoy). It/they would perfectly fit with a 66% contaminant amount.”\nHugh F at #31: “If 34% of the shroud is 1st century, and 66% is 17th century, then the overall percentage of C14 compared to the present day percentage is 90.6662%. … I’m sorry, Max, but we’ll need a lot more contamination than that to make a 1st century cloth appear 14th century.” \nWiki extract on Princess Clotilde of Savoy: “Maria Clotilde of Savoy (Ludovica Teresa Maria Clotilde; 2 March 1843 – 25 June 1911) was born in Turin to Vittorio Emanuele II, later King of Italy and his first wife Adelaide of Austria. She was the wife of Napoléon Joseph Charles Paul Bonaparte.”\nI assume this is the Princess Clotilde referred to by Max; It fits the 1868 date when she would have been aged ~25.  Conclude that if it were Princess Clotilde, repair would have been done in 19th century, not 17th century.\n\n","date":"October 4, 2013 at 3:34 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46181","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Yes, my mistake. I was following pakeha’s post #30. I’ve corrected my calculation above.\n\n","date":"October 4, 2013 at 3:38 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46183","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"\nHugh Farey :\nHow does that seem, OK? Does it make better sense?\n\nHugh, I did all the calculations at #40. Analyzing Stuiver you can see that there are sometimes very steep changes in years BP every 10 years. For example:\n1805 AD || 159 years BP\n1795 AD || 201 years BP\n1675 AD || 172 years BP\n1665 AD || 209 years BP\nand so on. Curiously, the dates 1865 and 1695 are almost the same.\n1865 AD || 117 years BP\n1695 AD || 115 years BP\nThat’s why Wölfli  joked that his step-mother’s (or mother in law’s) 50-years old napkin case appeared to be 350 years old.\n\n","date":"October 4, 2013 at 4:07 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46184","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Sunspot activity cycle is 11 years. I wonder if that’s a contributing reason. Maunder Minimum 1650-1700 contributed to Little Ice Age; Activity picked up in 1750; cycles clearly vary in maximum intensity, there seems to be another periodic component; significant maxima occured 1840, 1850; graphed but not tabulated that I could find.\n\n","date":"October 4, 2013 at 4:58 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46188","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"\ndaveb of wellington nz :\nThere appears to be some confusion as to whether repair was 19th or 17th century:\nMPH at #29: “Historically and metrologically speaking, the best candidate for the INVISIBLE mending(s) is definitely Princess Clothilde (then with or without the help of the Master of upholstery in the Royal court of Savoy). It/they would perfectly fit with a 66% contaminant amount.”\nHugh F at #31: “If 34% of the shroud is 1st century, and 66% is 17th century, then the overall percentage of C14 compared to the present day percentage is 90.6662%. … I’m sorry, Max, but we’ll need a lot more contamination than that to make a 1st century cloth appear 14th century.”\nWiki extract on Princess Clotilde of Savoy: “Maria Clotilde of Savoy (Ludovica Teresa Maria Clotilde; 2 March 1843 – 25 June 1911) was born in Turin to Vittorio Emanuele II, later King of Italy and his first wife Adelaide of Austria. She was the wife of Napoléon Joseph Charles Paul Bonaparte.”\nI assume this is the Princess Clotilde referred to by Max; It fits the 1868 date when she would have been aged ~25.  Conclude that if it were Princess Clotilde, repair would have been done in 19th century, not 17th century.\n\nDave: See my posts #39,#40, #41, #46 to avoid confusion. Duches Clothilde performed repairs in 1868, however the equivalent radiocarbon date is almost the same as equivalent radiocarbon date of 1694, when Blessed Sebastian Valfrè was performing his repairs on the Shroud.\nNow there is one VERY IMPORTANT clue that the Duchess may be responsible for invisible reweave.\nFrom:\nhttp://www.shroud.com/pdfs/chronology.pdf (read this paper, its really worthy of it)\n“Entry: #17\nDate: 1996\nData Category: Evidence of anomalous nature of C-14 corner and C-14 aspects\nEvidence: even though Riggi had given assurances that the excised C-14 samples given to the labs were free of foreign threads, The University of Arizona, one of the laboratories that performed the Shroud C-14 dating, documented BOTH RED SILK AND BLUE SATIN IN ITS SAMPLE.\nSource: Petrosillo, Orazio and Marinelli, Emanuela. The Enigma of the Shroud: A Challenge to Science, San Gwann, Malta: Publishers Enterprises Group, 1996, pg 86”\nAccording to Wilson’s 1998 “Blood and the Shroud” (see Figure 20 in Chapter 13, that is diagram of carbon-dating sample, and the year 1868 in the chronology of the Shroud at the end of the book, as I have polish edition I cannot give exact pages), the Duchess changed SILK coating of the Shroud, and added BLUE frame to it. At the end of the C-14 sample there was a stitch made by her which was removed.\n\n","date":"October 4, 2013 at 5:00 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46189","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Thank you O.K. to finally recognize invisible mending(s) by the Duchess/Princess Clothilde of Savoy-Bonaparte could be one of the two-three best avenues (+ 1st c. CE Judean purifying and drying ritual = use of a watery solution made from animal and/or wood ashes) as far as the skewing of the TS C14 dating is concerned. This is the whole core of my unpublished 2007-2008 paper, FAUX LINCEUL OU BIEN FAUSSE DATATION CARBONE 14 ?\n\n","date":"October 5, 2013 at 6:28 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46217","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Thanks, O.K. That looks like a mighty document, which will require close study.\n\n","date":"October 4, 2013 at 6:20 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46192","author":"daveb of wellington nz","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"O.K. thank you again to take up my thread about Wölfli joking about  his ‘mother in law’s’ 50-years old tablecloth (as far as I can remember, I first wrongly wrote “napkin”) case appeared to be 350 years old.\n\n","date":"October 5, 2013 at 6:38 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46218","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Typo: linen tablecloth\n\n","date":"October 5, 2013 at 6:40 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46219","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"– I probably missed something (above) dealing with the following — but Michael Ehrlich, head man at “Without a Trace,” told me on the phone that French Weaving required using only thread from the original cloth (taken from less noticeable areas) to do the reweave.  If I understood that correctly, French Weaving should have little (if any) effect on the C14 date.\n\n","date":"October 7, 2013 at 11:26 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46377","author":"Richard Savage","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Richard, re the invisible “French in/re-weaving” technique, see a large excerpt from my paper in French on this very blog…\n\n","date":"October 7, 2013 at 3:35 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46390","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Sorry Max.  I can’t seem to find it…\n\n","date":"October 7, 2013 at 4:12 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46392","author":"Richard Savage","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"\nRichard Savage :\n– I probably missed something (above) dealing with the following — but Michael Ehrlich, head man at “Without a Trace,” told me on the phone that French Weaving required using only thread from the original cloth (taken from less noticeable areas) to do the reweave.  If I understood that correctly, French Weaving should have little (if any) effect on the C14 date.\n\nThe point is that the threads should resemble the original as much as it is possible -so the best are taken from the same cloth. But this is not an option in case of the Shroud.\n\n","date":"October 7, 2013 at 4:28 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46393","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Although invisible interweaving is more or less invisible to the naked eye, under a lens you can clearly see where the new threads run alongside the old in order to integrate the new section into the old cloth. On the SSG site there are very clear photographs of the corner area where the sample has been cut away, and of the riserva section of the C14 sample itself. There are also the Schwortz photos of the unused Arizona portion. I have traced every single thread in all three of these photos, and there is no place where any interweaving occurs. Every single thread is contiguous across each entire photo. This means that any interweaving, if it exists at all, must have been contained within the C14 tested fragments, an area of about 3cm x 1cm. This seems to me absurd.\n\n","date":"October 7, 2013 at 4:42 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46395","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Just “seeming” absurd to you…\n\n","date":"October 7, 2013 at 4:53 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46397","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Hugh, most curiously, no less than three textile experts who examined photographs of the C14 sample area taken BEFORE (and NOT AFTER) sampling just disagree with you… (just ask Joe Marino).\n\n","date":"October 7, 2013 at 4:58 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46398","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"June 18, 2013 at 3:00 pm | #8\nReply | Quote\nOn June 18, 2013, #8, I wrote as “Additional excerpt” from FAUSSE RELIQUE OU BIEN FAUSSE DATATION CARBONE 14?:\n“Sous-estimation de la complexité matérielle de l’objet archéologique à dater\nTout rapiécé à l’aide de morceaux de corporal (ou nappe d’autel) et consolidé par une doublure en toile de Hollande suites aux dommages qui lui furent causés lors de l’incendie de la Sainte-Chapelle de Chambéry, en 1532, le Linceul de Turin est tout sauf une pièce de tissu homogène. Si l’échantillon carbone 14 officiel, fut choisi loin (et encore pas si loin) de tout rapiéçage visible et de toute zone carbonisée, deux imprudences « de taille » perçaient cependant dans cette première procédure mise en place.\nPour savoir si l’on se trouvait ou non en présence d’un échantillon typique du Linceul, une information fondamentale sur la structure de son lin originel aurait due impérativement être vérifiée in situ par les deux experts textiles chargés de superviser le prélèvement de 1988 : celle de la normalité de ses irrégularités de tissage. Pour ce faire, il eut été nécessaire de procéder, sous un éclairage rasant et en fluorescence UV, à une observation minutieuse à la loupe, au compte-fil et à la binoculaire non seulement des abords mais aussi au niveau même du cœur du site de prélèvement de l’échantillon carbone 14 afin de lever toute ambiguïté possible en ce domaine. On négligea totale-ment cette dernière précaution.\nOr, tel qu’il apparaît sous fluorescences UV et sous éclairage rasant, – et donc tel que ne le virent jamais les deux experts textiles –, le fragment prélevé empiétait, par le bas sur une grande auréole d’eau dentelée vestige de l’incendie de 15329 tout en mordant en plein, dans deux aires hautement suspectes de réparations.\nAbstraction faite des zones carbonisées, la première de ces deux aires, au cinquième à cheval sur le pli barrant à la verticale le site de prélèvement, offrait, un aspect nettement plus raide et plus sombre que sur tout le reste de la surface du drap. Il s’agissait ici soit d’un dépôt de salissures graisseuses résultant des nombreuses manipulations de ce coin de la toile, soit d’une teinture locale destinée à camoufler, selon l’art des tapissiers, une restauration à l’identique de la texture, soit des deux. Dans la seconde aire plus claire et à droite de ce même pli et à gauche d’un pli courbe, on pouvait distinguer tout aussi\nnettement une anomalie structurelle : comme un réseau de fils plus dense de forme serpentine caractéristique d’une zone d’accroc ou de cisaillage ayant fait l’objet de micro reprises. Vues dans ces conditions très particulières d’observation, cette pollution et ces anomalies d’aspect ne sauraient être confondues avec une simple ombre portée, un pli du tissu ou bien une irrégularité normale apparue au cours du tissage10.\nAinsi, dès le départ, la validité du résultat final se retrouva-t-elle être très sérieusement hypothéquée. De toute évidence, les deux experts textiles, les représentants des trois laboratoires et le coordinateur du projet n’étant pas des spécialistes du Linceul de Turin, ignoraient que dans sa composition matérielle même, la relique s’avère beaucoup plus complexe qu’il n’y paraît à première vue.\nIl faut, en effet, savoir que, lors des ostensions et afin de garantir aux observateurs présents la vision la plus parfaite et la plus logique de la double empreinte du Crucifié, la relique était déployée entièrement à l’horizon-tale. Une bande de couture bourrelée courant sur toute sa longueur avait été confectionnée permettant une meilleure préhension du drap. L’échantillon parent, extrait d’un seul tenant entre 8 à 10 cm du bord supérieur du coin gauche et le long de la couture de repli du tissu sur lui-même, se superposait donc presque parfaitement à la zone où – depuis au moins le XIVe siècle et jusqu’au XIXe siècle – la grande étoffe de lin avait été tenue en tenaille entre le creux de la paume et trois ou quatre des doigts de la main droite de plusieurs générations de dignitaires ecclésiastiques officiant à mains nues.\nAinsi, à cet endroit très précis du drap, la toile, tantôt soumise à de fortes tensions et à des pressions répétées d’extrémités onglées plus ou moins coupantes, tantôt exposée aux griffures du chaton des bagues d’évêques et d’archevêques, avait-elle fini, un jour, par être abrasée, accrochée, cisaillée et/ou trouée et faire l’objet d’une (voire même de plus d’une) microreconstruction(s) fil à fil invisible(s) à l’œil nu hors examen ad hoc.\nOr, pour dater correctement au carbone 14 un objet textile ancien – un étudiant en archéologie aurait pu le savoir –, il était tout sauf recommandé de prélever un seul et unique échantillon de tissu dans une telle zone. Il eut été beaucoup plus avisé et moins destructeur de procéder à un échantillonnage de quelques fils en plusieurs endroits beaucoup plus fiables en vue d’assurer, par intercomparaison, la représentativité de la datation.”\nThere is nothing absurd at all about such a possibility.\n\n","date":"October 7, 2013 at 5:21 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46399","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"“No less than three textile experts who examined photographs of the C14 sample area taken BEFORE (and NOT AFTER) sampling just disagree with you…” I don’t believe that. Are you saying that interwoven threads were detected? If so, where? There were vague comments about colour, but no photographs of that area were clear enough to trace individual threads at that time.\nAnd, for what it’s worth, I continue to think that the idea of patching a tiny threadbare area, less than the area of a postage stamp, invisibly, while all around were huge ugly holes, is absurd.\n\n","date":"October 7, 2013 at 6:02 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46404","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Still think it is not absurd at all when it comes to “pious Christian hands” (Princess Clothilde’s)…\n\n","date":"October 7, 2013 at 6:08 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46406","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Absent the fact that such repairs in this particular area was anything but neutral as it was the very area the most handled with naked hands.\n\n","date":"October 7, 2013 at 6:11 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46408","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Richard, on June 22, 2013 at 5:00 pm | #115, I wrote:\nRe the TWO different types of microreconstructions that could mainly account for the linen to appear medieval, I wrote (my 2007 paper on the TS 1988 C14 dating fiasco):\n“Non-détection d’une zone (sinon deux) ayant subi des réparations invisibles à l’œil nu\nTout cet ensemble d’éléments directs et indirects constitue un faisceau d’indices concordants : il tend à témoigner, dans ladite zone plus raide et plus sombre, d’une intervention selon une technique bien particulière inspirée de la technique du « retissage à la française » (bien connue des maîtres-tapissiers ainsi que des experts en histoire de la tapisserie) ; technique qu’il ne faut cependant pas confondre avec celle d’un simple « entissage » d’un patch médiéval, repérable, quant à lui, à l’œil nu et à la lumière naturelle du jour par un spécialiste.\nLa technique dont il s’agit ici s’avère plus précisément celle d’un « retissage par épissures », sans coutures ni nœuds, effectuée, semble-t-il, sous un éclairage rasant et sous une loupe à fort grossissement. Elle demande beaucoup de patience et une grande dextérité des doigts. Elle consiste à mettre, tout d’abord, en place les fondations de base et la chaîne. Pour ce faire, soit le tisserand commence par identifier la matière des fibres constituant les fils de chaîne puis se les procure soit il utilise systématiquement des fibres de coton. Ensuite ces fibres sont filées afin d’obtenir l’épaisseur des fils originels puis entortillées avec précaution sur elles-mêmes et sur place aux fibres des fils de chaîne extraites de la partie cachée du tissu à réparer. Des fils de remplacement de la trame sont alors placés par-dessus et par-dessous les fils de chaîne reconstitués puis les fibres sont entortillées sur elles-mêmes, là encore avec précaution, aux fibres des fils de trame originels de façon à reproduire très exactement la texture ou le motif du tissu et refermer ainsi, sans faire de nœuds, le trou ou la zone sévèrement cisaillée. Pour finir de rendre cette restauration fil à fil tout à fait invisible et consolider les épissures, une teinture à base de gomme résineuse est appliquée localement sur la trame ainsi reconstruite pour que celle-ci, d’où provient l’effet de texture ou de motif, se fonde dans l’original (en l’occurrence la toile jaunie par la patine ivoire des siècles). Cette intervention sous un éclairage rasant et sous une loupe, si elle est bien réalisée et bien dissimulée, peut réellement être invisible sur les deux faces d’une pièce d’étoffe au point d’échapper parfois même à la main et à l’œil exercés d’une personne du métier qui, à l’œil nu et sous une lumière inadéquate, a tendance à confondre ces reconstructions avec des irrégularités apparues au cours du tissage. De fait, la structure artisanale du lin originel du Linceul, son calibre assez fort ainsi que son tissage serré en chevron sont de nature à parfaitement intégrer ce type d’intervention.\nQuant à l’échantillon de Zurich (et partant « l’échantillon 1 d’Arizona ») tiré de la partie claire de la bande C14 officielle du Linceul, celui-ci bien que ne présentant apparemment pas ou très peu de trace de contamination par une quelconque teinture14, n’en devait pas moins être recouvert d’une patine de microorganismes. De par l’aspect anormale de la zone où il fut prélevé, il suggère fortement, en tout cas, un second type d’intervention indétectable à l’œil nu car effectuée, elle aussi semble-t-il, sous un éclairage rasant et sous une loupe à fort grossissement : « un raccommodage à perte ». Cette technique consiste très précisément à insérer, entre les fils de trame et de chaîne, des fils (ici de coton) qui, à chaque fois, sont coupés à leurs deux extrémités sans faire de nœuds, les laissant ainsi littéralement se perdre dans le tissu de lin existant.\nCes deux types spécifiques d’intervention (l’une dans le sens d’un remplacement de matière carbonée, l’autre dans celui à la fois d’un remplacement et d’un léger apport) permettraient de rendre compte de la grande dispersion des résultats observée (1238-1407) sur une si petite distance (à peine quatre centimètres de tissu).\nL’enduit de gomme arabique étant soluble dans l’eau et présent dans cette zone du coin supérieur gauche, il ne pouvait avoir été appliqué sur les fils superficiels des échantillons Raës et C14 qu’après l’incendie de la Sainte Chapelle de Chambéry de 1532. La teinture l’eût-elle été avant, celle-ci n’aurait pas dissimulé l’extrémité du bord supérieur de la grande auréole dentelée car l’eau de l’incendie eût entraîné les produits de la pyrolyse locale au cœur des fils. Ce revêtement coloré ajouté tardivement explique l’absence de fluorescence aux UV observée dans cette aire particulière du drap. L’histoire de la conservation du Linceul après 1532 permet donc de dater, d’une manière très précise, au moins une sinon les deux interventions. Seules, en effet, les quatre sœurs clarisses, en 1534, et la princesse Clothilde de Savoie-Bonaparte, en 1863, qui intervinrent de façon étendue sur la relique, auraient pu effectuer ce type de réparations invisibles de mains aussi expertes. Les sœurs clarisses s’étant vues confiée la tache bien spécifique de réparer et de consolider la pièce d’étoffe endommagée lors de l’incendie de 1532, la princesse de Savoie-Bonaparte s’avère donc être, pour ces travaux délicats de restauration, la candidate la plus hautement probable (aidée ou non en cela du maître tapissier de la cour royale d’alors). Ce d’autant qu’en 1863, cela faisait déjà plus de cinq siècles qu’à chaque ostension à mains nues, la relique se retrouvait être tendue à l’horizontale.\nTout ceci explique (ou expliquerait) pourquoi, lors de la découpe de l’échantillon et faute d’un éclairage adéquat (en lumière UV ou rasante), ces deux variantes locales passèrent totalement inaperçues aux yeux des experts textiles chargés de superviser le prélèvement pour la datation officielle de 1988. Toute leur attention était alors absorbée soit par l’étude technique du drap (qu’ils voyaient pour la toute première fois) soit par la présence gênante des fils de la couture épaisse qui liaient un résidu de la partie supérieure du Linceul au tissu à découper. Ainsi en oublièrent-ils de procéder à un examen minutieux du cœur même du site textile à prélever. L’eurent-ils examiné, ils n’auraient pu manquer, en effet, d’y repérer la petite reconstruction de forme serpentine, la teinture dissimulant l’extrémité du bord supérieur de la grande auréole d’eau dentelée ainsi que le caractère plus raide et plus sombre de la zone. En principe, une restauration « invisible » ne saurait échapper au compte-fil et a fortiori à la binoculaire lorsque l’œil derrière est compétent. Les photos qui montrent les Prs Francesco Testoré et Gabriel Vial († 2005) s’affairant avec divers instruments sont, cependant, on ne peu plus trompeuses en ce qu’elles laissent croire que lesdits experts étaient occupés à des vérifications préliminaires de l’intégrité de ladite zone quand, de fait, leurs vérifications ne furent pas étendues au cœur de l’échantillon mais se bornèrent à la seule lisière du drap.\nAinsi croyant avoir libéré l’échantillon aux bords effilochés de tout fil étranger, laissèrent-ils à l’opérateur, Giovanni Riggi di Numana († 2008), « le soin » de réduire à une bande rectangulaire un peu plus régulière le rectan-gle grossier que celui-ci, à l’aide de ciseaux de chirurgien, venait d’extraire sans gants protecteurs et plus ou moins malhabilement à la pièce principale.\nDe toute évidence, ce technicien (à qui échut la responsabilité et du choix de l’emplacement et de la prise d’échantillon !) n’était pas expert textile pas plus qu’il n’était carbonologue ou bien archéologue15. Il semblait en effet ignorer à quel point, en matière de radiodatation, la haute technologie de l’Accélérateur Spectromètre de Masse (adaptée pour les mesures sur des microéchantillons) s’avère être sensible aux contaminations y compris à celle du sébum humain. Ce choix d’une zone qui avait fait l’objet, au cours des siècles, de nombreuses manipulations à mains nues lors des ostensions, était donc déjà, de ce seul point de vue, tout sauf judicieux.”\nHope it can help.\n\n","date":"October 7, 2013 at 4:45 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46396","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Max,\nIf I understand well, you suggest that the “repair” has not been performed using the classical “French reweaving” method but thread by thread using splicing, as suggested by the fact that Raes 1 is a splice. Incidentally, Testore found another splice on the TS (from his personal private report I have), but he does not remember where (personal email).\nSince some years, I think that “thread by thread splicing” is the best, or perhaps the only method able to explain most of the facts, including Flury-Lembergs critics of the classical “French reweave” as well as Hugh’s interesting comments.\nI ask you: do you have any reference about splicing as a repair method in the Middle-ages or later ?\nThis is very important.\nThank you in advance.\n\n","date":"October 8, 2013 at 3:31 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46523","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Thibault, you understand well.\nMost likely,  the invisible mending has not been performed using the classical “French reweaving” method.\nIn order to invisibly repair a couple of small adjacent tears & holes in a less than two-three square centimeter area, thread-by-thread splicing of the said tears & holes in the relic could have seemed more appropriate both as an act of piety and a “natural variant” to classical French invisible reweaving” requiring a couple of tiny patches. \nThis is just cryptological common sense.\n\n","date":"October 8, 2013 at 5:07 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46538","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Guys, could you tell me what is a difference between thread by thread and French reweaving? Because all my knowledge about the latter is based on Benford&Marino papers. I thought it is essentially the same.\nThanks.\n\n","date":"October 8, 2013 at 5:17 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46539","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Daveb wrote “So who did the invisible weave? Pricess Clothilde of Savoy around 1868; Or as commissioned by Margaret of Austria, Duchess of Savoy at some time during 1508-1530, as asserted by Marino & Benford?”\nFrom:  http://www.shroud.com/pdfs/benfordmarino.pdf\nThe most famous tapestry-worker of this period was Pieter van Aelst, who produced\nnumerous tapestries for more than thirty years.\nMax wrote, “Absent the fact that such repairs in this particular area was anything but neutral as it was the very area the most handled with naked hands.”\nFrom Robert Buden, President of Tapestries &\nTreasures. Tapestries & Treasures ( http://www.tapestries4less.com), which produces, imports,\nexports, and distributes high-quality, historical tapestries to clients throughout the world,\nincluding 16th Century pieces in article found at:  http://www.shroud.com/pdfs/histsupt.pdf:\nDid weavers of the 16th Century possess the skill to ‘invisibly repair’ textiles?\nMost definitely. Would the restoration of a Holy Relic like the Shroud of Turin be\nassigned to a novice or the finest craftsmen in the land? I think the latter. Was budget a\nconcern for the Church or its noble owner at the time? Most likely not.\n\n","date":"October 7, 2013 at 10:16 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46427","author":"jmarino240","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Max,\n– Thanks.\nJoe,\n1. So far, it appears — to me — that while the French Weaving described by Michael Ehrlich was not fully applied to the Shroud, IT COULD HAVE BEEN largely applied (the only diversion being the failure to use original material for the reweaving).\n2) I would have said that the French Weave technique “WAS PROBABLY, largely, applied,” except I can’t explain Hugh’s results…\n– What do you think?\n\n","date":"October 8, 2013 at 9:40 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46473","author":"Richard Savage","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Just two questions for the simple, please, who have as much to gain, or loose, as anyone, in the argument for authenticity. Perhaps more. 1) Does the ‘invisible weaving, or any mending done by house of Savoy or others, have anything to do with establishing or debunking the age or authenticity of the SOT?  2) Does the argument over C14 dating take into consideration the bioplastic coating of the Shroud discovered by Garza Valdez, which would naturally skew the results?  In fact, isn’t that why the tensile strength experiments at the U. of Turin were conducted in the first place? I am a painter, and have done quite a few works on linen canvas, you CAN”T put any kind of “dye” or “paint” onto linen without first applying ‘gesso,’or the paint would simply be a smear or be a blob, and NO painting displays the three dimensional attributes discovered by a NASA photographer during the STURP investigation in the 70s. Thanks in advance for your help.\n\n","date":"October 8, 2013 at 11:42 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46484","author":"Josie L. Tyner","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"correction. I know one can dye linen.  I rather meant in the sense of forming an image with a pigment. Sorry.\n\n","date":"October 8, 2013 at 11:45 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46485","author":"Josie L. Tyner","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Hi Josie.\n1) If the sample that was radiocarbon tested consisted of 1st century thread, it would have been dated 1st century. If it was made of 16th century thread, it would have dated 16th century. If it was two-thirds 16th century and one-third 1st century, it would have dated 13th century. If invisible patching could be established, it would cast serious doubt on the accuracy of the radiocarbon dating.\n2) The ‘bioplastic coating’ has been discredited by Rogers, who thinks it was a mistaken interpretation of some characteristics of the linen, by the radiocarbon scientists, who think it would have been removed by the cleaning procedure, and by simple observation, since there would have to be a huge amount of it to affect the date sufficiently.\n3) The tensile strength measurements had nothing to do with the alleged bioplastic coating, which had been dismissed long before they were carried out. They were more to do with the gradual disintegration of linen fibres by oxidation through age. Sadly, so many other factors also contribute to the disintegration that the proportion due solely to age is rarely calculable.\n4) The image may be the result of some painting or natural transfer mechanism which has since been washed off, leaving only degraded fibres behind. Rogers himself finally concluded that the fabric had indeed been ‘sized’, albeit accidentally and with no thought of image-making, as part of the manufacturing process.\n4) Almost any monochrome painting (or photograph) made full face, with the light from in front and a dark background, shows three dimensional attributes that are at least as good as and often better than those exhibited by the Shroud. This can be tested by any suitable image processing software such as ImageJ.\n\n","date":"October 8, 2013 at 1:28 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46496","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Thank you for your kind reply, and I appreciate the depth of scholarship involved in the answer.  I have to admit that the information that I have about the three-dimensional properties of the shroud taken by the NASA jet propulsion laboratory scientist from the STRP team does not agree with your conclusions, and his conclusions assert that the Shroud must have been draped over a three dimensional image to have these properties. That said, there may be information out there of which I am not aware.  I would be interested in your point of view on the visual information available on the SOT that reflects facts only recently verified by modern archeology; i.e. the dumbbell shaped marks from the flagellum, the Eastern “crown” of thorns covering the entire head instead of the typical circlet, the nailing thru the wrists instead of the hands,  the fact that no contemporary (middle age or Renaissance, supposedly) cultural or plastic archetypes demonstrated by the Shroud are reflected by “relics” that pilgrims could recognize. In other words, how could an artist (considered only a craftsman in the Middle Ages) come by information only the recent science of archeology has now made known? One thing no one seems to ever mention is the fact that the figure of the Man of the Shroud is significantly longer in back than in front, I can’t think that that would go unnoticed by more than a few pilgrims. I am not being cynical at all by pointing out that relics were a big source of income for local churches and monasteries, so why show tithing pilgrims something they did not come to see? Finally, please forgive me if I have not understood this: is it your contention that the SOT initially looked like the well-known Secondo Pia negative, and that it has faded with time, leaving only the faint figure we see today?  Again, I thank you for your scholarly and informative answer, and appreciate immensely your time and consideration.\n\n","date":"October 8, 2013 at 6:14 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46548","author":"Josie L. Tyner","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"A surface sheen was indeed seen on the Shroud, sort of confirming what Dr. Garza-Valdez had proposed, however scientists have argued that this type of contamination was not enough to skew the carbon dating test.\n\n","date":"October 8, 2013 at 12:20 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46487","author":"Louis","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"\nHugh Farey :\n4) The image may be the result of some painting or natural transfer mechanism which has since been washed off, leaving only degraded fibres behind.\n\nUnproven wishful thinking of the sceptics.\n\nHugh Farey :\n4) Almost any monochrome painting (or photograph) made full face, with the light from in front and a dark background, shows three dimensional attributes that are at least as good as and often better than those exhibited by the Shroud. This can be tested by any suitable image processing software such as ImageJ.\n\nWrong Hugh. I tested this using ImageJ. No monochrome painting or photograph has 3D properties as good, as has the Shroud -and in case of the Shroud they are callibrated to the surface of the cloth, not to the plane in infinity. Check pictures in my article:\nhttp://ok.apologetyka.info/racjonalista/jak-nie-zosta-zrobiony-caun-turynski,473.htm\n\n","date":"October 8, 2013 at 2:15 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46508","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"And also here: \nhttp://ok.apologetyka.info/racjonalista/caun-turynski-faszerstwo-niedokonane-cz-3,560.htm\n\n","date":"October 8, 2013 at 2:16 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46509","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"This is also worthy of look:","date":"October 8, 2013 at 2:19 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46510","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"According to the information I have, the scientist who discovered this was  one of the team  responsible for analyzing the comparative depths of the areas where astronaut Neil Armstrong and company landed the vehicle on the moon.  His calculations were of life-and-depth critical importance to the moon landing.  His work is extremely credible in my eyes. However, to be fair to Mr. Farey, I am going to consult a family member who uses “IMAGE” software in his work and would like to tell you of what I saw (I have only basic computer knowledge). BTW, your work is fascinating and exciting. I would be very honored if you read my answer to Mr. Farey and weigh in on my questions concerning available cultural archetypes in the Middle Ages.  I do not understand how a mere craftsman, as any artist would be at the time,  would have access to information made only available in the twentieth century.  Thank you, continued success to you.\n\n","date":"October 8, 2013 at 6:30 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46550","author":"Josie L. Tyner","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"“Wishful thinking.” Not mine, OK. If I permitted myself wishful thinking I would wish that the evidence for a 1st century, natural shroud was convincing, which it isn’t. The image may indeed result from the remains of a process now largely removed. That’s not wishful thinking, it’s merely a statement. As for your photos, I note that instead of choosing a “monochrome painting (or photograph) made full face, with the light from in front and a dark background” as I suggested, you selected a heavily side-lit picture of Jules Verne to illustrate your point, coloured it in bright greens and blues, and then have the boldness to tell me I’m wrong! Might I suggest that you choose instead the gentleman in the top centre of Diagram 7 of your third reference, and colour it using the greyscale. I did, and obtained a beautiful 3D representation using ImageJ. The cheeks, it is true, being as bright as the tip of the nose, do stick up a bit too much – but then so do the cheeks of the shroud under a similar transformation.\n\n","date":"October 8, 2013 at 6:26 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46549","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Josie, thank you for your inquiry as well.\nThe great thing about the shroud is that with a little lap-top software anybody can carry out a number of first-hand investigations for themselves, and may discover things that nobody has noticed before, or things which seem to disagree with ‘received wisdom.’ Unlike some of the posters here, I try to show my readers where they can find my evidence, so that they can decide for themselves.\nTo take a few of your ideas:\n“The dumbbell shaped marks from the flagellum.” As I cover more thoroughly in a different post (see ‘One Person’s Take Away From A Shroud Lecture’ from a few days ago), although these marks conform to a rough idea of what a flagellum (or flagrum) might be like, there is no evidence that they are at all accurate, or illustrate flogging injuries any better than dozens of medieval painters.\n“The Eastern “crown” of thorns covering the entire head instead of the typical circlet.” I don’t know where this idea started. Have a look at the shroud on shroudscope. The top of the head is not represented on the shroud, so it is impossible to say whether the ‘crown’ covered it or not. There are a number of ‘blood flows’ from the top of the brow, and some others around the base of the back of the skull. They could conform to any kind of spiky headgear.\n“The nailing thru the wrists instead of the hands.” The shroud is far from alone in showing this, and the recently deceased Dr Fred Zugibe thought that the nails may have gone in through the palms and exited at the wrists. Most statues show nails through the palms because of the danger of splitting the wood or plaster at the thinnest part of the arm.\n“The fact that no contemporary (middle age or Renaissance, supposedly) cultural or plastic archetypes demonstrated by the Shroud are reflected by “relics” that pilgrims could recognize.” I’m not sure what this means, but if you mean that the shroud doesn’t look like what a shroud “ought” to look like then I can only agree with you. If I were compelled to provide a ‘forgery hypothesis’ explanation for a) the fact that the shroud is long and thin instead of like a sheet and b) the fact that the shroud shows two bodies, front and back, then I would suggest that it may have been made to fit a particular space (above an altar, say) which happened to be 4m long and 1m wide. That being so, you could either have one image right in the middle (probably the back view), or both images, which would fill up the space more attractively. Convincing? no, not to me either, but it’s the sort of idea one might come up with.\n“One thing no one seems to ever mention is the fact that the figure of the Man of the Shroud is significantly longer in back than in front.” Another thing you can check for yourself. Superimpose two pictures, back and front, and using an ‘opacity’ slider, arrange them so that the heads and the tops of the bodies coincide. There turns out to be no great difficulty in registering the two images, except that the dorsal image includes the soles of the feet (if they were roughly at right angles to the legs the cloth could have been folded up over them), while the ventral image doesn’t. That’s why it looks longer.\nIn this connection you might lie in bed one day with your legs bent. You will notice that whereas your ‘image’ on the bottom sheet would be shortened by bending your legs, the top sheet, conforming to the shape of your body, is about the same length as you. In other words the top image of the shroud should be longer than the bottom one, which it clearly isn’t. While pondering on this, you will also notice how little of the back of your legs actually makes contact with the sheet, and wonder how the image of the back of the legs comes to be as clearly defined as the image of the front.\n\n","date":"October 8, 2013 at 7:05 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46555","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Hugh Farey wrote: ” In other words the top image of the shroud should be longer than the bottom one, which it clearly isn’t. “.\nPlease, show your measurements (that is, lengths and end points on the image) that “clearly” show that this is the case. This is easy to do with the Shroud Scope.\n\n","date":"October 8, 2013 at 9:03 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46567","author":"Mario Latendresse","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Or check this:http://ok.apologetyka.info/racjonalista/caun-turynski-faszerstwo-niedokonane-cz-1,558.htm\n\n","date":"October 10, 2013 at 2:31 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46884","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Hugh\nThe top image of the shroud only need be longer than the bottom one if the legs were significantly bent, with the feet pulled up closer to the buttocks.\nA slight bending of the knees allows for minimal length difference, and also allows for contact   between the calves and part of the underside of the thighs with the sheet\n\n","date":"October 8, 2013 at 9:28 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46569","author":"Matthias","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"\nHugh Farey :\n“Wishful thinking.” Not mine, OK. If I permitted myself wishful thinking I would wish that the evidence for a 1st century, natural shroud was convincing, which it isn’t. The image may indeed result from the remains of a process now largely removed. That’s not wishful thinking, it’s merely a statement.\n\nNot yours, but that of Schafersmann, Nickell, Garlaschelli and other sceptics who try to convince the public of existence of such mythical agent. But they fail. See:\nhttp://www.acheiropoietos.info/proceedings/HeimburgerWeb.pdf\n “In order to test this hypothesis, LG had to find some kind\nof solid non-neutral “sensitizer” which, once rubbed onto\nthe cloth and artificially aged, could slightly discolor the\ncellulose. After testing dozen of salts and solid acids,\neither mixed with a pigment or even pure, “\nnone of them“ left any trace on the linen af\nter heating and final washing.”\n\nHugh Farey :\n As for your photos, I note that instead of choosing a “monochrome painting (or photograph) made full face, with the light from in front and a dark background” as I suggested, you selected a heavily side-lit picture of Jules Verne to illustrate your point, coloured it in bright greens and blues, and then have the boldness to tell me I’m wrong! Might I suggest that you choose instead the gentleman in the top centre of Diagram 7 of your third reference, and colour it using the greyscale. I did, and obtained a beautiful 3D representation using ImageJ. The cheeks, it is true, being as bright as the tip of the nose, do stick up a bit too much – but then so do the cheeks of the shroud under a similar transformation.\n\nHugh, according to your wishes:You see? A total FAILURE, as you have admitted yourself. I checked many pictures, full face, light from the front and so on. Even in perfect conditions, the correlation between distance and luminosity was not so perfect as it is in the case of the Shroud and surface of the cloth.\n\n","date":"October 9, 2013 at 10:29 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46648","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Thank you for at least trying. As it happens your 3D image of the Shroud face is to me as meaningless as the one of my ‘gentleman in the middle of Diagram 7. Can’t you get rid of that hideous green and blue? What software are you using? No matter, here is an ImageJ version of the same face: http://imgur.com/Btd6Jb8.png, compared to one of the Shroud: http://imgur.com/MjQdQ3n.png. I really think anyone who was not already committed to preconceived ideas about the shroud would think that the first picture is considerably better.\n\n","date":"October 9, 2013 at 7:14 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46718","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Hugh, I very much like to know how you can REALLY discriminate between an originally true 3D encoded image and an originally 3D (yet seducively beautiful) non-encoded one using ImageJ.\n\n","date":"October 10, 2013 at 6:04 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46783","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"\nHugh Farey :\n What software are you using?\n\nImageJ, just like you.\n\nHugh Farey :\nThank you for at least trying. As it happens your 3D image of the Shroud face is to me as meaningless as the one of my ‘gentleman in the middle of Diagram 7. Can’t you get rid of that hideous green and blue?\n\nWhy? Because it shows that the forehead of that gentleman is too much in front? The ImageJ has an option of using color map -and its in my opinion much more informative and useful than grey images. Perhaps it seems that I simply know ImageJ a little bit better than you do.\n\nHugh Farey :\n I really think anyone who was not already committed to preconceived ideas about the shroud would think that the first picture is considerably better.\n\nAnd he would be WRONG! Hugh, i know you like to play devil’s advocate, but do you really UNDERSTAND what are the so-called 3D properties of the Shroud image? Because every image or photograph has it. Every monochromatic image has THREE dimensions, the X,Y coordinates and INTENSITY, which is the third dimension (call it Z). So every picture will look 3D in VP8 or ImageJ. BUT ONLY IN THE CASE OF THE SHROUD this third dimension can be CORRELATED to the body-cloth distance. This is what is popualrly called as 3D dimensions of the Shroud. However, Petrus Soons argues that besides those, the Shroud has ADDITIONAL holographic properties, which is another distinct way of encoded 3-D information.\n\n","date":"October 10, 2013 at 6:45 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46796","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"as 3D properties.\n\n","date":"October 10, 2013 at 6:46 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46797","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"I don’t think you can simply say “wrong!” Whether one representation of a 3D face looks better than another is a subjective judgement, and to my mind, the modern photograph looks better than the shroud when subjected to similar treatment.\nYou can certainly allege that the shroud image contains more information than the modern photograph, however, and for that you may be correct. If, however, the brightest parts of the shroud face (forehead, nose and beard) were all close to, or in contact with, the shroud, I think that implies that the shroud was definitely draped over the body, so that it made contact with those three features, which it certainly would not have done if it had been horizontal. Is that correct?\n\n","date":"October 10, 2013 at 7:32 am","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46805","author":"Hugh Farey","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Yes. See once again “The real face of Jesus?”, it is presented well there:\n\nHowever, one remark. The 3D distortions (which are obvious on the Shroud) and 2D distortions (which certainly exist, as Mario has shown us in his excellent paper http://www.sindonology.org/papers/latendresse2005a.pdf however they are not major, and symmetrical, so there is very little devaition from what would be seen had the image been projected on a flat surface) although somehow related, are in fact two distinct features and should be not confused. So no, there is no point for sceptics here.\n\n","date":"October 10, 2013 at 3:06 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46893","author":"O.K.","site":"shroudstory"},{"title":"And then, too, we have two comments from Daveb of Wellington","post":"Terrific video.  Surprise!  Dan is in it!  Enjoyable and informative.\n\n","date":"October 10, 2013 at 6:58 pm","url":"https://shroudstory.com/2013/10/03/and-then-too-we-have-two-comments-from-daveb-of-wellington/","cat":"carbon_14_dating","id":"comment-46926","author":"Josie L. Tyner","site":"shroudstory"}]
