[{"title":"The Big Carbon Dated Mistake: Shroud of Turin and the Scientific Quest for God","post":"nicely written and very informative\n\n","date":"January 10, 2009 at 5:50 am","url":"https://shroudstory.com/2008/09/21/the-big-carbon-dated-mistake-shroud-of-turin-and-the-scientific-quest-for-god/","cat":"carbon_14_dating","id":"comment-247","author":"IXOYE","site":"shroudstory"},{"title":"The Big Carbon Dated Mistake: Shroud of Turin and the Scientific Quest for God","post":"You (the original author), don’t know too much about scientific method, nor for that matter know how to post an unbiased piece relating to the SOT.\nFor starters, Roger’s findings relate purely and specifically to the samples taken in the 1970’s Rae’s and NOT the actually 1988 RIGGI samples, used for the c-14 dating. \nThat however does not stop you from claiming Roger’s got his “findings” in the c-14 sample. (WHICH HE DIDN’T)\nSecondly, Ball’s commentary in Nature, is an opinion piece and not an independent evaluation of Roger’s work ON the Rae’s piece, which again is a different sample to the RIGGI one.\nBrown also did not do what could be called independent testing and even on the PDF found at the shroud.com site, states clearly in his PDF that at the time of the printing, his own analysis had not reached a conclusion.\nVillareal’s comments were too a conference paper, aimed specifically at shroud supporters and as his findings have yet to be published, how can YOU Mr “author” determine what his “findings” actaully stated?\nThe most laughable part of your content was your assertion that Chris Ramsey is shown to back up your feeble tale. You did neglect to mention from his work that:\n“As yet there is no direct evidence for this – or indeed any direct evidence to suggest the original radiocarbon dates are not accurate.”\nThe above is directly from \nhttp://c14.arch.ox.ac.uk/embed.php?File=shroud.html\nIt is amazing that you are putting words into the mouths of people not actually having said what you claim they have and ignoring things they HAVE ACTUALLY said. \nObviously, it is a case of in reference to you YE OF LITTLE FAITH.\n\n","date":"May 5, 2009 at 10:54 pm","url":"https://shroudstory.com/2008/09/21/the-big-carbon-dated-mistake-shroud-of-turin-and-the-scientific-quest-for-god/","cat":"carbon_14_dating","id":"comment-447","author":"thorough","site":"shroudstory"},{"title":"The Big Carbon Dated Mistake: Shroud of Turin and the Scientific Quest for God","post":"Actually, Rogers did obtain and verify using a thread from the the reserved sample. The point is missed: the anomolies in the region of the C14 sample are sufficient to impute reasonable doubt to the 1988 testing. They cannot any longer be called definative by any stretch of the imagination. They draw attention to many red flags that were simply ignored in 1988 and when the paper was written in 1989. I quoted Brown correctly. One does not judge Villarreal by the audience. How ad hominem is that? (Not that everyone at the conference sided with Rogers, which you presume.   There were those who still hope that John Jackson is correct). Ramsey’s point is that more studies are need. Indeed they are. \nGiven the blue mosaic photographs that showed some evidence of chemical anomolies. Given that Giovanni Riggi, the person who actually cut the carbon 14 sample from the Shroud stated, “I was authorized to cut ap-proximately 8 square centimetres of cloth from the Shroud…This was then reduced to about 7 cm because fibres of other origins had become mixed up with the original fabric …” Given that Giorgio Tessiore, who documented the sampling, wrote:  “…1 cm of the new sample had to be discarded because of the pres-ence of different color threads.” Given that Teddy Hall, then head of the Oxford radiocarbon dating laboratory, had noticed fibers that looked out of place. Given that a laboratory in Derbyshire concluded that the rogue fibers were cotton of “a fine, dark yellow strand.”  Derbyshire’s Peter South wrote: “It may have been used for repairs at some time in the past…” Given that Gilbert Raes, when later he examined some of the carbon 14 samples, noticed that cotton fibers were contained inside the threads, which could help to explain differences in fiber diameter. This may also explain why the carbon 14 samples apparently weighed much more than was as expected. Given that Alan Adler at Western Connecticut State University found large amounts of aluminum in yarn segments from the radiocarbon sample, up to 2%, by energy-dispersive x-ray analysis. Why aluminum? That was an important question because it is not found elsewhere on the Shroud. Given that the radiocarbon lab at the University of Arizona conducted eight tests. But there was a wide variance in the computed dates and so the team in Arizona combined results to produce four results thus eliminating the more outlying dates (reportedly they did so at the request of the British Museum, which was overseeing the tests). Given that, according to Remi Van Haelst the results failed to meet minimum statistical standards (chi-squared tests).  Why the wide variance in the dates? Was it because of testing errors? Or was it because the sample was not suffi-ciently homogeneous? The latter seems very likely now, and the statistical anomaly indicates something very suspicious about the samples. Given that Bryan Walsh, a statistician, examined Van Haelst’s analysis and further studied the measurements and concluded that the divided samples used in multiple tests contained different levels of the C14 isotope. The overall cut sample was non-homogeneous and thus of questionable validity. Walsh found a significant relationship between the measured age of various sub-samples and their distance from the edge of the cloth. Though Walsh did not suggest invisible reweaving, it is consistent with his findings. Given this, given Rogers’ findings, given Brown’s observations —– therefore we must be suspicious of the results, scientific methods not withstanding. As Rogers made it clear, the labs didn’t even try to investigate available data and problems. So much for scientific method and thoroughness. Of course I’m biased. I am annoyed that my initial skepticism about the shroud, based on what I thought was good science, was so founded on poor science. I still don’t know if the shroud is real but I know for sure that the 1988 tests cannot be trusted. So don’t lecture me about faith. \nPerhaps I was unfair to Ramsey in not providing the full context. Thank you for furnishing the link for others. But the fact is, and we can squabble about what direct means, he is in a bit of a bind if that is his take, is he not. Like Ball’s piece, mine is an opinion piece. The dating of the shroud is quite possibly the biggest mistake in carbon dating history. That picture is emerging. The way to address it is to reexamine the evidence.\n\n","date":"May 6, 2009 at 2:52 pm","url":"https://shroudstory.com/2008/09/21/the-big-carbon-dated-mistake-shroud-of-turin-and-the-scientific-quest-for-god/","cat":"carbon_14_dating","id":"comment-453","author":"episcopalian","site":"shroudstory"},{"title":"The Big Carbon Dated Mistake: Shroud of Turin and the Scientific Quest for God","post":"– Re #2:\n– Don’t forget “Jabba’s Razor” — Sarcasm must not be multiplied beyond necessity (sarcasmos non sunt multiplicanda praeter necessitatem). In other words, the least sarcastic argument is usually the correct one…\n\n","date":"February 11, 2011 at 10:39 am","url":"https://shroudstory.com/2008/09/21/the-big-carbon-dated-mistake-shroud-of-turin-and-the-scientific-quest-for-god/","cat":"carbon_14_dating","id":"comment-2445","author":"Jabba","site":"shroudstory"},{"title":"The Big Carbon Dated Mistake: Shroud of Turin and the Scientific Quest for God","post":"Radiocarbon dating contains an intentional error. A 17 was replaced with a 31 to reach the mininum acceptable confidence level (or a little less then the minimum, if you repeat the calculations with Calc.exe). With 17 che dating falls below the acceptable confidence level, so it is worthless. Changing numbers to obtain the desired result: is this “scientific mehtod”?\n\n","date":"November 7, 2009 at 6:03 pm","url":"https://shroudstory.com/2008/09/21/the-big-carbon-dated-mistake-shroud-of-turin-and-the-scientific-quest-for-god/","cat":"carbon_14_dating","id":"comment-847","author":"Gabriele67","site":"shroudstory"},{"title":"The Big Carbon Dated Mistake: Shroud of Turin and the Scientific Quest for God","post":"Gilbert Raes published several times that the linen threads of the main cloth of the Shroud of Turin contain traces of cotton fibers since the linen was spun in context with cotton at the time the threads were manufactured. Consequently, on authentic specimens of the Shroud of Turin used to test we expect to find linen and cotton, and the cotton is not a rogue fiber but one that should be found as per Raes.\n\n","date":"November 8, 2009 at 2:53 pm","url":"https://shroudstory.com/2008/09/21/the-big-carbon-dated-mistake-shroud-of-turin-and-the-scientific-quest-for-god/","cat":"carbon_14_dating","id":"comment-849","author":"John Lupia","site":"shroudstory"},{"title":"The Big Carbon Dated Mistake: Shroud of Turin and the Scientific Quest for God","post":"Respectable Author,\nIf you study the history carefully, You will find that the Body of the Holy Jesus Christ was rubbed with an ointment, after it was removed from the cross. The formulation of this ointment is also mentioned in some literature. This was made from some herbs. After application of this ointment, the body was wrapped in the cloth,(shroud of Turin). The body heat was enough to evaporate some valatile components of the ointment, these vapors got deposited on the fibres of the cloth and generated a negative image.\nThis is a simple test that the same ointment be produced and applied to a human body. The body be wrapped in a similar cloth and kept wrapped for about three days. The cloth is to be aged under duplicate conditions and later examined for any negative image is produced or not.\nI strongly beleive that c-14 test were carried correctly, the problem lies in the method of sampling. The samples should have been taken from different parts of the shroud.\nAyaz.\n\n","date":"January 2, 2010 at 1:35 am","url":"https://shroudstory.com/2008/09/21/the-big-carbon-dated-mistake-shroud-of-turin-and-the-scientific-quest-for-god/","cat":"carbon_14_dating","id":"comment-913","author":"Ayaz Ayaz","site":"shroudstory"},{"title":"The Big Carbon Dated Mistake: Shroud of Turin and the Scientific Quest for God","post":"\nJohn Lupia :\nGilbert Raes published several times that the linen threads of the main cloth of the Shroud of Turin contain traces of cotton fibers since the linen was spun in context with cotton at the time the threads were manufactured. Consequently, on authentic specimens of the Shroud of Turin used to test we expect to find linen and cotton, and the cotton is not a rogue fiber but one that should be found as per Raes.\n\n-This is pretty damning.  Is it true?\n\n","date":"February 11, 2011 at 10:28 am","url":"https://shroudstory.com/2008/09/21/the-big-carbon-dated-mistake-shroud-of-turin-and-the-scientific-quest-for-god/","cat":"carbon_14_dating","id":"comment-2444","author":"Jabba","site":"shroudstory"}]
