[{"title":"The Challenge for Stephen Now","post":"With statistics one should be extremely careful. The main problem are not numbers but interpretation.\nOne should always remeber that radiocarbon-dating is in fact, a statistical measure -the C-14 decay is probabilistic process, the total number of C-14 atoms remaining follows Poisson distribution (but in practice we use Gaussian distribution to which Poisson converges for high counts of atoms).\nTheoretically it is possible for the Shroud to be from the 1st century, while dating randomly gives the range of  13th-14th century -but the purely random chances for this are negligible (“one in trillions or so”).\nHowever, if there is a patch, the assumption of randomness must be thrown out.\nIt is calculated that for 1st century Shroud and 16th century patch approximately 75 % of the material must be a patch, to give circa 13-14th century result. \nBut what the chances are that the proportion is 75 % (and not 20 % or 90 %), we cannot say -it is beyond the domain of statistics. We cannot give a number.\nIt is a pity that several people, including Stephen, do not understand this. The problem of equivocation of terms may lead to much confusion.\n\n","date":"May 29, 2014 at 7:21 am","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125463","author":"O.K.","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"Nonetheless not miraculous or astronomical. Stephen Jones will succeed because the gullible crowd always believes conspiracy theory. The damage he will do to the shroud is incalculable. Astronomical!\n\n","date":"May 29, 2014 at 7:56 am","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125474","author":"Paulette","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"Paulette, you are right and I warned of this when it first came out. To him I believe it’s a chess game he has to win at all cost. It’s also “his” theory so there is a “me ” factor here. Unfortunately he is stomping the shroud in the process. Last post he took a jab at the reweave hypothesis using the Quad mosaic photos, even though this was not essential to Benford/Marino’s hypothesis,(almost like someone who doesn’t believe in the shroud, he ignored the empiric chemical evidence sited by rogers & others) which was very sad to see from someone like Stephen. And If you disagree, you are not a “true christian” and you have been warned of “hell”. However, In the process, he is acting in a most unchristian way judging & defaming people who can’t even defend themselves since they have long passed away. Very disappointing.\n\n","date":"May 29, 2014 at 8:17 am","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125478","author":"Mike M","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"“The answer (easily calculable using Christopher Ramsey’s OxCal and an online carbon dating calculator) is about 1/10.”\nAnother figure you throw to the wind.\nThis is non sense, you’ve no idea of how homogeneous the scatter of new linen threads is, heterogeneity is the key parameter, but unknown. You simply can’t do the math.\n\n","date":"May 29, 2014 at 12:41 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125513","author":"anoxie","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"Anoxie, I think I understand your point, but you clearly don’t understand mine. You are correct that no mathematical answer can be found to vaguely generalised premises, but words like astronomical and miraculous imply that even with the little data we have, some estimate of the probability can be made, and that it would be staggeringly unlikely. Neither you nor I like that kind of “plucking from the air,” so I set myself a very specific question, with clearly calculable answers.\n1) The shroud was made in 25AD. Shortly before the crucifixion. I could have meandered around between 10AD and 33AD, but lets stick to 25AD. A material made in 25AD contains 78.70% of its original C14.\n2) The contamination was made in 1535. I could have picked a later date, but I chose just after the fire. If there was some reweaving, it must have been at some time, and the exact date is, as it happens, irrelevant. Material from 1535 contains 96.44% of its original C14.\n3) The ‘target’ date. Between 1260 and 1390. As given in the Nature paper. A material from 1260 contains 91.0% of its C14, and a material from 1390 contains 92.77%.\n4) Pick a random percentage between 0 and 100. If there was between 0 and 70% of contamination, the resultant date would be too old to amaze Stephen with its uncanny accuracy. If there was between 80 and 100% the resultant date would be too young. That leaves a range of between 70% and 80% which would produce the ‘astronomically unlikely figure’ given by the Nature paper. That’s about 10% of the possible random selections, or 1 in 10. This answer is not plucked from the air or thrown to the wind.\nThe heterogeneity of the sample is irrelevant in this context, as the date of any sample is from the whole sample, whether the new and old threads were neatly separated or intricately blended makes no difference. Neither we, nor Jones, are talking about the whole shroud here. He cannot accept that the Nature dates are achievable by chance, which is the whole basis of his conspiracy theory. Actually they are.\nIncidentally, as long as the contamination was between about 1500 and 1900, it doesn’t even matter if we don’t know what date it was from. If I rephrased my question as follows: “What is the probability that a random percentage of cloth, from a random year between 1500 and 1900, added to a cloth made in 25AD, could result in a radiocarbon date of between 1260 and 1390?” the answer is still about 1 in 10.\nI simply can do the math, and so can anybody else. Dan is perfectly correct that to that extent, Sue and Joe’s contamination hypothesis is more probable than it may previously have appeared – although there does have to be an awful lot of it.\n\n","date":"May 29, 2014 at 1:39 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125523","author":"Hugh Farey","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"Yes, Hugh, but the problem is that we cannot just “pick a random percentage between 0 and 100.” The chances for contamination percentage are not random factor. That’s why all those considerations are in fact meaningless.\n\n","date":"May 29, 2014 at 1:56 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125530","author":"O.K.","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"Note that all my dates are calendar dates, not BP (Before Present) dates as produced by the raw calculations from C14 decay. As it happens it makes little difference to the answer, but it may help anybody who wants to check my calculations!\n\n","date":"May 29, 2014 at 1:42 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125524","author":"Hugh Farey","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"You don’t get it.\nWhat is the probability to get any valid date (significance level > 5%) given an heterogeneous sample ?\nIt depends on the number of sub samples you test and their (local) heterogeneity.\nYou can’t do the math.\n\n","date":"May 29, 2014 at 2:00 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125532","author":"anoxie","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"Let me ask the dumb questions. Are the odds against getting a 1325 +/-65 date astronomical? Is there any way with math to show that he Stephen is right or wrong?\n\n","date":"May 29, 2014 at 2:42 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125540","author":"Dan","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"Let me ask the dumb questions. Are the odds against getting a 1325 +/-65 date astronomical? Is there any way with math to show that he is right or wrong?\nDepending on point of view. The question “Are the odds against getting a 1325 +/-65 date astronomical?” is imprecise. It can be interpreted in various way, depending how you set a problem.\nEven if the cloth is from the 1st century, with no contamination, patches etc., obtaining 13th-14th century date is theoretically possible, but not even astronomically but cosmologically unlikely.\nBut if there is a patch or contamination, considering it this way makes no sense. There is no way to calculate the odds. \nAs you can see, all depends on primary assumptions. There is always a risk of equivocation.\n\n","date":"May 29, 2014 at 2:49 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125542","author":"O.K.","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"Stephen is either right or wrong when he says, “it would be a miracle if the Shroud being first century `just happened’, by a combination of chance factors, like contamination and medieval repairs, etc, to have a radiocarbon date of 1325 +/- 65, only 25-30 years before the Shroud’s first appearance in undisputed history.”  Or, are we thinking that there is no way to 1) know the odds, which is one thing, or there is no way to 2) know if Stephen is right, which is something altogether different. This could be the subject of the year.\n\n","date":"May 29, 2014 at 3:00 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125546","author":"Dan","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"Let’s answer this way:\nWhat are the odds against a “statistically valid” 1325 +/- 65 result if you re-test the shroud rigourously ?\nAstronomical, definitely.\n\n","date":"May 29, 2014 at 2:58 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125545","author":"anoxie","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"Stephen is either right or wrong when he says, “it would be a miracle if the Shroud being first century `just happened’, by a combination of chance factors, like contamination and medieval repairs, etc, to have a radiocarbon date of 1325 +/- 65, only 25-30 years before the Shroud’s first appearance in undisputed history.” \nHe is wrong. Such coincidence, although strange, is entirely possible if we assume reweave hypothesis -but extremely unlikely for other hypothesis like oil-wax contamination, neutron radiation, carbon monoxide enrichment or so. For several reasons, that I do not discuss here.\nHowever one should note that actual results are not so perfectly centered at 1325 +/-65. The results in Nature are (Table 3 http://www.shroud.com/nature.htm) AD 1273 – 1288 at 68 % confidence (that is 1 sigma) and AD 1262 – 1312, 1353 – 1384 at 95 % (2 sigma) confidence. So coincidence with first presentation of the Shroud at Lirey in 1356 is rather accidental than related, IMHO.\nImportant note: confidence and significance are two different terms!\nOr, are we thinking that there is no way to 1) know the odds, which is one thing, or there is no way to 2) know if Stephen is right, which is something altogether different. This could be the subject of the year.\nThere is no way to know the odds that contamination or patch would appear. That’s not the purely random factor that we can estimate.\n\n","date":"May 29, 2014 at 3:16 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125551","author":"O.K.","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"I still don’t think Anoxie really understands my argument, but let it pass. The probability that contamination is responsible is considerably less than the probability that the whole thing was a KGB plot (although I admit I’ve no way of calculating that!).\n\n","date":"May 29, 2014 at 4:22 pm","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125566","author":"Hugh Farey","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"I perfectly understand your argument.\nYou answered:\n“The heterogeneity of the sample is irrelevant in this context, as the date of any sample is from the whole sample, whether the new and old threads were neatly separated or intricately blended makes no difference”\nYou still don’t get it : if the sample is heterogeneous, you can’t use Christopher Ramsey’s OxCal and an online carbon dating calculator, simple as that (basic assumption is sub samples’ variations result from random fluctuations, no trend, no gradient).\nHugh you can’t do the math, but nobody said risk analysis is easy.\n\n","date":"May 31, 2014 at 7:21 am","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125892","author":"anoxie","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"The individual samples taken together don’t pass a chi square test; in fact a trend across the sample placements is evident.  Therefore unsurprisingly they’re not representative, and hence overall are meaningless.  Too much weight was given to non-intrusiveness of the object, and insufficient weight given to representative sampling.  I don’t even know why we’re still persevering with it!  Stephen’s conspiracy theory would be laughable if it weren’t so tragic for the reputation of more serious Shroud studies.\n\n","date":"May 30, 2014 at 4:15 am","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125667","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"That’s the point, i’m still wondering wether this dating was a failure or a scientific fraud :\n” there is only a difference in degree between `cooking’ the data and inventing a whole experiment out of thin air”\n‘cooking’ is the statistical shoehorn used to get a positive result out of this trend.\n\n","date":"May 30, 2014 at 6:12 am","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125682","author":"anoxie","site":"shroudstory"},{"title":"The Challenge for Stephen Now","post":"I would like new  radiocarbon tests to be performed with daveb of wellington nz as chief witness.\n\n","date":"May 31, 2014 at 10:59 am","url":"https://shroudstory.com/2014/05/29/the-challenge-for-stephen-now/","cat":"carbon_14_dating","id":"comment-125922","author":"PHPL","site":"shroudstory"}]
