[{"title":"The Chemist Rogers and Plastic Bags","post":"The scope of manipulations by Bella and colleagues is horrific.\nI think someone has to deal with it.\n\n","date":"September 14, 2015 at 3:15 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210341","author":"O.K.","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"According to Bella, “Of course, no one was able to criticize the key findings of [their] work” on this blog!!!\nHis definition of “pseudoscience” shows clearly that, unfortunately, you don’t need to understand philosophy of science to become a chemist.\n\n","date":"September 14, 2015 at 4:44 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210345","author":"Tristan Casabianca","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Interesting new colour scheme Dan. Might it have been inspired by the notion of a lightly-toasted flour imprint?\n\n","date":"September 14, 2015 at 9:53 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210365","author":"Colin Berry","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Or perhaps it’s a tea stain. Hmmmm.\n\n","date":"September 14, 2015 at 10:36 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210368","author":"David Goulet","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Tea stain? TS? Now why didn’t I think of that?\nActually, tea stains are due to tannins, DavidG.  Oh so last year… Some of us have moved on from purely chemical (or, before that, thermal, “scorch”  imaging). \nThink thermochemical, and no, not hot tea….But don’t forget to wash out the Maillard-reaction crust, and then focus on what’s left –  the far more subtle image underneath, probably confined to the interior of linen fibres.\n Plain white flour is far more versatile  in terms of its thermochemical and image-imprinting capabilities.  It provides protein, reducing sugars, oils etc.\n Flour does the business, being a thermochemical reaction cocktail, acting not only ON the surface of linen fibes, in response to applied heat, as in a medieval oven,\n but INSIDE them too…\n\n","date":"September 14, 2015 at 11:19 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210370","author":"Colin Berry","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"I believe that I’ll not be happy (I say this only speaking\nfor hypothesis…) if someone will want to ask a\nquantitative assessment of the lignin content\non linen fibrils (of the Holy Shroud) using mass spectometry…\nI say that because Dr. Ray Rogers indicated\na quantitative evaluation of Lignin in his paper\n(= “Scientific Methods Applied to the Shroud of Turin.\nA review.”) and also he stated that differences between\namount of lignin on linen fibers in the Raes sample\nand on Shroud samples are significant. \nRogers indicated us that simple microscopic viewing\nwas not sufficient to prove differences among the linen samples.\nIn any case he indicated us that no samples of the\nHolland cloth or Raes threads had heavy deposits of lignin…\nLignin amounts vary among Shroud locations and\nthis can be an interesting fact when it’s correlated with\nthe observations of bands of different colors…\nNewer linens are homogeneous and they do not show\nbands of different-colored yarn in the weave. …\nSo…\nColin,\nWhat is your opinion about the inherent implications\nWhat you can say to us about this fact?\nHave you an useful idea how to try to repeat\nyour experiments using a substrate made (weaved)\nwith different hank of linen yarns ? (…and at same\ntime working with your model…)\nLink:\nhttps://www.shroud.com/pdfs/rogers2.pdf\n-*-*-*-*-*-*-*-\nHere another very little thing:\n“adhesive tape composition” (…and mass spectroscopy).\nColin,\nWhat is your evaluation for possible solubility\nof the adhesive (= part of the tape) in the solvent (Xylene) used?\nComposition for the adhesive = an epoxy resin ???\nUnfortunately I have no past experiences in the field of\napplication of “isotope ratio mass spectrometry” for\ndiscrimination and comparison of adhesive tapes…\n\n","date":"September 14, 2015 at 11:35 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210372","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"But …\nHere I want to better clarify the presumed problem:\n“adhesives” in adhesive tapes …!\n\n","date":"September 14, 2015 at 11:38 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210373","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"If I am not mistaken, the abundances are not in the same proportions.\nFor example: see the comparison for the peak 69 in Fig. The “preview”\nof Bella-Garlaschelli-Samperi and the same peak in the other Fig. 2\n(in the same “TCA preview” Bella-Garlaschelli).\nY-axis and relative abundance:\n>…Signal intensity may be dependent on many factors,\nespecially the nature of the molecules being analyzed\nand how they ionize.\n>The efficiency of ionization varies from molecule to\nmolecule and from ion source to ion source.  …\n (Link:  https://en.wikipedia.org/wiki/Mass_spectrum )\nBella wrote:\n>…It happens that “oligomers from polyethylene” show\na spectra which peaks differ by 14 atomic mass units.\n>The parks at M=96 it is not furfural, but just one of these peak.\n>Therefore, the two spectra in Rogers paper differ only by\nthe peaks of the contaminant.\n>I believe it is not necessary to explain that plastic bags\nwere not so common in the Middle Age … etc. … etc. …\nUnfortunately, until now,\nI have not found the useful spectra (mass spectroscopy)\nand (also) Bella has not yet answered to me (on “polyethylene\nolygomers” …or … on solvated “tape adhesive” or\nfatty acid [coming from the people who were holding\nthe Shroud during exhibitions/ostensions]???)\nusing proper diagrams for inherent comparisons…\nSo I should only indicate the famous proposition n. 7\nof Tractatus Logico-Philosophicus, by Wittgenstein:\n “Whereof one cannot speak, thereof one must be silent.”\n(„Wovon man nicht sprechen kann, darüber muss man schweigen.”)…\n— — —\nYesterday afternoon I have followed the lecture\non “crop circles” by Paolo Attivissimo (an italian journalist).\nAfter depicting the history of crop circles\n(see also: the past interesting role played\nby Dough Bower and Dave Chorley…),\nhe claimed to have participated\n(during this year 2015) in a construction of\na big crop circle near Turin…\nThis in the context of a three-day outline for the\npresentation of the museum “Falseum”\n(http://www.falseum.it/it/) which I have not visited\nbecause I had no more time …\nHere some particular conjectures:\nWas Raymond Rogers an absent-minded person\n(because he was a suffering person, with his cancer),\na liar, a trickster or (perhaps) a sort of “circlemaker” ?\n\n","date":"September 14, 2015 at 10:44 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210369","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"The clue to understanding why Ray Rogers, an acknowledged expert in  chemical explosives, more specifically their stability and safety on storage, is to be found in John Heller’s book on Page 6\n.\nThere he writes “Because of his work on explosives, Ray Rogers  was an eminent expert in thermal effects”.\nNo, he wasn’t an expert in thermal effects generally, in the sense of understanding or being able to predict the complex sequence of chemical changes that can be initiated by heat (that being a vast area in which no one individual can hope to know it all).\nThere seems to have been a misunderstanding on the part of John Heller, and probably the initiators of STURP generally.\nRay Rogers chose DSC (differential scanning calorimetry) as a means of monitoring the kinetic stability of chemical explosives. It involved applying metered amounts of thermal energy (“heat”) and monitoring temperature change. Flat regions on the heat/temperature plot are referred to as “endotherms” which indicate where heat is being absorbed to break chemical bonds, the first step in chemical reaction, and in this instance explosive decomposition,.Those endotherms can be used to calculate kinetic parameters (notably activation energy) but it’s arguably more physics (or physical chemistry) than test-tube chemistry.\nAn expertise in DSC does NOT make one an expert in thermal breakdown pathways generally. It provides no data on detailed mechanism generally. \nRay Rogers was pre-eminent in his field of explosives-stability testing. That expertise did NOT equip him to elucidate the mechanism by which the TS image was formed, whether thermal, chemical, or thermochemical.  His elevation to role of chemical sainthood is sadly laughable to anyone with the briefest acquaintance with chemical science.  That much becomes clear when one looks at the way his Pliny-era  “starch-coating impurity” hypothesis is casually inserted into a pro-authenticity narrative as if fact, with the terms starch, impure starch, crude starch, starch fractions, dextrins, reducing sugars being used interchangeably.\nStarch is starch. It does NOT spontaneously break down to dextrins and reducing sugars on ageing. The Rogers “starch impurity coating” may be correct, but the “sugar-coated” extension of that hypothesis is/was palpable nonsense.\nRogers was a gifted hands-on chemist, but he became increasingly prone to mix speculation and fact post the STURP 1981 Summary, as did other ‘leading lights’.\n Group think?  Maybe. Group-think is the bane of science.\n\n","date":"September 14, 2015 at 12:31 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210378","author":"Colin Berry","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Colin,\nyour particular “chemical-sociological analysis”\nseems to be interesting (link: https://it.wikipedia.org/wiki/Groupthink  and then see also: https://en.wikipedia.org/wiki/Deindividuation). But not decisive as regards the solution of the problem of mass spectroscopy on alleged “oligomers of polyethylene” …\nThe point to clarify seems to be\nthe determination about the chemical chain:\n“…a long chain aliphatic” ??\n(Is really the only key to solve the question?)\nBut … How long is this -CH2- chain?\nHere I speak about the idea to measure the lenght of that methylene chain (-CH2-) starting from the key-number 14 (=12+2= one Carbon and two Hydrogen atoms)…\nOther questions:\n– Please, observe the peak 69 in “Shroud-image fiber”, this peak seems not to have the same higher (see also: “Y-axis and relative abundance”) in “Raes sample-fiber”…\n– The higher of the peak 131 is not the same (because it’s more high in “Shroud-image fiber”).\n– In the mass spectrometric diagram of “Shroud-image fiber”\nare present the peaks:  119(?),126(?), 169, 181 and 219. Instead there are not these peaks in the mass spectrometric diagram of “Raes sample-fiber”…\nSo I think that a computer analysis of mass spectrometries (or the trained eye of an expert “mass spectroscopy analyst”) would save us time in order to solve the “little enigma”…\n\n","date":"September 15, 2015 at 9:34 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210448","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Here some words, trying to return to the particular “chemical-sociological analysis” unveiled by Colin…\nI should be happy if the same relentless pursuit of “analytical perfection” (= regarding “polyethylene oligomers” or not …) would be happen about the ATR FTIR analysis. “The penetration depth into the sample is typically between 0.5 and 2 micrometres” (and this is the same [vague] information we can read in the book by Prof. Fanti).\nWhat can see into the linen fibrils using the ATR FTIR analysis? \nFor example : in the book (by Prof. Fanti, it. edition pp. 294-295) there are two example of linen fiber diameter = 15.7 micrometres and 22.8 micrometres.\nSo, we can try to calculate something…\nIf you take the minimum penetration the percentage is the following:\n0.5/15.7 = 0.0318 = 3.18%  —> 6.36% with respect  the entire diameter\n05./22.8 = 0.0219 = 2.19%  —> 4.38% with respect the entire diameter\nInstead if you take into account the maximum penetration the percentage is the following:\n2/15.7 = 0.12738 = 12.74% —-> 25.48% with respect the entire diameter\n2/22.8 = 0.0877 = 8.77% —-> 17.54% with respect the entire diameter\nAnd then see also what can be the relation between the inherent thickness of PCW, S1, S2 (on observed linen fibrils) and the results obtained using a different lenght of “penetration depth”.\nIn other words:\nI am curious to know more about the criterion used to calibrate the ATR-FTIR penetration depth into the linen samples…\nThis doesn’t appear in the book. \nAm I wrong in these simple “pre-optical remarks”?\n\n","date":"September 15, 2015 at 10:11 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210453","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"“The STURP members invested significant time and resources because most of them believed in its authenticity.”\nNon-authenticists often say that the majority of the STuRP team were fundamental Christians who either thought the Shroud was genuine or fervently hoped it was genuine. Authenticists often counter this by pointing out members of the team who were not fundamental Christians. I don’t know how meaningful either of these statements are.\nShroud.com lists 33 members of STURP, of whom 26 went to Turin in 1978. Some are virtually unknown (What did Rudolph Dichtl, Donald Janney, John German or Thomas Haverty actually do in Turin?), and the vast majority, having produced their report, do not seem to have involved themselves in the subject further. Joseph Accetta and Eric Jumper think the Shroud is medieval (although Jumper is reported as wavering on this recently), while Jackson, Bucklin, Rogers and Schwortz are/were on the side of authenticity. Even the authenticists, however, do not all see the Shroud as evidence of anything supernatural, especially the Jewish Schwortz, Adler and Devan. I don’t think the personal opinions and religions of the team are a fruitful line of inquiry.\n\n","date":"September 14, 2015 at 12:37 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210379","author":"Hugh Farey","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Dear Hugh,\nThis time I mostly agree with you. But please notice what a blog is: a personal diary. In this context (not in a scientific paper, of course) I think that some personal opinion are acceptable. When we read a book, there is always the biography of the author. I believe that knowing the life story of someone might be useful to better understand his writing. In this specific context (see how my post begins) to briefly discuss the personal opinions of STURP members it is appropriate. I fully agree that a scientific work should only be evaluated on the base of data, and nothing else.\n\n","date":"September 16, 2015 at 12:27 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210533","author":"Marco Bella","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"No one is obliged to impose a belief on anyone else. Most Christians and some Jews (and not only Messianic Jews) believe in Jesus’ resurrection. Some pro-authenticists believe that the relic demonstrates a supernatural event, others don’t. In the latter group are those who believe that Jesus survived the crucifixion and went to India. To say that, in my view, is to judge Jesus to have been the greatest liar and trickster, or expert magician, in history. I did not see any of the “Shroudies” at the Hampshire event telling the people there that they got their history wrong. Alright, they chose to keep quiet. But, at least they could have asked them why they did not send a letter to Turin, asking the clerics to transfer the relic to any of the museums listed in the link:\nhttps://en.wikipedia.org/wiki/List_of_magic_museums\n?\n\n","date":"September 14, 2015 at 1:35 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210384","author":"Louis","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"So ends reweaving. Next idea?\n\n","date":"September 14, 2015 at 1:38 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210385","author":"Paulette","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Nothing ends -the Bella et al. editorial is a manipulation. Which can be shown.\n\n","date":"September 14, 2015 at 1:40 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210386","author":"O.K.","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Nothing new!\nWhat is really shocking is what follows:\n1) the authors try to make believe that in Rogers’ paper “According to the Author [Rogers], however, the key evidence to support this thesis is the analysis of two pyrolysis spectra”.\nRogers never said that.\nHis analysis of the Py-MS spectra is just one of several evidence (cotton, vanillin, chemical testing).\nRogers, contrary to the authors gathered several data before writing his paper.\nThe authors worked only on 2 spectra and concluded that Rogers was entirely wrong !\n2) The authors did not take into account the proofs I gave regarding peak at mass= 131.\nThey do not hesitate to repeat  in their final paper their mistake based on a misunderstanding of a single sentence in Rogers’ paper.\nMore seriously the authors wrote:\n“No diagnostic peak in the pyrolysis mass spectra indicates a significant difference in the two samples, besides hydrocarbon-derived contamination. Therefore, none of the presented data supports the conclusion by Rogers”.\n“No diagnostic peak in the pyrolysis mass spectra indicates a significant difference in the two samples, besides hydrocarbon-derived contamination.”\nRogers would agree apart from the nature of the contaminant.\nAbout the nature of the contaminant:\nAs a proof of their conclusion, the authors show an example of “mass spectra from a molecule with a long aliphatic chain(exadecan-1-ol), which fragmentation pattern is similar to the contaminant presents in the Raes sample (sample b)”\nThey concluded that the contaminant in Raes spectrum IS an hydrocarbon-derived molecule.\nThis conclusion is simply pseudo-science.\nIt’s very easy to find many molecules from other species with a mass spectrum almost exactly similar to the Raes spectrum.\nIt is a hard work and I am currently working with somebody who has much more knowledge of MS than me.\nBe sure that there will be an answer.\n\n","date":"September 14, 2015 at 3:08 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210389","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Yes, Thibault there will be an answer.\nYou don’t have to even have an expertise in this field to show that this whole editorial is a pseudoscience. Just careful analysis of their wording and paper content…\nI wrote: “Bella et al. editorial is a manipulation. Which can be shown.”\nI have sent Dan some of my observations on that. I hope they will be published.\n\n","date":"September 14, 2015 at 3:18 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210390","author":"O.K.","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"This is merely Rogers bashing, unsupported by facts obviously.\n\n","date":"September 15, 2015 at 1:01 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210421","author":"anoxie","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"That’s rich, coming from one of the usual suspects who routinely engages in Berry-bashing on this site.\nHere’s something else that will no doubt be portrayed as Rogers-bashing, when it’s nothing of the sort, and indeed is merely an essential part of the self-correcting process that is science. (The anoxies of this world simply do not understand how science works). \nRogers claimed that the coloration of TS image fibres was confined to a highly superficial layer that could be retained by his Mylar adhesive tape when the fibre was plucked out with forceps. That’s become an essential part of TS orthodoxy – something one dare not challenge.\nWell, I’m going to challenge it. My flour imprints after washing with soap and water are faint, almost TS-like one might say, but are still easily visible. But when one examines under the microscope one sees scarcely any yellow colour except ever so faintly in bundles of longitudinal fibres. Individual fibres look essentially colorless.  The same would have applied perhaps to Rogers, viewing highly light-reflective linen fibres longitudinally.\nWhat if there was colour inside the fibres, but one was prevented from seeing it by the light reflecting/refracting properties of flax fibres that are polyhedrons (5 – 7 sides) in cross-section?\nThat would appear to be the problem, since the colour becomes  easily visible when one views the fibres in cross-section (the latter responds well to photo-enhancement).\nNo,  I’m not going to display my microphotographs, thanks to the likes of that spivvy and insufferable Paolo Di Lazzaro who uses my pictures to make cheap shots at my expense about not knowing how to focus a microscope. He’ll have to find himself another fall guy if wishing to use this or other internet sites to further display his profound ignorance of photochemistry. \nSuffice it to say that the images one sees of thread cross-sections  and.or angled mountings may well help elucidate the nature of the half-tone effect, discontinuities etc.  Anyone here with a better microscope than mine (Hugh especially, judging by that recent picture of him with an upmarket binocular model) has only to to email me, and I’ll happily share with them my technique and preliminary pictures (no obligation) to do with as they wish.\n I’m only here for the science (but will continue to blow the whistle on bad science whenever I see it, indifferent to  whether the perpetrator is living or now departed). Science has to self-correct. It’s why science so often works when other methods of enquiry have failed to yield unambiguous answers.\n\n","date":"September 15, 2015 at 2:06 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210426","author":"Colin Berry","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"There is a more important target than Rogers.  The true agenda is a pathetic attempt to support the spurious radiocarbon dating, and thus to discredit the Shroud as an authentic relic of Christ’s burial.\n\n","date":"September 15, 2015 at 2:09 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210428","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"What is this joke. Scientists are attacking each others work. As Daveb says there must be an agenda.\nWho is misinforming the world. Earlier eggs are bad now good for health. Coconut oil is worse now it is the best oil for health.\n\n","date":"September 15, 2015 at 2:35 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210429","author":"Sampath Fernando","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"“The Midwest Center for Mass Spectrometry (MCMS) at the University of Nebraska, Lincoln, made dozens of scans on different samples in 1981. […] Seven different samples underwent multiple analyses at MCMS. […] “Some of the samples came from areas of apparent blood flows, some from scorched areas, one (“the Zina thread”) was a complete yarn segment that had been withdrawn from the heel image area, one came from a pure image area, one came from a water stain in an image area, and several were modern reproductions of ancient linen technology.” From Rogers’s Thermochimica Acta paper.\nIf we suppose the word “some” to mean “two” and “several” to mean a minimum of “three”, the seven samples mentioned in sentence two have become at least ten by the end of the quote.\nWhat does this mean, and, crucially, where are the scans? Rogers selected two to illustrate, from a Raes thread (who scanned that?) and from a “Shroud image fibre.” \nCarefully rereading Rogers’s paper (and in view of Nitowski’s comments about who had what in 1996), it is not apparent that he was in possession of any Shroud fibres when he investigated the patch hypothesis, not that he carried out, or had others carry out, any mass spectrometry at that time. All his experiments were microscopical and chemical, and all carried out on the Raes and radiocarbon sample fibres he had at the time. Any comparison with Shroud fibres and the Holland was with previous data. A comparison of more spectra might help to confirm or to refute his case. Does anyone know where it may be found?\n\n","date":"September 15, 2015 at 2:08 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210427","author":"Hugh Farey","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"See the matrix of samples analyzed at the MCMS p.53 of the book.\n“If we suppose the word “some” to mean “two” and “several” to mean a minimum of “three”, the seven samples mentioned in sentence two have become at least ten by the end of the quote.”\nI don’t understand at all what you mean.\n“(…) where are the scans?”\nI asked the same question to Barrie who is the custodian of the Rogers’collection.\nHis answer:\n” I did not find any spectra [on Rogers’ computer] and probably won’t because in those days the spectra were recorded by a chart recorder and not by a computer.  There may be some additional data in the boxes of Rogers materials I have, but I have not had time to go through them (there are 8 large boxes).”\nBut be sure that Rogers carefully analyzed the charts before writing his paper.\n\n","date":"September 15, 2015 at 3:39 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210481","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"“I don’t understand at all what you mean.” Over the course of a single paragraph, Rogers contradicts himself. How many samples were analysed? Why was he not precise?\nNo. I am certainly not “sure that Rogers carefully analyzed the charts before writing his paper,” and even if he did, I should like to analyse them myself. However Barrie may be correct that they are in the boxes he left on his death, and I dare say we will have to wait until they can be examined. However, Rogers did say that polythene showed up on the scans, and Bella shows that one of the only two scans published shows a spectrum which would corroborate that.\nMeanwhile, was there only one copy of the scans made? Did Rogers not show them to anybody? This secrecy about what seems to me fairly important evidence is all very peculiar, don’t you think?\n\n","date":"September 15, 2015 at 4:32 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210484","author":"Hugh Farey","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"” How many samples were analysed?”\nSeven.\n“Seven different samples underwent multiple analyses at MCMS”-Rogers.\nBut some of them (Raes sample and perhaps modern samples) were likely divided and analysed separately (“Compared with fibers extracted from the sample tapes, there was ample material from the Raes sample …”).\nIs it important. No.\n“No. I am certainly not “sure that Rogers carefully analyzed the charts before writing his paper,” and even if he did, I should like to analyse them myself.”.\nSo, when Rogers wrote (in his book): “Maps of all of the other samples were also obtained. They all showed the same difference in product ratios: the Raes sample was unique”.\nDo you really think what you wrote?\nYou can disagree with Rogers’ interpretation of the spectra but you can’t suggest that he didn’t not look carefully at all of the data before writing his paper.\n” However, Rogers did say that polythene showed up on the scans, and Bella shows that one of the only two scans published shows a spectrum which would corroborate that.”\nI will give an answer to Bella.\nBut I can’t believe that you so much underestimate Rogers. \n“This secrecy about what seems to me fairly important evidence is all very peculiar, don’t you think?”\nNo.There is no secrecy at all.\nWhat kind of secrecy?\nThibault.\n\n","date":"September 16, 2015 at 3:23 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210539","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Seven samples were analysed. SEVEN\n“Some of the samples came from areas of apparent blood flows” At least TWO.\n“some from scorched areas” At least TWO\n“one … was a complete yarn segment.” ONE\n“one came from a pure image area” ONE\n“one came from a water stain in an image area” ONE\n“several were modern reproductions of ancient linen technology.” At least THREE\nNot forgetting the Raes sample. Another ONE.\n“Maps of all of the other samples were also obtained. They all showed the same difference in product ratios: the Raes sample was unique.” Really? The scorched areas looked the same as the image areas which looked the same as the modern reproductions? But the Raes sample, whose spectrum showed the “parts per billion\ntraces of oligomers from the polyethylene bag” was different from all of these. If Rogers’s supposed pentosan is correct, and Marco Bella’s polymer lines are incorrect, then where are the lines for the polyethylene bag which Rogers said were detected by the MS machine? I cannot find a spectrum for polyethylene on the internet, so am unable to confirm either Rogers or Bella in this respect.\n“Do you really think what you wrote?” Yes, I’m afraid I do. I cannot believe that I am the only person to be interested in the “dozens of scans on different samples” and yet there is no evidence even for their existence outside Rogers’s own comments. I do not for one moment believe the tests were not carried out, but I do think it beyond credibility that nobody apart from Rogers took any interest. It is becoming increasingly apparent to me that, undoubted expert though he was, Rogers was a bit of a maverick in Shroud circles, and I would not be at all surprised to hear that he kept his findings entirely to himself. In the absence of any information either way, neither I nor you nor anybody else can be sure what they showed, or how carefully they were analysed.\n\n","date":"September 16, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210543","author":"Hugh Farey","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Professor Marco Bella has correctly noticed that some people are mixing things up, as though depending on the authenticity of the Shroud to continue to believe in Jesus. I have had frank discussions about this point with prominent Shroudies and can confirm what he is saying. I cannot say anything about the professor’s beliefs, but the fact that at least one co-author of the paper is a well-known sceptic appears to have prompted some “Shroudies” to be suspicious about everything.\nWhat one can say with certainty is that Turin does not seem to take papers in Shroud research seriously and we cannot hope that any doors will be thrown open for another hands-on examination, or for another round of carbon dating.\nOxford has said that its doors are open for carbon dating, however the differences in opinion about why exactly the 1988 results may have been skewed would have to be sorted out first. Professor Christopher Ramsey made that very clear:\n https://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nIn his last Shroud book “The Shroud.The 2000-year-old mystery solved” Ian Wilson provides  a complete picture about what has gone on and even doubts that any solution can be reached, considering many things that have been published so far, and why the relic may not even be an artefact suitable for carbon dating.\n\n","date":"September 15, 2015 at 9:52 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210449","author":"Louis","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"The first one who is mixing things up is “Professor” Marco Bella.\n\n","date":"September 15, 2015 at 9:55 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210451","author":"O.K.","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"The Church does not mix things up, it places emphasis on canonisation.\nGiven the chaotic world we live in people are looking for responses, something “palpable” that can serve as a prop for faith.\nGood Father Francis O’Leary had a spiritual interpretation of the Jospice Mattress Imprint, with which I could not agree. Poor Mother Teresa spent a number of years doubting the existence of God, while carrying on the work she was doing. She discussed her doubts with Archbishop Perrier of Calcutta, but there is no record of her looking to relics for solace. She of course never really gave up her faith.\nThe Church holds the Shroud expositions because of tradition, just as the “Veronica”\nis exhibited once a year in Saint Peter’s Basilica, Rome. For the rest:\nhttps://www.academia.edu/14795646/An_interview_with_Professor_Heinrich_Pfeiffer_SJ\n\n","date":"September 15, 2015 at 11:44 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210463","author":"Louis","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"The Shroud does not seem to be on the agenda now. Canonisations sometimes take dozens of years and involve tons of documents and that also happens when a candidate has to be declared “Venerable”. For instance, it is the case of the Swiss Capuchin Archbishop Anastasius Hartmann, who was archbishop of Patna and Bombay, both cities in India:\n  http://catholicsaints.info/venerable-anastasius-hartmann/\n\n","date":"September 15, 2015 at 3:04 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210476","author":"Louis","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Bono prays to Jesus and believes in….","date":"September 16, 2015 at 4:34 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210541","author":"Louis","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"I have observed (another time) the\n“oleic acid mas spectrometry” and then\nI have seen the presence same peaks:\n55 (but the right number that was shown in “Raes sample-fiber”\n[Fig. 5 from paper by Rogers] was 56 !!!), 69, 83, 97, 111.\nAlso this (mass spectroscopy) diagram shows the “-CH2-” peaks…\nSo…\nIs that a sufficient “proof” to disprove Ray Rogers or Marco Bella ?\nYes or not?\n“No, or not completely…”, it’s my answer…\nHas been (Prof. Bella) trying to built a sort of\nchemical “crop circle” with his own\ninterpretation of mass spectrometry\n(regarding that “Raes sample-fiber”) ?\n…and I then I reach the following conclusion:\nWe have to be more careful when we want\nto work with mass spectrometry diagrams!\nLinks:\nhttp://lipidlibrary.aocs.org/Analysis/content.cfm?ItemNumber=39508\nhttp://aocs.files.cms-plus.com/LipidsLibrary/images/Importedfiles/lipidlibrary/ms/ms21/file.pdf\n(page 2 of that file in .pdf format)\n— —\nHere an old (1980) reference:\nComputerized mass spectrum prediction and ranking\nN. A. B. Gray, R. E. Carhart, A. Lavanchy, D. H. Smith,\nT. Varkony, B. G. Buchanan, W. C. White, L. Creary\nAnal. Chem., 1980, 52 (7), pp 1095–1102\nPublication Date: June 1980\nLink:\nhttp://pubs.acs.org/doi/abs/10.1021/ac50057a023\nOther bibliographic references:\n1 – New Computer Aided Methods for Revealing Structural Features of Unknown Compounds Using Low Resolution Mass Spectra\nby\nKonstantin S. Lebedev and Daniel Cabrol-Bass\nJ. Chem. Inf. Comput. Sci., 1998, 38 (3), pp 410–419\nPublication Date (Web): February 28, 1998\nCopyright © 1998 American Chemical Society\n2 – Automatic Spectra Interpretation, Structure Generation, and Ranking\nPatrick Fontana and Ernö Pretsch *\nJ. Chem. Inf. Comput. Sci., 2002, 42 (3), pp 614–619\nPublication Date (Web): March 22, 2002\nCopyright © 2002 American Chemical Society\n3 – Optimization and testing of mass spectral\nlibrary search algorithms for compound identification.\nS.E. Stein, D.R. Scott\nJ. Am. Soc. Mass Spectrom., 5 (1994), pp. 859–866\n4- An integrated method for spectrum extraction and\ncompound identification from gas chromatography/mass spectrometry data.\nby S.E. Stein\nJournal of the American Society for Mass Spectrometry\nVolume 10, Issue 8, August 1999, Pages 770–781\n— — —\nDo you know what is AMDIS?\nAMDIS – Automated Mass spectral Deconfolution and Identification System …\nI have found this acronym with the following link:\nhttp://www.nist.gov/oles/upload/11-Stein_Steve-Mass-Spec-Reference-Libraries-for-Forensics.pdf\nLinks:\nhttp://chemdata.nist.gov/dokuwiki/doku.php?id=chemdata:amdis\nhttp://chemdata.nist.gov/dokuwiki/doku.php?id=chemdata:amdisexplained\n…AMDIS was developed at NIST for the critical task of verifying\na major international treaty, the Chemical Weapons Convention. …\n The overall process involves four sequential steps:\n1 – noise analysis\n2 – component perception\n3 – spectral “deconvolution”\n4 – compound identification\n— — —\nWhere are the experts in the field of mass spectrometry ?\n… Where are they (…secretly hidden?)?\n\n","date":"September 15, 2015 at 11:50 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210465","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Dear Piero,\nAs I tried to suggest several times, go to someone you trust who knows mass spectrometry and bring Rogers paper. The expert will explain you why there is no significant difference between the two spectra, except the contaminant. Whatever it is, it should not be there. Please notice that olive oil does not  generally contain oleic acid as such, but its ester with glycerol (triglyceride), and in every case there is no reason why it should be present in Raes sample.\n\n","date":"September 15, 2015 at 2:07 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210472","author":"Marco Bella","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"One of us is not in the least bit surprised to see evidence (of sorts) for traces of olive oil (or one of more of its fatty acyl side chains) on the TS. A little vegetable oil makes flour imprinting off a human subject simpler and faster. The flour sticks better to oil-smeared skin, and as a bonus speeds up colour development in the oven.\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/08/is-high-energy-laser-beam-really-needed.html\n\n","date":"September 15, 2015 at 2:26 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210473","author":"Colin Berry","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"dear Colin,\nI do not think it is olive oli. It is not on the image, but on a corner (Raes Sample) where there is no image.\n\n","date":"September 15, 2015 at 3:06 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210477","author":"Marco Bella","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Dear Marco,\nYou wrote: “The expert will explain you why there is no significant difference between the two spectra, except the contaminant. Whatever it is, it should not be there.”\nI asked you many time in vain what is the difference with Rogers with the exception of the chemical nature of the contaminant.\nYou both agree that the Raes sample is contaminated and that the contaminant, “whatever it is should not be there!”\nWhat do you mean exactly by “contaminant” ?\nDo you think that the Gum/Dye contaminant found by Rogers is not a contaminant in the sense you give this word ?\nIf yes, please explain.\n\n","date":"September 15, 2015 at 2:48 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210475","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Dear Thibault,\nRaes (textile expert) examined in 1973 the corner of the Shroud where the so called “invisible mending” should be. No evidence of mending. Vial and Testore (textile experts) decided in 1988 to cut the C14 sample nearby, because they were convinced the linen was all the same. They did not described any mending. After the Benford and Marino (no textile experts) hypothesis became popular, Flury-Lemberg (textile expert) analysed again that corner in 2002, and even the back of the cloth. She strongly denies that it any mending could be present. The proof of a mending there should be really strong.\nIn Rogers paper, the only data we can check is the two mass spectra. They have little differences except for the cluster of peaks on the left differing by 14 atomic mass units. Please notice that dyes and natural gum (arabic gum is a mixture of glycoproteins and carbohydrates) would not give a similar spectra, while it is compatible with the presence on Raes sample of “oligomers from polyethylene”. Rogers wrote he actually detected them. Furthermore, what Rogers believed to be furfural (the peak at m=96), a decomposition product of pentosanes, it is actually just one of the peaks due to the contaminant. \nI thik that this is enough. Let’s Rogers rest in peace.\n\n","date":"September 16, 2015 at 11:33 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210528","author":"Marco Bella","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Thanks Marco,\nAt least I have an answer.\nSome comments later.\n\n","date":"September 16, 2015 at 2:24 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210536","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Dear Marco,\nYou wrote: “Please notice that dyes and natural gum (arabic gum is a mixture of glycoproteins and carbohydrates) would not give a similar spectra,…”\nI know what Arabic gum is.\nAre you sure that Arabic gum “would not give a similar spectra” ?\nI’ll show you probably the contrary (more work is needed).\n“… while it is compatible with the presence on Raes sample of “oligomers from polyethylene”\nIn your paper you showed the example of ” “exadecan-1-ol” (in fact: “hexadecan-1-ol” or better: 1-Hexadecanol ). \nAll of the MS spectra of this kind of compounds (including 1-Hexadecanol) show strong peaks between m/z= 40 and m/z=50 (particularly m/z= 43).\nIf you look at Fig.5 in Rogers’paper there is absolutely no peak between m/z=40 and m/z= 49.\nMoreover some of these spectra do not show at all the pattern that is supposed to be “the characteristic peak pattern derived from the fragmentation of a molecule with a long hydrocarbon moiety”\nIf the contaminant is what you think, how do you explain the lack of peak between m/z=40 and m/z=50 in Fig.5 of Rogers’paper ?\n\n","date":"September 17, 2015 at 3:21 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210596","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"If that helps, we can use instead of “contaminant” the words “external contaminant”\n\n","date":"September 16, 2015 at 3:12 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210538","author":"Marco Bella","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Dear Thibauld,\n———\n>In your paper you showed the example of ” “exadecan-1-ol” (in fact: “hexadecan-1-ol” or better: 1->Hexadecanol )\n——-\nCorrect. There is an “h” missing.\n——————\n>All of the MS spectra of this kind of compounds >>(including 1-Hexadecanol) show strong peaks between >m/z= 40 and m/z=50 (particularly m/z= 43).\n>If you look at Fig.5 in Rogers’paper there is absolutely >no peak between m/z=40 and m/z= 49.[….]\n>If the contaminant is what you think, how do you >explain the lack of peak between m/z=40 and m/z=50 >in Fig.5 of Rogers’paper ?\n————–\nThis is actually a very good observation. It is correct that there should be a peak around M=43, while there is absolutely nothing below M=49. However, we should take into account the instrument used and the settings.\nRogers wrote:\n———–\n…The chemical-ionization system used was the most sensitive MS at the time, sufficiently sensitive to detect parts per-billion traces of oligomers from the polyethylene bag that Gonella had used to wrap the Raes threads. The instrument at MCMS is equipped with a pulsed source…\n———-\nSince there is absolutely no other peak below M=49, it is most likely that the instrument was set to not acquire this part of the spectra. This is very common, because the peaks at low masses have little diagnostic value and their intensity might interfere with the other peaks, so it is better to cut them. If you see the spectra above, (fig 4), this is recorded without the zone below M=49. To be absolutely sure, one must see all instrumental setting (Which Rogers did not report).\n\n","date":"September 18, 2015 at 12:33 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210654","author":"Marco Bella","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Dear Marco,\nYou are right.\nI have found the proof that the the instrument was very likely set not to acquire data below m/z=50.\nThe proof is found in his book (p.56-57) where two mass/scan/intensity 3D maps are shown (sample 1EB and Raes sample)\nIn both cases, the origin of “mass data” is 50.\nBut do you consider my finding relevant, since I found it in his book and not in his paper ?\nMore seriously, regarding the “Scan/mass/intensity map” (Fig. VIII-6  in Rogers’book: Raes sample), Rogers wrote: ” The m/e 96 peak for furfural appears relatively early, and it disappears quickly”. \nWhatever m/e=96 is, this is an important observation:this peak “disappears quickly”.\nIt should be interesting to have more spectra from 1-Hexadecanol at different temperatures.\n\n","date":"September 18, 2015 at 3:23 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210663","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Marco Bella wrote:\n“… there is no significant difference between the two spectra, except the contaminant. Whatever it is, it should not be there.”\nBut then a few days later you wrote “it is compatible with the presence on Raes sample of “oligomers from polyethylene””.\nSo, your determination of the M-n14 peaks are definitively oligomers from polyethylene? I would revise this statement, see for example\nhttp://www.sciencedirect.com/science/article/pii/S0142941812000256\nThe mass spectra would have m/z values way above 500 for oligomers coming from polyethylene. Besides, this polyethylene contaminant should be so small that the spectra of the pyrolysis of the sample itself would have the major abundances, not the other way around.\nWhen you wrote your editorial publication you only gave a very general class of molecules for the contaminant (long hydrocarbon chains), which I believe is the only possible conclusion given the lack of more mass spectra at/of different times/temperatures. A more precise determination would require an identification of the other peaks, in particular peak m/z 131, which you have not identified its provenance.\nBut more importantly, your determination of the abundance of m/z 96 coming from the “contaminant” is unproven in your publication because until you know the other molecule(s) involved in that spectra (and the exact “contaminant” molecular structure), you cannot determine the relative abundance  for the m/z 96 peak coming from the “contaminant”. It can be a combination of two or more fragments of two or more different molecules interfering in the mass spectra. \nAlso, your statement that the relative abundance of m/z 126 would be non zero when removing that “contaminant” spectra is odd. The mass spectra shows a relative abundance of zero for m/z 126, and this is all that can be said.\nIn summary, your statement that the two mass spectra are identical once the “contaminant” mass spectra is removed is at least very approximate but essentially unproven.\nAnd what you consider a “contaminant” can actually be coming directly from the sample, in particular from sebum, which is mostly made of lipids, and the fact that this section of the Shroud has been heavily hand manipulated to hold and display the Shroud.\n\n","date":"September 16, 2015 at 3:26 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210540","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Dear Mario,\nI will try to answer your questions, but please, as said to others, seek the advice of someone who is expert in mass spectrometry before trying to attempt to formulate hypothesis. \nDIY does not really work in science.\nThe first paper you linked (have you actually read it?)\nhttp://www.sciencedirect.com/science/article/pii/S0142941812000256\nSpeaks about polyethylene TEREPHTHALATE, or PET. This is the plastic used to make bottles. This polymer DOES NOT have long aliphatic chains, but has\n(-CH2CH2-) units linked to phthalate. \nPolyethylene instead, is the material used to make plastic bags, and this contains long aliphatic chains.\nNames might sound similar but they are different molecules. Just check on wikipedia the difference.\n\n","date":"September 16, 2015 at 4:48 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210542","author":"Marco Bella","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Dear Mario,\nHere it is the rest of my answer.\n1)\n————-\n>When you wrote your editorial publication you only >gave a very general class of molecules for the >contaminant (long hydrocarbon chains), which I believe >is the only possible conclusion…\n———–\nI agree. With the reported spectra we cannot identify more precisely the contaminant. However, oligomers of polyethylene would actually give compatible spectra.\n2)\n———\n>more precise determination would require an >identification of the other peaks, in particular peak m/z >131, which you have not identified its provenance.\n——-\nCorrect, but the fact that this peak is present as the major peak in both spectra (not considering contamination) points towards identity of the two samples, therefore actually denying the “medieval invisible mending” theory.\nPlease notice that it is Rogers which should have given evidence about the “invisible mending”.\nLet’s assume you affirm that there is a “pink invisible dragon” in your garage which only you can see, giving only a very confused photo. Your job is to demonstrate this statement; my job is just to say that the photo is really confusing and that there is no evidence.\n3)\n——–\n>But more importantly, your determination of the >abundance of m/z 96 coming from the “contaminant” >is unproven in your publication..etc\n………..\nThis is unproven in Rogers’ paper. Surely, the contaminant would have this peak, and we do not have any element to say it is furfural. See also “pink dragon” argument, answer #2.\n4)\n———\n>Also, your statement that the relative abundance of m/z >126 would be non[-]zero when removing that >“contaminant” spectra is odd…\n——–\nAgain, this is Rogers’ problem, not mine. If the relative abundance of a peak is too low, it would not be quantified in mass spectra. Rogers, in order to show the absence of the peak at M=126 should have taken a cleaner spectra, where the major peak would be in both the one at M=131. Since this was not done, again we do not have any evidence. See “pink dragon” argument, answer #2.\n5)\n——\n>In summary, your statement that the two mass spectra >are identical once the “contaminant” mass >spectra is >removed is at least very approximate but essentially >unproven.\n——-\nIt is Rogers that should had given clear evidence about the “invisible mending”.  See “pink dragon” argument, answer #2. The statements of Rogers regarding the “invisible mending” are not only unproven, but also denied by his own data.\n6)\n———-\n>And what you consider a “contaminant” can actually be >coming directly from the sample, in particular >from >sebum….\n———-\nThis is very interesting because it demonstrate how Shroud scholar underestimates the consequences of their hypotheses. I agree: sebum (contains triglycerides) is compatible with the spectra of the contaminant. But if there is really sebum, that means that Rogers was not only once,  but twice wrong. First, when he thought that there were oligomers from polyethylene, and second when he thought that the two samples were different. If the contaminant would be sebum, the “invisible mending hypothesis” is then denied.\n\n","date":"September 20, 2015 at 12:42 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210767","author":"Marco Bella","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Dear Marco,\nIt appears that you are assuming that I think that the analysis of the Raes spectrum by Rogers confirms that gum Arabic is present on the sample he studied. I do not think that. \nMy first point is that there is not enough information provided with the spectrum to do its full analysis, in particular the temperature at which the spectrum was created and the energy of the ionization that was used for that spectrum. Also, it would require several spectra of that sample at different time during pyrolysis to help confirm the identity of the molecules involved.\nOn the other hand, the spectrum is not very far from what Rogers concluded, in particular, furfural appears present in that spectrum and the intensity at m/z 126 is negligible.\nMy second point is that you made an error by over interpreting that spectrum, in particular by asserting that by removing what you call the “contaminant” you would get the same spectrum as the image-only sample. But without identifying precisely that contaminant, it is not possible to come to that conclusion. You would need to quantify every peak of the contaminant, which you have not done, and which is not even possible to do given this single spectrum.\nYou also made a clear call on m/z 126, stating that it would become  a value similar to the spectrum from the image-only sample once the contaminant was removed. But, this is arithmetically impossible, if you do some simple calculation, whatever that contaminant is. (multiple by 4 (the ratio for m/z 131 between the two spectra) the near zero value of m/z 126, and you certainly cannot get close to 25 as in the image-only spectrum.)\nIn other words, something else appears at play with that spectrum and it could be what Rogers concluded or something more complex: gum Arabic mixed with sebum and some cellulose, or gum Arabic with some other material, or sebum with cellulose, etc.\nAlso, let’s not forget that the gum Arabic identification in Rogers’ paper was not based only on the spectrum. So a full appreciation of its conclusion is not strictly based on that spectrum.\nHow do you classify “pseudo-science”? Would an invalid manipulation of a spectrum be classified as “pseudo-science”?\n\n","date":"September 23, 2015 at 3:35 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210977","author":"Mario Latendresse","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Dear Mario,\nRegarding Arabic gum, here it is what Rogers wrote:\n————-\nA gum/dye/mordant coating is easy to observe on Raes and radiocarbon yarns. No other part of the shroud shows such a coating. The early thermal evolution of furfural during pyrolysis/ms analyses, the relatively easy water solubility, the yellow color formed with iodine, and the easy hydrolysis suggest gum Arabic. Gum Arabic is obtained from Acacia senegal and is composed of pentose-sugar units. Its presence as a major component in the coatings on the Raes and radiocarbon samples is not a surprise, because it has long been a common vehicle in tempera paints. The radiocarbon sample had been dyed. Dyeing was probably done intentionally on pristine replacement material to match the color of the older, sepia-colored cloth…\n————–\nSo, the presence of Arabic gum is “suggested” by:\n1)“thermal evolution of furfural [peak at M=96] during pyrolysis”> the peak at M=96 belongs to the cluster of the contaminant and, as said many times, could be many different things. A single peak in mass spectrometry is not enough to confirm anything.\n2)“Relatively easily [relatively respect to what?] water solubility”, you tell me which significance that has. Millions of substance dissolve in water, starting from salt and sugar.\n3)“yellow color formed with iodine” Millions of compounds form a yellow color with iodine, therefore it is used in most chemistry laboratories around the world to stain the TLC spots.\nYou tell me how reliable this identification is. \nYou also wrote:\n———–\n>On the other hand, the spectrum is not very far from >what Rogers concluded, in particular, furfural [the >peak at M=96] appears present in that spectrum and >the intensity at m/z 126 is negligible.\n———-\nPlease refer again to the “pink dragon argument” illustrated above. Find someone that knows how mass spectrometry works and ask how confident would the expert be to say that “…the spectrum is not very far from what Rogers concluded…”\n————\n>My second point is that you made an error by over >interpreting that spectrum…\n————\nThe title of our editorial is “There is no mass spectrometry evidence that the C14 sample from the Shroud of Turin comes from a “medieval invisible mending”. Please refer again to the “pink dragon argument”. What about the interpretation of Rogers? Can we speak of over interpretation here, should we use your standard? Do you really think he did present convincing arguments to dismiss what the textile experts stated after direct analysis of the Shroud?\n————\n>You also made a clear call on m/z 126, stating that it >would become a value similar to the spectrum from >the image-only sample once the contaminant was >removed. But, this is arithmetically impossible if you do >some simple calculation, whatever that contaminant is. >(multiple by 4 (the ratio for m/z 131 between the two >spectra) the near zero value of m/z 126, and you >certainly cannot get close to 25 as in the image-only >spectrum.)\n————\nAgain, go to an expert in mass spectrometry and ask. Briefly, response is not linear in mass spectrometry, and the ratio of peaks intensity changes with pyrolysis temperature (which Rogers did not report), so your argument is meaningless. Don’t DIY in science.\n—————\n>In other words, something else appears at play with >that spectrum and it could be what Rogers concluded…\n————–\nNothing can be concluded if you do not have enough evidence. The pyrolysis mass spectra have been taken in the eighties and left in a drawer for about twenty years. They resurfaced only to support the “invisible mending” theory. Why? Reasoning in the same way Rogers did in his paper I could easily say that there is an invisible pink dragon in my garage. \nAbout pseudoscience, here it is what is written on Wikipedia:\n—————\nPseudoscience is a claim, belief or practice which is incorrectly presented as scientific, but does not adhere to a valid scientific method, cannot be reliably tested, or otherwise lacks scientific status. Pseudoscience is often characterized by the use of vague, contradictory, exaggerated or unprovable claims, an over-reliance on confirmation rather than rigorous attempts at refutation, a lack of openness to evaluation by other experts, and a general absence of systematic processes to rationally develop theories.\nA field, practice, or body of knowledge can reasonably be called pseudoscientific when it is presented as consistent with the norms of scientific research, but it demonstrably fails to meet these norms.\n————\nDecide by yourself what can be considered pseudoscience among “invisible mending theory”, Rogers’ paper and our editorial, using as benchmark the above definition.\nWhy not just accepting the statement/title of the editorial “there is no evidence etc.”, forget about whatsoever “invisible mending” and let Rogers rest in peace?\n\n","date":"September 25, 2015 at 1:33 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-211187","author":"Marco Bella","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"About pseudoscience, here it is what is written on Wikipedia:\n—————\nPseudoscience is a claim, belief or practice which is incorrectly presented as scientific, but does not adhere to a valid scientific method, cannot be reliably tested, or otherwise lacks scientific status. Pseudoscience is often characterized by the use of vague, contradictory, exaggerated or unprovable claims, an over-reliance on confirmation rather than rigorous attempts at refutation, a lack of openness to evaluation by other experts, and a general absence of systematic processes to rationally develop theories.\nA field, practice, or body of knowledge can reasonably be called pseudoscientific when it is presented as consistent with the norms of scientific research, but it demonstrably fails to meet these norms.\n————\nDecide by yourself what can be considered pseudoscience among “invisible mending theory”, Rogers’ paper and our editorial, using as benchmark the above definition.\nYour editorial, Marco. Obviously. \nDon’t teach your grandmother how to suck eggs.\n\n","date":"September 25, 2015 at 3:24 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-211196","author":"O.K.","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Altough I had noticed some vague similitudes\n(= few peaks), I don’t believe in “Olive oil” as\ntrue solution of the “identification problem”…\nand then I agree with Marco Bella\n(= “I do not think it is olive oil”)…\nand that starting only from the m/s diagram\nand not for other explanations (such this =\n“…It is not on the image, but on a corner\n(Raes Sample) where there is no image”).\nSince Mass Spectra are reproducible,\nI think we have to check (= searching in\nthe mass spectra library) what is the possible\nSpectrum that exactly matches our mass\nspectroscopy diagram we have to interpret.\nStop.\nThis can be the work to do.\nIn my opinion, this problem is even trivial!\nSo…\nWhere are your own results?\n-*-*-*-*-*-*-\nHere what we can see under the address:\nhttp://www.kayelaby.npl.co.uk/chemistry/3_8/3_8_6.html\nregarding the problem of identification for\n“mass spectra obtained from the pyrolisis of a Raes sample-fiber”\nm/z = 55\nPossible associated group =  C3H3O\nPossible inference =  Some cyclic ketones\n… but we haven’t this number of mass,\ninstead we clearly read the numebr 56\nm/z = 56\nPossible associated group =  C4H8\nPossible inference = Hydrocarbon\nm/z = 69\nPossible associated group = C5H9\nPossible inference = Some Hydrocarbons\nm/z = 83\nPossible associated group = C4H3S\nPossible inference = Monosubstituted thiophenes\nBut it seems hard to believe to the presence\nof sulfur and then it would seem that this peak\nwas due to the repetition of known period n = 14\n(= CH2 = 12 + 2) …\nm/z = 97\nPossible associated group = C5H5S\nPossible inference =  Methyl or mono-alkyl thiophenes\nm/z = 131\nPossible associated group = C6H5CHCHCO\nPossible inference =  C6H5CHCHCOX\nIn any case, this analysis seem to be very rough…\nAnd then take into account that at 85 we have also\nthe possible furanic ring (with 2 Oxygen,\none into the ring and the other out)!\nLink:\nhttps://en.wikipedia.org/wiki/Furan\nLinks about Furfural m/s :\nhttp://webbook.nist.gov/cgi/cbook.cgi?ID=C98011&Mask=200\nhttp://webbook.nist.gov/cgi/cbook.cgi?Spec=C98011&Index=0&Type=Mass&Large=on\n\n","date":"September 16, 2015 at 11:51 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210529","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Errata corrige:\n>Although \ninstead of:\n>Altough\n— — *** — —\nYesterday I was disturbed.\n— — —\nHere what I want to add:\nin the paper by Dr. Ray Rogers\n“Pyrolysis/Mass Spectrometry applied to the Shroud of Turin”\nthere is a tridimensional diagram\n(=”mass/scan/concentration map of the pyrolysis products”)\nabout the sample “Shroud-image fiber”\n(Slide Number: “E1B”),\nbut there is not a tridimensional diagram\nfor the other sample (Slide Number: “Raes #3”),:\n “mass spectra obtained from the pyrolisis\nof a Raes sample-fiber”…\nSo…\nin my opinion, we cannot discuss\nin a deep manner the entire issue.\nSorry. I have just seen that the paper:\nhttp://www.shroud.it/ROGERS-3.PDF\nis a bit different (= there is no diagram about the\n“mass/scan/concentration map of the pyrolysis products”)\nwith respect the paper I had read years ago\n(and then this is under the Link:\nhttps://www.shroud.com/pdfs/rogers4.pdf).\nI beg your pardon!\nPerhaps Joan can help us.\nIn any case I am curious about\nthe probable paper written by “OK”…\nAlso Thibault seems to be promising, but\n(until now) we have no exact interpretations,\napart my goofy attempt (of yesterday)…\nand then here\n(regarding the boring problem of identification of\n“mass spectra obtained from the pyrolisis of a Raes sample-fiber”)\nI want to add the following (presumed) peaks: \nm/z = 73\nPossible associated group = C4H9O\nPossible inference = Alcohols, ethers\nmy comment: it’s possible…\n— —\nBut, see also:\nXylose, that is a component in hemicellulose…\n>…  cellulose contains only anhydrous glucose.\n>For instance, besides glucose, sugar monomers\nin hemicellulose can include xylose,\nmannose, galactose, rhamnose, and arabinose. …\n(Link:  https://en.wikipedia.org/wiki/Hemicellulose )\nXylose,\nwith main m/z = 73 (other peaks at:\n31 [29,30; 32], 43 [41, 42,; 44, 45], 60, 61 and 71, 72 ; 74)\nRef.:\nhttp://webbook.nist.gov/cgi/cbook.cgi?ID=C58866&Mask=200\nmy comment:\nprobably there is a very low percentage of xylose\nin linen fibrils (…but I have read  that\n“Cellulose” from cotton (!) contain near 1.5% of xylose\nand smaller amounts of other monosaccharides…).\nProbably there is a risk greater than an\nextraction from “raffle drum” (= caos) with\nthis kind of interpretation of spectra of mass spectrometry …\n— —\nm/z = 81\nPossible associated group = C5H5O\nPossible inference = Furans\nmy comment: possible/probable\nm/z = 131\nPossible associated group = C6H5CHCHCO\nPossible inference = C6H5CHCHCOX\nmy comment: unlikely…\n— —\nFew words about:\nHydroxymethylfurfural = HMF\nmain M/S peaks at:\n41 (and 39), 69, 97, 128 (?)\nRef:\nhttp://webbook.nist.gov/cgi/cbook.cgi?ID=C67470&Mask=200\nmy comment: possible but unlikely because\nRogers wrote:\n“The hydroxymethylfurfural deformylates\n(loses a formaldehyde fragment) …”\n(https://www.shroud.com/pdfs/rogers4.pdf).\nInstead Furfural\nhas the main peaks at:\n29 (little), 39 (and, less, 38), 67 (very little), 97 and 98\n(and both these [that nearly are “twin peaks”] are great peaks)\nRef. under:\nhttp://webbook.nist.gov/cgi/cbook.cgi?ID=C98011&Mask=200\nI think we have to deepen the analyses about\nthe questions regarding the 95, 96, 97, 98 peaks\n(I believe this can be another “key area” to investigate,\nafter the other: 69, 131 169, 181 of “Shroud-image fiber”\n[“E1B”], and the series: 56-69-83-97\nof “Raes sample-fiber” [“Raes #3”]).\nWell, under:\nhttp://airborne.co.nz/hmf.shtml\nwe can read:\n>…today HMF is used as an indicator of heating\nor storage at elevated temperatures … (of honey)\n>Hydroxymethylfurfural (HMF), also\n5-(Hydroxymethyl)furfural, is an organic\ncompound derived from dehydration\nof certain sugars… \nLink:\nhttps://en.wikipedia.org/wiki/Hydroxymethylfurfural\nThe acid-catalyzed dehydration\nof hexoses results in the formation of\n5-hydroxymethylfurfural (HMF).\nThis is a well known fact.\nColin,\nHere some “obvious words”\n(around “HMF and heat”) that (perhaps)\ncan sound as familiar to your Food Chemistry: \nA) 5-Hydroxymethylfurfural (HMF), a\nheat-induced food toxicant present in a\nvast number of food items, has been suggested\nto be genotoxic after being bioactivated by\nthe sulfotransferase SULT1A1 …\nB) 5-(Hydroxymethyl)furfural (HMF),\none of the major intermediate products in\nthe Maillard reaction, is present in a wide\nvariety of foods. This aldehyde is formed as\na decomposition product of glucose and\nfructose in foodstuffs subject to cooking or\nheat sterilization. …\nC) 5-Hydroxymethylfurfural (HMF),\nformed by acid-catalyzed dehydration and\nin the Maillard reaction from reducing sugars,\nis found at high levels in numerous foods. …\nHere a vague suggestion :\nCan be possible a series of reactions\nthat includes Hydroxymethylfurfural and\ncadaveric emissions?\nThis imply the role of a certain amount of heat\n(…seemingly as coming not from the corpse,\nbecause HMF is produced at certain “high temperature”!)\n— —\nDan,\nhave you a new useful answer for us\n(regarding Mass Spectrometry and “Raes sample”)\non this blog?\n\n","date":"September 17, 2015 at 11:18 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210589","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"3-Furaldehyde\nFormula: C5H4O2\nMolecular weight: 96.0841\nMass Spectrum,\npeaks at:\n29 67 (very little), 39 (little) and (great) 97, 98 \nLink:\nhttp://webbook.nist.gov/cgi/cbook.cgi?ID=C498602&Units=SI&Mask=FFFFFF\n— —\nFurfural, peaks at:\n29 (little), 39 (and 38) , 67 (very little), 97 and 98 (great)\nlink:\nhttp://webbook.nist.gov/cgi/cbook.cgi?ID=C98011&Mask=200\n\n","date":"September 17, 2015 at 11:44 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210590","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"I have found a different kind of “example”\nabout the 55-69-83-97 peaks\nand then this is a bit different with respect the\npresumed (and strange) “polyethylene olygomers”.\nIt’s “The mass spectrum of\nmethyl 7-methyl-hexadec-6-enoate (from a\njellyfish in this instance, but often present in fish\nfrom warm seas).\nBut (in my opinion) “Branched-Chain Monoenoic Fatty Acids”\nhave nothing to do with the interpretation of\nmass spectroscopy for the sample we have to check.\nLink:\nhttp://lipidlibrary.aocs.org/content.cfm?ItemNumber=39487\nIn any case this kind of search in the field\nof mass spectrometry is only a waste of time…\nContinuing on this way,\nI think that I can only lose in this\n“game of individuation” for mass spectroscopy!\n\n","date":"September 18, 2015 at 9:16 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210643","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Finally, I fully disagree with myself :-)\nCorrection to my previous comment:\nThe Raes sample shows a (very small) peak at m/z=49. \nThe fact that the 3-D scan/mass/intensity maps begins at m=50 in Rogers’ book does not mean, contrary to what I wrote, that no data were acquired bellow 50.\nThe other possibility is described by Marco: “Since there is absolutely no other peak below M=49, it is most likely that the instrument was set to not acquire this part of the spectra. This is very common, because the peaks at low masses have little diagnostic value and their intensity might interfere with the other peaks, so it is better to cut them. If you see the spectra above, (fig 4), this is recorded without the zone below M=49. To be absolutely sure, one must see all instrumental setting (Which Rogers did not report).”\nThis argument is specious.\nThe abscissa in Fig.4 (Shroud sample 1-EB) begins at m=50 and ends at m=220 (in fact data were acquired up to 500 or even 750).\nThe abscissa in Raes spectrum begins clearly at m=40.\nIf the instrument was set not to acquire the part of the spectrum between 40 and 50, why would Rogers show the part between 40 and 50 (without any signal, except at m=49) ?\nThis abscissa should begin at 50, as in Fig.4.\nMoreover, if there were strong peaks around m=43 (like in the spectra of any molecule with a long aliphatic chain), they would certainly have been showed by Rogers. He would not have “cut them”.\nThe FACT is that in the Raes spectrum there is really absolutely no signal between m=40 and m=48, something which is a huge problem for the hypothesis of the “long aliphatic chain contaminant” hypothesis.\nWe have the spectrum of the Raes sample.\nWe must examine it as such, without any kind of “ad-hoc” speculation.\n\n","date":"September 19, 2015 at 1:09 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210727","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"And any possible implications of that?\n\n","date":"September 19, 2015 at 2:21 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210732","author":"O.K.","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Yes.\nIt implies that the paper in question is biased.\nMuch more tomorrow.\n\n","date":"September 19, 2015 at 2:49 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210734","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"Here a vague idea about the peak at 69.\nDo you know what is Squalene?\nSqualene mass spectrum shows a peak at 69\n(and other [more little] peaks at: 81, 41 and 95)…\nLinks:\nhttp://webbook.nist.gov/cgi/cbook.cgi?ID=C111024&Mask=200\nhttps://en.wikipedia.org/wiki/Squalene\nSebum (and the Shroud taken by hands during the past):\n>Sebum, secreted by the sebaceous gland in humans, is primarily composed of triglycerides (~41%), wax esters (~26%), squalene (~12%), and free fatty acids (~16%). The composition of sebum varies across species. Wax esters, like squalene, are unique to sebum and not produced anywhere else in the body. Sapienic acid is a sebum fatty acid that is unique to humans, and is implicated in the development of acne.\n>Sebum is odorless, but its breakdown by bacteria can produce strong odors. …\nLink:\nhttps://en.wikipedia.org/wiki/Sebaceous_gland\n\n","date":"September 20, 2015 at 8:28 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210792","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"I want to add that in the book by Ray Rogers\nthere is a comparative table about the\nsebaceous excretions of Homo Sapiens\n(= comparisons with respect other animal species)…\n— —\nI believe that isoprenic fragments (-C5H9)\ncan also be found in mas spectra of natural gum\n(natural gum is a polymer based on isoprene units).\nIn other words the C5H9-fragment (prenyl) is located\nat m/z 69 and this is an interesting fact…\nDo you remember the past “identification”?\nm/z = 69\nPossible associated  group = C5H9\nPossible inference = “Some hydrocarbons”\n— —\nIf we are able to work in the field of advanced microscopy,\nperhaps we can think to improve the investigations about\nthe issue (= presumed presence of natural gum)\nstarting from the other possible presence of\nmesophilic rubber-degrading bacteria G. polyisoprenivorans\n(=  a rubber degrading actinomycete) …\nReference :\nCase Report.\nA rubber-degrading organism growing from a human body\nby Mohit Gupta, Deepali Prasad, Harshit S. Khara, David Alcid\nInternational Journal of Infectious Diseases\nVolume 14, Issue 1, January 2010, Pages e75–e76\nLink:\nhttp://www.sciencedirect.com/science/article/pii/S1201971209001416\nAnother reference:\nGordonia polyisoprenivorans sp. nov., a rubber-degrading\nactinomycete isolated from an automobile tyre.\nby A. Linos, A. Steinbuchel, C. Sproer, R.M. Kroppenstedt\nInt J Syst Bacteriol, 49 (1999), pp. 1785–1791\n—- —-\nOther words about the “rubber-degrading bacteria\nG. polyisoprenivorans”: \n>Gummi abbauende Mikroorganismen können quantitativ an verschiedene praxisrelevante Gummimaterialien anheften.\n>Zum ersten Mal konnten Gummi abbauende Mikroorganismen (Gordonia westfalica, Gordonia polyisoprenivorans) mit dem AFM visualisiert werden, die an verschiedene Gummimaterialien angeheftet waren.\nLink:\nhttp://www.analytik-news.de/Dissertation/Brill-Florian-H.-H..html\nHere a very rough translation:\n>Rubber degrading microorganisms can attach\nto quantitatively different practice-oriented rubber materials.\n>For the first time rubber was degrading microorganisms (Gordonia westfalica Gordonia polyisoprenivorans) are visualized with the AFM, which were attached to various rubber materials.\n— —\nBut all this talk about the possible\npresence of natural gum (…and\ninherent degrading microorganisms) is\njust pure speculation!\n\n","date":"September 21, 2015 at 10:05 am","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-210868","author":"piero","site":"shroudstory"},{"title":"The Chemist Rogers and Plastic Bags","post":"A short communication answering the Bella et al. paper on the mass spectrometry analysis by Ray Rogers of fibers of the Raes sample has been accepted to be published in Thermochimica Acta. \nSee http://www.sciencedirect.com/science/article/pii/S0040603115004724\nThe final version should be posted soon by the publisher. \nI will post a summary and a draft version of this communication at http://www.sindonology.org in a week, that is, on Christmas day.\n\n","date":"December 18, 2015 at 1:38 pm","url":"https://shroudstory.com/2015/09/14/the-chemist-rogers-and-plastic-bags/","cat":"carbon_14_dating","id":"comment-216810","author":"Mario Latendresse","site":"shroudstory"}]
