[{"title":"The Collapse of the Fraud Theory","post":"This madness should stop.\nI am thinking about compiling some paper about the results of all datings of the Shroud of Turin, Sudarium of Oviedo and the Tunic of Argenteuil, as they are related objects. The issue is in fact much more complex than most people think. The only problem is I have little time now.\n\n","date":"May 30, 2014 at 6:52 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-125689","author":"O.K.","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"Stephen doesn’t get it at all. You can’t pull tidbit, out of context quotes together out of thin air to build a legal case as he does. He has created a myth in his own mind.\n\n","date":"May 30, 2014 at 6:52 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-125690","author":"Paulette","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"Well Said Dan!\n\n","date":"May 30, 2014 at 8:03 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-125706","author":"Mike M","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"I think the fraud theory is an option, but fraud by “cooking” the data.\nIt’s old news : http://www.shroud.com/vanhels3.htm\n\n","date":"May 30, 2014 at 10:36 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-125728","author":"anoxie","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"Well, Dan, you write, [the fraud theory] is, in fact, certainly false.  For me this sounds like a Dogma. The question is, what evidence speaks against, what evidence speaks for it.\nThere is indeed the Dilemma that there is much evidence that the dating was terribly wrong and that there seems no convincing Explanation.\nWhat speaks against fraud?  The Magnitude of the scandal and the question of the Motive (in my eyes there is a big Motive to assign a “not authentic” to the Shroud for the church, but this is another Thing.\nWhat speaks for fraud? I think a lot of things. One has to look very carefully to the behaviour of the People in 1988 and also later.\nBut the main questions are: why have all free existing pieces of the shroud been confiscated shortly after the results have been proclaimed and any new carbon-dating strictly forbidden. Enough material for dozens of datings has been cut off the Cloth during the “Restauration” 2002 – why was None used for a new dating – this time under clean circumstances? Why is the Cloth shut away since more than 25 years for any Independent Research? The question could be clarified very quickly. Why does the church so firmly hang on the worng dating?\n\n","date":"June 1, 2014 at 10:05 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126085","author":"Helmut F.","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"The Church is in no hurry for fresh carbon dating because the relic is not an article of faith and, learning from mistakes, it will be careful in selecting laboratories this time it seems. There is too much infighting in the realm of Shroud studies, a lot of ego bashing is needed, a lot of things must improve. If not we will continue to see even petitions sent to the Pope stored in a drawer.\n\n","date":"June 1, 2014 at 12:43 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126102","author":"Louis","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"Are you suggesting that the three laboratories selected were not of the highest level ?\n\n","date":"June 2, 2014 at 3:29 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126232","author":"PHPL","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"Hi Helmut.\nThere are several things a little awry with your comment above, which need to be untangled. Firstly, you’re correct that a flat denial is a dogma rather than a conclusion, but the evidence you were asking for has been explored in considerable detail on this sight, so Dan’s denial should be seen in that light. The fact that “there seems no convincing explanation” for the 13th century date cuts little ice with the people who think that the Shroud does, in fact, date from the 13th century, and even those who think it genuine have come up with a number of more convincing ideas than a Soviet plot.\nYou ask: Why have all free existing pieces of the shroud been confiscated shortly after the results have been proclaimed and any new carbon-dating strictly forbidden? Well there are certainly two pieces of the C14 sample which are still in the possession of the Tucson Lab, and any number of threads and fibres owned by the Whangers, and several others with access to Riggi and Gonella’s various hooverings. They have not been confiscated and as far as I know, nobody has been forbidden to carry out a test on those pieces. \nThe most obvious reason for not wanting a further test on the actual Shroud is that the Church thinks the results will not, however carefully carried out, decide the matter one way or another, and so would simply be a waste of a precious relic, but why might the Church not want a reliable testing of the remaining Tucson pieces (which were, it must be remembered, retained specifically for just such a purpose).\nWhat are the alternatives?\na) The Church knows the Shroud is medieval and does not want it confirmed?\nb) The Church knows the Shroud is ancient and does not want it confirmed?\nc) The Church thinks the Shroud is medieval and does not want its antiquity proved?\nd) The Church thinks the Shroud is ancient and does not want its modernity proved?\nOnly (a) and (d) make sense, suggesting the Church either knows or at least thinks that the Shroud is medieval, and does not want that fact convincingly confirmed.\n\n","date":"June 1, 2014 at 2:16 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126119","author":"Hugh Farey","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"Not to stir up a tempest here, but would it be fair to say that your skepticism of the Shroud’s authenticity is rooted in a logical assumption — that being: the Church was likely carried out it’s own secret tests and it’s reticence in having more public tests done points to it having discovered the relic is medieval.\n\n","date":"June 2, 2014 at 10:52 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126281","author":"David Goulet","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"There is indeed logic there, but one must be careful of evidence-free suppositions. Two possible scenarios seem equally valid here, although I don’t in fact think either of them true. One is that the thin sliver of C14 sample retained by Douglas Donahue (Tucson) has been dated, and, coming out 1st century, the news was quietly suppressed by the nasty atheistic scientists, and the other is that the Church has carried out its own dating, and coming out 13th century, has quietly suppressed the results so as not to bring about the end of Christianity. My skepticism of authenticity is not rooted on that premise. It is based on the irrefutability, so far, of the C14 results we have, and the inability of the authenticists to decide how the man and the cloth were posed in the tomb in order to produce the image. There is some evidence against the C14 date, but not enough for me, and some evidence concerning possible 1st century image-making, but again, just not enough for me. I have no grudge whatever against those who feel the opposite, although I draw the line at people who shout FACT when they mean opinion, and people who, having been overwhelmed by the evidence on one side or the other, are no longer able to see that there are valid contradictory viewpoints.\n\n","date":"June 2, 2014 at 1:33 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126308","author":"Hugh Farey","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"Hugh, I consider your conclusions are incorrect.  The Tucson sample is no better than any of the other non-representative samples, and testing it can prove nothing.  Louis has the correct answer.  “There is too much infighting in the realm of Shroud studies, a lot of ego bashing is needed, a lot of things must improve.”  Advances in Science may well come with a more definitive way of testing the Shroud’s age, and I don’t mean Prof Fanti’s methods.  It may well be that one day there may be a means of scanning the entire relic and learning a great deal more about than we know even now.   But, while the Shroud is certainly not an Article of Faith, if authentic, it has the potential to be an extremely powerful proselytising and evangelisation tool for Christianity in general.  We can wait, but not too long.\n\n","date":"June 1, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126136","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"If the other samples were mixtures of threads, and the remaining Tucson samples are too, then individual threads can be examined under microscopes, and probably identified isotopically as well, so as to determine which threads come from which period (and perhaps even which geographical location). I wouldn’t advocate just carrying out the same test all over again. Apart from that I agree with you wholeheartedly.\n\n","date":"June 1, 2014 at 5:02 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126143","author":"Hugh Farey","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"Daveb, further to the comment above, it seems that the Church’s position on fresh carbon dating was clear in the e-mail received from PAS chancellor Cardinal Miguel Sánchez Sorondo, two lines from which were reproduced on this blog by the recipient recently. The Church is surrounded by traitors, as the experiences of Paul VI and, more recently, Benedict XVI has shown. It has no choice but to move very carefully.\nIt is not hard to agree with you that advances in science “may well come with a more definitive way of testing the Shroud’s age.” That has been Ian Wilson’s position for more than a decade and the reasons why he thinks so are convincingly stated in his last Shroud book.\nThe entire relic was scanned during the controversial restoration, however, given the Church’s silence, one must presume that not enough information was extracted.\n\n","date":"June 1, 2014 at 5:12 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126148","author":"Louis","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"What about this new study on the Shroud published in Injury Magazine and featured in the Vatican Insider, La Stampa?  Perhaps the Vatican is allowing new testing to be performed.\n05/ 7/2014\nNew study shows Man of the Shroud had “dislocated” arms\nhttp://vaticaninsider.lastampa.it/en/world-news/detail/articolo/sindone-shroud-sudario-33948/\n\n","date":"June 1, 2014 at 11:12 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126196","author":"Angel","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"The question of dislocated arms has been discussed for decades.  It had even been mentioned to Barbet, before 1950.  There’s really only one place you can dislocate an arm and that’s at the shoulder.  I doubt if anyone’s ever heard of a dislocated elbow.  Barbet was insistent that with a shoulder dislocation, that the arm would not be lengthened, but the muscles and tendons would always result in the upper arm being pulled in towards the body.  My father in his old age was unfortunate to experience this following a tumble.  The surgeons relocated the arm by placing bands around his chest and then pulling his arm and chest in opposite directions until it was reset into place, a somewhat painful procedure.  Barbet was insistent that there was no evidence of shortening of the arms, and that the shoulder was therefore not dislocated.  The recent paper referred to is strong, perhaps even showy, on obscure medical technical jargon.  Perhaps it is not so strong on accurate diagnosis!\n\n","date":"June 2, 2014 at 4:35 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126241","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"Daveb, I’m sorry your father had to experience such excruciating pain, especially in his golden years, prior to Winter’s call.\nWith reference to the “Vatican Insider” article,\nif the question of dislocated arms has been discussed for decades, why was it even referenced in the title?\nThe double-nailing of both Jesus’ hands and feet to the cross  certainly validate a major mistake was made by the Romans\nor perhaps the grisly act was deliberate, \nBest,\n\n","date":"June 2, 2014 at 11:38 pm","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126393","author":"Angel","site":"shroudstory"},{"title":"The Collapse of the Fraud Theory","post":"Can someone help? I find absolutely no reference at all to “double-nailng” of the hands or feet in the paper by Bevilacqua et al. Is this simply a journalistic misreading, like the excitement about the Y-shaped cross a few weeks ago, or have I missed something important? Part of the conclusion to ther paper reads: “The lack of thumbprints of both hands on the TS is related not only to a lesion of the median nerve that causes only a slight flexion of the thumb, but also, particuarly, to the fact that the nail driven into the wrist has pulled or injured the flexor pollicis longus tendon causing its dragging in the hole and the cmplete retraction of the thumb.” This does not speak to me of two nails in one hand, but simply two effects of a single nail. Can someone lay this to rest?\n\n","date":"June 3, 2014 at 3:07 am","url":"https://shroudstory.com/2014/05/30/the-collapse-of-the-fraud-theory/","cat":"carbon_14_dating","id":"comment-126419","author":"Hugh Farey","site":"shroudstory"}]
