[{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Dan does an excellent job at providing so much up-to-date material on the Shroud which  I for one, even though very doubtful about the authenticity of the Shroud, find interesting. However, in order to maintain the credibility of the website , a judgement has to be made over what to publicise. Stephen Jones’ hypothesis is simply science fiction- do we need to bother about it any further?\n\n","date":"March 14, 2014 at 4:14 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88593","author":"Charles Freeman","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Probably not, unless he comes up with something new.\n\n","date":"March 14, 2014 at 6:04 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88634","author":"Dan","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"This “hypothesis” is nonsense. Period.\n\n","date":"March 14, 2014 at 7:14 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88665","author":"Gerard","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Stephen, no one likes to admit they were wrong (I sure don’t) but sometimes we just have to man-up and do so. Take a deep breath and let this one go.\n\n","date":"March 14, 2014 at 7:45 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88671","author":"David Goulet","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Don’t post anything more.\n\n","date":"March 14, 2014 at 7:51 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88674","author":"Paulette","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"I don’t mean you, Dan.. I mean Stephen . He should retract his five postings and move on to the history that he is so good with.\n\n","date":"March 14, 2014 at 7:54 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88675","author":"Paulette","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"I had already thought of the problems that Dan raised and I will address them in my revised proposal.\nBut I had already stated that I had accepted Prof. Ramsey’s unambiguous statement that the AMS control console computers were never online, so Dan’s going on about Arpanet is irrelevant. And I had already stated before Dr. Jull’s and Prof. Ramsey’s emails that an alternative is that the hacker could have hacked into each of the three C-14 laboratories locally. \nIt is interesting that the `open minds’ on Dan’s blog have already dismissed my revised proposal as “science fiction,” “nonsense,” and “wrong”, without even waiting to see it.\nThey thereby show that their minds are closed and NOTHING I say will ever satisfy them, so I won’t even bother.\nI have no problem admitting I am wrong, when I AM wrong! But no one on this blog has shown that I am wrong. They mistake personal attacks for arguments. But I take such personal attacks as confirmation that my opponents don’t have any good arguments against my proposal, otherwise they would use them.\nAnd again I thank Dan for the free publicity, and for his hacker posing as a technician idea, and Hugh for advising Dr. Jull and Prof. Ramsey of my proposal!\n\n","date":"March 14, 2014 at 8:38 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88690","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Several people have pointed out how your theory is dependent on technology that was not advanced enough to support the hacker’s scheme. You have provided no countering evidence that refutes this. Can you blame us for disbelieving?\nIf the KGB was involved it would have been far easier for them to blackmail the labs (the KGB were very, very good at that) than hack the systems under the labs’ noses. At least apply Occam’s Razor to your own theory.\n\n","date":"March 14, 2014 at 9:27 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88707","author":"David Goulet","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Stephen, in 1988, no one even knew what the internet, or a computer virus, or hacking was.\nThe 3 labs were 1000’s of miles apart, the machines were not “online” in any way so as to be “hacked” locally or any otherwise. I doubt there would have been any interface capable of transfer of the data let alone able to input a “hack”.\nI’m sure the Labs would have taken great care to protect, test & calibrate their equipment considering the subject of the test & what was at stake.\nI stick by the nonsense statement above.\nApologies if I am being blunt.\n\n","date":"March 14, 2014 at 8:56 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88695","author":"Gerard","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":">Stephen, in 1988, no one even knew what the internet, or a computer virus, or hacking was.\nHow old are you Gerard? I am 67 and I have lived through the pre-Internet, Internet, and pre-Web eras. \nI caught my first computer virus, the Stoned Virus in 1987. Google ” Stoned Virus”.\nThe hacker who Clifford Stoll caught, Markus Hess, hacked into 400 US military computers in 1986. Google “Clifford Stoll.”\nHess was a member of a group of Hackers called the “Chaos Computing Club, “founded in Berlin on September 12, 1981.” (“Chaos Computing Club,” Wikipedia).\nSo it is not ME who is writing “nonsense”!\nI have already stated here, following Dr. Jull and Prof. Ramsey’s confirmation that the AMS control console computers (at least at Arizona and Oxford) were never online, that my proposal now is the alternative (which I had mentioned before their confirmation) that the hacker or hacker’s inserted a new program, or more likely modified the existing one, at each of the three laboratories. Each of which had the same AMS C-14 dating system.\nThe whole point of Clifford Stoll’s book, the “Cuckoo’s Egg” (read it) is that in the 1980, all universities both physically and computer-wise, lacked security. Stoll did his PhD at the University of Arizona, so he would especially have had that university in mind. \nThe C-14 tests were weeks and even months apart in 1988: Arizona (May 6), Zurich (May 26) and Oxford (August 8). It would not have been difficult for a hacker, or hackers, to before each test, gain access to the AMS control console computers at each of the three labs and modify the program which received inputs from the AMS system, converted it into raw uncalibrated years and displayed those years on the control console computer’s screen. \nFrom the photo of Arizona’s AMS control console computer in Gove’s book, which I had already posted, it looks like a simple personal computer, such as a Tandy TRS-80, or similar. All such 1980s PCs came with a simple programming language called BASIC, which I used to write programs in.\nThe Shroud samples would have to have had a unique identifying code (otherwise the labs would not know which dates applied to the Shroud), so it would be easy for a hacker to modify the program (especially if it was written in BASIC) so that if the data was coming from the Shroud samples, whatever their dates were, to replace those dates with dates, which when calibrated, clustered around 1325, just before the Shroud’s known historical debut in the 1350s.\nThe KGB had already recruited and paid hackers before 1988. For example Markus Hess in 1986 and other members of the Chaos Computer Club (Google “Karl Koch”). But they were only the KGB’s hackers WHO WERE CAUGHT. There is no reason why there could not have been other hackers, recruited and paid by the KGB, who were NOT CAUGHT. And there is no reason why some those not caught hackers were not paid by the KGB to ensure the Shroud C-14 dated to just before the 1350.\nI will develop these points in my next posts in this series: “Were the radiocarbon dating laboratories duped by a computer hacker?: Revised\n\n","date":"March 16, 2014 at 12:25 pm","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-89634","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Even if we concede that the KGB of that era, under an atheist Soviet system, had motive to perpetrate this conspiracy, why have none of these conspirators since revealed what happened. Russia is now returned to being proudly Orthodox. What motivation is there to keeping up the game of the rigged dates via hacking? Surely there must be someone at the Kremlin who would have spilled the beans in the decades since glasnost.\nTo be honest, Stephen, I feel you truly believe there was a conspiracy between the labs themselves to present a medieval date. But prudence, lack of evidence or legal fear prevents you from outright accusing them of fraud, therefore you are using this hacking theory as the thin edge of the wedge.\nThere are lots of clues and oddities in the whole C-14 business that do raise some question marks but what no one has presented yet is hard evidence of any date fudging or sample switching.\nA single whistleblower, or late confession, or damning email would go a long way to exposing the crime. Until then they are just theories, conspiracy theories, and accordingly given the gravity they warrant.\n\n","date":"March 16, 2014 at 12:47 pm","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-89638","author":"David Goulet","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"I have read the new book by Fanti (and Malfi) …\nand then …\nI have read the words about the possible new way (an “easy method” …)\nbased on linen fibrils roughness (= beated linen fibrils, an ancient\nmethod to treat the linen material versus modern treatments) …\n(and the book indicated a message sent by Dr. Botella, Univ. of Regensburg,\nin November 2007). Try to see something about the following words :\n“growth nodes” or “kink bands” … and the possible controls (= studies present on the Web).\nHere the inherent claim : perhaps we can improve our knowledges using CLSM\n(= Laser scanning confocal microscopy) and AFM controls …\n———————–\nHere a reference about CLSM :\nCharacteristics of laser scanning confocal microscopes for surface texture measurements\nJariya Buajarern, Chu-Shik Kang and Jae Wan Kim\nJariya Buajarern et al 2014 Surf. Topogr.: Metrol. Prop. 2 014003. doi:10.1088/2051-672X/2/1/014003\nReceived 11 August 2013, revised 23 September 2013, accepted for publication 7 October 2013. Published 23 December 2013.\n© 2014 IOP Publishing Ltd \nAbstract\n>Due to the complexity of the surface topography,\naccurate surface characterization requires three-dimensional (3D)\nsurface measurements. Confocal laser scanning microscopy\n(CLSM) is a non-destructive and versatile technique for quantifying\n3D surfaces. The response of measurement quality to variations in\nCLSM hardware settings and specimen properties has been investigated.\n>Through these investigations, certain criteria have been developed\nto select the optimal CLSM settings to minimize image noise,\nmaximize contrast and resolution for reliable and accurate\n3D surface measurements. The surface measurement results\nwere then compared with those obtained from the stylus instrument,\nphase shifting interferometer (PSI) and the coherence scanning interferometer\n(CSI). With the optimal hardware settings, CLSMs proved to be\nan appropriate instrument for measuring moderately rough to rough\nsurfaces regardless of surface reflectivity or surface finish.\n>It exhibits versatility for measuring surfaces of complex geometry,\nwhich is needed in the engineering field. Moreover, preparation\nof the sample is not necessary.\n— —\nWhat is your idea ?\nI hope to read a comment …\n\n","date":"March 14, 2014 at 10:59 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88731","author":"Piero","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Nevertheless, it is good that we examine all the theories put forward, however outré they first appear, on their merits. We have recently devoted care and consideration towards Vicente Ruello and David Roemer, and although we have rejected their ideas, it was not because we ignored them, but because we actually followed their implications through further than their original creators. So, now, with the globe-trotting Soviet AMS engineering expert and his plot to discredit Christianity.\nTwo claims are often made by “the lunatic fringe.” One is that because no one has actually proved them wrong, they must be right, and there’s nothing much we can do about that, but the other is that they must be right because they have simply been ignored, and that is something we certainly can, and I fear ought to, do something about, however fruitless and time-consuming it be.\n\n","date":"March 14, 2014 at 11:06 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88734","author":"Hugh Farey","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"And this is why they made you editor of a certain journal. Well put, sir.\n\n","date":"March 14, 2014 at 11:15 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88738","author":"David Goulet","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Hugh, There is a third claim. Keep going on in circles until everyone else is bored by endless posts repeating the same garbage until everyone else gives up and stops responding since it’s obvious no one is listening on the other side. And then believe that since everyone else stopped responding he must be right. I think someone has made a spectacle of his stubbornness on this blog and in the process has undermined his own credibility and the case of the shroud’s authenticity too, it’s really sad.\n\n","date":"March 16, 2014 at 3:35 pm","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-89670","author":"Mike M","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Forgive me for asking, but when, again, were David Roemer’s “postulations” given exegesis?\n\n","date":"April 2, 2014 at 10:19 pm","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-95998","author":"Alexander Walker","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Have a look at the comments to “Russ Breault and Pastor Caspar McCloud Discuss the Shroud” from 8 Feb 2014, where I think David was given a fair run for his money.\n\n","date":"April 3, 2014 at 4:29 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-96078","author":"Hugh Farey","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"If you don’t mind me saying so-\nFor many shroud researchers who believe it’s authentic, it’s been a long process of gaining respect from the scientific community just based on the sample area and it’s fiber consistency.\nAdding theories of KGB agents mass hacking computers adds to the eye rolling and appears we are desperately grabbing at straws. I think we need to stick to the credible findings already on the table in order to gain further testing or the doors could be slammed shut.\n\n","date":"March 14, 2014 at 11:59 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-88757","author":"jenx","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":">David Goulet …\n>Even if we concede that the KGB of that era, under an atheist Soviet system, had motive to perpetrate this conspiracy, \nDan has posted (Google: “They don’t do it just for the credit card numbers”) that Shroud.com, a website ABOUT the Shroud was sufficiently an “affront” to “atheists” that hackers would be motivated to destroy it. But HOW MUCH MORE would a first or early century date of the SHROUD be an affront to the atheistic Soviet Union in the 1980s that it, through its `dirty tricks’ agency, the KGB, would be motivated to ensure that the Shroud did not return a 1st century or early C14 date?\n>why have none of these conspirators since revealed what happened. \nThey may yet. I have previously posted to the effect, that now my proposal is in the public domain, one of the hackers, an ex-KGB agent, or someone else, who knows what happened, may confirm my proposal.\nBut fear of KGB retaliation:\n“Koch was loosely affiliated with the Chaos Computer Club. He … was involved in selling hacked information from United States military computers to the KGB. … Koch was found BURNED TO DEATH with gasoline in a forest near Celle, Germany. The death was officially claimed to be a suicide. However … there is little evidence supporting suicide and many believe that Koch was KILLED IN ORDER TO KEEP HIM FROM CONFESSING MORE TO THE AUTHORITIES.” (“Karl Koch,” Wikipedia);\nor fear of prosecution, and also that the hacker(s) likely believe that Shroud is a fake, might prevent anyone blowing the whistle.\n>… What motivation is there to keeping up the game of the rigged dates via hacking? \nPLENTY! See above. Last time I checked the ex-head of the KGB, Vladimir Putin, is the President of Russia. And how many hackers have VOLUNTARILY admitted their past hacking? Not many, if any.\n>To be honest, Stephen, I feel you truly believe there was a conspiracy between the labs themselves to present a medieval date. \nNo. While I firmly believe that there HAD to be fraud of some kind to convert a 1st (or early) century date of the Shroud to the `too good to be true’ 1325 +/- 65 C14 date, the worst that I have suggested is that the labs may have been guilty of low-level fraud:\n“… making results appear just a little crisper or more definitive than they really are, or selecting just the `best’ data for publication and ignoring those that don’t fit …” (Broad & Wade, 1982, p.20)\nand that is still my fall-back position.\nBut bearing in mind Ian Wilson’s view, from knowing the lab leaders personally, that they were basically honest and would not have “rigged” the result, I wanted to explore a way that there could have been fraud in the C14 dating, but by a hacker, not by the labs.\n>But prudence, lack of evidence or legal fear prevents you from outright accusing them of fraud, therefore you are using this hacking theory as the thin edge of the wedge.\nNo. As far as I am aware, there would be no possibility of legal action against me if I accused `the C14 laboratories’ of fraud, but only if I accused individuals BY NAME in the laboratories of fraud.\nMy only reason for not accusing outright the C14 laboratories of fraud is that I don’t believe that there was fraud by the laboratories, unless it was the above low-level fraud.\n>There are lots of clues and oddities in the whole C14 business that do raise some question marks but what no one has presented yet is hard evidence of any date fudging or sample switching.\nI have been presenting the evidence for my proposal and taken on board what evidence there is against it. But in the nature of the case, being secret hacking carried out 26 years ago, it is only circumstantial evidence. If a hacker or KGB agent confessed to the hacking would that be “hard evidence”. \nBut there are other forms of hard “evidence.” If a member of the C14 labs admitted that a hacker COULD have done what I have described. Dr Jull and Prof. Ramsey have not done that. \nIndeed, Prof. Ramsey’s, “This would seem to be a suggestion from someone [me] who does not know what computers were like in the 1980s” is not only over-defensive, it is actually FALSE. As I pointed out, I know VERY WELL “what what computers were like in the 1980s”:\n“… I was one of the first to have a personal computer in 1980. I pioneered the introduction of computers into Health Department of WA hospitals in the mid-to late 1980s and in the late 1980s/early 1990s, I was the Systems Administrator of a network of 7 hospitals’ UNIX systems.”\nProf. Ramsey’s too-defensive and FALSE over-reaction, makes me suspicious that he may think that I have a point, which he doesn’t want to face up to.\nBest of all would be to find the hacker’s code on at least one of the original AMS control console computers. But although Arizona’s AMS system which did the 1988 is still operational (Google: “Arizona AMS 1981 operational”), I doubt that it is still there, with its original software, or at the other two labs. \nBut even if at least one of the original AMS control console computers is still there, complete with what looks like the original software but no hacker’s code, that would not disconfirm my proposal, because the KGB would likely have insisted the hacker remove his code when he had finished, as KGB agent Markus Hess removed evidence of his hacking.\n>A single whistleblower, or late confession, or damning email would go a long way to exposing the crime. \nAgreed. See above. That may yet happen. It is early days.\n>Until then they are just theories, conspiracy theories, and accordingly given the gravity they warrant.\nI don’t claim my proposal has yet reached the level of a theory.\nBut as for the pejorative term “conspiracy theory,” which is designed to “poison the well” against me personally:\n“Poisoning the well … is a rhetorical device where adverse information about a target is pre-emptively presented to an audience, with the intention of discrediting or ridiculing everything that the target person is about to say.” (Wikipedia).\nto discredit me personally in the minds of readers so they won’t accept my proposal:\nMy proposal indeed is that the KGB CONSPIRED with a hacker or hackers to ensure that the Shroud returned a 14th century C14 date. There is abundant evidence that the KGB did conspire with hackers (Google “Chaos Computer Club” and also “Cyberpunk Hafner”). \nBut if it makes you and your ilk feel better, denigrating my proposal as a “conspiracy theory” and me personally as a “conspiracy theorist,” then be my guest.\n\n","date":"March 17, 2014 at 8:02 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-89990","author":"Stephen E. Jones","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Thanks for taking the time for clarifying your position. I don’t think the term ‘conspiracy theory’ is pejorative. It does imply that someone is taking something on conjecture, rather than fact, that is all. There can be reasonable conspiracy theories (JFK, Hoffa) and there are outlandish ones (faked moon landings). Where your proposal lays depends on the logic of your clues. You have a few, but need many more.\nI don’t know who else belongs to my ‘ilk’ but I am not going to apologize for having doubts, and expressing them, about your conjecture. I’m not trying to discredit you, poison your well (which is a poor defense and I’d advise you to drop it) or insult your intelligence.\nKeep digging. I’m happy to eat crow if you can find hard evidence.\n\n","date":"March 18, 2014 at 10:03 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-90380","author":"David Goulet","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"Stephen,\nI hadn’t been back to this thread so I didn’t see you reply to me. Apologies.\nI still can’t believe the KGB or anyone would care what the result was. It just wasn’t that important to them. \nThe only thing I take from this is:\n“Each of which had the same AMS C-14 dating system.”\nSomething I hadn’t realised before.\nThat explains why the got the same results and casts even more doubt on the result.\n3 labs using material taken from the same place using the same dating system is hardly rigorous.\n\n","date":"March 18, 2014 at 9:32 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-90373","author":"Gerard","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"I wonder.  Did the three labs have identical console computers? Identical software? Are we sure they were programmable computers? A CRT does not a computer make. A PC on a console’s desktop may not be connected to anything at all. Stephen is perhaps mostly wanting it to be so. Maybe he will surprise us with facts.\n\n","date":"March 18, 2014 at 9:51 am","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-90377","author":"Paulette","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"how can the 3 labs have consoles if the pc is not working\n\n","date":"November 10, 2014 at 1:56 pm","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-170443","author":"isaiah","site":"shroudstory"},{"title":"The Computer Hacker Hypothesis is Short on Factual Material","post":"who started hacking\n\n","date":"November 10, 2014 at 1:41 pm","url":"https://shroudstory.com/2014/03/14/the-computer-hacker-hypothesis-is-short-on-factual-material/","cat":"carbon_14_dating","id":"comment-170441","author":"isaiah","site":"shroudstory"}]
