[{"title":"The Mysterious Arizona Piece","post":"I will keep repeating that this piece has been handed to the Arizona lab for dating, and not for shelfing in some mysterious drawer. \nIt has been stated that there is a problem with the shroud sample used for the dating of the Shroud, because the results of measurements done at the three labs suggest linear variation of the age measured as a function of the place where the measurement is done. \nThe Arizona piece offers a possibility to check this statement. Supposing that the variation of the measured age with spatial distance is real, a prediction could be made concerning the C14-age of this piece, because its spatial position on the Shroud is known. Measurement could then validate or invalidate that prediction.\nOf course, it should first be checked whether the ‘mysterious Arizona piece’ really is what it is claimed to be.\n\n","date":"November 10, 2013 at 5:58 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50613","author":"Jos Verhulst","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"I would concur. Those who who keep demanding that the Church yield the Shroud for investigation to sectarian authority, overlook the fact that the carbon labs have by and large been jealously guarding the remaining pieces of the samples in their position. Zurich appears to be hiding in the Alps. Oxford claims it has no hold back and only Arizona in 20012!!! has allowed inspection at all. Barrie’s photos are interesting and the cooperation initially shown by Jull promising. Now it appears to be withdrawn.\n Perhaps the academics and critics who direct so much fire at  the Church and Turin should direct some of it at Arizona and Zurich (Oxford calims to have no samples remaining). Given the work of Rogers and now Fanti, their silence speaks volumes. \nThe only right to silence in the US is for people accused of a crime. In the absent of that, the rule is a refusal to testify allows the furthest inference possible to be drawn from the evidence of the adversary. Even in complex federal litigation over patents there are procedures for revealing to the court and litigants all manner of claimed “trade secrets” when needed and relevant.\nMuch of the procedure and findings of the labs has been shielded from review by critics. I am not in the position to marshal that criticism today. Perhaps someone else may have the complaints about the labs failing to fully disclose what happened at their finger tips. When I have a chance, I’ll dig it out but for now this controversy becomes a part of Chapter 10: The carbon  dating fiasco.  I am working on Chapter 12 now and have about four more to go.\nThe evidence of the adversary that Shroud is the burial cloth a man crucified circa 30 CE hasn’t been hidden. But until the laboratories are open about what they have and what they did, there is only one place for the carbon results: the dustbin of history. \nThe lesson for this Sunday: “You shall know the truth and the truth shall set you free.” John 8:32\n\n","date":"November 10, 2013 at 7:06 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50617","author":"John Klotz","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Which piece, Jos, the “Jull” piece or the “Donahue” piece?\nOr both?\n\n","date":"November 10, 2013 at 7:25 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50618","author":"Hugh Farey","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"First of all the piece discussed in Freer-Waters & Jull, Radiocarbon 52, p.1521-1527. However, the strange characterization of that piece as given by the authors  should be checked & cleared up. If  more pieces turn up that could be associated with a precise location on the Shroud, and that are in the possession of Donahue or perhaps other people (who knows?), then that material should also be used. But firstly, these additional piece(s) should return to the lab and their history & provenience should be fully documented. Then a research plan can be established.\n\n","date":"November 10, 2013 at 10:29 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50632","author":"Jos Verhulst","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"I’m thinking of giving up on the science, and getting into pulp fiction, possibly with TV documentary and film rights. \nThe plot would be centred on a cabal of barmy folk with some kind of  unspoken religion-inspired ideological agenda, intent on debunking science. So it comes up with an ingenious plot, one in which the boffins from 3 different labs (no, let’s make it 13) are invited to do a test on something our plotters say could provide proof of their beliefs, and all the boffins have to do is prove or disprove it. Title? Night of the Shrewd?\nBut here’s the catch – the test is set up in such a way that it’s a no-win situation for the scientists, no matter what answer they return. There are still some details to be worked out, but all kind of jiggery-pokery with switching, substitution, contamination can be worked in to ensure that the story will run and run. It finally develops into a full-blown scandal with scientific reputations compromised or destroyed,but with the charge of sinister collusion pointed at pretty well everyone, but at no one individual in particular (got to keep it libel-proof)\nNope. On second thoughts, who’s going to believe this hokum? Who’s going to stay with it to the last chapter, even if their plane is delayed and they make it to the surprise ending (thunderbolt from on high?)? Who’s going to make that all-important willing suspension of disbelief for so ludicrous a storyline? \nDarn, I thought I was onto a winner there for one moment…\nGuess it’s now back to pre-moderation for me…\n\n","date":"November 10, 2013 at 6:42 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50615","author":"colinsberry","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Colin,\nYour faith in the scientists exceeds my faith in the Pope. You kneel and genuflect at the altar of science and like the popes (in the past) and too many clerics ignore the sins of some priests. \nYou have stated that the sampling procedure was defective. There is no question that the carbon sample site was the worst possible choice. The labs were hungry for the publicity and the money (including government grants) they would flow from the tests. Oxford found, and then ignored evidence of cotton INTERWINED with the linen threads in their sample. The cotton was not enough to skew the sample by itself but it was unique to the area and INTERWINED cotton dd not exist on the Shroud in chief. Ther  STURP team, which was aware of Raes comment that his sample had cotton looked for it in 1978 and couldn’t find it. Rogers reported on that fact. They did find ambiemt, promiscuous pieces of cotton deposited through the years but NO intertwined cotton.The pictures of he STURP team taken demonstrate the scrutiny the team did in Turin relatively high powered microscopes. You have posted that you thought the procedures adopted were so bad that you, as a scientist, would have  walked away had a beer (was that a beer your mentioned, I don’t recall the brand stateside). In short, you base your skepticism on flawed procedure that you know are flawed by the selection process. \nLet’s get one thing straight. The labs ignored the protocol they were supposed to follow. One piece of that was that the labs would NOT confer on their results prior to announcement of the results. Instead they did confer and it appears they have adjusted them. Michael Tite who was the the supposed guardian of the process was a candidate to become director of the one of the labs even before the testing  (Oxford) was dismissive of the protocols.\nYour priestly scientists should be excommunicated, or at least have their work discarded – which by reason of their silence, among other things,  –  it has been.\n\n","date":"November 10, 2013 at 7:30 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50619","author":"John Klotz","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Yes, John, the job was botched for all the reasons you mentioned, and more besides. \nStuff happens as they say (sanitised version). Move on. Repeat the sampling  – in the presence of Pope Francis if necessary (I trust him). Make sure there’s a decent number of sites (say 5) and a random element in their selection, accepting there will have to be some no-go areas.\nWhat we don’t need is a post mortem that just runs and runs and runs, sine die as I believe you lawyers would say.\n\n","date":"November 10, 2013 at 7:43 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50621","author":"colinsberry","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Colin,\nWe have an agreement in general on the need for new tests. \nThe problem is setting proper protocol  for tests and reconciling the need for new tests with the issue of preservation. Also, what is the regime for the tests. There have been various reports of new non-invasive procedures. We (at least I) need to be educated on these procedures. How good are they? Fanti claims to have dated the Shroud through application of a different procedure. His report of that as to the Shroud was formally peer reviewed and the provenance of is sample threads challenged. However  it appears that a general report on the method was published in a peer reviewed journal without reference to the Shroud. \nNot that peer review is a guarantee of everything. Benford and Marino sought to publish their critique in Radio Carbon and the peer reviewed committee included people connected to the labs they were criticizing. Ideas that challenge the norm are often rejected out of hand. \nI will begin my section on Christ and the Quantum (I think) with the story of Hans Berger. Totally ridiculed he died an unhappy man. It’s ideas were weird and way out here. Rejected for decades by the scientific establishment. And by the way, he invented and developed one  of the primary diagnostic tools of the twentieth century. Tease alert, if you want to know, look him up.\nThere is also another issue: It’s been 25 years since the carbon dating. Surely the technology has advanced since then. I really hope that both the Turin and Ohio conferences will advance and educate on these issues. Maybe I will not be around by the time fruition comes. It might take years. Less than five I might just make it. Maybe if it takes ten, I’ll still be around. Twenty, in my nineties, who knows?\nBut the relative urgency of my desire to know more, can’t short circuit the development of an new protocol for new testing. Carbon dating is only one method of examination. We can now study reactions down to the quantum level. Actually that’s what florescence is and the MRI.Science will hopefully get better not worse.\nI will make one statement you will probably disagree with. New carbon dating, unlike the 1988 dating MUST be in the context of a panoply of examination processes. That was another error of the 1988 testing, perhaps the basic error, the exclusion of other tests.\nI have taken the time to answer you because I wanted to point hat I am not so far apart form you and Charles Freeman on the the need for new tests.\nIf we are lucky, except for the Shroud, may we all die with our curiosity unabated.\nNow I really have  to work. An impatient yellow lab demands my attention for his morning walk and I must get back to Chapter 12. With a little help from my friends it is moving nicely.\n\n","date":"November 10, 2013 at 8:39 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50623","author":"John Klotz","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Quick response to John above, without using that Quote:\nRadiocarbon dating is THE diagnostic test. Nothing else comes anywhere close to it, certainly not the mechanical/spectral weakness tests, or vanillin, or those fanciful ones you mention that try nudging us into the realms of quantum uncertainty.\nThere are no serious grounds on which to doubt the accuracy of the AMS method where linen is concerned, given that its prime constituent is cellulose, probably the most chemically-resistant organic molecule of natural origin on the planet after pure hydrocarbons and man-made hydrocarbon polymers (that’s due to its internal hydrogen-bonding that effectively excludes intruders).\nThe problem re 1988 as we all know, or should, was the decision to work with a single corner sample, and even then to apportion and assign on a non-random basis, making a nonsense of those claims for statistically-significant trends. (Seems some folk have forgotten Stats101, namely that one has to be certain there are no obvious stat-spoiling systematic differences, like, nudge, nudge, those different clean-up procedures used by each of the 3 labs).\nIt’s been nice (well, interesting and challenging) talking to you, John, but for me at any rate, it’s time now to move on. Does anyone know the new Pope’s email address?\n\n","date":"November 10, 2013 at 9:12 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50625","author":"colinsberry","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"The Pope does not have a public access email account. but you can send a snail mail to:\nHis Holiness Pope Francis\nApostolic Palace\n00120 Vatican City\nI’ve written to the pope before, Benedict, not Francis. I received a reply within a few weeks from the Nuncio’s office. So the address does work – I have no illusions that my letter was ever read by Benedict.\nHowever, I think you could succeed in reaching Francis. He’s a man who prefers to read and reply to his own mail. As I’ve mentioned before Francis is showing that he is willing to engage in the public square with skeptics, atheists, etc. A respectful, rational challenge to the Church to open the Shroud to new testing might just get traction with this pontiff. Won’t know unless you try, right?\nOnly Nixon could go to China, well maybe only Colin can go to Rome?\n\n","date":"November 10, 2013 at 9:34 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50626","author":"David Goulet","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"If you’re going to write to the Pope, you might want to give him options. Hidden away somewhere are: the magic tape slides from 1978, the entire Holland backing cloth, the famous “Poor Clare” patches, endless shippings from around the scorch areas, and various vacuumings. Even some of these, in the hands of a reputable forensics lab, could be extremely revealing, without having to touch the shroud itself.\n\n","date":"November 10, 2013 at 9:57 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50629","author":"Hugh Farey","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Hugh,\nI wold hope that the two conferences next year could address what an be done and by what means.\n\n","date":"November 10, 2013 at 12:28 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50640","author":"John Klotz","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Colin,\nWe have already been down that scientific absolutism track. It wont fly. Botch me once, botch me twice. I am extremely doubtful the custodians of the Shroud will buy it a second time as a stand alone experiment. We need a holistic approach. How’s that for meaningless jargon.\n\n","date":"November 10, 2013 at 9:35 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50627","author":"John Klotz","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Holistic? I hold no brief for reductionism in science, and my work with wheat bran offered a textbook example as to why reductionism needs sometimes to be abandoned in favour of holistic approaches. Science bit:  it’s to do one inert component (lignin) protecting a more reactive one (fermentable carbohydrates) underneath, such that the mixture does not behave in the colon as the sum of its constituent separate parts studied in isolation, but more than the sum of its parts. \nOK, it’s safe to come out again…\nBut it’s for us stubborn and obstinate scientists to decide when to abandon reductionism. It’s not a decision we like having thrust upon us. least of all by those pursuing non-scientific agendas, mocking us for failing to see the whole picture. Science is science, and doesn’t make any attempt at seeing “the whole picture”. It focuses on those parts of the picture that are amenable to the scientific method, which lend themselves to the testing of testable hypotheses.\nAnd no, I am not a science-supremacist. At best I would paraphrase Winston Churchill: science is the worst form of exploratory procedure, apart from all the rest that have been tried from time to time. On bad days, I have even found myself questioning that.\nOh, and one final thing. There is no such thing as theophysics (unless you happen to knock on the wrong doors in Italy or Colorado).\n\n","date":"November 10, 2013 at 9:57 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50630","author":"colinsberry","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Colin, not all scientists think like you, thinking they can see “the whole picture”. That is why we see scientism from time to time. Have you read “Return to the Centre” by Dom Bede Griffiths? Many years ago we differed publicly by publishing some Letters to the Editor in a weekly, but he did have some interesting points to make, some of which are very relevant today. It has something to do with the material and non-material.\n\n","date":"November 10, 2013 at 1:28 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50644","author":"Louis","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Most of chemistry and biochemistry outside of the interface with nuclear physics comes down to the behaviour of electrons, or fuzzy electron clouds. Electrons are the currency of my life’s interest, but if you asked me to describe one, or how it can form stable shells around positive nuclei and what gives it the so-called negative charge, or why it can shoot off photons of light (an even deeper mystery) I wouldn’t be able to say anything useful or informative. They are just there, part of our mysterious universe. That’s without delving into quantum uncertainty, which allows electrons to be in two places at the same time.\n“Scientism”?  That would be like one of those ants going round a Mobius strip, always on one side yet both sides simultaneously, imagining it had its little Universe entirely sussed out, bar a few details.\nhttps://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcQ0zcqq5oKt8AcSYtT3EPmEG7GrNAgEVyBrf2FT0_XzT3ulK4fJjw\n\n","date":"November 10, 2013 at 2:25 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50651","author":"colinsberry","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"It is the mysterious universe and the quantum uncertainty that is most interesting.\n\n","date":"November 10, 2013 at 2:46 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50652","author":"Louis","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Sure, but it’s the lack of investigation tools that is problem, not counting a vivid imagination, fertile or otherwise…\n\n","date":"November 10, 2013 at 2:51 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50653","author":"colinsberry","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"We are finite, our investigation tools are limited, so there are some who appeal to vivid imagination and that is wrong.\n\n","date":"November 10, 2013 at 4:04 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50660","author":"Louis","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Just wait a cotton picking minute. There are supposed to be two pieces of the shroud in Tucson? Jull has one piece on site in Arizona and the other is not available? Is it misplaced? Does it support the reweaving in some way? Why should we trust anything about the 1988 testing done in Arizona after a year of what looks like stonewalling.\n\n","date":"November 10, 2013 at 3:03 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50655","author":"Paulette","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Yes indeed. Glad you’ve dropped in again. This blog goes so fast it’s quite hard to keep up sometimes!\n\n","date":"November 10, 2013 at 3:52 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50658","author":"Hugh Farey","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"As commented on this blog more than once, everything went wrong, from beginning to end in 1988.\n\n","date":"November 10, 2013 at 4:02 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50659","author":"Louis","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Colin,\nA topologist you are not. A mobius strip has one side and that’s the whole point. I created my first one as a Freshman in High School. There was an incredible theoretical mathematics book by some guy with a Russian sounding name.Let me give you my inexpert, addled definition of the quantum: the interface with the self-conscious entity (singularity?) from which existence sprang (that is called by some God.)\nHave you pondered the theorized existence of  Boltzman’s brains.\n\n","date":"November 10, 2013 at 4:05 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50661","author":"John Klotz","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"You know and I know that the Mobius strip, topologically speaking,  has only the one continuous surface (though arguably still 2 sides at any point, inasmuch as one can be marked without affecting the other) . \n Look at the link  for the context – which was to provide a visual aid to a puzzling miniature universe in which one ant might be aware of another one  ‘on top’ separated from it by just the thickness of paper – seemingly on “opposite sides” but both (we would agree) on the one topological surface – the “same side”. \nI was simply trying to demonstrate that one does not have to go the subatomic world of quantum mechanics to create a kind of weirdness in which 2 surfaces meld into one, while still seeming to have two sides at a local ant-sense level. The macroscopic world can be made weird, simply with scissors and glue.\n\n","date":"November 10, 2013 at 4:31 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50663","author":"colinsberry","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Colin,\nI think you have revealed that you are a serious scientist. Pardon me if I twit you a little.\n\n","date":"November 10, 2013 at 5:54 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50672","author":"John Klotz","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"\nJohn Klotz :\nColin,\nI think you have revealed that you are a serious scientist. Pardon me if I twit you a little.\n\nTwitting I don’t mind, John, at least in moderation. Trying to belittle my scientific credentials is something else, like your describing me recently as a poodle barking at a Great Dane (John H Heller).\nI suggest you compare scientists’ research credentials before making these judgements.\nIt’s an easy enough thing to do, using Google Scholar to consult the number and breadth of publications AND that little blue number under each showing the number of citations.\nHere, I’ll make it easy for you.\nhttp://scholar.google.co.uk/scholar?hl=en&q=j+h+heller&btnG=&as_sdt=1%2C5&as_sdtp=\n\n","date":"November 10, 2013 at 7:14 pm","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50677","author":"colinsberry","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"Official argument for the secret wrapping? There is no official argument, but the clue is at the end of the long story.\n\n","date":"November 12, 2013 at 10:48 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-50950","author":"Louis","site":"shroudstory"},{"title":"The Mysterious Arizona Piece","post":"So, the question that comes to my mind is: what do they have to hide?\n\n","date":"December 1, 2013 at 11:17 am","url":"https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/","cat":"carbon_14_dating","id":"comment-54305","author":"Andy Weiss","site":"shroudstory"}]
