[{"title":"Third Tetherd Cow Ahead Exchange on the Shroud of Turin","post":"Aha. So now you’ve won me over Dan. That doesn’t happen very often. Thanks for a very reasoned and rational response.\nI will take only a couple of your points to task (although I do also have a few other issues with what you say, not least with the concept that the image on the shroud is formed with something other than a paint or pigment) and it is these:\nActually, not all biblical exegetes agree that the spices were used. Remember, the funeral preparations were not finished and that the intent seems to be that Jesus’ followers would return following the Jewish Sabbath to complete funeral preparations. Regardless, biblical narratives, like world view, is not valid input into scientific observation. \nTwo things here: contradictions within the Bible are, as you know, quite common. This provides a real problem for a rational person such as myself, and it is this: how do you choose which bits to believe? In my opinion one contradiction in the Bible opens it up to question, but so very many makes it entirely questionable. You may choose to ignore the passage in John in favour of other more ‘shroud friendly’ bits, but as the Michael Drosnin, the shyster who wrote The Bible Code, demonstrated, you can make the Good Book say anything you want with enough selective interpretation.\nSecondly, I agree that the Bible can’t be used as valid scientific input, but unfortunately a great many people who are obsessed by the shroud don’t make any differentiation between scientific method and what they consider an infallible historical document; the Gospel Truth, as it were. \nThat charge [cherry picking/moving the goalposts] is fair. But it goes both ways. We see it, not just in the arena of shroud research but in many areas (and by the way not just in the realm of pseudo-scientific belief as you characterize it but in science itself).\nI concur, but cherry picking is WAY more common in unscientific reasoning. Scientists do it, but as you obviously know, the scientific method is designed to weed out that kind of problem, and largely it works. Uninformed people don’t know it’s at work though, and pseudoscience loves to assemble a big pile of ‘facts’ accumulated in this manner. ‘Moving the goal posts’ is not common in science, but very prevalent in pseudoscience – if the evidence isn’t fitting your hypothesis, then, rather than examine the strength of the hypothesis, make new conditions for the evidence.\nDan, it is obvious that your interest in the shroud transcends a mere need to have your religious beliefs validated, and for making that assumption, and for my terse tone in tangling with you, please accept my apologies. I’m not accustomed to anyone being able to hold their end of a rational debate in these matters (and as I am often heard to proclaim, I am entirely prepared to listen to rational arguments for anything at all – as long as they are truly rational arguments).\nTo close, let me just say this: if there is a mystery of the Shroud of Turin, it is, in my opinion, that the figure represented is artistically quite out of keeping with anything else of the medieval period. The kind of relatively ‘realistic’ portrayal of a human body is, as far as I know, unique in the relic-making industry. Equivalent relic portraiture (such as the many ‘Veils of Veronica’) are unconvincing and contrived, where the shroud retains a level of ‘plausibility’ (which, in my opinion, is the reason for its continued interest – if it was as obviously fake as the Cottingly Fairies, say, or any one of the existing Veronica’s Veils. it would have faded into obscurity long ago). I hasten to add that I don’t believe that the execution of such an item would have been at all beyond the skills of an artist of the 13th/14thC, but it is contextually unusual. I’m surprised that this argument for the veracity of the shroud is not used more frequently.\nSo. Now I now where to come when I need informed comment on the shroud. Salut!\nPeter.\n\n","date":"August 27, 2008 at 10:35 pm","url":"https://shroudstory.com/2008/08/27/third-tetherd-cow-ahead-exchange-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-26","author":"anaglyph","site":"shroudstory"},{"title":"Third Tetherd Cow Ahead Exchange on the Shroud of Turin","post":"PS – I love the pic of the Tethered Cow.\n\n","date":"August 27, 2008 at 10:38 pm","url":"https://shroudstory.com/2008/08/27/third-tetherd-cow-ahead-exchange-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-27","author":"anaglyph","site":"shroudstory"},{"title":"Third Tetherd Cow Ahead Exchange on the Shroud of Turin","post":"And ruminating further:\nI’m just reading The Archimedes Codex (the story of the reconstruction of the Archimedes Palimpsest) and it occurs to me that there is no longer any real impediment to the Church handing over the Turin Shroud for a comprehensive examination by all available technology, now that they’ve ‘accepted’ that it is not genuine (which I believe is the official line).\nThere can be no real issue of conservation any longer- many of the most useful techniques are non-destructive – and some issues (such as the method by which the image is registered on the cloth) could probably be definitively decided.\n\n","date":"August 28, 2008 at 9:42 pm","url":"https://shroudstory.com/2008/08/27/third-tetherd-cow-ahead-exchange-on-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-35","author":"anaglyph","site":"shroudstory"}]
