[{"title":"This may be the Shroud of Turin Story of the Year","post":"I can’t imagine any test being less accurate than the 1988 dating of the Shroud.\n\n","date":"December 31, 2013 at 8:52 am","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70504","author":"Andy Weiss","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"Fair enough, Andy, but I was thinking about technology, not the specifically bungled 1988 tests. While Fanti’s methods may be promising, the jury is still out on the accuracy of the method. Consider radiocarbon dating history going back to the days of Libby; how many refinements have been introduced and how much has experience with the technology given us a real sense of accuracy. Fanti is doing pioneering work. It may not be useful. We just can’t say “the technology employed in these new tests yields more accurate results than that used in 1988.” The operative word is technology.\n\n","date":"December 31, 2013 at 10:39 am","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70540","author":"Dan","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"I understand, Dan.  Other scientists should do some good science to either validate or discredit Fanti’s methodology and new work.  That will bring real value to the study of the Shroud if it be validated or not.\n\n","date":"January 1, 2014 at 3:06 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70870","author":"Andy Weiss","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"Apart from a few conspiracy theories, there is nothing to suggest that the actual carbon dating was badly carried out or inaccurate. I believe that Riani and Atkinson satisfactorily demonstrated a slight chronological gradient along the sample strip, which has yet to be satisfactorily explained, and the notorious 14th century kink in the calibration curve muddies the waters a little, but the C14 date of roughly 1300 plus or minus 60 years or so has been accepted both by the ‘authenticists’ (who think the date accurately measured a blend of 30% 1st century and 70% 16th century fibres) and the ‘non-authenticists’ (who think the date accurately measured unmixed 12th/13th century material). At their best, Giulio Fanti’s dates are only accurate to a precision of plus or minus hundreds of years, and he freely admits that wherever possible, radiocarbon dating would be the better method by far.\n\n","date":"December 31, 2013 at 1:54 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70603","author":"Hugh Farey","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"I mean 13th/14th century, of course…\n\n","date":"December 31, 2013 at 1:56 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70604","author":"Hugh Farey","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"Apart from a few conspiracy theories, there is nothing to suggest that the actual carbon dating was badly carried out or inaccurate\nExcept:\n* Unacceptable results of statistical tests of significance (Chi-square was one of them -Damon et .al actualy refuted themselves when they presented Chi^2 value of 6.4)\n*  Attested presence of cotton, silk, and blue satin in Arizona sample (Riggi himself admitted that “fibers of other origins had become mixed up with the original fabric”)\n* Three textile expert blindly suggesting the Zurich piece was rewoven, when blindly reviewed by Benford and Marino.\n* The works of Adler suggesting different chemical composition of C-14 sample, than the rest of the Shroud.\n* The works of Rogers suggesting presence of dye in the Raes/C-14 area & negative tests on vanillin on the main TS fibers, contrary to Raes/C-14 samples.\n* The works of Villareal suggesting the presence of splices in Raes/C-14 area, as suggested by Benford&Marino.\n* The presence of cotton fibers in Raes/C-14 area, contrary to Raes sidestrip and the main area of TS\n* The results of Riani, Atkinson, Crossilla and Fanti suggesting there is a spatial trend in C-14 area, which is hard to explain otherwise than by patch hypothesis.\n* The supposed unauthorized C-14 dating of one Raes thread, which gave the results circa 200 Ad for one end of the thread, and 1000 AD (some sources claim 1200 AD) for the other -it is quite probable that this thread was actually a splice.\n* The contradiction with iconographic data (Pray Codex for example)\n* The contradiction with Sudarium of Oviedo, another Shroud related object, which existence can be asserted back to the 7th century at least.\n* The contradiction with the Tunic of Argenteuil, another Shroud related object, which existence can be asserted back to circa 800 AD at least.\nthe C14 date of roughly 1300 plus or minus 60 years or so has been accepted both by the ‘authenticists’ (who think the date accurately measured a blend of 30% 1st century and 70% 16th century fibres) and the ‘non-authenticists’ (who think the date accurately measured unmixed 12th/13th century material).\nThe average date is unquestioned, the problem is that the quality of the measurements is questioned (statistics show they are probably unreliable) and the conflict with other data.\n\n","date":"December 31, 2013 at 3:19 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70633","author":"O.K.","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"I think you have missed my point.\nDan was querying Rebecca Hamilton’s asertion that “the technology employed in these new tests yields more accurate results than that used in 1988.”\nIn fact, whatever it was that the three test-labs dated in 1988, there seems little dispute, not even from you, that what they dated was accurately dated, and accurate to a precision of plus or minus a few tens of years. Giulio Fanti admits that his dating methods are only accurate to plus or minus hundreds of years.\nYou mention the weird, unverified, undocumented caim that a secret test was made of an unauthorised, unverified thread by a scientist improperly making use of an AMS machine out-of-hours, mysteriously coming up with two dates, 800 years apart, with an average of 600AD. I wish I knew more about it, but it says nothing about the regular process of C14 dating as a procedure, and still less about the conduct of the three official laboratories. If it suggests anything, it does not suggest a splice, but a 7th century Byzantine fake.\n\n","date":"December 31, 2013 at 4:26 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70651","author":"Hugh Farey","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"Hugh, do you mean aside from the fact that they dropped their scientific protocols for non-scientific ones?\n\n","date":"January 1, 2014 at 3:08 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70871","author":"Andy Weiss","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"Never believe a politician! Not even an attractive-looking 18 year old female member of the Oklahoma House of Representatives.\n\n","date":"December 31, 2013 at 2:21 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70614","author":"daveb of wellington nz","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"The Oklahoma Legislature’s webpage says she was born in 1948…\n\n","date":"December 31, 2013 at 2:36 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70618","author":"Hugh Farey","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"She has been a rep for 18 years.\n\n","date":"December 31, 2013 at 3:07 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70631","author":"Dan","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"My mistake! She’s only 10 years younger than me, but unless it’s a very old picture, she’s weathered rather better than I’ve been able to manage!\n\n","date":"December 31, 2013 at 3:26 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70634","author":"daveb of wellington nz","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"Guess she looks pretty good for her age, eh Dave?\n\n","date":"January 1, 2014 at 3:12 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70872","author":"Andy Weiss","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"Hugh:\nYou mention the weird, unverified, undocumented caim that a secret test was made of an unauthorised, unverified thread by a scientist improperly making use of an AMS machine out-of-hours, mysteriously coming up with two dates, 800 years apart, with an average of 600AD. I wish I knew more about it, but it says nothing about the regular process of C14 dating as a procedure, and still less about the conduct of the three official laboratories. If it suggests anything, it does not suggest a splice, but a 7th century Byzantine fake.\nIf you haven’t heard about this already, check this: http://www.shroud.com/late02.htm (see “Caltech Responds To Benford/Marino Claims”).\nActually the story is repeated by several sources, for example Mark Antonacci’s Ressurrection of the Shroud as well as 1993 Zenon Ziółkowski book Spór o Całun Turyński. There were witnesses for that claim, and although Caltech and Rossman deny this took place, I hardly believe it. We can be certain one thing, FOR SURE SOMEONE IS LYING HERE!\nThe strange results (200 AD one end of the thread, 1000-1200 AD another) can be easily explained if the thread had actually been a splice of two threads, one from 1st century, and another from 16-19th. The presence of starch was also reported.\n\n","date":"December 31, 2013 at 5:06 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70664","author":"O.K.","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"The question might have to be whether Dr Rossman, despite his extra-terrestial mineralogical expertise, is sufficiently expert in the matter of carbon-dating organic matter using the equipment which Caltech seems to deny it possesses. If he did in fact attempt the investigation, it would seem to have been extra-curricular and unauthorised. His apparent unwillingness to discuss the matter any further now, makes any previous assertions he may have previously made, highly suspect, and likely worthless. I would doubt that Caltech was part of any anti-authenticity conspiracy, although personalities might have played a part. They are obviously not prepared to have their name attached to any testing that might have occurred. Clearly Joe Marino has a record of the actual discussions that occurred. They might well be enlightening.\n\n","date":"December 31, 2013 at 7:01 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70702","author":"daveb of wellington nz","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"The question might have to be whether Dr Rossman, despite his extra-terrestial mineralogical expertise, is sufficiently expert in the matter of carbon-dating organic matter using the equipment which Caltech seems to deny it possesses.\nYes, Dave this is what is a greatest concern here. Could FTMS be used to perform carbon-dating? In theory -yes. I don’t know about practice. But alleged dates seems to be quite accurate, so maybe they have some validity.\nObviously neither Rossman nor Caltech are interested in having their names linked with the TS. But I don’t believe that nothing happened. \nLook at the Caltech statement:  \nHe has never been involved in age-dating studies and has no expertise in the area.\nBut the basic principles of C-14 datings are not so hard to understand -we count ions, just what FTMS does.\n Furthermore, the Division of Geological and Planetary Sciences has never had FTMS instruments.\nBut what about other Divisions?\nGenerally, although those results are highly suspect, and hardly reliable, if there is some truth in them, it can be another indication that TS dates to the begining of the Common Era. And if dated thread had been a spliced one -this would explain a 1000 year difference. If FTMS were completely unsuitable for C-14 dating, then there would be probably no making-sense results at all.\n\n","date":"December 31, 2013 at 9:37 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70730","author":"O.K.","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"I think the strange results are better explained by the unsuitability of FTMS for dating anything and the insufficiency of the sample, but let it pass. Happy New Year!\n\n","date":"December 31, 2013 at 8:37 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70719","author":"Hugh Farey","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"The whole brouhaha over the 1988 C-14 tests demonstrates that there is much more to the matter than merely counting ions. Issues include: representative sampling, proof of provenance, reproduceability of results, validation, provenance, transparency, preparation and cleaning, to name only a few. \nThis is merely yet another example of what happens when perhaps well-intentioned individuals go off and do their own private experimentation, and in the end prove nothing. It is a natural consequence of the present lack of a formal programme of investigation with proper protocols, and the narrow provincial proprietal attitude of the Turin guardians, who seem incapable of contemplating that anyone outside the immediate environs of Piedmont could make any useful scientific contribution to an understanding of this relic, the property of the universal church.\n\n","date":"January 1, 2014 at 12:41 am","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70759","author":"daveb of wellington nz","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"Sigh. More desperate, pathetic, wish fulfillment. The shroud is a medieval fake, as shown by the evidence. That some people, albeit a tiny fringe, still cling to it as a desperate crutch for their need to believe says more about them than anything related to the dirty scrap of cloth.\n\n","date":"January 1, 2014 at 12:59 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70857","author":"Passing Stranger","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"Around here, in this blog, we tend to argue with substance rather than with mere insults. You are welcome to join us in constructive conversations. We lose our cool now and then but usually after some back and forth with facts, observations and logical arguments.\n\n","date":"January 1, 2014 at 1:30 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70864","author":"Dan","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"Sigh.  I recommend you try some study of actual material than an unsubstantiated comment.  Now if you would have quoted actual facts, that would have made for an interesting comment.\n\n","date":"January 1, 2014 at 3:15 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70874","author":"Andy Weiss","site":"shroudstory"},{"title":"This may be the Shroud of Turin Story of the Year","post":"I think that the unauthorized tests from the early eighties(presuming they happened, and I hardly think that all of the parties involved were liars) proves one thing-that the Shroud is a very difficult object to date with C-14. I imagine that if 4 pieces were cut from different parts of the cloth, each one would yield a different date. I sure would like to see some more C-14 tests done in my lifetime, since there is so much controversy surrounding the 1988 test.\nHappy New Year to all, even to a Passing Stranger.\n\n","date":"January 1, 2014 at 2:26 pm","url":"https://shroudstory.com/2013/12/31/this-may-be-the-shroud-of-turin-story-of-the-year/","cat":"carbon_14_dating","id":"comment-70867","author":"Chesterbelloc","site":"shroudstory"}]
