[{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"Oops. O.K. had sent me this in an email: \nI would like also to add the link to the Joseph Uten’s article THE TITLE OF THE CROSS from Shroud Spectrum International #16 http://www.shroud.com/pdfs/ssi16part3.pdf This may be useful to the readers. \nSorry. But there you go.\n\n","date":"January 22, 2014 at 8:12 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74073","author":"Dan","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"Fun article to read. And it does point to what makes the Shroud such a unique relic. Whereas it’s reasonably easy to copy the Titulus, the nails, a bloody cloak — it’s proven to be quite another matter to copy the Shroud. Therein lies the double-edged sword of ever proving the Shroud was a crafted scorch — someone could then logically suggest that it may be a copy of the original. Indeed, if that linen-cotton cloth is ever proven medieval the scorch hypothesis might suddenly find it has some very unexpected champions.\n\n","date":"January 22, 2014 at 10:25 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74087","author":"David Goulet","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"Sorry I should amend that to say “ever proven without a shadow of doubt”. One could argue it has already been proven medieval by the C-14 dating. And here’s a can opener to go with your worms.\n\n","date":"January 22, 2014 at 10:48 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74089","author":"David Goulet","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"The evidence of the bloodstains alone is enough to reject the idea that the Shroud could be a forgery David…  I know I said it many times, but everytime I see someone talking about this, I have to say something…\n\n","date":"January 22, 2014 at 2:03 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74110","author":"Anonymous","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"Perhaps the result from the 14C test\nby Bella and  Azzi is right and then\nthis “Titulus” is only a replica of authentic relic.\nInstead other researchers claim that … the entire area was irradiated !\nSee the presumed sources for that natural radiations :\nfrom the piezonuclear reactions and the inherent neutron irradiations\nor … from the powerful thunderbolts, etc. (and then the obvious claim is :\n“there was an alteration into the matter due these interactions”).\nIn any case, in the past, prof. Luigi Campanella indicated\nthe interesting systems to work with wood samples.\nDo you remember ?\nIt was interesting to read these methods.\nBut I believe we have to avoid all the destructive analyses.\nIn my opinion, if you work with the proper SPMs controls you\ncan obtain the interesting data avoiding the big destructions.\nIn any case I am curious … but not fanatic … about that old wood.\n— —\nB.T.W. :\nWhere is the blood on that presumed false relic ?\nI see nothing around the researches about that precious liquid …\nThere is no dry spot (blood) on that wood.\nAre we sure for that absence ?\nWhere is the proof ?\n\n","date":"January 22, 2014 at 1:52 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74109","author":"Piero","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"I first came across Thiede & D’Ancona’s book during 2003, an edition which predated the 2002 C14 testing. I was impressed with the case they made for the titulus and wrote a review for my parish magazine at the time. With so many reliable eye-witnesses attesting to it there can be no doubt that the original relic existed and survived as late as 980AD, the earliest date given by the C14. \nThe sequence of the lettering is Hebrew/Aramaic, Greek and Latin at variance with the sequence in Luke and John, although the first line is damaged. The Greek and Latin reads from right to left, either because of the inscriber’s ignorance or as a parody of the Hebrew.    \nThe O.K. story on Pope Lucius II is fascinating and one I had not been aware of. An alternative explanation for the present relic being a replica might that the original was destroyed in one of the many medieval fires in Rome, as were the papal tombs mentioned. However the caligraphic commentary suggests that the original still existed when the replica (if that’s what it is) was made. \nIn early 2010 I also wrote a fanciful piece “Just a simple block of wood” with a reference to the True Cross and the Titulus, with some commentary on those relics. It can be found here:\nhttp://tawacatholic.org.nz/wp-content/uploads/2011/08/TCN-Mar-10.pdf  see pp 20-21 of the magazine.\n\n","date":"January 22, 2014 at 3:30 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74121","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"Personally, I have a great difficulty to believe that, after the Resurrection of Jesus, the disciples could have been tempted to keep anything related to him other than the burial cloths and maybe some other cloths he was wearing during his lifetime (which could include maybe some he was wearing during his Passion).\nThe idea that things like the cross, the nails, the sponge, the lance, the titulus crucis, etc., could have been kept by the disciples after Jesus’ Resurrection or, like the cross, could have survived for nearly 300 years in order to be found by Helena seems as ludicrous  to me as the idea that the Mandylion could have been the Shroud of Turin folded in 8.\nAll those things just doesn’t sound true to me…\n\n","date":"January 22, 2014 at 4:40 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74133","author":"Anonymous","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"I’m inclined to agree. The burial cloths they had access to. But the cross, nails, sponge, lance etc would have been in Roman hands to be used again. There is the possibility of a believing Roman soldier – the centurion perhaps – obtaining them.\nBut here’s thought experiment: if Jesus’ execution happened today would anyone think to make a relic of the noose that was around his neck, or the electric chair he sat on, the syringe that injected him with poison? Our customs are not 1st century ones, but if you had the risen Lord appearing to you, if you could reach out and touch his side — why would you bother with the instruments that killed him?\nOn the other hand, if you believed that His blood was a lifeforce like no other, then maybe you would be obsessed with retaining anything that blood stained.\nThere’s a lot of mystery in His history.\n\n","date":"January 22, 2014 at 5:09 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74136","author":"David Goulet","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"Very good question from David: “if Jesus’ execution happened today would anyone think to make a relic of the noose that was around his neck, or the electric chair he sat on, the syringe that injected him with poison?”\nOF COURSE NOT!  That’s why it is highly doubtful that, beside Jesus’ cloths (including his burial cloths), his disciples or family could have even thought of keeping any objects related to his Passion and death.\nDavid also said: “On the other hand, if you believed that His blood was a lifeforce like no other, then maybe you would be obsessed with retaining anything that blood stained.”\nMy answer:  I think David that your assumption here is out of context completely!  A theological concept such as the “life’s giving blood of Christ” was surely not in the disciple’s mind right after the death and Resurrection of Jesus!  Such theological concepts and dogmas took many centuries and a lot of debates (some of those being very violent and mean) during a lot of councils in order to become accepted by a majority of Christians.  So, I think we can forget this kind of wild assumption concerning the immediate disciples of Jesus…\n\n","date":"January 22, 2014 at 5:52 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74145","author":"Anonymous","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"Existence of the titulus was attested by the pilgrim Egeria in 383, by the 6th century pilgrim Antoninus, as well as by Saints Cyril of Jerusalem, Ambrose of Milan and John Chrysostom. Your credal problems when faced with such evidence are no-one else’s problem!\n\n","date":"January 22, 2014 at 5:12 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74137","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"I completely disagree…  Those references came more than 300 years after the events, during a time in which the market of Holy relics was booming!  This happened after the conversion of Constantine and the “paganisation” of Christianity (cult of the Saints, a lot of magical thinking, etc.) and this “paganisation” surely had something to do also with the high rising of the cult of relics.  In such a context, it was very tempting to forge all the reported objects associated with Jesus’ Passion…  That doesn’t mean that every relics of the Passion must be false (I believe the Shroud is authentic), but that’s surely enough to make us very prudent when we talk about the authenticity of other relics supposedly related to the Passion.\n\n","date":"January 22, 2014 at 5:46 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74143","author":"Anonymous","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"Your disbelief merely comes from a state of mind, and a refusal to consider what evidence there might be, which is NOT a case of prudence at all.\n\n","date":"January 22, 2014 at 8:12 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74162","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"“Those references came more than xxx years after the events, during a time in which the market of Holy relics was booming!”, isn’t this the same argument used against the shroud?\nWhy is it so easy to dismiss relics even when historic and palaeographic evidence support authenticity.\n\n","date":"January 22, 2014 at 8:56 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74167","author":"Mike M","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"The difference with the Shroud is the high number of pieces of evidence in favor of its authenticity.  It is much higher than any other relics supposedly associated with Christ.  And we must add the fact that it is much more probable that a disciple or a family member of Jesus decided to keep his Shroud instead of any other object associated with his Passion, for the simple and good reason that the Shroud was the last thing that touched his body before the Resurrection…  I think this was a good reason for them to decide to keep such a thing.  This is not the case for all the other relics of the Passion, except maybe for the Sudarium of Oviedo, which was possibly in the empty tomb also on Easter morning.  Nevertheless, for this relic, I’m still not so sure about that.\n\n","date":"January 23, 2014 at 9:33 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74236","author":"Anonymous","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"I would like to add that, concerning the Shroud, if it is the authentic burial cloth of Jesus (which I firmly think it is), I really don’t think that it was kept because of the “sacred blood” that covered parts of the cloth, but only because it was the last material object that had been in contact with his body before it disappeared from the tomb.\nSo, because of this, I don’t think the “sacred blood” hypothesis has anything to do with the fact that Jesus’ disciple or family have or have not kept some objects related to the last moment of his life.  So, personally, I have the strong feeling that beside the burial cloth(s) that was (or were) in contact with his body at the time of his Resurrection, not much (and maybe nothing else) was kept and preserved after this great event.  You can understand why I seriously doubt the authenticity of many relics of the Passion like the true cross, the sponge, the lance, the titulus crucis, the nails, and even the tunic of Argenteuil and many more cloths supposedly related to the Passion of Christ (but that were certainly not present inside the tomb at the time of Jesus’ Resurrection).\n\n","date":"January 23, 2014 at 9:29 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74234","author":"Anonymous","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"But in Jewish belief of that time blood was the life essence (still is to this day). The first followers of Jesus formed eucharistic communities – this is not a later development – it’s from the beginning. Receiving the flesh and blood of Christ (in bread and wine) is central to their understanding of who He was and who they are to be. Again this is from the beginning. If Jews think blood is important enough to collect and bury with a corpse, why wouldn’t they put even more importance to the blood spilled from a resurrected Messiah?  \nHowever, I still feel it would have been a great challenge to find all these relics with blood on them, apart from the ones the disciples had access too — the burial items and possibly the crown of thorns if it was kept with the body. The only way they would have gotten that Roman lance is if a Roman soldier procured it. Which is a possibility.\nIn the end neither of us was there. We likely will never know the answer and our theories will have to wait until the next life to be proven or disproven.\n\n","date":"January 23, 2014 at 10:52 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74245","author":"David Goulet","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"I should add that I agree that the disciples themselves are unlikely to have collected these relics. They had the experience of the risen Lord, who needs a relic after such a thing. What is a nail when one has seen the nailed!\n\n","date":"January 23, 2014 at 11:27 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74247","author":"David Goulet","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"I’m highly skeptical David about the idea that the disciples of Jesus could have considered his blood as being “sacred” right after the Resurrection…  It just doesn’t sound rational at all.  Such a concept surely took many decades to emmerge in the mind of some disciples (like John for example).  Such a concept was surely not what they had in mind right after the event…  As I said, if they ever kept the Shroud or other cloths that were present inside the empty tomb, it’s most probably because those things were still inside the empty tomb when they discovered it (and because they were the last material objects to have touched his body before it disappeared from the tomb).  I don’t see any other rational reason for them to have possibly kept this cloth (or cloths) related to Jesus after his death and Resurrection.\n\n","date":"January 23, 2014 at 11:45 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74249","author":"Anonymous","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"I must add that I like the last reflection of David…  Very rational, except for the burial cloths (for the reason I gave in my previous comments).\n\n","date":"January 23, 2014 at 12:00 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74253","author":"Anonymous","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"The birth of Christianity can be traced to the Resurrection, not to any relics. Even if we have these relics they will not tell us the full story and Christians at least depart from this world with a big amount of faith.\n\n","date":"January 23, 2014 at 11:05 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74246","author":"Louis","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"Faith and hope is much more important for any Christian than any relics supposedly associated with Christ, I agree 100%.\n\n","date":"January 23, 2014 at 11:46 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74250","author":"Anonymous","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"That’s right. What if there was no Turin Shroud?\n\n","date":"January 23, 2014 at 12:24 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74254","author":"Louis","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"\nLouis :\nThat’s right. What if there was no Turin Shroud?\n\nThe world would all of a sudden become a less interesting sort of place, and David Rolfe, John Klotz and Yannick Clement would need to find some other issue on which to dig in and engage in trench warfare (and/or mudslinging) against those terrible agnostics and atheists.\n\n","date":"January 23, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74257","author":"colinsberry","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"HA HA HA!!!  Great comment Colin…  It really made me laugh.\n\n","date":"January 23, 2014 at 1:00 pm","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-74258","author":"Anonymous","site":"shroudstory"},{"title":"Titulus Crucis:  A Fascinating Guest Posting by O.K.","post":"I think everyone is missing a huge giveaway that the titulus is a fake; and that is the Latin words themselves are wrong: “IESVS NAZERENVS” as it is carved into the wood. Nazerenus is totally the wrong declension of what is should be. It should be Nazereni. The inscribed words say exactly: Jesus Nazareth. Not Jesus OF Nazareth. I find it really hard to believe that if this event was so important for the area, not just to Jesus’s followers, but also Pilate’s status of governor in that territory, that the inscriber would make that great of a grammatical error. It would be like making the mistake of changing George Washington to George OF Washington.\nIt’s not a simple “faith versus science” issue. it’s a “wake up and look at the facts because it’s a fake” issue. The science doesn’t lie… people trying to control mass amounts of people by making up myths do.\n\n","date":"July 11, 2014 at 11:19 am","url":"https://shroudstory.com/2014/01/22/titulus-crucis-a-fascinating-guest-posting-by-o-k/","cat":"carbon_14_dating","id":"comment-137114","author":"nunya","site":"shroudstory"}]
