[{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"By the end of these Christmas, it is evident that the whole thing of ENEA research has completely got out of any control. As Ron has sometimes mentioned, we can expect something similar for Easter with this or a new theory on the Shroud. Congratulations to the public relations department of ENEA for this very succesful promotional campaign! But I think is about time to stop selling the same experiments since 2008.\nAfter reading in this blog the post of Dec 29, my only concern right now is how will this and forthcoming campaigns affect what seems to be a positive position of the Church to carry out new tests on the Shroud.\n\n","date":"January 7, 2012 at 9:31 am","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6636","author":"Gabriel","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Good comment Gabriel.  I think you touch one important point that can well explain why the Church seem to have put the Shroud in the shadow for the moment.  I think this kind of “preaching” by what I called “the supernatural fringe of the pro-shroud world” (the heart of the preaching being that the Shroud is a material PROOF of the resurrection, which is NOT TRUE AT ALL) is one major reason why the Vatican want to let the dust drop a bit before permitting any new series of direct research on the cloth.  Pretending that a material object can scientifically proof the resurrection goes against the official Catholic theology.  So, because this kind of preaching seem to gain in proportion since the 1988 radiocarbon dating (and I personally think the situation is getting worse and worse as years go by), I don’t think we’ll see any new direct test being allowed by the Church for a pretty long time.  I’m sure the Church is a bit affraid that some scientists from the supernatural fringe could take some foundings that would come from a new series of researches and used those data to push forward their little agendas.  I’m sure the Church don’t want that to happen and that’s one major reason why there’s nothing that happen these days.  The other major reason is the big critics (well deserved I have to say) that the Church have faced after the 1988 radiocarbon dating and the 2002 restoration.  I think after that, the Church officials just thought :  maybe it is time to forget about the Shroud for a moment… \nMessage for Dan :  I think my letter expressed well my point of view on those ENEA’s experiments, so I don’t think I need to write a direct response to Jones comment.  Of course, I disagree with him !\n\n","date":"January 7, 2012 at 7:23 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6653","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Yannick, your perspective sounds very reasonable.\n\n","date":"January 7, 2012 at 8:26 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6655","author":"Gabriel","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"I am a Catholic and I know pretty well the official thinking and teaching of the Vatican…  And I repeat it for Ron and others :  there’s NOTHING in the official theology of the Catholic church that support the emission of some kind of energy at the moment of the resurrection that would have left some material traces that science could proof.  NOTHING.  All this idea about some energetics by-products of the resurrection that would be responsible for the body images on the Shroud are a simple view of the mind, accentuated by Hollywood movies…  This whole idea simply had no concrete theological or scientific bases.  Period.  Of course, people are free to believe what they want to believe, but it is just that : a belief.  It has no real scientific base and it is off-track versus the official theology of the Church…\n\n","date":"January 7, 2012 at 8:42 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6656","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Now your an expert in Vatican thinking! Is that because your catholic? LOL. Well so am I, Roman Catholic actually and I am completely at a loss of most Vatican thinking! I know one thing for sure; the church believes in the resurrection! How God was able to accomplish it, I don’t think I’ve ever heard a sermon on that, or the churches view! I think your just pissed that your vapour theory for the image has basically fallen in priority, and actually has little strength.\nR\n\n","date":"January 7, 2012 at 9:04 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6658","author":"Ron","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"I know the Catholic teaching well enough to know that resurrection is only a term of faith that cannot be proved scientifically.  There’s nothing in the gospel or in the letters of the New Testament to support a burst of radiation or a burst of UV light or a corona discharge or something similar.  There’s no scientific data found by the STURP team that can really support the ASSUMPTION that a burst of radiation, a burst of UV light, a corona discharge or something similar had anything to do with the body images.  \nAll these kind of ideas are only based on the ASSUMPTION that the resurrection of Jesus SHOULD have produced a burst of some form of energy from his body.  Personally, I found this idea close to the New Age philosophy or something like that and I’m fully aware that it was propagated by Hollywood movies.  \nOne thing’s for sure : this whole idea is not a catholic concept.\n\n","date":"January 7, 2012 at 9:42 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6662","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Yannick, It is in my opinion you can’t be further from the truth!! It was the Church or more precisely the custodians of the Shroud that CAUSED all this! They started it all before the carbon dating tests in 1988 when they decided almost at the last minute to change all the protocols including the number of samples and from where they would be taken. It was not just irresponsible and unprofessional but also very suspicious! Before the dust, they caused, could settle, they went ahead and ‘SECRETLY’ did the restoration on the Shroud without guidance from any world experts! Why the secrecy?…Through their arrogance they have most likely eliminated any chance of proper study on the Shroud ever again. What are they afraid of? Irresponsible media reports have been coming out all along for decades, from both sides. It can’t be that or that SIMPLE.\nThe Vatican, custodians, whomever, have the power to commission a ‘Proper study of the Shroud’ where no unscrupulous scientist can conjure up some unscientific theory, yet they don’t.\nThey should seriously think deeply about who is depicted on this Shroud and if left by him for ALL mankind, the consequences of their actions and possible agenda. Whatever it is.\nI agree with Dan, the article is a excellent piece written by Mr. Jones.\nR\n\n","date":"January 7, 2012 at 8:49 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6657","author":"Ron","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Talking about the C14 dating, Ron you said : “It was not just irresponsible and unprofessional but also very suspicious!”  I agree that it was irresponsible and unprofessional but I don’t think there was any kind of “conspiracy” to falsify the date or something like that.  This decision to change the protocol at the last moment was most probably done because they were affraid that the relic could be “damaged” or his appearence could be “changed” if they permit 3 or more samples to be taken in many places.  I think that’s the main reason for this fiasco.\nAnd you also said : “Irresponsible media reports have been coming out all along for decades, from both sides. It can’t be that or that SIMPLE.”  I THINK IT CAN WELL BE THAT RON !  The Church have been so criticized after the radiocarbon dating that they probably thought that it was a good idea to wait until the restoration was achieved before telling anything to the media.  Also, you have to remember that it could also has been made for security reasons because, to do the job, the authorities were forced to move the Shroud (probably for the first time since World War II) outside the Cathedral of Saint John the Baptist.  You have to think about that my friend !!!!  I’m sure it was one major reason why they did not tell anything to the press before the work was complete.\nThe Vatican have no agenda regarding the Shroud.  Maybe Turin have one (maybe some economic agenda), I don’t know.  But the Vatican don’t want to used this relic for any purpose at all, and surely NOT to convert anybody to Christian faith with it.  If it was the case, they would act very differently, you can bet !  The Church consider this object as a Holy Icon as it should be, since science is not able yet to proclaim without any doubt the authenticity of the relic as the genuine Shroud of Jesus of Nazareth.  And before this could be done (will this be the case one day ?  I’m really not sure about that), the Vatican position will forever be the same :  It is a Holy Icon of the Passion of Christ.  Note that they never say that this is a Holy Icon of the RESURRECTION OF CHRIST !!!  What do you think of that ???\nAnd what is the main purpose of any religious icons ?  To make us the believers reflect upon a Christian subject.  That’s it.  That’s the official position of the Vatican as it should be.\n\n","date":"January 7, 2012 at 10:01 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6663","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"I think if you actually believe what you’ve written in your first two paragraphs, then you are simply naive and not very schooled in what actually occurred with the carbon dating. But your term ‘FIASCO’ was the right term, I’ll submit.\nIrresponsible media reports etc; existed before 1988 Yannick and since, so If the Church took the brunt of it after the ‘fiasco’, it’s because they deserved it. Your security theory makes absolutely no sense, if you think about it…If the Vatican didn’t care to use the Shroud for “any purpose at all”, why would they show it at all? Why not just bury the thing in the vatican vaults, never to be seen again? …don’t be so naive Yannick.\nR\n\n","date":"January 9, 2012 at 1:28 am","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6705","author":"R","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Ron, you seem like another fan of the conspiracy theory !  \nMy security hypothesis makes a very good sense since it was the first time since World War II they had to move the Shroud out of his normal location.  And I just want to remind you that they did the same kind of move during World War II, i.e. in total secrecy !  So, you can see that it wasn’t the first time the Turin authorities operated a move of the Shroud in secret.  Look like it is part of their “normal” procedure.  You seem also to forget that this restoration task took weeks to be completed !  Don’t you think the authorities wanted to give a very quiet working time for the textile experts who did this job of precision ???  Logically, it is the most logical answer.  I think I would have done the same.  But the big mistake the authorities made was to do no proper scientific consultations with chemists, archaeologists, etc. prior to the restoration.  that’s the problem regarding this restoration.  Not the secrecy.  They could have made some kind of “secret” consultation with a small group of experts in ancient textile (along with one or two experts on the Shroud) before the job and that would have been fine.\n\n","date":"January 9, 2012 at 4:45 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6728","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Ron you ask : “Why not just bury the thing in the vatican vaults, never to be seen again?”  Simply because the Vatican respect the people and want them to be able to see the relic in person from time to time (once every 25 years or so).  But at the same time, like I said before, they don’t want to use it as a banner to convert people.  To me, that’s the reason why they don’t show it more often.  They surely don’t want to be accused of proselytism !!!\n\n","date":"January 9, 2012 at 4:49 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6729","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Just to conclude on the topic of the official Catholic theology regarding the Shroud versus the resurrection, I just want to report one very interesting comment I’ve read this summer.  It come from Jean-Michel Maldamé, a dominican theologian from France.  Here’s what he said about the possibility that the Shroud could offer some material proof of the resurrection of Jesus : “It is absurd from the theological point of view !  The word “resurrection” would then lose its sense and would be distorted.  This would be a MATERIALISATION OF THE RESURRECTION (note : it’s me who underline) and it’s contrary to the theology teached by the Church.  There’s only traces of the resurrection in the gospels and in the testimonies of the apostles.”\nI agree completely with this position, except that I would add :  There is also a trace of the resurrection in the heart of the believer !  But on the Shroud ?  Personally, I don’t think so.  As I said before :  A sign of it, yes (to be found in the undammaged blood stains), but a scientific proof of it, no.  That’s what I think and anybody can think otherwise of course.\n\n","date":"January 8, 2012 at 7:38 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6688","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"\nYannick Clément :I know the Catholic teaching well enough to know that resurrection is only a term of faith that cannot be proved scientifically. There’s nothing in the gospel or in the letters of the New Testament to support a burst of radiation or a burst of UV light or a corona discharge or something similar. There’s no scientific data found by the STURP team that can really support the ASSUMPTION that a burst of radiation, a burst of UV light, a corona discharge or something similar had anything to do with the body images.\nAll these kind of ideas are only based on the ASSUMPTION that the resurrection of Jesus SHOULD have produced a burst of some form of energy from his body. Personally, I found this idea close to the New Age philosophy or something like that and I’m fully aware that it was propagated by Hollywood movies.\nOne thing’s for sure : this whole idea is not a catholic concept.\nWe are not talking scientific proof here Yannick, you are talking Church doctrine and you can’t know the church’s stance on the resurrection or what they think the resurrection actually was because they (The Church), have never made any comments on it, whatsoever (That I know of officially)…Furthermore; of course there is nothing in scriptures about a burst of energy! As no one actually witnessed the resurrection! So how could there be? Whether or not the ‘means’ of the resurrection is a catholic concept or not, means nothing in the study of the Shroud anyways.\nI dare to differ with you that STURP findings do not support a ‘possibility’ of some form of light emission to cause the image. It is in what they HAVE NOT found, that has caused many scientists to look at this possibility, amongst others possibilities. So not just me saying or thinking this but scientists who have studied the Shroud and in depth. So this ‘assumption’ as you call it does not come from Hollywood but from scientific study!….Anyways, don’t all hypotheses start off as assumptions? Just like the vapour or milliard hypotheses do?\nR\n\n","date":"January 9, 2012 at 1:11 am","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6702","author":"R","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Ron you said : “Whether or not the ‘means’ of the resurrection is a catholic concept or not, means nothing in the study of the Shroud anyways.”  \nAnd what do you think of that : “Whether or not the man on the Shroud is Jesus of Nazareth SHOULD means nothing in the study of the Shroud anyways.”  This is a burial cloth that SHOULD be considered as an archaeological piece of cloth like any other ancient pieces of cloth and study with decent science like it if it was the burial cloth of Julius Cesar or someone like that, and not to be studied with some science-fiction based on the imagination of some “true believers” as Ray Rogers called them !\nThat’s what I think.\n\n","date":"January 9, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6730","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Rogers called them the “true believers”.  You know how I called them ?  The supernatural fringe !!! :-)\n\n","date":"January 9, 2012 at 4:56 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6731","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"\nYannick Clément :Rogers called them the “true believers”. You know how I called them ? The supernatural fringe !!! :-)\nYannick I think Rogers called them “The Lunatic Fringe”, I believe he may have gotten that term from the Canadian rock band, Red Rider actually, atleast it would be cool to think so ;-). It was a great song.\nHe was talking about anyone with a theory that relied on ‘Miracles’, which HE personally didn’t believe in…So What? That is one man’s opinion, nothing else. But he did have a GOOD point…\nPersonally, yes I agree with you that the Shroud ‘should be’ looked at ONLY as a archaeological artefact when being scientifically studied, but in all honesty; Do you really believe that is possible? This is not JUST a Caesar or Tutankhamun tunic! As much as we hope it can be studied unbiasly, what this Shroud proports to be makes that almost impossible, for either side of the Shroud fence.\nR\n\n","date":"January 9, 2012 at 5:32 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6732","author":"Ron","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Rogers once used the term “true believers” in a sarcastic way and he borrowed it from another scientist (one who believe the Shroud offer a proof of the resurrection) who once told him : “Ray, you’re not a true believer !” or something like that, just because Rogers didn’t agree with him that Shroud could offer any proof of the resurrection.  That’s what Barrie Schwortz told me once.  I hope I didn’t deform too much the reality but that’s the way I remember what he told me…  \nI agree with your comment to some extend Ron.  Bias is present in the pro-Shroud and anti-Shroud circles, mainly because of a faith or philosophical reason.  You wrote : “This is not JUST a Caesar or Tutankhamun tunic!”  It’s true from OUR perspective of believers, but I don’t see any good reason why a real scientist that rely only on the known laws of the universe should see the Shroud differently than if it was the reported Shroud of Caesar with a body image on it !  This is one of the major problem in Shroud science and that’s why I pray that the next research team that will be allowed to study the relic will only have agnostics members !\nOne more thing I want to say is that many people tend to look at the Shroud and immediately think about the resurrection while the Shroud is nothing more than a burial Shroud that point directly to the Passion and death of Christ instead.  That’s another major problem with Shroud research !  Some scientist seem to only think “resurrection” in their researches while I don’t think we can really understand the Shroud if we focus on another thing than the fact that it is a burial Shroud of someone who’ve been beaten, scourged and crucified.  We have to always remember that it is the only thing we can see for sure after the STURP investigation :  It is an authentic burial cloth of a real crucified man.  Personally, if I was a scientist, that’s where I would look to search for an explanation.  It’s not any burial Shroud, it is the burial Shroud of someone who has been in a very high traumatic state.  That’s one important thing we have to always keep in mind, instead of searching for explanations that relied only on extrapolations, suppositions and speculations.  There was a traumatized corpse in that Shroud and he stayed there for less than 36-40 hours.  That’s the only thing we know for sure and any credible scientist who want to study the Shroud properly should start there and never forget this important fact.\n\n","date":"January 9, 2012 at 5:52 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6734","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"I think you’re missing the point Yannick, point being it may be ‘impossible’ for ANY observer of the Shroud not to be bias one way or another just because of what it PROPORTS to be; The burial cloth of Christ. Nothing more nothing less. I definitely believe it would be impossible to find even a handful of scientists that could be completely ‘neutral’ in the study of the Shroud, period! Who really cares or have ’emotions’ when it comes to Caesar?, but Christ, different issue…get my point?\nSecondly how can you possibly say “the Shroud is nothing more then a burial Shroud that points directly to the Passion and death of Christ” and NOT of the “Resurrection”…Seriosly Yannick, that is just your assumption, nothing more. You CAN NOT in any sense of the word ‘KNOW’ what the Shroud is, or make a statement as such with full conviction, as it is a nonsensicle statement.\nR\n\n","date":"January 10, 2012 at 6:13 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6791","author":"Ron","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Sorry typo error; should read as (nonsensical), …I should really proof read before hitting the post button ;-)\nR\n\n","date":"January 10, 2012 at 6:17 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6792","author":"Ron","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"Relax Ron !  Of course, for me and you who believe in Christ, the Shroud mean more than a simple burial Shroud !!!  OF COURSE !  But what I wanted to state is that, from a STRICT SCIENTIFIC POINT OF VIEW, forgetting the religious aspect of it, this cloth SHOULD be examine as any other archaeological artifact.  That’s what I was saying.  The resurrection question, since we know nothing about the way it was done, should be left out of the question when someone wants to study scientifically this object.  Rogers understood that, but sadly, we cannot say the same for many other “scientists” in the Shroud World.  When a scientist left his religious feeling interfered with his scientific research, he just put one step OUTSIDE the science field !\nLast comment about the meaning of the Shroud :  the Catholic church agree with me that, way before the resurrection, the Shroud point out in the direction of the Passion and death of Christ.  The resurrection can ONLY be seen with the eyes of faith, while anybody (no matter if he’s a believer or not) is able to see the Passion and death of Jesus when he look at this cloth…\n\n","date":"January 11, 2012 at 12:25 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6814","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"And Yannick what I am saying is; I don’t think it is possible too see the Shroud from a “strictly scientific point of view” just because of what it PROPORTS TO BE!!….Didn’t even Rogers say; ” I could prove this the burial cloth of the historical Jesus” or something to that account in his final video? …So even Rogers understood the problems associated with the ‘representation’ of this Shroud. I also believe you are misrepresenting alot of the scientists studying this Shroud. Remember some have come to the conclusion/hypothesis of ‘some type of burst of energy’ caused the image, not from religious tendencies or from Hollywood depictions but from what several scientists have found and concluded HAS NOT caused the image….nothing more.\nR\n\n","date":"January 15, 2012 at 7:48 am","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-6995","author":"Ron","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"And you will make me believe that those “scientists” who pretend that the Shroud images came from “some type of burst of energy” are completely free of any religious preconceptions ?  You want me to believe that ?  \nLet’s check out a short list of those scientists (those that I know the best) :\nDi Lazzaro :  a good Italian catholic\nFanti :  a good Italian catholic\nJackson :  a good American catholic (or protestant, I’m note 100% sure but I think he’s catholic)\nRinaudo :  a catholic priest !!!\nThe list goes on and on and on !  Find me ONE, just ONE scientist who proposed a “supernatural” hypothesis for the image formation and who is, at the same time, a complete atheist or a complete agnostic, and then I’ll start listening…  It’s almost impossible to find one scientist who proposed a “supernatural” hypothesis that is not, in some way, driven by his own personal faith.  Almost impossible.  In that sense, I will forever have great doubts about their integrity in regard of their hypothesis…  And it’s the same thing for a lot of historians in the Shroud world…\nNever underestimate the danger of bias when it comes to scientists who believe in the resurrection of Christ !  There’s so many bad example of that, can’t you see ?\n\n","date":"January 15, 2012 at 8:46 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-7017","author":"Yannick Clément","site":"shroudstory"},{"title":"Tom Chivers would like to be able to \"Get over it\" but the Shroud of Turin evidence won’t let them","post":"One last comment about the scientists who believe in Jesus-Christ :  Outside the subject of the Shroud, I have NO doubt about the profesionnalism of those scientists.  It’s only when they do their science with the Shroud that I have serious doubts about their objectivity.  We have to understand that it’s VERY HARD for someone to put his faith in his back pocket when he do some scientific work about the Shroud.  VERY HARD !  And I don’t think there’s many scientists who have been able to do that over the years…\n\n","date":"January 15, 2012 at 8:50 pm","url":"https://shroudstory.com/2012/01/07/tom-chivers-would-like-to-be-able-to-get-over-it-but-the-shroud-of-turin-evidence-wont-let-them/","cat":"carbon_14_dating","id":"comment-7018","author":"Yannick Clément","site":"shroudstory"}]
