[{"title":"Was this page removed because it was just too political?","post":"Or just because it is nonsense?. Sadly, too often in the field of the Shroud we see too many conspirations. This web page seems to me full with theories that from time to time arise. Substitution of the samples, NATURE ignoring the peer-review stage for the paper about the C14 test for non-scientific reasons…….It is simply too much!\nI don’t want to repeat myself in this blog but the recent peer-reviewed paper and published in aserious JCR journal regarding the presence of a trend once and for all rules out these hypothesis and reprsents an unexpected confirmation so many years after the test, that the laboratories did a good job. Regarding the point of Nature, it can only be accepted by someone who just doesn’t know how things work in scientific journals.\nThis page was removed by someone with common sense. That’s all, folks! No conspirations.\n\n","date":"August 27, 2012 at 3:28 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15508","author":"Gabriel","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Gabriel, how or what have you actually read on the issue of the C14 testing done in 1988? If you were to read several papers and books on the matter, you will find that much of what is written in the linked-page above is FACT. I won’t state that a ‘switch’ was performed but alot of the other points made, are in fact, TRUE. As I’ve stated several times before on this blog, the c14 testing was a complete fiasco and I arrived at this conclusion not on my own, but by researching and reading. All or most of where I acquired this info can be found at shroud.com or you can read “The Rape of the Shroud” by William Meacham. I don’t believe there is any proof to a substitution, but there is evidence of a stunning lax in protocols, procedures etc; Things such as the samples being split into smaller pieces by the labs, and actually too “below minimum threshold weight for proper testing”, no official photos of said samples when received at the labs, no proper examination of the samples before cleaning, BASIC cleaning methods used, “not neccessarily efficient for linen samples of a unknown provenance or history” , and finally to the unorthodox communications between labs before results were published or even while testing was in progress!! Moreover, and yes to the non-peer-reviewed release of the Nature paper. In actuality the final results have still not been released, even till this day, to the Turin Archdiocese!\nPapers you may want to read; ‘Evidence is not proof: A Response to Timothy Jull’ by Mark Oxley and ‘Radiocarbon Dating the Shroud of Turin: A Nature report’ by Remi Van Haelst, just to name a couple. These amongst others can be found at Shroud.com under scientific papers.\nR\n\n","date":"August 27, 2012 at 7:12 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15516","author":"Ron","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"http://jrsm.rsmjournals.com/content/99/4/178.full\nTHE DEFECTS OF PEER REVIEW\n“So we have little evidence on the effectiveness of peer review, but we have considerable evidence on its defects. In addition to being poor at detecting gross defects and almost useless for detecting fraud it is slow, expensive, profligate of academic time, highly subjective, something of a lottery, prone to bias, and easily abused.”\n\n","date":"August 27, 2012 at 4:38 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15509","author":"Angel","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Peer-review may have it’s issues, but it is better then nothing. Think of it simply as someone ‘proof-reading’ a paper you have written. But in this specific case it is understanding the numbers, what they mean, calculating, and if the conclusions are correct and can be reproduced, then it is passed. As long as it is done legitimately, it is the best we have right now.\nR\n\n","date":"August 27, 2012 at 7:34 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15520","author":"Ron","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"What you state was true years ago, when honesty prevailed. \nUnfortunately, now with rampant corruption on a global scale, you might want to take a peer-reviewed article with a grain of salt. \nThe Pharmaceutical industry is an example.\nQuote from article (link below).\nhttp://articles.mercola.com/sites/articles/archive/2010/05/18/how-corrupted-drug-companies-deceive-and-manipulate-your-doctor.aspx\nBias #1: Unwanted Results are Not Published\n“But drug companies publish only a fraction of the studies they fund — the ones that promote their drugs.\nIf a study does not have findings that are favorable to its product, it is unlikely it will ever make it into a journal for publication.”\nIn contrast, studies that have favorable findings almost always make the cut. \nFurther, even the Better Business Bureau was accused of taking money  (selling its grades).  Wolfgang Puck, Celebrity Cheft was given an “F” rating, because he refused to pay the BBB, as was the Ritz Carlton\nhttp://abcnews.go.com/WNT/video/better-business-bureau-sell-grades-bribe-corrupt-brian-ross-12136209\nNow that we know corruption exists in this cross-section of our global society, why would the dating of the Shroud be an exception?  Money, the root of all evil, unfortunately still talks.\nThe question remains, was money exchanged for an unfavorable Shroud date?\n\n","date":"August 31, 2012 at 9:05 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15673","author":"Angel","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Actually, it appears that it was just moved to another page:  http://www.crc-internet.org/1401-ii-the-conclusion-of-a-new-trial.html.  (I had trouble pulling up the wayback page to compare, although I was able to get it this morning.)\n\n","date":"August 27, 2012 at 6:07 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15512","author":"Joe Marino","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"To Gabriel ~ Considering the peculiar sample and the abandoning of the protocols for this testing, I suspect foul play just on that basis alone.  As Joe Marino shows, the page was not removed, only moved.\n\n","date":"August 27, 2012 at 7:14 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15517","author":"Andy Weiss","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"\nRon :\nGabriel, how or what have you actually read on the issue of the C14 testing done in 1988? If you were to read several papers and books on the matter, you will find that much of what is written in the linked-page above is FACT. I won’t state that a ‘switch’ was performed but alot of the other points made, are in fact, TRUE. As I’ve stated several times before on this blog, the c14 testing was a complete fiasco and I arrived at this conclusion not on my own, but by researching and reading. All or most of where I acquired this info can be found at shroud.com or you can read “The Rape of the Shroud” by William Meacham. I don’t believe there is any proof to a substitution, but there is evidence of a stunning lax in protocols, procedures etc; Things such as the samples being split into smaller pieces by the labs, and actually too “below minimum threshold weight for proper testing”, no official photos of said samples when received at the labs, no proper examination of the samples before cleaning, BASIC cleaning methods used, “not neccessarily efficient for linen samples of a unknown provenance or history” , and finally to the unorthodox communications between labs before results were published or even while testing was in progress!! Moreover, and yes to the non-peer-reviewed release of the Nature paper. In actuality the final results have still not been released, even till this day, to the Turin Archdiocese!\nPapers you may want to read; ‘Evidence is not proof: A Response to Timothy Jull’ by Mark Oxley and ‘Radiocarbon Dating the Shroud of Turin: A Nature report’ by Remi Van Haelst, just to name a couple. These amongst others can be found at Shroud.com under scientific papers.\nR\n\nThey completely ignored their protocols, Ron.  The carbon dating was not science, but voodoo magic to shed a disparaging light on the Shroud.  This has since been pointed out astutely by Sue Benford and Joe Marino and proven from the physical evidence by Ray Rogers.  Mechem’s book is excellent in this regard and he is an expert on carbon dating.\n\n","date":"August 27, 2012 at 7:35 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15521","author":"Andy Weiss","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Thats some powerful ‘voodoo magic’ if it’s blinded millions to the truth, over the span of 25 years!    It does make one wonder if there is some ‘devilish’ underpinnings to it all.\nR\n\n","date":"August 29, 2012 at 10:54 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15560","author":"Ron","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"For anyone who has not yet read Emanuela Marinelli’s C-14 setting paper presented at the 2012 Valencia conference, I highly recommend it.  It’s 30 pages, has over 250 footnotes, and is very thorough.\n\n","date":"August 27, 2012 at 8:20 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15522","author":"Joe Marino","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Forgot to give the link for Emanuela’s paper:  http://tinyurl.com/cammkgx.  It can be gotten by searching under her name on the Blog or in the Valencia conference page at shroud.com\n\n","date":"August 27, 2012 at 8:58 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15525","author":"Joe Marino","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Thanks for the link Joe, btw didn’t you write a paper (outside of the patch hypothesis) on the c14 dating and it’s issues? I seem to remember reading something a while back, but cannot seem to find it today.\nThanks,\nR\n\n","date":"August 29, 2012 at 10:49 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15559","author":"Ron","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Joe: Thank you for the link;  I found it OK, but unusually couldn’t seem to read the MHTML download for some reason.  A PDF can be found on the shroud.com site at:\nhttp://www.shroud.com/pdfs/marinelliv.pdf .  downloadable and readable!  \nAs well as the more apparent manouverings by Tite and the other labs, a key aspect has to be Flury-Lemburg’s insistence that only the one sample would be necessary, as she deemed the cloth to be homogeneous.  Her assertion is highly questionable in itself, but despite her high reputation as a textile expert, it seems she was totally ignorant about standard elementary requirements for any kind of scientific representative sampling methods, let alone the need for observing proper scientific protocols.  It is an example of how a highly assertive but unfortunately ignorant person can destroy the outcome of such an important scientific project.  It played right into the hands of Tite et al.\n\n","date":"August 27, 2012 at 10:24 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15529","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"I have got a question for Ron: How do you understand that 25 years later, if there have been bad protocols or even substitution of the samples, after reassembling data from all the subsamples a statistically robust trend emerges? For me the only explanation is that originally it was there and even in the recent paper by Morgan in the Fanti journal, it can be clearly distinguished.  Perhaps, as Rpgers pointed out, it was a medieval reweaving or simply the C14 method -this is my favourite explanation- is not appliable for centuries-old linens but, in my view, after recombining data from subsamples analyzed separatedly if a trend emerges, this is a very serious fact which speaks in favor of the labs. The trend indicates the presence of an unknown effect on the linen, that 26 years after is again detected only because each lab did a good job. For me is much more difficult to explain that someone substituted the samples with other subsamples but originally aligned around a trend!\n\n","date":"August 28, 2012 at 2:08 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15533","author":"Gabriel","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Gabriel, if you read my post properly, you would have noticed I said I won’t say anything about substitutions, as there is no evidence for this. But from a basic level, and the evidence of breached protocols, improper and (LAX) procedures, and just plain shoddy work, the original radiocarbon dating can and should be suspect and deemed irrelevant. Just the fact all samples came from the same area of the Shroud is enough to make the findings suspect!! But there is so much more; the CHi value, the manipulation of numbers to ‘gel’ to 3 labs results and done as the procedures were ongoing, AND on and on…The results are ‘SUSPECT’ and proof of this has been shown quite well, and well before the reweaving was brought out and subsequently proven by Rogers. By the way, ASK YOURSELF; who was responsible for the “Trend” conclusions and testing announced recently?.\nIt is not arguable, the facts show the c14 process done in 1988 was a fiasco. The process reeks of unprofessionalism and maybe even a touch of misconduct. Ask any archaeologist, or C14 technician about the 1988 testing and procedures, and they will tell you the results would never be accepted inlight of the issues mentioned, they would throw the results out! Moreover, infact c14 results can never be trusted on their own, all other evidence must be weighed, that includes all information brought forth by STURP and others to the provenance of the Shroud. Why do you think the STURP team was banished? It was obvious, the labs feared STURPS test results would challenge and even cause to eliminate any results found through carbon dating.\nR\n\n","date":"August 28, 2012 at 11:34 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15540","author":"Ron","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"\nRon :\nBy the way, ASK YOURSELF; who was responsible for the “Trend” conclusions and testing announced recently?.\n\nRon, I am afraid I don`t uderstand what you mean, could you be more explicit?\nPerhaps I am wrong but I think that those results have been obtained with previously published and freely available data, so that are reproducible as the peer-review jpurnal indicates……\n\n","date":"August 28, 2012 at 2:29 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15544","author":"Gabriel","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"The question is pretty straight forward, Who did the re-evaluation? Seriously, if you haven’t done so yet please read the papers I mentioned above, but especially several papers by Remi van Haelst. This will give you an idea where I’m comng from and what I mean.\nThanks,\nR\n\n","date":"August 28, 2012 at 6:08 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15547","author":"Ron","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Ok, Ron, Thanks.\n\n","date":"August 29, 2012 at 6:20 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15555","author":"Gabriel","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Ron asked if I had written “a paper (outside of the patch hypothesis) on the c14 dating and it’s issues?”  You’re probably thinking of one I co-wrote:  “Chronological History of the Evidence for the Anomalous Nature of the C-14 Sample Area of the Shroud of Turin” (http://www.shroud.com/pdfs/chronology.pdf).  Barrie’s recent update also has another article “Bibliography of Major Sources Pertaining to the Events of the 1988 C-14 Dating of the Shroud of Turin” (http://shroud.com/pdfs/marinobib.pdf).\n\n","date":"August 29, 2012 at 7:53 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15586","author":"Joe Marino","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Hi Joe, I stand corrected then, I have read both papers of which you linked and the chronology one is awesome, thanks for the response and links.\nR\n\n","date":"August 29, 2012 at 10:24 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15600","author":"Ron","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"\nAngel :What you state was true years ago, when honesty prevailed.\nUnfortunately, now with rampant corruption on a global scale, you might want to take a peer-reviewed article with a grain of salt.\nThe Pharmaceutical industry is an example.\nQuote from article (link below).\nhttp://articles.mercola.com/sites/articles/archive/2010/05/18/how-corrupted-drug-companies-deceive-and-manipulate-your-doctor.aspx\nBias #1: Unwanted Results are Not Published\n“But drug companies publish only a fraction of the studies they fund — the ones that promote their drugs.\nIf a study does not have findings that are favorable to its product, it is unlikely it will ever make it into a journal for publication.”\nIn contrast, studies that have favorable findings almost always make the cut.\nFurther, even the Better Business Bureau was accused of taking money (selling its grades). Wolfgang Puck, Celebrity Cheft was given an “F” rating, because he refused to pay the BBB, as was the Ritz Carlton\nhttp://abcnews.go.com/WNT/video/better-business-bureau-sell-grades-bribe-corrupt-brian-ross-12136209\nNow that we know corruption exists in this cross-section of our global society, why would the dating of the Shroud be an exception? Money, the root of all evil, unfortunately still talks.\nThe question remains, was money exchanged for an unfavorable Shroud date?\nAngel, I agree with you, and I am pretty sure the carbon dating test done in 1988 was never ‘properly’ peer-reviewed…(I am not alone in believing this either). As for your last statement as to money being exchanged for a specific result. It is “common knowledge” something in the line of 1.5 million pounds was ‘donated’ to a certain party, after the fact, “inlight” of the results given. This fact was printed in the papers of the day, actually!\nBut as for peer-review, in some cases maybe it cannot be trusted at all, such as what you mention in the pharmaceutical, or medical industries and some others, as there is alot of money (profits) at stake or to make, so not so surprising! In the Shroud world however, there isn’t much money at stake, …maybe alot of bias though. I wouldn’t think any of the peer-review papers that came out of  the STURP research was infected by either, although some would claim so, but with no warrant.\nR\n\n","date":"September 1, 2012 at 2:15 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15681","author":"Ron","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"Ron, Angel: I have read some of the documents you mention and, I admit it, some points are far from being clear. So I think I understand, at least partially, your point of view.\nNow, please I would like to ask you for an effort on your side and try to give an explanation for the trend. In the recent paper by Morgan (in Fanti’s journal) the UV images clearly indicate that there is a trend in the colour of the sample area. This trend has also, in an independent way,  been recently detected in a peer-review journal  by statistical means after recombining data from the three laboratories that did the C14 datation. All the data used for the statistical analysis is freely available and widely published since long time ago. How on earth, after independently recombining data from the three subsamples is it possible that the trend emerges as seen in the UV images taken before the C14 test? The only explanation that I see  is that  the three labs did a good job after all,  but truly, I am open to alternative explanations and a honest discussion form different points of view.\n\n","date":"September 1, 2012 at 8:05 am","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15683","author":"Gabriel","site":"shroudstory"},{"title":"Was this page removed because it was just too political?","post":"If you have the papers and have taken the time to ‘actually’ read them, which not knowing your abilities I’ll mention are not easy to read. It required a huge learning curve in my case along with much help, to understand Remi’s papers. But if you can understand these papers; You would realize the numbers in the original release of the Nature paper were “fudged”. Remi van Healst, ‘amongst others’ have pointed this issue out many times over the years and this seems to be simply ‘overlooked’ or ‘nearly never mentioned’ by anyone!  So if the numbers were fudged in the Nature (supposed peer-reviewed) paper, and the “statistical analysis” data you speak of must be one in the same as used in the Nature paper; It could then be STRONGLY concluded these statistical data would be suspect also!…Garbage in Garbage out!…Furthermore the trend is not important unless you are thinking there was a ‘switch’ perfomed.-J.Marino and S. Benford illustrated quite well in their papers that there was definately an issue with dating trends on the samples taken and the dates issued by the labs…\nWhy anyone, would still want to defend or take the ‘word’ of these labs as if they were beyond reproach, being so many protocols were thrown out and so many issues have been raised over the years, with peer-review data literally proving there was issues with the sample area, is beyond me. As far as I am concerned I wouldn’t trust anything that comes out, including new statistics, especially if these involve the labs themselfs or anyone or anything connected to them. Thats like asking a professional thief if he stole anything. \nLet’s not forget the fact that the AMS labs were the new kid on the block in 1988, and in a desperate struggle to prove their worth over other ‘proven’ methods being used. These labs had spent millions on their new equipment and even though they were basically unproven and earlier ‘Test-Runs’ showed their extreme limitations and falibility, whereas, their opponents had decades more experience and were proven methods, they still managed to grab complete control of the testing and the SPOTLIGHT. Does this not raise any negative thoughts in one’s mind? I’m not a conspiracy theorist, but this case reeks of it….So as stated before anything that claims to support the earlier findings, I’ll view with skeptism, sorry if thats not to your liking.\nR\n\n","date":"September 1, 2012 at 1:08 pm","url":"https://shroudstory.com/2012/08/27/was-this-page-removed-because-it-was-just-too-political/","cat":"carbon_14_dating","id":"comment-15693","author":"Ron","site":"shroudstory"}]
