[{"title":"What did Christopher Ramsey Know","post":"We should be wary of any slur on Christopher Ramey’s position on the Shroud.  He showed himself to be completely openminded in taking on the lab work involved in checking out the carbon monoxide hypothesis.  His position is made clear in the extended interview at http://www.shroud-enigma.com/c14/turin-shroud-carbon-dating-test.html\nI have no doubt that if anything “material” should come to light he would be the first to recognize it.  \nThe fact is, it is the Shroud’s custodians and those who have had unrestricted access to the cloth who have stated categorically that there is no contaminant present in the sample area.\n\n","date":"January 4, 2012 at 9:57 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6536","author":"David Rolfe","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":"Prof. Christopher Ramsey Bronk, aka “C.R. Bronk,” the first-mentioned name from Oxford in the 1989 Nature article declaring that “The age of the shroud is obtained as AD 1260-1390” (AD1325 +/- 65 years) and therefore “the linen of the Shroud of Turin is mediaeval.” That presumably means that he was the scientist at Oxford who actually did the test. \nIf so he must have known that the Shroud samples contained cotton that was “possibly of Egyptian origin and quite old.” But the other two labs, Tucson and Zurich had already run their tests 2-3 months previously, and had arrived at a date of about AD1350. The three AMS labs would normally be in regular contact with each other so it beggars belief that the labs did not share their results of their dating of the Shroud. Anyway, there is evidence that they did.\nRamsey would then have had a dilemma: \n1. He knew that the other two labs which had already dated their samples at ~AD1350 had not discovered the cotton (they hadn’t), so their dates would have included the cotton. \n2. So if Oxford removed the cotton from its sample, then Oxford’s date could not have been the same consensus ~AD1350 date as the other two.\n3. If the cotton was “of Egyptian origin and quite old” and was not removed, it would have made their Shroud sample appear to be much older than ~AD1350.\nThere seems to be only one honourable way out of Ramsey’s dilemma and that is if both the cotton and the Shroud sample were about the same ~AD1350 age. \nBut then why would the cotton appear to be “yellow  … possibly of Egyptian origin and quite old” even under a 200X microscope if it was in reality the same ~AD1350 age of the Shroud linen sample?\nThe only answer seems to be that the cotton was dyed yellow to make it look like the linen. And it took it being “magnified 200 times under a microscope” to discover that it was cotton.\nBut this is precisely what the “medieval repair” or Benford-Marino “Reweaving Theory” maintains. That the tiny 1.2 x 0.8 cm sample that the three labs were given from the same area of the Shroud and then divided equally amongst themselves for dating, was not part of the Shroud itself, but was actually a medieval patch added to the Shroud for repairs, using cotton dyed to make it look invisible to the naked eye against the background of the yellow linen.\nSo if Ramsey continues to maintain “the suggestions of … medieval repair were unlikely” then he has no honourable way to explain how the other two labs arrived at an ~AD1350 date, even though their sample included what appeared to be old Egyptian cotton; and his Oxford lab arrived at the same date with the same cotton removed. Unless Oxford deliberately re-ran its test on a sub-sample with the cotton included so as to make it appear to agree with the other two labs. \nOr if Ramsey claims the cotton was not old, then he needs to explain: 1. how old was it? And 2. why did it look old and yellow, even under a 200X microscope.\n\n","date":"January 4, 2012 at 10:37 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6537","author":"Stephen E. Jones","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":">Ramey’s … showed himself to be completely openminded in taking on the lab work involved in checking out the carbon monoxide hypothesis\nAs I pointed out previously, Jackson’s carbon monoxide hypothesis would be an honourable way out for all three labs. That is, the Shroud sample they had did actually date to about ~AD1350 due to a then unknown contaminant: new carbon in the form of carbon monoxide.\nBut to admit that what the three labs tested was actually a “medieval repair,” not the Shroud itelf, would not be an honourable way out because it would make the labs look like fools, i.e. they did not even realise, or consider, that they were dating a mediaeval patch.\nAlso, since Oxford actually discovered the cotton, it would have even less excuse for not realising that what they had was a medieval patch, not the Shroud itself.\n\n","date":"January 4, 2012 at 10:54 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6539","author":"Stephen E. Jones","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":"There is no slur here. I have always considered Prof. Ramsey open minded and have quoted him to that effect. But when the press states certain things, people react. I can ignore it or blog about it. If I don’t blog about it others, who I think are less committed to accuracy, will.\nIt was not the shroud’s custodians who were being quoted; it was Prof Ramsey. I find the arguments against Benford/Marino/Rogers, given all the evidence, insufficient for a qualification of “unlikely.”\nDavid, I know we disagree and I doubt either one of us is about the change opinion. But my disagreement was not a slur.\nDan Porter\n\n","date":"January 4, 2012 at 11:10 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6541","author":"episcopalian","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":"Dan, I welcome the clarification.  Personally, I find the “Ambergate” document intriguing and potentially very damaging.  It demonstrates the rather haphazard approach to the testing that I am sure the labs would normally want to distance themselves from.  It would appear there was no documentation of this particular episode which suggests, at the very least, a lack of professionalism.\nI am not certain what it is we disagree on.  I remain open-minded about the reweave theory. What we all have to live with is the fact that the one person who should know, Ms Flury Lemburg, refuses to countenance it.   Professor Ramsey can hardly be expected to contradict the only person who has had the opportunity to examine the shroud as a textile at close quarters.\n\n","date":"January 4, 2012 at 11:37 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6543","author":"David Rolfe","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":"gotta agree wih jones completely and porter mostly. believing there is a lack of provenance doesn;t make it unlikely. an experts “i don;t think i see doesn;t make it unlikely.” where;s the science???\n\n","date":"January 4, 2012 at 11:19 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6542","author":"MouseInTheHouse","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":"Actually Ramsay is “right to a certain extent”. \nSuch a high contamination does not imply a medieval repair. A XIXth century repair is most likely (either by the princess Clothilde of Savoy-Bonaparte or the Master of upholstery in the  Royal court  of Savoy, in 1863).\n\n","date":"January 4, 2012 at 11:56 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6544","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":"BYE-BYE C14\nSince I started following this blog, I have noticed that one of the major concerns of researchers is the C14 radiocarbon dating. This post and also the post of Jan 1 by Russ Breault are good examples. The underlying idea is that if a new C14 test is carried out on the original linen, the results would confirm that it is authentic. \nHowever, I see a big paradox here, since the validity of the C14 method itself when applied to ancient cloths, has been scientifically challenged –not only but yes to a great extent- by the Shroud researchers community since 1988. And I think they have succeded in that. Therefore, in 2012 it can be stated that the method is not reliable for ancient linens, regardless the sample is correctly chosen or not and also regardless the statistical technique used. It is due to these intrinsic shortcomes and limitations of the C14 method –mainly the fact that the effect from a bioplastic organic coating cannot be removed from cloths(1)- that new methodologies have to be explored. \nIt may well happen (and I personally would bet yes!!) that in a new C14 test -this time with the correct sample- the results indicate something similar to the tests of for example, the Sudarium of Oviedo (7th century) and the results would not be conclusive once again. Radiocarbon dating belongs to the 80’s and currently very powerful techniques are available which could help. \nWhy not leave behind once and for all the C14 method and concentrate on what state-of –the-art technologies can offer in 2012 and forthcoming years?\nIn this sense, I would like to mention the laser-induced breakdown spectroscopy (LIBS). With this almost non-destructive technique applied to cloths it is possible to identify the trace elements present (2) on cotton or linen that can make it possible to scientifically connect the cloth with a certain area (3) of the world (for example Palestine). It would also make it possible to build a definitive connection (or completely rule it out) between the Shroud and the Sudarium of Oviedo.\nThe best of all, it needs such a small sample that it is considered as nearly non-destructive and the material captured in the sticky tapes would be enough.\n(1) H.E. Gove, S.J. Mattingly, A.R. David, L.A. Garza-Valdes. A problematic source of organic contamination of linen.Nuclear Instruments and Methods in Physics Research B 123 (1997) 504-507\n(2) Emily R. Schenk and Jose R. Almirall. Elemental analysis of cotton by laser-induced breakdown spectroscopy. Applied Optics, Vol. 49, Issue 13, pp. C153-C160 (2010)\n(3) Takako Inoue, Kengo Ishihara and Kyoden Yasumoto.International Journal of Clothing Science and Technology Vol. 22 No. 2/3, 2010 pp. 174-186\n\n","date":"January 4, 2012 at 6:32 pm","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6552","author":"Gabriel","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":">I remain open-minded about the reweave theory. What we all have to live with is the fact that the one person who should know, Ms Flury Lemburg, refuses to countenance it.\nWhether David intended “Ms Flury Lemburg … refuses to countenance it” literally, it does seem to be the impression created by Mechthild Flury-Lemberg rejection of Benford and Marino’s invisible reweaving theory, backed up as it is with a wealth of scientific evidence. \nAccording to Joe Marino (private email), Flury-Lemberg’s main objection to the reweave theory is that such invisible weaving would be visible on the reverse side, and she had not personally seen it when she examined the Shroud (see her “The Invisible Mending of the Shroud in Theory and Reality,” BSTS Newsletter No. 65, June 2007).\nBut as Benford and Marino pointed out in their paper, “Discrepancies in the radiocarbon dating area of the Turin shroud,” Chemistry Today, July-August 2008, medieval reweaving could be made to be invisble on both sides:\n“Historical evidence demonstrates that it was not only possible for medieval weavers and embroiderers to invisibly mend textiles such that they were not top-side detectable, but it is also recognized that they could choose whether or not to permit their handiwork from being detected on the back side as well.\n`Historically, reweaving was not carried out through a support fabric and was often executed so skilfully that it is not always recognizable as a later addition, although differences in the rate of dye fading have often revealed its presence. Evidence of reweaving would now (16th Century) usually be left deliberately visible on the reverse of the tapestry by the presence of the warp ends and knots’ [F. Lennard, M. Hayward, Tapestry Conservation: Principles and Practice. Burlington, Massachusetts: Butterworth-Heinemann 16 (2006)]\nAs this passage infers, skilful medieval weavers could choose whether or not to leave evidence of their work on the back side of a fabric. Although a less-than-conventional restoration practice, it is known that in early part of the 16th Century the art of `reversing’ was practiced such that tapestries could be viewed intact from either side of the cloth.”\nThese very cotton fibres that Oxford discovered in their sample, yet  Tucson and Zurich had not, and which required 200x magnification to determine that they were cotton, is itself evidence that just looking at the Shroud with the naked eye, may be not enough to detect expert medieval reweaving that is designed to not be visible to the naked eye.\n\n","date":"January 5, 2012 at 1:33 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6556","author":"Stephen E. Jones","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":"The impact of a specific Judean burial practice (the use of water mixed with ashes to purify and keep with his body the shed innocent blood of a man unfairly sentenced to death by the Sanhedrin) SHALL NOT be completely ruled out in the carbon dating issue either.\n\n","date":"January 5, 2012 at 9:15 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6565","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":"What Christopher Ramsey  did NOT know is not only the impact of a possible French reweaving (either in the XVIth or XIXth  century) but also that of a speclfic Judean burial practice of the Second Temple period.\n\n","date":"January 5, 2012 at 9:23 am","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6566","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":"I’m with Gabriel on this!!,…Time to move on. It is in my opinion from my personal study, gut feeling and I shall I dare say God given ‘common sense’, the testing done in ’88 was tremendously flawed. It’s too bad certain people won’t own up to it and clear the ‘air’ finally, and allow for ‘proper’, modern testing to go forward. Don’t people realize we ‘may have’ the most important object in the history of mankind here? The implications of it being authentic is staggering. I wish those in control would realize this, stop pussy-footing around and allow further study.\nR.\n\n","date":"January 5, 2012 at 6:46 pm","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6580","author":"Ron","site":"shroudstory"},{"title":"What did Christopher Ramsey Know","post":"AMEN !\n\n","date":"January 6, 2012 at 1:56 pm","url":"https://shroudstory.com/2012/01/04/what-did-christopher-ramsey-know/","cat":"carbon_14_dating","id":"comment-6603","author":"Yannick Clément","site":"shroudstory"}]
