[{"title":"What is going on at the AMS Laboratory at the University of Arizona?","post":"The textile examined by Freer and Jull is a 3/1 twill, as can be seen from photographs in this video of the Arizona State Museum:\nhttp://www.statemuseum.arizona.edu/podcasts/ep033_beyond_naked_eye.shtml\nSee at minute 02.31 (warp side) and 01.23 (weft side). Other images are from minute 11.30. In all these photos, the warp threads run horizontally, as can be deduced from the inclination of the diagonals of the herringbone twill. From these photos it is easy to count the warp and weft threads. From the bar equivalent to 1 mm as shown with the first two photos, we may estimate that the dimensions of the rectangle are about 6 by 8/9 mm. Then it is easy to verify that the numbers of warp and weft threads per centimeter are just those to be expected from the known measurements by Vercelli and others. The values as given by Freer and Jull are completely wrong. Probably they have mistaken the warp for the weft. This is a serious mistake because it is well known that in the Shroud (and also, as a rule, in most ancient textiles) the warp threads are more dense than the weft threads. This is also immediately evident if only one looks at the inclination of the herringbone diagonals, which form an angle of less than 45 degrees with the warp direction.\nMiss Freer (or Mrs Freer-Waters after her recent marriage) did this work in 2008 while she was at the Museum with a one year fellowship. She was very young (you may see her photo in the same video at minute 00.24) and had just earned a MS in 2007 from the University of Rhode Island. For her current activity, you may see her website:\nhttp://www.textileanalysisandconservation.com/\n\n","date":"January 6, 2011 at 10:17 pm","url":"https://shroudstory.com/2011/01/06/what-is-going-on-at-the-ams-laboratory-at-the-university-of-arizona/","cat":"carbon_14_dating","id":"comment-2149","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"What is going on at the AMS Laboratory at the University of Arizona?","post":"@Gain: Look at the picture two posts down. That is not 3/1 twill. That is not from the shroud.\n\n","date":"January 6, 2011 at 11:16 pm","url":"https://shroudstory.com/2011/01/06/what-is-going-on-at-the-ams-laboratory-at-the-university-of-arizona/","cat":"carbon_14_dating","id":"comment-2150","author":"anon","site":"shroudstory"},{"title":"What is going on at the AMS Laboratory at the University of Arizona?","post":"a moment: the threads count was made by Freer-Waters or by textile expert Ann Edlund? or by both?\nGian Marco Rinaldi is a mathematician but he seems to know the textile topic better.\nanyway: and the peer review process?\n\n","date":"January 7, 2011 at 7:54 am","url":"https://shroudstory.com/2011/01/06/what-is-going-on-at-the-ams-laboratory-at-the-university-of-arizona/","cat":"carbon_14_dating","id":"comment-2154","author":"domenico","site":"shroudstory"}]
