[{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"The thing that I don’t understand his why Ramsey said what he said in the David Rolfe documentary (that the C14 result of 88 was really questionnable) and now, he seem to have completely changed his mind.  Is it due to the possible failure of the hypothesis of John Jackson regarding a possible increase of the level of C14 in the Shroud fibers due to Carbon monoxide ?  I know he worked with Jackson and, reading Ramsey’s last comment, it seem that Jackson hypothesis has been discard by him.  Maybe that’s why he seem to have changed his mind about the possibility that the C14 result of 88 can be wrong ?  If it is so, then I think he made a mistake because there’s others viable hypothesis out there, like the french invisible reweaving.\n\n","date":"December 30, 2011 at 9:07 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6342","author":"Yannick Clément","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"Yes, he definately has made a ‘huge’ mistake, and not only in not considering “other viable hypothesis” but in stating the original testing should not be in question!!…He was there, apparently new to the field, but there still. He knows quite well what was and wasn’t done correctly, yet he’ll still claim the testing was not in error…..total hogwash. There is definately an AGENDA behind the words.\nR\n\n","date":"December 31, 2011 at 10:43 am","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6372","author":"Ron","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"The only agenda I can see is that he want to defend at all cost the reputation of the Oxford C14 lab.  But again, why did he seemed to be more open in the David Rolfe documentary about the possibility that the test was wrong after all ???  I don’t have a sure answer for this.  Maybe he was drunk that day ???  Of course, it’s a joke here. ;-)\n\n","date":"December 31, 2011 at 8:13 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6388","author":"Yannick Clément","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"It is written :  C.R. Bronk in the article.  So, maybe his real name is “Christopher Ramsey Bronk” instead of “Christopher Bronk Ramsey” ???\n\n","date":"December 30, 2011 at 9:19 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6348","author":"Yannick Clément","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"First two corrections: “4 x 2 metre” should be “4 x 1 metre” or “4.4 x 1.1 metres.” And “Ramsay” should be “Ramsey” as mostly stated.\nI presume Ramsey’s real name is Christopher Ramsey Bronk, as per the Nature article and books on his web page (http://www.arch.ox.ac.uk/CBR.html), but he (understandably) prefers “Ramsey” to “Bronk”!\nIt is also worth noting that his name appears on the 1989 Nature paper first of those from Oxford: “… C.R. Bronk,3 E. T. Hall,3 R. E. M. Hedges, 3 R. Housley,3 I. A. Law,3 C. Perry,3 … 3 – Research Laboratory for Archaeology and History of Art, University of Oxford, Oxford, OX1 3QJ, UK …”\nThat usually signifies that he actually did the experiment. Also, that Bronk/Ramsey was no mere bit player in the radiocarbon dating of the Shroud is evident that he is mentioned in Gove’s book on it as attending, as Oxford’s representative, an important meeting in Canada on 30 April 1987, of representatives of the five AMS radiocarbon laboratories who were originally proposed to carbon-date the Shroud:\n“The people present at the Niagara-on-the-Lake meeting were S L Brignall, Rochester, C R Bronk, Oxford, P E Damon, Arizona, D J Donahue, Arizona, J C Duplessy, Gif-sur-Yvette, H E Gove, Rochester and W Woelfli, ETH Zurich.” (Gove, H.E., 1996, “Relic, Icon or Hoax?: Carbon Dating the Turin Shroud,” p.188).\n\n","date":"December 30, 2011 at 11:19 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6363","author":"Stephen E. Jones","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"Firstly, I’d just like to point out a fact which is not mentioned often enough and related to the Shroud’s measurements; It’s measurements of 4.4 x 1.1 metres also conform to the Jewish “Cubit’ in it being exactly 4 x 2 cubits in measurement…another evidence of it’s provenance?\nSecondly I think Mr Jones is correct in his assumption; there can be little doubt that Ramsey was a player in the RC dating…to what extend is the question, as apparently he was new to the lab at the time.\nR\n\n","date":"December 31, 2011 at 10:58 am","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6373","author":"Ron","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"Someone told me that this cubit measurement has to be taken with great prudence because it looks like we’re still unsure of the exact lenght of that measure.  I think there was even many different lenght for one cubit regarding of the place where you were.  Also, I think this kind of measurement could have varied from time to time.  Again, it’s just something I’ve heard and I’m not sure…  But I think we have to be prudent anyway with this aspect of the question, even if I think the Jacksons can be right about that.\nAnyway, I think there 2 more solid clues that were find on the cloth that confort the possibility that the Shroud came from the 1st century Palestine :\n1- The very particular seem (1st century jewish style) that was found by Flury-Lemberg during the restoration of 2002.\n2- The aragonite dirt that was found in the right heel region (as I remember) and that chemical tests showed that it there’s a good probability that it came from the Jerusalem area.\nI tend to rely more on those 2 facts than on the cubit clue…\n\n","date":"December 31, 2011 at 8:26 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6389","author":"Yannick Clément","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"It is true what you say about the cubit, but it has been concluded the Hebrew cubits(plural) as two different measurements were used; 17.6 inches regular and 20.7 inches commerce or commercial. Variations from different locals and time could very but were ususally within an inch or so of eachother. They also used two different measurements as shown. I would think when the Shroud was manufactured they would use the higher commercial number of 20.7 inches approximately. Therefore we would have 41.4 ” inches width or 1.05 metres for the Shroud. Pretty close I’d say. Since the Shroud can also differ in size due to conditions, I think it would be safe to say it conforms quite closely to the cubit measurements of the Hebrew first century era.\nR\n\n","date":"January 1, 2012 at 3:21 am","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6403","author":"Ron","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"That’s very possible Ron but I’m sure you already thought that this is not a clear age indicator for the cloth !  In fact, some Jewish cloth craftman could have know this kind of measure during the Middle Ages and could have easily reproduced them for a false Shroud of Christ he would have made during that time.  And in fact, for all we know, this craftman could have done his work in Europe or elsewhere outside Palestine !\nSo, the cubit thing is for me a simple clue that is maybe relevant but I wouldn’t bet my house that this aspect of the question is a clear proof that the Shroud is 2000 years old and was manufactured in Palestine.\nThe 2 others evidences I talk about are way more “solid” in my opinion…\nQuestion about this 4 X 2 cubit measurement for the Shroud :  Do you think this prove that the side strip was add to the main part of the cloth in order to make a cloth with precise measures ???  Maybe that was done to respect some ancient Jewish prescriptions ???  Very possible, don’t you think ?  I would like to hear other people’s opinion on this topic.\n\n","date":"January 2, 2012 at 12:04 am","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6445","author":"Yannick Clément","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"Yannick, I never said it was a ‘clear indicator’, just meant IT as another ‘bit’ of information to go along with all the other bits of information known, showing the Shroud’s true age or location of origin. Please don’t put words in my mouth.\nI can not fathom a “medieval Jewish craftsmen” producing the Shroud in the ancient method of production. Quite unbelievable actually!. Plus doesn’t the point You yourself mention above about the “particular” seam (dating the Shroud to the 1st century), put this medieval Jewish craftsmen in serious doubt???\nFrom two different studies done on the side-strip by experts, I do not see it being added at the time of manufacture; The threads that run thru the strip match up with the threads on the Shroud almost perfectly. The consensus on the method of manufacture of such large linen sheets would be; that the sheet the size of the Shroud would have been cut from a much larger sheet. The seam would have then been added later. Also think of it aesthetically, these Linen sheets were expensive, who would buy an imperfect sheet with an unsightly seam along it’s full length? …unlikely…\nOne study mentioned before, proposed the seam was just added for some type of hanging method contrary to Jackson’s theory, but I personally find that reasoning illogical, Why not put seams on both or all sides then? The fact that the threads run thru ‘almost ‘ perfectly I think shows quite well that the strip was originally part of the main sheet, was removed for some reason, then re-sewn at a later time…that is my opinion from my readings and in going with Dr Jackson’s hypothesis.\nR\n\n","date":"January 2, 2012 at 5:17 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6479","author":"Ron","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"Actually, “Jackson’s side-strip theory” might well be mine as I first mentioned it in a 1997 memo “La Solution Archéologique de l’Enigme” (in Nice). I also think the strip was originally part of the main sheet, might have been removed for binding the burial sheets and then re-sewn at a later time to have a better hold of the Shroud.\n\n","date":"January 6, 2012 at 3:12 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6605","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"corrections: “for binding the corpse into the burial sheets”\n\n","date":"January 6, 2012 at 3:24 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6609","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"…and/or reconstruct the original “Sindon of Joseph”.\n\n","date":"January 6, 2012 at 3:39 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6612","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"Quote : “Plus doesn’t the point You yourself mention above about the “particular” seam (dating the Shroud to the 1st century), put this medieval Jewish craftsmen in serious doubt???”  Good remark.  Effectively, it look like it does.  But again, we cannot completely disregard the possibility that this supposed medieval Jewish craftmen could have known this very particular kind of seam that seem to really be Jewish in style (if we believe what Flury-Lemberg told us).  But I agree that this possibility is really thin.  But, for the discussion, I think it’s fair to keep this possibility in mind.  And I think the high probability that the Shroud came from the 1st century Palestine come from the whole picture of the situation and not from just one or two aspect taken in isolation.\n\n","date":"January 3, 2012 at 8:42 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6525","author":"Yannick Clément","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"And for the exact nature of the seam and of the side-strip, I think like you, except for the most probable moment when the 2 pieces of material (coming from the same big sheet) were sewn together.  Because the banding effect we see everywhere on the Shroud continue almost perfectly from the main Shroud to the side-strip, I think the cutting and sewing was done almost at the same time.  One thing I really think is that the present state of the Shroud was probably the same when the disciples discovered it in the empty tomb, i.e. that the side-strip was probably already sewn beside the main part of the cloth.  But we cannot forget the possibility that there was another side-strip on the other side and that this strip was taken away afterward for unknown reasons, possibly to sell relic pieces.  This possibility is surely there, but since the body image on the Shroud is almost perfectly centered in the cloth, I have a tendency to think my idea is correct :  The present state of the Shroud (speaking of it’s textile aspect only) is most probably the same that it was in the empty tomb.\n\n","date":"January 3, 2012 at 8:53 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6526","author":"Yannick Clément","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"I doubt VERY HIGHLY the Shroud was found with the strip already sewn back on in the Tomb!!. Reason; Joseph had bought the Shroud the day of the emtombment! It was brand new when it was bound to Jesus. That thinking is completely illogical Yannick. Do you think Christ sewed the strip back on himself? ….j/k  ;-)\nThe idea that the strip may have been sewn on relatively soon after it was found is logical thinking, as whomever aquirred the pieces would want to keep them safely together being it was of great importance to them. Laying the strip side by side with the Shroud, it would not be difficult to match up exactly almost thread by thread the proper location of where to attach the strip. It may also be possible it was resewn much later on reminiscent of the higher quality stitching noticed by Madam Fleury…..Where do you get the ‘possiblility’ there was another strip taken from the other side? There is absolutley no evidence anywhere to even consider this notion…let’s work with what is tangible here.\nR\n\n","date":"January 7, 2012 at 7:09 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6651","author":"Ron","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"I think I didn’t express myself quite clearly !  I never wanted to say the the linen strips were sewn back on in the tomb !  I wanted to say tha the side strip was sewn back to the main part of the Shroud a very short time after those 2 parts were separated by a cut.  I was talking about the side-strip here and not the linen strips !  I agree with you on the fact that since it was an incomplete burial rite done on friday, the participants were in a hurry because of the Sabbath and the Passover that was coming and they most probably left the strips of linen in one place in the tomb, without using them for tied up the Shroud.  Why they would have to tied the Shroud on friday since they knew they add to come back to finish the job on sunday morning ? \nWhy I think the side-strip was sewn rapidly to the main part of the Shroud ?  Because the FACT that the body image is precisely in the center of the actual Shroud !  That’s the main reason why I think the side-strip was already sewn back with the main part of the Shroud when the body of Jesus was laid in the cloth.  When you see the high quality of the blood stains, you have to consider the fact that the Jews who participated in the burial partial rite on friday were REALLY careful !  It really seem to me that they were almost maniacs regarding the details of the rite.  I don’t think I’m wrong by saying that the Jews of that time were particularly meticulous.  In that context, if the side-strip wasn’t there in the tomb, that would mean they would have placed the body not perfectly in the center of the cloth.  Of course, when you’re in a hurry, it’s possible that it happened.  But I don’t think so.  Since the actual body image on the Shroud is right in the center of the cloth, I think it’s more probable that it was the actual configuration of the Shroud in the tomb when the body was laid into it.  That’s my own little analysis of the probabilities concerning the side-strip.\n\n","date":"January 8, 2012 at 9:29 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6695","author":"Yannick Clément","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"Yannick wrote: “One thing I really think is that the present state of the Shroud was probably the same when the disciples discovered it in the empty tomb.” \nActually it is far from certain that the Shroud was left behind in the empty tomb. You better asked yourself what a gardener of the Second Temple period looked liked. Then you’ll get the answer.\n\n","date":"January 6, 2012 at 3:54 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6613","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"Seriously Max where do you get these notions? I think it states quite cleary in John, that the Shroud and the sudarium were found in the Tomb, this is quite CERTAIN, even in Greek or Koine Greek. Are you suggesting they weren’t found by the apostles and that Jesus was wearing them when he appeared to Mary M.? Do you suppose Jesus would still be wearing an ‘unclean’ garment in his state of transformation? …The only word I can think of here Max is nonsense, but I’ll use another one since I know that word bothers you…Hows rediculous?\nR\n\n","date":"January 7, 2012 at 7:21 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6652","author":"Ron","site":"shroudstory"},{"title":"What’s in a name, Christopher Bronk Ramsey?","post":"Actually Ron, I have to disagree with you on this other topic.  But that doesn’t mean I agree with Max !!! ;-)\nI think the chapter 20 in St John can be understand in different ways.  Personally, the translation I favored the most (because I consider it in the light of the chapter 11, i.e. the raising of Lazarus) is that the disciples found the tomb empty on easter morning with the linen cloths that would have contained the mix of aloes and myrrh still in place on the rock tablet where the body was laid in the Shroud and what St John report as a “sudarium” folded in another place was actually the Shroud of Turin.  I think this way to see John description makes more sense when you consider chapter 20 along with chapter 11.  Having said that, I want to state that this way of understanding St John doesn’t mean one bit that the Sudarium of Oviedo is not genuine.  I think there’s a great probability that is is in fact genuine, but I don’t think St John talked one second about this stained cloth in his gospel.  \nWe have to remember that the ancient people used many words to describe a burial shroud and “sudarium” was among those terms, along with “sindon” which is a more “correct” term, technically speaking.  But even if “sindon” is more accurate, that doesn’t mean that nobody in those days was using the term “sudarium” as a way to describe a burial Shroud.  In fact, in St John’s native language, the Aramaic, Shroud was pronounced “Sudara”.  So, for someone used to think in Aramaic instead of Greek, I think it is fair to assume that he could have used the term “Sudarium” to speak of a burial Shroud.  And if you compare the terms that St John used in the chapter 20 with those he used in chapter 11, you see that “sudarium” has a more logical meaning in the chapter 20 is we assume he was reffering to the Shroud of Turin.\nImagine one second that St John entered in the tomb and found only the linen cloths containing the aloes and myrrh at the place where the body was and then, boom !, he see the Shroud but in another place in the tomb and nicely folded !!!  I think that was the “set-up” he wanted to describe and he wanted to let us know that the fact that the Shroud was nicely folded in another place was THE sign for him that Jesus was resurrected !  Effectively, if there was some people who would have come to stole the body, NO WAY they would have take time to remove the Shroud from the body and fold it nicely and left it in the tomb !!!  For St John, that was the “proof” (meaning a “sign”) that Jesus was really resurrected.  That’s the way I see this part of St John’s gospel.  Again, I’m like an outsider here because I know that the majority of people think like you on this topic but I don’t care !  I think if it is so, it’s simply because people didn’t thought to consider chapter 11 of St John in their analysis and also because they were kind of fooled by the presence of the Sudarium in Oviedo…\nJust a fact to support what I’m saying about the use of the term “sudarium” by the ancient people :  in the numerous relic lists I’ve talked about from Constantinople (dating mostly from the 11th and the 12th century), there are some writers who used the term “sudarium” while there is a good probability that they were talking in fact about the Shroud of Christ !!!  This is one major example for you to understand that it was common use for those people to interchange terms like that when they were talking about burial cloths.  \nLook, even today in french, we have the same exact situation !!!  Effectively, we have 2 different words that are often interchanged to talk about the Shroud of Turin :  “Suaire” (that mean “Sudarium”) and “Linceul” (that mean “Shroud”).  But even if “Linceul” is the correct term to speak about the Shroud (like “Sindon” in Greek), a lot of people still used the more general term “Suaire” to speak about the Shroud (like “Sudarium” in Greek).  That’s exactly the same thing with St John in my opinion :  He used the more general term “Sudarium” to designate the Shroud while he should have used the better technical term “Sindon” instead.  And that’s what have caused this great confusion that still rage today !!!!!!\n\n","date":"January 8, 2012 at 9:57 pm","url":"https://shroudstory.com/2011/12/30/whats-in-a-name-christopher-bronk-ramsey/","cat":"carbon_14_dating","id":"comment-6696","author":"Yannick Clément","site":"shroudstory"}]
