[{"title":"When History Trumps Science","post":"Personally, I would say that since the Shroud is a real burial Shroud that covered a real crucified man with all the stigmata of Jesus Christ (including the crown of thorns that was not common for a crucified viction) and that the type of injuries due to the scourging possessed definately a Roman signature, that’s well enough to invalidate the C14 dating, unless you think that a medieval forger would have scourge (with a Roman flagrum), beaten and crucified a man in order to produce a Christian relic.  \nAnd if you really think that this is possible, you will have to answer the question why this anonymous forger would have departed so far from the artistic tradition of his time by showing a nude Christ with injuries to the head looking like cap of thorns instead of the traditional headband and with a nail wound in the wrist instead of the traditional nail in the palms !!!\nIf we use Ockham razor, the simpliest and most likely answer for the Shroud is this :  It is exactly what tradition say that it is, i.e. the real burial Shroud of Jesus of Nazareth.  With all the data we know about the Shroud since 1978, I don’t think there’s another answer who can be near to the truth than this one, even if there are some other possibilities (see my recent open letter about the blood evidence).  The fact is that those other possibilities are much harder to defend in face of all science know now about the Shroud.  Consequently, those other possibilities are very unlikely.\nAnd I must say that the findings of Rogers published in 2005 are complitely coherent with my way of thinking.  Another C14 dating will be needed in the future to finally know the exact age of this cloth.  While we wait for this to happen, I don’t think it is very imprudent to think the Shroud is 2000 years old.  All the other scientific evidence, beside the C14, point in that direction…\n\n","date":"April 27, 2012 at 10:48 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10882","author":"Yannick Clément","site":"shroudstory"},{"title":"When History Trumps Science","post":"Good scientists don’t care a fig about non-scientific, non testable so-called evidence Dan, as I’m sure you must be aware. \nScientists are aware of their own limitations where enquiry is concerned, confining themselves to testing the testable. By the same token they do not lose sleep over their failure to operate outside their own self-imposed envelope of limitation. Kindly don’t publish this (unlikely anyway, in view of your anti-scientist firewall).\n\n","date":"April 27, 2012 at 4:00 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10887","author":"colinsberry","site":"shroudstory"},{"title":"When History Trumps Science","post":"So Colin’s saying that the only worthwhile evidence is testable scientific evidence???!!!\nI don’t know of any law courts that operate like this with such a self-imposed limitation.  Having spent nearly ten years in an Internal Audit Office, we took whatever forensic evidence we found, assessed its significance, and made our decisions accordingly.   Perhaps Colin needs to redefine his terms – otherwise it looks like “ostrich head in the sand” stuff.  I think the comment does Science and his scientific colleagues a disservice.  My own assessment of scientists I have met is that at least half of them anyway, actually live in the real world!\n\n","date":"April 27, 2012 at 4:43 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10889","author":"daveb of wellington nz","site":"shroudstory"},{"title":"When History Trumps Science","post":"M. Colinsberry have only 2 possibilites that is left open to him if he DOESN’T want the Shroud to be the authentic Shroud of Jesus of Nazareth :  \n1- It is a real burial shroud of someone who suffered the same tortures than Jesus, but who cannot be Jesus of Nazareth because a forger produces it “naturally” (without using any art technique).\n2- It is a real burial shroud of someone who suffered the same tortures than Jesus (but who was not Jesus of Nazareth) and was produced by some undetermined natural phenomenon(s).  In this case, it would be a purely accidental ressemblance.\nBeside that, you can forget about some kind of a scorch, some kind of a painting, some kind of a rubbing, etc.  The Shroud is not an artwork of any kind.  The evidence of the bloodstains alone is well enough to understand that.\nSo, which one of the 2 very unlikely possibilities describe above do you favored the most ??? :-)\n\n","date":"April 27, 2012 at 4:43 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10890","author":"Yannick Clément","site":"shroudstory"},{"title":"When History Trumps Science","post":"Here’s my reply, daveb, though it’s anyone’s guess how long it takes to get through  Dan Inc’s anti-me firewall. I did not say it’s the only worthwhile evidence – only that it’s the only evidence that matters to a scientist, while wearing his scientist’s hat. Note the last 4 words.\n\n","date":"April 27, 2012 at 4:54 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10891","author":"colinsberry","site":"shroudstory"},{"title":"When History Trumps Science","post":"“If a scientist has the results of 99 tests which are in favour of authenticity, and only one which is not, he would not throw out the 99 and accept the one, but would examine the ‘one’ which is not in favour, to determine the possibility of error”…unknown author.\nQuote: “In archeology, we consider carbon dating results imaginary”- Zahi Hawass, archeologist and secretary-general of the Egyptian Supreme Council for Antiquities.\nR\n\n","date":"April 27, 2012 at 4:59 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10892","author":"Ron","site":"shroudstory"},{"title":"When History Trumps Science","post":"Your comment may well bring rounds of applause on this site, Ron, together with your   appeal to the ultimate source of wisdom, the Egyptian Supreme Council, but that kind of Mickey Mouse advocacy is for me a source of intense mirth. “Bring me sunshine” as two of our revered comedians used to say…\nAt the time of writing, my previous comment had not been cleared by the site’s OberGruppenFuhrer,  so I shall now retire for the night.\n\n","date":"April 27, 2012 at 5:15 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10893","author":"colinsberry","site":"shroudstory"},{"title":"When History Trumps Science","post":"Well Colin if you disregard those comments on C14 especially as you claim to be a scientist/chemist, then I would say you are either blinded by bias or a fraud. There have been many other archeologists that have commented the same and agree with Hawass’s statement. Any scientist, archeologist, anyone who has dealt with radiocarbon dating would agree with those comments. It is a true fact that RCD is error prone, highly subseptable to contamination and ‘based’ on some voodoo mathematics, not to mention relies on “basic assumptions” regarding c14, c12 levels prior to the 1950s…this is fact Colin, not stories or assumptions.\nPeople like you now have to deal with the ‘FACT’ that the 1988 RCD is INVALID and scientifically speaking have no argument against the authenticity of the Shroud. All you can do now, since you’ve failed to replicate the image attributes in any form, is try to nit-pic at studies that have been done by some with maybe far more knowledge then you, which sorry to say seems pathetic to me.\nThanks for coming out.\nR\n\n","date":"April 28, 2012 at 7:32 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10908","author":"Ron","site":"shroudstory"},{"title":"When History Trumps Science","post":"Thank you Colin for the clarification.  And I imagine that principle would also apply to ensuring adequate sampling protocols and adherence to them when it comes to any kind of representative testing, such as for C14,  Otherwise a reputable scientist would not be disposed to accept the results!\n\n","date":"April 27, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10894","author":"daveb of wellington nz","site":"shroudstory"},{"title":"When History Trumps Science","post":"“Your comment is awaiting moderation”\nFor as long as I see that message I cannot, indeed will not,  engage in debate. The choice is yours, Dan, Free speech, or no speech. I think I know what your answer will be, especially with the Magic Circle assembling once more in Valencia…\n\n","date":"April 27, 2012 at 6:00 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10895","author":"colinsberry","site":"shroudstory"},{"title":"When History Trumps Science","post":"if the shroud is man made then just make it again. i dont think there were scientists around in the 1300s so just cough up a shroud it should  not take over a month to do.\n\n","date":"April 27, 2012 at 7:28 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10897","author":"paul","site":"shroudstory"},{"title":"When History Trumps Science","post":"The fact is this :  Even if an artist or a forger could reproduce artificially the Shroud body images, no one can artificially reproduced the bloodstains.  Conclusion :  The Shroud is NOT any kind of artwork.  Period.  Argue otherwise is as dumb as thinking the Universe was created about 6000 years ago, like the Creationists do in USA or to believe the earth is flat !!!\nThat was the main point of my recent open letter about the evidence of the bloodstains but it seem obvious that certain people will never get it.  Sad but true !!!\n\n","date":"April 28, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10921","author":"Yannick Clément","site":"shroudstory"},{"title":"When History Trumps Science","post":"my point is it is not man made since no man today can not or has not produced the shroud and the argument that a 13th century man has done what a modern man can not do is ludicrous on its face. is there any other ancient man made object that can not be made today? if so i would like to know what it is.\n\n","date":"April 28, 2012 at 6:55 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10926","author":"paul","site":"shroudstory"},{"title":"When History Trumps Science","post":"I understand what you mean Paul but I have to disagree a bit with your argument.  I think my argument versus the bloodstains offering a proof that this cloth was a real burial shroud of a crucified man is much more solid to discard the idea that the Shroud could be some artwork of any kind.  Why I say that ?  Simply because science cannot completely discard the possibility that the Shroud was really created by a forger using a “natural” and chemical formula to produce it, instead of using some kind of artistic technique.  Like I said in my recent open letter : The Shroud can be a real burial shroud of someone who suffered the same tortures than Jesus, but who cannot be Jesus of Nazareth because a forger produces it “naturally” (without using any art technique).  \nScience can completely reject any artistic technique hypothesis, but not completely reject the hypothesis that it was created by a forger using a natural-chemical technique (with some chemical recipe that was kept secret by him and that we don’t know today).  I know that sound odd, but on a strict scientific base, we cannot completely reject this possibility.  And if this is really what happen (the “if” is very important here), than it can be “normal” that nobody has even been able to reproduce it, even today.  In fact, I don’t think every possible chemical formulas involving a corpse and a burial shroud (made with the ancient method) has been fully tested yet !!!\nSo far, science is able to reject any artistic technique for the Shroud, but is not able to completely reject the very unlikely possibility that I just describe.  So, a very slim door is still open for the idea of a genious forger (who would have not be an artist but more of a chemist).\nPersonally, I don’t believe this hypothesis, but to be fair and honest, I don’t think we have the right to totally reject it.\n\n","date":"April 28, 2012 at 8:31 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10928","author":"Yannick Clément","site":"shroudstory"},{"title":"When History Trumps Science","post":"then i can have a some of gold that was made from lead by an ancient alchemist but you can not discredit this statement because some process was used that can’t be reproduced today but is a secret still waiting to be discovered but somehow was used in ancient times.\n\n","date":"April 29, 2012 at 12:44 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10936","author":"paul","site":"shroudstory"},{"title":"When History Trumps Science","post":"\npaul :my point is it is not man made since no man today can not or has not produced the shroud and the argument that a 13th century man has done what a modern man can not do is ludicrous on its face. is there any other ancient man made object that can not be made today? if so i would like to know what it is.\nNot going against your general comment, but to your question of ancient objects created that cannot be reproduced today; Ancient Greek armour, helmets to be exact to this day cannot be reproduced in a metallurgical sense, just as an example. \nR\n\n","date":"April 29, 2012 at 1:11 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10938","author":"Ron","site":"shroudstory"},{"title":"When History Trumps Science","post":"i believe if you had a sample of that armour and did a metal analysis of it the metal it could be reproroduced to an exact chemistry and then made to an exact replica as far as size shape and weight. what we might not know is how they made it at the contemperary time. i do know that any metal can be analyzed to get its exact components\n\n","date":"April 29, 2012 at 11:07 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10957","author":"paul","site":"shroudstory"},{"title":"When History Trumps Science","post":"Nope, it has been tried but they cannot replicate it when it comes to uniformity of the metal (shape) plus combination of thinness and strength of the metal, that is exactly what dumbfounds the experts. Anyways, there are many things done in the past not understood today. The pyramids, the 1000 ton block of the temple mount etc; As for the Shroud; until all ‘possible’ means known to science are attempted to create this image, no decisive conclusion can come of it, (scientifically).\nR\n\n","date":"April 29, 2012 at 2:47 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10958","author":"Ron","site":"shroudstory"},{"title":"When History Trumps Science","post":"i would love to read about the metallury on this metal showing that this can not be done today; as far as the pyramids get a good crane and jackhammer and a pyramid will go up. please note i am saying modern man can not reproduce the shroud by any means modern with lasers etc. or ancient methods\n\n","date":"April 29, 2012 at 5:50 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10962","author":"paul","site":"shroudstory"},{"title":"When History Trumps Science","post":"Paul I know what your saying but your wrong in the sense that “not all methods possible have been attempted yet” and probably methods that have not been thought up yet either, but with that said, I agree as it stands today; It is a point towards the Shroud’s authenticity, especially with the blood evidence in mind.\nR\n\n","date":"April 29, 2012 at 6:23 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10963","author":"Ron","site":"shroudstory"},{"title":"When History Trumps Science","post":"all possible methods can never be tested so theoretically the answer will never be proven scentifically but we do send people to death row on dna evidence which is maybe one  hundred billion odds of being wrong nothing is 100% absolute for it to be a fact .we must live in the real world\n\n","date":"April 29, 2012 at 8:01 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10974","author":"paul","site":"shroudstory"},{"title":"When History Trumps Science","post":"Unfortunately, we have no DNA evidence with the Shroud ;-)\n\n","date":"April 30, 2012 at 9:23 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10994","author":"Ron","site":"shroudstory"},{"title":"When History Trumps Science","post":"Most plausible explanation for construction of pyramids is building of earth (sand) ramps and hauling the stones on sleds sliding on timber rails lubricated by milk or fat.  Notwithstanding Exodus stories, Egyptians made little use of slave labour, but used agricultural workers during the off-season (Nile Inundation) who were generally well-looked after with beer and bread.  Egyptians had a good grasp of empirical mathematics as shown on “Rhind” and “Moscow” papyri, several model problems copied by Ahmes ~1650 BC from an earlier work.  Greeks were impressed by their schools and adopted their methods.  They pioneered land and engineering surveying, could set out accurate right angles (groma) and had levelling instruments.  They had not deduced Pythagorean triples, although Babylonians knew of at least 15 triples 1000 years before Pythagoras.  Egyptian numerary system was adequate based on repetition of denary symbols, but not nearly as sophisticated as Babylonians’ was.  Egyptian fractional system was abominable and was based on “Horus eye” – repeated bisections. Competent in basic arithmetic, areas and volumes.\n\n","date":"April 29, 2012 at 6:24 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10964","author":"daveb of wellington nz","site":"shroudstory"},{"title":"When History Trumps Science","post":"Thats all true Dave but consider some facts here; All scholars are in agreement; it took 15 to 20 years to complete the great pyramid. It took 2.3 million blocks (est). That would mean 12 blocks per hour were ‘placed’ every hour, 24 hours a day 7 days a week  for the duration, for it to be accomplished. Thats also 300 2.5 ton blocks, or so, a day being quarried and cut to precise dimensions. A feat which experts today say even with all our technology we can not accomplish….that is what I meant.\nR\n\n","date":"April 30, 2012 at 9:34 am","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10995","author":"Ron","site":"shroudstory"},{"title":"When History Trumps Science","post":"My point is this :  If the Shroud body images were created (on purpose by a forger or not at all) naturally while some chemical phenomenon(s) were going on at the surface of the cloth from the interraction between the corpse in the Shroud and a thin layer of sugar impurities, I think it’s pretty normal that science has not been able to reproduce exactly those body images.  It’s not an easy task to find the proper “chemical recipe” to accomplish this and also, to find all the environmental conditions that prevailed at the moment those images were created.  \nThe fact that science is not able to recreate something today doesn’t necessarily mean this object came from an act of God !  This would be a great error to think that way.  NATURE CAN BE VERY SURPRISING SOMETIMES…  That’s why we must left a (very) little opening to the possibility that the Shroud was created by a forger while using a crucified body and a Shroud prepared the old fashion way and who knew that, in some particular conditions, a body image would be formed at the surface of the cloth naturally, because of some chemical phenomenon(s).  I know this scenario is highly unlikely, but scientifically speaking, it is “possible” anyway.  I don’t think this door will ever be completely closed.\n\n","date":"April 29, 2012 at 7:43 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10973","author":"Yannick Clément","site":"shroudstory"},{"title":"When History Trumps Science","post":"i would say the opening might not be large enough to let a photon of light pass through\n\n","date":"April 29, 2012 at 8:05 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10975","author":"paul","site":"shroudstory"},{"title":"When History Trumps Science","post":"Maybe Paul but…  you have to let this opening open anyway when it’s time to analyse all the possibilities.  As I said in my open letter, this is the ONLY POSSIBLE WAY that a forger could have created the Shroud (forget any kind of artwork) and that possibility is, as you say, very thin.  Conclusion : the forgery hypothesis regarding the Shroud don’t seem to be able to explain the presence of this cloth properly.\n\n","date":"April 29, 2012 at 8:25 pm","url":"https://shroudstory.com/2012/04/27/when-history-trumps-science/","cat":"carbon_14_dating","id":"comment-10977","author":"Yannick Clément","site":"shroudstory"}]
