[{"title":"“For Sure Someone is Lying Here” — Talk About Chumming the Comment Pool","post":"I have known for years about this alleged unauthorized C-14 test that was done circa 1982.  My understanding is that one end dated 200 and the other 1000.  Two ends of the same thread yielded radically different dates.  Now the alleged participants are in denial that said test ever occurred.  Since this test supposedly occurred six years before it was formally dated, and if it was a made up story…why concoct a story supposing such disparate dates from a single thread?  Why not just claim it dated to first century?  That doesn’t pass the smell test.  Such aberrant dates from the same sample area that has garnered so much controversy post 1988 seems to be consistent what Rogers determined and published in 2005.  Seems to me the test indeed happened but politics has trumped truth-telling.\n\n","date":"January 1, 2014 at 9:13 am","url":"https://shroudstory.com/2014/01/01/for-sure-someone-is-lying-here-talk-about-chumming-the-comment-pool/","cat":"carbon_14_dating","id":"comment-70829","author":"Russ Breault","site":"shroudstory"},{"title":"“For Sure Someone is Lying Here” — Talk About Chumming the Comment Pool","post":"Not Benford and Marino *again*? Are shroudies so desperate for anything to support their fantasy that those nuts have to be wheeled out as “experts” time after time?\nActually, yes the shroudies *are* that desperate.\n\n","date":"January 1, 2014 at 1:01 pm","url":"https://shroudstory.com/2014/01/01/for-sure-someone-is-lying-here-talk-about-chumming-the-comment-pool/","cat":"carbon_14_dating","id":"comment-70859","author":"Passing Stranger","site":"shroudstory"},{"title":"“For Sure Someone is Lying Here” — Talk About Chumming the Comment Pool","post":"Around here, in this blog, we tend to argue with substance rather than with mere insults. You are welcome to join us in constructive conversations. We lose our cool now and then but usually after some back and forth with facts, observations and logical arguments.\n\n","date":"January 1, 2014 at 1:30 pm","url":"https://shroudstory.com/2014/01/01/for-sure-someone-is-lying-here-talk-about-chumming-the-comment-pool/","cat":"carbon_14_dating","id":"comment-70863","author":"Dan","site":"shroudstory"},{"title":"“For Sure Someone is Lying Here” — Talk About Chumming the Comment Pool","post":"The fact is that scientific research by Ray Rogers,  John Brown and Robert Villarreal fully substantiated the claims of Benford and Marino. If you are going to attack them personally, have the guts to use your name. There are critics on this page who actually sign their name. Even when I think they are dead wrong, they at least have the integrity to use their name.\nI think anonymous hatchet jobs should be confined to the nearest trash can.\nJohn Brown of Georgia Tech was one of the scientists whom Ray Rogers asked for an opinion on the Shroud threads. Here’s an extract from his obituary:\n“From there, he began a 45-year career with the Georgia Tech Research Institute, retiring in 1995 as head of the materials characterization laboratory.During the early ’50s, he operated the only electron microscope in the state, said Wayne Cooper, who worked with Mr.Brown as a Georgia Tech student in the early 1970s.\n“An electron microscope uses electrons vs. photons to do imaging, allowing for much higher magnification of components such as human cells and bacteria than that of an optical microscope.“He was the only person I knew who had an electron microscope in his home,” Mr. Cooper said.” Atlanta Journal-Constitution, 9/26/2009\nWhat will they say about you in your obituary anonymous jerk. If you want to have a debate reveal yourself. How do you stack up against scientists such as John Brown, Robert Villarreal or Ray Rogers. Tell us.  Maybe then you might earn some respect.\nJohn C. Klotz\nklotzlaw@gmail.com\n\n","date":"January 1, 2014 at 10:29 pm","url":"https://shroudstory.com/2014/01/01/for-sure-someone-is-lying-here-talk-about-chumming-the-comment-pool/","cat":"carbon_14_dating","id":"comment-70940","author":"John Klotz","site":"shroudstory"}]
