[{"title":"Conspiracy Theory Part 4","post":"“As can be seen, Oxford’s 780-720 (years before 1950) age range (1170-1230) doesn’t overlap either Arizona’s (1273-1335) or Zurich’s (1250-1298). And Arizona and Zurich only overlap by 25 years (Arizona’s 1273 minimum and Zurich’s 1298 maximum). This is inexplicable given that the laboratories’ Shroud samples were all from the same postage stamp size[33] sliver of linen, and all were dated by the same AMS method. But it is consistent with my theory that the Shroud sample’s ages, unlike those of the non-Shroud samples, were not real ages but were randomly generated by a hacker’s computer program within limits to ensure that the Shroud’s radiocarbon dates, when calibrated, would cluster around 1325 ± 65 years. It is also evidence that all three laboratories’ AMS control console computers were hacked, not only Arizona’s.”\nAll this conspiracy theory is insane, but this is really twisted, why a hacker would have bothered to generate a set of data undermining the validity of the dating ?\n\n","date":"June 8, 2014 at 3:53 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127804","author":"anoxie","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"Dan’s posting of attached pic of a semi-comatose audience says it all.  I don’t think they’re praying, except maybe for it all to go away!\n\n","date":"June 8, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127809","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"Still no real evidence. And again, a misunderstanding of statistics. Stephen quotes very selectively from an article by Jacques Evin, saying that it would not be possible to date the Shroud “closer than a span of 200 years.” What a pity he did not quote a bit more: “as to the outside limits of the span there can be absolutely no mistake.” And more specifically: “But remember, this interval signifies above all that the exact date of the Shroud could not fall outside the two precsie dates which limit the interval.” In other words, he is referring to a certainly of well over the 95% confidence level reported in the Nature paper. In terms of the standard deviation from the mean, he could be referring to three (99.73% confidence) or even four (99.99%), which in no way contradicts the conclusion of the Nature paper.\nStephen goes on to say that the discrepancy between Oxford’s and Arizona’s average dates is inexplicable by normal AMS procedure, but is consistent with his theory that the dates were randomly generated (to cluster around 1325) in all three laboratories. Well no. If the dates were all randomly generated then they would cluster more evenly around the average than they do. It was precisely the non-random distribution of the dates that alerted Remi van Haelst and later Riani & Atkinson to attempt an explanation.\nStephen is fascinated by the astonishing accuracy of the Arizona date about 1350, and claims that because the scientists were all nuclear physicists they probably didn’t realise how difficult it is to harvest flax and make it into a sheet in only five years. Eh? Is it? And didn’t they?\nAs it happens he’s wrong about that too as the Arizona BP dates convert to about 1340AD not 1350.  But anyway, what happened to the Oxford super-spy? Did they all have to write their own programs, and did he get his wrong, because the Oxford dates cluster around 1250, which is surely way too early.\nThere’s more, but that’s enough for now…\n\n","date":"June 8, 2014 at 6:44 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127836","author":"Hugh Farey","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"“And again, a misunderstanding of statistics.” – Strange for a mathematics teacher …\n\n","date":"June 8, 2014 at 11:37 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127886","author":"PHPL","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"” In other words, he is referring to a certainly of well over the 95% confidence level reported in the Nature paper. In terms of the standard deviation from the mean, he could be referring to three (99.73% confidence) or even four (99.99%), which in no way contradicts the conclusion of the Nature paper.”\nAnd again, a misunderstanding of statistics…\n\n","date":"June 9, 2014 at 1:44 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127903","author":"anoxie","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"One must wait to see if the conspiracy theory can generate anything other than contagion, even paranoia. There are signs that this is happening and it will not further Shroud studies.\n\n","date":"June 8, 2014 at 7:56 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127848","author":"Louis","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"That looks like Stephen in the front with his glasses off\n\n","date":"June 8, 2014 at 11:30 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127884","author":"Thomas","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"As a guy who is pretty busy (work 50 hour plus weeks and have 2 children) I have limited time to research the Shroud…\nSo let me put out a question which has been playing on my mind, FOR HUGH:\nHugh, some argue that the scourge marks are highly suggestive of the man on the shroud having been flogged by 2 accomplices, based on the patterns.\n2 questions:\n1. Do you agree with this?\n2. And if “yes”, does this not make the “forgery” theory difficult?\nI have previously contemplated the possibility that a forger pressed on the marks with some sort of bloodied instrument, however this is difficult to accept if the marks are indeed highly suggestive of flogging from two persons\n\n","date":"June 8, 2014 at 11:36 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127885","author":"Thomas","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"Thomas, one more thing to think about. Some of the scourge marks (type 3 in Faccini’s paper) have no blood, only serum. Why would a forger paint(dab as Hugh would like to believe) in serum. Knowing that no one can see them in the Middle Ages. They were only visible in 1978 when STURP took UV Fluorescence photographs, how can that make sense?\n\n","date":"June 9, 2014 at 8:25 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127958","author":"Mike M","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"1) Yes.\n2) No. If a forger wanted to dab scourge wounds using a bloodied sponge onto his creation, he would have adhered to the tradition of the day, which was that Jesus had been flogged by two people. He could have knelt on one side of the cloth and dabbed on various marks in a radiating pattern with his outstretched arm, and then gone round to the other side to do the same, kneeling in a different place.\n(Oh, and please, all ye who like to jump up and down shrieking FACT FACT FACT, I have no evidence that this was actually done at all. It is merely a way in which it could have been done, making fairly clearly distinguishable marks, quite unlike the bloodied mess of lacerated skin that probably resulted from a real flogging)\n\n","date":"June 9, 2014 at 5:16 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127928","author":"Hugh Farey","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"Contradiction:  ” he would have adhered to the tradition of the day …”  No medieval artistic representation shows the systematic pattern of the scourge wounds of the Shroud.  Their grisly imaginations were the determining factor, not adherence to any rational realism.  Hugh should really read what Barbet has to say on the matter.  And yes, Charles, Faccini et al have claimed to have detected other signs of whipping, probably of the type caused by lictors’ fasces to encourage the condemned to complete the journey to the final place of execution, but the paper is not necessarily peer-reviewed!\n\n","date":"June 9, 2014 at 7:29 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127945","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"The paper you mentioned.\nhttp://www.ohioshroudconference.com/papers/p19.pdf\nI thought Hugh was sceptic of everything, he surprises me when he makes a leap of faith like this.\n\n","date":"June 9, 2014 at 7:44 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127948","author":"Mike M","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"Well I think that seems pretty far fetched\n\n","date":"June 9, 2014 at 4:11 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128025","author":"Thomas","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"above comment directed to Hugh’s comment of 5.16am.\nThere comes a point, in my opinion, where the whole idea of an ultra realistic forger going for maximum realism just seems a little bit fanciful\n\n","date":"June 9, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128035","author":"Thomas","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"I think that there was a paper by someone called Faccini that was delivered at one of the conferences that suggested three different kinds of scourge marks.No doubt someone can provide the link.\nBTW I was at a medieval conference on Saturday and the afternoon papers were billed as half an hour long, as in the St.Louis Conference. The very first paper was 45 minutes and this threw things out!  There will have to be some very strict cutting off of speakers at St.Louis especially if there is to be time for questions. Yet, some of the Abstracts seems almost half an hour long in themselves!\n\n","date":"June 9, 2014 at 6:34 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127937","author":"Charles Freeman","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"“Leap of faith”? I think not. Wild speculation, more like, as I thought I had made appropriately clear. As for tradition, although the exact pattern of the wounds is individual to each painter, the idea that there were two scourgers, and that the instruments produced distinct wounds rather than general excoriation seemed established by the 14th century. And I am quite familiar with Barbara Faccini’s paper which postulates that each scourger used at least four different types of implement. I am not convinced that the marks on the shroud justify the precision of her conclusions, but they are certainly well researched. Whether they argue for or against a manufactured pattern rather than an actual scourging pattern is not obvious.\n\n","date":"June 9, 2014 at 8:21 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127957","author":"Hugh Farey","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"“I am not convinced that the marks on the shroud justify the precision of her conclusions”\nHugh, rather than reverting to square one like you, when experts have repeatedly declared otherwise. I’d rather follow the expert advise of Dr.Robert Bucklin (50 years as a Forensic Pathologist, personally examined over 25,000 bodies), Dr. Fredrick Zugibe (Studied crucifixion for over 50 years, and has been Rockland County’s  Chief Medical Examiner for over 33 years), and Dr.  Pierre Barbet (Chief Surgeon of St. Joseph hospital in Paris) as he Wrote in  “Dr. In Calvary”\n“to describe these imprints as the work of a forger is an attitude which is absurd”\n\n","date":"June 9, 2014 at 8:44 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128061","author":"Mike M","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"“Some of the scourge marks (type 3 in Faccini’s paper) have no blood, only serum.”\nI have Miller and Pellicori’s UV photograph of the back of the man in front of me, overlaying Mario Latendresse’s shroudscope. Some of the dark ‘blood’ marks appear to have intermittent fluorescent borders, although they are not very bright compared to the background fluorescence of the whole cloth. There are no fluorescent, ‘serum’ marks that are not associated with dark, ‘blood’ marks. I have read, with Mike, that such things exist. Would anyone like to show me where?\n\n","date":"June 9, 2014 at 9:23 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-127967","author":"Hugh Farey","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"Please see page 8 of this paper;\nhttps://www.shroud.com/pdfs/thibault%20final%2001.pdf\n\n","date":"June 9, 2014 at 8:09 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128055","author":"Mike M","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"Well that’s very interesting, but not for the reason you think. I wonder why Thibault chose to invert the UV picture. You see the serum, which is supposedly invisible by ordinary light, is supposedly fluorescent, so becomes visible by UV light. Making the UV picture negative means that the serum becomes darker, not lighter, so that by all the criteria used to judge the serum I have yet read, Thibaut’s scratchmarks are definitely not serum stains. To be fair to Thibault, he does not claim (unlike yourself, above) that they are. All the white scratchmarks on his negative are clearly visible as non-fluorescent (and therefore non-serum) dark marks on the positive of the UV photo. The marks are less visible in ordinary light because blood inhibits fluorescence, increasing the contrast in a UV photo, but all Thibault’s marks are present on Durante’s photo. They are not easy to identify in Thibault’s paper because of the different scales of the two images, but they’re there if you look.\nAnd Mike, try reading the ‘experts’ such as Bucklin, Barbet and Zugibe carefully. They were surgeons, treating the Shroud as a photograph of a dead body. They had no experience of forgery, and were not in a position to decide whether a forger could recreate the wounds or not. Well aware of this, neither Bucklin nor Zugibe commented on whether such a reproduction was possible or not. Barbet thought it impossible, and said so, but Zugibe, in particular, was almost contemptuous of Barbet’s incompetence in a way that even some of his adherents think was extreme.\nI’m not sure what you mean by “back to square one,” but blandly putting one’s faith in ‘experts,’ however comforting, is no guarantee of the truth.\n\n","date":"June 10, 2014 at 4:41 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128165","author":"Hugh Farey","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"You are right, it is less fluorescent than the background. The point is still valid though, they are only seen in UV fluorescence. Why would a medieval forger do something like that? Hugh, Forensic pathologists have a trained eye, and we should respect their opinion. This is their speciality, if you have no value for that, that’s fine. For me I like to respect expert opinion when it’s beyond my scope of practice.\n\n","date":"June 10, 2014 at 6:17 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128180","author":"Mike M","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"No, they are not only seen in X-Ray fluorescence, as I explained. It looks very much as if a medieval forger simply drew a few lines here and there, possibly in blood, much of which, like all the other blood, has largely been rubbed off with time and abrasion. Perhaps whatever medium he mixed the blood with as an anticoagulant was also UV absorbing, which explains the increased visibility of the scratches under UV.\nI too have great respect for forensic pathologists, with their trained eyes and immense experience. So I am a little confused that according to Zugibe, Barbet had no knowledge of the position of the two major nerves of the hand, nor understood where the space of Destot was. (Matteo Bevilacqua, of the University Hospital of Padua, disagrees with them both.)\nWell I like to respect expert opinion as much as the next man, but when Expert One says black, Expert Two says white and Expert Three says purple, which one is telling the truth? (Stephen E. Jones, of course, thinks that Zugibe was “deliberately and dishonestly” blackening Barbet’s name, and was “effectively” an out-an-out liar.)\nSo with the utmost respect to you and all these eminent men, which one do you think is right, and which is a nincompoop? Zugibe or Barbet? They cannot both be correct.\nRespect… yeah… right….\n\n","date":"June 10, 2014 at 6:47 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128185","author":"Hugh Farey","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"Anticoagulant that is also UV absorbing, where did you get that from? Do you have any chemical test to back it up. I find when it’s anti-authenticity science makes less sense for you and you immediately jump to square 10.\nBarbet, Zugibe and Buckiln may have differed on some details as do all experts in any field. But they all agreed that this was a crucified man.\n\n","date":"June 10, 2014 at 7:04 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128188","author":"Mike M","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"No chemical test at all,no evidence either, just a possible explanation for the reason those scratchmarks appear more prominent on the UV than on the visible light photos. I am very open to other expanations, but the serum thing clearly isn’t one of them. As for the experts, I don’t need an expert to tell me the Shroud is picture of a crucified man, I can see that for myself. An ‘expert’ can use his training, experience and expertise to say tell me things I can’t see for myself; like the fact that nail went through the space of Destot, or the fact that it didn’t, or the fact that the nail would have damaged the median nerve, or the fact that it couldn’t have done, or the fact that damaging the median nerve drags the thumbs inwards, or the fact that it doesn’t. This is the information I seek from experts, and the fact is they don’t agree.\n“Details,” such as where to find one of the major nerves of the body.\nAny anatomists reading this?\n\n","date":"June 10, 2014 at 7:30 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128190","author":"Hugh Farey","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"The details you can’t see Hugh can easily be googled now, all the anatomy diagrams are online. What you need from the experts trained eye is if the image and injuries look realistic to their eyes or not, Bucklin have seen 25000 dead bodies, when he says this is a dead man, that has a value. he can tell if a picture is for a dead body or a painting. Art work can easily be pointed out due to the style of the artist. The shroud looks like a crime scene picture, very realistic and matches forensics even when it contradicts the contemporary understanding (e.g. Nail in the wrist or through the Thenar furrow rather than in the middle of the palm, a cap of thorns rather than a circlet, the scourge marks don’t even come close to anything depicted n art even today, Rigor Mortis, blood flow patterns in two different planes).\n\n","date":"June 10, 2014 at 7:41 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128193","author":"Mike M","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"You’re still not reading me correctly, and are drifting into the subjective.\nIf the details I thought we needed experts to point out are easily available, then please let us know which of the two eminent pathologists, Barbet or Zugibe was wrong. Does a nail through the wrist damage the median nerve or not? \nI don’t know if Bucklin thought the image could be replicated by an artist or not. The words ‘art,’ ‘paint,’ ‘forge’ and all their derivatives do not occur at all in his ‘An Autopsy on the Man of the Shroud.’  Did he ever deny that the shroud could be a forgery? Did Zugibe?\nIf I can take you back to your first comments (back to Square 1, that’s me):\na) “Some of the scourge marks (type 3 in Faccini’s paper) have no blood, only serum.” Your evidence for this was Thibault’s paper, which quite clearly shows the opposite.\nb) “I’d rather follow the expert advice of [Drs Bucklin, Zugibe and Barbet]” But Dr Zugibe and Dr Barbet offer entirely contradictory observations. You cannot follow the expert advice of them both.\nc) From Barbet: “to describe these imprints as the work of a forger is an attitude which is absurd.” This comment was not repeated by either Bucklin nor Zugibe.\nd) “I like to respect expert opinion when it’s beyond my scope of practice.” and “Barbet, Zugibe and Buckiln may have differed on some details as do all experts in any field. But they all agreed that this was a crucified man.” The thing they agree on is not at all beyond the scope of anyone’s practice. What is beyond our scope of practice is something they did not all agree to.\ne) “Art work can easily be pointed out due to the style of the artist.” This may or may not be true, but neither Bucklin nor Zugibe did, in fact, point it out.\nf) “The shroud looks like a crime scene picture.” It does, doesn’t it, and the only time I have seen similar realistic ‘crime scene pictures’ have been in modern reconstructions of the passion on film. I am fortunate that the nearest I can get to ‘the real thing’ are the scourging and crucifixions regularly carried out every Easter in Mexico and the Philippines, which bear no resemblance to the Shroud at all, in that the scourging seems to produce far more blood than we find on the shroud, and the crucifixion much less.\nThe other details you mention are again, oft quoted but little justified. The ring of bloodstains around the back of the head does not justify a cap of thorns. There is little or no blood between them and the rivulets at the front of the head, perhaps because the Shroud was not in contact with the body there (there is a distinct image gap) or perhaps because the top of the head was not, in fact bleeding at all. Anyway the ringlet of bloodstains looks more as if it was applied on the outer surface of the hair rather than having to seep through from inside. The bloodflow down the arms looks as if it is realistic but probably isn’t, in terms both of the quantity of blood available and the angle of flow as has been interestingly demonstrated by Borrini and Garlaschelli quite recently.\nThere is evidence. There is lots of evidence in favour of a real crucified man leaving his blood and an image on a cloth. But none of it is indisputable, none of it is conclusive and much of it is directly contradictory. That’s fine by me; it is what makes the shroud such a fascinating object. I am much taken by the first of Russ Breault’s theological speculations: “Maybe the Mystery IS the Message.  There may be a reason why the world’s most analyzed artifact remains a mystery.”\n\n","date":"June 10, 2014 at 9:39 am","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128210","author":"Hugh Farey","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"Wow, I come from work to find a book I have to reply to, sorry i didn’t realize I rubbed you the wrong way, back to your response:\n1- Nail in wrist or Palm (lower palm/Thenar Furrow) I guess Hugh you must be a very healthy man. If not you would’ve surely been through different physicians and specialist to find out a solution for your ailment. any you would’ve discovered that they differ a lot. Even with physical examination, lab tests and X-rays. Symptoms overlap for different pathologies and I have seen people get 3-4 different diagnosis from very smart people for a single problem. Barbet and Zugibe don’t have the Luxury of X-rays and lab tests., not even physical examination. They work from a photograph, so to claim that if two specialist, working from a photograph, differ on a conclusion prove them unworthy is not fair to either of them. Buckiln said about the injuries depicted on the shroud are ” beyond dispute”, Zugibe said he ” has no doubt at all” and Barbet said its “absurd”. Hugh disagrees, nothing personal but I am going with the experts.\n2-back to square 1 where you really like to stay for nothing pro-authenticity but enjoys jumping off for any thing anti. The scourge marks, even though they don’t fluoresce, are still very subtle and not visible in normal light. I was wrong to think they were serum, but hey, the argument still stands. Who would paint something invisible except in UV fluorescence photography? Finding the reverse of an assumption doesn’t affect the argument sometimes. just like when you thought bleached linen lightens with sunlight and it turned out to be the opposite, you admitted you were wrong but then stayed with the same conclusion didn’t you? The same applies here.\n3- even when they differ on the details, they agree that this is a real human being that was scourged, crucified and dead. How many dead people have you seen? They have seen much more and they are experts in this field, you are not.\n4-what they agreed on is beyond our scope of practice. When someone dies they call the coroner they don’t call Hugh, nothing personal.\n5-crucifixions in Mexico.. Hugh, you know better than this. These people are crucified north of 20 times in their life, and counting. This doesn’t compare to what happened to Jesus. This is where I find you jump from square 1 to 10 one way ticket.\n6-scourging produce much more blood, when was the scourging done? How many times were the wounds bandaged (with clothes) and reopened how do we assume that we know how much blood would be there?\n7-“bloodflow down the arms looks as if it is realistic but probably isn’t” we have talked about Garlaschelli’s paper in detail before, I am not going to repeat it here. It looks realistic because its realistic.\n8-Offcourse the Mystery IS the message, if it was fake there would be conclusive evidence to prove that long before. After all these studies, till now nothing even comes close.\n\n","date":"June 10, 2014 at 6:07 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128292","author":"Mike M","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"Sorry I was replying with one hand while eating. lots of typos e.g.point1- “any” should be “and” you would’ve discovered\nPoint2- nothing=anything\n\n","date":"June 10, 2014 at 6:20 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128298","author":"Mike M","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"I think we’ll just have to differ for a while. Nothing you say has contradicted anything I said, and I dare say you think the opposite, so we might as well wait for more evidence.\n\n","date":"June 10, 2014 at 6:45 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128305","author":"Hugh Farey","site":"shroudstory"},{"title":"Conspiracy Theory Part 4","post":"Agreed. BTW, I don’t comment on this site to convince you or get you to change your mind, because I know you won’t. I think it’s important that people reading these threads get both sides of the story. I do admit , though, that I learn a lot in the process and I thank you and everyone else for that. I think skepticism is very healthy for the believer because it sharpens the faith.\n\n","date":"June 10, 2014 at 6:59 pm","url":"https://shroudstory.com/2014/06/08/conspiracy-theory-part-4/","cat":"carbon_14_dating","id":"comment-128308","author":"Mike M","site":"shroudstory"}]
