[{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"Suppose we had never had a radiocarbon date, then we are left with four other dates, one Rogers, three Fanti, but so far as I can see they are all over the place. It may be that only one of them is right and perhaps none of them are. If they are subject to the same level of scrutiny as the radiocarbon dates have been, then surely none is as yet acceptable.\nI also cannot see how Fanti’s findings can be refuted without him handing over his sample for alternative testing. He seems to be onto a winner here if he hangs on to them!\n\n","date":"March 3, 2014 at 7:35 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84420","author":"Charles Freeman","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"Charles, Professor Fanti told the press that he will not hand over his sample and Dr. Rogers also worked on something that was not given to him officially (like fibres or a tiny piece of the cloth in an envelope with the Shroud custodian’s seal). A lot of people may not agree with his findings, however the good thing is that his integrity cannot be questioned, that being one of the reasons why he received funds from the University of Padua. Now, what about that piece of sample retained in Arizona? It could be used for further tests, and that would please scientists who question the findings of both Rogers and Fanti.\n\n","date":"March 3, 2014 at 9:21 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84448","author":"Louis","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"What spectacular nonsense! (Oh, dear, I hope I’m not turning into Colin!)\nRogers did not come up with any method of dating anything. He observed that his samples from the C-14 sample contained vanillin (wholly unquantified) while samples from the rest of the shroud did not. Vanillin decays with time. He therefore claimed, quite correctly if his results were accurate, that the C-14 sample was younger than the rest of the shroud. That was all he wanted to discover, and it was all he claimed. It was not a dating method.\nFanti has come up with genuine dating methods, but they are not sufficiently controlled or calibrated to be at all satisfactory in most cases. After gathering about 20 samples for testing, 30% were discarded as unsuitable anyway, although he does not say why.\nFirstly, he finds that if a piece of linen is left alone over time, it seems to lose structural integrity (measurable by mechanical means) in a rather roughly predictable way, resulting in a possible assessment of the age of a piece of undisturbed cloth. As the shroud has been continuously manipulated since its manufacture, whether for 1000 or 2000 years, and as Fanti’s test samples were, by selection by vacuuming, from the most degraded fibres, his graph is wholly inappropriate for dating the shroud.\nFanti has also attempted two spectroscopic methods, in which I am insufficiently versed to be able to declare an opinion. I can say that, when he found that the shroud did not conform to his prejudice about its age using FT-IR, he was compelled to adjust its age to account for the effects of the 1532 fire, a case of special pleading if ever I saw one.\nFanti is quoted as saying that four different independent methods reached the same result. This is wholly untrue. Rogers, as I said above, reached no result at all. Fanti’s mechanical result was 400 AD, his FTIR result was 750 BC (before adjustment), and his Raman result 200 BC. So there were three, not four, independent methods, and they did not “reach the same result.”\nI repeat, what spectacular nonsense!\n\n","date":"March 3, 2014 at 9:58 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84463","author":"Hugh Farey","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"Spot on! And if you sound a bit like Colin here, it’s the subject matter that demands it. Fanti’s over-reaching is dangerous to credible Shroud science. He needs to focus one dating method, refine it, and establish it as a legitimate method that others can duplicate before he applies it to the Shroud. He’s working ass backward way too often to be considered credible.\n\n","date":"March 3, 2014 at 12:59 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84508","author":"David Goulet","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"Seriously, what else can we expect from someone like Fanti?\n\n","date":"March 3, 2014 at 2:39 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84532","author":"Yannick Clément","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"An ill-considered and unnecessary ad hominem comment which addresses no material issue! Please desist!\n\n","date":"March 3, 2014 at 3:35 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84546","author":"daveb of wellington nz","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"I would use the 4 letter words here but I can’t…  If you don’t like what I say, please pass-it by and leave me alone.\n\n","date":"March 3, 2014 at 4:31 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84560","author":"Yannick Clément","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"I’m sick and tired of people telling me what to say…  I’m free enough and old enough to say what I WANT TO SAY. [Deleted by Dan Porter]\n\n","date":"March 3, 2014 at 4:32 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84561","author":"Yannick Clément","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"I must now moderate your all your comments.\n\n","date":"March 4, 2014 at 6:16 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84772","author":"Dan","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"Last comment to Daveb (and anyone else) for today:  Did you ever saw me say something like “Don’t say this” or “You have no right to say that”?  No.  We live in a free world and people can say what they want (at least, I thought this was the case).  And then, people have the right to agree or disagree with what have been said.  But they have no right to play the “censorship” game by telling other what they can or what they can’t say.  Hope people will get me right.  \nThere’s a huge difference between censorship and criticism.  The first is faschist and anti-freedom in essence, the second is one of the most beautiful right we have as a free man.  So, I don’t care if you criticize me (you did that so well all the time anyway), but to use censorship against me, no way!\n\n","date":"March 3, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84566","author":"Yannick Clément","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"And if I want to say out loud that I hate how Fanti (the Italian engineer) is doing Shroud science, I WILL!\n\n","date":"March 3, 2014 at 4:47 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84568","author":"Yannick Clément","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"Yannick, nobody is trying to censor anybody here. But,  honestly I think you only doing yourself harm talking like this. Since this is a blog on the line intersecting since and faith. From a scientific point of view you resort to personal attacks a lot… Things that has nothing to do with science ( e.g you attack Fanti for being an engineer…Italian… Catholic..) it would make sense to attack his science instead. Scientifically speaking this is called bias at best and bullying at worst. From a faith point of view, for someone professing to be a Christian then James 1:26 Should be helpful:\n“If anyone thinks he is religious and does not bridle his tongue but deceives his heart, this person’s religion is worthless.”\n\n","date":"March 3, 2014 at 8:00 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84622","author":"Mike M","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"Yannick, Mike M is completely right. You have made significant contributions in this blog and to the advancement of our knowledge about the shroud. Don’t ruin it.\n\n","date":"March 4, 2014 at 5:58 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84765","author":"Dan","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"If people stop telling what to write here, I will keep on writing on this blog.  Otherwise, you won’t see me no more.\n\n","date":"March 4, 2014 at 9:31 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84827","author":"Yannick Clément","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"One thing I shall say if favour of Fanti.  It is a fact that cellulose degrades over time, there’s no doubt about that.  He has results from known samples that show how under certain passive conditions of storage, what an average rate of degradation might be expected.  However the degradation rate can also be affected by other extraneous factors such as frequent handling, a kind of ‘fatigue’ action that needs to be added to the passive rate of degradation.  It should be a simple matter to discover the rate how such samples might degrade by say repeated foldings.  Fatigue tests are routinely carried out in much of materials testing, particularly in engineering metals. [Fatigue rates can also be affected by stress concentrators such as recessed corners] Fanti has the engineering labs at Padova to arrange for any of his students to set up such tests himself. \nI think it significant that what determinations he has made place the age of the Shroud much older than the C-14 tests showed, and I would suspect that any such fatigue effects cannot sufficiently account for this difference. I acknowledge the criticisms made by Hugh Farey above. Hugh may consider Fanti’s comments as “spectacular nonsense”; I might classify it more as “innate Italianate exaggeration”.\n\n","date":"March 3, 2014 at 3:32 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84545","author":"daveb of wellington nz","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"The theory is reasonable. But he needs to demonstrate it actually works. He hasn’t done that through any true peer review. He might be onto something that has value well beyond just the Shroud, so all the more reason to pin that down with all the mundane and boring experimentation required. What makes him double frustrating, for me, is that he actually seems to have the resources to do the bull work.\nSo what’s ‘spectacular nonsense’ is not the idea but rather what he presents as proof. And he can use all the hand gestures he wants, it won’t change that. :)\n\n","date":"March 3, 2014 at 5:14 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84574","author":"David Goulet","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"Quote: “Hugh may consider Fanti’s comments as “spectacular nonsense”; I might classify it more as “innate Italianate exaggeration”.”\nAnd Yannick Clément see this as “Religious bias coming from a Catholic Italian who try to prove the authenticity of the relic AT ALL COST”.\n\n","date":"March 3, 2014 at 5:34 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84579","author":"Yannick Clément","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"Charles and Hugh: I am compiling a list of doubts cast on the methodology employed by both Ray Rogers and Giulio Fanti, but there is no time to keep collecting many useful comments posted on shroudstory in bits and pieces and paste them. I am inviting everyone interested to make a list of the doubts and send them, even in the form of an attachment, to my e-mail address on the HSG website so that that they can be printed, analysed and rearranged to obtain responses, which will be a part of a number of articles I will be writing on the TS and biblical archaeology. The e-mail address and identity will not be revealed, if that is anyone’s wish. Thanks in advance.\n\n","date":"March 3, 2014 at 10:44 am","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84476","author":"Louis","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"Method of dating?\nSi estuviéramos ante un cadáver bien conservado de un ser humano podríamos determinar visualmenye si se trata de un bebé, un niño, un adulto joven, un adulto maduro o un viejo…..\n¿tendría valor de datación?.No, pero evidente que nos proporciona una buena información sobre la edad posible del cadáver.\nEl estudio de la vanillina de Rogers no es una datación, pero nos proporciona el distinguir un bebe de un viejo…..lo que es más que suficiente.\n¿Es acaso más cientifico un metodo en el que los resultados pueden tener variaciones de +- 100 o 200 años?\nCarlos\n\n","date":"March 3, 2014 at 3:36 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84547","author":"Carlos","site":"shroudstory"},{"title":"As long as these results are not refuted . . . [they] have scientific validity?","post":"Espero tener más respuestas para publicar un articulo en breve\n\n","date":"March 3, 2014 at 4:37 pm","url":"https://shroudstory.com/2014/03/03/as-long-as-these-results-are-not-refuted-they-have-scientific-validity/","cat":"carbon_14_dating","id":"comment-84564","author":"Louis","site":"shroudstory"}]
