[{"title":"Documented Pieces Removed from the Shroud","post":"What a truly great statement of fact and history regarding the TS!  Of course the relic craze of Medieval Europe was rampant!  And, of course everyone who thought of themselves as royal wanted a piece from the King of Relics– the “Holy Shroud!”  This would mean, however, that another Carbon-14 test would have to go deep into the Image itself where there was no invasive relic mining.  It would be quiet a 21st Century dare!  Joe Marino & his wife Sue were the first to recognize the patchwork for relic craze viz. done in 1520 by Marguerite of Austria’s staff of French reweavers.  Now, how many other patchwork stints surround the Image of the Shroud?\n\n","date":"May 20, 2014 at 12:20 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122075","author":"Annette Cloutier","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Actually there was no patchwork per se.\n\n","date":"May 20, 2014 at 1:47 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122123","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"“(…) at one point in the past, the edges of the Lenzuoli (Sheet) had become so tattered as to cause embarrassment or criticism of the Custodians, and those areas were repaired and rewoven using identical techniques, but obviously with similar, yet newer, materials containing dyes and other medieval manufacturing ingredients, in an attempt to better blend the new sections in, as best possible, with the original fabric.”\nMost likely this was done in 1863 or 1868 not in 1520.\n\n","date":"May 20, 2014 at 12:52 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122088","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"So the “first three Savoy lords” were quietly “sharing major relics” and the Pope did not know about anything? How did this happen? Did they demand secrecy?\nhttp://holyshroudguild.org/uploads/2/7/1/7/2717873/was20there20a20link20between20theknightstemplar20and20the20turinshroud20.an20interview20withdr.20barbara20frale.pdf\n\n","date":"May 20, 2014 at 12:52 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122089","author":"Louis","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Louis,\nYour post relates to a unpleasnat fact about the Shroud: ir was stolen property. Certainly from the time of the fall of Constantinople. One reason why the Pope had to turn a blind eye would be the claims of the Greek Orthodox church on the Shroud. \nIn presentation by Kim Dreisbach delievred posthumously in Pergia, he inserted the following quote:\n“As Fr. Anthony Delessi of the Monastery of the Holy Spirit in Conyers, Georgia has so\nwisely observed:’We Roman Catholics have been its custodians for the last eight\nhundred years after stealing it from the Greeks (i.e. Orthodox) who performed that\nfunction for the first twelve centuries. But in truth, it belongs to no one denomination –\nmaybe not even to Christianity. Rather, it is in actuality ’God’s love letter in linen to all\nmankind.'”\n\n","date":"May 20, 2014 at 1:45 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122120","author":"John Klotz","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"“We Roman Catholics have been its custodians for the last eight\nhundred years after stealing it from the Greeks (i.e. Orthodox) who performed that\nfunction for the first twelve centuries.”\nThis statement is partially erroneous. “Greeks (i.e. Orthodox)” never kept the relic “for the first twelve centuries”!\n\n","date":"May 20, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122129","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hi John\nMany thanks for posting these comments. I think the RCs (like you and me) and Rome realise that a mistake had been made in 1204, but what would happened if the relic fell into the hands of the non-Christians? Constantinople became Istanbul.\nPope John Paul II asked for forgiveness and returned about two relics to Patriarch Bartholomew I, but the Fourth Crusade was actually fought by mercenaries and financed by the Doge of Venice, there were financial interests. Pope Innocent had threatened all those who stole relics with excommunication and the Savoys must have known about that, although they took possession of the TS only much later.\nWell, God sometimes seems to work in strange ways and Father “Kim” hit the nail on the head.\n\n","date":"May 20, 2014 at 2:03 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122138","author":"Louis","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"John, another message for you, very easy to read and understand:\nhttp://www.newadvent.org/cathen/13535a.htm\n\n","date":"May 20, 2014 at 2:31 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122152","author":"Louis","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"From the fourth century, it was believed that one piece of a relic had the power of the whole so we find bishop Ambrose of Milan, for instance, freely giving out pieces of relics and this became common practice. No reason why the Shroud should have been immune and it is clear that rectangular pieces taken from the corners of the Shroud (c.1530?) were not replaced.\nThere were thousands of relics looted from the ‘heretical’ Greeks in 1204 and the pope (Innocent III) could do nothing about it. They were settled throughout Europe without any problems.\n The Shroud was exhibited perhaps fifty or sixty times in the seventeenth century, when the cult of the Shroud reached its peak, so it would be likely that there would be some repairs needed where the linen was held by the priests. The depictions of the expositions suggest that by 1868 they were no longer unfolding it In public\nI am still waiting for anyone who  has examined the Shroud close up to tell me where the reweaving actually took place. It seems very hard to find it!\n\n","date":"May 20, 2014 at 4:02 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122207","author":"Charles Freeman","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"This is difficult now because it seems that material that had been with Ray Rogers and then with Dr. Alan Adler was sent by the latter’s family to Turin after his death.\n\n","date":"May 20, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122222","author":"Louis","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Charles,\nI hope it happens in my lifetime, but it might not. However, multi-spectral digital imaging echnology offers a way to analyze the material components of any item down to to the molecular level (at least). They are best known for an examination of the Mona Lisa. Thet also examined a drawing called La Principessa which had been wrongly attributed by Christies to Germ 19th century (the Nazarwenes) and tiurns out to be a da Vinci. \nDon’t take my word for this, there is an indepdth presnetaion of these wexmaniations (as well as the Lady with ermine) opn heoir web page.\nhttp://www.lumiere-technology.com/\nThe method is non-intrusive. Unlke the work of Heller and Adler, it does not require the removal destruction of the atickle examined. \nWant to join me in calling for a multi-spectral digital analysis of the Shroud and the data banking of the results at appropriate academic and or archival institutions?  (The Library of Congress and/or the British Museum for example.)\nThis way, the Shroud would be preserved digitally  for the ages and be analyzed far into the future.\n\n","date":"May 21, 2014 at 1:53 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122733","author":"John Klotz","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"(I wrote a paper on the 1868 micro-reconstructions).\n\n","date":"May 20, 2014 at 12:53 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122092","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"See my 2007 research paper on the TS C14 dating fiasco.\n\n","date":"May 20, 2014 at 1:01 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122096","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Thanks Max!  Can I find your paper on Shroud.com?\n\n","date":"May 20, 2014 at 1:14 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122102","author":"clublu22014","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"I already posted several excerpt in this very blog.\n\n","date":"May 20, 2014 at 1:25 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122110","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Re the TWO different types of micro-reconstructions that could mainly account for the linen to appear medieval, on June 22, 2013 at 5:00 pm I posted an excerpt from my 2007 paper  on the TS 1988 C14 dating fiasco (in French):\n“Non-détection d’une zone (sinon deux) ayant subi des réparations invisibles à l’œil nu\nTout cet ensemble d’éléments directs et indirects constitue un faisceau d’indices concordants : il tend à témoigner, dans ladite zone plus raide et plus sombre, d’une intervention selon une technique bien particulière inspirée de la technique du « retissage à la française » (bien connue des maîtres-tapissiers ainsi que des experts en histoire de la tapisserie) ; technique qu’il ne faut cependant pas confondre avec celle d’un simple « entissage » d’un patch médiéval, repérable, quant à lui, à l’œil nu et à la lumière naturelle du jour par un spécialiste.\nLa technique dont il s’agit ici s’avère plus précisément celle d’un « retissage par épissures », sans coutures ni nœuds, effectuée, semble-t-il, sous un éclairage rasant et sous une loupe à fort grossissement. Elle demande beaucoup de patience et une grande dextérité des doigts. Elle consiste à mettre, tout d’abord, en place les fondations de base et la chaîne. Pour ce faire, soit le tisserand commence par identifier la matière des fibres constituant les fils de chaîne puis se les procure soit il utilise systématiquement des fibres de coton. Ensuite ces fibres sont filées afin d’obtenir l’épaisseur des fils originels puis entortillées avec précaution sur elles-mêmes et sur place aux fibres des fils de chaîne extraites de la partie cachée du tissu à réparer. Des fils de remplacement de la trame sont alors placés par-dessus et par-dessous les fils de chaîne reconstitués puis les fibres sont entortillées sur elles-mêmes, là encore avec précaution, aux fibres des fils de trame originels de façon à reproduire très exactement la texture ou le motif du tissu et refermer ainsi, sans faire de nœuds, le trou ou la zone sévèrement cisaillée. \nPour finir de rendre cette restauration fil à fil tout à fait invisible et consolider les épissures, une teinture à base de gomme résineuse est appliquée localement sur la trame ainsi reconstruite pour que celle-ci, d’où provient l’effet de texture ou de motif, se fonde dans l’original (en l’occurrence la toile jaunie par la patine ivoire des siècles). Cette intervention sous un éclairage rasant et sous une loupe, si elle est bien réalisée et bien dissimulée, peut réellement être invisible sur les deux faces d’une pièce d’étoffe au point d’échapper parfois même à la main et à l’œil exercés d’une personne du métier qui, à l’œil nu et sous une lumière inadéquate, a tendance à confondre ces reconstructions avec des irrégularités apparues au cours du tissage. De fait, la structure artisanale du lin originel du Linceul, son calibre assez fort ainsi que son tissage serré en chevron sont de nature à parfaitement intégrer ce type d’intervention.\nQuant à l’échantillon de Zurich (et partant « l’échantillon 1 d’Arizona ») tiré de la partie claire de la bande C14 officielle du Linceul, celui-ci bien que ne présentant apparemment pas ou très peu de trace de contamination par une quelconque teinture14, n’en devait pas moins être recouvert d’une patine de microorganismes. De par l’aspect anormale de la zone où il fut prélevé, il suggère fortement, en tout cas, un second type d’intervention indétectable à l’œil nu car effectuée, elle aussi semble-t-il, sous un éclairage rasant et sous une loupe à fort grossissement : « un raccommodage à perte ». Cette technique consiste très précisément à insérer, entre les fils de trame et de chaîne, des fils (ici de coton) qui, à chaque fois, sont coupés à leurs deux extrémités sans faire de nœuds, les laissant ainsi littéralement se perdre dans le tissu de lin existant.\nCes deux types spécifiques d’intervention (l’une dans le sens d’un remplacement de matière carbonée, l’autre dans celui à la fois d’un remplacement et d’un léger apport) permettraient de rendre compte de la grande dispersion des résultats observée (1238-1407) sur une si petite distance (à peine quatre centimètres de tissu).\nL’enduit de gomme arabique étant soluble dans l’eau et présent dans cette zone du coin supérieur gauche, il ne pouvait avoir été appliqué sur les fils superficiels des échantillons Raës et C14 qu’après l’incendie de la Sainte Chapelle de Chambéry de 1532. La teinture l’eût-elle été avant, celle-ci n’aurait pas dissimulé l’extrémité du bord supérieur de la grande auréole dentelée car l’eau de l’incendie eût entraîné les produits de la pyrolyse locale au cœur des fils. Ce revêtement coloré ajouté tardivement explique l’absence de fluorescence aux UV observée dans cette aire particulière du drap. \nL’histoire de la conservation du Linceul après 1532 permet donc de dater, d’une manière très précise, au moins une sinon les deux interventions. Seules, en effet, les quatre sœurs clarisses, en 1534, et la princesse Clothilde de Savoie-Bonaparte, en 1863/8, qui intervinrent de façon étendue sur la relique, auraient pu effectuer ce type de réparations invisibles de mains aussi expertes. Les sœurs clarisses s’étant vues confiée la tache bien spécifique de réparer et de consolider la pièce d’étoffe endommagée lors de l’incendie de 1532, la princesse de Savoie-Bonaparte s’avère donc être, pour ces travaux délicats de restauration, la candidate la plus hautement probable (aidée ou non en cela du maître tapissier de la cour royale d’alors). Ce d’autant qu’en 1863, cela faisait déjà plus de cinq siècles qu’à chaque ostension à mains nues, la relique se retrouvait être tendue à l’horizontale.\nTout ceci explique (ou expliquerait) pourquoi, lors de la découpe de l’échantillon et faute d’un éclairage adéquat (en lumière UV ou rasante), ces deux variantes locales passèrent totalement inaperçues aux yeux des experts textiles chargés de superviser le prélèvement pour la datation officielle de 1988. Toute leur attention était alors absorbée soit par l’étude technique du drap (qu’ils voyaient pour la toute première fois) soit par la présence gênante des fils de la couture épaisse qui liaient un résidu de la partie supérieure du Linceul au tissu à découper. Ainsi en oublièrent-ils de procéder à un examen minutieux du cœur même du site textile à prélever. L’eurent-ils examiné, ils n’auraient pu manquer, en effet, d’y repérer la petite reconstruction de forme serpentine, la teinture dissimulant l’extrémité du bord supérieur de la grande auréole d’eau dentelée ainsi que le caractère plus raide et plus sombre de la zone. \nEn principe, une restauration « invisible » ne saurait échapper au compte-fil et a fortiori à la binoculaire lorsque l’œil derrière est compétent. Les photos qui montrent les Prs Francesco Testoré et Gabriel Vial († 2005) s’affairant avec divers instruments sont, cependant, on ne peu plus trompeuses en ce qu’elles laissent croire que lesdits experts étaient occupés à des vérifications préliminaires de l’intégrité de ladite zone quand, de fait, leurs vérifications ne furent pas étendues au cœur de l’échantillon mais se bornèrent à la seule lisière du drap. Ainsi croyant avoir libéré l’échantillon aux bords effilochés de tout fil étranger, laissèrent-ils à l’opérateur, Giovanni Riggi di Numana († 2008), « le soin » de réduire à une bande rectangulaire un peu plus régulière le rectangle grossier que celui-ci, à l’aide de ciseaux de chirurgien, venait d’extraire sans gants protecteurs et plus ou moins malhabilement à la pièce principale.\nDe toute évidence, ce technicien (à qui échut la responsabilité et du choix de l’emplacement et de la prise d’échantillon !) n’était pas expert textile pas plus qu’il n’était carbonologue ou bien archéologue15. Il semblait en effet ignorer à quel point, en matière de radiodatation, la haute technologie de l’Accélérateur Spectromètre de Masse (adaptée pour les mesures sur des microéchantillons) s’avère être sensible aux contaminations y compris à celle du sébum humain. Ce choix d’une zone qui avait fait l’objet, au cours des siècles, de nombreuses manipulations à mains nues lors des ostensions, était donc déjà, de ce seul point de vue, tout sauf judicieux.”\n\n","date":"May 20, 2014 at 1:21 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122107","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Max, this editorial of yours is so magnificent, so thoroughly thought out and researched!  Why don’t you publish it in English on Barrie’s Shroud.com?… It’s overdue for a wider audience!\nDo you plan to attend the St. Louis Shroud Convention this October?  Your paper should be presented there in any case!\n\n","date":"May 20, 2014 at 1:41 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122118","author":"clublu22014","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Thank you clublu22014. The fact is I don’t intend to attend any of the two Turin Shroud international conferences (St Louis and Bari).\n\n","date":"May 20, 2014 at 1:59 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122133","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Besides I have no that much time to do the translation work.\n\n","date":"May 20, 2014 at 2:02 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122135","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Too bad, Max.  The work you’ve done is BRILLIANT!  I’d like your autograph!\n\n","date":"May 20, 2014 at 2:11 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122141","author":"clublu22014","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hi Max,  Google translates your excerpt well:  “\nNon- detection zone (if not both) has undergone invisible to the naked eye repairs\nAll this set of direct and indirect evidence is a consistent body of evidence: it tends to testify in said steeper and darker area, an intervention by a special technique inspired by the technique of ” reweaving the French “(well-known master – weavers as well as experts in the history of tapestry); technique he should not however be confused with that of a simple ” entissage ” a medieval patch, spotted, meanwhile, to the naked eye and natural daylight by a specialist.\nThe technique in question here is more precisely that of a ” reweaving by splice ” without seams or knots, made , apparently , in a shaving light and under a strong magnifying glass . It requires a lot of patience and great dexterity. It consists in, first, the foundations and the basic chain. To do this, either the weaver begins by identifying the fiber material constituting the son of the chain then provides either systematically uses cotton fibers. Then these fibers are spun to obtain the thickness of the original son then carefully twisted on themselves and on-site fiber son string extracted from the hidden part of the tissue to be repaired. Son of the replacement frame are then placed on top and below the chain son reconstituted fibers then are twisted on themselves, again with care, fiber of the son original frame so as to reproduce exactly texture or pattern of the fabric and so close, without knots, the hole or severely sheared zone.\nFinally to make this wire restoration wire completely invisible and consolidate splices, dyeing gum base resin is applied topically to the frame and rebuilt before it , from which the effect of texture or pattern is based on the original (in this case the yellowed patina ivory canvas by centuries ) . This intervention under grazing illumination and a magnifying glass, if it is well done and well hidden, can actually be visible on both sides of a piece of cloth to the point of sometimes escape even by hand and eye exercised by a skilled person who, to the naked eye and under inadequate light, tends to confuse these reconstructions with irregularities occurred during weaving. In fact, small-scale structure of the original linen of the Shroud, its strong enough and its tightly woven herringbone caliber are likely to perfectly integrate this type of intervention.\nAs for sample Zurich (and hence ” Sample 1 Arizona “) alleging the clear part of the official band of C14 Shroud , although it does not appear to have any or very little trace contamination any teinture14 , not least should be covered with a patina of microorganisms. By the abnormal appearance of the area where it was taken, it strongly suggests, in any case, a second type of response undetectable to the naked eye as done, too, it seems, under a grazing lighting and under a strong magnifying glass “to mending a loss.” This technique is very specific to insert, between the son of weft and warp, the son (cotton here), which in each case are cut off at both ends without knots, thus leaving literally lost in the fabric existing flax.\nThese two specific types of intervention (one in the sense of a replacement carbonaceous material, the other in both a replacement and a slight contribution) would account for the wide dispersion of observed results (1238-1407) on a small distance (just four centimeters of tissue).\nThe coating of gum arabic is soluble in water and present in this area of the upper left corner, there could not have been applied to the surface samples Raës son and C14 after the fire of the Holy Chapel of Chambéry 1532 dyeing had she been before, it would not have hidden the end of the upper edge of the large jagged halo because the water from the fire had driven the products of pyrolysis at the heart of local son. This late addition colored coating due to the lack of fluorescence observed in this particular area of the UV sheet.\nThe conservation history of the Shroud in 1532 after dating allows, in a very precise manner, at least one or both interventions. Only, in fact, the four sisters Clare in 1534, and Princess Clothilde of Savoy Bonaparte, in 1863/8, which intervened on the extended relic way, could make such repairs invisible hands as experts. Poor Clare sisters are entrusted with the views very specific spot repair and strengthen the damaged piece of cloth in the fire of 1532 , the Princess of Savoy Bonaparte thus proves to be for these delicate restoration work, the most highly probable candidate ( assisted or not it upholsterer master of the royal court at the time) . This all in 186, it was already more than five centuries at each exposition with bare hands, the relic is found to be stretched horizontally.\nThis explains (or explain ) why , when cutting the sample and lack of adequate lighting (UV light or grazing ), both local variants passed completely unnoticed textile experts to oversee the levy the official dating from 1988. All their attention was then absorbed either by the technical study of the sheet (they saw for the first time) by the annoying presence of the son of the thick seam bound residue of the upper Shroud fabric cutting. Thus they forgot to make a careful examination of the heart of the textile to collect site. The had they looked , they could not have missed, in fact, be identified early reconstruction of serpentine form , dyeing concealing the end of the upper edge of the large halo of water and the indented character more stiff and darker area .\nIn principle, an “invisible” restoration cannot escape the account over and a fortiori when the binocular eye behind is competent. Photos that show Francesco Testore and Gabriel Vial ( † 2005) Prs bustling with various instruments , however, it is little misleading in that they suggest that such experts were engaged in preliminary integrity checks said area when in fact their audits were not extended to the heart of the sample but were confined to one edge of the sheet. And believing he released the sample to any foreign frayed wire edges , they left to the operator, Giovanni Riggi di Numana ( † 2008), ” care ” to reduce to a slightly more regular rectangular strip coarse rectangle thereof, using scissors surgeon, had just extracted without protective gloves and more or less uneasily at the main room.\nObviously, this engineer (who fell the responsibility and choice of location and the sampling)! Textile expert was not any more than it was carbonologue or archéologue 15. It seemed indeed to ignore how, on radiocarbon, high technology Accelerator Mass Spectrometer (suitable for measurements on microarrays) appears to be susceptible to contamination including that of human sebum. This choice of an area that had been, over the centuries, many manipulations with bare hands during exhibitions was thus already, from that point of view, anything but wise. “\n\n","date":"May 20, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122223","author":"clublu22014","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Sorry Clublu, but this is a MOST horrible rendition/translation of my excerpt!\n\n","date":"May 21, 2014 at 4:53 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122497","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Max,\nJe suis très intéressé par la technique du “retissage par épissure”.\nAvez-vous des références ?\nY at-il un lien vers votre papier de 2007 ?\nI am very interested in the “French reweaving” technique using splices.\nDo you have some references ?\nIs there a link to your 2007 paper ?\n\n","date":"May 21, 2014 at 4:29 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122797","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Max,\nI repeat: \nJe suis très intéressé par la technique du “retissage par épissure”.\nAvez-vous des références ?\nY at-il un lien vers votre papier de 2007 ?\nI am very interested in the “French reweaving” technique using splices.\nDo you have some references ?\nIs there a link to your 2007 paper ?\n\n","date":"May 23, 2014 at 3:42 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-123681","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"newvistas.homestead.com/MediaRePatch.html\n\n","date":"May 20, 2014 at 1:23 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122109","author":"Louis","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"I advocate a modern (not a medieval) contamination (1863/8) + a first century contamination due to a purifying ritual (alkali solution in-soaked linen wrapping the deceased + ritual fumigation to dry it out).\n\n","date":"May 20, 2014 at 1:37 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122117","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"“Additional proof…”?? Red rag to a bull, I’m afraid.\n“It was traditionally affirmed….” Proof?\nAnd no; ingenious though Max’s ideas are, there is no evidence for medieval interweaving, which is nothing like as invisible as we are often led to believe. I do concur with the idea that dyes were used, but they were used to darken the Holland cloth to make it match the Shroud, of which there is photographic evidence, not to darken the Shroud itself.\n\n","date":"May 20, 2014 at 2:38 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122156","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh you wrote: “ingenious though Max’s ideas are, there is no evidence for medieval interweaving, which is nothing like as invisible as we are often led to believe.”\nMethinks you totally miss my point and just cannot discriminate between “French reweaving” (you mention just “MEDIEVAL interweaving”) and “MODERN Spliced Reweaving as variant to Medieval French reweaving”.\n\n","date":"May 20, 2014 at 2:58 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122163","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh, too bad you just cannot really understand my written French.\n\n","date":"May 20, 2014 at 2:59 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122165","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Your French is crystal clear, Max. I just disagree with it, that’s all.\n\n","date":"May 20, 2014 at 3:15 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122174","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hw do you mean “crystal”?\n\n","date":"May 20, 2014 at 3:21 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122180","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"To disagree on next to no substance is no proof to the contary. As to your photographic evidence, can you prove it is not just another “I think I see”?\n\n","date":"May 20, 2014 at 3:27 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122182","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Reminder for Hugh: An image is worth a thousand word. Where is “your” photographic evidence to the contrary?\n\n","date":"May 20, 2014 at 3:34 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122186","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Besides this is just an excerpt not the whole text with figures.\n\n","date":"May 20, 2014 at 3:21 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122179","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Max, please stop spamming the comments. It won’t help you to get attention, while it disturbs the others.\n\n","date":"May 20, 2014 at 3:32 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122184","author":"O.K.","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Max.\n\n","date":"May 20, 2014 at 5:02 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122236","author":"Dan","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Max, you have been warmed. Do not reply to this.\n\n","date":"May 20, 2014 at 5:05 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122238","author":"Dan","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"“Another FACT (my upper cases) confirmed by His Majesty was that it was traditionally affirmed, that at one point in the past, the edges of the Lenzuoli (Sheet) had become so tattered as to cause embarrassment or criticism of the Custodians, and those areas were repaired and rewoven.”\nHugh on which objective ground do you think it is just a “Red rag to a bull”?Could you be more specific, please or are you just trying to poison the well with innuendos?\n\n","date":"May 20, 2014 at 3:51 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122197","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"“the pious practice of sharing Major Relics of the Holy Shroud was, according to tradition, continued by the first three Savoy Lords who possessed it, although they, unlike some of their predecessor Guardians, never purposely removed fragments from their areas with the image of the Corpus Sancti (Holy Body.)”\nThis is strange. The only portions of the Shroud that looks missing,are the ends of the side strip around the edges (not including wholes in the patched areas, plus Raes and C-14 sample). No image areas were taken from the Shroud. Some older publications assumed that the Shroud’s lenght were shortened from 5 meters to approximately 4.4 by cutting material for relics, but there are strong counterarguments against that.\nAnother fact confirmed by His Majesty was that it was traditionally affirmed, that at one point in the past, the edges of the Lenzuoli (Sheet) had become so tattered as to cause embarrassment or criticism of the Custodians, and those areas were repaired and rewoven using identical techniques, but obviously with similar, yet newer, materials containing dyes and other medieval manufacturing ingredients, in an attempt to better blend the new sections in, as best possible, with the original fabric.\nBoth corners? Because on the quad mosaic photos presented in Benford/Marino paper, both outer corners around the missing parts of the side strip have similar greenish color, indicating differences in chemical composition (http://www.shroud.com/pdfs/benfordmarino2008.pdf see Figure 5) The problem is its interpretation -are those rewoven, or simply dirty areas? The presence of the similar green color on the other corner was always, in my opinion, one of the greatest challeges to the validity of quad mosaic argument for reweave hypothesis.\n\n","date":"May 20, 2014 at 3:54 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122199","author":"O.K.","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"That the visible parts of the Holland cloth were dyed to match the shroud: http://www.holyshroudguild.org/uploads/2/7/1/7/2717873/1309358_orig.jpg.\nAnd “traditional affirmation” however loyally (or royally) repeated, is not by any definition a fact. or FACT.\nAnd, oh no!, the quad mosaic rises again! OK, before discussing the green corners, can we clear the problem of the blue swathes across the image area? What difference in chemical composition do they represent?\n“Crystal clear”: an English idiom perhaps without a literal French equivalent referring to the exceptional clarity of lead crystal glass compared to ordinary soda or potash glass.\n\n","date":"May 20, 2014 at 6:57 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122300","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh, too bad you mistake the French word “MODERNE” for “MEDIEVALE” as far as spliced reweaving as variant to French reweaving is concerned and you totally missed my point regarding Testore and Vial missing to examine the very heart of the C14 sample. Is that crystal clear? Methinks French is still not that crystal clear to you.\n\n","date":"May 21, 2014 at 2:58 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122455","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Typo: to examining\n\n","date":"May 21, 2014 at 2:59 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122457","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"I’m with Max on this one.  I’d bet my house on the testimony of King Umberto II against any of Hugh’s claims that no reweave was carried out.  There is also other testimony recorded in a Marino paper that repairs were routinely carried out as a matter of course.  There are several various images on the web of five bishops suspending the Shroud from its edge in the open air.  A notable one is a Dorset silk engraving of the 17th century in the presence of three Savoy princesses.  The last such hand-held display was in 1842.  From 1868, all subsequent expositions were in a frame.  After 1868 showing, Princess Clotilde personally replaced Valfré’s black silk lining with a red one.  She may then well have effected invisible repairs (‘Raes area’) to the damaged area.\n\n","date":"May 20, 2014 at 8:26 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122334","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Serious question – how much weight can we give to the King’s testimony?\nThere have been plenty of royal twits over the years that I for one would pay little respect to.\n\n","date":"May 21, 2014 at 2:13 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122440","author":"Thomas","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"I don’t think there’s any reason think Umberto was a ‘twit,’ but it is important to bear in mind that he never returned to Italy after his exile in 1946, and could have had nothing to do with the Shroud directly since then. Nor am I a republican, but I do not think that royalty gives any especial authority to a point of view. “Traditional affirmation” doesn’t mean anything.\nAlso, it seems to be increasingly quoted that invisible repairs were carried out “as a matter of course.” Was this just to the Shroud, or to other frayed valuables? If so, where are they? Ah, but we’ll never know, will we, because they’re invisible!\nI must go and feed my unicorn…\n\n","date":"May 21, 2014 at 2:53 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122453","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh you wrote: “That the visible parts of the Holland cloth were dyed to match the shroud: http://www.holyshroudguild.org/uploads/2/7/1/7/2717873/1309358_orig.jpg.” \nThis doesn’t not ruled out AT TALL the fact the C14 Shroud edge was dyed as is the final touch to a micro-reconstruction process! Are you kidding or a master in red herrings?\nBTW Swiss textile expert Metchild Flury-Lemberg NEVER examined in situ textilis the very core of the C14 sample (most likely nor did Testore and Vial!). \nWhat do you make of Rogers’ and Villareal’s findings of spliced and glued threads in the said area? NOTHING. How scientific!\nThe testimony of King Umberto II (reporting a family tradition the reweave was carried out) is totally invalid JUST because Mr Farey wants it. How impartial! There is more in traditions than in all your big science.\nRe photographic evidence, three independent specialists who examined photographs of the C14 sample areas testified of anomalous weaves suggesting repair and reweaving. Hugh, are you suggesting “your expertise” and alleged “photographic evidence of the contrary” is more reliable than theirs as far as ancient textiles micro-reconstructions are concerned?\n\n","date":"May 21, 2014 at 3:37 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122467","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh, methinks both my French and English are definitely potash unclear to you.\n\n","date":"May 21, 2014 at 3:48 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122470","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Typo: potash glass unclear\n\n","date":"May 21, 2014 at 3:50 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122471","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Reminder for Hugh Farey: “You’re neither right nor wrong because other people agree with you. You’re right because your facts are right and your reasoning is right—and that’s the only thing that makes you right. And if your facts and reasoning are right, you don’t have to worry about anybody else.” Warren Buffett\n\n","date":"May 21, 2014 at 4:31 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122490","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Notwithstanding that New Zealand remains a constitutional monarchy, and that this type of governance with its titular head of state on the other side of the globe has proved much more benign, permanent and effective to the general benefit of its inhabitants, than the political power-driven presidential aspirants of other come-and-go temporary fads, my confidence in King Umberto’s testimony in this matter has little to do with respect for His Late Majesty’s royal escutcheon.  \nThe House of Savoy had full custody and ownership of the Shroud from 1532 until Umberto’s death in 1982.  Its stewardship was always conscientious, attentive and protective.  Even after his self-imposed exile in 1946, Umberto  continued his interest in the relic, and it was not until 1969 after much intensive lobbying by such persons as Fr Peter Rinaldi that he was prepared to agree under certain specific conditions  to any kind of hands-on scientific study.  Umberto II was not any kind of royal twit despite any averse reputation of the breed that such republican types as Thomas may hold of the species.  \nHis exile was occasioned by the founding of the Italian Republic in 1946, following the toppling of the fascist regime of Il Duce at the end of WWII.  There followed frequent bouts of instability and changes of toothless governments with news of yet other Italian elections a regular, risible and recurring news item.  The people of that republic might reflect in what way their reputation may have been enhanced by their recent now departed president with his taste for bunga-bunga parties, and whether they are any better off for not having the benefits and stability of a constitutional monarchy.    \nMr Hugh Farey may regret that he does not have direct access to the archives and records of the Royal House of Savoy to test the claims made.  However he would be quite unable to exercise any scientific interest in his favourite topic of study at all, if it were not for the likes of King Umberto II and the care of his royal predecessors.  His interests would have to be solely confined to the abstractions of his unicorns.\n\n","date":"May 21, 2014 at 4:59 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122499","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"My point was not necessarily to imply that Umberto was a twit but simply to suggest that being royalty does not automatically imply credibility or authority. Some royals have been brilliant and some twits.\nMore importantly how credible is the author Evaristo who claims these statements?\n\n","date":"May 21, 2014 at 6:18 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122526","author":"Thomas","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Well stated, Sir Dave B. of Wellington!\n\n","date":"May 21, 2014 at 8:12 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122570","author":"clublu22014","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hi Max.\nThe answer to your question: “What do you make of Rogers’ and Villareal’s findings of spliced and glued threads in the said area? NOTHING. How scientific!” is at http://shroud.com/pdfs/n78part9.pdf. \nThe testimony of anybody is not invalid by personal desire; it is invalid if it is unsubstantiated. Family tradition is not worthless, but it does not constitute fact.\n“Hugh, are you suggesting “your expertise” and alleged “photographic evidence of the contrary” is more reliable than theirs.” Yes, I am. However expert the examiners, neither the extent nor the quality of the photo they were given was adequate for a reliable judgement. I’d bet my house (the one I won’t need after winning daveb’s!) that if the same textile companies were given Shroud 2.0 to look at, they would find no more or less evidence of interpolation at the sample corner than anywhere else on the cloth.\nYour last quotation is excellent and one I continually live by. However, a fact is not determined by personal conviction but by evidence. I’m not persuaded by your evidence, so for me, I do not believe the interweaving is a fact.\nOh, and I missed your enquiry about the red rag to a bull. I’m sure Dan knew exactly what he was doing by heading his post “additional proof” knowing that some of us don’t think there was any proof to start with, let alone the likelihood of adding to it! \nMoving on. I’m wondering about the tattiness of the shroud and the grubbiness of bishops’ fingers again. Would anyone like to guess how often the sample corner of the shroud has been handled, given the paucity of its exposition. How would that compare with, say, a tablecloth or bedsheet? I think the whole concept of ‘threadbareness’ is extremely unlikely.\n\n","date":"May 21, 2014 at 6:19 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122527","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh, re facts, you wrote: “I’m wondering about the tattiness of the shroud and the grubbiness of bishops’ fingers again. Would anyone like to guess how often the sample corner of the shroud has been handled, given the paucity of its exposition. How would that compare with, say, a tablecloth or bedsheet? I think the whole concept of ‘threadbareness’ is extremely unlikely.”\nBishops bare hands have nails (and even at time rather sharp ones) and wear rings. Just in case you cannot imagine what facts are really about.\n\n","date":"May 21, 2014 at 7:00 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122540","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Not to mention weight pressure per cm2 at both edges.\n\n","date":"May 21, 2014 at 7:01 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122541","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Rings with a faceted gem.\n\n","date":"May 21, 2014 at 7:03 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122542","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Accidents happen.\n\n","date":"May 21, 2014 at 7:04 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122543","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"The shroud could be held for an hour or even more.\n\n","date":"May 21, 2014 at 7:10 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122546","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Reminder for Hugh: Linen that is repeatedly sharply bent, will eventually break. Its strength is also its weakness.\n\n","date":"May 21, 2014 at 7:18 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122548","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"The Shroud was repeatedly sharply bent at both edges.\n\n","date":"May 21, 2014 at 7:21 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122549","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Reminder for Hugh: The three independent specialists were shown a similar photograph to that you included in your paper but reached a totally different opinion from yours.\n\n","date":"May 21, 2014 at 7:37 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122551","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Three independent specialist’s concurring opinion vs an agenda-driven (“medievalfakist”) non specialist. Who’s the most reliable for detecting micro-reconstructions?\n\n","date":"May 21, 2014 at 7:44 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122557","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"I had been of a mind to respond to Hugh’s challenge as to the frequency of expositions of the Shroud with a catalogue of its history since 1355.  The source data is already available in Ian Wilson’s detailed chronologies in the appendices of both his 1978 and 2010 publications.  If one had the time and inclination to peruse the chronology and list the number of times the Shroud was known to have been displayed, handled, moved, transported, folded or rolled, removed and replaced, one could I suppose arrive at an absolute minimum.  The number would not be so tiny as implied by the word “paucity”.  I’ve decided against troubling myself as the task would indeed be onerous and I doubt there is any point in attempting to move one so wedded to scientism.  It would seem that French reweaving is so successful as to be quite undetectable by any methods known to present-day science, even when the known anomalies are evident.  I wonder what an 800 year old bed-sheet might look like.   After only 50 years of marriage I’m sure there are none left in our household older than 20.  The tea-towels, some of them linen, are a different matter and are renewed every five years or so.\n\n","date":"May 21, 2014 at 7:41 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122555","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Oh, I agree. It was a sort of ball-park figure I was aiming at. One often hears that the shroud was only taken out and displayed a few times a century, and there were certainly other occasions when it was reconfigured for its box. Do we think it was more? Was it held up for public display more often in the 14th and 15th centuries than in later ones, do you think? \nAt 10 times a century, it has been handled about 60 or 70 times since 1350. Does that seem unreasonable?\nAt 25-30mg per cm2 the shroud is a heavy cloth, not a flimsy wisp of stuff – much heavier than a bedsheet, for example.\n\n","date":"May 21, 2014 at 8:15 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122571","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Not only shroud weight per cm2 but also FINGER NAIL PRESSURE should be taken into account.\n\n","date":"May 21, 2014 at 8:31 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122579","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"On the frequency of the expositions the key text is Beldon Scott’s Architecture for the Shroud. I haven’t a copy with me at the moment but it lists the known expositions by century after 1578. The peak was the seventeenth century, possibly sixty expositions and maybe even more. By the nineteenth century expositions were rare, only three I  think between  1842 and 1898.\nI am surprised this book is not referred to more often as it has a much fuller history of the Shroud than I have seen anywhere else. Beldon Scott says he is neutral on the authenticity – he is more interested in the use of the Shroud for display/ propaganda purposes.\n\n","date":"May 21, 2014 at 10:54 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122643","author":"Charles Freeman","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Thank you Charles. What about private expositions?\n\n","date":"May 21, 2014 at 4:52 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122811","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh, the fact remains though there is more in traditions than in all your big science.\n\n","date":"May 21, 2014 at 8:06 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122566","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"No, there isn’t.\n\n","date":"May 21, 2014 at 8:45 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122584","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"BTW Are you really English?\n\n","date":"May 21, 2014 at 9:10 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122596","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh you wrote: “That the visible parts of the Holland cloth were dyed to match the shroud”.\nHow can you be so assertive? Can you discriminate between a sweat yellow stain linen cloth and dye to match the shroud? Where is your chemical analysis?\n\n","date":"May 21, 2014 at 8:58 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122587","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh re your big science, you wrote: “That the visible parts of the Holland cloth were dyed to match the shroud”.\nHow can you be so assertive? Can you discriminate between a sweat yellow stain linen cloth and dye to match the shroud? Where is your chemical analysis?\n\n","date":"May 21, 2014 at 8:59 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122588","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"What about coloration difference between protected and unprotected linen cloth as far as natural aging is concerned?\n\n","date":"May 21, 2014 at 9:04 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122592","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Is it just your particular “humble” opinion or a truly conclusive scientific fact?\n\n","date":"May 21, 2014 at 9:18 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122599","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Still more Fareyst red herrings.\n\n","date":"May 21, 2014 at 9:08 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122595","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Reminder to Max: it is Hugh who is attempting to remove the red herrings around here. Your understanding of the term perhaps needs reviewing.\n\n","date":"May 21, 2014 at 9:22 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122602","author":"David Goulet","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"David, this is just a matter of viewpoint. Maybe yourself are running after Hugh’s. How can you tell for sure?\n\n","date":"May 21, 2014 at 9:28 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122607","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"David,\nare you 100 % sure there was no repair and no reweaving at all in the C14 sample? What are your proofs (beyond the shadow of a rational doubt)?\nDo you seriously think there is not the slightest/foggiest body of evidence to the contrary and it was just a red herring? If so, can you just give the proofs to the contrary and if you just cannot maybe your understanding of the phrase (red herring) do need reviewing. Charité bien ordonnée commence par soi-même.\n\n","date":"May 21, 2014 at 9:39 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122611","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Re ‘threadbareness’, Hugh what you make of (sharp) fingernail pressure per cm2? NOTHING. And you mean big science?\n\n","date":"May 21, 2014 at 9:27 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122604","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"And what do you make of THE other FACT linen that is repeatedly sharply bent, will eventually break. Its strength is also its weakness. Reminder: the Shroud was repeatedly sharply bent at both ends each it was stretched for display.\n\n","date":"May 21, 2014 at 9:45 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122615","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"There is no getting away from facts.\n\n","date":"May 21, 2014 at 10:02 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122621","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh, re the visible parts of the Holland cloth having been dyed to match the shroud you. just referred me to a photograph. Could you referred me to a chemical analysis or couldn’t you if you really mean fact and not “I think I see”?\nShall I repeat: still even if you could (which I very much doubt), it just could not ruled out  the fact the C14 Shroud edge was dyed as is the final touch to a micro-reconstruction process. Looking forward for “your facts to the contrary”.\n\n","date":"May 21, 2014 at 10:15 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122630","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hi Max!\n8:58           That’s a good point. The Holland cloth appears fairly uniformly discoloured where it is exposed, and there is a sharp cut-off between the exposed and the unexposed areas. I would expect sweat-stains to be less uniform. Light, on the other hand, I would expect to bleach the cloth paler, not darker, unless there was a high proportion of lignin in it (like old newspapers). You may remember, however, that I first speculated about this possible dying of the Holland cloth with reference to the high contrast Enrie photos, which seem to show darker areas on the Shroud around the margins of those parts adjoining the Holland cloth.\n8:59          A repeat of the above.\n9:04         See my answer above.\n9:10         Yes, I’m as English as it’s possible to be.\n9:18         It is indeed my humble opinion, supported only by the evidence I display before you. Scienctists aren’t keen on ‘conclusive scientific facts.’ Non-scientists, on the other hand, often use the term, often as a synonym for ‘guesses.’\n9:27         “Re ‘threadbareness’, Hugh what you make of (sharp) fingernail pressure per cm2? NOTHING.” You’re quite correct there. I do not consider ‘sharp fingernail pressure’ an avenue worth pursuing. \n9:39         I’m certainly not 100% sure there was no repair and no reweaving at all in the C14 sample. However the weave of the shroud can be studied in some detail on Shroud 2.0, the X-ray photos from 1978, and on detailed photos of one of the radiocarbon pieces retained by the Tucson laboratory. No interweaving is detectable, and the continuousness of many of the threads deeply into the body of the Shroud can easily be observed. After examining all the evidence, for and against, I am of the opinion that there is insufficent evidence for a 60% modern intervention to be sustained.\n                 “Do you seriously think there is not the slightest/foggiest body of evidence to the contrary?” Not at all, and have repeately and publicly said so. There is a lot of interesting but so far inconclusive evidence for reweaving – just not, in my opinion (which I have to say is getting less humble by ther minute), enough to change my mind. Perhaps if the various cotton observers could regularise their ideas into a coherent opinion, I might change my mind.\n                “Charité bien ordonnée commence par soi-même.” No, you’ve foxed me completely with this one…\n9:45        “THE other FACT.” “The Shroud was repeatedly sharply bent at both ends each [time] it was stretched for display.” A perfect example of what I suggested in my answer to 9:18 above. Wholly unsubstantiated.\n10:15      Ray Rogers’s Thermochimica Acta paper describes evidence for madder root dye and some kind of water soluble gum. That’s as close to a “FACT” as you’re likely to come. If the dye was applied to the Shroud, to conceal some invisible weaving, then there wouldn’t be any on the backing coth unless it was attached to the Shroud before the dying process. If the dye was applied to the backing coth to make it look more like the Shroud, then it would have stained the adjacent areas of the Shroud as well. Interestingly, Rogers claims that there was none of his observed coating on his samples of the Holland coth. However, he does not say from where his samples came. Even by my hypothesis, most of the cloth was, of course, completely dye-free.\n\n","date":"May 21, 2014 at 10:56 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122644","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Shall I repeat: There is explicit and implicit presence of splicing threads\nIndependently, Hall, Testore, Rogers and Villarreal reported the presence of spliced threads (coton intermixed with linen, broken glued coton thread) in the TS corner.\n\n","date":"May 21, 2014 at 11:15 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122655","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Spliced, butt-joined, glued, interwoven, made entirely of cotton, blended with cotton, half cotton half flax, 5% cotton, etc. etc. They’re simply too inconsistent for any reliable judgement to be made.\n\n","date":"May 21, 2014 at 11:19 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122659","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Shall I repeat I not only advocate a modern (not a medieval) contamination (1863/8) but also a first century contamination due to a purifying ritual (alkali solution in-soaked linen wrapping the deceased + ritual fumigation to dry it out).\n\n","date":"May 21, 2014 at 11:26 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122662","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh you wrote: “8:58 That’s a good point. The Holland cloth appears fairly uniformly discoloured where it is exposed, and there is a sharp cut-off between the exposed and the unexposed areas. I would expect sweat-stains to be less uniform. Light, on the other hand, I would expect to bleach the cloth paler, not darker, unless there was a high proportion of lignin in it (like old newspapers). You may remember, however, that I first speculated about this possible dying of the Holland cloth with reference to the high contrast Enrie photos, which seem to show darker areas on the Shroud around the margins of those parts adjoining the Holland cloth.” \nNo chemical analysis therefore to back up your assertion. It was a non-fact, just your opinion and red herring to lead us away from the true facts.\n\n","date":"May 21, 2014 at 11:30 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122663","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"9:27 “Re ‘threadbareness’, Hugh what you make of (sharp) fingernail pressure per cm2? NOTHING.” You’re quite correct there. I do not consider ‘sharp fingernail pressure’ an avenue worth pursuing.”\n– I did not know Bishops’ bare hands had no fingernails and the latter never could be sharp and could not exert any pressure on the shroud.\n– I didn’t know Bishops rings were accident proof as far as shearing and thread tugging were concerned.\n\n","date":"May 21, 2014 at 11:48 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122667","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"I was told traditions was part and parcel of an Englishman not science.\n\n","date":"May 21, 2014 at 11:33 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122664","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"you wrote: “No interweaving is detectable” (in the core of the C14 sample)? The true fact is three textile specialist did detect reweaving.\n\n","date":"May 21, 2014 at 11:51 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122669","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"No. As I understand it they based their replies on the difference between the uniformly thick threads on one side of one of the herringbone ‘spines’ and the variably thick threads on the other side. Fair enough, but had they seen the whole thing they would have realised that the whole shroud is covered in similar areas, some more uniform than others.\n\n","date":"May 21, 2014 at 1:43 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122719","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"You wrote: “Do you seriously think there is not the slightest/foggiest body of evidence to the contrary?” Not at all, and have repeately and publicly said so. There is a lot of interesting but so far inconclusive evidence for reweaving – just not, in my opinion (which I have to say is getting less humble by ther minute), enough to change my mind.” \nSo you have no facts to oppose just your “humble” opinion as non textile specialist.\n\n","date":"May 21, 2014 at 11:54 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122672","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"No. I have mentioned my evidence in detail in the article quoted earlier.\n\n","date":"May 21, 2014 at 1:44 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122722","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"“9:45 “THE other FACT.” “The Shroud was repeatedly sharply bent at both ends each [time] it was stretched for display.” A perfect example of what I suggested in my answer to 9:18 above. Wholly unsubstantiated.”\nI advise you to first reconstruct (as I did) a Turin display for yourself before asserting it is “wholly unsubstantiated”.\n\n","date":"May 21, 2014 at 11:58 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122673","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"No. In order to fray the edges it had to be held, not mounted in a frame. In 1938 a frame was made which was too small for the shroud which therefore had to have its edges folded under to fit. There is no evidence for any such anomaly at any other time.\n\n","date":"May 21, 2014 at 1:46 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122725","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"You totally missed my point.\n\n","date":"May 21, 2014 at 2:12 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122745","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"You wrote: “If the dye was applied to the Shroud, to conceal some invisible weaving, then there wouldn’t be any on the backing coth unless it was attached to the Shroud before the dying process. If the dye was applied to the backing coth to make it look more like the Shroud, then it would have stained the adjacent areas of the Shroud as well. Interestingly, Rogers claims that there was none of his observed coating on his samples of the Holland coth. However, he does not say from where his samples came. Even by my hypothesis, most of the cloth was, of course, completely dye-free.”\nShall I repeat: No chemical analysis to back up your assertion. It is a non-fact, just your opinion (and red herring to lead us away from the true facts).\n\n","date":"May 21, 2014 at 12:04 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122676","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"No. All my suggestions are non-facts, as are all of yours. Evidence is all, and it usually leads to suggestions and inclinations, not 100% convictions.\n\n","date":"May 21, 2014 at 1:48 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122727","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Not all my suggestions are non-facts. Can you read me?\n\n","date":"May 21, 2014 at 2:12 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122744","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"You wrote: “You may remember, however, that I first speculated about this possible dying of the Holland cloth with reference to the high contrast Enrie photos.”\nActually on this blog you were not speculating, you were assertive as if it were a fact.\n\n","date":"May 21, 2014 at 12:08 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122680","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"No. I first speculated about this on 14 January this year – see “Cat among the Pigeons”\n\n","date":"May 21, 2014 at 1:50 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122729","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"…and then you just become assertive so much you thought you were right without any chemical analysis to check how valid was your ‘I think I see’.\n\n","date":"May 21, 2014 at 2:07 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122740","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Reminder for Hugh: you wrote on May 20, 2014 at 6:57 pm\n“That the visible parts of the Holland cloth were dyed to match the shroud:” http://www.holyshroudguild.org/uploads/2/7/1/7/2717873/1309358_orig.jpg.\n“I think I see” is not a fact. How could you be so assertive?\n\n","date":"May 21, 2014 at 12:11 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122681","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"No. The exposed part of the Holland cloth is clearly darker than the unexposed part, recently revealed after the removal of the Raes sample and the C14 sample.\n\n","date":"May 21, 2014 at 1:51 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122731","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"It is not based on a chemical analysis = non-fact.\n\n","date":"May 21, 2014 at 2:03 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122739","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Re  Villarreal’s finding: He revealed that, during testing at the lab, one of the threads came apart in the middle forming two separate pieces.Surprisingly, the two ends of the thread had different chemical compositions, lending credence to the theory that the threads were spliced together during a repair.\n\n","date":"May 21, 2014 at 1:01 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122694","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"No. Villarreal found that both halves of his ‘splice’ were made entirely of cotton.\n\n","date":"May 21, 2014 at 1:52 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122732","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"What about a re-splicing after a cotton broke during spliced reweaving?\n\n","date":"May 21, 2014 at 2:02 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122737","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"typo: a cotton thread.\n\n","date":"May 21, 2014 at 2:21 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122752","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Reminder for Hugh: Splicing, glueing (and dying) are part and parcel of invisible micro-reconstructions…\n\n","date":"May 21, 2014 at 1:09 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122699","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Additional reminder for Hugh: a linen cloth begins breaking and tearing away from the seams. Now it is next to the seam where the Shroud has been repeatedly bent with fingers during hours of display the C14 sample was lift off.\n\n","date":"May 21, 2014 at 1:18 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122705","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"No. The corner pieces give it away. If the Shroud was held by sweaty bishops before the corner pieces were cut away, then it was those pieces that would have frayed, not the main body of the shroud four inches away. If the Shroud was held by sweaty bishops after the corners were cut off, then it was the backing cloth that was held, not the Shroud at all.\n\n","date":"May 21, 2014 at 1:56 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122734","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"You totally missed my point. FIRST reconstruct a pre-1868 Turin Shroud display. The fingers DO clutch the main body of the shroud replica four inches away from the seam.\n\n","date":"May 21, 2014 at 2:18 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122749","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"The seam was used for a better handling of the cloth.\n\n","date":"May 21, 2014 at 2:19 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122751","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Theory is one thing. Practice another.\n\n","date":"May 21, 2014 at 2:25 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122754","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Correction: The fingers DO clutch the main body of the shroud replica as the seam was used for a better handling of the cloth.\n\n","date":"May 21, 2014 at 2:27 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122755","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh, this is well known of textile specialists yet totally unknown to you.\n\n","date":"May 21, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122712","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"And this is a fact of experience.\n\n","date":"May 21, 2014 at 1:32 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122713","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"It is more than 30 years I wear linen.\n\n","date":"May 21, 2014 at 1:37 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122715","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"To Thomas:\n«More importantly how credible is the author Evaristo who claims these statements?»\nDr. Carlos Evaristo is an historian and archaeological researcher and a member of Centro Português de Sindonologia.\nHe has privileged relationship with portuguese Royal House and Italian Royal House of Savoy and he is an expert on study of Christian Relics.\nAs far as I know him, I think he was honest in his statements based on information he obtained from King Umberto’s II testimony and other Savoy’s family members.\nIf this is true indeed, it’s another historical argument to support the invisible mending theory against the validity of 1988 radiocarbon tests.\n                                                                        Antero de Frias Moreira\n                                                                  (Centro Português de Sindonologia)\nP.S. I read his book The Untold Story of the Holy Shroud and he claims that an extant Shroud painted copy brought to Portugal as a dowry by D. Maria Pia of Savoy who married King D. Luiz I in late 19th century had incorporated threads from the real Shroud- I mean the copy kept in «Palácio da Ajuda» in Lisbon.\nAccordingly to an ancient tradition of the Savoy family this practice was done to «sanctify» and give more spiritual value to the painted copies of the Shroud.\nI can ‘t help being puzzled if this is indeed true how much of the original Shroud fabric has been removed through the centuries???\n\n","date":"May 21, 2014 at 1:44 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122721","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Very light, medium, heavy linen.\n\n","date":"May 21, 2014 at 1:44 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122723","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Re fingers clutching the main body of the shroud during bishops’ and canons’ displays with bare hands (the seam being used for a better handling of the cloth). Here is an excerpt from my 2007 paper: \n“Il faut, en effet, savoir que, lors des ostensions et afin de garantir aux observateurs présents la vision la plus parfaite et la plus logique de la double empreinte du Crucifié, la relique était déployée entièrement à l’horizontale. Une bande de couture bourrelée courant sur toute sa longueur avait été confectionnée permettant une meilleure préhension du drap. L’échantillon parent, extrait d’un seul tenant entre 8 à 10 cm du bord supérieur du coin gauche et le long de la couture de repli du tissu sur lui-même, se superposait donc presque parfaitement à la zone où – depuis au moins le XIVe siècle et jusqu’au XIXe siècle – la grande étoffe de lin avait été tenue en tenaille entre le creux de la paume et trois ou quatre des doigts de la main droite de plusieurs générations de dignitaires ecclésiastiques officiant à mains nues.\nAinsi, à cet endroit très précis du drap, la toile, tantôt soumise à de fortes tensions, a des replis et à des pressions répétées d’extrémités onglées plus ou moins coupantes, tantôt exposée aux griffures du chaton des bagues d’évêques et d’archevêques, avait-elle fini, un jour, par être abrasée, accrochée, cisaillée et/ou trouée et faire l’objet d’une (voire même de plus d’une) micro-reconstruction(s) fil à fil invisible(s) à l’œil nu hors examen ad hoc.”\n\n","date":"May 21, 2014 at 2:39 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122761","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Typo: the seam beaded strip was used for a better handling of the cloth.\n\n","date":"May 21, 2014 at 2:51 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122764","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Remarkably, the idea above, that the seam was made in the cloth as a kind of grip, seems to me quite sensible. Not a fact, of course, and without any evidence to support it, but a reasonable idea. I don’t think it would make it more likely to fray the cloth; indeed, I think it would be even more unlikely, but it does make sense of making a seam along that side. If, say, four prelates held the cloth, they would hold it at five points, each point holding about 250g. I don’t that is sufficient weight to tear the cloth away from the seam. Still, a good try.\n\n","date":"May 21, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122777","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"If the prelates spread their hands out evenly, of course, they would hold it at eight points, and the weight each hand would hold would be even less.\n\n","date":"May 21, 2014 at 3:46 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122778","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Re Mme Metchild Flury-Lemberg’s opinion, I commented in a note:\n” 10. – Lorsque l’on sait que de petites reconstructions invisibles à l’œil nu et à la lumière naturelle du jour pouvaient se trouver très circonscrites au cœur même du site de l’échantillon carbone 14 daté, on est pour le moins étonné qu’une experte textile de la valeur de Mme Metchild Flury-Lemberg, sans même avoir jamais examiné de visu ledit cœur de l’échantillon in situ textilis ni avoir pris connaissance de la photographie précise et contrastée d’Enrié, puisse affirmer sans ambages que la texture dudit échantillon était uniforme et intacte. Partant du principe qu’un expert textile se devait d’être très attentif à l’origine (et à la représentativité) des fils qu’il observe, de toute évidence, il demeure difficile pour Mme Metchild Flury-Lemberg d’accepter un seul instant l’idée que des confrères aient pu, juste avant la découpe de l’échantillon brut, ne pas procéder, à l’aide de loupes, compte-fils et binoculaires, à l’examen des fils de chaîne et de trame au cœur même du site de prélèvement.”\n\n","date":"May 21, 2014 at 3:51 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122780","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh you wrote: “Remarkably, the idea above, that the seam was made in the cloth as a kind of grip, seems to me quite sensible. Not a fact, of course, and without any evidence to support it, but a reasonable idea”.\nMost likely the seam beaded strip dates back to the 1st c. CE. It first allowed both the weavers and the TS man’s buriers to grip the cloth.\nShall I repeat: just try to hold totally unfold for display a shroud replica without a seam beaded side-strip and then with one and you ‘ll see the difference especially if you have to hold for an hour. Ever heard of  experimental archaeology?\nShall I repeat: Not only shroud weight per cm2 but also (sharp) FINGER NAIL PRESSURE (not to mention bishops’ and archbishops’ rings) should be taken into account along with these three very facts of experience:\n1/ linen that is repeatedly sharply bent, will eventually break. Its strength is also its weakness.\n2/ a linen cloth begins breaking and tearing away from the seams. Now it is next to the seam beaded side-strip where the totally unfolded/stretched Shroud has been repeatedly bent with fingers at one of its outermost edges for hours of display, the C14 sample was lift off.\n3/ experimentally speaking, the fingers DO grip the main body of the shroud replica as the seam is used for a better grip of the cloth.\nAdvice: FIRST THINK THEN DO as far as experimental archaeology is concerned.\nYou also wrote: “If, say, four prelates held the cloth”. Most if not all of the time they were not four but  only three of them. \nThe facts of experience are on my side. The non-facts on yours.\n\n","date":"May 21, 2014 at 4:22 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122791","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"More than weight, pressure per cm2 and stress are to be taken into account as far as grip is concerned in conjunction with the fingernails.\n\n","date":"May 21, 2014 at 4:38 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122802","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Typo: FIRST THINK THEN DO THEN RE-THINK THEN RE-DO etc.\n\n","date":"May 21, 2014 at 4:24 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122795","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"This is becoming tedious. Max, your facts are unsubstantiated therefore they are not facts but supposition. You have no more claim to certitude than Hugh and no amount of bluster will change that.\n\n","date":"May 21, 2014 at 9:04 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122885","author":"David Goulet","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"My facts are substantiated by experience (mine & others) and my reconstruction of the best way to hold theTS bared handed during an exposition so as to lessen the risk of cramps in the fingers and wrists.\n\n","date":"May 22, 2014 at 4:48 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-123040","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"I think there is very strong evidence that the C 14 portion is chemically different from the main cloth. Hugh believes this is because of a dying attempt to match the Holland cloth to the Shroud, Benford/Marino believe this is because of an invisible French reweave. The testimony of the Savoy family certainly gives credence to the reweave theory. Even if Hugh was right about the stain being done to match the holland cloth this doesn’t necessarily discredit the reweave theory since both could’ve taken place.In all cases the C14 test cannot be trusted in this situation and has to be repeated.\n\n","date":"May 21, 2014 at 9:13 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122895","author":"Mike M","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"I happen to think the reweave theory has legs, but the evidence is not bullet proof as Hugh points out. What I find tedious is Max’s inability to see any point of view beyond his own and his preponderance for patronizing asides (not to mention his refusal to condense his comments into fewer posts). This whole discussion about bishops’ fingernails is bordering on the absurd.\n\n","date":"May 21, 2014 at 10:29 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-122919","author":"David Goulet","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"David you wrote: “This whole discussion about bishops’ fingernails is bordering on the absurd.”\nAre you an experimental archaeologist worth his salt to totally rule out the impact of repeated fingernail (whether sharp or not) pressures  on the linen outermost edge through at least one hundred public private & expositions of the Lirey-Nice-Chambery-Turin Shroud (1355-1860s)? Do you really know what experimental archaeology is all about? I very much dout it.\n\n","date":"May 22, 2014 at 4:43 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-123038","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Thanks, Mike M and Dave G. The two main foundations for my cogitations on the date of the Shroud and in particular the C14 corner are the famous ‘Nature’ paper and Riani & Atkinson’s statistical analysis which appears to demonstrate a chronological gradient across the shroud sample. There is thus room for some variation across the C14 area, which could be caused by the addition of an extraneous substance. To adjust the date from 1st to 13th century requires that most of the C14 sample was from the last few centuries, for which there is no visible evidence even under very high magnification, and very incoherent microscopic evidence. However to establish a chronological gradient over a hundred years or so requires rather less contamination. Any paint, bioplastic coating, surface layer or water soluble contamination (Rogers’s gum) would be removed by the ultrasound, detergent, acic-base-acid cleaning procedure, but I think perhaps Rogers’s dye discovery, adhering rather more integrally to the material, and smeared irregularly across the sample area, could provide the contamination I’m looking for. As I currently reject the reweave idea, I was looking for another reason for a dye being applied to the area when I read comments about the 2002 restoration, where the brightness of the new backing is widely criticised for not fitting the colour of the shroud well enough. I surmised that where the Holland cloth was visible, it might have been smeared with dye shortly after being attached, precisely to mitigate the same problem, and found, in the photograph mentioned above, that the Holland cloth is indeed darker where it is visible than where it is not.\n\n","date":"May 22, 2014 at 3:31 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-123016","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"” To adjust the date from 1st to 13th century requires that most of the C14 sample was from the last few centuries” if there was a reweave that is still possible, especially because we don’t know when the re-weaving took place.\n“there is no visible evidence even under very high magnification”\nThat’s exactly why they call it invisible. Furthermore, three different textile experts, independent of each others, had a different opinion according to Benford/Marino.\nIf we envoke the significance of the microscope here why not for the pollen and dirt evidence that is only visible under the microscope and points towards the authenticity.\n“Any paint, bioplastic coating, surface layer or water soluble contamination (Rogers’s gum) would be removed”\nExactly, that’s why the statistical gradient that you mentioned could not be caused by a surface contamination, the fibres themselves caused the variation in the date of the successive samples.\n“it might have been smeared with dye shortly after being attached”\nThis could happen irrespective of the reweaving, besides the testimony of the Savoy sited above makes sense since the shroud was held from the corners during different expositions and it points towards the re-weaving. Also light darkens Linen, that’s why the shroud is currently kept in the dark, the difference in colour between the exposed part of the Holland cloth and the covered part could be caused by that. Do we know how much a Linen cloth darkens by light exposure over a period of 500 years?\n\n","date":"May 22, 2014 at 7:19 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-123090","author":"Mike M","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"All good points.\nAs I said above, the textile experts worked from a single not terribly clear photo of a tiny portion of the shroud. What they observed was more regular threads on one side of one of the herringbone ‘spines’ than the other. Had they had a chance to examine the whole shroud, they would not have come to the same conclusion. Incidentally, and somewhat damaging to the invisible theory, what was observed by the experts was very far from invisible and clearly pointed out by Joe Marino in his publications.\nSurface contamination I think would be removed. However I think a dye is much more resistant, which is why you can wash paint off clothes without the clothes turning white.\nWas the Shroud ever held by the radiocarbon sample area? Before the corners were removed it was held by them, and after they were removed it was held by the backing cloth replacing them. The radiocarbon corner is not, in fact, a corner at all!\nAs for the effect of light on the Holland cloth, Giulio Fanti, pursuing the ideas of Nathan Wilson, discovered that unbleached cloth became darker by exposure to sunlight, while bleached cloth became lighter. (http://www.dii.unipd.it/-giulio.fanti/research/Sindone/PresWILSON.pdf)\nSoem people, it is true, think the shroud is darkening over the years.\n\n","date":"May 22, 2014 at 12:21 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-123192","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Hugh, I think you are mistaken. The paper you sited (G. Fanti) says the opposite (i.e. bleached linen becomes darker) and the Holland cloth was bleached according to Rogers,\nhttp://www.west.net/~shroud/pdfs/n54part6.pdf\n\n","date":"May 22, 2014 at 8:20 pm","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-123346","author":"Mike M","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"Quite right. My mistake. Dark cloth (unbleached) gets lighter and light cloth (bleached) gets darker. How to quantify this over years is difficult to assess.\n\n","date":"May 23, 2014 at 11:37 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-123611","author":"Hugh Farey","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"This speaks volume on how reliable your alleged “scientific opinion” is as far as the Holland backcloth dying is concerned.\n\n","date":"May 23, 2014 at 11:45 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-123619","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Documented Pieces Removed from the Shroud","post":"This book “The Untold Story of the Holy Shroud” is not a published book, and it is impossible to order it. If someone knows how to get a copy (in any form) of it, let me know, please\n\n","date":"June 2, 2014 at 6:31 am","url":"https://shroudstory.com/2014/05/20/documented-pieces-removed-from-the-shroud/","cat":"carbon_14_dating","id":"comment-126257","author":"Andrea Nicolotti","site":"shroudstory"}]
