[{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I haven’t read this paper yet, but first, and fundamental question that comes to my mind:\nDid the authors of this paper have performed examination of original Shroud C-14 samples, like Rogers did?\nIf it is the same kind of Shroud “science” like Garlaschelli presents with his “reproductions” of the Shroud, tan it’s likely a trash.\nI am under impression that our sceptical friends are trying to discredit the whole Shroud science, by producing carefully prepared nonsense, and sending them to peer-review journals for publishing (to have some arguments for propaganda purposes). Although those journals are peer-revieved, I suppose the revievers have actually little knowledge about the Shroud.\nThat means, even what is in peer-reviewed journals, isn’t a guarantee of good science.\n\n","date":"September 4, 2015 at 1:40 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209599","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"To give an example:\nCRAIG, Emily A. and BRESEE, Randall R. – Image Formation and the Shroud of Turin  http://www.shroud.com/pdfs/craig.pdf\nAlthough published in peer-review  Journal of Imaging Science & Technology, actually it has been completely dismissed by all Shroud science as a nonsense (and right!).\n\n","date":"September 4, 2015 at 1:47 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209600","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I’m not a chemist, so, at first glance, I’m being disturbed by some of their references: they don’t mention Benford and Marino’s article on discrepancies in the radiocarbon dating area published in Chemistry Today, but they quote their first papers already mentioned by Rogers in 2005? Why (real question, no irony)? Is it because Quad mosaic analysis doesn’t fit well with their sentence:”Among those [theories], a popular one is the so called “invisible mending”, disclosed by S. Benford and J. Marino and based on the analysis of low resolution (JPEG format) pictures of the Shroud”?\nThey don’t want to engage with other confirmations (Villarreal), they don’t want to mention other results (Riani’s article in Statistics and Computing).\nBy the way, I hope that this editorial was not reviewed by a historian… Look at the “medieval” title, and look at this sentence: “According to these authors [Benford and Marino], the part of the Shroud from where a C14 sample was obtained does not belong to the main linen, but is a Middle Age addition which precisely matches the kind of weaving, and moreover has been painted to exactly match the color of the main Shroud. ”\nBut of course Benford and Marino, in  the same paper quoted by Bella et alii, deal explicitely with the art of tapestry in the Renaissance. They knew the difference between the Middle Ages and the Renaissance… It’s not so difficult to grasp ;)\nSo, why was “medieval” added in the title, when it’s not even in the quotation given above (just “invisible mending”)?\n\n","date":"September 4, 2015 at 2:09 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209601","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"From the short extract presented by Dan (have you read the whole article?):\n   In conclusion, the unspecific qualitative chemical tests presented by Rogers are in no way confirmed by instrumental analysis (mass spectrometry). No diagnostic peak in the pyrolysis mass spectra indicates a significant difference in the two samples, besides hydrocarbon-derived contamination. Therefore, none of the presented data supports the conclusion by Rogers.\nHave Garlaschelli et al. performed any tests (on what)?\nHave Garlaschelli et al. performed mass spectrometry (of what)?\nHave Garlaschelli et al. considered all the arguments presented by Rogers in his paper?\nHave Garlaschelli et al. detected any contaminant in C-14 corner, that Rogers haven’t found (what kind of contaminant? By what tests?).\nOr maybe Garlaschelli et al. they found some slight weakeness, or inexactness, in one  of the arguments Rogers presented in his paper, and exploited it, pretending that they have “debunked” Rogers?\nThese questions need answers before we go any further.\n    The work of the late Dr. Rogers has been exploited to support a pseudoscientific hypothesis which is in no way confirmed by the reported data. Regardless of the debate on the hypothetical authenticity of the Shroud, the scientific community and the general public can only be misled by this paper.\nB%##&*t!\n\n","date":"September 4, 2015 at 2:36 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209602","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I have an access to Thermochimica, fortunately, and I can say that for all the questions (except the last “Or maybe Garlaschelli et al. they found some slight weakeness, or inexactness, in one of the arguments Rogers presented in his paper, and exploited it, pretending that they have “debunked” Rogers?”) I presented in post from  September 4, 2015 at 2:36 pm, the answer is NO!\nGarlaschelli et al. haven’t refuted Rogers.\n\n","date":"September 4, 2015 at 2:48 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209605","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Sorry guys for spamming, but this is such a scam, one could only expect from the sceptical guys like Garlaschelli, Nicolotti and Rinaldi.\nThe only thing Garlaschelli et al. did, was to send editorial to “Thermochimica” saying they disagree with interpretation of Figs. 4-5 from Rogers work, disregarding all other arguments Rogers presented. And based on that, they immediately jump to the conclusions, claiming that the Rogers has been discredited (if you look closely at their wording, they only say that one single argument has been discredited, but this is still only their opinion).\nAnd the last paragraph with invectives… have “Thermochimica” really passed that?\nThis is the “science” of those sceptical bastards!\n\n","date":"September 4, 2015 at 3:25 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209607","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear all,\nThank you for discussing our work. I am a chemist and I work also with mass spectra. The paper by the late Rogers was published in 2005 on Thermochimica Acta, which is a journal specialized in thermal analyses. Rogers reported two pyrolysis mass spectra. Do his data support the “mending” hypothesis?  I would strongly suggest to take the original Rogers’ paper, bring it to someone which can read mass spectra and listen to the answer. Or wait few days. I will explain this work in my blog.\nWith kind regards,\nMarco Bella\n\n","date":"September 4, 2015 at 3:15 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209606","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I have just purchased this article.\nI have to read it carefully  and compare it with Rogers’ data shown in detail in “A chemist’s perspective on the Shroud of Turin”.\nBut for now, in 2 minutes, I’m able to see at least one INCREDIBLE error.\nFig.1 in this “paper” is EXACTLY Fig. VIII-3 in Roger’s book: “The mass spectrum obtained from the pyrolysis of fibers from shroud image sample 1EB (Rogers).\nSample 1EB comes from an image area (no scorch, no water, NO BLOOD). \nHowever, the authors wrote  in the figure: ” Peak at mass=131 (supposedly hydroxyproline).\nThis is the most abundant ion in the mass spectra and according to Rogers, correlated with animal proteins (blood spots?).”\nIt is simply FALSE. Rogers never said that for good reasons: this spectrum is that of sample 1EB which comes from an image-only area (no scorch, no blood, no water). See the matrix of samples p.53 of Rogers book.\n” Hydroxyproline’s signal at m/e 131 appeared very early in the pyrolysis of the Zinna samples that showed distinct red spots on the fibers” wrote Rogers.\nThe Zinna sample ( “Zinna heel”) comes from an image+BLOOD area!\nNothing to do with Sample 1EB.\nThis incredible error itself is sufficient to debunk this so-called scientific paper.\nI’ll send an email to TCA, asking them NOT to publish this infamous “paper”.\n\n","date":"September 4, 2015 at 3:50 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209609","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"The email of the editor, which can be found on the web, is: christoph.schick@uni-rostock.de\nI would suggest reading Rogers paper carefully before writing…\n\n","date":"September 4, 2015 at 4:17 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209611","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hello Marco,\nI have Rogers’ paper since 2005.\nFig.4 in his TCA paper shows “a mass spectrum from the pyrolysis of a shroud-image fiber..”\nIt is Fig.1 in your paper, as you wrote yourself.\nHow can you write that in this figure peak at mass 131: ” according to Rogers, [is] correlated with animal proteins (blood spots?)” while Rogers clearly wrote that this 1 EB sample was a pure image-only sample (without blood etc..). \nFrankly, I do not understand such a mistake.\nThank your for giving me the email of the editor.\n\n","date":"September 4, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209618","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Thibault,\nI cannot see what you consider a mistake. Rogers wrote in his TA paper:\n—————–\n…Incidentally, the pyrolysis/ms spectra of samples from apparent blood spots showed hydroxyproline peaks at mass 131, a pyrolysis product of animal proteins…\n———————\nSo, according to Rogers the peak at m=131 is present:\n-in the spectra of the image fibers, where there are “apparent blood spots”.\n-in the spectra of the image fibers, taken where there is image only.\nAs correctly pointed out by Hugh, in the spectra from Raes sample one can also see the peak at M=131 as the major peak, not considering the contaminant.\nTherefore, the peak at m=131 is present on all samples supposedly coming from the Shroud. Try to draw a conclusion from this information.\n\n","date":"September 6, 2015 at 5:32 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209712","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Marco,\nThe problem with Rogers (RIP) is that his reasoning is often difficult to follow, due to his “style” of writing.\nThat’s why it’s always necessary to read what he wrote about the same subject in different papers in order to avoid false interpretations. \nLet me explain:\nThe sentence: “Incidentally, the pyrolysis/ms spectra of samples from apparent blood spots showed hydroxyproline peaks at mass 131, a pyrolysis product of animal proteins”\nis the only allusion to hydroxyproline (and blood) in the entire Rogers’ TCA paper. Moreover, the term “incidentally” is important. \nYou are right: peak 131 is found in all of the samples analysed.\nHere is what Rogers wrote re the “problem” of peak 131 and hydroxyproline (from “A Chemist’s Perspective on the Shroud of Turin”, p.56-57):\n” When animal proteins are heated, a major pyrolysis product is 4-hydroxyproline. Hydroxyproline’s signal at m:e 131 appeared very early in the pyrolysis of the Zina samples that showed distinct red spots on the fibers…Indeed m/e 131 was the major organic pyrolysis product detected between masses 100 and 150 at the lowest temperature that gave any detectable products (figure VIII-7)”\nFig VIII-7 (Zina sample) shows an almost empty spectrum, with peak 131 intensity at about 20% and only 5 other signals less than 10%).\nHe adds: ” Mass 131 peaks appeared AT MUCH HIGHER TEMPERATURES in all of the spectra, but those are in the ranges where cellulose, lignin, and hemicelluloses are decomposing.\nThe spectrum gets very complex at those higher temperatures.\nNone of the images fibers, control fibers, or Raes fibers showed mass 131 at low temperatures. Although mass 131 products can appear from materials other than animal proteins, if animal proteins are present mass 131 MUST appear in the pyrolysis products. The lower the temperature at which mass 131 appears, the more likely it is a result of the pyrolysis of an animal protein”.\nThe interpretation of Rogers is now absolutely clear: Rogers pointed out the different meanings of peak 131, taking into account the temperatures.\n– In the Zinna (blood) sample it is probably ( please note that he is speaking of high probability) a protein\n– In all the other samples, Rogers clearly interprets pic 131 as a decomposition product of the material itself (…”but those are in the ranges where cellulose, lignin and hemicelluloses are decomposing..”)\nWhat is your mistake? In the sentence in your Fig.1, which is the spectrum of a Shroud-image fiber, “that was taken when the first decomposition products started to appear over a sample of image fiber” wrote Rogers (“A chemist perspective…”, p.54).\nYour sentence: Peak at mass=131 (SUPPOSEDLY HYDROXYPROLINE). This is the most abundant ion in the mass spectra and according to Rogers, correlated with animal protein (blood spots?)”.\nNo in this spectrum and the others, Rogers did NOT say that peak 131 is correlated with hydroxyproline.\nIn fact, he wrote exactly the contrary !\nI hope I am clear enough. I can’t do more.\n\n","date":"September 6, 2015 at 8:31 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209724","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hi Thibault. I think your defence of Rogers is brave, and possibly true, but not very convincing. Why, I ask myself, in this paper, does he refer to Peak 131 at all? So that readers will be directed to a book he has yet to write, in order to explain away the massive 131 peak in his Diagram 1, which in the actual paper he mentions as typical of blood? It doesn’t make sense. Let us suppose he wrote:\n“Incidentally, the peak at Mass 131, which can usually be attributed to an animal protein derivative such as blood, is in this case a typical decomposition product of cellulose, hemicellulose and lignin when heated to a high temperature.”\nNow that would have made sense. But he didn’t.\n\n","date":"September 6, 2015 at 9:51 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209731","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hi Hugh,\nAs I wrote, this is a problem that is found in almost all of Rogers’ papers: he includes here and there some thoughts and sentences that are not fully relevant in the context.\nHere, this short sentence about blood and hydroxyproline which has nothing to do with his main demonstration.\nYes it would have been better for Rogers not to write this sentence in his TCA paper.\nNevertheless, as I wrote earlier, even if one has no knowledge of the clear explanations found in Rogers book, something very simple must come immediately to the mind of the reader of Rogers’ TCA paper: if peak 131 is only associated to hydroxyproline/protein/blood how is it that it is found in the two spectra (image fiber and Raes sample, both without blood) shown in his paper?\nThis alone, should be enough for the reader to understand that there is something wrong in this reasoning.\nAnd then, if this reader does really want to truly understand Rogers, he has to do what I did: to try to find a clear explanation in all of Rogers’ papers, including his book.\nApparently, this work has not been done made by the authors.\nI repeat: Rogers never thought and never wrote that peak 131 in the MS spectra are related to hydroxyprolin, except in the Zina sample spectrum only at the lowest temperature.\n“Possibly true?” “Not very convincing?”\nReally?\nWith all the proofs I gave, how can you write that ? \nWhere are you going Hugh?\n\n","date":"September 6, 2015 at 11:32 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209740","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Your explanation is generous, Thibault, but does nothing to enhance your previous comment. As I noticed earlier, Dr Kohlbeck extracted at least two possible blood particles from Slide 1EB, the very one with the big Mass 131 peak. There may have been others.\nFurthermore, as I discovered only this afternoon (see a comment to Marco Bella below), in his “Pyrolysis/Mass Spectrometry Applied to the Shroud of Turin” article at shroud.com, Rogers refers to Diagram 1 as “low temperature”, and so the Mass131 product which so dominates it can not be attributed to the high temperature pyrolysis of cellulose etc. that he says also produces it, but, as you quoted above; “The lower the temperature at which Mass 131 appears, the more likely it is a result of the pyrolysis of an animal protein”. I wonder what it could be.\n\n","date":"September 6, 2015 at 12:24 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209744","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Sorry Hugh but your answer is not an answer.\nI wrote: “Rogers never thought and never wrote that peak 131 in the MS spectra are related to hydroxyprolin, except in the Zina sample spectrum only at the lowest temperature.”\nDo you agree, yes or not?\n\n","date":"September 6, 2015 at 1:02 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209750","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I honestly don’t know what he thought, Thibault. In his 2004 paper he doesn’t mention Hydroxyproline. He labels Diagram 1 “Mass spectrum obtained from a low-temperature pyrolysis of Shroud image sample 1EB.”\nIn A Chemist’s Perspective, he says: “Figure VIII-3 [Diagram 1] shows a mass spectrum that was taken when the first decomposition products started to appear over a sample of image fibers.” This cannot be the high temperature decomposition he referred to later as “Mass 131 peaks appeared at much higher temperatures in all of the spectra, but those are in the ranges where cellulose, lignin, and hemicelluloses are decomposing.”\nSo what did he think the Mass 131 peak was in the low temperature Diagram 1? And why did he not mention it? I really don’t know. Could he really not have noticed it at all?\n\n","date":"September 6, 2015 at 1:34 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209753","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Thibault,\nThe editorial only commented on what it is written on Rogers’ TA paper. If he wrote something different somewhere else, this is irrelevant. One of the key problems is that the peak at m=131 is present on both spectra. The other problem is the peak at m=96, which is clearly a contaminant. I am not interested in what was in Rogers’ mind because we will never know. I am interested in the data which can be verified and support the “mending” hypothesis. At the moment, none.\n\n","date":"September 6, 2015 at 4:51 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209763","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Marco,\nif it is your choice to deliberately refuse to understand the meaning of a single “out of context” sentence, despite all the proofs I gave, this is a serious ethical problem.\nBut it is your problem.\nYou wrote:”One of the key problems is that the peak at m=131 is present on both spectra”\nWhy is it a problem ?\nIf peak at m=131 is related to one of the more abundant decomposition product of linen, where is the problem?\nDid you look at PyMS databases for cellulose, hemicellulose, lignin ..?\nYou wrote: “The other problem is the peak at m=96, which is clearly a contaminant”.\nBut this is exactly what Rogers found.\nYou criticize Rogers’ reasoning but at the end your conclusion seems to be similar, except for the nature of the contaminant.\nCan you explain in detail ?\nThibault.\n\n","date":"September 7, 2015 at 2:24 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209839","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"So, Marco, when you wrote your paper, you never studied Rogers’ writings in A chemist’s Perspective, because, according to you, your editorial was focused on Rogers’ article in TA and therefore Rogers’ book was “irrelevant”?\nI’m not sure this argument based on a serious lack of research is good for your case.\n\n","date":"September 7, 2015 at 1:01 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209795","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Tristan,\nI have not written a biography of Rogers. I have written an editorial to explain why his interpretation of mass spectra is completely wrong, and the data he presented shows that the two mass spectra from the two samples (Raes and Main Shroud) are in fact quite similar rather than different. When evaluating a scientific paper, the analysis must be limited to what is actually written or referenced in the paper. The “ideas” of the author written somewhere else (specifically, a book which did not pass any peer-review) are of no significance for our editorial. I just focus on the reported data in Rogers’ TA paper This is how science works.\n\n","date":"September 7, 2015 at 12:16 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209829","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Marco, I don’t want be too harsh, but before writing on a topic, even for an “editorial”, you have to be at least familiar with it. Otherwise it looks much more like a lampoon than an editorial.\nYour “medieval” blunder is horrific and demonstrates that you don’t know the topic in and out, to say the least.\nYour misintepretation of the data in a paragraph was easily detected within a couple of minutes by Thibault. Why? Because he knows the topic in and out.\nI guess that before this week you never opened Rogers’ book…  This not how serious science works: You should have been more familiar with the bibliography. It’s the beginning of all serious research, or all good editorial in a peer-review.  Mi dispiace.\n\n","date":"September 7, 2015 at 12:51 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209832","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Thibault,\nI cannot say which is exactly the contaminant in the Raes sample (A hydrocarbon? Material from tapes?) but surely there are in the spectra peaks which should not be there. Let’s take the peak at 96. Rogers believed that it is furfural:\n————\n…When the first pyrolysis products appeared during heating, the Raes fibers showed a signal for furfural at mass 96…\n—————\n  Actually, it is very clear that it is not furfural, but a peak arising from the decomposition of the contaminant.\nRogers took two spectra. He saw some differences, but these differences are just due to contamination in the Raes sample, not to dissimilar composition of the samples.\n\n","date":"September 7, 2015 at 4:52 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209848","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Marco,\nI wrote: “Dear Marco,\nif it is your choice to deliberately refuse to understand the meaning of a single “out of context” sentence, despite all the proofs I gave, this is a serious ethical problem.\nBut it is your problem.\nYou wrote:”One of the key problems is that the peak at m=131 is present on both spectra”\nWhy is it a problem ?\nIf peak at m=131 is related to one of the more abundant decomposition product of linen, where is the problem?\nDid you look at PyMS databases for cellulose, hemicellulose, lignin ..?\nYou wrote: “The other problem is the peak at m=96, which is clearly a contaminant”.\nBut this is exactly what Rogers found.\nYou criticize Rogers’ reasoning but at the end your conclusion seems to be similar, except for the nature of the contaminant.\nCan you explain in detail ?\nThibault.”\nYour answer:\n“Dear Thibault,\nI cannot say which is exactly the contaminant in the Raes sample (A hydrocarbon? Material from tapes?) but surely there are in the spectra peaks which should not be there. Let’s take the peak at 96. Rogers believed that it is furfural:\n————\n…When the first pyrolysis products appeared during heating, the Raes fibers showed a signal for furfural at mass 96…\n—————\nActually, it is very clear that it is not furfural, but a peak arising from the decomposition of the contaminant.\nRogers took two spectra. He saw some differences, but these differences are just due to contamination in the Raes sample, not to dissimilar composition of the samples”.\nCompare my questions and your answers.\nYou did not answer at all to my questions.\nPic at mass 131: no answer.\n“Did you look at PyMS databases for cellulose, hemicellulose, lignin ..?”: no answer.\nYour last sentence is particularly strange: ” Rogers took two spectra. He saw some differences, but these differences are just due to contamination in the Raes sample, not to dissimilar composition of the samples”.\nBut it is exactly what Rogers wrote: contamination in the Raes sample.\nWhat do you mean exactly by “dissimilar composition of the samples”, assuming that it is you interpretation of Rogers ?\n\n","date":"September 9, 2015 at 3:01 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209988","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Tristan,\nYou might be right that the word “medieval” is not fully appropriate in the title. It might give the impression of not ruling out the possibility that the mending has been executed at another time, while there is actually no evidence of whatsoever mending. \nAnyway, the “medieval” term, and specifically “medieval patch” has been largely used by Benford and Marino.\n“…In light of the compelling evidence that we are about to present, we believe that the theory that the Shroud has literally been patched with medieval material from the 16th century…”\n.. However, one also needs to find chemical differences to support the theory of a medieval patch..”\n“…Note the correlation between the angle of what appears as the patch of medieval material spliced into the original weave, and what Walsh has portrayed statistically…”\n“..The second is the more pronounced discoloration extending only into the area that we have designated as the medieval patch…”\n“..Starch was, in fact, used by medieval restorers for invisible mending…”\nhttps://www.shroud.com/pdfs/marben.pdf\nSince they first used this term to describe their theory, I feel it is correct to keep it, even if there is no evidence at all to support this pseudoscientific hypothesis and the term might be not fully appropriate.\n\n","date":"September 8, 2015 at 2:48 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209869","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"The Middle Ages is generally considered to have been between the 5th and 15 centuries and the Early Renaissnace is generally considered between the 14th and 17th centuries, so there is actually a bit of an overlap.  So, I don’t think the use of “medieval” is a huge issue here.  Regarding the invisible mending being a “pseudoscientific hypothesis,” I will post something this evening.\n\n","date":"September 8, 2015 at 5:38 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209876","author":"Joe Marino","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Marco:\neven if there is no evidence at all to support this pseudoscientific hypothesis \nOh, really? Then why the title of the editorial is:\nThere is no mass spectrometry evidence that the C14 sample from the Shroud of Turin comes from a “medieval invisible mending”.\ninstead of simply \nThere is no evidence that the C14 sample from the Shroud of Turin comes from a “medieval invisible mending”.\nwithout bolded words? Why did you need to insert them?\nOr maybe there is some other evidence, besides disputed mass spectrometry?\nRogers wrote in his TCA paper (p. 193):\nThe combined evidence from chemical kinetics, analytical chemistry, cotton content, and pyrolysis/ms proves that the material from the radiocarbon area of the shroud is significantly different from that of the main cloth. The radiocarbon sample was thus not part of the original cloth and is invalid for determining the age of the shroud.\n\n","date":"September 8, 2015 at 3:39 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209871","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Dr. Thibault Heimburger\nShroud scholars like you who seeks the truth, and explains in a comprehensive way the fallacies of a paper that most of us have no scientific background to rebutt SHOULD BE PRAISED.\nI hope to read soon your next response to the Editor of TCA\n                                                                warmest regards\n                                                           Antero de Frias Moreira\n                                                    Centro Português de Sindonologia\n\n","date":"September 7, 2015 at 2:30 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209840","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Just to be sure, Marco, even after reading Rogers’ book pp. 53-54 (google books is your friend), do you still maintain that you are correct?\nBecause I tend to think that Thibault is right. It seems to me that your medieval blunder is maybe not the only one…\n\n","date":"September 4, 2015 at 4:54 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209612","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Tristan,\nThe title of the paper is “There is no mass spectrometry evidence that the C14 sample from the Shroud of Turin comes from a “medieval invisible mending” (no question mark at the end) and yes, it has been peer-reviewed and already accepted for publication. The title hints that the paper might discuss mass spectrometry. Read carefully what Rogers wrote. Read what I wrote (better if for more than two minutes…). After that, I am happy to answer to any question.\n\n","date":"September 4, 2015 at 5:17 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209616","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"No tricky games.\nWhat about cotton? What about dye? What about vanillin?\nClaiming that a couple of figures from Rogers can be interpreted different way, and suggesting that the Rogers is wrong because of that (wrong in the whole, not some minor details) is really a low blow.\n\n","date":"September 4, 2015 at 5:24 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209617","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Science is not my field but I’ve noticed that one peer-reviewed paper dismisses another peer-reviewed paper, which, in turn, can be dismissed by another peer-reviewed paper…\nThat’s how it goes it seems. At least we know that “peer reviewed” only means that the paper is worth considering, not that it is gospel truth.\nIt appears that new evidence has been found, supporting not a fifteenth-century but a thirteenth-century patch, which goes to say that Dr.Mechthild Flury-Lemberg did not examine enough, so we might expect something in the near future:\nhttps://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"September 4, 2015 at 6:00 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209619","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I too have both papers, and I am not sure how comparable the two mass spectrographs are. The first diagram shows, as Rogers captioned it: “A mass spectrum obtained from the pyrolysis of a shroud-image fiber,” and the second ” A mass spectrum from the low-temperature pyrolysis of fibers from a Raes sample.” I do not know why Rogers omitted a temperature qualification from the first diagram. Nevertheless, some comments are valuable.\n– The first diagram shows an small amount of furfural (Mass 96, about 5 on the y-scale), and a significant amount of hydroxymethylfurfural (Mass 126, about 20 on the y-scale). The presence of both these compounds is attributed to the decomposition of cellulose.\n– The second diagram shows a significant amount of furfural (Mass 96, about 10 on the y-scale), and no hydroxymethylfurfural (0 on the y-scale). This he attributes to the presence of a significant amount of pentosan.\n– The implication is that the second diagram shows the composition of the sample at a lower temperature than the sample shown in the first diagram, as it shows no products from the decomposition of cellulose. It would have been better to show the two diagrams as at the same temperature.\n– The first diagram shows an enormous peak of Mass 131 (Over 100 on the y-scale). The second diagram shows a rather smaller peak (about 35 on the y-scale). Rogers’s only mention of Mass 131 is to say “Incidentally, the pyrolysis/ms spectra of samples from apparent blood spots showed hydroxyproline peaks at mass 131, a pyrolysis product of animal proteins.” Marco Bella is thus surely justified is saying the Rogers “identifies the peak at mass=131 as hydroxyproline, a hypothesized pyrolysis product of animal proteins.” Unless there is another reason for the peak at 131, Thibault’s announcement “It is simply FALSE. Rogers never said that for good reasons” cannot be justified. Perhaps Rogers admitted of a ‘blood spot’ even on an ‘image’ fibre.\n– The first diagram shows significant peaks (>30 on the y-scale) at Mass 69 and 181. It is a pity that Rogers does not discuss these. The second diagram a succession of decreasing peaks at 56/58, 69/71, 83, and 97 (but note that the x-scale does not go further than 150 on this diagram), which Marco Bello shows is consistent with the decomposition of a hydrocarbon. If these peaks are removed from the second diagram, there is indeed little to distinguish it significantly from diagram one.\n– It is important to recognise that this article only addresses Rogers’ spectrographical comments, not his chemical tests, and I think Rogers’s supporters are correct to feel that Marco Bello’s final conclusion (“The work of the late Dr. Rogers has been exploited to support a pseudoscientific hypothesis which is in no way confirmed by the reported data.”) is unjustified except in this particular aspect.\nMoving on a little, OK asks, with some justification “What about cotton? What about dye? What about vanillin?” I have been thinking about the vanillin, and in particular Rogers’s comment regarding its decay: “However, some reasonable storage temperatures can be considered to give a range of predicted ages. If the shroud had been stored at a constant 25°C, it would have taken about 1319 years to lose a conservative 95% of its vanillin. At 23°C, it would have taken about 1845 years. At 20 ◦C, it would take about 3095 years.” These figures were derived by direct extrapolation of his version of the Arrhenius equation as it applies to vanillin. By an exactly similar extrapolation, we find that if the temperature was 140°C it would have taken 2 minutes. This means that if the Shroud were ever in a box which became heated to extent that silver melted, there would be no vanillin present, regardless of how recently it had been made. Even if the Raes sample was actually from a piece of modern cloth, the vanillin evidence from the rest of the Shroud does not permit the conclusion that “the cloth must be quite old.” (Whatever that means!).\n\n","date":"September 5, 2015 at 4:07 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209640","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Sorry Hugh, i’m not convinced so far (quite the contrary).\nI think the first diagram does not come from blood area. Rogers is 100% clear in his book. \nRogers, Achemist’s perspective, p. 54: “Figure VIII-3 [figure 4 in Thermochimica acta] shows a mass spectrum that was taken when the first decomposition products started to appear over a sample image fibers. The sample appears to be nearly pure polyhexose material, e.g. cellose. There is a significant peak at m/e 126 (hydroxyméthylfurfural) but there is not much at m/e 96 (furfural). The shroud is nearly pure linen, but linen is not pure celluose like cotton”.\nThe legend of diagram: “Mass spectrum obtained by from the pyrolisis of sugars from Shroud image sample 1EB. The sample didi not contain any pentose sugars”. \nAs already stated by Thibault, Rogers explicitly writes that sample 1EB comes from a image area, with no blood, no schorch, no water (p. 53).\nhttps://books.google.fr/books?isbn=0615239285\n\n","date":"September 5, 2015 at 5:29 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209644","author":"Tristan Casabianca","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I agree – I agreed above – that sample 1EB was identified as ‘image’. However, its spectrograph contains a massive Mass 131 spike which Rogers elsewhere identified as derived from animal protein, specifically similar to that derived from ‘apparent blood spots.’ If the Mass 131 spike on slide 1EB, nor the similar spike on the Raes sample, is not from an ‘apparent blood spot’ then what animal protein would he, you or Thibault identify it with? A collagen paint binder perhaps?….\n\n","date":"September 5, 2015 at 7:30 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209649","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"La HIDROXIPROLINA puede ser el testimonio de la presencia de ORINA (URINE) en el cuerpo real del Hombre crucificado tras ser sometido a un violento castigo, flagelación.\n1-La contracción muscular excéntrica es MÁXIMA en un crucificado.\n[Se conoce bien en “la Medicina Deportiva”:\n“La contracción excéntrica genera tensiones elevadas en el músculo cuya repetición en una persona no entrenada provoca la ruptura de estructuras musculares, en la unión músculo-tendinosas y en los tejidos conjuntivos”(Miñarro 2002), y está asociado con verdaderas lesiones musculares” (Wilmore y Costill 2000) Al respecto, Quinn (2005), Cheung y col (2003), hablan más específicamente de micro-roturas musculares.]\n2-La flagelación provoca MULTITUD de micro-roturas musculares, tanto por la acción directa del “flagrum” como por la acción indirecta, violentas contracciones musculares, a consecuencia del dolor.\nCarlos\n\n","date":"September 5, 2015 at 5:52 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209680","author":"Carlos","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Thank you, Carlos. that at least makes sense, although it implies that proteinaceous derivatives should be found all over the body, which Heller and Adler were at at pains to refute. Hydroxiproline is also a major component of collagen.\n\n","date":"September 6, 2015 at 2:24 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209702","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"“….although it implies that proteinaceous derivatives should be found all over the body”\n“…although it implies that proteinaceous derivatives should be found all over the body..”\n¡Por qué! \nLa hidroxiprolina, presente en la orina (“urine) SÓLO aparecerá allí donde la “urine” haya manchado la PIEL.\n……………………………………………………………………….\n…\n“The purpose of this study was to investigate the degree of catabolism of collagen as measured by levels of urinary excretion of hydroxyproline (HP) after static stretching exercise.\nStudy participants were 37 firefighters from the 1st GMAR of the State of Rio de Janeiro of the male gender, who are doing regular physical training, = + 29 years old, divided into two groups: control group (n = 17) which has not undergone any type of intervention and the experimental group (n = 20) which was submitted to static stretching exercise.\nAs a methodological procedure was performed 4 urine samples for each individual.\nThe first collection was performed before the procedure to verify the level of HP as reference of the sample group (basal).\nThe second, third and fourth collections were performed 24h, 48h and 72 hours after stretching static, with a fasting of 12 hours before sampling.\nFor the determination of urinary levels of HP, was used ClinRep (complete kit for hydroxyproline in urine) by the method colorimetric. The results found on the levels of HP: ∆ basal-24h=1,99 mg/24h. ; ∆ 24h-48h= 9,01 mg/24h ; ∆ 48h-72h= – 9,90 mg/24h e ∆ Basal-72h= 1,09 mg/24h. For the results it is concluded that there was a difference in the concentrations of HP between the baseline and 24h (p = 0,001 <0.05), with a significant increase in 48h (p = 0,001  0.05), matching it to the original level of the basal time, thereby determining that HP may be a biochemical index in the process of tissue repair and remodeling after exercise. Key words: Flexibility. Static Stretching. Hydroxyproline. “ASSESSED URINARY LEVELS OF HYDROXYPROLINE 24, 48 AND 72 HOURS AFTER MAXIMAL STRECHING EXERCISE” .2011\n“This study aimed to evaluate the effect of intensive dynamic flexibility (FD) on the tissue being using as an indicator the hydroxyproline´s concentration (HP) in urine. The sample comprised 64 men (18.6 ± 0.5 years; 175.97 ± 5.81 cm. and 66.74 ± 8.88 kg.) randomly divided into two equal groups: flexibility (FG) and control (CG). FD work was made in three series for each movement with interval of five seconds. First performed flexion and extension of the shoulder joint, then proceeded the same way the hip joint. Were performed three urine collected before exercise (initial), 24 and 48 hours later. The Friedman test presented a significant increase of HP at 24 hours in comparison with basal levels (% = 23.7%, p  0.8 (d = 1.14, and r = 0.50). It was concluded that the FD exercises are very intense because they cause tissue injury until 24 hours after application, requiring 48 h for recovery.\nKey-words: Hydroxyproline. Muscular stretching exercises. Military personnel. Conective tissue. Collagen. “EFFECT OF A DYNAMIC FLEXIBILITY TRAINING ON HYDROXYPROLINE CONCENTRATIONS OF ACTIVE MILITARY MEN”\nCarlos\n\n","date":"September 6, 2015 at 4:37 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209709","author":"Carlos","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"….. I think that FORGETS (Rogers and Colin included) that the high numbers of hidroxiprolina are in the “URINE”, not  in the blood.\nCarlos\n\n","date":"September 6, 2015 at 5:26 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209711","author":"Carlos","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"As urine is a solution of number of breakdown products, including those from proteins, the presence of hydroxyproline in urine is neither surprising nor denied. What is less certain is that hydroxyproline is emitted in sweat, which is not urine, although it does contain uric acid or urea. Uric acid, urea and hydroxyproline are distinct chemicals, and the presence of one does not necessarily imply the presence of the others. Identifying hydroxyproline at any particular point on the Shroud does not demonstrate that it was derived from sweat. It is a breakdown product of many proteins, including blood and collagen. Rogers specifically referred to it possibly deriving from “apparent blood spots.”\nSo although you may be correct that the presence of morbid sweat implies the presence of hydroxyproline, it cannot be said that the presence of hydroxyproline demonstrates the presence of sweat. The paper quoted above is irrelevant in this context.\n\n","date":"September 6, 2015 at 7:09 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209720","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hugh:\nI have been thinking about the vanillin, and in particular Rogers’s comment regarding its decay: “However, some reasonable storage temperatures can be considered to give a range of predicted ages. If the shroud had been stored at a constant 25°C, it would have taken about 1319 years to lose a conservative 95% of its vanillin. At 23°C, it would have taken about 1845 years. At 20 ◦C, it would take about 3095 years.” These figures were derived by direct extrapolation of his version of the Arrhenius equation as it applies to vanillin. By an exactly similar extrapolation, we find that if the temperature was 140°C it would have taken 2 minutes. This means that if the Shroud were ever in a box which became heated to extent that silver melted, there would be no vanillin present, regardless of how recently it had been made.\nIf the shroud had been produced between a.d. 1260 and\n1390, as indicated by the radiocarbon analyses, lignin should\nbe easy to detect. A linen produced in a.d. 1260 would have\nretained about 37% of its vanillin in 1978. The Raes threads,\nthe Holland cloth, and all other medieval linens gave the test\nfor vanillin wherever lignin could be observed on growth\nnodes. The disappearance of all traces of vanillin from the\nlignin in the shroud indicates a much older age than the ra-\ndiocarbon laboratories reported.\nThe fire of 1532 could not have greatly affected the\nvanillin content of lignin in all parts of the shroud\nequally. The thermal conductivity of linen is very low,\n2.1 × 10 −4 cal cm −1 s −1 ◦ C −1 ; therefore, the unscorched\nparts of the folded cloth could not have become very hot.\nThe temperature gradient through the cloth in the reliquary\nshould have been very steep, and the cloth’s center would\nnot have heated at all in the time available. The rapid change\nin color from black to white at the margins of the scorches\nillustrates this fact.\nAny heating at the time of the fire would decrease the\namount of vanillin in the lignin as a function of the tempera-\nture and time heated; however, different amounts of vanillin\nwould have been lost in different areas. No samples from any\nlocation on the shroud gave the vanillin test.\nRogers, “Studies on the radiocarbon sample from the shroud of turin” p. 191.\nCould the Shroud survive without much damage 2 minutes at constant 140°C ?\nRogers FAQ in question 4) http://www.shroud.com/pdfs/rogers5faqs.pdf \nIf the image were a scorch or any part of the Shroud had been heated enough to make\nsignificant changes in the rates of decomposition of any of its components, we would see\nchanges in the structure of the flax fibers and blood. The blood still evolves hydroxyproline on mild heating, and the cellulose crystals are largely undistorted. Image and control fibers show identical crystal properties. The image is not a scorch. The cloth was not heated, not even boiled in oil.\n\n","date":"September 5, 2015 at 2:17 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209666","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I’m not sure what this is about, OK, if you’ll forgive me. Accepted wisdom is that during the course of an intense fire in 1532, a silver, or silver covered casket containing the Shroud became so hot that the silver melted and burned through 36 layers of cloth. Silver melts at about 900°C. Even though the thermal conductivity of linen is poor, I think the possibility of any part of the Shroud not achieving 140°C for a couple of minutes is remote. Had it done so, all its vanillin would have been destroyed. On the other hand, if the Shroud were not in a box, and not in a fire, but still had a lump of hot silver collapsed onto it, then it would be much more likely to have remained cold in the middle. But that’s not what we’re told happened.\n\n","date":"September 5, 2015 at 3:52 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209671","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"not achieving 140°C \nWe are not talking about peak temperature -but average for relatively long time of a couple minutes.\nWhat about bloodstains? Other biological material on the Shroud? What would be effect of the high temperature?\nAnyway, Rogers claims that Raes threads (about 10 cm from burnhole) gave positive for vanillin, contrary to all other areas of the Shroud.\nThis shows that there is interpolated material in this corner, regardless of any other considerations about true age of the Shroud.\n\n","date":"September 5, 2015 at 4:10 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209673","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hugh Farey wrote:\n“…we find that if the temperature was 140°C it would have taken 2 minutes. This means that if the Shroud were ever in a box which became heated to extent that silver melted, there would be no vanillin present, regardless of how recently it had been made. …”\nI agree with “O.K.” about the question…\nI would know the “true truth” (= the entire truth) regarding the following particular claim by “O.K.”\n>”…Anyway, Rogers claims that Raes threads (about 10 cm from burnhole) gave positive for vanillin, contrary to all other areas of the Shroud.”\nWhat is the meaning for that?\nIn fact, one can simply think the Raes threads (…and presumably, the entire corner= 14C area) as new materials added to the ancient cloth…\nWe could try to study a real thermal map of the linen cloth (in order to improve the knowledges connected to the problem of “Vanillin loss from Lignin”), namely (here I try to explain better):\nthe precise mapping of the temperatures reached by the sheet during the fire of Chambery.\nI do not think that this work was really done and\nI think this work can only be carried out in an adequate Lab (= Laboratory equipped for thermal tests of precision).\n— — —\n(Last week I was in Lourdes [France] and, unfortunately, I have not followed your interesting exchange of messages on that new paper by Marco Bella, Luigi Garlaschelli and Roberto Samperi …).\n— — —\nRegarding the solution of the problem about the right analyses (on both “interpolated” and ancient material) to use, you already know what was my idea (= SPMs).\nI want to add that I have read something about another technique (= not in the field of SPMs) called TIRF:\n>A total internal reflection fluorescence microscope (TIRFM) is a type of microscope with which a thin region of a specimen, usually less than 200 nm can be observed. …\n>… … … A TIRFM uses an evanescent wave to selectively illuminate and excite fluorophores in a restricted region of the specimen immediately adjacent to the glass-water interface.\n>The evanescent wave is generated only when the incident light is totally internally reflected at the glass-water interface. … …\n>The evanescent electromagnetic field decays exponentially from the interface, and thus penetrates to a depth of only approximately 100 nm into the sample medium. Thus the TIRFM enables a selective visualization of surface regions such as the basal plasma membrane (which are about 7.5 nm thick) of cells… \nLinks:\nhttps://en.wikipedia.org/wiki/Total_internal_reflection_fluorescence_microscope\nhttp://www.ibiology.org/ibioeducation/taking-courses/total-internal-reflection-fluorescence-tirf-microscopy.html\nhttp://www.industrycortex.com/datasheets/profile/1582349/total-internal-reflection-fluorescence-tirf-204k\nhttp://www.tirf-labs.com/Compare_TIRF_Geom.pdf\n\n","date":"September 7, 2015 at 10:08 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209817","author":"piero","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"TIRFM\nTotal internal reflection microscopy (TIRFM)\nis an optical technique used to observe single molecule fluorescence. Some biophysicists have used the technique for many years, while others are just beginning to explore the boundaries of this versatile mechanism for studying phenomena occurring at interfaces. …\nLink:\nhttp://www.olympusmicro.com/primer/techniques/fluorescence/tirf/olympusaptirf.html\nand, under another adress,\nI have read that:\n>The advantages of using TIRF include the ability to obtain high-contrast images of fluorophores near the plasma membrane, very low background from the bulk of\nthe cell, reduced cellular photodamage and rapid exposure times. …\nObviously the depth of the evanescent field depends on the refractive index of the sample.\nBut, first of all, you have to remember that:\nthe critical angle c can be deduced from Snell’s law…\nHere another address (about TIRF):\nhttps://www.microscopyu.com/articles/fluorescence/tirf/tirfintro.html\n>… Although TIRFM is limited to imaging at the interface of two different media having suitable refractive indices, a great number of applications are ideally suited to the technique. … …\nFor example, see also the following argument “to deepen):\n“Detergency mechanisms (…using Saponaria officinalis)\nand TIRF investigations”…\nSo… In a possible experiment the evanescent field of the totally internal reflected laser excites the dye and the fluctuations of the emitted fluorescence is detected and autocorrelated. …\nTotal internal reflection with fluorescence correlation spectroscopy (TIR-FCS) is an emerging technique that allows one to study the reversible interaction between soluble and surface-associated species.\nTIR-FCS combines two established techniques: total internal reflection fluorescence microscopy (TIRFM) and fluorescence correlation spectroscopy (FCS).\nPerhaps TIR-FCS can be used to study on-off kinetics\nin our future experiments on linen samples…\nbecause:\n– TIR-FCS has been used primarily to investigate the mobility of small fluorescent molecules close to surfaces.\n– Total internal reflection fluorescence correlation spectroscopy (TIR-FCS) allows us to measure diffusion constants and the number of fluorescent molecules in a small area of an evanescent field generated on the objective of a microscope.\nHere a vague Attempt to write a\nShort Bibliography:\n– Axelrod D.\nTotal internal reflection fluorescence microscopy.\nMethods Cell Biol.\n1989;\n30:245–270.\n– Axelrod, D.\n2001.\nTotal internal reflection fluorescence microscopy in cell biology.\nTraffic. 2:764–774.\n– Rigler, R., Ü. Mets, J. Widengren, and P. Kask.\n1993.\nFluorescence correlation spectroscopy with high count rate and low background: analysis of translational diffusion.\nEur. Biophys. J. 22:169–175.\n– Tokunaga, M., K. Kitamura, K. Saito, A. H. Iwane, and T. Yanagida.\n1997.\nSingle molecule imaging of fluorophores and enzymatic reactions achieved by objective-type total internal reflection fluorescence microscopy.\nBiochem. Biophys. Res. Commun. 235:47–53.\n– Thompson NL, Lagerholm BC.\nTotal internal reflection fluorescence: applications in cellular biophysics.\nCurr Opin Biotechnol.\n1997 Feb;\n8(1):58–64.\n\n","date":"September 7, 2015 at 11:00 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209823","author":"piero","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Hugh,\nThank you for actually reading the paper. You understand correctly most of it. I would anyway strongly suggest consulting with someone that knows mass spectrometry before trying yourself to draw conclusions. \nYou wrote:\n—————\nIt is important to recognise that this article only addresses Rogers’ spectrographical[?] comments, not his chemical tests. I think Rogers’s supporters [football supporters?] are correct to feel that Marco Bello[a]’s final conclusion (“The work of the late Dr. Rogers has been exploited to support a pseudoscientific hypothesis which is in no way confirmed by the reported data.”) is unjustified except in this particular aspect.\n—————–\nThe conclusion is fully justified. There is very little information by Rogers regarding his “chemical testing”.  Take vanillin test as an example. \nWe addressed this issue.\n—————\nThe author performs some qualitative chemical testing on these samples. He tests for the presence of vanillin, giving insufficient details to enable the reproduction of this analysis besides observing a change of color.\n—————-\nIn order to perform a chemical test you need to know:\n-the amount of each sample\n-the amount of reactants\n-the reaction time\n-the reaction temperature\n-the procedure\nSince this information is missing, there is no way to know what Rogers did. Please notice that any colorimetric test might be positive or negative according to the amount of sample/reactant  used. Furthermore, the presence of penotosans is hypothesized by chemical testing, but later denied by mass spectrometry. The only numerical data reported are contained in the mass spectra. As you correctly pointed out, these mass spectra (whatever the samples comes from, because their origin is irrelevant in this specific case) are rather similar than different. Therefore, the key evidence, mass spectrometry, is contradicting the main hypothesis and the chemical tests do not demonstrate anything significant. Is this enough to dismiss the pseudoscientific hypothesis regarding the “invisible mending”?\n\n","date":"September 6, 2015 at 7:54 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209721","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Thanks Marco. I think I’m sufficiently scientifically literate to be able to understand what Rogers wrote and what you made of it, which, since I appear to be the only person who does on this blog, is enough for the time being.\nWhile Rogers’s spectral data were derived from experiments carried out in 1981, his chemical investigation was carried out, necessarily on different samples, in 2003/4. He claims he found vanillin in Raes samples and no vanillin in main Shroud samples. As I have explained above, I do not believe that the lack of vanillin demonstrates that the Shroud is older than 1532, but if his Raes threads were genuine (as Thibault has researched), and his Shroud fibres were genuine, and his tests were accurate, then there is something anomalous which needs to be explained. You yourselves might have pointed out that a mass spectrograph for vanillin shows a large peak at Mass 151 and Mass 152 (see: http://webbook.nist.gov/cgi/cbook.cgi?ID=C121335&Mask=200), and also that although Rogers showed a full spectrum for his “Shroud” samples, he carefully cut short his “Raes” spectrum at Mass 150.  That would have helped confirm your conclusion, unless perhaps vanillin requires a higher temperature spectrograph than these diagrams show.\nAnother interesting thing is that these two diagrams are also reproduced in “Pyrolysis/Mass Spectrometry Applied to the Shroud of Turin” (https://www.shroud.com/pdfs/rogers4.pdf), where both are labelled “low temperature”.\n\n","date":"September 6, 2015 at 10:34 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209735","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Hugh,\nYou wrote:\n———–\n …but if his Raes threads were genuine (as Thibault has researched), and his Shroud fibres were genuine, and his tests were accurate, then there is something anomalous which needs to be explained.\n————\nWhat I can verify and explain is definitively not accurate (the interpretation of mass spectra). I have no way to confirm or deny what cannot be verified (vanillin test). It is the duty of an author to give evidence in a scientific paper. Lack of evidence: the paper should be dismissed.\nRegarding the detection of vanillin by mass spectrometry: it is not so simple. Let’s medical doctors read X-ray scans and chemists mass spectra. \nFirst of all, we should consider that the peak seen in mass spectrometry are not correlated in a linear way with concentration. A peak can be higher than another but actually be less abundant. Then, the peak you see might actually not be the molecular peak (152 in the case of vanillin), but a fragment. More important, thousands of molecules might give the same peak, therefore if you see a given peak (e.g. m=96) this is definitively not enough to understand which molecule it is. Furthermore, if the concentration of a molecule is too low with respect to other species, (vanillin vs cellulose)  you might not detect it.\n\n","date":"September 7, 2015 at 12:20 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209831","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Quite so. I agree with all that.\n\n","date":"September 7, 2015 at 1:38 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209835","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"There was the chemical evidence.\n\n","date":"September 5, 2015 at 10:56 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209659","author":"Dcn Andy","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Were there other fibers found in 1EB and 6BF in Roger’s examination?\n\n","date":"September 5, 2015 at 11:52 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209661","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Of course the answer was yes. \nExcerpts From Dr. Nitowsk’s Criteria for Authentication:\nA Procedure for the Verication·of Shroud Samples\n” In September of 1982, Rogers gave Joseph Kohlbeck the Mylar tapes\nwhich he had gotten back from McCrone, minus the 22 which Adler has.\nKohlbeck began photographing them, and lifted several samples from\nthe tapes for experimentation with Rogers’ permission. His tests\nincluded the remounting of red particles, which turned black in oil,\nand the identication of calcium from the “bloody foot” area as\naragonite” .\nObservations by Dr. Kohlbeck and Dr. Nitowski\n1EB\nSlide 37: Flax and other fibers\nSlide 38-39: Particle (blood?)\nSlide 41: Flax fibers: 1 half image and half non-image, burned; contaminating fibers.\nslide 45: Flax and contaminating fibers.\nSlide 47: Flax fibers and red silk.\nSlide 48: Flax fibers and chunk of aloes.\nSlide 49: Particle (blood?) encrusted fiber and calcium.\nSlide 53: Flax- and contaminating fiber.\n6BF\nSlides 417-419: #417 after 3 months of being remounted in Cargille\ntype A immersion oil 1.515. The red particles have\nturned to black and exuded a yellow substance.\nSlide 431: Particle encrusted fiber.\nSlide 434: Variegated red contaminating fiber.\n\n","date":"September 5, 2015 at 1:50 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209664","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Giorgio, I’m not sure I understand this, and hope you will help. The only version of “Criteria for Authentication” I have access to is via http://holyshroudguild.org/dr-nitowski-new.html, which does not contain the references or many photographs, and is heavily redacted. From your comment above, am I right in thinking that it was Dr Kohlbeck who made Slides 37 to 53, and Slides 417 to 434, from Rogers’s two slides 1EB and 6BF respectively? \n1EB seems to have been taken from the back of the calf, and is described as image, but it seems that Dr Kohlbeck was able to extract at least two possible ‘blood spots’ from it.\nHowever, Dr Nitowski’s paper, as of 1986, lists the possessors of the original Slides as follows: “Rogers has 3 slides, Adler has 22, Levi-Setti has 18, and I have 21, which totals 64. This matches the original 32 which Rogers says he took from the Shroud, which McCrone divided in two.” But this doesn’t make sense, as the slides are never described as, for example, 1EBa and 1EBb, which they might be if there were two (McCrone cut) samples from each original tape. Furthermore, the three slides sent to Rogers were, according to Nitowski, 3BF, 3EF, and 6AF. Is that three original tape samples (six slides) or three of the half samples prepared by McCrone?\nAnyway, what happened next? How did Rogers get hold of Slides (or half-sample slides) 1EB and 6BF, and what was left of them after Kohlbeck had removed all their contents onto 30 or so new slides?\nAnd how did Kohlbeck remove his samples for remounting? Did he peel the tape of the glass and pluck off the fibres, or did he cut through the tape (as, we are told, Frei did with his pollen tapes). If the former, then the chance of new contamination was surely quite high, and if the latter, then what on earth did the original look like after 15 samples had been cut from it?\nEven more extraordinary is Dr Nitowski, writing years before Rogers claimed to have carried out his observations on his Raes sample, finding, with Dr Kohlbeck, lots of starch and a heavy coating which came away from the fibres beneath. These findings are exactly what Rogers found eight years later, and were communicated to him, but he makes no mention of that at all in his Thermochimica Acta paper, nor of the fact that this thread had been soundly denounced as a fake.\nI had not read “Criteria for Authentication” until a few moments ago, but it throws a new and murky light on almost all the research carried out on the 1978 Mylar tapes, except possibly the experiments carried out by Heller and Adler – and Walter McCrone who, clumsy though he might have been, at least told everybody what he had done. Even Heller and Adler do not appear to know that the tapes had been cut in two before they received them; they simply say that 36 samples were taken and that they received 22 of them, each about 5cm2 in area. As they were not present at Turin, they might not have known what McCrone had done, and judging by Heller’s comments about Rogers giving away the entire collection to McCrone in the first place, they were no great respecters of Rogers’s competence in material data handling.\nCan anybody shed any light on all this?\n\n","date":"September 5, 2015 at 3:25 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209667","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear all,\nI was kindly asked by the editor to write a response to this TCA paper.\nI’ll write it.\nHugh,my comments tomorrow.\n\n","date":"September 5, 2015 at 3:27 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209668","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hugh, I’ll be happy to answer your questions but will need some time to respond. What I do know, I’ll answer.\nBut believe me when I tell you, I’m as confused as you.\nIn the mean time, take a look at this page (slides two and four)…..http://www.holyshroudguild.org/dr-nitowski-images.html \nThese are images I scanned form the Nitowski slide library. (I do have the full collection of Dr. Nitowski and Kohlbeck’s slides). You can see in slide two how Dr. McCrone adhered the sticky tape to the slide with cover. Slide four I believe shows the remounting by Dr. Kohlbeck. \n(two sets were made)\nAccording to Dr. McCrone, Page 78, “Judgement day…….”\nMcCrone split them into two; “One for Ray and one for me”.  On page 124 McCrone discusses the return of his tapes. “Among other things, remarks were made inferring that I had kept the best of the two sets”. McCrone further continues how he gave Rogers back his set of slides with the assurance he would be able to pick up the other set already in Rogers possession when he returns to Los Alamos in two weeks. McCrone was never able to retrieve them. \n(Why no mention of the other two)\nIf you search the SSG archives for Rogers statement about Dr. Nitowski, your answer will be found. As far as Dr. Kohlbeck, he was only to perform top quality photomicrographs; Nothing more.\nBut it was Kohlbeck’s research that gave light to the invisible weave threat simply by using caragille oil. \nI remember the days I too used it for drum scanning.\n\n","date":"September 5, 2015 at 4:59 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209676","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"theory  not threat\n\n","date":"September 5, 2015 at 5:00 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209677","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hugh writes “Furthermore, the three slides sent to Rogers were, according to Nitowski, 3BF, 3EF, and 6AF. Is that three original tape samples (six slides) or three of the half samples prepared by McCrone”?\nPaul Maloney from ASSIST asked if he could look at some of the sample sticky tape Nitowski and Kohlbeck received from Rogers. Dr. Kohlbeck sent 3BF, 3EF, and 6AF to Paul. However, when Ray was notified by the transfer he demanded them back from Paul. \nHugh writes “And how did Kohlbeck remove his samples for remounting”? \nI don’t know the answer. All I can state is what sticky tape Kohlbeck personally photographed by Nitowski’s slide catalog from which I couldn’t tell you which slides were in fact remounted.\nHugh writes “Even more extraordinary is Dr Nitowski, writing years before Rogers claimed to have carried out his observations on his Raes sample, finding, with Dr Kohlbeck, lots of starch and a heavy coating which came away from the fibres beneath. These findings are exactly what Rogers found eight years later, and were communicated to him, but he makes no mention of that at all in his Thermochimica Acta paper, nor of the fact that this thread had been soundly denounced as a fake”.\nI couldn’t agree with you more  about why these observations by Nitowski and Kohlbeck wasn’t mentioned. The absent of mentioning there findings was always problematic for me.\n\n","date":"September 5, 2015 at 7:46 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209685","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"No mention that there was two sets of slides in any of Nitowski’s note. My best educated guess, one set of slides were given and it was from the original set McCrone possessed.\n\n","date":"September 5, 2015 at 11:49 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209694","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"notes\n\n","date":"September 5, 2015 at 11:50 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209695","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Thank you, Giorgio. Nitowski’s Slide 1BF, referenced above, appears to consist of a single piece of sticky tape cut in two and then reassembled, covered with a coverslip which is itself taped down at the edges. I don’t know what the white area is. The total area of the Shroud tape is about 25mm square (625mm2), which compares with Mccrone’s measurement of 5/8″ x 2-1/2″ (16mm x 63.5mm = 1016mm2). This suggests that Slide 1BF is one of the “half-tapes” produced by McCrone, further subdivided but then reassembled. Heller and Adler said their tapes were “about 5cm2 in area” (500mm2) which is consistent with their having half an original.\nSlide 1AB (the second slide referenced above) is a bit of a mystery. It is captioned “Galss [sic – glass?] slide which held original tape sample, removed for testing” but it is important to recognise that the “original tape samples” were not on glass slides, and were cut in two before mounting. (Or were they? Who wrote “1AD (1)” and who else – in red – wrote “McCrone” “E” and “W” and what in this context do East and West mean?).\nWeird. Did McCrone stick the tapes onto slides first, then label them E and W, and then cut them up and put them on different slides? If 1BF is one of these, why is it not labelled E or W itself? And why was it cut in two and then reassembled?\nThese are tiny details, of the kind daveb usually thinks I make too much of, but they call into question the integrity of almost everything everyone has ever thought they discovered on the surface of the Shroud, given the possibility of contamination as tapes were cut up, stuck down, peeled off and reassembled somewhat at random and without proper record.\nDid Rogers ever explain to anyone what his numbers meant, and why there were so many missing? The first number seems to refer roughly to areas of the Shroud (although there are some anomalies), and the last to the Back and Front images, but the middle sequences are incomplete. Series 1, from A to J, omits C, Series 3-B omits 3DB, Series 4 omits A, B and D, and so on. In a page from a notebook (whose?) in Dr Nitowski’s “Criteria for Authentication” showing the locations of tape samples,Tape 1CB is marked, but 1CJ is not; there are only two in the 2 series, although there were 4 in McCrone’s collection; 3DB, 4A, B, C and D are marked but not in the final collection, and whole series 7 and 8 are marked, covering the head and shoulders, but not present. These last, as someone pointed out, may have been ‘withdrawn’ either before or after testing, after John Jackson’s altercation with Max Frei.\nI realise this post is both long and somewhat disjointed, but a whole new can of worms is wriggling about, and it’ll be a while before I can make much sense of them!\n\n","date":"September 6, 2015 at 4:34 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209708","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"“These are tiny details, of the kind daveb usually thinks I make too much of, … ”  \nHugh you are taking my name in vain quite unjustifiably.  Ten years in an Audit Office gave me an understanding of the need for rigour, if I didn’t already have it.  Believe me, I can well understand your perplexity and frustration.  The picture that seems to be emerging is one of barely forgiveable sloppiness.  It may be that the private notes of the investigators were sufficient for them to draw their own soundly based conclusions.  But perhaps they failed to realise that posterity would also want to revisit their work, and perhaps they failed to leave a trail that could be readily followed.  I had long derived an impression that even McCrone seemed to have adopted a cavalier approach concerning the tapes, possibly unfairly so.  I also wonder if personal agendas and attitudes about authenticity, or that much of the work was on a voluntary basis might have been factors in any failure to follow due rigour, or else a lowering in standards and following proper protocols.  I wonder to what extent personal agendas might be behind the present paper.\n\n","date":"September 6, 2015 at 6:01 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209715","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"“I wonder to what extent personal agendas might be behind the present paper.”\nI don’t.\n\n","date":"September 6, 2015 at 6:14 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209716","author":"anoxie","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hugh if you can make sense of all this, you’ll be chief of Scotland Yard. Thibault and I shared many notes together and we both came up with different conclusions about the validity of Thermochimica Acta.  Personally, I concluded that cognitive bias is why Thibault and I walked away with different conclusions. As I stated before, there was never due diligence in securing chain of custody or procedural documentation done to the sticky tape once  released to other researchers.\n\n","date":"September 6, 2015 at 10:08 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209733","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Professor Luigi Garlaschelli is a member of CICAP, which exists to investigate paranormal phenomena. While there a number of hoaxes produced by charlatans to prove that such phenomena exist, there is genuine paranormal phenomena. The big problem is that to be genuine it has to be spontaneous and cannot therefore be reproduced in a laboratory. Genuine paranormal phenomena appear as though by accident.\nThere are many agendas in the Shroud story. Some want confirmation that Jesus was indeed resurrected in order to help them in their weak (Catholic) faith, others want to demonstrate that the relic is genuine but that a natural process was involved, which is what Ray Rogers appeared to have believed. Then we have a sect claiming that the blood demonstrates that Jesus survived the crucifixon and went to India and there are also secular scholars who want evidence that there is life after death — and so there is more than just this illusory world of material things.\nThe Church is neutral because the relic is not a part of the Deposit of Faith.\n\n","date":"September 6, 2015 at 8:46 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209726","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"One prominent skeptic likes to point out in his mainly recycled writings about the Shroud that several members of STURP were on the executive committee of the Holy Shroud Guild.  Ergo, those scientists were biased and their findings were biased.  It’s a double standard to have no problems with a skeptical scientist that’s part of a group that purports to always come up with a supposed rational explanation for all things paranormal, including any claims related to religion.\n\n","date":"September 6, 2015 at 10:04 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209732","author":"Joe Marino","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"One thing for you, Joe.\nBella, Garlaschelli & Samperi write in their “paper”:\nAmong those, a popular one is the so called “invisible mending”,\ndisclosed by S. Benford and J. Marino and based on the analysis of low resolution (JPEG format) pictures of the Shroud.\nCan you adress this issue?\nThe whole “paper” is one bunch of weasel words, and misleading statements.\n\n","date":"September 6, 2015 at 11:15 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209737","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"The authors cite 2 follow up papers of ours but not the original one presented in Orvieto, Italy in August 2000.  A shortened version of that paper appears on shroud.com.  The quality of the illustrations on the online version is not as good as in the original, which were published in the official printed Orvieto proceedings, of which i have a copy.  I’m not sure if they’re still available.  The Proceedings have excellent reproductions from our paper of a very high resolution picture of the C-14 corner taken from “Shroud Guide” by Gino Moretto, secretary of the Shroud Museum in Turin, and a radiograph of that area by Dr. Larry Schwalbe of STURP.   So it is not true to say our theory was based on low resolution photographs.\n\n","date":"September 6, 2015 at 12:47 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209747","author":"jmarino240","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Where are Dr Nitowski and Dr Levi-Setti’s collection of Shroud sample tapes now?\n\n","date":"September 6, 2015 at 10:53 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209736","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hugh, I believe most of Rogers belongings are with Barrie, but please allow him to confirm that.\nAbout the Aragonite I think it’s good science however I don’t believe Levi-Setti voiced his opinion on the matter (See below abstract and conclusion).  My understanding is he provided the finger-prints of the positive and negative Secondary Ion Mass Spectra (SIMS) of the fibers of the Shroud and the limestone of tombs near the Damascus Gate in Jerusalem to Kohlbeck. It was Kohlbeck (Nitowski) who determined that there was a correlation between the tomb and the trace of aragonite found on the linen not Setti.  Based on Setti’s conclusion from his paper, it seems he would have been more cautious without further studies. Does anyone have any evidence to show that Setti was behind Kohlbeck’s conclusion? I have not found any in the Guild’s archives.\nPROGRESS IN HIGH RESOLUTION SCANNING ION MlCROSCOPY\nAND SECONDARY ION MASS SPECTROMETRY IMAGING MICROANALYSIS\nR. Levi-Setti.* G. Crow and Y.L. Wang\nAbstract\nThe performance of a new high resolution scanning ion microprobe\n(SIM) is elucidated with regard to imaging capabilities\nusing the ion-induced secondary electron (ISE) or secondarv\nion (ISi) signals, and the mass-resolved signal from a seco;dary\nion mass spectrometry (SIMS) system. The new instrument\nfocuses a beam extracted from a liquid metal ion source (LMIS)\nto a range of spot sizes reaching the 20 nm level. The probe\ncurrent (1.6 pA) available at this level of lateral resolution. which\napproaches the theoretical resolution limits of the SIMS method,\nis still adequate to obtain detailed isotopic maps for surfaces\nrich in the elements of low ionization potential (positive ISI),\nor high electron affinity (negative ISi) . In addition to examples\nof high resolution ISE and ISi images of objects displaying sufficiently\nsmall topographic detail, mass spectra and isotopic maps\nare shown, testing both the lateral and depth resolution attained.\nThe latter results belong with a program of interdisciplinary research\napplications of the new microprobe, which include studies\nof e.g., the monolayer lateral distribution of intercalant in SbCI5\nintercalated graphite and of silicate minerals and iron distribution\nin sections of Chondrules and their rims (components of\nchondrites. a class of stoney meteorites). In the biomedical field.\nthe new microprobe finds application in e.g., the srudy of human\nrenal calculi and bone. Most promising is the use of stable isotope\ntracers (e.g. , C:.44 ) to unravel the dynamics of bone\nmineralization, as thus far shown with the in-vitro culture of\nthe skull bone of neonatal mice\nConclusions\nWithin the limiiations of our initial exploration of high spatial\nresolution SIMS imaging microanalysis. several novel structural\nfeatures in a variety of materials have been brought to light which\nhad escaped detection by other microanalytical methods. A combination\nof factors. including high spatial resolution and low\nprobe intensity have contributed at times unexpectedly. One\ncannot refrain from the overwhelming desire to observe many\nmore old objects with new eyes.\nAt the same time it is felt that such observations need be accompanied\nby a new generation of systematic SIMS studies. in\nwhich the peculiarities of the interaction and implant of metal\nions used as probes may be understood and quantified.\n\n","date":"September 6, 2015 at 12:38 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209745","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I sent Dan a suggestion today.\nThere is a difference between paranormal and supranormal phenomena, the latter being a force from beyond acting in our world, relating to the criteria the Church employs in canonisation.\nC. G. Jung delved into the topic, it was the result of seeing relatives going to Spiritualist sessions, however he was able to make a distinction between what the spiritualists were claiming and paranormal phenomena. On the other hand, Freud, despite his contributions to understanding the mind, limited his research. He accused Jung of “dabbling in occultism” and yet, at the end of his life, he appeared to have thought twice and began to investigate paranormal phenomena himself. We do not know how much he found out as many of his papers are preserved at the Library of Congress, beyond the reach of researchers:\nhttps://www.academia.edu/5565370/Historians_put_Freud_on_the_couch\nIf it is Jesus we see on the Shroud as a  burial cloth then it is likely to be a supranormal phenomenon (resurrection). The Courtauld-trained agnostic art historian Thomas de Wesselow in fact thinks that both are one and the same thing:\n https://www.academia.edu/10819998/Book_Review_The_Sign_by_Thomas_de_Wesselow\nThe sect that is propounding the belief that Jesus survived the crucifixion and went to India in order to pave the way for the claims of its founder conveniently ignores that the New Testament narratives do not talk about a normal body but a glorious body when it comes to the post-Easter appearances. Caravaggio got the point and painted two faces of Jesus in his “Supper at Emmaus”.\n\n","date":"September 6, 2015 at 11:18 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209738","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"As I wrote, the whole this “paper” is one bunch of insinuations, weasel words and misleading statements. Typical.\nHere are some samples (weasel phrases bolded):\nIn 1988, three independent laboratories dated this object between 1260 and 1390 (95% confidence interval, 2 σ) by means of the C14 analysis. \n[…]\nNo one has hypothesized this before 1988 (before C14 analysis gave an “undesired” date for the linen); no textile experts who could examine the Shroud in person during the collection of the C14 sample reported any evidence of this late addition.\nThus, we read with great surprise the above-mentioned article, 1 which, by means of mainly mass spectrometry analyses, concludes that the C14 sampling area might indeed be different from the rest of the cloth, giving credit to the theory known as the “invisible mending”\nAlthough this can be debated, we will assume that all the samples that Rogers tested do come from the Shroud of Turin.\nThe work of the late Dr. Rogers has been exploited to support a pseudoscientific hypothesis which is in no way confirmed by the reported data. Regardless of the debate on the hypothetical authenticity of the Shroud, the scientific community and the general public can only be misled by this paper.\nThe last sentence summarizes this paper well. It is like pleading guilty by the pseudoscientists who wrote this crap.\n\n","date":"September 6, 2015 at 11:25 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209739","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear O.K.\nYou have all my support.\nYou wrote a wise rebuttal.\nThis paper seems to me like dejá-vu remembering former Professor Garlaschelli’s experiment trying to produce an image similar to the original , but it turned out to be a complete failure.\nUnfortunately I have not enough chemical background to comment but I think that yours and Dr. Thibault Heimburger’s previous comments not to mention several others point to the obvious-these skeptics aim is to debunk the Shroud whatever it costs.\nUnfortunately Professor Rogers is no longer among us but let’s settle down and eagerly wait for the promised next Dr. Thibault Heimburger’s response.\n                                                                       regards\n                                                          Antero de Frias Moreira\n\n","date":"September 7, 2015 at 2:06 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209838","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Antero,\nYou wrote:\n————\n…Unfortunately I have not enough chemical background to comment…\n———–\nSo, how can you decide that the paper that Rogers published in Thermochimica Acta in 2005 is correct, and that the one we published in Thermochimica Acta in 2015 is wrong?\n\n","date":"September 7, 2015 at 3:41 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209843","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Simply, by comparison of the style of two papers. The paper of Rogers, although hard to follow, looks very professional and comprehensive approach to the problem. The paper by you, much shorter, looks like nitpicking, insinuations, playing tricks with the words etc. \nThe paper of Rogers is based on the analysis of the samples coming from the Shroud. The editorial by you is just an attempt to attack credibility of Rogers.\nAnd besides it contains some fundamental errors in reasoning, clearly visible even to non-specialists in that domain.\n\n","date":"September 7, 2015 at 3:47 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209844","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"…Unfortunately I have not enough chemical background to comment…\n———–\nSo, how can you decide that the paper that Rogers published in Thermochimica Acta in 2005 is correct, and that the one we published in Thermochimica Acta in 2015 is wrong?\nAnd besides there is an interesting acknowledgement in this editorial:\nAuthors thank Andrea Nicolotti and Gian Marco Rinaldi for a helpful discussion.\nI am very curious, what a “helpful discussion” may provide Andrea, a historian, in a paper regarding chemistry…\nNo offence, of course.\n\n","date":"September 7, 2015 at 4:00 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209845","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Marco\nSimply because Professor Rogers had access to Shroud samples and analyzed them with several scientific methods including PMS and later was given material from Raes sample and radiocarbon sample.\nHis conclusion was backed by integrating several scientific methods\nYou did not test material you only draw disputable conclusions on an ONLY  scientific tool I mean PMS..\nAlthough I’m not a chemist my physics and chemistry background allow me to understand the reasoning of both papers and the agenda behind yours.\nThank God scientists kike Dr. Thibault Heimburger have the knowledge to explain us in a comprehensive way the hidden fallacy of your paper.\n                                                              regards\n                                                 Antero de Frias Moreira\n\n","date":"September 8, 2015 at 6:00 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209878","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"On the other hand, calling a peer-reviewed paper’s authors “bastards” and their peer-reviewed paper “crap” does nothing to dignify the position of the authenticist, and rather ensures that the authenticist position will continue to be dismissed as intemperate extremism rather than a valid opinion.\nIf anyone has any evidence that the laboratories were not independent, that nobody desired a 1st century radiocarbon date, that Rogers’s paper was not mainly dependent on mass spectrometry, that Rogers’s samples were unquestionable, or that his hypothesis was not pseudoscientific, then the proper thing to do is to present it calmly, as one or two people have already, so that the authenticist position gains increased, rather than decreased, credibility.\n\n","date":"September 6, 2015 at 12:08 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209742","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Sorry Hugh -not I started this game. No double standards, if they are fouling, we cannot stay silent, and say the game is fair. I know too much what to expect from those guys. \nAnd “peer-reviewed” does not mean true. It can be also cynically exploited.\n\n","date":"September 6, 2015 at 12:18 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209743","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"If anyone has any evidence that the laboratories were not independent\nThe “three independent laboratories” became catchphrase of the skeptics, but it is misleading, as it contains little true. First they actually dated the three parts of the same sample (which skeptics usually don’t mention). Second the “independence” of those three laboratories was very questionable -although we could say measurements themselves were performed independently, the fact of communication between laboratories has been admitted (I don’t have much time now to look for specific references). \nthat nobody desired a 1st century radiocarbon date\nThe more important point is that Bella, Garlaschelli & Samperi write No one has hypothesized this before 1988 (repairs)\nSee the list by Marino & Prior:\nhttp://www.shroud.com/pdfs/chronology.pdf\nhttp://www.shroud.com/pdfs/addendum.pdf\nthat Rogers’s paper was not mainly dependent on mass spectrometry\nNot only, and not mainly. From the abstract of that paper:\nPreliminary estimates of the kinetics constants for the loss of vanillin from lignin indicate a much older age for the cloth than the radiocarbon analyses. The radiocarbon sampling area is uniquely coated with a yellow–brown plant gum containing dye lakes. Pyrolysis-mass-spectrometry results from the sample area coupled with microscopic and microchemical observations prove that the radiocarbon sample was not part of the original cloth of the Shroud of Turin.\nRogers based his conclusion on the combination of factors. Bella, Garlaschelli & Samperi disregarded this, on the basis that the rest are “unspecified” chemical tests.  Even the title of their paper is misleading:\nThere is no mass spectrometry evidence that the C14 sample from the Shroud of Turin comes from a “medieval invisible mending”.\nThe point is that most of the public won’t even notice bolded words…\nthat Rogers’s samples were unquestionable\nSee Thibault’s papers from St. Louis:\nhttp://www.shroud.com/pdfs/stlheimburgerpaper.pdf\nhttp://www.shroud.com/pdfs/stlheimburgerppt.pdf\nor that his hypothesis was not pseudoscientific\nThe only comment is the question: why TCA allowed such statement to be published?\n\n","date":"September 6, 2015 at 1:01 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209749","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Surely the fundamental point is that Flury-Lemberg examined the suspect corner of the Shroud in 2002 and could not see any reweaving. Neither has any other textile specialist who has actually examined the weave for reweaving. The discrepancies in the widths of the threads noted and photographed by Vial in 1988 and published by him in his CIETA paper of 1989 account for some of the irregularities in the weave.\nYou need to start from what you can actually see on the Shroud,not from some threads. This is the fundamental flaw in Rogers’ approach. \nEnd of story.\nGove describes the arrival of the Gonella threads to be handed to Rogers and notes that Rogers did not know whether they were actually from the Shroud or not. I cannot give the page ref .now as I have been in St.Maximin  in Provence today viewing the skull of Mary Magdalene.\n\n","date":"September 6, 2015 at 1:16 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209752","author":"Charles Freeman","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Charles to your point about Gove, In 1978 the cardinal directed\nMons. Caramello to give Gonella several threads from the two\nsamples available since the exposition in 1973. However, much resistance from Baima and others to cooperate with STURP makes it feasible what threads were given to Father Rinaldi who transferred one thread to Jackson to be given to Rogers might have been in fact samples from the Princess Clotilda’s collection that Baima had in his possession. \nIt was a very contemptuous relation between the two parties anything is possible.  \nHSG archive\nDecember 6, 1979\nDear Father Rinaldi:\nI hereby certify that today I have\nreceived from you (l fragment of a thread\nfrom the Holy Shroud of Turin.\nIt is my understanding that said\nfragment is to be entrusted to Ray Rogers~\nof losa Alamos, N.M., as per request of\nProf. Luigi Gonella, of Turin, Italy.\nJohn  P. Jackson\n\n","date":"September 6, 2015 at 1:41 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209754","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Thanks, Giorgio. It is clear that the troubled relationships/ rivalries between various individuals and the immense problems of assessing the provenance of the threads makes the foundations of Rogers’ research very unsatisfactory.\nAt the most Rogers put forward some hypotheses that could be supported or refuted by an actually examination of the Shroud weave itself.  Flury- Lemberg specifically refuted them -no reweave could be seen.\nI leave the discussion over what could or could not be seen on the threads that Rogers had accumulated from wherever and whoever to those with the relevant scientific qualifications.\nOnce again, end of story.\n\n","date":"September 6, 2015 at 3:51 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209759","author":"Charles Freeman","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"The apparent lack of scientific rigour in the documenting of the sticky tape samples has already been mentioned.  More serious than this, was the lack of rigour in ditching the Chagas sampling protocols in 1988.  As early as 1974, Gilbert Raes had already demonstrated a lack of homogeneity in the sampling area with the differences in cotton content, and thread sizes of the two sample pieces he was given to test.  But these conclusions were ignored in the faulty choice of the sampling site.  If proper representative sampling had been followed according to the proper protocol had been followed, the issue would have been resolved one way or the other long ago.  \nNowadays, new techniques with much less intrusiveness, including NDT are available, but as Louis has often pointed out recently, it is now unlikely to happen in the present climate of official opinion.  So the whole inconclusive mess-fest will continue ad nauseam, with no light at the end of the tunnel, but only remonstrations from each side on the great divide of personal opinions.  So that is how Science works?\n\n","date":"September 6, 2015 at 3:54 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209760","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Daveb, Professors Gonella and Chagas did not believe in the authenticity of the Shroud and neither did Cardinal Ballestrero, although he changed his mind after 1988, giving the impression that he had been led into a trap. My feeling is that Pope John Paul II did not take much interest because of his philosophical bent of mind, confirmed by his statement at the Exposition. The message is this: even if the Shroud is authentic it will not answer all our questions. What remains to be answered is in the hands of highly-qualified European scholars,  and they are working on it.\nYou are one who has clearly understood why Rome has closed the doors. With “Shroudie” presence at the Hampshire convention it is possible that they are now “sealed”. I have often said that the left hand does not know what the right hand is doing in the realm of Shroud studies and it is unjust that “Shroudies” in general will have to pay the price for a blunder committed by a few.\n\n","date":"September 6, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209761","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Louis wow, well said.\n\n","date":"September 6, 2015 at 5:46 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209769","author":"Giorgio/HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hi Giorgio\nThank God you also have understood. Others too may have understood but prefer to keep quiet because of PR, in order to be on good terms with the “consensus” that is controlling Shroud studies for years. This “consensus” has also allowed rubbish to be published in the realm of Shroud studies, as though thinking that the clerics in Rome and Turin are blind. This is detrimental to Shroud studies. We have to thrash things out openly, minus personal attacks, four-letter words and character assassination.\n\n","date":"September 6, 2015 at 6:07 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209772","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Louis I couldn’t agree with you more.\n\n","date":"September 6, 2015 at 6:33 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209773","author":"Giorgio/HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Thanks, Giorgio. Your comment is in keeping with your approach in Shroud studies, where you have used sound judgement in selecting material and offering views. Keep up the good work!\n\n","date":"September 6, 2015 at 6:54 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209776","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Louis, I’m unaware about your reference to “‘Shroudie’ presence at the Hampshire convention.”  Please elaborate.  Thanks.\n\n","date":"September 6, 2015 at 4:46 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209762","author":"jmarino240","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Come on, Joe. Haven’t you seen the news that was announced on this blog quite recently? If you missed it have a look. If you did but didn’t pay attention please do so when you have the time. You studied theology, so your views are welcome.\n\n","date":"September 6, 2015 at 5:18 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209765","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Okay, I was aware of that–just didn’t realize it was called that.\n\n","date":"September 6, 2015 at 5:31 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209767","author":"jmarino240","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Great, any views to offer?\n\n","date":"September 6, 2015 at 5:35 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209768","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Here are some thoughts as I come in hot and sweaty after cutting my lawn.  The Church made some mistakes in the 1988 dating.  Cardinal Ratzinger approved STURP II’s 1984 plan, which would have given them 2 weeks for a multidisciplinary program.  Politics were allowed to rule.  Chagas was unduly influenced by Gove.  I can’t remember if it was in the “La notte della Sindone” documentary or a written source, but someone characterized Chagas words to the effect as being “in Gove’s back pocket.”  If the original plan had been implemented, we would not be in the situation we are now.  The Church said in 1978 they were only interested in the truth.  They have allowed 4 full-fledged exhibitions since 1978.  They are looking for ways to promote ecumenism.  Since the Shroud is not even an article of faith, it’s a good opportunity to facilitate some bonds between different faiths.  The 1978 scientists spent much of their own time and money studying the Shroud.  How much more could 21st century scientists, who probably would also invest much of their own time and money, tell us about the cloth.  I would like to see the Church do more to back up their 1978 claim that they’re only interested in the truth and do more than just exhibit it periodically.\n\n","date":"September 6, 2015 at 7:08 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209779","author":"jmarino240","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Thanks.\nThere is a small mistake. Cardinal Joseph Ratzinger was the archbishop of Munich and Freising in 1978, he only went to Rome later.\nI agree that there should be ways to establish bonds of faith. What happened in Hampshire, however, was far from this. It was an attempt by a sect to propound their views about the historical Jesus, which strikes at the very foundation of the Christian faith. Is that ecumenism? Is that how bonds of faith should be promoted? Is this what “Shroudies” want Rome to see?\nFurther, Dan received a private email that he felt obliged to publish and this was followed by nasty comments including attacks on the Christian faith by a member of the sect.\nI am sure you’ve read most of the Shroud material and know about what has gone in the realm of Shroud studies, not forgetting the message from the Pontiff that was read out by Bishop Kevin Vann of Fort Worth, Texas during the last Shroud conference in Dallas.\nWhat has changed after that? The Church knows that many people want to make sure that they are right in their Christian faith by seeing “proof” that the Shroud is authentic. It does not want that kind of approach. What if the Shroud did not exist?\nAs I wrote in a previous comment, the authenticity of the Shroud will not answer all our questions. There is a lot more that will require responses if people are to believe that the monotheism of the Bible is the correct answer.\n\n","date":"September 6, 2015 at 8:14 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209784","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"My reference to Cardinal Ratzinger was in reference to the 1988 time frame   so I don’t know how his 1978 assignment enters into this.   I can understand some concern about the sect’s approach but I don’t think a   lecture to such a group by Shroudies holds–or should hold–that much   weight with Rome.  If Rome was overly concerned about people using the  Shroud  as proof they are right in their Christian faith, it would be   counter-productive to have allowed all of the public expositions.  I think  it is  irrelevant to ask what if the Shroud didn’t exist.  It exists and we  have to deal  with it.  I agree, though, that even a veritable authentic  Shroud wouldn’t  answer all the questions.  But I still think the Church  should try to right  the wrongs from the 1988 testing.  That could eliminate  some of the  existing problems.\n\n","date":"September 6, 2015 at 9:06 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209787","author":"jmarino240","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"This is what the Church wants to see:\nAndreas Englisch.\nA sceptical German journalist who regained his faith and wrote a fascinating book on John Paul II:\nhttp://andreasenglisch.de/\nPeter Seewald\nAnother sceptical German journalist, former editor of “Der Spiegel”, a tough hombre and an ex-communist who regained his faith after interviews with Benedict XVI. The pontiff refused to see any questions in advance:\nhttp://www.catholicdigest.com/articles/people/q_and_a/2011/02-28/my-meeting-with-the-pope-a-qa-with-peter-seewald-journalist\nAnd above all, evidence that there is a power from beyond acting in our world, indirectly saying “Christ is risen”:\nhttp://www.cam.org.au/News-and-Events/News-and-Events/News/Article/9875/surgeon-tells-of-healed-baby-crucial-miracle-for-maltas-first-saint#.VezqgBFViko\nNone of the three are “Shroudies”.\n\n","date":"September 6, 2015 at 8:51 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209786","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"What has not been explained till today is why the sect with its approach was given any attention at all. What they say turns Jesus into a liar and trickster, telling people that he would be resurrected on the third day and then quietly went to Kashmir.\nThe rationale behind the talk is said to be to generate bonds of faith. Really? Why have there been no approaches to synagogues, particularly messianic synagogues, which have been growing in the US, Hindu temples, Sikh gurdwaras,Dawoodi Bohra,Khoja and Ismaili  mosques, and so on? Most of these places will have no nasty things to say about Jesus.\nAs far as I know the convention had also to do with the sect’s missionary activity, where Mark Guscin’s research into the Sudarium of Oviedo would be used to reiterate the claim that Jesus survived the crucifixion. Why did “Shroudies” not question the sect’s belief about Jesus,which has absolutely no historical basis?\nA convincing explanation is needed.\nDeep inside the move is an obsession with monotheism, which can be dangerous and cause a lot of harm, as Jan Assmann told us. Freud only concentrated on Moses because of his background, ignoring other approaches:\nhttps://www.academia.edu/15308857/Freuds_incomplete_speculation_on_monotheism\nAs a matter of fact, Hindu cosmology corresponds with what we know about the universe today, which is what Carl Sagan pointed out. His colleague Stephen Jay Gould realised the problem that could be caused for believers in the Bible and proposed:   https://www.academia.edu/14727603/Why_Stephen_Jay_Gould_proposed_the_principle_of_Non-overlapping_Magisteria\nRome was not interested in the 1988 carbon dating, it was forced into the situation. That was what I was told by an authority in the city. The expositions are held because they are part of the tradition, much in the same way that the “Veronica” is shown to the public once a year at Saint Peter’s Basilica.\nWe must not forget that there are millions of Protestants with deep Christian faith, who do not believe in relics, which in fact can be repugnant to them.\n\n","date":"September 7, 2015 at 9:03 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209811","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"MB:\nIf he wrote something different somewhere else, this is irrelevant.\nOf course…\nWho cares about checking all the information available, when the goal is to slander long-dead person?\nSkeptical “science”…\n\n","date":"September 6, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209764","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"“it is unjust that “Shroudies” in general will have to pay the price for a blunder committed by a few.” I have no idea what this means. The willingness of different faiths to be interested in the Shroud is no doubt music to the ears of Pope Francis, who, if he thinks about the Shroud’s authenticity at all, will be only interested in the truth. Any new commission of inquiry would be greatly enhanced by the presence of Moslems as well as Jews and Christians, and by skeptics as well as authenticists and sindonological agnostics. Only fanatics, of any persuasion, should be excluded from any new investigation.\n\n","date":"September 6, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209770","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I suppose that not everyone is happy of the presence of prominent Shroud scholars on Ahmadiyya Muslims convention, who have recently adopted some fringe ideas in the Shroud community, that Shroud shows that Jesus survived the Crucifixion (the view absolutely unacceptable by any Christians). Such presence may give some credence to this clearly dead claim, and that’s why anger.\n\n","date":"September 6, 2015 at 6:02 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209771","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Of course Hugh has had to defend himself as one of those present in Hampshire, and he adopts the tactic of distorting the whole story. What happened in Hampshire was not ecumenism involving different faiths. I also do not believe that the “music” there would have have sounded pleasant to Pope Francis. If it did he would have to give up his post, throw away his cassock, and perhaps go back to Buenos Aires, where he can dance tango at a club, as a means to forget decades of wasted time.\nConviction is not to be confused with fanaticism. As for any new investigation, it will not be in our time, we will all be gone before that.\n\n","date":"September 6, 2015 at 6:39 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209775","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Quite regardless of the then opinions on authenticity or not of Chagas, Gonella or Ballastrero, the fact remains that Chagas as Pontifical representative had prescribed proper scientific protocols which would have yielded results that would almost certainly have left little room for doubt as to their validity, whatever their outcome might have been.  The decision to over-rule them, together with the refusal to allow any other testing whatsoever, the deliberate exclusion of STURP, and petty-minded misguided viewpoints of local proprietorship, are what has brought us to the present disputatious situation of doubt and recriminations.  Personal agendas over-ruled scientific integrity!  Ignorance and human incompetence ruled.  Or as my engineering fellow-students might at one time have expressed it, “Yet again Bullshit baffles Brains every-time! Human failure rules!”\n\n","date":"September 6, 2015 at 6:56 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209777","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"The mess continues… in the realm of Shroud studies.\n\n","date":"September 6, 2015 at 7:03 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209778","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Louis, I think we had this discussion once before. But let me begin with this analogy, to the Italians it’s a Gioconda and to the rest of us, it’s the Mona Lisa. To put it more bluntly, The Shroud of Turin is very Italian and very Catholic. Any other perspective requires a high social intelligence that intrinsically we haven’t yet achieved as a species. The sociology to any group has its own structure. Regardless if we’re discussing street gangs, cosa nostra, academia, or any other group, you play by their rules. You respect their protocol. The first two groups you would because it’s a matter of life and death. Academia, and others who are deemed to possess a higher social order, still have a threshold and metaphorically speaking if you pass it, your dead with them too. As well intended STRUP was, some members did cross that threshold. Their intensions were noble, but they lost sight of the cultural difference especially when dealing with ordained priests who had ownership of the Shroud.\nMy advise, When in Rome do like the Romans………………We may disagree with the C14 protocol, however, preservation was the Church main priority, not authenticity. \nAllow me to go a step further.\nLet’s suppose the  the Shroud is proven to be an man-made artifact manufactured  for veneration ( a passage was found on the Shroud and it clearly states, “dry clean only”).\nA wonderful scientific achievement of its time that was superbly crafted and used to evoke spiritual inspiration. To Italians and Catholics it will still be revered as a great achievement and embraced as one of theirs.  And what of the other faiths, and other nationalities?  How will they accept the Shroud? would it be considered Idolatry? Personally to me, its authenticity is irrelevant, its existence itself, is the miracle.\n\n","date":"September 7, 2015 at 9:57 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209816","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Giorgio,   I agree that the cultural aspect is huge but the phrase “ordained priests   who had ownership of the Shroud” leaves a very bad taste in my mouth.  In   my view, the Shroud belongs to the world, not to just the Church and  certainly  just not to ordained priests.  STURP was invited by Church authorities to   try and find out the truth about the Shroud and there were some  significant  cultural “hindrances.”  If the original plan of letting STURP II have 2   weeks for a multi-disciplinary program with the Shroud, it is likely that it   would have cemented the idea that the cloth is probably the burial cloth  of  Jesus (one can probably never get to 100% certainty).  If that had   happened, who knows how many people might have been brought to Catholicism or   Christianity?\n\n","date":"September 7, 2015 at 10:32 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209819","author":"jmarino240","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Joe, allow me to clarifying ownership: it is meant in the business sense you own the task. “The objective”. That is what I meant by ownership. In reality, the Italian state owned the Shroud up until 1983. Here lies another example by playing by the rules.\nCompare the Italian’s 1973 studies to STURPS. The sensationalism that occurred after the STURPS studies were not warmly received by Turin nor the Vatican. Legally, The Shroud was owned by the State. The Turin authority feared that McCrone, Father Filas, and all the other sensational press releases could have started a confrontation between Italian State and the Church for ownership of the Shroud.  \nI agree with Louis assertion that there won’t be another examination in our life time. What’s the gain for the Vatican.\n\n","date":"September 7, 2015 at 10:47 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209821","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Giorgio,   Thanks for the clarification.  But I believe there was in 1978 some  sense  of ownership by the Church in the other interpretation of  the word.  Lest I  sound like a broken record, if the Vatican is in the  business of trying to  save souls and is interested to find out the truth of the  Shroud as they  proclaimed in 1978, they would allow more than just public  expositions.\n\n","date":"September 7, 2015 at 11:04 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209824","author":"jmarino240","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hi Giorgio\nI agree with what you’ve said. As for the rest, about which we discussed yesterday, I’ve got no responses.\n\n","date":"September 7, 2015 at 2:01 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209837","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"don’t agree..the shroud belongs to the church Christ established…the Catholic Church…..imperfect as it sometimes is\n\n","date":"September 7, 2015 at 10:07 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209858","author":"rick","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"“The Italian state owned the Shroud up until 1983.” If it ever came to a dispute, my guess is it still does.\n\n","date":"September 7, 2015 at 1:36 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209834","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I respectfully suggest that Giorgio HSG may be under a misapprehension concerning the true status of the ownership of the Holy Shroud viz: “In reality, the Italian state owned the Shroud up until 1983.”  \nIn the year 1453, de facto ownership of the Shroud passed from the widow Margaret de Charnay to the House of Savoy, specifically Duke Louis.  The founder of the house of Savoy was Humbert I the Whitehanded (mid-11th century), who held the county of Savoy and other areas east of the Rhône River and south of Lake Geneva and who was probably of Burgundian origin. His successors during the Middle Ages gradually expanded their territory.   By the Treaty of Utrecht (1713), Victor Amadeus II (reigned 1675–1730) was raised in 1713 from duke to the status of a king as ruler of Sicily; in 1720 he exchanged Sicily for Sardinia. He and his successors also acquired important territory in northeastern Italy.  \nFrom 1453 until 1577, the Holy Shroud was housed in Chambery, except for a short sojourn 1535-61 in Turin after which it was then returned to Chambery.  In 1578, it was moved to the new Savoy capital of Turin, and eventually housed in the Guarini chapel in 1668 by Duke Charles Emmanuel.  \nThe accession of Charles Albert in 1831 contributed to the cause of Italian unification by a modernisation of government and the granting of a constitution under Piedmontese leadership and fighting against Austrian power during the war of independence 1848-49.  Under Victor Emmanuel  II (reigned 1849-78) the kingdom of Italy was formed in 1861 with the House of Savoy at its head.  In the new state the role of the monarch lost its former prominence as a parliamentary system of government evolved. The king was in a pivotal position only in times of crisis.  Victor Emmaunel III remained as figurehead king during the Fascist regime, abdicating in favour of his son Umberto II in 1946, at the conclusion of WWII hostilities, when Italy then became a republic. \nNevertheless Umberto II as head of Savoy but in self-imposed exile, clearly continued to assert his claim of ownership of the Shroud until his death in 1983, when his will bequeathed it to the Pope and his successors.  As far as is known, the Italian government as such has never asserted any claim of ownership, nor did the Italian government ever challenge the terms of the will making this bequest.  \nClearly the ownership of the Shroud was properly to be considered as severable from any state property of the House of Savoy, and it is therefore a grave error to presume that the Shroud at any time ever belonged to the Italian state government.  \nIt also appears to be a grave misapprehension of the Turinese guardians as to their proper role which does not extend to ownership.  They are merely guardians, and should not presume otherwise, as their actions have sometimes indicated such a misperception.  \nI might mischievously suggest that the Orthodox Patriarch of Constantinople may have a greater claim to ownership of the Shroud than any person or institution in Turin!\n\n","date":"September 7, 2015 at 7:31 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209852","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"“Nevertheless Umberto II as head of Savoy but in self-imposed exile, clearly continued to assert his claim of ownership of the Shroud until his death in 1983, when his will bequeathed it to the Pope and his successors. As far as is known, the Italian government as such has never asserted any claim of ownership, nor did the Italian government ever challenge the terms of the will making this bequest”.\nThe Italian Government never made claim but they could have at any time. My hats off to the government appreciating the importance this relic means to many throughout the world. As for Umberto’s self imposed exile? I believe you mean his fathers. The Italian constitution  forbade male descendants of the House of Savoy from entering Italy. This provision was removed in 2002 after 55 years upon numerous years of  pleading by Vittorio Emanuele, Son of Umberto. Umberto himself, was not even granted access to return to Italy for burial.  As for Vittorio, in order to achieve a return to his homeland, Vittorio had to renounce any claim to the throne and to Italy’s crown jewels. He publicly assured the Italian government that the nation and the crown properties, confiscated by the State in 1946, “are no longer ours”, referring to the House of Savoy. “For that matter we have no claim on the Crown jewels”, he said. “We have nothing in Italy and we are not asking for anything. And it was for this reason, why the Turin authority was concerned about the McCrone and other issues being printed in the press.\nAs far as ownership, as I explained to Joe, the meaning is a jargon we use for leadership in business. The “Turinese guardians” had ownership meaning to meet their objective and not be influence by external forces. I did not mean to suggest that they own the Shroud.\n\n","date":"September 7, 2015 at 9:47 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209857","author":"Giorgio HSG","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Giorgio,  Thank you for correcting my slip concerning the exile of Umberto II.  I note that: ‘On June 14 Umberto and his male heirs were permanently banished from Italy; He took residence at Cascais, Port., under the title Count of Sarre.’  I also note from another web-site that the brief return of Vittorio to Italy after 2002 did not seem to be a cause for general celebration, particularly in the South. \nYour use of the term ‘ownership’ as a jargon for meeting an objective is understood, however there is a suspicion abroad that something rather more is too easily inferred.  Despite his exile after 1946, it seems clear enough that Umberto II still considered he had a right of proprietorship over the Shroud, declining to grant permission for any scientific investigation until 1969.  Thus not until Cardinal Pellegrino’s Commision was any agreement reached, Umberto’s representative on that commission being Prof Luigi Gedda.  Fr Rinaldi had also considered it wise to consult Umberto as part of his prior lobbying for the 1978 STURP investigation.  \nFollowing the death of Umberto in 1983, a greater sense of proprietorship seems to have been presumed by the Turin authorities, notwithstanding Umberto’s bequest of the Shroud to the Pope and his successors.  This was evident in Prof Gonella’s hostile reaction to the protocols specified by the Pontifical Science Advisor Prof Chagas for the 1988 radiocarbon dating, and the disastrous setting aside of those protocols, and the deliberate exclusion of the knowledgable STURP team.  Instead we had what seems to have been a tragi-comedy circus of a two hour discussion between Profs Riggi and Gonella, to discuss where a single sample was to be taken, and the most ill-suited choice eventuated.  One might also see it in the lack of adequate consultation in the 2002 so-called restoration, with the consequential loss of material information, a result that appears to many to have been caused by incompetent ignorance.   \nIn the monasteries of medieval times, an abbott was solely responsible for the principal decisions concerning his monastery, but he was always obliged to consult all those who might have an input or be affected by his decisions beforehand.  To many abroad, it is an advisory injunction that does not seem to have penetrated quite as far as Turin.\n\n","date":"September 7, 2015 at 11:22 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209863","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"After the papal states were lost and the anti-Catholic and anti-papal general Giuseppe Garibaldi did his dirty work those who lived in the Vatican felt as though they were prisoners.\nThe situation was brought to an end with the Lateran Treaty and dictator Benito Mussolini gave the Vatican compensation for what it had lost. At least he had realised that it had to be done. It was he who built the Via della Conciliazione, linking the Vatican and Rome.\nIn 2002, the year they returned to Italy, the Italian royal family had an audience with Pope John Paul II and were received by Cardinal Severino Poletto for a private showing of the Turin Shroud. If I’m not mistaken, Prince Emanuele Filiberto is a member of the Confraternity of the Turin Shroud.\n\n","date":"September 8, 2015 at 9:21 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209885","author":"Louis","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Here what I can write in reference to the words (by daveb of wellington nz):\n“…One might also see it in the lack of adequate consultation in the 2002 so-called restoration, with the consequential loss of material information, a result that appears to many to have been caused by incompetent ignorance. …”\n    At the beginning (year = 1998) I was thinking of being able\nto insert my report (of 1998) on the use of advanced microscopies (= SPMs)\nin the field dedicated to the “Preservation of the Shroud” (= “Conservation\nSessions”. Moderator: Prof. M. Flury- Lemberg …).\nThen, later on, my speech (“La qualità del microcontrollo\ntessile della Santa Sindone” = Quality of textile microcontrols\nfor the Holy Shroud) was entered in the field moderated by\nProf. Scannerini (= “Trace Biology Sessions”), June 6, 1998.\nAnyway, we can also try to consider what Prof. William Meacham\nwrote in the book: “The Rape of the Turin Shroud:\nHow Christianity’s most precious relic was wrongly condemned,\nand violated” (= That book describes the two major fiascos to\nhave afflicted the Turin Shroud in recent years: the C-14 dating\nof 1988 and the so-called “restoration” of 2002…)…\n\n","date":"September 8, 2015 at 8:18 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209882","author":"piero","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"This is a follow up to my posting of 5:38 a.m. of this morning:\nI would like to address several points in the authors’ editorial in addition to a previous posting countering their assertion that the invisible mending idea was based on low resolution photographs.  They use the phrase “so called invisible mending.”  The use of the pejorative “so called”  is obviously meant to belittle the idea of invisible mending as a technique.  For the validity of the technique, see for example: \nhttps://en.wikipedia.org/wiki/Invisible_mending\nhttp://www.thefrenchreweavers.com/faq.htm\nhttp://www.invisible-mending.com.au/\nAlso, if you look at 2 articles I co-authored, various people postulated that different types of repairs may have been made on the Shroud over the years (see pre-1988 entries).  Those articles can be found at: http://www.shroud.com/pdfs/chronology.pdf (link to 2nd article can be found at end of aforementioned link).\nI would also like to address the authors statement:  ” “No one has hypothesized this before 1988 (before C14 analysis gave an ‘undesired’ date for the linen); …”\nNot true.  Discussing preparations for the 1986 planning meeting in Turin, Gove writes in his 1995 book “Relic, Icon or Hoax: Carbon Dating the Turin Shroud” (Bristol and Philadelphia: Institute of Physics Publishing, 1996, pg. 90), “Tite felt there should be a textile expert present, if samples were to be taken, to make sure that we were getting a piece of cloth from the main body of the shroud on which the image was imprinted and not a rewoven area or a patch.”\nNote that this 2 years before the 1988 dating.\nThe following passages about invisible mending on the Shroud are taken from the book “The Untold Story of the Holy Shroud” by Carlos Evaristo, the archivist for the Savoy family, who owned the Shroud until King Umberto died in 1983. \n(pp.217-218).  \n     According to the testimony of King Umberto II of Savoy (later recalled by friends, the exiled Monarch entertained in the 1950s, at Villa Italia, in Cascais, Portugal), oral tradition in the Savoy Royal Family confirmed that the Custodians of the Holy Shroud, from the earliest medieval period, had sporadically made copies of the Shroud,but also removed fragments from all around the outermost edges of the Burial Cloth, even as far inward as 10 centimeters and distributed these to close relatives, devotees and allies.\n     That a mysterious seam or pronounced crease mark is visible all along one length of the Shroud is a fact that has baffled Scientists, some of whom have gone as far as to ridiculously (?) propose that a removed section was used to bind the Shroud to the Body at the chin, hands and feet and then sewn back onto the sheet, at a later date.\n     What could also be probable is that this thick, long strip of the original cloth was removed at one point [and] cut up into sections for distribution in reliquaries.\n     Another possible scenario is that this strip was used in a transfer boiling ritual or else separated, thread by thread, so as to have been incorporated into Ex Extractum copies of the Holy Shroud.\n     Any one of these processes could have been carried out by the Canons guarding the Shroud at Lirey or Chambery without the consent or knowledge of whoever owned the Sacred Relic.  Once carried out or the abuse discovered, the section could have ordered or rewoven, back onto the original whole or else the section in question was substituted with another piece of similar cloth.\npp. 218 & 220 (there is a picture on pg. 219)\nAccording to King Umberto II, the pious practice of sharing Major Relics of the Holy Shroud was, according to tradition, continued by the first three Savoy Lords who possessed it, although they, unlike some of their predecessor Guardians, never purposely removed fragments from their areas with the image of the Corpus Sancti (Holy Body.)\n     Another fact confirmed by His Majesty was that it was traditionally affirmed, that at one point in the past, he edges of the Lenzuoli (Sheet) had become so tattered as to cause embarrassment or criticism of the Custodians, and those areas were repaired and rewoven using identical techniques, but obviously with similar, yet newer, materials containing dyes and other medieval manufacturing ingredients, in an attempt to better blend the new sections in, as best possible, with the original fabric.\n     In truth, the presence of medieval dyes was detected in these areas and this fact has been already pointed out by Scientists as additional proof of the inaccuracy of the 1988 Carbon 14 dating test results that placed the samples taken from these areas, as having been fabricated sometime in the middle ages.\n     In truth, any one of the aforementioned practices alone would also account, for not only the contamination of the fabric resulting in inaccurate Carbon 14 dating results, but also, the different types of linen, dyes, resins and fabric patches, discovered to have been present on the outermost edges of the sheet that usually held by Bishops during the exposition of the Sacred Relic to the public for veneration.\n(pp. 265 & 267 (picture on pg. 266) of the Evaristo book. \nThe removal of all patches and of the reinforcement Holland Cloth backing of the Holy Shroud, in the year 2002, confirmed what King Umberto had stated, namely that small sections of the repaired and rewoven edges, had continually been removed from the Sacred Relic and probably as late as the second half of the 17th century.  That thepractice of removing small fragments and even full length or width threads from the outer edges [of] the Holy Shroud, was a family tradition only finally suppressed by Duke Vittorio Amedeo II of Savoy, was another fact Umberto II of Savoy confirmed to Blue Army Founder and Shroud Devotee John Mathias Haffert, in the mid 1960’s.\nIt was the same Vittorio Amedeo II, who along with his wife, the Infanta Anna d’Orleans, personally assisted Blessed Sebastiano Valfre on June 6th, 1694, in repairing the Sacred Burial Cloth of the The Christ, shortly before transferring the Sacred Relic to the new Chapel of the Guarini.  Later, it became a tradition on June 6th of each year for the Savoy Royal Family to distribute relics of the backing cloth.\nIt was in 1694, that in accordance to the Savoy Family tradition, some of the removed sections of thread were then woven into full size replicas of the Sindone (Shroud) for private or public veneration in Convents and Cathedrals during popular Holy Week celebrations.  Unlike the meticulous repair work that had been carried out in previous centuries by religious expert weavers following the damage caused to the Shroud by fires and which left little trace of the removed sections, the intervention of the Savoy and the Blessed was aimed primarily at replacing the cloth backing of the Relic giving it added thickness and strength and also a better contrast to the image.\nThe last intervention by religious sisters had been considered poor by the various members of the House of Savoy since, rather than reweaving the areas nearest the outermost edges that were either missing or had frayed from manipulation and wear, they had camouflaged them with cloth coverings and patches.\nThe backing of black cloth added by Blessed Sebastiano Valfre was later removed byPrincess Maria Clotilde di Savoia, (1843-1911) Consort of Prince Napoleon, who substituted it for a pink silk on April 28th, 1868, on account of the backing having also become deteriorated from manipulation and removal of pieces for relics.\nNote what Piero Savarino, who was scientific advisor to the Turinese Cardinal Poletto, wrote.\nIn a 1998 booklet, he stated that the 1988 C-14 testing might have been erroneous due to “extraneous thread left over from invisible mending‟ routinely carried out in the past on parts of the cloth in poor repair. Savarino went on to emphasize: ―…if the sample taken had been the subject of invisible mending‟ the carbon-dating results would not be reliable. What is more, the site from which the samples actually were taken does not preclude this hypothesis. (Source: Savarino, P. and Barberis, B. “Shroud, Carbon Dating and Calculus of Probabilities.” London: St. Paul‘s, 1988, pp.21-22.)\nNow, it’s possible that in the original Italian, “invisible mending” might not equate specifically to the type of technique we hypothesized, but it’s another strong example of the fact that it is known that repairs have been made to the Shroud, making such a technique plausible.\nThe authors of the editorial conclude “The work of the late Dr. Rogers has been exploited to support a pseudoscientific hypothesis which is in no way confirmed by the reported data.”\nThe ascription of the word “pseudoscientific” to a clearly scientific theory again suggests a bias on the part of the authors.  I agree with the last part of their last sentence that “the scientific community and the general public can only be misled by this paper,” but with application to their own paper.  Rogers was a brilliant scientist who was not easily exploited and was actually one of the founders of Thermochimica Acta. He actually thought he would be able to prove me and my late wife wrong in 5 minutes, and said he was actually embarrassed to have to say we were right.  His 2005 paper fully supported our claims from 2000.  In addition, another paper by me and my wife was published in 2008 in a peer-reviewed journal called Chemistry Today and was titled “Discrepancies in the radiocarbon dating area of the Turin shroud (http://www.shroud.com/pdfs/benfordmarino2008.pdf)\nFinally, if one of the points of peer-reviewed literature is to help fine-tune the author’s thinking, it seems a bit questionable that this editorial comes 10+ years after the original article by Rogers and the death of the author.\n\n","date":"September 8, 2015 at 8:32 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-209912","author":"Joe Marino","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I would like to inform everybody that the final version of the paper is online and free-of-charge to download for a limited period of time.\n\n","date":"September 10, 2015 at 1:24 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210055","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Dear Marco,\nCan you give us the link for your final “free of charge” version ?\nThanks.\n\n","date":"September 10, 2015 at 2:11 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210057","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Just click on the link of the post. It should work.\n\n","date":"September 10, 2015 at 2:34 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210063","author":"Marco Bella","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Clicking on the link of the post ?\nhttp://www.sciencedirect.com/science/article/pii/S0040603115003093\nThen, we are asked to purchase your final paper. 39,95  $ !!\nI have purchased your previous version.\nIt’s enough.\nFortunately, somebody sent me your final version which is exactly the same as the previous one, despite I wrote here.\nAny way, I will write an answer to TCA..\nThe core of your demonstration is that the Mass spectrum of the “low pyrolysis of fibers from Raes sample” (in Rogers’ paper) is similar to the spectrum of : ” a molecule with a long aliphatic chain(exadecan-1-ol, [your example]), which fragmentation pattern is similar to the contaminant present in the Raes sample (sample b).with analogous isotopic pattern..”\nThat’s true.\nBut there are also many other molecules without a long aliphatic chain which show  the same fragmentation pattern.\n\n","date":"September 10, 2015 at 3:54 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210071","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"I Have Changed My Mind!\n(No, not about the authenticity of the cloth, nor about the reweaving I’m afraid)\nSearching Shroud 2.0 for some reweaving, which I did not find, I found what I think is a weaving error in a single weft-throw, which extends from one side of the cloth to the other, at about the level of the dorsal scapulae. As it crosses the seam (photo below) it jumps a centimetre or so. To me this shows that the side-strip is not, as I previously thought, just a tuck in the whole cloth, but really is a section which has been detached and reattached for some reason.\nAlthough this discovery, if so it be, is trivial in itself – there were only a few of us who thought that the cloth was contiguous anyway, and nobody’s personal opinion is that important – it demonstrates the kind of evidence that is needed to support the opinions of those who think the Shroud has been depleted of threads, repaired, rewoven or patched. Setting aside the “of course you can’t see it; it’s invisible” mantra, all anyone needs to do to show any thread extraction, thread replacement, patching, repairing or anything similar, is to find it, photograph it and post it. Simples!","date":"September 11, 2015 at 12:15 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210128","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Huzzaah!\n\n","date":"September 11, 2015 at 12:58 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210132","author":"David Goulet","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hugh, have you got a copy of the 1989 CIETA Bulletin with the article by Vial? He points out several places where the weaver made a mistake. It is presumably easy to do ( to make the mistake and for a professional textile expert to spot it!). It is an important article based on his looking at the cloth during the 1988 selection of the sample. For me the most interesting point is the considerable variation in the thickness of the threads- he has a photograph illustrating this. This meant that there would never be an even weave.\n\n","date":"September 11, 2015 at 1:40 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210136","author":"Charles Freeman","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"No, sorry, it’s not the level of the dorsal scapulae, it’s the level of the blood belt.\n\n","date":"September 11, 2015 at 12:21 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210129","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Hugh and Charles, in Pam Moon’s booklet for her exhibition, she mentions that Donna Campbell of Thomas Ferguson Irish Linen acknowledges that the fabric of the Shroud is not uniform, but Campbell also says “there are signs in the Shroud sample that direct the notion of mending or reweaving of the actual woven fabric.”  Campbell wrote a 17 page report that I’m having trouble locating it electronically.  I’ve emailed Pam Moon for help in supplying it.  In the meantime, Pam has a very good article on her site related to this at http://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Three_threads_files/The%20black%20thread%2023rd%20Sept.pdf .\n\n","date":"September 11, 2015 at 4:03 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210142","author":"Joe Marino","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Campbell wrote a 17 page report that I’m having trouble locating it electronically. \nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Home_files/Updated_report_on_the_Consideration_to_the_Uniformity_and_Effects_of_the_Fabric_in_the_Shroud_of_Turin-5-1.pdf\n\n","date":"September 11, 2015 at 4:19 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210143","author":"O.K.","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Donna Campbell has done a good job considering she was working entirely from photographs of a postage stamp piece of the Shroud, but no one could take “signs that direct the notion” for a ringing endorsement of reweaving. It is acknowledged that the Shroud has been lined unlined and relined a couple of times, which is quite sufficient to account for the irregular thread tensions, and for the black fibre (misleadingly referred to as a thread), which was probably from one of them. The Oxford sample was taken from across a heavy crease in the Shroud whose trace is still visible today, and Campbell’s observation that the edge of the crease is abraded and the interior appears to be stained is interesting. However, the minuscule irregularities observed are nothing like sufficient to support the idea that two thirds of this sample are from the 17th century, as Campbell was well aware.\n\n","date":"September 11, 2015 at 5:05 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210146","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Although Sebastian Valfre was known to have worked on the Shroud in the 17th century, other repairs could certainly have been made earlier.  Giulio Fanti believes a reweave could have been done in the 13th century.  Sue and I suggested around 1530 for the major reweave.\n\n","date":"September 11, 2015 at 5:36 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210148","author":"jmarino240","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"For a mixture of 30AD threads and 1530AD threads to produce a 1350AD radiocarbon date, the proportions have to be 19% 30AD and 81% 1530AD. There is insufficient evidence in the Oxford sample photographs to support this, I think.\n\n","date":"September 11, 2015 at 11:09 pm","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210162","author":"Hugh Farey","site":"shroudstory"},{"title":"Editorial in Thermochimica Acta by Bella, Garlaschelli and Samperi on Rogers’ 2005 Article","post":"Perhaps Garlaschelli & C. did want indicate the tape’s adhesive contamination…\nPlease, read the paper by Rogers (“Pyrolysis/Mass Spectrometry applied to the Shroud of Turin”): “All of the fibers were immersed in the tape’s adhesive, Joan …(Omitted name…) … laboriously cleaned an d prepared Shroud fibers for analyses at the MCMS. …” \nI don’t understand two things:\n– Why Bella, Garlaschelli and Samperi, indicated a peak at mass 96 instead of 97?  For example : in the paper by Rogers (“Pyrolysis/Mass Spectrometry applied to the Shroud of Turin”) the Figure 2 (“Mass spectrum of the low-temperature pyrolysis of fibers from Raes\nsample #3”) shows a peak at 97\n– Why they wrote “…a pigment, alizarin…”? Alizarin was supposed to come from Robbia (see also : the lake with Aluminium)… Then Alizarin is a compound of coloring matter for linen and/or cotton.\nLinks:\nhttps://en.wikipedia.org/wiki/Rose_madder\nhttps://en.wikipedia.org/wiki/Lake_pigment\nRogers wrote (“Studies on the radiocarbon sample from the shroud of turin”):\n>…The presence of alizarin dye and red lakes in the Raes and radiocarbon samples indicates that the color has been manipulated. Specifically, the color and distribution of the coating implies that repairs were made at an unknown time with foreign linen dyed to match the older original material. …\nLinks:\nhttp://www.casebook.org/forum/messages/4922/Studies_on_the_radiocarbon_sample_from_the_shroud_of_turin-21136.doc.\nhttp://webcache.googleusercontent.com/search?q=cache:NXXgTKP8pR4J:http://www.casebook.org/forum/messages/4922/Studies_on_the_radiocarbon_sample_from_the_shroud_of_turin-21136.doc%2Bshroud+madder+dyeing+lake+aluminium&hl=it&biw&bih&gbv=2&&ct=clnk\nMass spectrometry (Wikipedia):\n>In mass spectrometry, fragmentation is the dissociation\nof energetically unstable molecular ions formed from\npassing the molecules in the ionization chamber of\na mass spectrometer.\n>The fragments of a molecule cause a pattern\nin the mass spectrum used to determine structural\ninformation of the molecule. … … ….\nLink:\nhttps://en.wikipedia.org/wiki/Fragmentation_(mass_spectrometry)\nInterpretation of Mass Spectra\n>… Automated computer-matching procedures are still\nonly an aid to, not a replacement for, the skilled interpreter;\nand the path to that skill, as emphasized in every\nedition of this text, is practice… \nLink:\nhttps://books.google.it/books?id=xQWk5WQfMQAC&hl=it\n\n","date":"September 12, 2015 at 8:32 am","url":"https://shroudstory.com/2015/09/04/editorial-in-thermochimica-acta-by-bella-garlaschelli-and-samperi-on-rogers-2005-article/","cat":"carbon_14_dating","id":"comment-210200","author":"piero","site":"shroudstory"}]
