[{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Sorry , but I disagree on this issue.\nI am fairly conviced that if the C-14 test is repeated and samples taken from a few different “secure” areas  (not for example those unfortunate corners), the results would be 1st century or close. \nAside from everything that went wrong in 1988, the reason for anomalous 14th century dating was not the breaking of the protocols, lack of precise information on weights and sizes of the subsamples, not lack of additional research, not even conspiracy of some dark forces but extremely unlucky choice of the sample. \nHad other area been chosen, the result would be probably entirely different -most likely proving 1st century provenance.\nWe simply had terrible bad luck that rewoven fragment was sampled. Such things unfortuantely happen. As Murphy law states: anything that can go wrong will go wrong. As Shroud has went multiple examinations, it was obvious that sooner or later something would go wrong- not due to the fault of the Shroud, but erronous examination -and the results of those erronous test would be used by sceptics as a “proof” that Shroud is a fake.They desired that, so to their satisfaction they saw it happen.\n\n","date":"November 29, 2014 at 7:54 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173589","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"One wonders whether carbon dating is worthwhile after considering the possibility that the Shroud may not be an object suitable for this kind of test. In the interview he gave me Prof. G.Fanti says that just one thread a few millimetres long is sufficient. But what happens if something goes wrong again? Then there will be request for centimetres and if something goes wrong again, they will ask for a foot.\nChapter 7 entitled “What’s in a date?” in Ian Wilson’s book “The Shroud. Fresh light on the 2000-year-old mystery” gives the reasons why carbon dating is not advisable and he does mention the views of the late John Tyrer, textile expert who worked in Manchester, about the problem of contamination. It is just one example, there are many other ones, so it is worth reading this particular chapter because of the context of the discussion.\nIt seems that even Professor Christopher Ramsey has foreseen more problems that can arise with fresh carbon dating. See the last Q/A in:\n  https://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\n\n","date":"November 29, 2014 at 8:41 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173594","author":"Louis","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"OHIO STATE UNIVERSITY  BLACKWELL HOTEL\nAugust 14 through August 17, 2008           Abstracts of Papers\nInvisible Mending and the Turin Shroud: Historical and Scientific Evidence by Joseph G. Marino (JMarino240@aol. com) and M. Sue Benford (MSBenford@aol.com). Saturday, August 16, 9:15 a.m.–9:45 a.m. \nOne prominent theory regarding the results of the 1988 Carbon-14 (C-14) dating of the Shroud is that the sample Text Box:   area had been repaired with a patch or “invisible reweave,” thus producing a dating resulting from a combination of 16th century and first century cloth. This paper recounts the initial doubts about the validity of the C-14 results; the history behind the patch theory; the abundant historical and scientific information support of the theory, especially from the  findings of the late Ray Rogers in his paper published in 2005 after his direct examination of the C-14 samples compared with other samples from the main cloth; independent confirmations of Rogers’ findings; criticisms of Rogers’ findings; and refutations of these criticisms. The authors conclude that the invisible reweave is the most reasonable explanation for the dating of the Shroud.\nNo comment.\n\n","date":"November 29, 2014 at 8:55 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173596","author":"PHPL","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"I hate the optics on this debate. The non-authentic camp’s strongest piece of evidence is the C-14 dating. Even though all the criticisms of the C-14 result are valid, it so often comes from authentists that it appears to be a desperate attempt to pull the rug out from the non-authentic argument. Until a Colin Berry or Hugh Farey starts dismissing/doubing that C-14 result that perception will remain.\n\n","date":"November 29, 2014 at 8:59 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173597","author":"David Goulet","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"“Even though all the criticisms of the C-14 result are valid,” \nThat can’t be true as the criticisms sometimes contradict each other.\n\n","date":"November 29, 2014 at 9:15 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173601","author":"PHPL","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Something can be valid and not be correct.\n\n","date":"November 29, 2014 at 4:45 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173649","author":"David Goulet","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"What about the desperate attempts to demonstrate that the relic is a fake?\n\n","date":"November 29, 2014 at 9:06 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173599","author":"Louis","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Although I believe the evidence is very strong that there was reweaving in the C-14 area, that doesn’t preclude having my opinion that because of the unique nature of the Shroud and the problematic nature of C-14, that the test probably shouldn’t have been done.  Assuming there is a reason that the C-14 is wrong, that reason is probably going to be challenged precisely because of the Shroud’s nature and various C-14 problems.  There are plenty of other data points besides C-14 dating, which is obvious considering the Shroud is probably the most intensely studied artifact of all time.  It’s ridiculous that one questionable test is given so much weight.\n\n","date":"November 29, 2014 at 9:19 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173602","author":"Joe Marino","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Fair enough. I, on the other hand, would stake several dollars that any new radiocarbon test would confirm a medieval date. I have examined all the evidence for reweaving as closely as I can, and I do not think it is sufficiently strong for me to think it likely. At this point, some commenters will be revving up their keyboards to spit out phrases like “completely ignore” and “reminder for Hugh” and “totally blind,” probably with lots of capital letters and exclamation marks, but there’s really no need. I would bet several dollars – as, no doubt, would OK (if he is a betting man) – but how much? Enough to buy a house? Certainly not. A car? Not even that. A good meal? No, I think I’m more confident than that. Maybe a weekend in Turin? It’s an interesting exercise, if currently somewhat academic. What would other readers stake on authenticity?\nThe argument that C14 dates are often wrong and that therefore radiocarbon dating cannot be relied on is ilogical and untrue. If a radiocarbon date is unexpected (and sure, they sometimes are), there is a reason for that which ought to be investigated. Spyros Iakovidis’s story is interesting, but, on the face of it, simply glib. Did it not occur to him to investigate further? The story is from 25 years ago. I wonder if he ever re-assessed his “archaeological dating”. Sadly he died last year, but I wonder what he would have thought of the complete reassessment of late Bronze Age Greek chronology by Wardle, Higham and Cromer, based entirely on radiocarbon dates?\n\n","date":"November 29, 2014 at 9:47 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173605","author":"Hugh Farey","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Since you talk about betting Hugh …\nSome years ago I was having a chat with an accountant and he told me this.\nI was in my late twenties and had just passed my final exams. I was pretentious at that time. I decided one day to go to a casino and have some fun. So, I went there with one thousand dollars in my pocket. I at first observed the players and the casino staff and decided to start gambling. As soon as I started to gamble , I also started to win. It was incredible, after a while I had gained more than three thousand dollars. A guy that I met some time before at a business meeting began to chat with me. I told him that I came here with one thousand dollars and had now tripled this amount. He smiled at me, congratulated me , and asked me to lend him five hundred dollars. I was a little bit annoyed by his demand, but accepted. I continued to play and by midnight I had won more than six thousand dollars. I couldn’t believe it. The same guy again started to talk with me, and once more asked me to lend him five hundred dollars. I hesitated, but he was a charming fellow and I accepted to lend him this amount.   Luck sometimes visits a fool, but it never sits down with him  and by the end of the day I had lost everything. As the casino was closing the guy came to talk to me for a third time and I told him what had happened. He looked at me and said “I knew by experience how this was going to end , that’s why I asked you to lend me this money . Here’s your one thousand dollars … and never, never again enter a casino.”\nPatrick \nP.S – Wagering on the shroud’s authenticity is very risky, but betting on people’s credulity and exploiting it to make money is a sure bet.\n\n","date":"November 29, 2014 at 10:10 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173607","author":"PHPL","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"“Wagering on the shroud’s authenticity is very risky, but betting on people’s credulity and exploiting it to make money is a sure bet.”\nSure, that’s human nature. So too is a preference to travel hopefully – and after a fashion scientifically – on the road  to non-authenticity than to arrive.  Why should religion be allowed to corner the market in mystery and imagination  …\n\n","date":"November 29, 2014 at 10:28 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173609","author":"Colin Berry","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"I respect you Mr Berry.\n\n","date":"November 29, 2014 at 10:31 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173610","author":"PHPL","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Lovely story, Patrick; I’m glad you survived. I have never visited a casino and never bet on anything (I’m too mean even to buy lottery tickets!), but I frequently use the concept as a mathematical exercise in “gut” probability. It is easy to think one is certain of something, but when a possibility of losing money on it arises, one is rarely as certain as one thought!\n\n","date":"November 29, 2014 at 10:39 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173612","author":"Hugh Farey","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Need I say that I also respect Mr Farey ? I am also grateful to Dan Porter for allowing everyone to write what they wish. Thumbs up for this beautiful act Dan ! In fact I like most people on this website, including pro-authenticists like Louis, O.K, Daveb of Wellington, etc. I sometimes exchange  arguments with them but I like them . People that I dislike are these cunning foxes who never believed in the shroud’s authenticity in the first place (or if they ever did believe, it was a long time ago), but who  pose as guides so as to ruthlessly achieve financial gains.\n\n","date":"November 29, 2014 at 11:07 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173613","author":"PHPL","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"I wish I knew where the money was in being an anti- authenticist.. My last lecture was for free with the proceeds from tickets going to the restoration fund for a local medieval church. As I believe the Shroud is medieval, the lecture was perfect for the occasion and appreciated as such by an audience most of who were interested in such things, but there was no money to be had for it. So far I have earned £200 for signing over the copyright of my History today article and that’s it. So perhaps PHLP can tell me who will pay anyone who believes the Shroud is not authentic. ( Actually I don’t like the word ‘ authentic’ as it implies that there is something. Inauthentic about a grave cloth created , as I believe, for one of the most important liturgies of the year,that on Easter morning.)\n\n","date":"November 29, 2014 at 4:30 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173646","author":"Charles Freeman","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"I’m afraid that the final part of my post was ambiguous. \nWhen I talk about those “who pose as guides so as to ruthlessly achieve financial gains” I’m talking about people who don’t believe in the shroud’s authenticity, but pretend to be fully convinced that it is real in order to obtain financial gains.\nYour work is fully appreciated by many, including me Charles.\n\n","date":"November 29, 2014 at 8:43 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173686","author":"PHPL","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Hugh said “I, on the other hand, would stake several dollars that any new radiocarbon test would confirm a medieval date.”. I’d go much further – I’d stake my house on it. My wife would probably object but I think I could convince her that £10,000 would be a good investment. An even money bet on the shroud being medieval would be the bargain of this century.\n\n","date":"November 29, 2014 at 3:54 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173644","author":"aljones909","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Interesting thought experiment Hugh. But it’s a hard one to answer. One would need to assume that the potential exists for a categorical answer, which is questionable*. Let’s assume it did.\nI’d be like you in reverse. I’d bet a trip to Turin on authenticity, that’s for sure, I feel more confident than a very nice meal out. But I’m not confident enough to bet my car or house on it!\n*What would define “categorical”? It would certainly be harder to support the authenticist position if a further c-14 test (with exemplary methodology and execution) came up with a date circa 1300-1400AD. But would that be categorical? Possibly, although not necessarily. If that occurred, I’d probably come to the view that on the balance of probability the Shroud is a medieval creation.\n\n","date":"December 1, 2014 at 2:10 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-174047","author":"Thomas","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Louis:\nChapter 7 entitled “What’s in a date?” in Ian Wilson’s book “The Shroud. Fresh light on the 2000-year-old mystery” gives the reasons why carbon dating is not advisable and he does mention the views of the late John Tyrer, textile expert who worked in Manchester, about the problem of contamination.\nSorry, but this chapter is actually a trash, really. Unfortunately 20 years after dating Wilson still didn’t understand basics of carbon dating, nor specifics of that particular 1988 dating of the Shroud, nor the idea of reweave hypothesis by Benford, Marino, Rogers and others, and stuck to the old and long-refuted concepts. \nJoe:\nAlthough I believe the evidence is very strong that there was reweaving in the C-14 area, that doesn’t preclude having my opinion that because of the unique nature of the Shroud and the problematic nature of C-14, that the test probably shouldn’t have been done.\nWhat’s so unique in the Shroud with regards to the carbon-dating? We tried it once, unfortunately we came across interpolated sample, the results were not satisfactory, we had bad luck, it happens, sorry. Why not try once again? But this time with wiser, transparent approach, no blind tests. Remember , to skew a date from 1st to 14th century we need 66-75 % non-original material (a simple calculation). That’s really big amount! If we don’t hit unlucky area again (and if we take more than one sample from different areas, we shouldn’t) the results should be 1st century or close. The carbon dating is not so unreliable as they paint it, actually it is more foolproof than fool-vulnerable.\nIt’s ridiculous that one questionable test is given so much weight.\nAs I explained above, it is the only serious non-authenticity argument. And fanatical anti-authenticity desperately needs anything, even a failed scientific examination as the “proof” that the Shroud is a fake. \nThat’s also why I would like the carbon dating repeated. Let it turns 1st century, then I would like to see their mugs.\nHugh:\nThe argument that C14 dates are often wrong and that therefore radiocarbon dating cannot be relied on is ilogical and untrue. \nAgree.\nI, on the other hand, would stake several dollars that any new radiocarbon test would confirm a medieval date. \nI would rather put it this way, there is a good bet that the results of another C14 test would be entirely different than those obtained in 1988. I do not claim that right on 1st century target, but different, and probably closer to the 1st century than 14th. Perhaps 1st, but also slight deviations (2nd -3rd century) may be possible.\n\n","date":"November 29, 2014 at 1:55 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173632","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"O.K. wrote “What’s so unique in the Shroud with regards to the carbon-dating? We tried it once, unfortunately we came across interpolated sample, the results were not satisfactory, we had bad luck, it happens, sorry. Why not try once again? But this time with wiser, transparent approach, no blind tests. Remember , to skew a date from 1st to 14th century we need 66-75 % non-original material (a simple calculation). That’s really big amount! If we don’t hit unlucky area again (and if we take more than one sample from different areas, we shouldn’t) the results should be 1st century or close. The carbon dating is not so unreliable as they paint it, actually it is more foolproof than fool-vulnerable” and ” Let it turns 1st century, then I would like to see their mugs. Let it turns 1st century, then I would like to see their mugs.”\nArchaeologists prefer to carbon date items that have been undisturbed in ideal archaeological settings and not exposed even to cigarette ash. The Shroud has been anything but undisturbed for over 500 years and has been in a fire.  I think those 2 factors right there make the Shroud a less than suitable item.  And if another test is done and it comes out 1st century, don’t you think the skeptics would constantly bring out facts that they think invalidated the results?  As several people at the conference pointed out, if another C-14 test was done and didn’t come out 1st century for whatever reason, the case for the Shroud’s authenticity would effectively be over.  Prof. Barberis has apparently been trying for 10 years to get an international commission formed to look at the problems of carbon dating the Shroud.  I think that if a good commission was formed and an appropriate protocol was produced, it would be possible to do a legitimate C-14 test.  But I can’t say I’m confident that it would ever happen.  And if it did, I still think it should be done in the context of multi-disciplinary studies.\n\n","date":"November 29, 2014 at 4:40 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173647","author":"Joe Marino","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"But Joe, you certainly know the amount needed to skew results from the 1st century to 14th.(and you know how to calculate it). That is 66-75 % of non-original and very modern (16th -20th century) carbon  -overwhelming majority! It is not like the small contamination by cigarette ash will turn everything upside down! In 1988 we simply had extremely bad luck. Probably had the sample been chosen from area a few cm away, the results would be close to the 1st century! That’s why reweave hypothesis is the only reliable (and quite obvious)explanation of what happened then.\nThe Shroud has been anything but undisturbed for over 500 years and has been in a fire. \nThe Shroud, has been marvelously well preserved compared to other similar cloths -which are relaibly dated by C-14 method. You have read the reports about cleaning Shroud samples, the external contamination of the sample was minimal and shouldn’t have any significant effect on the results. Even 1532 fire shouldn’t have great effect, as it affected only a few areas and there is no evidence for some large interchange of carbon atoms with enviroment! \nAs several people at the conference pointed out, if another C-14 test was done and didn’t come out 1st century for whatever reason, the case for the Shroud’s authenticity would effectively be over.\nAnd if otherwise, the Shroud’s authenticity would be hard to deny! Let the sceptics be flat-Earth believers! We know what went wrong in 1988. All we have to do is simply not to repeat those mistakes. \nThere were many opportunities for the case of authenticity of the Shroud to be over. Had STURP in 1978 found significant traces of paint, the case would be over. Had there be image below blodstains -the case would be over. had there been brushstrokes, the case would be over. Had the bloodmarks proved to be pigment, the case would be over. And so on. Remmeber, the first blood tests in 1973 were negative (this is used by sceptical propaganda up to this day)! Only improved tests from 1978 showed them to be real blood. \nThat’s why I opt for repeating carbon-dating. I don’t believe it will turn 14th century once again. Simply I know that 1988 went wrong, I know why it went wrong, and the odds that such unfortunate accident will repeat are in my opinion very small. Just sample a few different areas.\n\n","date":"November 29, 2014 at 5:21 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173654","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Joe, glad to see that you openly give your opinion about a second radiocarbon dating. But I think the arguments that you gave, apparently coming from many other people at the St-Louis conference, are not valid.\nYou wrote:\nJM: “And if another test is done and it comes out 1st century, don’t you think the skeptics would constantly bring out facts that they think invalidated the results?”\nML: Any invalid arguments can be used by anybody. No research would be done if we were expecting everybody to agree. But correctly performed tests clarify open questions.\nJM: “As several people at the conference pointed out, if another C-14 test was done and didn’t come out 1st century for whatever reason, the case for the Shroud’s authenticity would effectively be over.”\nML: First, not “come out 1st century”, may mean anything beside 1st century, which include spurious results such as 4th century, 8th century, in the future (yes, that is possible), and so on. A non-1st century in discordance with the 1988 result would point out that something is going wrong and some unforeseen factors are involved. Or, the samples that would be analyzed could point to new results. These are possible outcomes. This is a major new result that does not point to non-authenticity. On the contrary, it would invalidate the certainty of the 1988 radiocarbon dating.\nSecond, being afraid of a result that would not point to authenticity is not at all what should be expected from researchers. \nJM: “Prof. Barberis has apparently been trying for 10 years to get an international commission formed to look at the problems of carbon dating the Shroud. I think that if a good commission was formed and an appropriate protocol was produced, it would be possible to do a legitimate C-14 test.”\nThis is a good initiative by Prof. Barberis. A second radiocarbon dating is needed to move ahead. One aspect that is needed for this second dating is the involvement of various groups of people, some that are known to be against and other for the authenticity of the Shroud. It is unfortunately needed in the case of the Shroud.\nI really do not see any good arguments against a second radiocarbon dating.\n\n","date":"November 29, 2014 at 5:34 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173657","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Mario,   You have some excellent points.\n\n","date":"November 29, 2014 at 6:08 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173659","author":"jmarino240","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"O.K.\nRome appears to be willing to conduct another C14 test, however the hesitation is because of the choice of laboratories. The other problem is that no commission to propose the inter-disciplinary approach has been formed. In short, everything is at a standstill. What we can do now is to concentrate on the image-formation process, to which you also have made useful contributions.\nNow, one word of caution: If the Shroud did indeed wrap the body of Jesus, then no amount of carbon dating will give correct results. I, for one, believe in mind over matter, that matter can be largely illusory, and also that God is not subject to the laws of nature as we are. One should also add that laws of nature are propositions.\nIn one of the two courses I did in parapsycholgy I learnt that phenomena can be divided into:\n— paranormal — which is human\n— extranormal — which is also human\n— supranormal — which is a force from beyond our world, acting in our world.\nIf Jesus was once wrapped in the Shroud, the Resurrection event would have affected the cloth permanently.\n\n","date":"November 30, 2014 at 11:05 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173826","author":"Louis","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"“I really do not see any good arguments against a second radiocarbon dating.”\nRiddle me this Batman: what other object from antiquity has possibly travelled the unique journey that this relic has? Where is the C-14 baseline for such an anomalous item? This is a relic without precedent or antecedent. We still haven’t discerned the means of image formation. So how do we know C-14 dating, regardless of what date it produces, is the definitive method for dating such an anomalous object?\nOf course if one assumes the cloth is medieval it’s trajectory through the last few hundred years can be accounted for better. C-14 seems an obvious method to use. But if one assumes it is 1st century, the question marks one encounters are exponentially multiplied.\n\n","date":"November 29, 2014 at 8:22 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173683","author":"David Goulet","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"David,\n“What other object from antiquity has possibly travelled the unique journey that this relic has?”\nBy definition, no other object would have travelled THIS unique journey. So the answer is embedded in the question: it is none.\n“Where is the C-14 baseline for such an anomalous item?” \nAnomalous, or unique? Radiocarbon dating would be affected by uniqueness?\n“We still haven’t discerned the means of image formation.”\nWe have not yet understood how the universe came to be, yet we have estimated its age and we are still refining it. Granted, this estimation can be repeated at will and by everybody, which is therefore more thrusted than the 1988 radiocarbon dating of the Shroud or any future radio carbon dating of the Shroud, which cannot be repeated at will and by everybody.\n“So how do we know C-14 dating, regardless of what date it produces, is the definitive method for dating such an anomalous object?”\nThe C-14 dating would prove itself to be unreliable on the Shroud if it shows inconsistent dates. Otherwise it becomes more consistent. Consistency of radiocarbon dating on the Shroud is at the heart of many discussion in Shroud research. Let’s verify this level of consistency.\n“Of course if one assumes the cloth is medieval it’s trajectory through the last few hundred years can be accounted for better. C-14 seems an obvious method to use.”\nThe medieval period is from the 5th to the 15th century. If a second radiocarbon dating gives the 5th century, it becomes inconsistent and unreliable.\n“But if one assumes it is 1st century, the question marks one encounters are exponentially multiplied.”\nConsistency is what is going to be verified. \nFears of the result should not stop a second radiocarbon dating.\n\n","date":"November 29, 2014 at 10:28 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173701","author":"Mario Latendresse","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"“Fears of the result should not stop a second radiocarbon dating.”\nNo, but they will, mark my words…\nIn an ideal world, the  88 dating should have been regarded merely as a ranging shot exercise, more as a means of testing the consistency of the AMS method in the hands of three different laboratories for which a single sampling site was not just forgivable but in fact essential. Had that been been written into the protocol, then, having first demonstrated inter-laboratory consistency, as was the case,  with minimal damage to the linen, it should have been followed up immediately with comparison of dates at different sampling sites, if only to deal with the statistical purists. (You know, the sort who reprimand their GP or hospital for relying on a single blood sample for cholesterol, blood sugar etc, and insist on being turned into a pin cushion until the mean and standard deviation give the right chi-square value.)\n\n","date":"November 30, 2014 at 12:54 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173726","author":"Colin Berry","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"I am rather fond of the pollen trail.  There has been found pollen from every geographical location that the Shroud has spent any significant length of time at, including its point of origination.\n\n","date":"November 29, 2014 at 9:21 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173689","author":"ekmcmahon","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"What is on the shroud really tells us little. It could have been deposited at any time from people that have touched it or places it has been. One of the arguments against C-14 dating is that things may have been deposited at some later date and caused the reading to be off. Can’t have it both ways.\n\n","date":"November 30, 2014 at 5:51 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173764","author":"John Green","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"A good reason for my last comment – http://www.shroud.com/danin2.htm\n\n","date":"November 29, 2014 at 9:57 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173697","author":"ekmcmahon","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Hi ekmcmahon. The reference you cite is highly controversial and not good evidence for the pollen trail or anything else. It begins by claiming that “hundreds of images of plant parts, such as flowers, flowering buds, fruits, stems, and leaves were found on high-grade photographs made from negatives by Enrie of 1931,” which is disputed by the a very large proportion of shroud scholars, and goes on to say that this observation “correlates significantly with the studies by forensic microscopist Dr. Max Frei” which is demonstrably untrue. There is some evidence for Middle Eastern pollen on the shroud which should not be casually discounted, but it is far from being conclusive.\n\n","date":"November 30, 2014 at 7:19 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173778","author":"Hugh Farey","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Hugh says: “which is disputed by the a very large proportion of shroud scholars”.  Could you cease tossing out these general statements in a flippant attempt to discount legitimate studies?  NUMBER ONE:  What is the size of group, “the Shroud scholars”? 100? 200?.   NUMBER TWO:  What does the term “VERY LARGE proportion” mean, and how did you come up with that amount?  30% ?  60% ?.   NUMBER THREE: What does “disputed” mean?  “disagree with, but have performed no studies to the contrary”   or “disagree with because they are anti-authenticists”?\n\n","date":"November 30, 2014 at 5:00 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173893","author":"Nabber","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Fair comment, Nabber.\na) Certainly not.\n1) I’ve no idea.\n2) 70%  –  educated guess (see below).\n3) Looked carefully at the evidence and deny its validity.\nHow’s that?\nMarginally more scientifically, ekmcmahon, try Googling “flowers” “Danin” and “site:shroudstory.com” to read the various comments, for and against the flowers (and other things) thought to be seen by some people on the Shroud. For what it’s worth, neither Dan Porter nor Barrie Schwortz are persuaded by Danin’s report, although both have surely studied the matter in considerable detail. Then compare them to the “coins on eyes” comments, for which there is more acceptance, athough even that is still a minority line of thinking.\nSorry, Nabber; it is abundantly clear from the comments on this site that even committed authenticists find Danin’s hundreds of plants hard to swallow. Even if they were as readily identified as he claims, they are in huge conflict with the findings of Max Frei, as you can read in my recent article on the subject (https://www.shroud.com/pdfs/n79part8.pdf).\n\n","date":"November 30, 2014 at 5:34 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173903","author":"Hugh Farey","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Let’s see, so that would be 70% of “no idea”, which I’m pretty certain equals to ZERO.  \n I respect Mr. Porter and Mr. Schwortz immensely (“both have surely studied the matter in considerable detail”  — and you know this is true to what degree?) , I don’t know that they have performed direct counter-studies to Prof. Danin’s investigations, but I have heard a lot of tossing out of simple comments about “Pareidolia”.  That’s not an effective counter.  \nAnd, BTW, you have done it again, “even committed authenticists find…hard to swallow”, which is obviously an attempt to generalize.  OF COURSE SOME authenticists find it hard to swallow.  Far more, I believe, have signed on to it.  \nRed Herring Alert:  There is some conflict with Danin and Frei, and why wouldn’t there be some, but that cannot possibly affect whether there are images on the photos.\n\n","date":"December 2, 2014 at 1:07 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-174321","author":"Nabber","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"At least two images Professor Danin has identified on the Shroud are clear. The rest will depend on whether the Church (one parish) will throw its doors open for further research.\nSome of the material taken from the relic during the Restoration should help in identifying more pollen grains.\n\n","date":"December 2, 2014 at 1:48 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-174326","author":"Louis","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"No, no, Nabber, you mustn’t spoil your own arguments. If it’s not obvious, a quick check on the views expressed on this blog will help you gauge the popularity of the “hundreds of images of plants” hypothesis. Nor is the conflict between the plant identifications of Frei and Danin a red herring, as this was one of the two points I mentioned in my first comment above.\nReturn to the point of the discussion. ekmcmahon says that an article by Danin is “a good reason” for his comment that “there has been found pollen from every geographical location that the Shroud has spent any significant length of time at, including its point of origination.” I maintain that the article is of dubious value   for this purpose. Is there something wrong there? If so, I wonder if you would like to firm up on what. What proportion of shroud studiers do you think accept the “hundreds of flowers” hypothesis? And how good do you think is the correlation between Frei’s and Danin’s findings?\n\n","date":"December 2, 2014 at 2:45 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-174330","author":"Hugh Farey","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Where’s your logic, Hugh.  This blog represents hundreds of scholars?  It probably represents anti-authenticists unfairly, if anything.  Straw man much?  “Hundreds of flowers” an easy target.  How about “a lot of flowers”.  And yes, the Farey Red Herring still lives despite denials.  Danin’s views of flowers don’t depend on exact matching of locations with pollen, in fact just the existence of both in ANY location is significant enough.  Where are the opposition studies? They are almost all Pareidolia type comments.  Your article referenced above is so heavily tilted by what you DON’T ADMIT, as to be useless.\n\n","date":"December 3, 2014 at 9:05 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-174464","author":"Nabber","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"There have been a interesting discussion in Saint-Louis about this question.\nI agree with some of you that there is absolutely no scientific reason to turn down the radiocarbon dating method in order to date the Shroud.\nIn the conclusion of my paper, I ask for a new radiocarbon dating of the Shroud.\nOn one side, we have data strongly suggesting that the 1988 sample is not representative of the main shroud.\nOn the other side, we have the evidence of the textile experts assuring that the dated sample is truly representative of the main shroud.\nThe only mean to know the true age of the shroud is to perform a new radiocarbon dating.\nToday, small pieces of threads are sufficient. \nTaking into account all of the criticisms about the 1988 dating, the new radiocarbon dating must come from at least 3 or 4 samples/pieces of threads from different parts of the shroud.\n1) Each sample must contain warp and weft thread dated separately\n2) The samples must come from “clean” areas (no scorch, no waterstain, no blood,no image) that are at a different distance from the image. This will tell us if the image forming process has an influence on the C14 content.\n3) Each sample must be first analysed using microscopy, micro-chemistry and spectroscopy.\n4) A multidisciplinary approach (textile experts, radiocarbon experts, Shroud experts…) is necessary for the choice of the samples as well as for the whole procedure.\n5) The cleaning of the samples must be as “strong” as possible in order to date only the cellulose of the flax.\n6) The scientists and laboratories must be chosen carefully and it is preferable not to choose the laboratories involved in the 1988 dating, in order to avoid any kind of .\nconflict.\nThe results?\n– All of the results are similar, giving the same age (1st century,  7th century, 14th century …): we must accept this result.\n– The radiocarbon results are very different and not compatible: for some (unknown) reason, the shroud can not be dated by the radiocarbon method\n– The radiocarbon results are really different but there is some kind of relationship between  the dated samples and the image: the image forming process has an influence on the C14 content.\n\n","date":"November 30, 2014 at 9:24 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173805","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Excellent Thibault, please call the Pope!\n\n","date":"December 1, 2014 at 2:16 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-174049","author":"Thomas","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Louis:\nIf the Shroud did indeed wrap the body of Jesus, then no amount of carbon dating will give correct results.\nNon sequitur. There is no proven relation between the body of Jeus being wrapped in the Shroud, and the C14 amount. \nIf Jesus was once wrapped in the Shroud, the Resurrection event would have affected the cloth permanently.\nPerhaps. Or perhaps not. Personally, I don’t believe the Resurrection affected C14 amount.\n\n","date":"November 30, 2014 at 11:10 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173828","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"O.K.\n“There is no proven relation between the body of Jeus being wrapped in the Shroud, and the C14 amount.”\nWhat exactly is proven? Whatever his worldview may have been it does seem that Rogers was a serious scientist and did find anomalies in the sample with which he worked. I stand by the mending hypothesis, along with a couple of others that have been proposed.\n “Personally, I don’t believe the Resurrection affected C14 amount.”\nWhy not? How do you interpret the Resurrection?\nNote: You wrote sometime ago that your papers were posted on a website devoted to apologetics. If you read German, go through the book on your most famous countryman, Pope John Paul II, written by the German journalist Andreas Englisch. He leaves it to readers to judge from themselves, although he himself made a decision and regained his faith.\nSpeaking of apologetics, I trust you know the criteria adopted by Rome in the beatification and canonisation processes. Would you say that there is no proven relation between the healing/curing and the saint to whom prayers were offered?  \nI will make things easier for you;Remember, where there is Jesus, there is subtlety.\nAnd, before I forget, if the fresh C14 test you are eager to see gives a medieval date will you give up Shroud studies and say the relic is a fake?\n\n","date":"November 30, 2014 at 11:39 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173832","author":"Louis","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"No, Louis, you don’t understand what I mean. I simply think that the Resurrection didn’t change the amount of C14 in the Shroud. In my opinion there is no correspondence between miraculous Resurrection and C14 amount -and whether we are carbon-dating the 1st century Shroud of resurrected Jesus, or 1st cnetury shroud of any other individual, the results should be similar if only the procedure and samples are right.\nAnd, before I forget, if the fresh C14 test you are eager to see gives a medieval date will you give up Shroud studies and say the relic is a fake?\nIF. If grandma had a moustache… I don’t play this. When another C14 dating is made, and the results published then we will be thinking about it.\n\n","date":"November 30, 2014 at 12:20 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173844","author":"O.K.","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"For the record I don’t fear the C-14 tests. I just think that many here are putting way too much stock in the method when this relic may have been subject to elements that skew the C-14 readings. But I am not a scientist, so I’ll defer to your collective wisdom on the merits of C-14 dating (which would appear to be as rock solid as the law of gravity).\n\n","date":"November 30, 2014 at 1:31 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173857","author":"David Goulet","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"O.K.\nI understood what you said,that is why the supranormal phenomena was mentioned. A force from beyond acting in our world can leave permanent effects. You must have read at least one of the scientific papers with this proposal. A recent one was presented in Saint Louis but has not yet been published. As for the book on Pope John Paul II by a German journalist who was a Vatican correspondent for twenty years:\nhttp://andreasenglisch.de/paepste.php\nand:\nhttp://andreasenglisch.de/autor.php\n\n","date":"November 30, 2014 at 1:33 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173860","author":"Louis","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"“I understood what you said,that is why the supranormal phenomena was mentioned. A force from beyond acting in our world can leave permanent effects. ”\nI agree. I’m far from 100% certain that the resurrection may have skewed the c-14, but I’m not convinced that it couldn’t have had a role.\n\n","date":"December 1, 2014 at 2:00 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-174044","author":"Thomas","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Thomas, I think it is one of the possibilities. One could include in supranormal phenomena what at least the Catholic Church employs as criteria in the beatification/canonisation process. Not before all possibilities of natural phenomena are considered and the role played by the devil’s advocate.\n\n","date":"December 2, 2014 at 7:12 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-174292","author":"Louis","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Here is what archaeologist William Meacham wrote in a paper in 1986:  “The fact that significant discrepancies have often resulted because of the contamination present in the best specimens from optimal archaeological conditions has the greatest implications in the Carbon 14 measurement of the Shroud.  Firstly, any idea that a radiocarbon date of whatever entity could resolve forever the question of authenticity should be abandoned.  Secondly, the choice of site for the cutting of the specimens from the relic must be controlled by considerations regarding the possibility of contamination and the desirability of measuring both typical and atypical specimens.  Thirdly, an elaborate programme of pre-treatment and selection must be carried out before the measuring of the specimens.  Finally, the result must be interpreted for the general public in the light of the contamination and of the other uncertainties that are inherent in the radiocarbon datring method.”\n\n","date":"November 30, 2014 at 9:05 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173952","author":"Joe Marino","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Last sentence:  “datring” should be “dating.”\n\n","date":"November 30, 2014 at 9:06 pm","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-173953","author":"jmarino240","site":"shroudstory"},{"title":"A Guest Posting by Joe Marino:  If another C-14 test is ever done . . .","post":"Reblogged this on Best of Shroud Story.\n\n","date":"December 3, 2014 at 9:38 am","url":"https://shroudstory.com/2014/11/29/a-guest-posting-by-joe-marino-if-another-c-14-test-is-ever-done/","cat":"carbon_14_dating","id":"comment-174467","author":"Dan","site":"shroudstory"}]
