[{"title":"Bleaching and Banding:  My guess is that Rogers is right","post":"Dan,\nThere is a control. The Holland cloth which was added  as backing circa 1534. It was not banded, while the Shroud in chief was.\n\n","date":"December 16, 2013 at 7:19 pm","url":"https://shroudstory.com/2013/12/16/bleaching-and-banding-my-guess-is-that-rogers-is-right/","cat":"carbon_14_dating","id":"comment-60561","author":"John Klotz","site":"shroudstory"},{"title":"Bleaching and Banding:  My guess is that Rogers is right","post":"Holland cloth as we know it today is essentially unbleached cloth with a dull finish, used as furniture covering, blinds and the like. It is made opaque by a glazed or unglazed finish, called the Holland finish, consisting of oil and a filling material. However originally it was applied to any fine plain-woven linen imported from Europe, particularly the Netherlands. Was the Holland backing cloth sewn by the Poor Clare nuns, bleached or not? I don’t know. \nI was surprised to discover that the spinning wheel was a relatively late invention. The earliest clear illustrations come from Baghdad in 1237, and quickly found its way to India, although India is sometimes credited with the invention. The first spinning wheels were operated by hand, and although known in Europe by the 14th century did not come into immediate general use.  By this time, the Chinese were using water power to drive their spinning wheels, but this was not developed in Europe until the 18th century. A citizen of Brunswick is said to have added the treadle in 1533, and its more general European use might well date from this improvement. \nPrior to the adoption of the spinning wheel, yarn was hand-spun, by whirling a distaff holding the fibres onto a free hanging weighted spindle. However in France, the distaff and spindle were not displaced until the 18th century. Adoption of the spinning wheel meant that five spinners could keep a weaver fully occupied. \nIn the early Middle Ages, the main European textile centres producing linen fabrics seemed to have been in Flanders, notably Ghent, Ypres and Courtrai. Sicily and Palermo seemed to have specialised in silk around 1130. Textile specialists seemed to have been quite migratory, as a result of foreign invasions, or the later religious wars and persecutions. \nEnglish textiles in the 13th and 14th centuries were mainly linen and wool, the trade being influenced by Flemish fullers and dyers. In 1564 Queen Elizabeth I granted a charter for Dutch and Flemish settlers in Norwich, for production of damasks and flowered silks. Revocation of the Edict of Nantes in 1685 caused many weavers to migrate to England.  \nHow might all this bear on the question of banding, and the bleaching of linen? I think it almost certain that the Flemish fullers were bleaching completed cloth, rather than just the unwoven yarn. They would require large areas of reasonably level open fields to carry this out, where the cloth to be bleached must be spread out for several months. Flanders and the Netherlands would have met this requirement. So very likely this was the method by no later than the 13th century. \nThe earlier slower spinning methods of distaff and spindle, might have been conducive to a production process where the unwoven yarn was bleached before weaving. The spinning wheel in the 16th century would have set the closure on any remnants of this process, if it still then persisted.  \nWas bleaching of unwoven yarn terminated much earlier, say in the 4th and 5th century as some have asserted?  The only way of answering this question I think, is to look for the latest and most recent examples of banded linen cloth.  Someone must know of any such examples, which would settle this question, once and for all.\n\n","date":"December 17, 2013 at 6:37 am","url":"https://shroudstory.com/2013/12/16/bleaching-and-banding-my-guess-is-that-rogers-is-right/","cat":"carbon_14_dating","id":"comment-60783","author":"daveb of wellington nz","site":"shroudstory"}]
