[{"title":"Carbon Date the Shroud Again?","post":"The main article that Dan cites has links to 8 separate Shroud articles.  One of the articles is titled “BARBERIS: “THE EXAMINATION OF THE CARBON 14 SHOULD BE REDONE” (https://translate.google.com/translate?sl=auto&tl=en&js=y&prev=_t&hl=en&ie=UTF-8&u=http%3A%2F%2Fwww.famigliacristiana.it%2Farticolo%2Fsindone-dalle-tracce-ematiche-al-carbonio-14-le-11-cose-da-sapere.aspx&edit-text)\n\n","date":"April 20, 2015 at 4:47 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196893","author":"Joe Marino","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Whatever sample material that is still in the drawers at Tucson, Zurich and/or Oxford, should be used for C14-testing, in order to check whether the apparent non-homogeneity of the 1988 results is a fluke or not.\n\n","date":"April 20, 2015 at 4:49 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196895","author":"Jos Verhulst","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Good idea, Jos. Perhaps the retesting of the remaining samples can be held at the same time that three other laboratories test samples from different parts of the Shroud. Then we would have a wide variety of test results.\nIt is also important to see whether any of the 1978 STURP tests can be replicated using fresh samples from the Shroud surface. So long as they remain unreplicated they have little validity.\nI continue to argue for a public database of all early descriptions and depictions, copies ,etc of the Shroud so that this important and neglected aspect of Shroud research can be open to scholarship. Judging from my own problems in paying for the copyright for online pictures this will need some funding and probably work at a university art history department. \nAnd it is vitally  important to relate features of the Shroud to similar features ,e.g. Iconography and images,  on other painted surfaces. Again this has never been properly done.\nLots to do!\n\n","date":"April 20, 2015 at 5:14 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196898","author":"Charles Freeman","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Charles,\nFirst of all :\nI want to underline that I am not happy to work\nonly with material taken in 1988 (from that particular angle\nof the Shroud) = “the remaining samples”…\nThere are other linen fibrils that can be tested (already taken\nfrom the Shroud in the past. For example : read what wrote Dr. P.L.\nBaima Bollone, who is a great expert) …\n— —\nBut, here the key point that I want to emphasize :\nIn any case, before to destroy forever the precious material,\nthe linen fibrils can be tested using SPM techniques.\n >An Atomic Force Microscope (AFM) scans the surface of a specimen\nwith a very sharp tip mounted to a cantilever, the deflections of which\nare directly related to the surface nanoscale topography and various\nother physical properties.\n>AFM has hence a unique ability to analyze and correlate structure\nand properties of  samples ranging from molecules to complex\nbiological systems in their native environments.\n>Since its inception in the 1980s, AFM has grown to become\na key technique for high-resolution structural analysis of areas\nas diverse as biology and material sciences\nSee also:\nHigh-resolution and high-speed AFM with simultaneous advanced optical microscopy.\n— —\nDo you want to learn about new developments of fast AFM imaging?\nCheck under the following link:\nhttp://www.materialstoday.com/biomaterials/webinars/advances-in-high-res-and-high-speed-afm/\n\n","date":"April 20, 2015 at 8:37 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196918","author":"piero","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Excellent points Piero. Charles is an art historian not a scientist. I heard enough in St. Louis to make me leery of going through the whole issue of new protocols and the retrieval of new samples. I do not believe there is enough samples of the material left and to merely re-sample the area samples before may be an interesting project but it won’t answer the objections to the site.\nMy belief is that we could also start with multi-spectrum digital imaging. It was used on the Mona Lisa with amazing results and properly executed is not invasive.\n\n","date":"April 20, 2015 at 8:50 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196919","author":"John Klotz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Yes, as a historian who has worked a lot with medieval iconography, I am more interested in relating the iconography of the Shroud to that of painting in the fourteenth century,as it looks as if we can pin down the bloodstains patterns and scourge marks to 1300—50 and so create a more precise dating for the Shroud than the radio-carbon dating achieved.\n\n","date":"April 20, 2015 at 9:59 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196923","author":"Charles Freeman","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"As far as we know, I believe the only surviving piece is in Arizona. Oxford claims that its pieces were used-up. I don’t know what Zurich has said. \nPam Moon was able to pry a copy of a photograph of Oxford’s  sample before its was destroyed and had the photo examined by an expert and the results were dramatic. Coupled with the report that Oxford had discovered yellow cotton fibers entangled with the linen (as published in the BSTS), it appears that Oxford in doing its testing removed (a) cotton fibers and (b) probably black threads which were the indication  of repairs by Valfre but would have appeared as random contamination to scientists who were totally at sea about the history of the Shroud when it was owned by the Savoys.\nSomeone pointed out to me yesterday that the problem with the edges being frayed was not just the rough handling by the bishops but also the simple fact that the the Savoys were cutting pieces from the corner edges as relics for favored individuals. It appears that pieces from the Shroud edge were virtually parts of the dowry of Savoy princesses.\nWhen I first examined the Shroud photos closely one of the most striking thing was the very  visible, large rectangular pieces  from two corners of the Shroud, Those cuttings may have caused unraveling of the linen that had to be repaired. More so, perhaps, than the bishops.\nRogers obviously could not carbon date the fibers that he had but he was able to discover important differences in composition between the fibers from the test area and the main body of the cloth. You can quarrel about what the differences meant but they were real.\nThe fact  that cotton discovered by Oxford was yellow matches the findings of Rogers and his colleagues. As far as I know, cotton is naturally white. Ever see a cotton field? I have.\nI would suggest before any one starts chewing the rug about this post, they review the Donna Campbell and Pan Moon postings. If you don’t want to do that or haven’t got the time, don’t bother to comment becasue your comment will uninformed. A less diplomatic person than I might even say ignorant.\nHere they are:\nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Thomas_Ferguson_files/Updated_report_on\n_the_Consideration_to_the_Uniformity_and_Effects_of_the_Fabric_in_the_Shroud_of_Turin-5-1.pdf\nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Three_threads_files/BL%20Sebastian%20for%2\n0website%201.pdf\nPam Moon is my candidate for Most Valuable Shroud Player of 2014. (MVP is a sports award in the US).\n\n","date":"April 20, 2015 at 5:49 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196901","author":"John Klotz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"The URL’s I cited had a glitch. I’ll try again. \nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Home_files/Updated_report_on_the_Consideration_to_the_Uniformity_and_Effects_of_the_Fabric_in_the_Shroud_of_Turin-5-1.pdf\nhttp://www.shroudofturinexhibition.com/Shroud_of_Turin_exhibition/Three_threads_files/BL%20Sebastian%20for%20website%201.pdf\n\n","date":"April 20, 2015 at 6:06 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196903","author":"John Klotz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"There is a missing link in the story. The archdiocese of Turin has not said anything about the material collected during the controversial restoration and the microphotographs in its possession. Are we to presume that they do not advance anything in research? If so, we have two options:\n1) Fresh radiocarbon dating\n2) Non-invasive examinations\nI think Ian Wilson has in his last Shroud book argued convincingly about why fresh carbon dating is not advisable. We also cannot use what was left of the 1988 sample due to the controversy and if another one has to be cut who will be in charge? Do we want to go through all those problems again? Most important, Professor Christopher Ramsey is willing to throw open the doors of the Oxford laboratory, but has warned about what may happen. What he told me can be read in:\n  https://www.academia.edu/7893085/The_Quest_for_Jesus_in_Shroud_research\nGiven the endless debates, not only during the recent Saint Louis conference, but also seen on websites and blogs it is obvious that Professor Ramsey is correct.\nIt is therefore preferable to rely on non-invasive tests, in some kind of STURP II, since better equipment and methodology is now available. The most important thing to be examined is the blood under the image. Serum rings have been identified, but more is needed.\nThe Church is holding the expositions because of tradition, not because the relic is an article of faith. Do we have any proof that Moses existed or about the Exodus? No, we don’t, at least according to Israel Finkelstein, Israel’s foremost archaeologist. Yet, Judaism continues, many who left the faith keep thinking about the terrible evil during the Nazi holocaust. If the Shroud is judged to be authentic, it will help both Christianity and Judaism. Even then, there will be questions that will remain unanswered. But there are questions that other religions have also left unanswered, but that is another story.\n\n","date":"April 20, 2015 at 9:54 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196922","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"STURP did some research on medieval painting and discarded the possibility of any comparison with this kind of art. We must not forget Dr. Paolo di Lazzaro’s experiment and ponder about how medieval technology could produce the image we see on the Shroud.\n\n","date":"April 20, 2015 at 10:09 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196925","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Yes, but no one on STURP knew anything about medieval art – or at least I have never seen anything in any STURP report about the medieval iconography of the Passion. I am quite happy to accept that the original  pigments had largely fallen off by 1978 but we still have the pattern of bloodstains and the scourge marks and can relate them to what was being painted at the time. For whatever reason STURP did not check this out.\n\n","date":"April 20, 2015 at 10:13 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196928","author":"Charles Freeman","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"This doubt seems to have been answered recently:\nhttps://shroudstory.com/2015/03/16/barrie-schwortz-not-a-painting-photograph-scorch-or-rubbing/\n\n","date":"April 20, 2015 at 10:51 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196930","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"I haven’t seen any direct references to any works of art in any STURP publication, such as the Holkham Bible and Roettgen Pieta which show close resemblances to the pattern of bloodstains and all-over scourge marks of the Shroud.\nAnyway I will continue with my own researches and hope for eventual publication of them to make my argument clear.\n\n","date":"April 20, 2015 at 12:46 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196940","author":"Charles Freeman","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Charles.\nAre either of two items you mentioned linen? Could you refer us to where we can look at them? For example the Lier Shroud was a linen copy of the Shroud of Turin. There is an image and discussion of it in my book. I believe it was consumed by a French Revolution bonfire.\n\n","date":"April 20, 2015 at 1:01 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196942","author":"John Klotz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"No, they are not linen but they have similar patterns of bloodstains and artists who painted on linen also painted on other surfaces and vice versa. You can find both of them on Google images. Look at the  depictions of the head of Christ in the crucifixion scenes of the 1330 Holkham Bible and you will see very similar squiggles as well as blood flowing down the arms. The Roettgen Pieta also had blood flowing down the arms and both show signs of overall scourge marks.\nSo here we have a manuscript illumination, a sculpture and a linen cloth all showing similar iconography. I have some way to go before I have anything to publish but this beats the Pray Codex for similarities any day.\n\n","date":"April 20, 2015 at 4:02 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196960","author":"Charles Freeman","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Charles,\nDid it ever occur to you that the items you cite may be copies of the Shroud?\n\n","date":"April 20, 2015 at 5:00 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196975","author":"John Klotz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Charles, as I explained to you in an earlier post on this blog, STURP had Jim Drusik of the Los Angeles County Museum as a member of the team and our resident expert when it came to art and art history. However, STURP’s purpose was primarily to characterize the image on the cloth scientifically and not trace its historic origins. Our primary goal was to determine what formed the image. To that end, we obtained the spectral characteristics of every paint, pigment and binder used from medieval to modern times and did detailed spectral analyses across the entire Shroud. We found none. As I said before, it’s called SCIENCE!\n\n","date":"April 20, 2015 at 4:23 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196967","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"As I said before, it’s called SCIENCE!\nTruly Barrie, who cares about science -especially when all verdicts are made a priori based on ideological key (no matter in which way)?\n\n","date":"April 20, 2015 at 4:36 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196970","author":"O.K.","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"The Holy See officially agreed with the Radio Carbon dating result in October 1988. I have since then never read or heard of any official statement from the Holy See questioning the validity of the 1988 results or agreeing with any of the hypotheses or theories formulated by supporters of authenticity  in attempts  to discredit the Radio Carbon dating medieval date.\n\n","date":"April 21, 2015 at 4:08 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197022","author":"PHPL","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"“I am quite happy to accept that the original pigments had largely fallen off by 1978…”\nYou don’t seem to understand the technology Charles. Had the Shroud been created using any quantity of paint or pigment, it would have penetrated the cloth and there would have been plenty there for STURP’s instruments to detect. At best, only some of the surface pigment would have flaked off, but there would have been plenty remaining within the weave and fibers of the cloth.\n\n","date":"April 20, 2015 at 8:16 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196994","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"You are wrong, Barrie. In Garlaschelli’s experiment, pigments were superficial and faded away with simulation of aging.\n\n","date":"April 21, 2015 at 4:55 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197025","author":"David Mo","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"“pigments were superficial and faded away with simulation of aging.” But note that Garlaschelli has washed his cloth.\n\n","date":"April 21, 2015 at 6:56 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197033","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"P.S.The (Catholic) journal Tablet reported on 8 May, 2010 in an article Shrouded in Mystery that there had been a an earlier carbon-14 test in 1988 in which the Vatican had secretly checked out what the result would be. Apparently the source for revealing this test was Father Rinaldi. The result confirmed the later 1988 tests.\n\n","date":"April 20, 2015 at 10:09 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196926","author":"Charles Freeman","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"The article from the Tanlet is still available here:\nhttp://archive.thetablet.co.uk/article/8th-may-2010/14/shrouded-in-mystery\nDavid Sox wrote: “… there was a secret test at a laboratory in Italy.” I am not completely sure, but as far as I can remember, in 1988 there were no AMS laboratories in Italy\n\n","date":"April 20, 2015 at 12:07 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196937","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Thanks for the information, Gian Marco. It had to come from David Sox!\n\n","date":"April 20, 2015 at 1:14 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196943","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"This is extraordinary, Charles. I was not familiar with the story, which is not just a throwaway remark but a major feature of Sox’s article, so we must take it seriously. But is it true? Apart from the lack of denial by anybody in Turin who might know about it, the only circumstantial evidence I can think of is that presumably a sample at least as big as a postage stamp would have been needed, and there is no place where such a sample seems to have been taken from. Sox implies it could have been in the form of threads drawn from various places. If the story is not true, who was lying – Sox or Rinaldi?\n\n","date":"April 20, 2015 at 1:52 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196946","author":"Hugh Farey","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"As I stated in a previous comment, it is important to read what Ian Wilson said about radiocarbon dating of the Shroud.\n\n","date":"April 20, 2015 at 10:11 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196927","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"I may not agree with Stephen Jones about everything,but look what he had to say about Revd. David Sox in the second paragraph:\n http://theshroudofturin.blogspot.com.br/2015/03/my-theory-that-radiocarbon-dating.html\nFormer BSTS Newsetter editor Ian Wilson also found that Sox was a mischief maker.\n\n","date":"April 20, 2015 at 2:14 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196948","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Hugh wrote, “If the story is not true, who was lying – Sox or Rinaldi?”  I met Fr. Rinaldi, and I, and anyone who knew him, would tell you that there is ZERO chance that he would have lied about this.”\n\n","date":"April 20, 2015 at 4:07 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196963","author":"Joe Marino","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"I knew both David Sox and Fr. Peter Rinaldi personally. Take my word for it, between the two I would ONLY trust Rinaldi.\n\n","date":"April 20, 2015 at 6:36 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196986","author":"Barrie Schwortz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"That has always been my impression. So is David Sox lying, or is the story true?\n\n","date":"April 20, 2015 at 4:15 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196965","author":"Hugh Farey","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"That’s a funny question.\n\n","date":"April 20, 2015 at 4:17 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196966","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"There was a legend that the Shroud had been carbond dated before 1989 in California but it was vigorously denied by the people who were alleged to have done it. That came from Father  Rinaldi and others. Incidentally that  legendary date was circa 500 CE. I am sure Joe M or someone else can correct me on this. That legendary test was in the US not across the Pond.\n\n","date":"April 20, 2015 at 5:06 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196976","author":"John Klotz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"“If it’s not documented, It’s only a Rumor”, the rule usually given by FDA inspectors applies here. Thus whole thing is hearsay with absolutely no evidence, why put any weight on it?\n\n","date":"April 20, 2015 at 5:39 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196979","author":"MikeM","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Read Ian Wilson’s review of David Sox’s book. Apparently Dr. Wolfli had problems dating his mother-in-law’s linen tablecloth!\nhttp://www.shroud.com/pdfs/n20part4.pdf\n\n","date":"April 20, 2015 at 5:54 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-196981","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"I don’t know how well it was known in 1988, but modern atmospheric C-14 levels have varied around a steady level since about 1600. A modern tablecloth would probably date at BP200 or more, which on calibration would indicate a number of dates between about 1670 and the present day. I suspect Dr Wolfli knew this, and was joking.\n\n","date":"April 21, 2015 at 3:59 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197021","author":"Hugh Farey","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Hi, I’m that old, non-scientific guy who in my long life had a few messages from my Guardian Angel.  I had written a reply to these sites about a message that I received about the Shroud of Turin. He told me that I am looking at “THE Image of the Living Jesus Christ”.  Doing another C-14 test seems to be a very good idea., but please don not cut into the image of Jesus’ body.  You are only trying to resolve the date of the fabric, are you not?  Maybe take a small piece of the fabric that has the so called ‘scorching’ on it.\n\n","date":"April 21, 2015 at 3:36 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197020","author":"Emmett McMahon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"The best opportunity for carbon dating may have been lost in the 2002 “restoration” of the Shroud. There is an excellent comment on that published on Shroud.com by archaeologist Bill Meacham.\nMeacham, however, suffers from a few liabilities. He is a somewhat physically imposing which may make some people nervous; he never hesitates to speak his mind no matter whose feet he steps on (and that makes some people uncomfortable); and as archaeologist he has in fact been involved in carbon dating ancient artifacts which is an unfair advantage :-) Oh, another thing, his work has earned the respect of this writer.\nDespite all that I suggest a reading of his comments on the 2002 restoration project are well worthwhile and relate directly to this discussion. The best chance for non-intrusive carbon dating may have been lost.  https://www.shroud.com/restored.htm#meacham\n\n","date":"April 21, 2015 at 6:26 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197031","author":"John Klotz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"The dating problem of both modern and ancient linen cloths is linked with the use of mild or strong detergents. Re ancient linen cloths, good natural detergents such as natron (natural soda), potash, soapwort (Saponaria officianlis) were used.\n\n","date":"April 21, 2015 at 8:49 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197044","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Re Dr. Wolfli having problems dating his mother-in-law’s linen tablecloth. Hugh wrote: “I suspect Dr Wolfli knew this, and was joking.”\nNo, Hugh. Indeed Dr Wolfli was NOT joking AT ALL.\n\n","date":"April 21, 2015 at 8:52 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197045","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"“No, Hugh. Indeed Dr Wolfli was NOT joking AT ALL.” How do you know that? Anyway, in that case, he perhaps was not aware that all modern artefacts date as well to the 17th century as they do to the 21st. The accuracy of any C-14 date depends on the slope of the calibration graph, which, averaged out over the last three or four hundred years, is more or less flat. Everybody’s mother-in-law’s tablecloths will date as well to then as they do to now.\n\n","date":"April 21, 2015 at 9:08 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197047","author":"Hugh Farey","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Re: Dr.Wolfli\nIt is evident that Ian Wilson didn’t take it as a joke.If he had, there would be no mention in the review. Dr. Wolfli is recorded elsewhere expressing doubts about the Shroud’s radiocarbon dating.\n\n","date":"April 21, 2015 at 9:57 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197052","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"hi Louis, actually, it was Sox first who didn’t take it as a joke and so did Wilson.\n\n","date":"April 21, 2015 at 10:50 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197060","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Typo: and then Wilson didn’t either.\n\n","date":"April 21, 2015 at 10:51 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197061","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Most criously, ONLY Hugh takes it as a joke!\n\n","date":"April 21, 2015 at 10:52 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197062","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Hi Max\nThat’s right, Max. Ian Wilson is a serious scholar and I had occasion to interview him for a full-page report in a  leading daily. If it was a joke he would not even mention it in the review.\nAny progress with your Templar studies?\n\n","date":"April 21, 2015 at 11:11 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197064","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"See Ian Wilson’s review of David Sox’s The Shroud Unmasked: Uncovering the Greatest Forgery of all Time, Lamp Press paperback. On p. 138 Sox notes:\n “Wölfli of Zurich was WORRIED (upper cases mine; NOT JOKING) about the results he had with the linen tablecloth of his wife’s mother. It was 50 years old, but carbon dating said it was 350 years old. There might have been A PROBLEM CREATED BY DETERGENT (upper cases mine) which had been used on the cloth.”\n\n","date":"April 21, 2015 at 10:22 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197054","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"BTW besides soaport, a natural detergent can be made from common SALT in heavy sweat (as salt residue can accumulate on skin) and JERUSALEM LIMESTONE DUST.\n\n","date":"April 21, 2015 at 10:32 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197056","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"That review is what I was referring to in a comment yesterday, Max. There is no joke there.\n\n","date":"April 21, 2015 at 10:37 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197057","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"100% agreed, Louis.\n\n","date":"April 21, 2015 at 10:54 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197063","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Hugh’s practice of the art of misrepresenation of others’ thoughts and Shroud-related documents (such as the Hungarian Pray Ms) is well-known in this blog.\n\n","date":"April 21, 2015 at 11:41 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197068","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"” It was 50 years old, but carbon dating said it was 350 years old. There might have been A PROBLEM CREATED BY DETERGENT (upper cases mine) which had been used on the cloth.”\nSo, the carbon dating said that it was much older than it really was . Saloperie …\n\n","date":"April 21, 2015 at 12:10 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197074","author":"PHPL","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"It does seem actually Wölfli feared the TS could be dated  9th or 10th centrury CE (that is 350 years older than expected) because of the presence of detergent. Alike Tite and Hall, he thought the TS was unlikely to be the Shroud of Christ.\n\n","date":"April 22, 2015 at 5:14 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197155","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Typo: 300 years older\n\n","date":"April 22, 2015 at 5:17 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197156","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Now despite the possible presence of detergent, the TS was radiocarbon dated 1260-1390 CE. This is a miracle!\n\n","date":"April 22, 2015 at 5:25 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197159","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Well, my apologies gentlemen. I had no intention of misrepresenting Dr Wolfli. Perhaps the modern fluctuations in C-14 simply were not known in 1988. The fact remains, though, that all modern material can be dated to 350 years ago, regardless of contamination, so that there was no need for him to be concerned.\n\n","date":"April 21, 2015 at 11:57 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197072","author":"Hugh Farey","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"I met privately with Dr. Herbert Haas of SMU while viewing a life-size transparency at the Biblical Arts Museum in Dallas back in 1990.  As a C-14 expert he was appalled at the 1988 fiasco and said the most useful sample would be a single thread running the length of the Shroud just off image.  He said hundreds of dates could be obtained along with the measure of other isotopes of different elements like Oxygen, etc which could provide a plethora of data on the “event” of image formation while at the same time leaving no visible mark on the cloth.\n\n","date":"April 21, 2015 at 12:46 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197078","author":"Chuck Hampton","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Regarding David Sox’s claims about an earlier carbon dating, it should be noted that Harry Gove comments on the subject in his book, Relic, Icon Or Hoax? (Bristol and Philadelphia: Institute of Physics Publishing, 1996), 281. According to Gove, he talked to Sox on the phone a few months after Sox’s alleged discussion with Peter Rinaldi occurred. Gove says that Sox told him that the earlier carbon dating occurred “six or seven years” earlier. If the Tablet article cited by Charles Freeman is claiming that the earlier carbon dating occurred in 1988, then Sox apparently contradicted himself. \nDoes the Tablet article set the earlier carbon dating in 1988? Not that I noticed.\nI haven’t read much of Sox’s material. Does anybody know if he added any further details to his account anywhere else? The way Gove describes it, based on his phone conversation with Sox, makes the test sound like the 1982 one arranged by John Heller and Alan Adler and conducted in California. If that 1982 test was in view, that would help explain why Rinaldi and others remained so open to the Shroud’s authenticity, since the Heller/Adler 1982 test produced inconsistent results. By contrast, if the secret carbon dating cited by Sox had produced a consistent medieval result, why would Rinaldi and others in the know have remained so open to the Shroud’s authenticity? Sox’s 2010 article is referring to something other than the Heller/Adler test. It’s referring to a test in Italy that apparently produced more consistent results than the Heller/Adler one. The fourth paragraph in the Tablet article could be read as dating the test to 1988, but it seems ambiguous to me. If Sox did refer to a 1981 or 1982 test when speaking to Gove, but then referred to a 1988 test in his 2010 article, he contradicted himself. Even if he didn’t contradict himself, the notion that a 1981 or 1982 test consistently placed the Shroud around the same time as the official 1988 test is suspicious, since Rinaldi and others who would have been aware of that test from 1981 or 1982 didn’t act as if they knew the Shroud was medieval.\n\n","date":"April 21, 2015 at 6:20 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197099","author":"Jason Engwer","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"PHPL wrote “I have since then never read or heard of any official statement from the Holy See questioning the validity of the 1988 results or agreeing with any of the hypotheses or theories formulated by supporters of authenticity in attempts to discredit the Radio Carbon dating medieval date.”  A Vatican spokesman around 1990 said that the 1988 results were “strange” and were not compatible with all the other scientific evidence.  I will dig out this weekend the original article.  Regarding the Vatican agreeing with theories, it claims no competence in scientific matters but has simply encouraged scientists to continue their research.  If the Vatican really believed that the 1988 C-14 results proved the Shroud was not authentic, it’s most unlikely that they would have allowed exhibitions in 1998, 2000, 2010 and 2015.\n\n","date":"April 21, 2015 at 8:52 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197109","author":"Joe Marino","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"“If the Vatican really believed that the 1988 C-14 results proved the Shroud was not authentic, it’s most unlikely that they would have allowed exhibitions in 1998, 2000, 2010 and 2015.”\nI couldn’t disagree more.\n\n","date":"April 21, 2015 at 10:45 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197116","author":"PHPL","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Patrick,\nActually the case is not closed. Cardinal Anastasio Ballestrero was forced into a situation for which he was not prepared, probably getting the wrong advice from Professor Luigi Gonella.\nThe Church is willing to go through a rerun of the radiocarbon dating but faces the same problems it saw in 1988. It would never hold the expositions if it believed that there is proof that the Shroud is a forgery.\n\n","date":"April 22, 2015 at 9:22 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197179","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Louis,\nGonella gest a bum rap. The carbon dating was manipulated by the head of the pontifical academy who was advising JohnPaul II. The final decisions were made in a letter from the Vatican to the Archbishop of Turin who was given no discretion. Gonella played no role in the curtailing and virtual elimination of the protocols and the ouster of STURP from further examination of the SHROUD until after the carbon dating \n [Which rendered further testing moot for the time being. Turin and the Vatican felt burned, even betrayed. Emanuella Marinelli quotes Gonella has saying; “We were blacked mailed” on a presenation to the 2012 Valnecia Conference.]\nThis is from my book which is the personal recollection of Rolfe’s   contacts with Gonella prior to the formal announcement of the labs and the procedures for cutting the sample:\n“In May, Rolfe met with Gonella in Turin. Gonella informed him about changes in protocol that were going to be made. Rolfe was aghast. The ground had shifted. As he later noted:”\n “’All the meticulous preparations for the test were set aside. It was almost as if they didn’t care anymore.\n“‘They just abandoned all the protocols that had been agreed to by the international team of scientists, cut one sample from the corner (instead of seven from different areas), and sent it off to three arbitrarily selected laboratories (instead of blind and controlled tests to the world’s leading seven laboratories)\n“’Luigi was pale and apologetic. Hours before my [Rolfe’s] arrival he had been instructed ‘from above’ to abandon the protocols, scale back the tests and to allow just three of the labs to have a sample selected at random on the day. This was in sharp contrast to seven labs testing samples taken from several different strategically selected areas Even more disappointing from my point of view was the absence of anything binding on the labs to coordinate publication. De facto, the method of sampling would also make any real claim for the tests being done blind meaningless’.”\n“On June 5, 1987, Rolfe wrote his collaborators informing them that as far as he was concerned, the\ngame was over. Father Rinaldi was shattered.”\n\n","date":"April 22, 2015 at 10:44 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197191","author":"John Klotz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Hi John\nThis is very good information, however it is a bit different from what I was given to understand by an authority in Rome. Professor Luigi Gonella did not seem to be pro-authenticity, but was Professor Carlos Chagas responsible for the decision? Was he the one whispering in the Pope’s ears? I did watch a 20-minute TV report the day he died, where he said that he did not believe that the Shroud was authentic. The problem is that it doesn’t make sense. How could Professor Chagas trample on the protocols he himself prepared?\nWhere can I find Emanuela’s presentation at Valencia? This matter needs further explanation. Also, what did David Rolfe mean by saying “the game is over”? Who was dictating the terms in the game and what kind of game was it?\n\n","date":"April 22, 2015 at 11:15 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197199","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Louis,\nYou venture into the corridors of Vatican intrigue at your own risk. Gove’s memorandum is quite explicit that Chagas was aiding the carbon labs in sabotaging STURP and aiding the labs. Also, that he was  anti-authenticity is from my sources well known. Chagas wrote a memo to the JPII claiming that the STURP proposals for additional testing were more destructive than the carbon dating. That’s why the STURP proposals that they be done in conjunction with the testing was rejected. \nThis has all been pretty much documented particularly by Gove. When I first began my research I was told about Chaga’s intervention and how committed he was to the in-authenticity of the Shroud, He had the Pope’s ear although he probably hid his bias from the\nJPII.\nGonella’s unhappiness with the situation is reported by both Rolfe and Marienelli.\nThank God that Gove’s ego blinded him to the implications of what he reported in his memoir.  \nOne other tidbit. David Sox became a mole for Gove and reported to him what STURP was discussing and doing.\n\n","date":"April 22, 2015 at 11:40 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197206","author":"John Klotz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Louis,\nMarinelli’s Valencia paper is at http://www.shroud.com/pdfs/marinelliv.pdf\nGonella’s blackmail comment is on p. 15 Chagas’s maneuvers are on p. 6, The letter to Turin was signed by the Secretary of State reflecting JPII’s decision. One correction. The three labs that were allowed by the Vatican were to be chosen by Turin. Gove paid a price becasue his lab was not one of the three. I think that Gonella may have had a hand in that. Cardinal Ballestrero made it quite clear that his hands had been tied by the Vatican. It clearly was not what he wanted. Making Gove pay for his arrogance was a small bit of recompense.\nEmanuella’s paper is really quite good.\n\n","date":"April 22, 2015 at 11:58 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197207","author":"John Klotz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Thanks for the link, John. I know what can sometimes go on in Rome. Human nature is complex, but US ambassador Frank Shakespeare did not loose his faith!\nAfter all, the problem is there in other places too.\nNow what surprises me is that Ian Wilson — of all people! — seems to be have got his facts wrong, if what you are telling me is entirely correct. He was all praise for Professor Chagas and laid the blame on Professor Gonella’s shoulders in his books.\nCuriously, Daniel Raffard de Brienne was hesitant to attack Gonella when I queried him, but that was because he found him to be very friendly. \nNow, one last doubt: Who or what was behind Professor Chagas?\n\n","date":"April 22, 2015 at 12:27 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197210","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"I am not sure anyone or thing was behind Chagas except arrogance and touch of anti Americanism. The man is dead. On the other hand, the carbon dating of the Shroud was the beginning of billion dollar enterprise because the labs wanted a test case to show what they can do. Both the US and UK governmental science institutes funded the labs Shroud work. STURP was on its own. Money flows to power and power flows to money.\n\n","date":"April 22, 2015 at 1:27 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197217","author":"John Klotz","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Would you know the names of the institutes, both in the US and the UK?\n\n","date":"April 22, 2015 at 1:36 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197219","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":" “Regarding the Vatican agreeing with theories, it claims no competence in scientific matters but has simply encouraged scientists to continue their research.”\nI’m willing to bet that spokesman didn’t try telling the scientists that it was unscientific to assume a medieval date for the purpose of constructing working hypotheses, Joe, which is the charge you laid at my door – being unscientific – here on this site, March 31st.\nYou also bandied around suggestions that my research was heading towards a dead end through failure to factor in a supernatural event (understandably omitting to state how that could be tested, apart from an appreciative word for Paolo and his laser beams).\nIf you want to see progress – real progress – with no dead ends in sight, not yet at any rate,  I suggest you check out the latest posting on my site.\nhttp://colinb-sciencebuzz.blogspot.co.uk/2015/04/might-this-be-how-turin-shroud-was.html\n Dan too might care to look in when he has a moment to spare.\n\n","date":"April 21, 2015 at 9:19 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197111","author":"Colin Berry","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Colin says:  “…apart from an appreciative word for Paolo and his laser beams.”\n***Angel says:  Laser irradiation!  \nHa, Ha, Ha!   You’re good Colin.\nI’ve noticed in many of your posts, you certainly make use of all the poet’s tools, including philosophical (religious), Horatian and Juvenalian satire.\nReferencing your effort, obviously, only the top fibrils of the linen were scorched (colored), since you repeated the process on the back of the cloth?   Correct?\nIf that be the case, good job.  :)\nBest,\nPS  Typo:  You might want to correct “funigate to “fumigate” on your blog page.\n\n","date":"April 21, 2015 at 11:48 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197123","author":"Angel","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"To Hugh,\n– Firstly modern fluctuations in C-14 simply were known in 1988 by carbonologists such as Wölfli.\n– It does seem you’re totally unaware substantial detergent residue may skew the F14C value.\nTo PHPL re the Holy See questioning the validity of the 1988 results:\nOn August 18, 1990, Vatican spokesman Joaquin Navarro-Valls said in a statement:\n“(The radiocarbon test was) an experimental datum among the others with the validity and also the limits of the sectional tests that have to be integrated in a multidisciplinary field»\n\n","date":"April 22, 2015 at 2:44 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197135","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"…which was not the case INDEED!\n\n","date":"April 22, 2015 at 2:47 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197136","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"“(The radiocarbon test was) an experimental datum among the others with the validity and also the limits of the sectional tests that have to be integrated in a multidisciplinary field»\nAn incidental,  ambiguous,  and low-keyed oral unofficial statement that doesn’t  even address the issue directly.\n\n","date":"April 22, 2015 at 3:38 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197143","author":"PHPL","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"The use of convoluted prose is a feature common to the Holy See and this is not just incidental as you wrongly imply. Besides as Vatican official spokesman, Joaquin Navarro-Valls’s statement WAS official.\n\n","date":"April 22, 2015 at 3:50 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197145","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"The only thing that I agree with is that since Joaquin Navarro-Valls was at that time Vatican’s official spokesman, his oral statement was official.\n\n","date":"April 22, 2015 at 4:15 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197149","author":"PHPL","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Reminder for PHPL: Contaminations such as bioplastic coating + smokes + detergent + invisible microreconstructions etc can cause error in determination of reliable dates as far (linen) cloth radiocarbon dating is concerned.\n\n","date":"April 22, 2015 at 3:28 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197141","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"… And removal of such contaminants is either impossible or almost impossible.\n\n","date":"April 22, 2015 at 3:30 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197142","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"You should immediately  inform the Radiocarbon experts who dated the old cloth about this. I bet that they’ll be very grateful.\n\n","date":"April 22, 2015 at 3:59 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197146","author":"PHPL","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Lab archaeology is one thing. Field Archaeology another. BOTH are needed in determination of reliable dates. In 1988, lab archaeology ONLY prevailed at the expense of a multidisciplinary approach. A shame!\n\n","date":"April 22, 2015 at 4:44 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197151","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Besides (and still archaeologically speaking), in the TS case, there are too many unknowns to allegedly ‘scientifically conclude’ the linen cloth dates back to 1260-1390 CE.\n\n","date":"April 22, 2015 at 4:57 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197154","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Re substantial detergent residue skewing the F14C value see:\nhttp://www.researchgate.net/profile/Jenny_Cappuccio/publication/262230816_%2814%29C_Analysis_of_protein_extracts_from_Bacillus_spores/links/00b7d53bc6ba7bea2a000000.pdf\n\n","date":"April 22, 2015 at 6:02 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197162","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"If Wölfli was aware how detergent could skew radiocarbon dates, he (along with Tite, Hall and Jull) totally overlooked how uncommon contaminants such as bioplastic coating, fumigation smokes, silver fumes and invisible microrecontructions could.\n\n","date":"April 22, 2015 at 3:41 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197144","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Re Colin’s brand new hypothesis (which is now miles aways from his mummy-baking and scorch theories and the like!), if you do keep in mind his key-words are NOW:\n “FUMIGATION/fumes”; “mordant”; “GELATINIZED STARCH”; “printing PASTE”; “ALKALI SOLUTION”; “DRYING”; “pressure/to PRESS DOWN”; “considerable details (= implying high\nresolution)”, \nthen you’d get aware he is JUST RECYCLING my pro-authenticity archaeological theory to fit his pro-forgery view INDEED.\nOn February 16, 2013 at 12:50 pm, I actually wrote:\n“NATURAL CLOTH-TO-CORPSE ARCHAEOLOGICAL MECHANICAL THERMAL CHEMICAL PRINTING”\n“Reminder for Colin Berry et al:\nArchaeo(crypto)logically speaking, in the most likely hypothesis the TSM is Yeshu’a, a natural cloth-to-corpse mechanical thermal chemical imprinting should account in turn for a HIGH RESOLUTION superficial body image, undisturbed bloodstains and a two thousand years’ old degraded blood still looking fresh on the cloth. To trigger up such an accidental/providential image formation process, it requires:\n1/pre- or light MORDANTING conditions (i.e. burial linen cloth in-soaked with AQUEOUS ALKALI SOLUTION such as the Red Heifer waters and/or Jerusalem limestone/Malky dust mixed with waters + ammonia present in urea residues)\n2/auto-collimation (body covered with “opaques” present in the Judean desert and/or Jerusalem limestone/Malakystone dust + long inner burial linen cloth first tautly wrapped lengthwise and then COMPRESSED widthwise around body + NEXT TO SKIN-TO-CLOTH CONTACT followed by gradual loss of next to skin-to-cloth contact through burial inner sheet shrinkage and relative loosening as it gets sort of taut again front and back and gradually unstuck from deceased’s body the latter resting in extra height and being laid first on its left side and then right side while DRYING out\n3/heating source such as corpse in hyperthermia and/or (myrrhic?) aloetic FUMIGATION as a purifying and DRYING-out ritual.\n4/ low temperature ALKALI GELATINISATION OF STARCH residuals present in ancient linen cloth is also a possible factor as PRINTING PASTE to be taken into account in the Shroud image formation process.\nNaturally pre- or light MORDANTED linen once naturally mordanted, the mordanting looks like a very light scorch or “pre-scorch.”\nOn March 16, 2013 at 11:40 a.m. (#5 Reply) and 7:35 p.m. (#21 Reply): I also wrote:\n“As far as the archaeological bloodstain pattern analysis is concerned:\n– Natural mordanting of dry blood remoistened with AQUEOUS ALKALI SOLUTION along with DRYING through myrrhic-aloetic (wood aloe) FUMIGATION could account for:\n– The aged bloodstains still “looking fresh” today when seen in full day on the long inner burial cloth as if the blood had just been shed the day before. Mordant is known to be used for intensifying stains e.g. in cell or tissue preparations\n– Potassium giving only a weak signal in Shroud bloodstains while hydroxyproline (a marker for collagen) giving strong signal. Now it is well known gelatine is a breakdown product of collagen. The true fact is low temperature (55°-85° C) ALKAI GELATINISATION OF STARCH  residuals present in the ancient linen cloth could be a possible factor as bubbling very fine PRINTING PASTE to be taken into account in the Shroud image formation process.\n– Bilirubin is neither the problem nor the solution, just probably one part of the whole equation as it could have been trapped (along with carbon monoxide?) during the image formation process.\n– Most likely dust, dirt and body fluids should be found in the very impurity layer that makes up the body image.”\nOn January 30, 2013 at 8:24 a.m. (#5 Reply), I also wrote:\n“Most likely the bloodstains are aged “re-dried re-moistened freshly dried bloodstains” strongly suggesting the burial sheet was first moistened or in-soaked with AQUEOUS ALKALI SOLUTION (e.g. ashes, Jerusalem limestone dust and/or urea residues mixed with pure living water/collected rainwater). Note: Jerusalem limestone dust mixed with water can GELATINIZED STARCH. Then the moistened/in-soaked burial cloth could have been subjected to a low temperature accidental/providential thermal imprinting process (e.g. ritual FUMIGATIONand/or corpse hyperthermia).”\nOn June 4, 2013 at 8:00 am (#63 Reply), I also wrote:\n“The presence of oozing from the wounds + the very fact the buriers took great care not to disturb the blood is consistent with an ancient Judean/Jewish burial custom in terms of bloody corpse tahara (purification ritual). It has nothing to do with a supernatural event. As a victim of a violent death, the TS man’s body should be buried with his shed innocent blood. Most likely, the neat haematic cartography resulted from a sticking-gradual-unsticking transfer mechanism implying first the clean long inner body sheet soaked in a watery solution was COMPRESSED widthwise (with smaller dry clean outer shrouds + large all-envelopping burial cloth– now kept in Kornelimïnster and known as sudarium domini = the Johnian soudarion) while taut lengthwise back and front as all parts of the body should be wrapped-up (see Naḥmanides, Torat ha-Adam; Inyan ha-hoẓa’ah) and then the tightly wrapped-up bloody corpse, lying in extra height first on one side and then the other side, was subjected to FUMIGATION (in the proscess the long inner body sheet somehow got taut again back and front through shrinking up).”\nBy replacing my (myrrhic?) aloetic fumigation with a nitric one to back up the forgery thesis, Colin is just ‘aping around’.\n\n","date":"April 22, 2015 at 7:54 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197173","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Yes, but the difference between you and me, Max, is that I’m on my 9th model (or variant thereof) in 3+ years, and each and every one has been tested experimentally. It’s through testing and re-testing that I’ve moved from thermostencilling  (early 2012) through contact scorching (and its numerous variants) to fumigation of an organic-based contact-imprint with an oxidizing acid ( a slowish chemical analog of thermal scorching). Every stage has been reported in over 250 postings on my sites, and numerous position statements here, often flagged up by the site’s host (though uncharacteristically remaining silent re my latest – one continues to hold one’s breath, awaiting judgement).\nHow many experiments have you done, Max  (not counting those somewhat subjective ‘thought experiments’ of yours)? How many postings on your own site? Er, remind me, what’s the address of that site? Or are we supposed to access your canon here (how do we do that Dan?)\nMy latest model evolves as we speak. Current experiments suggest there’s was a better imprinting medium than the current standby –  flour paste or gel,  one with which medieval folk were well acquainted, albeit in a different context.  Nuff said for now methinks.  The immediate problem is not a dead end (thanks, JoeM) but deciding upon which of numerous directions to proceed. I also need a break (2 months of non-stop experimentation).\nMy motto: think like a medieval artisan, or dare one say, medieval alchemist.\nHow come the Shroud historians have totally ignored alchemy, a subject in its heyday in the 13th/14th century? Have they not heard of Geber and his extensive writings, including a recipe for generating what we would now call nitric acid fumes (beware: highly oxidizing)?\n\n","date":"April 22, 2015 at 8:21 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197176","author":"Colin Berry","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Colin, Shall I remind you again and again? \n– Contrary to you having plenty of time, I am not on pension but lead a time-consuming professional and personal real life (as opposed to virtual life).\n– Although I came across Dan Porter’s blog by accident rather lately (in october 2011), can you just figure out my own contributions on Dan’s blog just for the last three years and a half or can’t you?\n– My fumigation theory (as intuitive thought experiment) dates back to 1988 (not 2015!).\n– As early as 1994 and 1997, I attempted two achaeological reconstructions of the TS man’s wrapping in shrouds in light of my fumigation theory. When was it last time you have attempted any archaeological reconstruction of the TS man’s wrapping in shrouds and fumigation? \nIn the hypothesis the TS shroud is Yeshua’s my Motto is: Think like Second Temple period buriers and Hakamim as Yeshua’s secret disciples in light of the Shrouds (not copies or substitute relics) still venerated as his. \nAlthough I do admire your dedication as ‘enfant de la science’ to solving the TS enigma and you maybe “on (your) 9th model (or variant thereof) in 3+ years”, the fact remains NOW you’re just ‘aping around’ as far as my fumigation theory is concerned.\nBTW how come you can totally rule out the possibility for the linen cloth to be genuine? How can you tell for sure contaminations such as bioplastic coating + smokes + detergent + invisible microreconstructions etc cannot have caused error in determination of the radiocarbon date as far the TS radiocarbon dating is concerned? Are you just aware the removal of such contaminants is either impossible or almost impossible? \nWere you a REAL scientist (and not an agenda-driven scientist alike Hall et al from sad memory), your motto should be: Think like a forger AND think like Second Temple period buriers and Hakhamim as Yeshua’s secret disciples in light of the Shrouds (not copies or substitute relics) still venerated as his.\n\n","date":"April 22, 2015 at 9:26 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197180","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"This is getting somewhat tedious Max. Last June, I was toying with the idea that quicklime, more specifically its heat of reaction with water – might have been used to produce a thermal image. You immediately jumped on me for stealing ‘your’ idea:\nhttps://shroudstory.com/2014/06/20/maybe-a-new-image-hypothesis/\nThe grounds were tenuous to say the least. Quicklime forms an alkali with water (calcium hydroxide) which was incidental in my model. You claimed I was stealing your “alkali idea, based on your central role for limestone (not an alkali!) and then ammonia (which is). But I never implicated either limestone nor ammonia, and in any case dropped the quicklime idea in short order, finding experimentally there was insufficient heat to raise a template to scorching temperature.\nI’m flattered that you should want to claim credit for at least two of my hypotheses (more I suspect if the truth be told, but I can’t be bothered to delve back further). What you fail to take on board is the fact that I’m my own severest critic, and do not hesitate to dump an idea that fails to stand up to experimental testing. You on the other hand  do not experiment, so consequently your ideas do not evolve. You continue to incant the same 1st century tomb scenario month after month, year after year, and continually scan my new thinking for evidence of plagiarism. \nSorry Max. That’s not scholarship. It’s some kind of attention-seeking – on stilts.\n\n","date":"April 22, 2015 at 10:01 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197185","author":"Colin Berry","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Colin,\nputting words in my mouth and misrepresentng my opinion to mock it, you misleadingly wrote: “your “alkali idea (is) based on your central role for limestone (not an alkali!) and then\nammonia (which is)”\nReminder for Colin: my alkali idea is based on the ALKALINITY of a clear limestone solution such as Jerusalem limestone dust mixed with waters and/or remoistened dried-off urea residues all over the body skin of the TS man and/or ashes mixed with pure living waters (Red Heifer ashes).\n You also wrote: \n“your ideas do not evolve. You continue to incant the same 1st century tomb scenario month after month, year after year, and continually scan my new thinking for evidence of plagiarism.”\nLet’s consider your own alleged ‘evolution’. Re your ‘new thinking’ (fumigation theory) in 2015, the true fact is YOU are painstakingly evolving from your mummy-baking theory TO FINALLY REACH MY FUMIGATION THEORY (1988 to present). My upper cases just in case you haven’t noticed how strange is your ‘evolution’. Indeed the latter does tend to confirm I FINALLY could be right after all FROM THE START and yourself have been erring all through your manyfold hypotheses so far (that’s scholarship indeed)! \nYes Colin, fumigation, so far, is the best theory you can think of via your ‘aping around’; a theory I first had in 1988 INDEED, first presented to the late arch-mirculist Raffard de Brienne in 1994 and still advocate as the most likely to account for the image fromation process! I am flattered that you dropped all your previous ideas and should want to finally take into account my fumigation theory as the most likely (while recycling it to meet your anti-authenticist agenda).\nWhat you fail to take on board is it took me nearly 30 years to really think my fumigation theory does hold water.\n\n","date":"April 22, 2015 at 11:22 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197202","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Now that’s what I call a diatribe and a half Max. There I was thinking the art of delivering an honest-to-goodness diatribe was dead, and you immediately go and excel yourself.\nAs for me, I have to be content with finding more mundane ways of  filling my day, like turning out more images using my, sorry, your new nitric acid fumigation technique.\nGuess what? I’ve found an imprinting medium that has a number of advantages over my, sorry, your flour paste. It’s of animal rather than plant origin, but I’m not telling you what it is, in case you accuse me of plagiarizing what you had for breakfast this morning.\nHere’s an oh-so derivative Hamon imprint off my brass crucifix, before and after ImageJ processing. It’s virtually indistinguishable from one of my oh-so-passé  heat scorches, n’est-ce-pas? Oops. Naughty me.  I’ve gone and plagiarized your native tongue. I’ll probably never hear the end of it.\n\n","date":"April 22, 2015 at 12:19 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197208","author":"Colin Berry","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Colin,\nCan you explain in detail the advantages of your new hypothesis with regard to your ‘old’ scorch hypothesis ?\n\n","date":"April 22, 2015 at 3:04 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197228","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Off the top of my head (maybe with afterthoughts later):\n1. One can imprint off a real person (or statue, bas relief etc). The imprinting medium (flour paste etc) is non-injurious to skin.\n2. One can mould the linen to contours manually if desired, capturing as much or as little of the 3D relief as one wishes (with more or less risk of lateral distortion).\n3. Development  of the image in the fumigation chamber can be monitored visually at intervals over minutes or hours until one has obtained optimum image intensity, and the least damage to linen fibres.\n4. Retained acid fumes after development can be neutralized, either with lime water, or by dry dusting with powdered chalk. However, some weakening of fibres must be expected.\n5.The end-product can be claimed to be an ancient sweat imprint, left on Joseph of Arimathea’s linen when the body was transferred from cross to a makeshift stretcher/body bag.\n6. The technique allows for blood (or blood substitute) to be applied at the same time as body-imprinting medium, provided the blood or substitute stays red in nitric acid fumes (real blood does not – it quickly turns a brown colour). Blood would have been applied after. i.e. directly on top of  the  gooey imprinting medium to account for there being no body image under Shroud “blood”.\n7.The use of an extraneous organic material (flour etc) allows for the possibility of the newly-imprinted and developed image being conspicuous, but slowly fading over the centuries as the pigmented material flaked off or became otherwise degraded, provided there was a fairly stable “ghost image” left behind, the one we see today.\n8. When applied to new linen, the technique has a side-effect that would be seen as a bonus – artificial ageing of the linen. Centuries later, pro-authenticity chemists and others would be delighted to find there was less potential vanillin and more mechanical weakness than would be expected of medieval linen a mere 700 years old.\n9. An imprint developed by oxidation and/or other chemical reactions may (or may not) lack the fluorescence of a thermal scorch image.\n10. Chemical action of limited duration may result in more superficial change to linen fibres than is possible by thermal scorching, such that one sees no colouring at the interface of the SCW and central lumen. Reverse-side coloration can be minimized by suitable adaption of technique (thick linen, use of sizes to block up pores, use of viscous imprinting media etc).\nAs properly noted, all this is simply an hypothesis at this stage, one that will need a lot of experimental work to evaluate, with the possibility of premature paradigm death at any stage. However, I shall be taking a break from experimental work for at least a fortnight  probably longer, these last few weeks having been fairly hectic, spent in and out of the garage, trying to avoid or escape acid spillage and acid fumes, first with the H2SO4, and now with HNO3 (Phase 1 complete).\n\n","date":"April 22, 2015 at 3:47 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197231","author":"Colin Berry","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Thank you very much Colin for your answer.\nI read all what you wrote about your new Nitric acid hypothesis (and more) on your blog.\n1) Years ago, you recalled the true fact that image-area tapes (pressure sensitive adhesive tapes used by STURP team to sample the TS) “lifted” more easily than non-image tapes suggesting that the topmost fibers in the image area were somehow weakened (from Rogers).\nYou concluded that the body image forming process could not involve only the PCW (or an impurity layer) but also the SCW, the main part of  linen fibers that contains about 15 % of hemicellulose.\nI agree. \n2) You add that the lack of color in the SCW of image fibers does not mean that there is no change in the chemical structure of the SCW. Hemicellulose in the SCW can be “broken”  in the SCW with no effect on the cellulose itself . This should explain point 1) and the lack of color in the SCW.\nI agree\n3) The results of your experiment with sulfuric acid (cotton versus linen) strongly suggests that hemicellulose is the key.\nhttp://colinb-sciencebuzz.blogspot.fr/2015/04/what-happens-if-you-spill-battery-acid.html\nI agree.\nNow, looking at your preliminary experiments\nhttp://colinb-sciencebuzz.blogspot.fr/2015/04/might-this-be-how-turin-shroud-was.html\nIt’s clear that the result has nothing to do with the TS image.\nYour hand image has sharp contours and consists of  brown contact stains with many white (no contact) stains within it. This is not at all what we see on the Shroud.\nI understand that your experiments are preliminary experiments.\nMore later.\n\n","date":"April 25, 2015 at 3:24 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197565","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Am I the only one to think there’s a deliberate and sustained attempt by two individuals to blitz the site with trivia,  the intention being to push earlier comments they don’t like out of “Recent Comments”, and thus ‘off the radar’ screen if attached to older postings?\nSince Thibault Heimburger is one of the few people here who actually reads what I’ve said on my own site, instead of misquoting me here, often grotesquely so (“smeared with chemicals” ), I’ll call a temporary truce where he’s concerned, and respond to his 3rd point above with a new posting on my own site. It will be less concerned with the technical detail, like what’s the best imprinting medium to use in a contact-only model that gives the best results in terms of contact/transfer. It will generalize the model, such that it’s simply one based on a two-stage procedure: imprinting with a harmless substance that sticks first to skin, and then transfers easily to linen under light pressure to give a ‘latent’ image. The latter is then converted to the image that existed on the TS when first produced (the nature of which we can only guess at). That second stage is probably one of chemical OR thermal development (the latter as per Garlaschelli). \n First stage Imprinting with second stage development, the two separated in space and time,  sums up the new model, having a great deal in common with Garlaschelli’s (a major influence in my thinking these last 3 years) but some important differences re detail. Let’s not get too bogged down in detail. It’s the principles that matter, especialllly when there are those whoj describe themselves as scientists yet maintain that the TS could never have been produced with conventional science (it then being stated or merely implied that it HAS to have required a supernatural input, and that being their belief, it has to be every one else’s as well, fellow scientists included).\n\n","date":"April 25, 2015 at 10:49 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197606","author":"Colin Berry","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"PS. After sleeping on that list of 10 points, all I would add for now is a gift wrapper in dubious good taste (thinking of the sensibilities that prevail generally on this site, with one or two notable exceptions).\nThere’s a bit of code in scientific research, summed up as “looking  where the light is”. Charles Freeman is the historian with his “just a painting” thesis (dogma?) who is simply “looking where the light is”. PDL and his under-occupied  ENEA pals with  their employers’ laser beams are also looking where the light is, or what they imagine may have existed for a one-off instant in  time, (and thus beyond the remit of science, JoeM).\nMy latest hypothesis explains why the TS is also a one-off, but of medieval provenance,and while difficult to fathom, is still definitely within the remit of science, provided one is prepared to think like a medieval, and not confine one’s search to where the light is.\nMy new starting point, a year or so ago, was to regard the TS as an attempt to replicate Joseph of Arimathea’s linen as it might have looked on arrival at the tomb, BEFORE being replaced by the real burial attire, i.e. Nicodemus’s “winding” sheets after washing and spices, oils etc. It was intended to be a bigger and better whole-body, front and back negative imprint (NOT painting) that would trump the Veil of Veronica, then the major draw for medieval pilgrims according to Neil McGregor, recently retired Director of the British Museum.\nThe task was to simulate a conjoint sweat and blood imprint, but to do it in a way that could/would stand up to the closest critical and sceptical scrutiny (barring the canny bishops of Troyes, watching the upstart ‘relic’ drawing funds away from their own cathedral upkeep ).\nNo, they did not scorch the body image with a heated template, not if the aim was to simulate an ancient sweat imprint. They consulted an alchemist, possibly one with a sympathetic religious disposition (Paul of Taranto, the Franciscan monk?). He in turn delivered state-of-the-art proto-chemical technology, in the form of nitric acid fumes, guaranteed to turn virtually any organic material into a yellow or brown stain on linen. Sure, it weakens the linen itself, but then the fibres on the TS ARE weaker than expected for something that is only 700 years old according to the radiocarbon dating (objections noted). \nIf as I suspect Paul of Taranto, or someone similar, was the brains behind the TS, then we have an explanation for why the TS image is exotic and such a well-kept secret (our alchemist/cleric  may have thought that in harnessing his (al)chemical know how for the greater glory of God, he was saving souls that would otherwise have endured  everlasting torment. In short,  the ends justified the means. A similar hard-headed philosophy appears to prevail to this day (viz. current exposition in Turin).\n\n","date":"April 23, 2015 at 4:10 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197274","author":"Colin Berry","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Hey Colin, Max is Polish.\n\n","date":"April 22, 2015 at 12:28 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197211","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Note: In my latter sentence, pun intended.\n\n","date":"April 22, 2015 at 12:29 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197212","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Methinks Colin just took on board my ‘water holding’ fumigation theory thinking I meant nitric acid. Just guess what will happen?\n\n","date":"April 22, 2015 at 12:36 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197213","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Hi Max\nPlease explain the fumigation you are referring to in some detail.\n\n","date":"April 22, 2015 at 12:59 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197214","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"PHPL wrote ““(The radiocarbon test was) an experimental datum among the others with the validity and also the limits of the sectional tests that have to be integrated in a multidisciplinary field»\nAn incidental, ambiguous, and low-keyed oral unofficial statement that doesn’t even address the issue directly.”\nI found the original Associated Press article titled “Vatican considers new Shroud of Turin Tests,” dated Aug 19, 1990.  Here are several key paragraphs:\n“The Vatican said Saturday it would consider proposals for new scientific tests on the shroud of turin to determine whether the linen is Jesus’ burial cloth.  The announcement by Vatican spokesman Joaquin Navarro cast doubt on earlier test results indicating the shroud was only about 700 years old.”\n“. . . Navarro described the 1988 results as ‘strange’ and said they conflicted with previous tests which indicated the cloth could date back 2,000 years.”\n“Despite the 1988 findings, Ballestrero and other church officials disputed claims the results proved the shroud was a fraud, fake or forgery — words indicating the cloth was meant to deceive people.”\nThere is nothing “incidental, ambiguous and low-keyed” about this.  It clearly states that the Vatican does not accept that the C-14 results prove the Shroud to be a forgery.  Some may feel that the C-14 results do prove the Shroud to be a forgery, which justifies narrowing image-formation theories to medieval origins, but I believe this statement alone is grounds for disputing that stance.\n\n","date":"April 22, 2015 at 9:20 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197255","author":"Joe Marino","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Louis wrote “Would you know the names of the institutes, both in the US and the UK?”  Here is a quote from my Fidelity article of Feb 1989:\n“In April, Harbottle (personal communication, 1988) commented: ‘The experiment is to be performed by the same scientists who not three months earlier clearly and effectively objected to its terms.  But Oxford is heavily supported by the British S.E.R.C. (Science Research Engineering Council) and Tucson equally so by N.S.F. (National Science Foundation); one will be very surprised if shroud dating is not prominently mentioned in heir next round of grant applications.'”\n\n","date":"April 22, 2015 at 9:33 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197256","author":"jmarino240","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Thanks for the information, Joe. The problem is that is still does not answer the question about why Professor Carlos Chagas acted in the way described by John. I do not think it is anti-Americanism, although I have observed that many people in Third World countries tend to be ambivalent when it comes to Americans. They admire their progress, but wanting to be like them, and unable to do so, they become jealous.\nThere is a clue when it comes to who was working behind the scenes, however a little more information is needed to fill a gap.\n\n","date":"April 23, 2015 at 6:17 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197280","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"I do not know in what sense Navarro was a spokesman for ‘the Vatican, or for whom he spoke in 1990.’ ‘The Vatican’ is used as a kind of shield-wall around almost any aspect of the Catholic Church which people feel they don’t know enough about but ought to. There is no organisation called ‘the Vatican.’ The Shroud belongs to the Pope, who is the head of the Catholic Church. He may have personal opinions – as Nabber quotes above – and he may pronounce in his position as head of the Church, which he also does: “Since it is not a matter of faith, the Church has no specific competence to pronounce on these questions.”\nWhatever Navarro’s pronouncement, it doesn’t seem to have led to much in the last 25 years.\n\n","date":"April 23, 2015 at 2:07 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-197268","author":"Hugh Farey","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Hugh, you are trying to couch it in the terms you prefer, but that is a false reading.  JP2 said, “The Holy Shroud is the most splendid relic of the Passion and Resurrection”, and that   is hardly a “personal opinion” in the ears of any fair-minded, religious person.  It speaks to spiritual matters, and the Pope is the head of all spiritual matters for RCs, speaking ex-cathedra or not.  The best that anyone could say about the 2 statements is that the Pope was conflicted, but he indeed spoke on matters of faith both times.  I think he would have been right at home participating on this blog….\n\n","date":"April 30, 2015 at 10:54 am","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-198025","author":"Nabber","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Still doesn’t seem to have led to much…\n\n","date":"April 30, 2015 at 3:59 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-198046","author":"Hugh Farey","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Vatican communications:\nhttp://www.catholicherald.co.uk/news/2015/04/30/pope-francis-appoints-commission-to-reform-vatican-media/\n\n","date":"April 30, 2015 at 5:22 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-198048","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Pope Francis is No.1 on Twitter,eight times more than Pres. Obama:\nhttp://www.thetablet.co.uk/news/2012/0/pope-francis-is-most-influential-world-leader-on-twitter-report-finds\n\n","date":"April 30, 2015 at 5:29 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-198049","author":"Louis","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"I am convinced that the shroud is not at all related to the one from Jesus because of what the scriptures say. In Isaiah, we find that the beard of Jesus was plucked out (the shroud shows a beard), and that he was marred more than any man.  To be marred more than any other man would have be extremely brutal.  I believe that this is saying that Jesus was totally disfigured from appearing human. Even the movie “The Passion of the Christ,” does not do justice to what Isaiah says happened to Jesus.  To be marred more than any other man would leave Him completely unrecognizable.  This is probably why the disciples did not recognize Him on road to Emmaus.  Also, why would Thomas need to see the nail holes in Jesus’ hands, or the sword hole in His side, unless He was unrecognizable facially? The versus below confirm this.\nThus the shroud is not that of Jesus since it is a fairly recognizable face.\nIsa 50:6  I gave my back to the smiters, and my cheeks to them that plucked off the hair: I hid not my face from shame and spitting.\nIsa 52:14  As many were astonied at thee; his visage was so marred more than any man, and his form more than the sons of men:\nThus there was no need for any further testing. However, the carbon date testing simply verifies that the Shroud is not from the time of Jesus, and thus the data should be believed.\n\n","date":"November 2, 2015 at 6:19 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-214108","author":"Bernard Burreson","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Why Issaiah please read 4 Gospels and see how John contradicting with Matthew, Mark and Luke about the burial procedure of Jesus. Who told you that scriptures are telling the absolute truth. Scripyures tell some truth. Jesus asked you to read things with open eyes and open mind.\nBy the way sampling procedure used get a sample to test Carbon Dating are  not sccientific.\n\n","date":"November 2, 2015 at 8:13 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-214114","author":"Sampath Fernando","site":"shroudstory"},{"title":"Carbon Date the Shroud Again?","post":"Bernard’s interpretation of Deutero-Isaiah and John 20 strains the meaning of scripture.  \nIsaiah chapters 50 & 52 were likely composed about 538 BC by a school of prophets in Babylon following the tradition of this prophet during the exile.  As such they cannot be New Testament history but the verses are part of an oracle.  As such they require a particular understanding and careful interpretation.  They are commonly included in the Good Friday liturgy readings because of their aptness to the sufferings of Christ.  But what were the prophet’s intentions in describing the tribulations of his “suffering servant”?  It may have been in the hoped-for rise of a prophetic figure that would release the people from their exile and enable them to return to their home-land.  Many scholars now hold that the suffering servant is Israel in a collective sense.  Christians see them as a prophecy of the sufferings of Christ.  However to read them as a specific detailed historical literal description of the visage of Jesus of Nazareth some half-a-millenium after they were written is a step too far.  \nIn the case of the apostle Thomas needing to see the nail-holes and the wound in the side, the explanation is more simple.  He was not present when Jesus appeared to the others, and it as an expression of his incredulity that Jesus had risen and appeared to them.  When Jesus does appear to them again when Thomas is present, Thomas acknowledges him immediately.    \nBernard says he is convinced that the Shroud is not related to Jesus because of what the scriptures say.  In fact the image on the Shroud reflects the gospel accounts of Christ’s passion quite accurately, and they go further by being more forensically accurate than could be known to any medical science at the time of its discovery in medieval times.  Bernard should investigate and learn what is known about the Shroud.  It is just possible he may be persuaded to change his opinion.\n\n","date":"November 2, 2015 at 11:02 pm","url":"https://shroudstory.com/2015/04/20/carbon-date-the-shroud-again/","cat":"carbon_14_dating","id":"comment-214117","author":"daveb of wellington nz","site":"shroudstory"}]
