[{"title":"Carbon Dating of the Shroud: Digging Even Deeper","post":"Quote : “After a few months ago ENEA researchers have rejected the possibility of a medieval forger.”\nIt’s very weird to see how history is always twisted badly in the Shroud world.  First of all, the statement that there’s absolutely zero possibility for a medieval forgery is true only in the potential case that it was a forger doing some form of unknown artwork.  And this FACT is not a discovery of ENEA at all.  This conclusion was reported first by the STURP team at the beginning of the 80s !  I’m sorry but History (with a big “H”) should not retain that the ENEA is the father of this conclusion while it is, in fact, the STURP team who discover that !  \nHaving say that, I also want to say that, in the case that it would be some forger who would have created the Shroud while using the corpse of a real crucified person like Jesus, I don’t think any credible scientist (not even Di Lazzaro and his group) can absolutely reject this possibility, simply because we still don’t know how the image was formed !  In other words, we know with a very great degree of certainty (let’s say 99 % to stay prudent) that the Shroud image was not made by any kind of art we know (from any period of time in history), but what we don’t know yet, is the question of whether or not this image was created by some chemical process coming from the dead body.  If this possibility would be true, then, in the present state of our knowledge, how can we be 100% sure that the man on the Shroud is really Jesus of Nazareth and not some medieval victim of some genious forger ?  Everyone who know me understand that I don’t defend at all this hypothesis !  But, to stay scientifically correct and prudent, we always have to keep this possibility alive, even if she doesn’t stand high on a probabilistic scale.  Since this is the reality, I don’t think that this quote fron Dan is completely true and correct…  What bugs me the most is the fact that it’s not the first time I read this incorrect statement here.\nUntil we can be 100% sure about the age of the cloth, I don’t think anyone can or should completely reject the hypothesis of a medieval forgery done with some yet-to-be-discovered “natural” chemical processes that came out of a dead and tortured body.  And I also want to say that even if a new C14 test would came out with a first century date, the skeptics could always say that the cloth is authentic but not the image on it (that could have been done on it centuries later).  You see, it will always be impossible to be as categoric as Dan on the possibility that the Shroud can be a forgery.  An artwork ? No !  But a natural kind of forgery ?  It is possible even if it is unlikely.\n\n","date":"March 30, 2012 at 7:17 pm","url":"https://shroudstory.com/2012/03/28/carbon-dating-of-the-shroud-digging-even-deeper/","cat":"carbon_14_dating","id":"comment-9809","author":"Yannick Clément","site":"shroudstory"}]
