[{"title":"New Dawkins Challenge Video","post":"A very recent paper (*) in a peer-reviewed journal regarding the datation of the first artwork and flutes made by modern humans discuss, the C14 method used so far in this field. Authors state that\n“Unfortunately, it is now apparent that the radiocarbon record, constructed over the last 60 years, is significantly flawed and inadequate for rigorously testing these models. This is due to the combined effects of incomplete removal of contamination and the difficulties encountered when dating samples very close to the measurement limit (Higham, 2011). This was either not recognised, or not adequately addressed, at the time of dating. In addition, many of the determinations available for the Middle to Upper Palaeolithic are often only useful in the broadest chronological sense because of measurement imprecision.”\nThere are also some good news:-)\n“The development of more refined methodological approaches has had a significant effect in improving accuracy. The application of ultrafiltration for dating bone, and ABOx-SC methods for dating charcoal have shown for some sites, even those recently dated, that a large proportion of dates may be aberrant”\nAn article worth reading in the context of the Shroud and C14 issue.\n(*) Τesting models for the beginnings of the Aurignacian and the advent of figurative art and music: The radiocarbon chronology of Geißenklösterle by Thomas Highama, , , Laura Basellb, Roger Jacobic, d, 1, Rachel Wooda, e, Christopher Bronk Ramseya, Nicholas J. Conardf, g. Journal of Human EVoution. May 2012.\n\n","date":"May 30, 2012 at 5:30 am","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","id":"comment-11711","author":"Gabriel","site":"shroudstory"},{"title":"New Dawkins Challenge Video","post":"Three things about this paper: (http://www.sciencedirect.com/science/article/pii/S0047248412000425)\n1) Notice that one of the co-author is Dr. Thomas Ramsey from the Oxford lab.\n2) The authors do report issues about decontamination of bones to get accurate result with radio carbon dating. The overall study shows an open minded point of view on the possibility of contamination when confronted with contradictory results. This is something that would also be expected for the Shroud.\n3) One of the main problem does not apply to the Shroud since, for this study, they are using carbon dating at the limit of its capability (artifacts close to 50000 years old).\n\n","date":"May 30, 2012 at 11:59 am","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","id":"comment-11719","author":"Mario Latendresse","site":"shroudstory"},{"title":"New Dawkins Challenge Video","post":"Interesting comment from Mario.  But can’t we think that the principle should roughly be the same for more recent objects ?  As I know, those too can be really affected by contamination of some sorts, especially objects like the Shroud that have been manipulated alot over the years ?\n\n","date":"May 30, 2012 at 1:00 pm","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","id":"comment-11721","author":"Yannick Clément","site":"shroudstory"},{"title":"New Dawkins Challenge Video","post":"I meant 1) Notice that one of the co-authors is Dr. Christopher Ramsey from the Oxford lab (As seen in the video).\n\n","date":"May 30, 2012 at 1:59 pm","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","id":"comment-11725","author":"Mario Latendresse","site":"shroudstory"},{"title":"New Dawkins Challenge Video","post":"I think the radiocarbon method of dating ancient object should be consider as it should be, i.e. as one dating tool among others that can be good at time and bad at time, depending on many factors.  And if, in a particular case of dating an archaeological artifact, the C14 result come up completely off-track regarding all the other evidences concerning this artifact, then, this C14 result must be reject.  This is as simple as that and any good archaeologist would act that way !  And for the Shroud, there’s enough evidences to conclude that the dating of 88 MUST be reject.\n\n","date":"May 30, 2012 at 10:49 am","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","id":"comment-11717","author":"Yannick Clément","site":"shroudstory"},{"title":"New Dawkins Challenge Video","post":"This is interesting…however, according to John chapter 20, Jesus was wrapped in linen cloths (plural) and had a separate cloth wrapped around his head. If Scripture is correct (and I believe it is) then lets throw out the shroud.\n\n","date":"May 30, 2012 at 10:33 pm","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","id":"comment-11737","author":"Miles","site":"shroudstory"},{"title":"New Dawkins Challenge Video","post":"Have you ever thought that the linen cloths mentioned by John could have been the Shroud plus some other (smaller) linen cloths containing a mix of aloes and myrrh (in powder) and those “bags” could have been placed all around the body to avoid bad odours in prevision they had to come back into the tomb to finish properly the burial rite on sunday morning ?  A possible scenario like that would explain the use of “cloths” in the plural by John in his Gospel and you wouldn’t be forced to throw out the Shroud !  And it could also explain why there is no body image of the sides of the body on the Shroud…\n\n","date":"May 31, 2012 at 10:38 am","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","id":"comment-11750","author":"Yannick Clément","site":"shroudstory"},{"title":"New Dawkins Challenge Video","post":"This also agrees with the Synoptics which use the singular in describing the main cloth.\n\n","date":"June 13, 2012 at 11:25 am","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","id":"comment-12396","author":"Ironclad","site":"shroudstory"},{"title":"New Dawkins Challenge Video","post":"A very interesting research has just been made public in Nature http://www.nature.com/news/. In it authors have been able to detect the impact of a huge amount of cosmic radiation of unknown origin that impacted on the Earth in year 776 of CE.\nWe have in the Shroud community researchers that state that radiation coming from the body of Jesus at the moment of the resurrection altered the proportion of C14 in the cloth. As a result, a  C14 test would always yield a much later datation than what it really is. But, what if the radiation came from a natural source in the VIII century, thus modifying the proportion of C14?\nIn the last issue of Nature there is also a very interesting article on how new datation techniques based on rare earths can overcome the shortcomes and limitations of the C14 test. I have commented this before here, but I think these new techniques do represent a reasonable alternative to the C14 test.\n\n","date":"June 4, 2012 at 1:55 pm","url":"https://shroudstory.com/2012/05/29/new-dawkins-challenge-video/","cat":"carbon_14_dating","id":"comment-11904","author":"Gabriel","site":"shroudstory"}]
