[{"title":"A Magical Medieval Shroud","post":"This seems to be a reference to David Roemer, as he kept on going on and on without listening or understanding why he got a negative from Cardinal Timothy Dolan. Who exactly is the “heretic” here, Dolan or Roemer? \nFebruary 11, 2014 at 8:18 am | #63 Quote\nDavid Roemer Re #62. If Cardinal Dolan will not allow you to present your slideshow (at Saint Patrick’s?) that is because of the Shroud Exposition in Turin in 2015 authorised by Pope Francis. How can the Archdiocese of New York contradict the Archdiocese of Turin or the Holy See? You are of course free to present your show, perhaps somewhere else in New York.\nThe Shroud is not a part of the Deposit of Faith, it can be a prop for those whose faith is weak, but it is certainly not the foundation of Faith. That would be ridiculous. Which is why it is strange that one Congregation passed your complaint on to another one, as you say. Cardinal Dolan is not Hans Küng, Leonardo Boff or Tissa Balasuriya, nor has he written a book saying things like Anthony de Mello, to which the Congregation for the Doctrine of the Faith took exception.\n\n","date":"February 13, 2014 at 2:57 pm","url":"https://shroudstory.com/2014/02/13/a-magical-medieval-shroud/","cat":"carbon_14_dating","id":"comment-79065","author":"Louis","site":"shroudstory"},{"title":"A Magical Medieval Shroud","post":"Roemer is miffed because Cardinal Dolan has denied him the opportunity to grand-stand.  I don’t recall that there was a single correspondent in the thread who showed any empathy to his off-the-wall ideas at all. I cannot imagine that New York is entirely bereft of alternative venues where he could do his presentation, if he can find an audience for them.  He needs a church to create an impression that his ideas are in fact ecclesially acceptable, when in fact they are unconventional and not supported by any other reputable student of the Shroud. \nNo other presenter on a Shroud topic seems to have a problem with finding a venue and not all of them are in churches.  I shall be presenting a couple of two hour sessions giving basic Shroud information to a small U3A group in a local hall next month. I only have 34 local U3A members enrolled for it, but it’s a start. I don’t seek to grand-stand, only to share what I know with those prepared to attend and perhaps learn something from it.  My two sessions is among some 40 other various U3A activities programmed for our 5 month U3A semester of some 430 members all with a wide variety of assorted interests. Roemer should know that if anyone has anything worthwhile to say or present, there are always ways and means of finding a forum.\n\n","date":"February 13, 2014 at 3:46 pm","url":"https://shroudstory.com/2014/02/13/a-magical-medieval-shroud/","cat":"carbon_14_dating","id":"comment-79084","author":"daveb of wellington nz","site":"shroudstory"},{"title":"A Magical Medieval Shroud","post":"King Aurthur is more believable.  ***smirk***\n\n","date":"February 13, 2014 at 8:09 pm","url":"https://shroudstory.com/2014/02/13/a-magical-medieval-shroud/","cat":"carbon_14_dating","id":"comment-79152","author":"Andy","site":"shroudstory"}]
