[{"title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake.","post":"An awful lot of people are really bothered by the Shroud, aren’t they. This is an interesting phenomenon in itself.\n\n","date":"December 21, 2011 at 5:06 am","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","id":"comment-5814","author":"AnnieCee","site":"shroudstory"},{"title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake.","post":"I read the article and browsed thru the comments. I suggest Chivers and Ramsey pay close attention to one commenter; PROSCIENTIST, is the name he goes by. It seems to me he’s the only one speaking truthfully and scientifically. I’m a little disturbed by Ramsey’s comments also, I guess he and his lab have alot to loose if people were to realize how BADLY the c14 tests were implemented.PROSCIENTIST makes some very interesting comments towards this particular fact and also to Chiver’s obvious ignorance to all Shroud scientific qualities.\nR\n\n","date":"December 21, 2011 at 8:29 am","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","id":"comment-5823","author":"Ron","site":"shroudstory"},{"title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake.","post":"Quote : But in archaeological science, being able to reproduce something, doesn’t imply that that’s the technique used.  For this part, I agree completely with this guy.\n\n","date":"December 21, 2011 at 11:33 am","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","id":"comment-5834","author":"Yannick Clément","site":"shroudstory"},{"title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake.","post":"You mean Ramsey, when you say this guy I assume. Anyways be careful what you agree on as that analogy goes for any manner of reproduction….including whatever method you may believe caused the imprints….just saying ;-)\nR\n\n","date":"December 21, 2011 at 3:08 pm","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","id":"comment-5843","author":"Ron","site":"shroudstory"},{"title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake.","post":"That is a very good quote and true. – religious people love to jump too conclusions no matter what to protect their beliefs systems.Ramsey just points out the obvious.  \nNo system yet it appears to debunk the radio carbon testing, even Jackson’s carbon hypothesis.  I’m sure Ramsey wants to know the truth and if that means that the dating was wrong I’m sure they would admit it – he’s a scientist – they want to know the truth and gain knowledge. Obviously he admits it could be flawed but nothing has suggested this till date.\n\n","date":"December 21, 2011 at 3:35 pm","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","id":"comment-5847","author":"Matt","site":"shroudstory"},{"title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake.","post":"Yes, I mean Ramsey.  And believe me Ron, I stand to what I just said and of course, I include every possible natural process…  Reproducing a coloration with some technique doesn’t mean this was the technique that was used in the original sample.  This is basic logic and it’s good Ramsey said that.  \nBut one thing we must state clearly here is the fact that those UV experiments proves NOTHING at all regarding the Shroud.  They are far from being able to produce a real body image (or any kind of image whatsoever) with this technique that will have ALL the chemical and physical properties of the Shroud.\nAnd I will add just a personal opinion :  If the body images on the Shroud were created by a by-product of the resurrection, why it has to be UV light ?  In other word, why resurrection would just produce this kind of energy and nothing else ?  If there really was a burst of energy during this event (I don’t believe it one bit but many people here do), why there was no other by-products released at the same time ?  To me, the idea that it was UV light and nothing else that has produced the body images is just completely ridiculous…  I say it again : this is just my personal opinion.\n\n","date":"December 21, 2011 at 4:47 pm","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","id":"comment-5853","author":"Yannick Clément","site":"shroudstory"},{"title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake.","post":"\nMatt :That is a very good quote and true. – religious people love to jump too conclusions no matter what to protect their beliefs systems.Ramsey just points out the obvious.\nNo system yet it appears to debunk the radio carbon testing, even Jackson’s carbon hypothesis. I’m sure Ramsey wants to know the truth and if that means that the dating was wrong I’m sure they would admit it – he’s a scientist – they want to know the truth and gain knowledge. Obviously he admits it could be flawed but nothing has suggested this till date.\nMatt, you’re off track a bit here and I will not wrote down all the published papers (by Ray Rogers and others) that proved that the sample chosen to be dated was not representative of the main part of the Shroud.  Ramsey represent Oxford lab.  In this regard, until new C14 test could be done, he has to be politically correct and stick to the result of 1988.  I think that’s why he don’t make big claims against the result of 88.  He stay prudent.  \nBut I repeat, there’s enough proof that the sample chosen was not representative of the whole cloth.  Now, for the question of what really caused this contamination, the most probable answer is an invisible repair, no matter what Ramsey can say about the weave of the sample…  The repair is just an hypothesis so far. but it fits with Rogers findings, so, to me, it’s the most probable answer to the question of why the sample was not representative of the main cloth.\nAt the very least, there’s enough question about the C14 dating to ask for a new one done in a better condition than it was done in 1988 (with at least 3 different sites dated and a chemical analysis of the samples done before the test).  Unfortunatelly, those things were not done in 88…\n\n","date":"December 21, 2011 at 4:59 pm","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","id":"comment-5854","author":"Yannick Clément","site":"shroudstory"},{"title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake.","post":"And remember that even Julls from the Arizona lab called for a new C14 dating in his 2010 article !!!  That says a lot, don’t you think ?\n\n","date":"December 21, 2011 at 5:03 pm","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","id":"comment-5855","author":"Yannick Clément","site":"shroudstory"},{"title":"Chivers in the Telegraph: Get over it. The Turin Shroud is fake.","post":"Why does everyone feel it neccesary to defend these labs? Read Ramsey’s last statement above…(What utter bullshit!) He’s afraid, they are all afraid, WHY? because they all bumbled terribly the tests from the start. There is tons of evidence to this statement. Where is Joe Marino when you need him? Joe??? back me up here. These lab scientists would be embarrassed to hell if the truth was let out, (it would have ruined their careers back then and maybe still). The true facts have been written and put out there, but this evidence has been stifled.\nThink about the fact that the method of carbon dating used, at the time, was relatively new, even the person whom invented the method had concern to mention ‘certain’ protocols HAD NOT been followed. They never had a textile expert with them when choosing the sample. The samples were never PROPERLY examined or cleaned before testing. There were huge discrepancies in the age ranges, there was no ‘control sample’ as none could be found!! …etc, etc; It was literally the worst mess up in the history of C14 testing, yet everyone still defends these bumbling scientists. This test was a big deal and everyone knew it, it would put their “labs on the map”, make them famous! Why was the sample choosen, not scrutinized by the labs? Or anyone else for that matter? Everyone was silent?…It is as big a mystery as the Shroud itself….\nDoesn’t anyone else find all this odd?\nR\n\n","date":"December 22, 2011 at 8:35 am","url":"https://shroudstory.com/2011/12/21/chivers-in-the-telegraph-get-over-it-the-turin-shroud-is-fake/","cat":"carbon_14_dating","id":"comment-5886","author":"Ron","site":"shroudstory"}]
