[{"title":"Paper Chase:   The origin of Rogers’ Raes and C14 samples by Thibault Heimburger","post":"I fully agree.\n\n","date":"December 1, 2014 at 7:04 am","url":"https://shroudstory.com/2014/12/01/paper-chase-the-origin-of-rogers-raes-and-c14-samples-by-thibault-heimburger/","cat":"paper_chase","id":"comment-174122","author":"ekmcmahon","site":"shroudstory"},{"title":"Paper Chase:   The origin of Rogers’ Raes and C14 samples by Thibault Heimburger","post":"GB may want to rethink his paper.\n\n","date":"December 1, 2014 at 7:15 am","url":"https://shroudstory.com/2014/12/01/paper-chase-the-origin-of-rogers-raes-and-c14-samples-by-thibault-heimburger/","cat":"paper_chase","id":"comment-174125","author":"Paulette","site":"shroudstory"},{"title":"Paper Chase:   The origin of Rogers’ Raes and C14 samples by Thibault Heimburger","post":"I was hoping for newer revelations from M. Heimburger. But I’m a little disappointed. We already knew that Raes’ samples were rejected by the radiocarbon team because they were not reliable. We already knew that the threads of the back sample of 1988 were delivered by Gonella to the people of AMSTAR (or AM*STAR). This was said by Rogers in his response to Card. Ghiberti that Heimburger doesn’t mention. (“Ghiberti’s pronouncement on my analyses”. 2005. http://www.shroud.it/ROGERS-5.PDF ). And it was also well know that it passed from hand to hand. See Antonio Lombatti: “Indagine critica degli studi recenti sulla Sindone di Torino”, Scienza & Paranormale N. 62, 2006. http://www.cicap.org/new/articolo.php?id=102011. Certo, in italano.\nI can hardly believe that Gonella didn’t know how a microscope works. So, M. Heimberger’s explanation why Gonella (and the radiocarbon team) thought the Raes’ samples were not reliable seems uncleared.\nI remember to M. Heimburger that a “private letter” is a “rumour” as a personal communication. I’m afraid that the overall nature of this subject remains on rumours.\nThese are my first impressions to the Hamburger presentation. I think it is too much synthetic and more complete documents were needed. Perhaps it is only a first impression.\n\n","date":"December 2, 2014 at 3:59 am","url":"https://shroudstory.com/2014/12/01/paper-chase-the-origin-of-rogers-raes-and-c14-samples-by-thibault-heimburger/","cat":"paper_chase","id":"comment-174275","author":"David Mo","site":"shroudstory"},{"title":"Paper Chase:   The origin of Rogers’ Raes and C14 samples by Thibault Heimburger","post":"“We already knew that Raes’ samples were rejected by the radiocarbon team because they were not reliable.”\nYes but the question is why? On what basis?\nYes, I wrote that Gonella had some doubts. But why?\nI could not find any reason except that Raes did not keep his sample in safe and\n”  “… then he [Raes] held them for years on his desk where they were seen and\nhandled by several people. (…)” or ”  that a relative of Gilbert Raes had been overhead to say, “We all have pieces of the Shroud now” .(Gonella).\nThis fact does not imply any kind of substitution.\nOn the other side, we know that the Raes samples sent back to Turin\n1) were the 2 pieces cut by Raes (not individual threads) and\n2) that those two pieces did match the cut in the fabric as verified by Gonella himself in 1988 (did you know that ?)\n3) That the Cardinal himself “directed Mons Caramello to give Gonella\nseveral threads from the two samples available since the exposition in 1973 (Raes samples)” (did you know that ?).\n4) That the Raes threads given by Gonella himself to Rogers have all of the characteristics of threads cut out from the Raes samples\n5) And that Gonella gave the threads to Rogers without any kind of warning about the authenticity of these threads.\n6) And that Rogers found the same  characteristics on both his Raes threads and C14 threads (the dye and the high cotton content)   \nHow do you explain that ?\nYou wrote, about the C14 samples given to Rogers: “And it was also well know that it passed from hand to hand. See Antonio Lombatti: “Indagine critica degli studi recenti sulla Sindone di Torino”, Scienza & Paranormale N. 62, 2006. http://www.cicap.org/new/articolo.php?id=102011. Certo, in italano”.\nYes, but I have detailed “the hands”. And I have also explained that there is a very precise chain of custody.\n”  I can hardly believe that Gonella didn’t know how a microscope works. So, M. Heimberger’s explanation why Gonella (and the radiocarbon team) thought the Raes’ samples were not reliable seems uncleared.”\nNo the error was not from Gonella but from Nitowski.\nAnybody who has a microscope can verify that.\nPlease read carefully my paper.\n\n","date":"December 2, 2014 at 3:56 pm","url":"https://shroudstory.com/2014/12/01/paper-chase-the-origin-of-rogers-raes-and-c14-samples-by-thibault-heimburger/","cat":"paper_chase","id":"comment-174339","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Paper Chase:   The origin of Rogers’ Raes and C14 samples by Thibault Heimburger","post":"“No the error was not from Gonella but from Nitowski”.\nYou attributed in your presentation Gonella’s suspicion toward the Raes’s sample to the comment of Nitowski.  “At Gonella’s request, she looked at Raes#5 to check the thread’s twist, since an “S” twist “would quite clearly indicate that a switch had occurred.” (P. 5) If Gonellas’s suspicion had nothing to do with NItowski inexperience with mycroscope, I don’t know why you speak about.\nI  wrote: “We already knew that Raes’ samples were rejected by the radiocarbon team because they were not reliable.”\nYour answer: “Yes but the question is why? On what basis?\nYes, I wrote that Gonella had some doubts. But why?\nI could not find any reason except that Raes did not keep his sample in safe and\n” “… then he [Raes] held them for years on his desk where they were seen and\nhandled by several people. (…)” or ” that a relative of Gilbert Raes had been overhead to say, “We all have pieces of the Shroud now” .(Gonella).\nThis fact does not imply any kind of substitution”.\nThere are other reasons to mistrust of some samples: bad conditions of storage or manipulation. This was the main reason to the radiocarbon dating, according to Riggi di Numana, Rapporto Sindone1978-87, Edizione 3M, Milano, pp. 148-9. \nYou: “Yes, but I have detailed “the hands”. And I have also explained that there is a very precise chain of custody”.\nNo. You have detailed the “hands” according to a “confidential letter” of a sindonist. We don’t know if some manipulations are been done or in what conditions the samples have travelled or have been stored. The same suspicion you cast over the comments of Nitowski are valid to the “confidential letter” of D’Muhala.\n“How do you explain that ?”\nAnd you?\nYou can see Lombatti’s article I quoted. I am not expert in chemist or microscopy. Neither in textile conservationism. Now then I add some personal remarks: \nI only know a thing: the appeal to an invisible mending is impossible because the invisible mending is an entelechy. If you give some explanation, it has to be coherent with the facts and you cannot invent inexistent entities. \nWhen we are speaking of doubts about the authenticity of an artefact every precaution must be taken. The radiocarbon team did the correct thing when rejecting Raes’ samples. Rogers should have done the same. We are speaking of an interval of near twenty five years between Raes and the last experiment of Rogers. \nI’m sorry but it is not to confirm the chain of transmission what you are doing. This is to speculate about it.\n\n","date":"December 3, 2014 at 4:12 am","url":"https://shroudstory.com/2014/12/01/paper-chase-the-origin-of-rogers-raes-and-c14-samples-by-thibault-heimburger/","cat":"paper_chase","id":"comment-174433","author":"David Mo","site":"shroudstory"}]
