[{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"He’s as bad as the Kennedy conspiracy theorists. Red Herrings abound. In the end they are merely bolstering their faith. \nChristianity doesn’t need the shroud, it’s a “nice to have”. Even if the shroud is authentic it doesn’t prove anything other than that Jesus was crucified in the manner the Gospels indicate.\nI can see for some people it could be an alarming thing to even have to acknowledge the existence of Jesus because it then starts to lead down a road they are not comfortable traveling so we have the fevered attack on the shroud.  Even acknowledging Jesus as a real person (though ample historical evidence abounds) is tough for some of these folks – it’s a hard stop at reality. If the shroud can be discredited then it puts off the day they will have to confront any implications it’s reality and authenticity presents.\n\n","date":"June 20, 2013 at 2:20 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37484","author":"Chris","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Unless otherwise indicated in the title or strap, a blog is a place for getting up on a soapbox – NOT a pulpit…\n\n","date":"June 20, 2013 at 2:40 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37485","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Says who? You, Colin? Chris’ comments are most appropriate.\n\n","date":"June 21, 2013 at 9:18 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37591","author":"Dan","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Throw out Rogers’ work and everyone else’s work that has pointed to a tainted sample. All of it. And let’s say the 1988 C-14 dating is above reproach.  There is no mystery other than figuring out how the forger accomplished his task. Colin, what’s your best guess there?\n\n","date":"June 20, 2013 at 3:29 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37490","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"One does not resort to sophisticated AMS carbon-14 dating to tell whether an artefact was forged or not, One does it to determine its age.(There are explanations for a 14th century image of a man on linen that do not initially at any rate involve forgery, or even crucifixion, especially if strategically-located bloodstains, scourge marks etc  were acquired later.)\nRe-investigating which arrived first – blood or body image – is one of two pressing priorities – the other (obviously) being a repeat of the carbon dating at additional sampling sites. It would also be interesting to have the date of the mend-patches and Holland backing cloth determined, to see how close they come to this sceptic’s estimate of their being approximately 200 years younger.\n\n","date":"June 20, 2013 at 3:50 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37491","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"So your theory, if I’m reading you correctly, is that the Shroud is not a forgery, but a natural image that was formed around the 14th century?\n\n","date":"June 20, 2013 at 4:17 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37493","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"The likely reason why the mend patches and holland cloth backing showing a date 200 years younger than their actual recorded historical date following the 1532 fire, being of course, that C-14 is an unreliable method for the dating of textiles??!! Or was that a plant??\n\n","date":"June 20, 2013 at 4:59 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37499","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"CB: “So what did Rogers think? That maybe the alleged splicing and dyeing had been done on or after 1988 in an attempt to contaminate Shroud samples with modern carbon? \nColin’s claims are incomprehensible. \nMost of Rogers’ findings (cotton content, splicing and dye as well as vanillin) are based on the study of several Raes threads (adjacent to the 1988 C14 sample) given to him on 14 October 1979.\n2 small pieces of threads coming from “the center of the radiocarbon dated area” were given to him on 12 December 2003. Very likely from the “Riserva”. Rogers found even more cotton fibers than in Raes threads and the same dye.\nCB: “Alleged splicing and dying”.\nNot “alleged”. This is a fact.\n\n","date":"June 20, 2013 at 4:01 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37492","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Splicing pieces of evidence were discovered in the C14 corner as early as 1982 and 1988. Roger’s and Villarreal’s studies just confirmed the previous findings.\n\n","date":"June 21, 2013 at 10:53 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37604","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"\nDavid Goulet :\nSo your theory, if I’m reading you correctly, is that the Shroud is not a forgery, but a\nnatural image that was formed around the 14th century?\n\nYes, given the wholesale executions of Templar leaders in 1314, notably Jacques de Molay and his associates,  and the abominable means by which that was done (slow roasting over charcoal) it is not beyond the realms of possibility that a Mark 1 Shroud with a scorched-on image was made as a grim memento. Someone later had the bright idea of adding blood to make it seem like a victim of crucifixion, and a highly lucrative series of public exhibitions, starting in Lirey approx 1355 by Geoffroi de Charny’s widow,  based on ‘mistaken identity’ was thus created. The Lirey medallion does not appear to have bloodstains, scourge marks, crown of thorns, hand or feet wounds, lance wound etc but does have something that the medallion maker interpreted as a chain around the waist (for securing the victim to a stake?). In other words the (much neglected) Lirey medallion  appears to depict the Mark 1 Shroud before the man with the paint pot came along. Whether the proto-Shroud was billed as the image of a martyred Templar, or Christ, or a clever mix of the two, has to remain a matter of conjecture.\n\n","date":"June 20, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37497","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"\ndaveb of wellington nz :\nThe likely reason why the mend patches and holland cloth backing showing a date 200 years younger than their actual recorded historical date following the 1532 fire, being of course, that C-14 is an unreliable method for the dating of textiles??!! Or was that a plant??\n\nYou seem to have missed the point. I’m proposing that the Shroud came into existence between approx 1314 (purge of the Templars) and 1355 (approx date of first display at Lirey). The Chambery fire and patching was in 1532 – 1534.  So radiocarbon dating should give an approx 200 year difference, give or take, between the Shroud and later repairs and additions.\n\n","date":"June 20, 2013 at 5:08 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37500","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Interesting theory. But how then was this victim executed? If the bloodstains are possibly later additions, and as you point out there appear to be no major wounds, what was the cause of death? A roasted victim would show some signs of ‘being cooked’. And if there were multiple victims, why not multiple shrouds?\n\n","date":"June 21, 2013 at 9:28 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37592","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"I am certainly open to alternative views, and even welcome them!  How do you make explain the correlation and preciseness of Jesus’s wounds described in the bible to the image on the shroud.  Does it not make more sence to assume the man on the shroud depicts the execution of  Jesus vs. one of the night of the templar leaders.  It seems to me that it takes a greater leap of faith to believe that the man on the shroud is a templar night, not Jesus.\n\n","date":"June 20, 2013 at 6:44 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37508","author":"Brian","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Ah yes. The preciseness of those “wounds”. In that single phrase you have put your finger on two crucial considerations. First: there is too much preciseness for the blood to have been transferred by the mechanisms proposed (serum exudation from clot contraction, reliquefying of “re-moistened”  blood clots etc).  The imprints are simply too good, too uniform,  too well-delineated, too stylized, for that to be the case. \nSecondly, while it is routine to see the words “bloodstain” and “wound”used interchangeably, there is a problem. What one sees on the Shroud are bloodstains, NOT wounds.There is no compelling or persuasive evidence that I am aware of for any laceration or other breaking of skin at any of the locations where one sees blood. One would surely expect to see a prominent laceration for the “lance wound”, for example, but one doesn’t – it’s just blood  (except for those like Prof. Fanti possessed of the eye of faith).\nAs for the distribution of blood being true to the Biblical account, how come there was no reference to nail wounds in the wrist, as distinct from the palm. either in the Bible, or in Western art? The “correctness” of the wrist location was never mooted until the 20th century  and its photographs, when it became necessary to explain a wrist location. Similarly, with the wisdom of hindsight (provided by Shroudology) we now have folk telling us that it was of course a “cap” of thorns, not the popular image, again transmitted in Western art, of a “crown”. The Shroud has made Biblical truth a somewhat malleable commodity, would you not agree?\n\n","date":"June 21, 2013 at 1:53 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37536","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"If you assume the blood was added later, you still have to explain the rest of the wounds and scourge marks.\n\n","date":"June 20, 2013 at 9:48 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37520","author":"Brian","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Scourge marks?\nToo many in some places, not enough in others. Too tidy and methodical a distribution. Insufficient overlap, except in regions of highest density (dorsal shoulders).  In other words: stylized…\n\n","date":"June 21, 2013 at 4:40 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37544","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Are you basing your conclusions on studies done of scourging techniques? Just curious as to how you’ve come to feel the marks are too this or too that. I could imagine an experienced Roman scourger might just see his task as a morbid art from, painting stripes on a human canvass — the same reflex to pattern that a medieval painter would have.\n\n","date":"June 21, 2013 at 9:40 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37593","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"The TS bloodstains can look “stylized” through the UNINITIATED eyes ONLY (reminder: CB is a pseudoShroudologist/pseudo-ShroudSciencist”; see his mummy-baking thermo-stencyling and leech-used-as-felt-tipped painting hypothese).\nThrough the archaeological bloodstain pattern analyst’s eyes, the (paleo)pathologist’s or the archeological cryptanalyst’s, the bloodstains are NOT “stylized” at all. CB has STILL to do some homework to discriminate between falsely positive perception, falsely negative perception, misreading (in terms of non-univocity), photographs and the real thing. Reminder: CB is definitely NOT an archaeological image expert as far as the Turin Shroud image, the Lirey Badge image and the Pray codex image are concerned.\n\n","date":"June 21, 2013 at 6:21 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37551","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"It’s taken this retired PhD science bod some 18 months of hard slog to get a brief mention in the wiki entry for the TS as a “Shroud researcher” (spotted just yesterday through links to each of my two blogs). \nStrangely, “Professor” MPH’s fantastic contributions to Shroud science seem to have been overlooked. Maybe there simply aren’t enough archaeological cryptanalysts or bloodstain pattern analysts out there in the whole “univocity” (?) for his penetrating insights to be appreciated and to receive the recognition they deserve. Incidentally, where did he acquire that professorship? Brooklyn “Univocity”?\n\n","date":"June 21, 2013 at 6:51 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37561","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"CB wrote: “where did he acquire that professorship?” Just ask the French Foreign ministry and the Dean of the former University of Ryiad.\n\n","date":"June 21, 2013 at 7:08 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37566","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Does it takes CB a science PhD to ignore the meaning of the word ‘Univocity’ and non-univocity?\n\n","date":"June 21, 2013 at 7:11 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37567","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"I am a professional cryptologist (cryptology applied to archaeoperception). My CB is just a profesional foodie.\n\n","date":"June 21, 2013 at 7:16 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37569","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Most obviously, we should be MORE skeptical about Wikipedia entries as a primary source of information…\n\n","date":"June 21, 2013 at 7:38 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37574","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"CB  just makes Water Mitty look amateur (see his pseudo-Templar pseudo-archaeological hypothesis). The man is totally out of touch with the historical, paleopathological and archaeological reality.\n\n","date":"June 21, 2013 at 6:31 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37554","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"+ totally out of touch of the philological, literary and iconographical reality too.\n\n","date":"June 21, 2013 at 6:41 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37558","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Typo: Walter Mitty\n\n","date":"June 21, 2013 at 6:36 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37555","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Why did you publish this slime?\n\n","date":"June 21, 2013 at 6:47 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37560","author":"Paulette","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Reminder: CB ( a food chemist) is only in touch with a scientifically non-conclusive result (the 1988 C14 dating), a totally unreliable historical document (“D’Arcis Memorandum”) and his own totally biased iconographical analyse (Pray codex miniatures and Lirey Badge).\n\n","date":"June 21, 2013 at 7:04 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37565","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"I am not – and never was – a food chemist, except briefly while characterizing retrograded enzyme-resistant starch (RS3) as a short chain linear alpha-glucan. \nI trained initially as a biochemist (MSc, PhD) and spent most of my research career in biomedical science (phototherapy of neonatal jaundice, membrane influences on  hepatic glucuronidation of bilirubin and xenobiotics in normal and defective states, protective effects of dietary fibre  (including DF-like resistant starch) against long-term degenerative disease etc. I was Head of Nutrition and Food Safety at the UK’s Flour Milling and Baking Research Association, but most of my research funding came directly from Government.\nIf MPH were the genuine academic he claims to be, he would not be engaging in this unremitting campaign of misrepresentation, driven it would be seem by little more than pique.\n\n","date":"June 21, 2013 at 7:29 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37572","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Pique for pique, MR the wiki-graduated anti-shrouddologist.\n\n","date":"June 21, 2013 at 7:40 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37575","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"MR Berry, It does remain you’re mainly a professional foodie. Your are definitely NOT an archaeoperceptive specialist nor an archaeological image analyst/cryptanalyst (if the words have a meaning for you).\n\n","date":"June 21, 2013 at 7:44 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37576","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Max, don’t you thing that our buffoon foodie with “scientific” complexes does not deserve that much attention from you?\n\n","date":"June 21, 2013 at 10:16 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37602","author":"jesterof","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Jesterof, besides current ad homs, CB’s current misuse of chemistry, iconography, history, archaeology and paleopathology in order to fiercely debunk the TS and forcefully make his points is just additional pseudo-science, pseudo-iconology, junk archaeology and junk bloodstain pattern analysis poisoning the factual/most likely factual Shroud Science-and-Archaeology well. As such methinks it shall be fought back fiercely on a measure-for-measure basis.\n\n","date":"June 21, 2013 at 11:33 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37607","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Breaking news: CB, the Anti-Shroudologist got a brief mention in the wiki entry! So what? Very unimpressive…\n\n","date":"June 21, 2013 at 7:25 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37570","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Walter Mitty is ALSO in the wiki entry.\n\n","date":"June 21, 2013 at 7:27 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37571","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Nor is Dr Berry a forensic pathologist. And yet a number of such pathologists have made detailed studies of the Shroud image wounds and concluded that they are precisely what one would expect. The ‘lance-wound’ for example was well-known to Roman gladiators engaged in mortal combat. The ‘Dying Gaul’ statue in Rome shows precisely this wound. Evidently the sculptor was familiar with it. The question of wrist-nailing is simply a matter of translation semantics. The Greek root ‘chiro-‘ refers to any area between the palm and the forearm. It is used in two biblical texts, John 20:25-27 (doubting Thomas)and in Acts 12:7 “The chains fell from his ‘hands’.” In both cases, ‘wrist’ is a valid translation, and is certainly more apt in the second text, and is now found in modern translations. However Jerome translated ‘chiro-‘ as ‘manus’ in both cases rather than ‘carpus’. Consequently generations of artists have shown a palm-nailed Christ.\nThere is a more fundamental question raised by Dr Berry’s general approach, and that is the role of skepticism in the attainment of certain knowledge, a question which has been debated by philosophers since the ancient Greeks and well into modern times. A persistent skepticism is in fact self-defeating, as it asserts that no certain knowledge is attainable, which is in fact an assertion about knowledge. Kierkegaard was of the view that ultimately, knowledge could only rest on a kind of faith. Skepticism serves as a useful check on rash speculation, but one certainly cannot live by it, without going insane. But if Kierkegaard is correct, I wonder what it is that Dr Berry places his faith in. Is it his profession? Is it himself? Is it some vague notion of proper standards in scientific investigation? I suspect it is probably not some personal view of a Deity, but I could be wrong. Perhaps he is not so very different from the rest of us, and lives by the balance of probabilities and likelihoods. In that case, we may very well come to different conclusions, about quite important matters, like the Shroud, for instance!\n\n","date":"June 21, 2013 at 7:33 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37573","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"“… a number of such pathologists have made detailed studies of the Shroud image wounds and concluded that they are precisely what one would expect.”\nHow can there be any such thing as a “detailed study”, at least in scientific terms, when no one knows for sure how the image was formed  the source of the input energy, or even its precise chemical composition? One even has so-called scientists claiming that supernatural forces were at work!  It’s like those medics who look at subjects in classical works of art, and claim to be able to detect signs of this or that disease…\nOne of the most hilarious contributions to STURP was surely that made by pathologist Robert Bucklin MD.  \nhttp://www.shroud.com/bucklin.htm\nTo read that mock-serious report in all its affected officialese, as if prepared for a coroner’s inquest, one could be forgiven for thinking he had been reporting on a fresh corpse on a mortuary slab.  But he was viewing a faint 2D sepia image on centuries old linen, for crying out loud, same one as you or me, not anyone in the flesh, so to speak. That was  unforgivable pretentiousness and pomposity   on his part –  and typical of so much Shroudology.  From where I am standing, it was for all intents and purposes a comedy sketch.\n Rest assured I shall go on ridiculing and condemning that kind of pseudo-science  wherever and whenever I see it (a guarded thank you btw for jogging my memory re so-called Shroud ‘pathologists’).\n\n","date":"June 21, 2013 at 8:07 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37580","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"But if a pathologist’s (and that’s not to say there wouldn’t be a quack or two among them) analysis cannot be said to carry any weight because we’re dealing with an image of unknown origin, what weight can we assign to your observations about scourge marks and wounds which are based on that same image?\n\n","date":"June 21, 2013 at 9:49 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37594","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"A response to Paulette: Unable to criticize Ray Rogers’ finding scientifically, Colin Berry resorts to  trying to plant unfounded suspicions. Colin, who repeatedly accuses others of ad hominem attacks and the use of pseudoscience, himself, epitomizes these very unprofessional behaviors. He may know chemistry, even know some aspects of it very well, may have a PhD and years of employment experience, but it takes more to be a good scientist and a real researcher, at least to my way of thinking. I thought this needed to be noticed by others and I felt that Colin’s own words demonstrated this better than anything I could say.\n\n","date":"June 21, 2013 at 7:45 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37578","author":"Dan","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Dan, 100% agreed.\n\n","date":"June 21, 2013 at 8:15 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37583","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Every case for sainthood needs a devil’s advocate. Colin fulfills this role very well. He says things about Shroudologists that most of us would not think. I actually see his posts as excellent challenges to debunk the debunker. The more damning his claims the more I look forward to the responses from others here. If the Shroud can stand up to Colin’s fierce debunking attempts then the case for authenticity only grows (and grow it has in my opinion).\nThat being said, the back and forth name-calling and one-up-manship really detracts from the discussion (entertaining as it may be occasionally).\n\n","date":"June 21, 2013 at 9:59 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37597","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Dan, by designating a special blog to an individual with such visible complexes you are actually feeding this disorder. It might be viewed as empathy, but it is not really therapeutic.\nA guy is in his late 60s, probably, and craving for “wiki mentioning” LOL\n\n","date":"June 21, 2013 at 10:20 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37603","author":"jesterof","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Arch-scepticism is mainly based on the ‘doubt as the sole certainty (or G.od)’ sindrome…\n\n","date":"June 21, 2013 at 8:14 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37581","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"…and ignorrogance (that of a learned/PhD ignoramus using the color and taste of Science to fuel general disinformation).\n\n","date":"June 21, 2013 at 8:22 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37584","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"CB should better mind his own pseudo-science…\n\n","date":"June 21, 2013 at 8:32 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37586","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"…as it is no better than arch-miraculists’.\n\n","date":"June 21, 2013 at 8:48 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37588","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"CB wrote: ‘Rest assured I shall go on ridiculing and condemning that kind of pseudo-science wherever and whenever I see it’.\nThe true fact is CB is first and foremost ridiculing and condemning himself as ignoramus with his own pseudo-scientific, pseudo-historical, pseudo-iconographical and  pseudo-archaeological purple patches.\n\n","date":"June 21, 2013 at 10:04 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37598","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Whether or not you like the attitude, character or world-view of someone should not obscure one to any valid points he might make.\n1) At first glance, it looks as if the bloodstains are on top of the image. I don’t think sufficient evidence has yet been put forward to convince me that they are not.\n2) To skew a 1st century carbon date so that it appears to be 13th century by contamination requires a huge proportion of the dated material to be of a later date, about 40% if the contamination is pure modern carbon, about 70% if the contamination is modern cotton, and about 80% if the contamination is 16th century cotton. I don’t think sufficient evidence has yet been put forward to convince me that that is the case.\n3) The concept of a spliced thread is difficult for me to understand. I have looked at the methods of several invisible menders on the internet, and none of them splice threads together. I am both familiar and quite adept at long-splicing rope, so I know the sort of process involved. I don’t find Rogers’s photo very convincing and I find that almost any thread extracted from cloth comes apart quite easily when pulled.\n4) Several pathologists, it is true, have examined the shroud as if it were a photograph, and pronounced it extremely realistic. Bucklin is the least sure of himself, but tends to follow Barbet in all his observations, but Zugibe thinks rather little of either of them, for example demolishing Barbet’s ideas about the “space of Destot” quite ruthlessly, calling him confused and making a serious anatomical error. He also rejects asphyxiation as a cause of death.\n5) Scourging is not uncommon today, and a quick Google for “flagellation” and “Philippines” will show you what it looks like. It is not as easy to reconcile the shroud with photos of the real thing as it is sometimes supposed.\n\n","date":"June 21, 2013 at 11:49 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37608","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"This line of reasoning, which is similar to Colin’s, leaves us with a 14 century cloth with the imprint of a corpse. Was it created accidentally or deliberately? It would appear it would have to have been accidental otherwise why are there no others? Again, if the victim was not crucified (the signs for that having been later embellishments) how did he die? How come no one recognized his features as that of a lost (executed) Templar or otherwise. Who was the opportunist who thought to take this enigma and turn it into a faux relic of Christ?\nIf authenticity is cloaked in mystery, so too alternate explanations.\nOn a side note (not related to your comment) , I find Occam’s Razor and Sherlock Holmes “when all other possibilities…” quote are useless in Shroud studies. They tend to cancel each other out as there are simply too many unknown variables.\n\n","date":"June 21, 2013 at 12:19 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37609","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"….absolutely!  And in the mean time, the man in the shroud is proudly showing off his three D characteristics on the home page of shroud story.com.  Forget, haunted houses, aliens, and government conspiracies…..This is a much bigger chapter in the X-Filies.\n\n","date":"June 21, 2013 at 12:40 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37612","author":"Brian","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Others before me have proposed that the image is that of the last Grand Master of the Knights Templar, ie. Jacques de Molay. Why no others?  Have you seen the price of linen currently? Making it is labour intensive, you know. Imagine what that length of herring-bone weave must have cost, even in the 14th century when labour was cheap (though not that cheap in a prosperous medieval France).\nHow did he die? Mentally subtract the bloodstains from the TS, and there’s no indication whatsoever that the man depicted  had been crucified . Then look at the Lirey Pilgrim’s badge. Again: no reason for thinking the man depicted there on the herring-bone weave had been crucified (yes there are visual cues to Christ’s crucifixion, but one has to wary of the add-ons, and the impressions they were trying to create). Look closely at the Lirey badge, and you may see (with the eye of faith) visual cues that suggest roasting at the stake as distinct from crucifixion, e.g, flesh burned to bone (knees), puffed up arms and legs, a non-Christ like figure who seems to be in excruciating pain, judging by the tilt of the head etc. Certainly the figure, by no stretch of the imagination, could be described as “Christ-like”, yet there are strong grounds for thinking that the Lirey badge depicted the Shroud as it appeared to pilgrims in the mid-14th century, and that it did not have that biblically-correct checklist of bloodstains at that particular point in time. It was merely the double front-and-back image of a naked man with hands crossed to preserve modesty. \nSo it could have been a representation of a Templar knight being burned at the stake, and then (fancifully) being transferred to an up-and-over linen Shroud to leave a scorched-on imprint through transfer of residual heat.  As I say – fanciful. The artist was attempting to “make  a statement”, to create a visual metaphor. In other words, the Shroud image, expensively-produced, was a  then extant – at that time terribly cool style-statement i.e. a 14th century allusion to  the manner in which Christ met his end on the cross – fast forward to the manner in which the hitherto powerful Templars met their end. All it needed was the addition of some strategically-placed bloodstains to morph the latter into the former. \nGenius. Pure genius. It has fooled millions of modern, sophisticated, supposedly science-savvy 20th and 21st century folk, STURP scientists included (but not the radiocarbon daters).  I raise my hat to the man with the red paint (or gut contents of medicinal leeches as I’m inclined to believe).\n\n","date":"June 21, 2013 at 12:53 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37615","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Super-Walter Mitty alias CB first should train to discriminate between facts and fiction. Most obviously he just cannot as far as the Turin Shroud is concerned since he is definitely NOT the right expert in archaeological image analysis/cryptanalysis.\n\n","date":"June 21, 2013 at 1:28 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37620","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Ok, now Mr. Berry.  The next question is, how was it scientifically possible for a charred body, or a body hung on a stake to transfer on to the cloth, the waythat it did?  Of course this probably the question that nobody can answer.\n\n","date":"June 21, 2013 at 2:27 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37636","author":"Brian","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"You also think if this happen under natural circumstances, you would think somebody should be able to figure how the image was transferred onto the cloth, or even reproduce the event\n\n","date":"June 21, 2013 at 2:39 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37639","author":"Brian","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Hugh you wrote: “2) To skew a 1st century carbon date so that it appears to be 13th century by contamination requires a huge proportion of the dated material to be of a later date, about 40% if the contamination is pure modern carbon, about 70% if the contamination is modern cotton, and about 80% if the contamination is 16th century cotton. I don’t think sufficient evidence has yet been put forward to convince me that that is the case.”\nShall I repeat, “XIXth century microreconstructions are most likely (either by the princess Clothilde of Savoy-Bonaparte or the Master of upholstery in the Royal court of Savoy, in 1863).”\n“On aurait, en effet, bien tort de perdre de vue ici que toute la valeur réelle de la datation C14 de 1988, ne repose que sur trois sous-échantillons ne s’avérant, en moyenne, pas plus grands qu’un timbre-poste de 1,69 x 1,32 cm et pesant chacun, toujours en moyenne, 52,83 mg. Le poids unitaire du Linceul étant estimé à 0,023 g/cm2 ± 10%, au sein de l’échantillon parent C14 pesant 158,5 mg ± 0,3mg, il suffirait au pire d’un remplacement soit d’à peine 106 millièmes de gramme ± 10% de fibres textiles originelles du Ier siècle par une quantité égale de fibres beaucoup plus récentes issues de réparations invisibles effectuées entre 1858 et 1988 (estimation haute selon Jackson), soit de seulement 79 millièmes de gramme ± 10% (estimation basse selon Évin) pour que la relique présumée de « 1260-1390 » soit définitivement enlevée au Moyen Age et se retrouve placée à l’époque coloniale romaine. Autant dire qu’à l’échelle de la réalité matérielle de l’objet archéologique\nanalysé, il suffirait de presque rien.”\nHugh, can yo read French?\n\n","date":"June 21, 2013 at 12:38 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37611","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Hi Max, yes I can read French, even when it is very badly punctuated. I should be very grateful if you would break this sentence into shorter segments: “Le poids unitaire du Linceul étant estimé à 0,023 g/cm2 ± 10%, au sein de l’échantillon parent C14 pesant 158,5 mg ± 0,3mg, il suffirait au pire d’un remplacement soit d’à peine 106 millièmes de gramme ± 10% de fibres textiles originelles du Ier siècle par une quantité égale de fibres beaucoup plus récentes issues de réparations invisibles effectuées entre 1858 et 1988 (estimation haute selon Jackson), soit de seulement 79 millièmes de gramme ± 10% (estimation basse selon Évin) pour que la relique présumée de « 1260-1390 » soit définitivement enlevée au Moyen Age et se retrouve placée à l’époque coloniale romaine.”\nAs it stands, the best paraphrase I can manage is : “If the original C14 sample weighed 158.5mg, it would only need 106mg of the 1st century to be replaced by the same mass of recent material (for the date to appear medieval). If only 79mg was replaced, then the date would appear colonial Roman.”\nThis concurs rather loosely with what I wrote above. However, it might be useful to our readers to explain exactly how we arrived at these values. I use the Carbon Dating Calculator at http://dwb4.unl.edu/Chem/CHEM869Z/CHEM869ZLinks/www.all.mq.edu.au/online/edu/egypt/carbdate.htm.\na) Entering 700 (years ago) into the calculator tells us that 91.881% of the original C14 will remain in an artefact that old.\nb) Entering 2000 (years ago) into the calculator tells us that 78.511% of the original C14 will remain in an artefact that old.\nc) Entering 0 (years ago) into the calculator tells us (unsurprisingly) that 100% of the original C14 will remain in an artefact that old.\nThe problem is to calculate how much of Sample (c) must be mixed with Sample (b) to produce a result similar to Sample (a). It is a simple calculation and the answer is 62.147%.\n62.147% of a sample of 158.5mg is 98.5mg.\nI would be very willing to listen to any alternative calculation if I understood it.\n\n","date":"June 21, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37662","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Hugh, actually your reading is half faulty. \nIf we rely on Jackson’s estimate (66,66%), the C14 sample would only need 106mg (that is 0,106g = next to nothing) of the 1st c. CE linen to be replaced in 1863 for the date to appear 1260-1390. \nIf we rely on Evin’s estimate (50%), it would only need 79mg (that is 0,079g = more than next to nothing) to reach the same biased medieval dating.\n\n","date":"June 21, 2013 at 5:24 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37666","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Typo: less than next to nothing\n\n","date":"June 21, 2013 at 5:25 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37667","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Sorry Max, I don’t know what Jackson and Evin’s estimates are. Estimates of what? Of the amount of contamination? How did they come up with their estimates? Anyway, it’s not fair to dismiss 79mg as “next to nothing” when it actually makes up half the sample. It would make just as much sense to say that there was “next to nothing” of the original!\n\n","date":"June 21, 2013 at 5:32 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37668","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Hugh you wrote: “To skew a 1st century carbon date so that it appears to be 13th century by contamination requires a huge proportion of the dated material to be of a later date.” \nThis is to be put in perspective as circumscribed to one or two very tiny area(s).\n\n","date":"June 21, 2013 at 6:12 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37671","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"I thought the problem with the Jacques de Molay theory was that he was burned beyond recognition and he was over 60 yrs old at the time of his death, while the Shroud man is 30 something. This whole theory is a bit disjointed because on one hand it purports that de Molay was scourged and crucified on a door, even cut in the side, in a deliberate mocking of Jesus’ death. While this would support the theory nicely, Colin actually calls into question that there are any wound marks at all. That would undercut the theory, unless it is assumed that de Molay was only burned at the stake..but then we’re back at the problem I mentioned above. \nIf there’s a genius involved here it is that of the creative person who can come up with a theory like this.\n\n","date":"June 21, 2013 at 2:17 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37630","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"As you say, Jacques de Molay was finally reduced to bones and ashes. There were apparently tussles the next day among your friendly neighbourhood ghouls, scrambling for left-overs as souvenirs.\nNo, I dissociate myself completely from those who claim that the image was obtained from the real de Molay, whether in life or death.\nThe image was created months, probably years, later to represent celebrity-status  de Molay (or another martyred Templar). It was imprinted onto linen by scorching, probably from a heated bas relief  intended to serve as a grim reminder of the manner in which he and his associates met their end, slow-roasted over charcoal. Medieval folk, deprived of the internet, needed their outlet too…\n\n","date":"June 21, 2013 at 3:21 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37649","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"They were macabre, that’s for sure. But why a bas relief? And by what method? Every other image process known to that time can be replicated by reverse engineering, but this one can’t (not to the same precision as the Shroud). Surely who ever cottoned on to this scorching technique would have created others, or shared the technique. Any why create a figure with such an odd pose? Is he dead or alive in the image? And if you’re going for realism, which they were if they’re showing him naked and trussed, why portray him as a young man? \nYou see, if you tell me someone was trying to fake a relic of Christ I can see why they’d go with a naked man in his 30’s. You want the shroud to look like the resurrection cloth. But Jacques never had a resurrection (recorded anyway). Or are you saying the forger’s intent was to double-down and make a relic that could honour them both? His inspiration was Jacques, but it could double as Jesus. But that still seems odd because a relic of Christ trumps a relic of a Templar (just check Craigslist).\n\n","date":"June 21, 2013 at 4:01 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37655","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Colin Berry’s theory is just a poorly amateurish attempt to bebunk the TS authenticity. Any scientist or archaeologist WORTH HIS SALT should need more than the eyes of faith (even in the resurrection!) to believe in such Mickey mouse science-and-archaeology! This is just novel-like stuff for the gullible.\n\n","date":"June 21, 2013 at 4:55 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37663","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Colin can you please explain why a medieval artist would create a bas relief that shows the hyper-realistic, assymetrical foot positions that evidently created the image.Also why the gap between the head images rather than just having continuity in the heads on the bas relief? Also just doesn’t seem credible to me that someone creating an image of de Molay would feel the need to do the dorsal image with buttocks etc.\nI’m really struggling to find this theory credible at all.\n\n","date":"June 22, 2013 at 5:41 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37717","author":"Matthias","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Also, if this happen under natural circumstances, you would think somebody should be able to figure out how to reproduce such an event\n\n","date":"June 21, 2013 at 2:36 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37638","author":"Brian","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"To summarize:\n1) CB does not see “wounds”. Me too, I don’t. But how is is possible to see a “wound” on the TS? This is meaningless. The only thing one can expect to see is the bloody imprint of the wounds. And they are there.\n2) CB is a famous pathologist who can write: ”  One of the most hilarious contributions to STURP was surely that made by pathologist Robert Bucklin MD.” . There are also the hilarious contributions of Barbet, Zugibe, Vignon, Delage, Bollone, Cameron, Lavoie, Judica-Cordiglia  etc..\n3) Moreover, CB is a famous historian who thinks ” … that the image is that of the last Grand Master of the Knights Templar, ie. Jacques de Molay. Why no others? Have you seen the price of linen currently? Making it is labour intensive, you know. Imagine what that length of herring-bone weave must have cost, even in the 14th century when labour was cheap (though not that cheap in a prosperous medieval France).”\nHistory, as a science, is based on documents. But in this case we don’t need any document connecting Jacques de Molay to the Shroud image. The argument of the price of linen is irrefutable….\n4) CB: “How did he die? Mentally subtract the bloodstains from the TS, and there’s no indication whatsoever that the man depicted had been crucified . “.\nSo, subtracting the bloodstains, one is supposed to see the result of the crucifixion\nI would like to know what kind of evidence of crucifixion can be expected, except the bloodstains ?\n5) CB wrote :” That maybe the alleged splicing and dyeing had been done on or after 1988 in an attempt to contaminate Shroud samples with modern carbon?”\nAlleged ??? After 1988 ??\nA splice in a Raes thread was discovered by Rogers and definitively demonstrated by a team of the Los Alamos laboratories.To be honest, I have to say that another splice was discovered by Testore in 1988  , but he does not remember the location of this splice (personal email)   \nRogers found the splice and the dye on Raes threads given to him in 1979.\nThibault.\n\n","date":"June 21, 2013 at 4:46 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37661","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"The authors who promoted the idea that it is de Molay who appears on the Shroud are not convincing at all and their agenda is not exactly secret. The whole idea is therefore suspect.\n\n","date":"June 21, 2013 at 5:16 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37664","author":"Louis","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"The hypothesis that the image is meant to represent some unknown templar knight is no more than the product of a desperate imagination, novel writing in the manner of Dan Brown. What is gratuitously asserted can be gratuitously denied. Even Barbet’s analysis identifies the symptoms of crucifixion, regardless of Zugibe’s criticisms on matters of minor detail. Barbet’s work was supported by his own detailed knowledge of pathology, by experimental work with cadavers and amputated limbs, and he was also able to support his findings of a Roman crucifixion by detailed citations from classic literature, much of it from about the 1st century. \nThe Lirey badge includes the coats of arms from both the De Charnay and De Vergy families, both of whom had close ancestral links with the templars. They did not present the cloth as being a representation in memory of any templar, but as the true burial cloth of Christ. This can at least be corroborated by the D’Arcis memorandum. It is known that such a cloth existed in Constantinople from Robert de Clari’s obsrvations there, and by the Patriarch’s complaint to the Pope about Crusaders’ pillaging of the city. The threnos or Lamentation themes in art work about this time depict Christ’s burial in the manner depicted on the Shroud, the Pray manuscript being one such. There is no corresponding tradition supporting a templar image – the product of a desperate imagination.\n\n","date":"June 21, 2013 at 5:22 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37665","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Between doctors Barbet and Zugibe it is the former who is more convincing, the latter attributed the Jospice Mattress Imprint to bilirubin without producing any similar images to support his claim. As for de Molay, he left Cyprus for France to discuss plans for a new crusade to hit back at the Saracens and this was at the request of Clement VI, in Avignon. No heretic or Grand Master who had to be worshipped as a god would agree with this.\n\n","date":"June 21, 2013 at 5:56 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37669","author":"Louis","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"\nHugh Farey :\nSorry Max, I don’t know what Jackson and Evin’s estimates are. Estimates of what? Of the amount of contamination? How did they come up with their estimates? Anyway, it’s not fair to dismiss 79mg as “next to nothing” when it actually makes up half the sample. It would make just as much sense to say that there was “next to nothing” of the original!\n\nYes, for all his posturing, MPH clearly does not have the first clue about carbon-dating technology. His dismissal of “79mg” as next to nothing offers spectacular proof of that.\nOnto more important matters: earlier on this thread we see DaveB attempting to label me as some kind of diehard sceptic where the Shroud is concerned. He does not seem to appreciate that it is he and others who are the diehard sceptics through their refusal to accept the 88 carbon dating – that while they may raise objections based on alleged contamination or restricted sampling sites, the present findings are the only ones we have unless or until there is a repeat determination. What’s more there are those of us who reject the objections, pointing out as I did to DaveB that Jull was unable to confirm Rogers’ claims for reweaving and contamination.\nHowever, there is not need to wait for a re-run of the carbon dating, which some “Shroudie sceptics” have been scrambling to discount in advance. There is an easier way of putting Shroud authenticity to the test that is independent of levels of contamination, real or imagined.\nYou Hugh concur with my view, based in my case on close examination of areas where there appears to have been partial flaking of bloodstains, that the body image is not on top of the bloodstains, as we have been led to believe – a necessary prerequisite for authenticity – but that blood is on top of image.\nElsewhere on this thread, we have Thibault Heimburger agreeing that the evidence for the man in the TS having been crucified rests entirely on those bloodstains – there being nothing in the base image per se to suggest that particular manner of death.\nSo put those two considerations together, and one has a make-or-break test for authenticity (or lack thereof). If the bloodstains really did arrive first, one has evidence consistent with authenticity, evidence that is necessary, although not in itself sufficient. \n But if the bloodstains arrived after the body image, then the Shroud cannot be authentic. Based on the radiocarbon dating, this  mainstream non-sceptic maintains that the Shroud is indeed not authentic, probably being of early 14th century provenance, and confidently predicts that the existing claims for blood first, image second will not stand up to re-investigation..\n\n","date":"June 22, 2013 at 2:35 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37704","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Well oddly enough, I fought the C14 evidence quite hard over on the randi forum, which is rather rougher socially than this one (!), examining Rogers’s paper and contacting Atkinson and Jull about their respective papers, to try to get to the bottom of the statistical anomalies of the original Nature paper. I even tried splicing the ends of two linen threads together. Unlike you, I don’t find anything intrinsically wrong with any of them, and I think there certainly is the progressive contamination demonstrated by Atkinson, possibly caused by Rogers’s paint layer. However, I eventually concluded that there simply isn’t enough of this stuff to make a significant difference to the quoted date, let alone change a 1st century date into a 13th century one. What’s more, nobody seems to have addressed this question convincingly, at least for me.\n\n","date":"June 22, 2013 at 3:46 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37707","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Actually, if the bloodstains came after the image then the shroud could still be authentic- authenticity would not be ruled out by this fact, although the case would be weakened. A valid scenario could be that the image was created somehow from Christ’s body, and the blood was added later to reinforce the image.\nThe trickles of blood along the lower back still seems to me an odd feature if the blood WAS added to the image – what purpose does that serve, beyond the obviously addition of blood to wrists/hands, head etc?\n\n","date":"June 22, 2013 at 5:30 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37713","author":"Matthias","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Hardly your most constructive contribution to date, Matthias,  at least not the first paragraph. In fact I’d describe it as somewhat perverse and unhelpful.\nThe case for the man on the TS having been crucified rests entirely on the bloodstains (I received some support from an unexpected quarter yesterday for that view – namely from Thibault Heimburger no less). If as you suggest the blood was “added later to reinforce the image”, which I take to mean someone else’s blood, then there is no longer any case for saying the man had been crucified, far less that the image was that of Jesus.\nPut more simply: if the blood is fake, then the Shroud is NOT a holy relic, but an unholy attempt to hoodwink.\n\n","date":"June 22, 2013 at 5:52 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37721","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Your first paragraph is very close to Colin’s theory of the blood being a later embellishment (but on a manufactured shroud).\n\n","date":"June 22, 2013 at 7:07 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37802","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Just realized that Colin misunderstood your theory. Or I have. I take it you are suggesting the blood being added later belonged to someone other than Christ?\n\n","date":"June 22, 2013 at 7:09 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37803","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"“You Hugh concur with my view, based in my case on close examination of areas where there appears to have been partial flaking of bloodstains, that the body image is not on top of the bloodstains, as we have been led to believe – a necessary prerequisite for authenticity – but that blood is on top of image”\nColin could you please advise what your “close examination” entailed – presumably examination of Shroud Scope imagery? Was there evidence of image showing through the area where the flaking off is occurring?\n\n","date":"June 22, 2013 at 5:50 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37720","author":"Matthias","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Try googling shroud turin blood denuded areas. Look for the posting at top that has scrutiny and interpretation in its title.\n\n","date":"June 22, 2013 at 6:01 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37723","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"CB wrote: “MPH clearly does not have the first clue about carbon-dating technology. His dismissal of “79mg” as next to nothing offers spectacular proof of that.” \nFirstly, I am NOT dismissing AT ALL the 0,079g JUST trying to put it into perspective as\nthis amounts to very circumscribed microreconstructions (in one or two very small areas) for a 1st c CE old linen to appear to be 13th-14th century CE by contamination (1858-1988 CE carbon replacement).\nSecondly, ‘huge proportion’ here does NOT definitely mean a large quantity.\nIn 2007, I wrote a research paper on the TS C14 dating. Read it FIRST and then criticized (if you can).\n\n","date":"June 22, 2013 at 7:23 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37727","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"(if you can read AND understand French)\n\n","date":"June 22, 2013 at 7:31 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37728","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Link?\nBtw: the reason the sample size is so small is because the instrumentation is highly sensitive, at least the AMS method. But then replicate determinations from those 3 contiguous areas in 1988 means one is not having to place all of one’s trust in a single point sample. (That is so obvious as to hardly need repeating.)\n So why draw attention as you did to a single sample weight if you are so well-informed on the topic as you claim to be?  Why risk creating the impression that you are “un naïf “?\nI shall say no more until I have read your paper (I think I shall cope, having lived in France for a number of years, and still maintaining a bolthole there).\n\n","date":"June 22, 2013 at 8:14 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37736","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"CB: “…we see DaveB attempting to label me as some kind of diehard sceptic where the Shroud is concerned. He does not seem to appreciate that it is he and others who are the diehard sceptics through their refusal to accept the 88 carbon dating – ”\nThis assertion is false, and does not make me any kind of sceptic, under even the mildest of philosophical defintions of scepticism. There are any number of arguments for the authenticity of the Shroud as the burial cloth of Jesus Christ, leading it to be a quite rational conclusion. There are no rational arguments for it to be the impressed imae of a knight templar of the 14th century, an idle speculation of a desparate imagination. There are sound reasons for rejecting the 1988 carbon dating: the various personal agenda driven motives of the participants; the fiasco of argumentation immediately before the sampling; the lack of a proper sampling protocol; the failure to take truly represetative samples; the lack of any kind of previous track record of the particular method used; the rejection of any kind of chemical tests being taken of the specific samples; the susceptibility of the particular sample area to frequent handling and consequent contamination over the course of several centuries; the likelihood that the area was from a patch as shown by subsequent examination of samples from the same area; the ambiguity of C-14 being an appropriate dating method for ancient textiles. In light of all these objections, the only motive for accepting the date as being valid can only be ignorance of true science, or the suspect motives of a die-hard anti-authenticist, a pseudo-sceptic who would robotically accept every possibility that the Shroud could be pretty well everything other than what it appears to be.\n\n","date":"June 22, 2013 at 4:52 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37712","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"I repeat – it is you DaveB who is the sceptic – maybe more thoughtful and eloquent than is generally the case, but a sceptic all the same. You have failed to identify a single flaw that unequivocally discredits the carbon dating, instead reeling off a list of possibles, presumably in the belief that their combined weight compensates for the insubstantial nature of each individually (a common tactic in polemics that should fool no one).\nBut there’s a more fundamental criticism of your stance, given you have chosen to attack the radiocarbon scientists* and their science. You have generated all this hot air, but overlooked to do what is necessary in science – to formulate a hypothesis, better still a prediction that can be tested experimentally.\nHere’s my prediction: that repeat testing of the Shroud at different sites will continue to return a medieval date and that comparison of the Shroud and the original 1534 patches and Holland backing will return an age difference of approx 200 years, perhaps +/- 25 or thereabouts AND, as I said earlier this morning, re-investigation will show that the image is underneath the bloodstains, not vice versa as required for authenticity.\nWhat do you think the scientists will find in repeat testing, and if you think the protocol needs modifying, then say precisely how, and why you think it will return a date that is some 1300 years younger. (See Hugh’s calculation re the necessary level of contamination needed to shift a date by that much).\n* How interesting that you and others are allowed on this site to get away with comments that question or attack not just the objectivity but personal integrity of the radiocarbon scientists, as with your comment “…the various personal agenda driven motives of the participants;”\nSo what are those personal agendas you speak of, DaveB?  How would they result in the “wrong” answer?  What are you suggesting, and in what way does it differ from the misgivings I have expressed re the history and handling of the ‘undocumented’ threads on which Rogers based his claims for contamination?  Forgive me for thinking there is a strong whiff of hypocrisy here.\n\n","date":"June 22, 2013 at 5:31 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37714","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"I reject the criticism outright. On this web-site I write blog comments; there are more appropriate places for the writing of dissertations for the benefit of learned seminars. So my criticisms here are confined to being hopefully brief and to the point. My so-called “list of possibles” have been adequately detailed elsewhere. It is not only the C-14 scientists who were intended as my specific sole target. Hardly anyone at all involved in the procedure gets out of it scot-free. The whole business is adequately covered in a paper “The setting for the radiocarbon dating of the Shroud” by Emanuela Marinelli for instance. There are others as well, such as those by Marino and Benford. It is not my business to design an appropriate sampling protocol for it only to be rejected, as was that of Chagas, who himself failed to take a firm stand on his authority as the owner’s representative. Even Mme Flury-Lemburg discouraged an appropriate sampling procedure, because of her professional ignorance of invisible French weaving. Your so-called prediction is not a prediction at all that is supported by any factual basis, but it is only a mere opinion or guess, no better than any other.\n\n","date":"June 22, 2013 at 7:34 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37729","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"I don’t think  “a sceptic” has to have a particular view of anything; it’s more a general attitude of mind. I think I’m a sceptic. If someone tells me the sky is blue, I wonder how he knows, whether it’s true, or whether there might not be other interpretations. On this blog, I spent many happy posts being sceptical about the blood-flows, the superficial nature of the image and the UV fluorescence, to name but a view; and in another place I have been sceptical about the C14 date and the possibility of the image being a painting. On the way, I learn to doubt almost everything I’m told is a fact (or more often, a FACT!!!), to return to primary sources, and to avoid coming to a conclusion about anything as often as possible. At present, I have no access to the shroud app that has recently appeared, but if anyone reading this has it, I would like to know what the bloodstains look like, especially in the parts where they appear to have flaked off, and what the area around the C14 sample looks like, for evidence of interpolated thread.\n\n","date":"June 22, 2013 at 6:31 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37725","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Alternatively (from William F. Buckley Jr.):\n“The purpose of an open mind is to close it, on particular subjects. If you never do – you’ve simply abdicated the responsibility to think.”\n\n","date":"June 22, 2013 at 6:51 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37726","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"In terms of ‘ANECDOTAL’ FLAWS re the 1988 TS C14 dating:\n1/ Explicit and implicit presence of splicing threads \nIndependently, Hall, Testore, Rogers and Villarreal reported the presence of spliced threads (coton intermixed with linen) in the TS corner. \nIn my 2007 research paper on the TS C14 dating fiasco, I wrote:\n“Parmi ces quelques fils ou sections de fils provenant de cette zone plus sombre que forment le Coin de Raës et plus des deux tiers de l’échantillon C14 officiel, Rogers identifia, consolidé par l’enduit résineux, un fil ayant subi une épissure bout à bout de deux fils d’origines différentes. Des fibres de ce fil s’échappaient, en effet, de sa partie centrale et d’autres fibres situées à ses deux extrémités se trouvaient positionnées en sens inverse. Anomalie qui avait déjà été remarquée en 1988 sur le seul et unique fil qu’examina au microscope le Pr Edward Hall du Laboratoire d’Oxford (Cette anomalie, pourtant elle aussi avérée, n’a pas non plus été évoquée lors de la toute dernière communication de Madame Metchild Flury-Lemberg. On ne peut que le regretter).      \nI also wrote about the 1982 unofficial attempt at radiocarbon dating the TS:\n                  “Comme beaucoup de gens encore aujourd’hui, ils (Tite et al) ignoraient qu’en 1982, un minéralogiste de renommée mondiale, le Pr George R. Rossman du laboratoire de l’Institut Technologique de la Californie (« Caltech ») à Pasa-dena, avait déjà procédé d’une façon non officielle, à un test radiocarbone sur la relique. Le micro-échantillon daté en secret6 avait consisté en un seul et unique fil d’environ 8 cm tiré à partir de la zone de l’échantillon semi triangulaire7 prélevé, en 1973, par le Pr Gilbert Raës ; zone jouxtant celle précisément où avait été extrait l’échantillon C14 officiel.\nLe fil dont une partie était apparue enduite d’une couche superficielle plus sombre avait été coupé en deux. On avait alors abouti, pour le même fil, à une datation à deux extrémités encore plus hétérogènes que celle obtenue en 1988 par les trois autres laboratoires : le  IIe siècle pour la partie apparemment non contaminée et le XIIe  siècle pour l’autre partie pourtant décontaminée (soit un différentiel de mille années !). Rossman ne publia jamais son résultat.\n                      En 1988 tout comme en 1982, le principe même de la datation par la méthode éprouvée du radiocar-bone ne pouvait être mis en cause. Pas plus qu’on ne pouvait douter du sérieux avec lequel furent, à chaque fois, effectuées les mesures de la teneur en radiocarbone surtout lorsqu’on sait qu’en 1988 les diverses phases de la procédure classique de mesure furent doublées voire même triplées pour certains des microéchantillons lors de mesures d’essai. Que des microéchantillons provenant de la même aire du drap puissent refléter cinq points diffé-rents dans le temps (le XVe, XIVe, XIIIe, XIIe et IIe siècle de notre ère), permet de conclure, de toute évidence, non pas à des erreurs aléatoires (hasard statistique ou approximations commises au cours de l’analyse) mais à une erreur systématique due à l’hétérogénéité des échantillons testés. En d’autres termes, cela signifie que toute cette série de datations 14C erratiques du même objet ne pouvaient être dû qu’à un prélèvement d’échantillons de provenance douteuse et à la non élimination de carbones plus récents malgré les traitements physiques et chimiques de nettoyage employés par lesdits laboratoires. En fonction de la valeur réelle du test du khi2 (valeur faussée dans le rapport officiel, 5 pour 1,04), il existe très exactement pas moins de 98,96 chances sur 100 pour que les différences des dates moyennes entre les 3 laboratoires soient dues au manque d’homogénéité du matériel daté en 1988.\n                  Selon le physicien en radiocarbone français Jacques Évin, pour concilier la date historiquement possible du Ier siècle  avec la fameuse datation en âge moyen de 1260-1390, (soit avec la mesure radiocarbone 663 ± 65 années avant la date de référence de 1988), « l’échantillon atypique idéal » devrait avoir été formé, d’un poids de carbone moderne égal au poids de carbone du lin originel ou bien, dit autrement, être composé à 50% de fibres de 1858-1988 et à 50% de fibres du Ier siècle de notre ère parfaitement mêlés. D’après une autre estimation par le physicien américain John Jackson, il était possible que cette proportion fut de deux tiers/un tiers8 (66%-33%).”                         \n2/Statistical sleigh-of-hand (Reminder)\nAs a foot note: “Annoncé officiellement à 5 % (soit juste le seuil de validité admis), le niveau de signification (ou degré de cohérence) des résultats interlaboratoires,  une fois recalculé, s’avéra être totalement faux. Il était, en fait, de 1,04 % c’est-à-dire bien en dessous du seuil critique impliquant, soit qu’une erreur systématique avait été commise au cours de l’analyse (ce qui n’était pas le cas) soit que l’échantillon n’était pas homogène (ce qui était précisément le cas). Ainsi, “par obligation de résultat”, Mme Sheridan Bowman, la responsable de la partie statistique de l’expérience, avait-elle « arrondi » ce chiffre de 1,04% » à 5%. On ne peut que regretter cet excès de zèle par complaisance envers son patron, le Dr Michael Tite. Celui-ci n’avait, en effet, jamais fait mystère qu’il ne croyait pas à l’authenticité du Linceul de Turin.” \nIt just seem the recurrent presence of spliced threads (coton with linen) found in the TS Raes-C14 corner and Tite and Bowman’s gross statistical sleigh-of-hand are just anecdotal pieces of evidence in Hugh’s and CB’s eyes…\n\n","date":"June 22, 2013 at 8:19 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37737","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"“Your so-called prediction is not a prediction at all that is supported by any factual basis, but it is only a mere opinion or guess, no better than any other.”\nThat’s why scientists make predictions, and then proceed to test them – so as to elevate “mere opinion or guesses” to established fact.\nFor all your erudition and engineering background, you don’t have much of a clue about the scientific method, do you DaveB?\n\n","date":"June 22, 2013 at 8:21 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37738","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Utter crap! A PhD in Chemistry, mentor to doctoral students and graduates, who doesn’t comprehend the distinctions between guesses, opinions, forecasts, predictions, consistent results, suspect science, proven science, with his personal agenda of anti-authenticism no matter what; OR more likely, even though he may do so, is prepared to sacrifice truth on his own altar of pseudo-science! This ‘conversation’ is going nowhere, and I see no point in continuing it – You can find another Aunt Sally to indulge your peculiar bigotry.\n\n","date":"June 22, 2013 at 4:20 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37787","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"“This ‘conversation’ is going nowhere…”\nToo true. I repeat – you haven’t the first clue where the scientific method is concerned. Result: a tedious old windbag proclaiming on matters that are outside his area of competence. Go back to your metaphysics and your engineering drawings. Leave the science to the scientists…\n\n","date":"June 22, 2013 at 4:34 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37789","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"All Blacks scored a hat-trick against the cockerel during their present tour of NZ. At Auckland 23-13, Christchurch 30-0, New Plymouth 24-9. They’ll do a few warm-ups against South Africa, Australia & Argentina, then tour to meet France in Paris 24 Nov, ENGLAND in LONDON 16 Nov, Ireland in Dublin 24 Nov; Tediously blow your old scientific windbag on that one!\n\n","date":"June 23, 2013 at 4:58 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37841","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Colin said:\n“Hardly your most constructive contribution to date, Matthias, at least not the first paragraph. In fact I’d describe it as somewhat perverse and unhelpful.”\nI disagree.\nA scientific mind would acknowledge the possibility, if not probability, that the image might have been transferred from Christ’s body, then blood later added. I wouldn’t say it was the most likely scenario nor one that I believe applies, however not necessarily any more fanciful than some other theories. \nMany would describe your own theory as perverse, \n.\n\n","date":"June 22, 2013 at 8:23 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37739","author":"Matthias","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"You are not making any sense, Matthias. When folk cease to make sense, I switch off…\n\n","date":"June 22, 2013 at 8:30 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37741","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Neither are you making any sense Colin. Have you really managed to eliminate all possibilities that blood second means it’s a fake?\n\n","date":"June 22, 2013 at 4:56 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37791","author":"ChrisB","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Colin your theory is that the Shroud is a fabricated bas relief to which has been ADDED blood (via leeches). Matthias is theorizing here that the Shroud could be authentic but that the blood was added later as an artistic touch up. Nearly identical theories. Are you saying both theories then make no sense?\n\n","date":"June 22, 2013 at 6:53 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37801","author":"David Goulet","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Strongly disagree. Hugh farey at least seems to understand my very understandable point – see below. If you are struggling with this then I don’t know what to say…\n\n","date":"June 23, 2013 at 5:45 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37846","author":"matthias","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"For all his posturing, Mr Colin Berry clearly does not have the first clue about carbon-dating technology. His dismissal of the splicing and real Khi2 value  as anecdotal offers spectacular proof of that.\n\n","date":"June 22, 2013 at 8:30 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37742","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Reminder for both Hugh and CB: “il existe très exactement pas moins de 98,96 chances sur 100 (98%) pour que les différences des dates moyennes entre les 3 laboratoires soient dues au manque d’homogénéité du matériel daté en 1988.”\n\n","date":"June 22, 2013 at 9:20 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37745","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"You cite a section from a footnote (Comment 85) under the subheading:  2/Statistical sleigh-of-hand (Reminder).\nI would be interested in seeing that in a fuller context, to see precisely what is being referred to regarding those two different estimates of statistical significance (95 v 99%).\nObviously your “98,96” above is the complement to Sheridan Bowman’s “1.04%”, that much is certain. What is not certain is your own level of arithmetical and statistical competence, given you have rounded 98.96% down to 98% (it should have been rounded up to 99%). No statistician would ever refer to the important 99% level of significance as 98%. The benchmark 99% level is +/- 2.58 standard errors from the sample mean – representing a higher level of significance than the 95% value (+/- 1.96 standard errors).\nYou say it was a “research paper” you are quoting, but I cannot locate it on Google.fr. So where was it published, if at all? I see no evidence above for there being any original “research” (it being essentially a review of other people’s work) but if it was never published then why are you citing it here? Are you willing to be questioned on the detail here (once you provide the requested link, and I can read the paper in its entirety)?\n\n","date":"June 22, 2013 at 10:08 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37746","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"CB you wrote: “you have rounded 98.96% down to 98% (it should have been rounded up to 99%). No statistician would ever refer to the important 99% level of significance as 98%.” \nJust don’t you make TOO MUCH of a mere typo.\nSeveral passages of my 2007 paper were published as comments on this very blog. You probably missed them. \nI wrote the text as I first thought of joining the SSG. Here are two email excerpts from Marcel Alonso:\n1/Marcel ALONSO\n20/06/2009\nà Giulio (Fanti), moi \nCher Ami,\nJ’ai enfin lu attentivement vos textes et je tiens à vous féliciter pour votre travail de synthèse et de présentation, ainsi que votre discernement qui vous permet de mettre en valeur ce qu’il y a de positif dans le fatras des observations publiées.(…)\n2/Marcel ALONSO\n02/07/2009\nà moi\nVeuillez excuser ce retard, j’étais en voyage à Nîmes…\nJ’ai bien reçu votre nouveau texte, toujours intéressant, mais dont les corrections/discussions risquent d’être longues… Or, dans l’immédiat, à la suite de différends avec les principaux leaders du SSG, j’ai été amené finalement à décider de n’y plus participer, et donc je me vois mal y retourner immédiatement en proposant votre admission…\nAujourd’hui, le participant français très actif, et tout à fait qualifié, est le Dr Thibault Heimberger. Je vous propose donc de lui envoyer notre correspondance afin qu’il puisse en prendre la suite et présenter votre candidature, laquelle ne devrait pas poser de problèmes puisque vous semblez pouvoir vous exprimer aisément en Anglais et qu’il me paraît acquis que la version anglaise de votre synthèse intéressera dans l’ensemble les membres présents du\nSSG. (…)\nI finally dropped the idea of joining the SSG (after the 2010 Frascati International Workshop) as I became aware SSG members were most if not all arch-miraculists and I would to have to disagree with most if not all of them… all the time.\nHere is the Résumé:\n                  En 1988 et en contradiction avec les conclusions de près de cent ans de recherches multidisciplinaires, le Linceul de Turin fut déclaré d’origine médiévale par le Dr Michaël Tite, coordinateur des trois laboratoires universi-taires de datation radiocarbone d’Oxford, de Zurich et de Tucson (Arizona) chargés conjointement de dater un échantillon de tissu prélevé sur la relique. À en croire le Pr Évin, porte-parole officiel de l’expérience, ce résultat, était incontestable.\n                  Pourtant, vingt années de contre-expertises plus tard, un noyau irréductible de faits avérés contribuent à accréditer très fortement la thèse selon laquelle, lors d’une petite restauration invisible (voire même de deux) effectuée au XIXe siècle, sous un éclairage rasant et sous une loupe à fort grossissement, du matériel textile étranger de remplacement beaucoup plus récent avait été habilement entremêlé aux fils de lin originels dans le coin supérieur gauche du Linceul d’où avait été extrait l’échantillon.  \n                  Cette matière carbonée, issue d’activités humaines postérieures à la formation du lin, ne fut ni détectée ni éliminée que ce soit par les deux experts textiles responsables du prélèvement ou bien par les trois laboratoires qui procédèrent à la mesure de la teneur carbone 14 résiduelle de l’échantillon officiel.\n                  Pour comprendre comment une telle erreur fut rendue possible, toute une série d’explications cumulatives est ici retenue qui met en lumière la fragilité des observations et du comportement humain des principaux acteurs de l’expertise. \nIt is an original research paper in terms of a meta-analysis.\nI’ll email it to Dan for you to read.\n\n","date":"June 22, 2013 at 11:01 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37750","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Second originality, I advocate a modern (not a medieval) contamination (1863) + a first century contamination (ritual fumigation)\n\n","date":"June 22, 2013 at 11:06 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37752","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"I agree that the Nature paper made an error in assuming that the three different samples tested were all of the same age, and think Atkinson et al. did a very good job of demonstrating that. Progressive contamination of the sample strip seems to me well established. What they did not demonstrate was that the contamination had made a 1st century piece cloth appear to be 13th century.\nAs for the Rossman dating, it appears to be extremely suspect. Apart from Caltech’s own formal denial that Rossman had ever had any dealings with the shroud, or that he had any experience or expertise in dating, or that he had access to FTMS anyway (http://www.shroud.com/late02.htm), it should be noted that FTMS is a hopelessly inadequate method of attempting to quantify a proportion of C14 to C12 atoms, as is even admitted in Benford and Marino’s Textile Evidence paper (http://www.shroud.com/pdfs/textevid.pdf). Adler, from whom this information was obtained, claimed that Rossman was “the world’s expert in it [dating], and there’s no arguing with him.” That statement was palpably untrue.\nSome mention has been made of the ‘fact’ that the different ends of the alleged spliced thread have different twists. This is not obvious from Rogers’s photo, and in fact proves that the splice does not exist, as splicing is only possible if the twists are the same, otherwise the splice would simply unravel as it was being made. (Don’t take my word for it – try it out!)\nFinally, Max says that Hall, Testore and Villarreal also all thought they could see spliced threads. I don’t believe they did, and I don’t believe they said they did. Can Max give us any reference to their findings to substantiate his claim? Villarreal, in particular, looked at threads he was given by Rogers, Benford and Marino and decided that the two ends were the same material (cotton) and that they hadn’t been spliced but glued together. On the basis of the three cotton threads he was given, he felt that the corner piece was not typical of the rest of the shroud (which appears to be pure linen), but as he wasn’t given a representative sample, he could hardly determine how unrepresentative it was.\nApart from the punctuation, I have enjoyed reading Max’s extracts from his Research Paper. However, very little of his information is backed up by sources, which no doubt appear at length at the end of the paper. It would be good to be able to read the whole thing, if it is published on the net anywhere, or at least may I ask him to quote his sources next time he favours us with another extract?\n\n","date":"June 22, 2013 at 10:39 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37748","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Max, it seems that the contamination came together with the centuries, but let me know where you have identified the modern contamination.\n\n","date":"June 22, 2013 at 11:27 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37755","author":"Louis","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Hugh you wrote: “Villarreal, in particular, looked at threads he was given by Rogers, Benford and Marino and decided that the two ends were the same material (cotton) and that they hadn’t been spliced but GLUED together.”\nReminder  1for Hugh: Villarreal revealed that, during testing at the lab, one of the threads came apart in the middle forming two separate pieces.Surprisingly, the two ends of the thread had different chemical compositions, lending credence to the theory that the threads were spliced together during a repair.\nReminder 2 for Hugh: ‘Rogers identifia, consolidé par l’ENDUIT RESINEUX, un fil ayant subi une EPISSURE bout à bout de deux fils d’origines différentes. Des fibres de ce fil s’échappaient, en effet, de sa partie centrale et d’autres fibres situées à ses deux extrémités se trouvaient positionnées en sens inverse. ANOMALIE qui avait déjà été remarquée en 1988 sur le seul et unique fil qu’examina au microscope le Pr Edward Hall du Laboratoire d’Oxford’\nSplicing, glueing (and dying) are part and parcel of invisible microrecontructions…\nHugh can you explain these anomalies? Besides Testore, Rogers, Hall DID notice the same anomaly (splicing). \nYour reply “I don’t believe they (Hall et al) did, and I don’t believe they said they did.” is NO argument at all. Just check Shroud literature (e.g. just see Villarreal 2008 Ohio paper).\n\n","date":"June 22, 2013 at 11:42 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37756","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Hugh, do you really think Hall, Testore, Rogers and Villarreal’s opinion (who DID MATERIALLY examine the threads) are not reliable and your opinion (made from a photograph ONLY) is more reliable than theirs?\n\n","date":"June 22, 2013 at 11:50 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37758","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Max, I have no doubt that the opinions of Hall, Testore, Rogers and Testore are entirely valid and sensible. What I do doubt is that any of them except Rogers observed a splice in a thread. Have you any evidence to the contrary, other than the shift key on your keyboard?\n\n","date":"June 22, 2013 at 1:48 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37773","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Sorry, I posted before seeing this: “Villarreal revealed that, during testing at the lab, one of the threads came apart in the middle forming two separate pieces.Surprisingly, the two ends of the thread had different chemical compositions, lending credence to the theory that the threads were spliced together during a repair.” I don’t know where this idea came from. The 2008 Ohio paper by VillarreaI I have in front of me says that after Rogers had found what he thought was a splice of two different materials, Villarreal found that in fact both ends were cotton. Disappointed by this result, Benford and Schwotz sent him two more threads, and they were both cotton too.\n\n","date":"June 22, 2013 at 2:06 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37775","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Dear Hugh,\nhttp://www.shroud.com/pdfs/thibaultr7part3.pdf\nMore comments later.\n\n","date":"June 22, 2013 at 2:31 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37779","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"A brilliant paper, Thibault, as I might have expected. However…\nThe picture of the “broken splice,” is not a splice. Not in any way I interpret the term splice anyway. The ‘broken’ end is far too tight to be part of a thread that has been joined together by some sort of interweaving of unravelled fibres. It looks more as if the two ends were simply butted together and glued with that “crust” which, surprisingly, is wholly invisible on the picture of the intact thread, and which, in spite of being a completely different colour, Rogers missed.  Whichever it is, however, there is no known method of invisible repair which uses such a splice/join as a way of adding its repair material, and it is difficult to envision any reason why anybody should want to.\nI understand your point about the discrepancy between the FTIR findings (cotton), and your observations (linen mixed with cotton), but am not convinced that all or even most of the Raes and/or C14 sample was made of these interpolated fibres, of whatever material. And that, I guess, is the heart of the matter. I feel certain that the extent of any interpolated material would be visible in the area immediately surrounding the C14 sample on a sufficiently high-resolution photo.\n\n","date":"June 22, 2013 at 4:20 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37788","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"\nMax Patrick Hamon :\nSecond originality, I advocate a modern (not a medieval) contamination (1863) + a first century contamination (ritual fumigation)\n\nSo what you initially described as a “research paper” was never published, never exposed to critical scrutiny. Yet you spring these portions on us here, lacking essential background detail, and expect us to be better informed about the radiocarbon dating, while simultaneously tossing the usual insults in my direction, making out that I am the innocent abroad where the technology and statistical analysis are concerned.\nDon’t bother sending the full “research” paper. I’ve read enough to know it is nothing of the sort. From the little I have seen, it is a pretentious piece of pseudo-academic posturing. You simply build ever higher castles in the sky – with no checks, no self-discipline. That’s in part because you are not affiliated to a centre of learning, and do not understand the nature of scientific enquiry.  Non-stop speculation, awarding yourself ever more fanciful titles, claiming you are the only one properly qualified to comment on the Shroud’s origins and history, is simply not scholarship. It is Walter Mitty-esque fantasising.\nIf your paper with its claimed meta-analysis is still useful after gathering dust all these years, good enough to justify your dispensing it here in dribs and drabs,- leaving folk to assume it has previously been published in full elsewhere, when it hasn’t  – then here’s some free advice: get it updated, then accepted and published on a site to which one can link.\n\n","date":"June 22, 2013 at 12:02 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37761","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"CB wrote: “So what you initially described as a “research paper” was never published, never exposed to critical scrutiny.” \nMethinks CB just cannot read AND understand written French (although he lived 5 years in France!). It was exposed to critical scrutinity. Just ask Marcel Alonso (who did read my paper and accepted it (along with Fanti?) to be read by SSG members. The fact is I just didn’t translate it to be read in English (after Alonso’s resignation from the SSG) and dropped the very idea of joining the SSG (as I just couldn’t accept the arch-miraculistic consensus).\nBTW I am affiliated to the French C.I.E.LT.\nCB just keeps overlooking the real Khi2 value while wanting us to believe he is NOT “innocent abroad where the technology and statistical analysis are concerned”.\nThe true fact is I am better informed about the radiocarbon dating than you whether you like it or not.\nRe building castles in the sky, methinks you’re are the real expert (as a mummy-baker and leech felt-tipper).  Most obviously just cannot not discriminate between facts and fiction and cannot read AND understand French.\n\n","date":"June 22, 2013 at 12:42 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37765","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Enough of this trivia. I’m not a psychologist, but I know someone who is:\nhttp://www.psychologytoday.com/blog/evolution-the-self/201110/the-narcissists-dilemma-they-can-dish-it-out\n\n","date":"June 22, 2013 at 12:46 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37767","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"I am about sure MR ColinBerry can explain the thread anomalies by JUST claiming there is no anomaly…\n\n","date":"June 22, 2013 at 1:05 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37769","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"What about a newly wiki-graduated’s Narcissism?\n\n","date":"June 22, 2013 at 1:08 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37770","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Re the TWO different types of microreconstructions that could mainly account for the linen to appear medieval, I wrote (my 2007 paper on the TS 1988 C14 dating fiasco): \n“Non-détection d’une zone (sinon deux) ayant subi des réparations invisibles à l’œil nu   \nTout cet ensemble d’éléments directs et indirects constitue un faisceau d’indices concordants : il tend à témoigner, dans ladite zone plus raide et plus sombre, d’une intervention selon une technique bien particulière inspirée de la technique du « retissage à la française » (bien connue des maîtres-tapissiers ainsi que des experts en histoire de la tapisserie) ; technique qu’il ne faut cependant pas confondre avec celle d’un simple « entissage » d’un patch médiéval, repérable, quant à lui, à l’œil nu et à la lumière naturelle du jour par un spécialiste.\n                 La technique dont il s’agit ici s’avère plus précisément celle d’un « retissage par épissures », sans coutures ni nœuds, effectuée, semble-t-il, sous un éclairage rasant et sous une loupe à fort grossissement. Elle demande beaucoup de patience et une grande dextérité des doigts. Elle consiste à mettre, tout d’abord, en place les fondations de base et la chaîne. Pour ce faire, soit le tisserand commence par identifier la matière des fibres constituant les fils de chaîne puis se les procure soit il utilise systématiquement des fibres de coton. Ensuite ces fibres sont filées afin d’obtenir l’épaisseur des fils originels puis entortillées avec précaution sur elles-mêmes et sur place aux  fibres des fils de chaîne extraites de la partie cachée du tissu à réparer. Des fils de remplacement de la trame sont alors placés par-dessus et par-dessous les fils de chaîne reconstitués puis les fibres sont entortillées sur elles-mêmes, là encore avec précaution, aux fibres des fils de trame originels de façon à reproduire très exactement la texture ou le motif du tissu et refermer ainsi, sans faire de nœuds, le trou ou la zone sévèrement cisaillée. Pour finir de rendre cette restauration fil à fil tout à fait invisible et consolider les épissures, une teinture à base de gomme résineuse est appliquée localement sur la trame ainsi reconstruite pour que celle-ci, d’où provient l’effet de texture ou de motif, se fonde dans l’original (en l’occurrence la toile jaunie par la patine ivoire des siècles). Cette intervention sous un éclairage rasant et sous une loupe, si elle est bien réalisée et bien dissimulée, peut réellement être invisible sur les deux faces d’une pièce d’étoffe au point d’échapper parfois même à la main et à l’œil exercés d’une personne du métier qui, à l’œil nu et sous une lumière inadéquate, a tendance à confondre ces reconstructions avec des irrégularités apparues au cours du tissage. De fait, la structure artisanale du lin originel du Linceul, son calibre assez fort ainsi que son tissage serré en chevron sont de nature à parfaitement intégrer ce type d’intervention. \n                 Quant à l’échantillon de Zurich (et partant « l’échantillon 1 d’Arizona ») tiré de la partie claire de la bande C14 officielle du Linceul, celui-ci bien que ne présentant apparemment pas ou très peu de trace de contamination par une quelconque teinture14, n’en devait pas moins être recouvert d’une patine de microorganismes. De par l’aspect anormale de la zone où il fut prélevé, il suggère fortement, en tout cas, un second type d’intervention indétectable à l’œil nu car effectuée, elle aussi semble-t-il, sous un éclairage rasant et sous une loupe à fort grossissement : « un raccommodage à perte ». Cette technique consiste très précisément à insérer, entre les fils de trame et de chaîne, des fils (ici de coton) qui, à chaque fois, sont coupés à leurs deux extrémités sans faire de nœuds, les laissant ainsi littéralement se perdre dans le tissu de lin existant. \n                 Ces deux types spécifiques d’intervention (l’une dans le sens d’un remplacement de matière carbonée, l’autre dans celui à la fois d’un remplacement et d’un léger apport) permettraient de rendre compte de la grande dispersion des résultats observée (1238-1407) sur une si petite distance (à peine quatre centimètres de tissu).\n                 L’enduit de gomme arabique étant soluble dans l’eau et présent dans cette zone du coin supérieur gauche, il ne pouvait avoir été appliqué sur les fils superficiels des échantillons Raës et C14 qu’après l’incendie de la Sainte Chapelle de Chambéry de 1532. La teinture l’eût-elle été avant, celle-ci n’aurait pas dissimulé l’extrémité du bord supérieur de la grande auréole dentelée car l’eau de l’incendie eût entraîné les produits de la pyrolyse locale au cœur des fils. Ce revêtement coloré ajouté tardivement explique l’absence de fluorescence aux UV observée dans cette aire particulière du drap. L’histoire de la conservation du Linceul après 1532 permet donc de dater, d’une manière très précise, au moins une sinon les deux interventions. Seules, en effet, les quatre sœurs clarisses, en 1534, et la princesse Clothilde de Savoie-Bonaparte, en 1863, qui intervinrent de façon étendue sur la relique, auraient pu effectuer ce type de réparations invisibles de mains aussi expertes. Les sœurs clarisses s’étant vues confiée la tache bien spécifique de réparer et de consolider la pièce d’étoffe endommagée lors de l’incendie de 1532, la princesse de Savoie-Bonaparte s’avère donc être, pour ces travaux délicats de restauration, la candidate la plus hautement probable (aidée ou non en cela du maître tapissier de la cour royale d’alors). Ce d’autant qu’en 1863, cela faisait déjà plus de cinq siècles qu’à chaque ostension à mains nues, la relique se retrouvait être tendue à l’horizontale. \n                 Tout ceci explique (ou expliquerait) pourquoi, lors de la découpe de l’échantillon et faute d’un éclairage adéquat (en lumière UV ou rasante), ces deux variantes locales passèrent totalement inaperçues aux yeux des experts textiles chargés de superviser le prélèvement pour la datation officielle de 1988. Toute leur attention était alors absorbée soit par l’étude technique du drap (qu’ils voyaient pour la toute première fois) soit par la présence gênante des fils de la couture épaisse qui liaient un résidu de la partie supérieure du Linceul au tissu à découper. Ainsi en oublièrent-ils de procéder à un examen minutieux du cœur même du site textile à prélever. L’eurent-ils examiné, ils n’auraient pu manquer, en effet, d’y repérer la petite reconstruction de forme serpentine, la teinture dissimulant l’extrémité du bord supérieur de la grande auréole d’eau dentelée ainsi que le caractère plus raide et plus sombre de la zone. En principe, une restauration « invisible » ne saurait échapper au compte-fil et a fortiori à la binoculaire lorsque l’œil derrière est compétent. Les photos qui montrent les Prs Francesco Testoré et Gabriel Vial († 2005) s’affairant avec divers instruments sont, cependant, on ne peu plus trompeuses en ce qu’elles laissent croire que lesdits experts étaient occupés à des vérifications préliminaires de l’intégrité de ladite zone quand, de fait, leurs vérifications ne furent pas étendues au cœur de l’échantillon mais se bornèrent à la seule lisière du drap.\n                Ainsi croyant avoir libéré l’échantillon aux bords effilochés de tout fil étranger, laissèrent-ils à l’opérateur, Giovanni Riggi di Numana († 2008), « le soin » de réduire à une bande rectangulaire un peu plus régulière le rectan-gle grossier que celui-ci, à l’aide de ciseaux de chirurgien, venait d’extraire sans gants protecteurs et plus ou moins malhabilement à la pièce principale. \n                      De toute évidence, ce  technicien (à qui échut la responsabilité et du choix de l’emplacement et de la prise d’échantillon !) n’était pas expert textile pas plus qu’il n’était carbonologue ou bien archéologue15. Il semblait en effet ignorer à quel point, en matière de radiodatation, la haute technologie de l’Accélérateur Spectromètre de Masse (adaptée pour les mesures sur des microéchantillons) s’avère être sensible aux contaminations y compris à celle du sébum humain. Ce choix d’une zone qui avait fait l’objet, au cours des siècles, de nombreuses manipulations à mains nues lors des ostensions, était donc déjà, de ce seul point de vue, tout sauf judicieux.”\nHope it can help.\n\n","date":"June 22, 2013 at 5:00 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37793","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"David Goulet at 7.09 pm\nYes, that interpretation is correct. The scenario I raised was that the body image was created from Christ’s body, there were no bloodstains (with Christ having been washed, and no post mortem blood flows leaving stains on the cloth), then later, perhaps in the middle ages, blood was applied onto the shroud, in an effort to elevate the shroud’s status as a holy relic.\nSome historic evidence provides some support for this idea.\nRobert de Clari’s account of 1203 refers to Christ’s figure, but not to a bloodied and crucified figure. The lack of reference to a “bloodied” figure does not of course mean the image he was referring to was NOT bloodied.\nIn addition, Nicholas Mesarites in 1201 refers to the image as the “un-outlined, dead, naked and embalmed body”. Again, no specific reference to bloodstains, but again does not preclude the possibility that the image WAS blood stained. The reference to the dead body might imply bloodstains, or it might not.\nSimilarly, the Pray Manuscript shows Christ laid out, being prepared for burial, and about to be wrapped in a shroud. Again, this image does not show a bloodied Christ. \nNote, I am not saying this is what I think definitely happened. the point of this scenario was to counter Colin’s view that if the bloodstains were on top of the body image, then the case for authenticity would be destroyed.\nAs I outline, the case would not be destroyed, although it probably would be weakened.\nThere are some difficulties for this theory, chief amongst them in my mind:\n– If the blood was added in the middle ages, why the curious trickles of blood across the lower back. Whilst other blood wounds are conceivable as a middle age addition, these trickles of blood argue for the cloth having wrapped a real dead body \n– in my view the blood stains appear hyper real, such as the foot stains. Can we really think that these hyper real blood stains were added in the middle ages, when the depiction of Christ’s blood stains were typically very ‘unrealistic’ (a couple of small red dots on the hands and feet, a little gash and trickle of blood from the side wound). Or maybe the middle ages “blood adder” was really determined to do a really convincing ultra real addition?\n\n","date":"June 22, 2013 at 8:10 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37805","author":"Matthias","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"In the excellent case that art historian Thomas de Wesselow puts forward in support of shroud authenticity, with regard to the bas relief theory he states with regard to the necessary 14 foot long bas relief:\n“The imagined sculpture would have been extraordinary: it would have been vast compared with any other bas-relief of the time” and would have been created by “some eccentric genius” – a high bar.\nClearly, the well credentialed art historian de Wesselow considers the idea that the image was created from a bas relief unlikely.\n\n","date":"June 22, 2013 at 8:28 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37808","author":"Matthias","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"actually upon reflection Mesarite’s reference to the “embalmed” body would probably argue for a non-blooded image of Christ\n\n","date":"June 22, 2013 at 8:31 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37809","author":"Matthias","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"\nChrisB :\nNeither are you making any sense Colin. Have you really managed to eliminate all possibilities that blood second means it’s a fake?\n\nNo, of course I haven’t, but then empirical science does not operate on that basis of managing to “eliminate all possibilities”. How could it hope to do so, when there is no upper limit on the number of  possibilities, of ever-increasing improbability and bizarreness?\nScience, empirical science that is, rooted in experimentation, with formulation and testing of hypotheses, is essentially a Darwinian process, with only the fittest ideas surviving, i.e. those with the greatest predictive utility. It is not, repeat NOT, about the hothouse propagation of weak and sickly ideas that collapse as soon as artificial support is withdrawn.\n\n","date":"June 23, 2013 at 12:48 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37823","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"PS: there are several other responses I wish to provide, especially to Matthias and David Goulet, but as some of you know, I have a low tolerance threshold for trolls and other time-wasters or attention-seekers. I also have other interests outside of Shroudology!  \nSo rather than continue adding my comments piecemeal, I’ll prepare them in Word, and at some point, maybe in a few days or so, hit the Send key when the blogospheric atmosphere here has cooled down and become less febrile..\n\n","date":"June 23, 2013 at 3:50 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37835","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Just a thought, but there might even be a kind of reversal of Matthias’s suggestion. You might get a body – even a live one, if you wanted – and paint blood on him, making sure that you could get the positions of the arms and head in place by trickling drops over them, and the rough shape of his back and legs by covering them with spots. After laying him down on a cloth, covering him up and folding it back, removing the body and exposing the shape thus made, you would have a kind of template for adding your own painting of the body image later! Naturally you would be aware of the distortion caused by wrapping the cloth around the sides, so you wouldn’t have done that; you might have had volunteers holding the sheet flat as it was lowered over the front of the body so that only the upper surface (of the body) touched the sheet.  I haven’t really thought this through yet, but, just as Matthias postulates that a “blood second” hypothesis does not preclude genuineness, I’m postulating that a “blood first” hypothesis does not preclude fakery.\n\n","date":"June 23, 2013 at 4:20 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37838","author":"Hugh Farey","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"\nMax Patrick Hamon :\nCB wrote: “where did he acquire that professorship?” Just ask the French Foreign ministry and the Dean of the former University of Ryiad.\n\nPlease give a name and preferably contact details for that Dean of a University that no longer exists.  \nPlease give links to published work of yours in the open literature.\nYou also described yourself as “Dr” as well as “Professor” on that paper you gave in Poland. Where did you obtain your doctorate and when? Which university? What was the title of your thesis?\nWhy am I having to ask these questions? Why is it that googling your name brings up nothing except papers you have presented at “Shroudie” conferences that are in principle open to anyone and everyone? Yes, I know you also did a paper on Templar graffiti. Where did you say that was published? \nYou appear to concede that your (unpublished ) paper on the radiocarbon dating was not a “research” paper, as I suspected, but what you now describe as a “meta-analysis”. The latter is a review of many published works, using sophisticated statistical multi-variate analysis to see whether or not there is one or more  common underlying factors at work.  So while we await a link to your paper in its entirety, please indicate how many published works formed the basis for your meta analysis, and which statistical procedures were used, the particular software package etc.\nSorry to have to ask these questions, but for someone who uses the titles of Dr, and Professor, you seem to have left remarkably few footprints relating to your research activities.\n\n","date":"June 24, 2013 at 6:24 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37909","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"On December 12, 2012 at 5:52 am (#38 Reply) Dan already wrote:\n“I received the following email from Colin Berry. I decided to post it here in comments rather than make it into a full guest posting. It fits better here:\nHello Dan\nIt’s entirely your business as to whom you allow to make guest postings on your site, and MPH is no exception. However, given that this individual claims to be an expert in so many arcane disciplines, and is constantly questioning the right of others to question his judgements on the grounds that others lack his expertise, surely the time has come for MPH to be more specific about his own qualifications.\n“Former professor at the University of Riyadh (Kingdom of Saudi Arabia)\nFounder and director of LE CERCle (Office for Studies and Research in Cryptology), Reze (France) Independent researcher in Late Antique and Medieval archaeoperceptive cryptology”\nA commentator last year on your site described the above as “unusual”. Yes, it is unusual, not least that “Archaeoperceptive cryptology”, which looks suspiciously like gobbledegook to this untutored mind.\nMight I suggest the time has come for MPH to provide a much fuller cv/resumé listing his degrees, from where obtained, a fuller description of his post at the University of Riyadh and previous academic appointments, and, most important of all, a comprehensive list of his publications in peer-reviewed journals.\nKind regards\nColin Berry”\nOn December 12, 2012 at 11:59 am (#39 Reply), I already replied:\n“I worked 4 years for the French government on French Cultural missions in Saudi Arabia  — as a University professor — and Algeria but this is TOTALLY irrelevant here in a debate on deciphering tiny partial ancient coin patterns on the Turin Sindon as my contribution here is only within the limits of my expertise as a cryptologist applying a new approach to an archaeological enigma namely the Turin Sindon.\nTherefore I will ONLY tell you about me WHAT IS REALLY RELEVANT to know in this debate and no more namely I am a professional cryptologist (since 2005) who created 5 new approaches in cryptology among which one applied to criminology and another to both Late Antique and Medieval archaeology in relation with enigmatic image, inscription and text perception. \nI first applied my archaeocryptological/archaeopereptive approach (in 2006) to the enigmatic graffiti in the Coudray Tower, Chinon, France (see my 2006 Loches paper entitled “D’une pierre a graffiti templiers dans la tour du Coudray à Chinon”, proceedings 4ème Colloque national sur les Graffiti Anciens de Loches, 2010, éd. ASPAG/Indre Regional Council).\nI was an amateur cryptologist for 20 years and have been a professional cryptologist for more than 7 years to present (i.e. I have a 27 years’ experience as a cryptologist).\nI am also a Shroud scholar and researcher (I first got interested in the Turin Shroud as early as 1988). I attended 4 international Turin Shroud conferences, in Nice (France, 1997), Turin (Italy, 1998), Frascati (Italy, 2010) and Torun (Poland, 2011) and made an indirect contribution in the first one and a direct contribution in the last 3 of them).”\nReminder for CB: Don’t you put words in my mouth, I NEVER described myself as “Dr”, only as “Professor” (the fact is the title “Dr” in stead of “Pr”  may have appeared in an international conference program but this is not my responsibility). In France the Academic ranks differ from the English speaking countries. Prior to 1984, in France you did’t need to have a PhD to be a University professor but had to pass ‘un concours’ and be hired by the French ministry of Foreign Affairs to teach abroad as such. \nBTW, in France, meta-analysis is acknowledged as research work in se. It does seem MR Colin Berry (who lived 5 years in France and cannot even read AND understand French) is also ignorant of the fact.\nRE MR Colin Berry most spurious interpretation of the Lirey badge within his Scorch theory + his denial/utter ignorance of the real Khi2 value as far as the TS 1988 radiocarbon dating is concerned, can Colin Berry NOW tell us what is his expertise in Templar archaeology AND meta-analysis? Can also CB tell us how many international Turin Shroud conferences for arch-sceptics he made a valuable contribution in and what is his qualifications as a statistician and radiocarbon physicist?\nWAITING FOR YOUR REPLY, MR Colin Berry the SCIENCE & ARCHAEOLOGY  IGNORAMUS\n\n","date":"June 24, 2013 at 11:30 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37936","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Re my RESEARCH paper on the TS 1988 radiocarbon dating: \nBibliographie (par ordre chronologique)\n• The Frenway System of French Reweaving, Fabricon Compagny Chicago, Illinois, 1951.\n• Radiological Examination of the Shroud of Turin – A Preliminary Report, Mottern, Landon et Morris, 1979.\n• Rapporto Sindone, Giovanni Riggi di Numana, éd. 3M, Milan 1988.\n• Rogue Fibres found in the Shroud, P.H. South, Textile Horizons, Décembre 1988, p. 8.\n• Radiocarbon Dating of the Shroud of Turin, Nature, Vol. 337, n° 6208, 16 février 1989, pp. 611-615.\n• Le Saint-Suaire. Examen et prélèvement effectués le 21 avril 1988, Franco Testore, 1990.\n• Prélèvement d’un morceau de tissu, Giovanni Riggi di Numana, 1990.\n• Le Saint-Suaire, « C’est l’Étendard de notre Salut », Bruno Bonnet-Eymard, la Contre-Réforme Catholique, n° spécial 271, 1991.\n• La Sindone di Torino e la sua radiodatazione, Maria Grazia Siliato, Actes du Symposium de Rome, pp. 243-246, éd. François-Xavier de Guibert, 1993.\n• Carbon-14 in Perspective, John Jackson, Sindon, VIIIème année, cahier n°9-10, 1996.\n• Radiocarbon Dating the Shroud – A Critical Statistical Analysis, Rémy Van Haelst, 1997.\n• Mécanisme de formation de l’image du Crucifié sur le Linceul de Turin : la solution archéologique de l’énigme ? ou Vers une nouvelle orientation des recherches, Max Patrick Hamon, Rezé, (première version non finalisée du dossier diffusée lors du IIIe Symposium International de Sindonologie de Nice en 1997).\n• Contre-enquête sur le Saint Suaire, Maria Grazia Siliato, éd. Plon, Paris 1998.\n• La soluzione archeologica dell’enigma o verso una nuova orientazione delle richerche sulla generazione dell’immagine sur Lenzuolo Mortuario di Torino, (prologue) Max Patrick Hamon, IIIe Congrès international de Sindonologie, Turin (Italie), 1998.\n• The 1988 Shroud of Turin Radiocarbon Tests Reconsidered (Part I & II), Bryan Walsh, 1999.\n• La datation du Linceul de Turin : le point de vue d’un spécialiste du radiocarbone, Jacques Évin, 2000.\n• Evidence for the Skewing of the C-14 dating of the Shroud of Turin due to Repairs, M. Sue Benford et Joseph G. Marino, 2000.\n• La datation du Linceul de Turin : situation en 2001, Revue Internationale du Linceul de Turin, n°22, pp. 14-31, 2001.\n• Scientific Dating of the Shroud, John Jackson, 2002.\n• Scientific Method Applied to the Shroud of Turin, A Review, Raymond N. Rogers et Anna Arnoldi, 2002.\n• Evidence for the Skewing of the C-14 Dating of the Shroud of Turin, M. Sue Benford et Joseph G. Marino, 2002.\n• Textile Evidence Supports Skewed Radiocarbon Date of the Shroud of Turin, M. Sue Benford et Joseph G. Marino, 2002.\n• Historical Support of a 16th Century Restoration in the Shroud C-14 Sample Area, M. Sue Benford et Joseph G. Marino, 2002.\n• Frequently Asked Questions, Raymond N. Rogers, 2004.\n• Pyrolysis/Mass Spectrometry Applied to the Shroud of Turin, Raymond N. Rogers, 2004.\n• Studies on the Radiocarbon Sample from the Shroud of Turin, Raymond N. Rogers, Thermochimica Act, n°425 de Janvier 2005, pp. 189-194.\n• Microscopical Investigation of Selected Raes Threads From the Shroud of Turin, John L. Brown, 2005.\n• Science & Vie, n°1054 de Juillet 2005.\n• Excerpt from Radiological Aspects of the Shroud of Turin, Alan D. Whanger, M.D. et Mary Whanger, IIe Colloque International de Dallas, 2005.\n• La datation radiocarbone du Linceul de Turin, Jacques Évin, Dossier d’Archéologie n°306 de septembre 2005, pp. 60-65.\n• Sciences & Avenir, n°s 710 d’avril 2006 et 725bis de Juillet 2007, p. 19.\n• Le Linceul de Turin victime d’Ulysse Chevalier, Emmanuel Poulle, Revue d’Histoire de l’Église de France n°229 de Juillet-Décembre 2007.\n•The Invisible Mending of the Shroud, the Theory and the Reality, Metchild Flury-Lemberg, IIe Congrès International sur le Suaire d’Oviedo, 2007.\n• Linceul de Turin : L’empreinte sur tissu d’un crucifié mort sous Ponce Pilate ? ou Contre-expertise de la datation « eidomatico-numismatique » de la relique, Max Patrick Hamon, inédit, Rezé, 2007.\n• Chronological History of the Evidence for the Anomalous Nature of the C-14 Sample Area of the Shroud of Turin + Addendum, Joseph G. Marino & Edwin J. Prior, 2008.\n Sites internet (favorables et critiques par ordre chronologique de création)\n• Barrie M. Schwortz, http://www.shroud.com, 1996-2008 (rationalisme et pseudo-rationalisme pro-Suaire).\n• Collogamento pro Sindone, http://www.shroud.it, 1997-2008 (rationalisme et pseudo-rationalisme pro-Suaire).\n• Approfondimento Sindone, http://humanist .net, 1997-2007 (rationalisme pro- et anti-Suaire et pseudo-rationalisme anti-Suaire).\n• Th. Heimburger, http://www.suaire-science.com, 2003-2005 (rationalisme pro-Suaire).\nCrédits photographiques\nPage 1, Le Dr Michael TITE entre le Pr Edward HALL et le Dr Robert HEDGES lors de la conférence de presse du 14 octobre 1988, archives photos du British Museum..\nPage 2, Mise en évidence du coin supérieur gauche après prélèvement d’un nouveau petit fragment en 1988, d’après une photo de Giuseppe Enrié. – Site du prélèvement de 1988, d’après une figure  de Raymond N. Rogers. – Reconstitutions partielle de l’échantillon parent et de la moitié datée de la bande ± rectangulaire, montage de Max Patrick Hamon d’après les photos des labos d’Oxford, de Zurich et de Tucson (Arizona).\nPage 4, L’échantillon semi triangulaire de Raës vu recto verso, Archives de l’Archevêché de Turin. Site du prélèvement en 1973 de l’échantillon semi triangulaire de Raës, détail recadré d’après une photo de Giuseppe Enrié.-\nPage 5, Site du prélèvement de 1988 sous éclairage rasant, détail recadré d’après une photo de Giuseppe Enrié. – Site du prélèvement de 1988 sous fluorescence UV,  d’après une photo de Vernon Miller. Entaille laissée par le prélèvement de 1988,  photothèque 3M, Milan Saint Félix.\nPage 6, Ostension à mains nues du Linceul vers le début et le milieu du XVIéme siècle. Fresque murale extérieure de l’église cimetérale de Vivérone (Piémont), photo Massimo Centini. et détail d’une miniature de la bibliothèque royale de Turin.\nPage 7, Fil formé par épissure provenant de « la zone sombre » de l’échantillon daté en 1988, photos Raymond R. Rogers.\nPage 8, Surlignage de l’emplacement de la longue bande supérieure et des grandes auréoles d’eau sur la grande pièce d’étoffe de lin, d’après une photo de de Gian Duranté. Mise en évidence de traces de sudation  laissées par les quatre doigts de la main gauche de « l’opérateur ».\nPage 10, Taille réelle moyenne de chacun des trois sous-échantillons du Linceul de Turin datés en 1988, montage de Max Patrick Hamon d’après une photo du labo d’Oxford.\n\n","date":"June 24, 2013 at 11:56 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37940","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"I didn’t ask for a bibliography, far less a list of photograph credits. I asked you to say how many authors’ sets of data had been incorporated into your claimed “meta-analysis”, each representing a data point in a single, over-arching statistical analysis.\nIf as one suspects your paper was NOT a meta-analysis, but merely a review of other people’s work, and probably a highly opinionated one at that, full of tendentious ideas, then your paper was merely a REVIEW, and cannot be described as a “research paper”. What’s more, it has still not been peer-reviewed or published in the open literature, despite being written all those years ago.  In fact you don’t appear to have a single publication that would fit that description (see below). \nDo I need to remind you of that Abe Lincoln quotation (“You can fool some of the people all of the time, and all of the people some of the time etc etc )?\n\n","date":"June 24, 2013 at 12:45 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37951","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"PS   “Prior to 1984, in France you did’t need to have a PhD to be a University professor but had to pass ‘un concours’ and be hired by the French ministry of Foreign Affairs to teach abroad as such. ”\nAll of that is totally irrelevant, and a clear attempt to evade the issue. We are not talking about what one does or does not need in France to become a University Professor, as that term is understood in the English-speaking world,. We are talking about you, Max Patrick Hamon, and your claim to have been a University Professor. That is simply not credible, and you have failed to back up your claim with any evidence whatsoever for ever having held any academic appointment at a University, least of all a Professorship.\nYou have also failed to provide evidence of ever having published a single paper in a peer-reviewed journal.You are, to put it candidly, a poseur. You are plain M. Max Patrick Hamon.\n\n","date":"June 24, 2013 at 6:22 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37993","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Yes, I know the term “professeur” has multiple meanings in France, depending on context. \nhttp://dictionary.reverso.net/french-english/professeur\nYou would have to be “professeur, titulaire du chaire” to be be entitled to describe yourself as a universityprofessor. \nYou have not done so, What’s more, my wife (bilingual, French/English, who has worked as a teacher in France)  has looked at the details of the appointment you held for 2 years in Saudi Arabia. It is her opinion, and mine, that you are NOT entitled to describe yourself here as a professor, or even ex-professor. You held some kind of lower level appointment  (indeed, a fairly junior one by the looks of it) in the teacher- training college of that University. Feel free to speak to her directly in your own language. She has blogged as “sheona” on WordPress and other sites for a number of years.\nTo become a University professor, usually carrying with it Head of Department or Faculty responsibilities, requires a distinguished record of research, with authoritative publications in the open, peer-reviewed literature. As far as I can see, you do not have a single piece of published work that fits that description. Poster presentations or pdf papers submitted to Shroud conferences etc do not qualify as peer-reviewed publications, and you have confirmed my hunch that you do not have a research doctorate either, requiring submission of a thesis, examined by an expert in one’s field.. You are, to put it in common parlance, a “self-made man” where scholarship is concerned, so kindly stop pretending that you are entitled to describe yourself here as a professor. You are not.\nAs I say, feel free to discuss this directly, one-to-one, with my wife.\n\n","date":"June 24, 2013 at 12:19 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37946","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Correction: titulaire d’une chaire , according to the link.\n\n","date":"June 24, 2013 at 12:28 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37948","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"The TRUE fact is you (and your wife) DO seem to beTOTALLY ignorant of the way the French Academic system worked prior to 1984. Shall  I endlessly repeat, I was OFFICIALLY appointed as أستاذ جامعي‎ (“University Professor”) by the French ministry of Foreign Affairs and The Saudi Ministry of Education? As such I am entitled to describe myself as a University professor (which you just cannot MR Colin Berry) whether you like it or not.\n\n","date":"June 24, 2013 at 12:43 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37950","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"But I don’t describe myself as “Professor”, here or elsewhere,  since I’ve never been offered a Chair in a University,  and while I have a doctorate I don’t describe myself as “Dr.” either, and in fact feel a little uncomfortable when others do, preferring to be addressed as “Colin” or “sciencebod” or “newsjunkie”, depending on site and log-in.\nIt is not within the remit of any French ministry to bestow the title of “Professor” on anyone, not in France even. “Professor” is an academic title. The same goes for the Saudi Ministry of Education. That is, or was, NOT an academic institution.\nSo stop kidding yourself Max, and get off that high horse of yours. You are not Professor Hamon. You are not Dr. Hamon. You will have to be content with the courtesy title “Mr. Hamon”, though most I suspect will continue to address you here as “Max.”\n\n","date":"June 24, 2013 at 1:08 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37954","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Le pauvre peit vieux qui n’a pas de diplômes dont il veut nous parler ,mais qui prétend avoir droit au titre de “professor” après deux ans passés à participer “à la création du Centre for European Languages and Translation – CELT … et à la création de la section française de la bibliothèque de la Faculté des Lettres de Ryad”  ou plutôt à l’Ecole Normale là-bas, entre 1976 et 1978.  Mais ce n’est pas croyable. Et depuis qu’est-ce qui s’est passé?  Des diplômes,  des thèses doctorales,  des livres et des articles publiés, des universités qui se bousculent pour lui offrir des emplois comme cela se ferait s’il était vraiment un “professor”?  Entre 1978 et 2005 il paraît qu’il y a ce que Goethe appelerait “die grosse Lücke” dans la carrière académique de Monsieur Hamon.  \nMonsieur Hamon, tout le monde a le droit de se nommer comme il veut, mais personne n’a le droit de s’attendre à ce que les autres le croient, faute de preuves.  “Mais puisque je le dis …”, cela ne marche pas.\n\n","date":"June 24, 2013 at 5:38 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-37985","author":"sheona","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Dear Mrs Berry aka Sheona, from what I can make out of your alleged ‘French prose’, most obviously you DO lack a Ph.D; in French language as it does seem you cannot correctly read AND understand French as far as my written résumé is concerned (this reminds me of your ‘darling’ husband’s shortcoming!).. I DO know ‘somebody’ who could teach you French language (to both) as you REALLY need to brush it up.\nAt the end of my two years’ contract in Saudi Arabia, Dr Ali JAD, Director of the CELT (Faculty of Arts), DID ASK ME me to stay at least one more year still serving as ‘professeur de langue et de civilization françaises à l’Université de Riyad..I was young and had a whole life still waiting for me then, I refused HIS OFFER.\n Yes, Mrs Berry, the University of Riyadh had wanted me to serve one more year even after the term of my contract. Therefore, please DO stop spitting on me.\n\n","date":"June 25, 2013 at 11:50 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-38035","author":"chantal boisselier","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Typo: Civilisation\n\n","date":"June 25, 2013 at 11:56 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-38038","author":"chantal boisselier","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"I am passing comment from my girlfriend (Dr Chantal Boisslier) computer. \nMax Patrick Hamon, ancien PROFESSEUR à l’Université de Riyad.\n\n","date":"June 25, 2013 at 11:58 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-38040","author":"chantal boisselier","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Spiting snakes who CANNOT attack the man on scientific and archaeological grounds attack him on the form and MOST VENOMOUSLY try to discredtit him.\n I DO have attestation letters by the French ministry for Foreign Affairs, the University of Riyad AND The French ministry of Education referring to me as ‘Professeur à l’Université de Riyad’. I DID TEACH French Language and Civilization at the (former) University of Riyad see as references  Dr Qassimi. (College of Education of Riyadh) and Dr Ali Jad (Faculty of Arts of Riyadh). \nMax Patrick Hamon ancien PROFESSEUR à l’université de Riad.\n\n","date":"June 25, 2013 at 6:49 am","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-38024","author":"chantal boisselier","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"How many times does it have to be said: evidence that you were once a University professor, some 35 years ago, does not rest one that one word “professeur” appearing on a piece of paper, especially a word that has multiple meanings in French (teacher, lecturer and yes professor for the gifted elite at the peak of their profession). You are on an English language website where the term “professor” has a unique meaning, that of University Professor, ahead of Reader, Senior Lecturer, Lecturer, Assistant Lecturer, yet you have failed to provide evidence that you ever had any academic appointment from that hierarchy. You simply had some kind of appointment in the Teacher Training College of Riyadh University (now conveniently lapsed, at least under that name), probably administrative with some student-contact time that allowed you to be described as “teacher”, i.e. one of the meanings of “professeur” in French. So kindly stop wasting everybody’s time with your attempts to pull the wool over our eyes. We are not so easily taken in. It should be abundantly plain that someone without a single published paper to his name in a refereed journal, and no ongoing career progression in the upper echelons of academe  since 1978 was never a University professor all those decades ago. You are making a complete and utter fool of yourself.\n\n","date":"June 25, 2013 at 12:55 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-38046","author":"colinsberry","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Just blabla. I’ll show you how the title ‘Doctor Ignoramus’ is most appropriate for a ‘man’ like you.\n\n","date":"June 25, 2013 at 2:51 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-38061","author":"chantal boisselier","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"Reminder: I taught BOTH at the Colege of Eduction AD the Faculty of Arts. Besidres French, cannot you read AND understand English?\n\n","date":"June 25, 2013 at 2:54 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-38062","author":"chantal boisselier","site":"shroudstory"},{"title":"Colin Berry:  a hunch – just that – that Rogers may have been used","post":"No one is spitting on you, you silly little man.  You can call yourself Winnie the Pooh (Winnie l’Ourson)  for all I care but should not expect people to take you seriously.  The title of teacher to which you cling so desperately was no longer applicable after 1978.  As you say, at that time you had your whole life ahead of you. What happened?  No publications, no qualifications you admit to, no Palmes Académiques after a successful career. Just a self-taught archeocryptomedievalpsychphysiotherapist, with metal detector.\nBTW, don’t tell me about my French since I know precisely how good it is. I’ve got a degree, you see.\n\n","date":"June 25, 2013 at 5:32 pm","url":"https://shroudstory.com/2013/06/20/colin-berry-a-hunch-just-that-that-rogers-may-have-been-used/","cat":"carbon_14_dating","id":"comment-38073","author":"sheona","site":"shroudstory"}]
