[{"title":"Paper Chase: To know a veil by Philip Ball","post":"I think Ball is willingly looking for “irrefutable conclusions” because the valid inferences which literally leap from sindonology lead to an uncomfortable outcome.  Sure, one can never say “irrefutably” that the Shroud is the burial cloth of Jesus Christ, but the scientific evidence, when coupled with the historical evidence of the Edessa Cloth, permit a very warranted conclusion that the Shroud is very likely what many believe it to be.  It may not be a 100% “irrefutable” position, but didn’t everyone say that the now debunked C14 tests provided “irrefutable” evidence that it was a fake?\nA strange double standard is at work here.  One piece of now invalid scientific evidence “proved” it was a fake, and now all the other evidence, no matter how incredible, must be framed as inconclusive simply because it isn’t “irrefutable” in absolute terms.\n\n","date":"February 28, 2012 at 4:59 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8804","author":"tony","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"There isn’t a single forensic test anywhere in the world that can’t be challenged and/or rubbished by claiming that the sample of material tested had been compromised in its representativeness by a foreign substitution.  \nThis “contamination” defence is now standard in our courts of law, and it relies on the truism that “one cannot prove a negative”, placing the burden of proof on the litigant.  Anyone deploying so shoddy and disreputable a defence argument – on websites as well as courts of law – without strong evidence to back it up can be certain of earning at least one individual’s undying contempt, not that anyone will notice…\n\n","date":"February 28, 2012 at 5:42 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8805","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"\ncolinsberry :\nThis “contamination” defence is now standard in our courts of law, and it relies on the truism that “one cannot prove a negative”, placing the burden of proof on the litigant.  Anyone deploying so shoddy and disreputable a defence argument – on websites as well as courts of law – without strong evidence to back it up can be certain of earning at least one individual’s undying contempt, not that anyone will notice…\n\nYeah, kind of like a person claiming the image on the shroud is a scorch without any proof and even in the face of evidence to the contrary. Then the same person charging others to prove it’s not a scorch in order to refute him.\n\n","date":"February 28, 2012 at 6:49 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8808","author":"Chris","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"Read through what I said earlier Chris. I see no need to repeat myself…\n\n","date":"February 28, 2012 at 7:11 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8810","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"@Chris\nLol.  Well said.\n\n","date":"February 28, 2012 at 8:43 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8812","author":"tony","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"The most rediculous paragraph is the last one. It demonstrates the secular mind-set that the Shroud simply cannot be authentic…regardless of any evidence to the contrary:\n“And of course ‘authenticity’ is not really a scientific issue at all here: even if there were compelling evidence that the shroud was made in first-century Palestine, that would not even come close to establishing that the cloth bears the imprint of Christ.”\n\n","date":"February 28, 2012 at 10:40 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8815","author":"Russ Breault","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"Rediculous, is saying it quite mildly!….Anyone who can make such a statement, in laymens terms; is a total ‘crackpot’.  No one looking at the Shroud can (in a right frame of mind) refute that it is, or is meant to be Jesus of the Gospels.\nThe facts stand as of today; The Shroud image formation has not been explained by science, WHATSOEVER.\nTo date; All attempts to duplicate the image, including all it’s attributes, have FAILED, even the scourch hypothesis…..you listening Bod?\nALL attempts to FALSIFY the Shroud have failed; that includes; Heresay evidence (D’Arcis), falsified microscopy findings (McCrone) and mostly the infamous Carbon14 dating, which, if anyone dares to claim radiocarbon dating is irrefutable science, especially taken on it’s own merit; I will call them an idiot to thier face.\nAs far as I see it, there is no ‘evidence’ to cause me to believe this Shroud is not exactly what it purports to be.\nFurthermore, echoing Paul’s words below; I challenge anyone to replicate this amazing image and prove me wrong.\nR\n\n","date":"February 29, 2012 at 9:41 am","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8828","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"Just make a duplicate shroud. End of  proposition fake or not. I would say scientific knowledge has increased a billion times since the 13 hundreds and you can have  5 years to do it. I mean you would only to do what a single person did in 1300 . Just a bet; it ain’t going to happen\n\n","date":"February 28, 2012 at 11:18 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8817","author":"PAUL","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"The challenge facing any would-be copyist is that there is scarcely any image worth speaking of. That much is clear when one looks at the BBC’s highly realistic, warts an’ all image file:\n BBC link\nHardly a crowd-puller would you say (though it may have been a lot more “photogenic” centuries ago, though still an unappealing pseudo-negative with light/dark reversal)?\nIn my view there are some questions regarding photo-enhancement techniques that quickly become deep-seated philosophical ones: like, are the additional levels of definition and contrast that are currently achievable really real, or are they artefactual? The mere act of photographing, in which silver grains are substituted for chemically-modified carbohydrate is the first step in a process of what in common parlance some might irreverently describe as “tarting up”. Yup, to what extent does each step in secondary, tertiary processing etc create virtual information that is just that – virtual – which may seduce the modern eye, accustomed as it is to the sophistication of modern photography, but leading us progressively into the realms of fantasy and futile speculation? One could draw parallels with fossilization via petrification – the replacement of tissue with minerals – that must always leave questions as to the fidelity of the end product.\n\n","date":"February 29, 2012 at 7:00 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8832","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"So the photo-neg quality is just some irrelevant fluke, is it?\nHow convenient.  \nI have the feeling the shroud keeps you up at night.  Don’t worry, some medieval artist just “tarted” it up.\n\n","date":"February 29, 2012 at 8:03 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8837","author":"tony","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"Colin, it’s only 200 nm thick, c’mon let’s get with the program. If gold leaf can be achieved at this thickness this should be no problem for a retired science bod with a heck of a lot more education and resources at his disposal than a medieval artist.\n\n","date":"February 29, 2012 at 8:43 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8838","author":"Chris","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"it can be made however you want and then wait 100 years and see what image resuts. all it has to do is be the same in all the characterists as the shroud nothing more nothing less and we thought einstien was smart. that middle ages man did something that the smartest and most talented people with all the technology can not do.\n\n","date":"March 1, 2012 at 12:15 am","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8844","author":"PAUL","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"Colin, as for the link you posted, you realize the image is actually much fainter viewed real life right? To assume it may have faded over time is pure speculation. That the image must be viewed from several feet before it can be discerned? …These points amongst a dozens more evidences I can mention kills the “hoax theory” almost decisively. Would any artist be satisfied with something that can barely be seen? Also if you are going to start thinking this may be a fluke from a 16th pseudo-photo, consider first the ‘LIGHTING’ which has no direction, instead from the body itself and also that this photo hypothesis has also been tried and failed miserably.\nR\n\n","date":"March 1, 2012 at 1:24 am","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8845","author":"Ron","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"Hello Ron\nI think it a reasonable supposition, based on chemical considerations, that the image will have faded progressively over the centuries. I’ll spare you the details unless you are interested. Secondly, I think on other grounds, one of them commonsensical, that the image that drew thousands of spellbound pilgrims in past centuries, before there was secondary imaging by modern photography,  was a lot more more well-defined and recognizable at a distance than the one we see in the BBC’s image file.\nLighting? Now who is speculating? To produce an image by lighting, an imaging system is needed (focusing or collimation). But there is no conceivable imaging hardware in place, and none has been suggested by those, your good self included,  who engage in fanciful speculation about emanation of light, taking the latter in its broadest sense (electromagnetic radiation, wavelength unspecified). \nThe only means I know of producing a pseudo-negative (light/dark reversed) image that does not require modern photography is by the same technology that has been used for millennia to identify livestock at a distance – namely branding with hot metal, aka thermal imprinting by contact/conduction. aka ‘scorchography’, a branch of the ancient art of pyrography.\n\n","date":"March 1, 2012 at 4:23 am","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-8847","author":"colinsberry","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"“‘scorchography’, a branch of the ancient art of pyrography”\nwhy not, but the best way is to summit such an hypothesis to as peer-reviewed journal.\n\n","date":"March 7, 2012 at 1:37 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-9030","author":"anoxie","site":"shroudstory"},{"title":"Paper Chase: To know a veil by Philip Ball","post":"The barbaric made-up word “scorchography” should be linguistically replaced by “phlegography” as a branch of the ancient art of “pyrography” ;-)\n\n","date":"March 7, 2012 at 4:05 pm","url":"https://shroudstory.com/2012/02/28/paper-chase-to-know-a-veil-by-philip-ball/","cat":"carbon_14_dating","id":"comment-9037","author":"Max Patrick Hamon","site":"shroudstory"}]
