[{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"I would only hope that skeptics like Chapman and Hugh would take the time to look at Marinelli’s presentation with an open mind. \nOne thing that emerges from this is the role of Prof . Gonella who hoarded the retained portions of the carbon dating sample and then allowed portions of the actual sample area to be examined by Adler and Ray Rogers among others.\nBefore anyone gets into a huff about what Marinelli had to say about the carbon labs I suggest they read Gove’s book cover to cover. Everything that Marinelli has to say about the labs is there from the mouth of Gove himself except theer refusal to relase there raw data which is a fact.\nI am in awe of Emanuela Marinelli’s scholarship and this presentation.\nOne small quibble: I am not sure that she adequately explains that the “bio-plastic coating” theory was overtaken by Ray Rogers work. Rogers’ results which were published in a peer reviewed journal and cross-checked by Rogers initiative by other scientists and  remains unimpeached..\nHowever, I was not at Valencia. I plan to be in St. Louis.\n\n","date":"August 4, 2014 at 7:23 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142201","author":"John Klotz","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"I am not in awe of my ability to catch typos including my mangling of “there ‘ and “their” and even a new one “theer.”\n\n","date":"August 4, 2014 at 7:25 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142202","author":"John Klotz","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"Beautiful paper, also a treasure trove of photographs about the C14 dating process.\n\n","date":"August 4, 2014 at 7:45 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142207","author":"Mike M","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"Excellent summation of the C14 monkeyshines…I mean, “irregularities”.\n\n","date":"August 4, 2014 at 9:24 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142217","author":"David Goulet","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"I don’t know what was Emanuela Marinelli’s first intention , but the final result  is that after looking at  her presentation skeptics will be even more skeptical than before…and some “shroudies”  were claiming  that the sample was taken behind close doors with no cameras or witnesses !\n\n","date":"August 4, 2014 at 11:48 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142241","author":"PHPL","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"“skeptics will be even more skeptical” not that I think it matters, but why would that be the case.\n\n","date":"August 4, 2014 at 12:02 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142243","author":"Mike M","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"Marinelli’s paper is indeed a superb description of the irregular events surrounding the radiocarbon sampling of the Shroud, but her examination of what may have made the declared date inaccurate does not begin until Page 17,\n1) Could the date have been skewed by C14 enrichment? The short answer is that nobody has yet shown that such a mechanism exists. The Oxford laboratory tried with CO and failed, and charcoal particles created under all sorts of conditions are frequently dated successfully. Given that the Shroud was supposedly stored in a silver casket, the principal, if not the only source of carbon atoms was, of course, the Shroud itself, which would not skew its date. Similarly, unless the shroud was covered in photosynthetic bacteria, and therefore green, the carbon content of any bioplastic coating would be made from the Shroud’s own carbon, and therefore date to the same time. Hypotheses using neutron flux currently belong to “miracle science” which is not amenable to rational investigation. \n 2) Was the sample area representative of the original whole cloth? This, of course, has been examined exhaustively without achieving consensus. The overriding consideration for me has been the sheer quantity of contamination required to achieve a date adjustment of over a thousand years. The different proportions worked out by scientists relate to the type of contamination, ie what mass of C14 atoms should be added, or what mass of carbon, or what mass of organic material such as thread. Unless black bits of carbon can be identified on the shroud, the contamination is normally supposed to be interpolated thread, in which case two thirds of the sample would consist of contamination, and one third original. I do not accept that any of the evidence put forward to support this argument is sufficiently strong to refute the 13th century date.\n3)  Radiocarbon dating is often just wrong. I consider this a very weak argument. Had the Shroud dated to the 1st century and anybody dared to put it forward, they would have been considered to be grasping at the feeblest of straws to discredit the date. The same applies here. Radiocarbon dating is never “just wrong.” It is wrong for a number of possible reasons, such as contamination from groundwater, or a marine or terrestrial, rather than an atmospheric, source of the carbon under examination. These reasons can be investigated, but often aren’t, usually because the C14 tests are expensive and the results were only confirmatory anyway. Where they are repeated, the reason for the anomaly is easily found. In the case of the Shroud the Tucson labs have sufficient material to redo the tests.\nFinally, however, I agree with Marinelli’s conclusion. The Shroud cannot be definitively dated to the middle of the fourteenth century (actually I consider the end of the thirteenth more likely), and there is certainly evidence to the contrary. I do not consider it strong enough to refute the labs’ conclusions; others do. That’s OK. Just as I do not consider them a bunch of bigoted religio-fanatics blinded by stardust and mumbo-jumbo, I hope I will not collect my usual attribution as a sad, desperate moron out only to destroy Christianity and promote the triumph of Beelzebub.\n\n","date":"August 4, 2014 at 12:40 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142246","author":"Hugh Farey","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"“Promote the triumph of Beelzebub…” That’s funny. You reminded me of William Golding’s Masterpiece “Lord of the Flies”.\nThank God, I don’t share that view. But I am inclined to seriously doubt the C14 test on scientific basis. The heart of any experiment is to have a proper protocol. Unfortunately this was not the case here. We started with seven different samples and ended up with one sample split into 3. How can that be representative?\nWe can dispute who was responsible for that all day but it doesn’t change the fact that we were dealing with a very sloppy (yet sensational) experiment. This was further manifested in the heterogenicity of the sample, scientifically, demonstrated by Rogers. To me the C14 dating for the Shroud cannot be trusted, period.\n\n","date":"August 4, 2014 at 1:29 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142251","author":"Mike M","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"Excellent post Mike. The key as to why the C-14 dating is worthless is the labs abandonment of the protocols. Wouldn’t Hugh agree that the results of any scientific experiment or test where the protocols are not observed are worthless?\nMaybe he will dance around the obvious truth of that proposition.\n\n","date":"August 4, 2014 at 2:06 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142256","author":"John Klotz","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"I don’t understand the argument that disregarding the original protocols makes the science of the tests as they were actually done invalid.\n     As a historian, I would prefer to find other ways than the merely scientific to ‘date’ the Shroud. I would happily just leave out the radiocarbon dating altogether and concentrate on finding documentation and iconographic evidence to support ( or ruling out) a medieval date. Although I have not yet found any evidence of a double image, I am having  fun, among getting on with other projects I am involved in, in learning about all kinds of obscure aspects of medieval ceremonial, use of painted cloths in churches ,etc. etc.\n       The problem I find with all the attempts to refute the radiocarbon dating is that they don’t offer any evidence that a retesting of every part of the Shroud with every protocol known to man observed,etc,etc., would end up in that crucial date range of say 50 BC to AD 33.\n\n","date":"August 4, 2014 at 2:19 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142264","author":"Charles Freeman","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"Hi Charles, I am not a scientist but At least I know enough to know that the following points were part of the original Protocol and were all extremely important (for a reason) were ignored;\n1-A representative sample was not used.\n3- sample qualification (chemical composition) was not performed.\n4- Tests should be blind (examiners shouldn’t know which sample was test and the which was control)\n5- There should’ve been no communication between the testing labs before the final result.\n6- Raw data should be kept for future audits and there should be no reason to hide them.\n\n","date":"August 4, 2014 at 4:34 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142280","author":"Mike M","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"In the Valencia paper (p. 13) Emanuela Marinelli refers to a rumor according to which the representatives of the laboratories had a secret meeting in Switzerland in the summer of 1988 (this is repeated in the slideshow at slide 55). As a source she quotes (in footnote 123) an article by Umberto Folena in the Italian daily Avvenire of 14 October 1988. Indeed in the article Folena writes that “it seems” that a secret meeting was held in Switzerland that summer without mentioning any source for this news. In November, 2012 I wrote to Folena asking what had been his source. He answered that he did not remember and did not even remember having written that sentence. In 1988 Folena was a young reporter and had been sent to Turin for the press conference of 13 October where Bishop Ballestrero announced the results of radiocarbon dating. His article is just a report about that press conference. Of course that day many journalists were present in Turin and subsequently published their reports, but it does not seem that any of them, apart from Folena, mentioned the secret meeting. Needless to say, if the directors of the laboratory wanted to exchange information, they could do so by telephone or email without having to travel to Switzerland. One may add that on 20-25 June 1988 several of the representatives of the laboratories met in Dubrovnik for one of the regular radiocarbon conferences, but this was not secret and not in Switzerland.\n\n","date":"August 4, 2014 at 3:22 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142270","author":"Gian Marco Rinaldi","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"I am unable to grasp Hugh’s apparent inconsistency.  On the one hand he is usually so insistent on scientific rigour on most questions where the evidence may point to the Shroud’s authenticity.  But when it comes to evidence raising doubts, he seems prepared to abandon such rigour and to accept the results of a highly questionable experiment that the relic is actually 13th century.  I hesitate to suggest that this may be a form of intellectual dishonesty, but some might see it as such.  \nMike M’s observations are pertinent:  “The heart of any experiment is to have a proper protocol. Unfortunately this was not the case here. We started with seven different samples and ended up with one sample split into 3. How can that be representative? … further manifested in the heterogenicity of the sample, scientifically, demonstrated by Rogers.”  The sampling was not representative!\n\n","date":"August 4, 2014 at 4:40 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142282","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"Dave, \nWe have heard from Charles and Hugh. Can Colin be far behind?\n\n","date":"August 4, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142295","author":"John Klotz","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"Here’s my solution Mr.Klotz to the radiocarbon so-called fiasco (hardly of the laboratories’ making methinks): a future exhibit, selectively and judiciously perforated following STURP Mk2’s ‘representative’ sampling, to be on permanent display in the Florentine Museo Galileo (forget about  ‘non-destructive’ testing).\n\nThe missing circles are not just where samples were taken for repeat radiocarbon testing. There would be much else that needed to be checked, like the blood-first-image-second dogma, like “extraordinary amounts of bilirubin”, like location of image on impurity coating or linen fibres, PCW or SCW etc etc etc. Forget about sticky tape samples – the time for pussyfooting is over.\nYou’ll find it and some other unconventional thinking in my latest posting/scientific manifesto.\nhttp://colinb-sciencebuzz.blogspot.fr/2014/08/might-turin-shroud-simply-be-contact.html\n\n","date":"August 4, 2014 at 6:20 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142297","author":"Colin Berry","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"What about your cleaning protocole ?\nhttps://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/\n\n","date":"August 5, 2014 at 3:44 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142368","author":"anoxie","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"I take daveb’s point, but as Charles says, the irregularity of the organisation of the taking of the sample is not relevant to the laboratory procedures themselves, which is why I didn’t discuss it. Unless deliberate fraud was involved, such as a Vatican plot deliberately to discredit the Shroud or some such, which I do not entertain, the science begins at the laboratories. It is generally not disputed that the protocols carried out there were rigorous, although there were minor, albeit documented, variations in order to prevent too much loss of material during the cleaning process. I do not dispute that some evidence implying contamination has been found, and that it casts doubt on the radiocarbon date, but it is insufficiently consistent to refute it absolutely. Specifically, I do not agree that any form of “invisible” interweaving would actually be undetectable on the radiocarbon sample still held by Tucson and recently photographed by Barrie Schwortz; I do not find the inconsistency between the different proportions of cotton found by various examiners conclusive, and I do not believe that Rogers’s water soluble gum/starch coating would not have been washed off during the cleaning process. I have already demonstrated that the purported irregularities in the reflectivity of the shroud which occur in various photographs owe far more to the way the shroud was lit than to anything intrinsic. Daveb is perfectly correct in my insistence on scientific rigour, and I doubt if anyone has examined these objections to the radiocarbon dating more rigorously than myself. That is precisely why I cannot agree that they constitute a decisive refutation of it.\n\n","date":"August 4, 2014 at 10:04 pm","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142325","author":"Hugh Farey","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"“the science begins at the laboratories”\nHugh, the science begins at the sampling. But this thought sums up the fiasco of the dating.\n\n","date":"August 5, 2014 at 2:38 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142356","author":"anoxie","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"“… the irregularity of the organisation of the taking of the sample is not relevant to the laboratory procedures themselves, …”  And that comment is not relevant to my point which referred not ” to the laboratory procedures themselves,” but to “scientific rigour”!  Any science undergraduate with a credit in Stat Math I, would surely see the error in such faulty sampling, and any professional scientist worthy of the name would surely leave a record of their objection to faulty sampling if they were commissioned to date an artifact.  Or did they just see themselves as mere suppliers of services to date any sample willy-nilly offered to them. and not true professionals at all  The verdict they gave, with dates written large on a black-board, with TV cameras focused, was that they were dating the Turin Shroud!\n\n","date":"August 5, 2014 at 3:57 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142371","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"The key question:  Were these professional scientists merely providing a technical service to date just any submitted samples of whatever provenance, or were they claiming to date an artifact?  Draw your conclusions from chief spokesman Oxford’s Professor Hall’s published statement:\n“There was a multi-million-pound business in making forgeries during the fourteenth century. Someone just got a bit of linen, faked it up and flogged it.” Yeah, right!\nAnd article in Nature magazine under joint authorship of all 21 scientists who had participated: “… conclusive evidence that the linen of the Shroud is medieval”.\nSo it is claimed that conclusive evidence on the whole artifact may be obtained from one unrepresentative sample taken from a soiled contaminated corner!  But no other testing of the sample is to be permitted!  And the world in general is expected to accept this as the epitome of good professional science!  Twenty-one scientists and three separate laboratories have so testified!\n\n","date":"August 5, 2014 at 6:47 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142388","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"I think not. The sample area, however much disputed even right up to the two hour discussion preceding the actual snipping of the scissors, was more or less inevitable from the moment there was agreement to take the sample. It had to be consistent (ie  not made from a blend of threads from around the shroud), sufficiently large to satisfy the demands of the laboratories, and away from the image itself and obviously anomalous areas such as the 1532 patches or the sides stitched to the backing cloth. The only real choice was from one of the corners, and which better than one which had already been very closely examined by one of the world’s greatest textile experts, Gilbert Raes?\n\n","date":"August 5, 2014 at 6:10 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142385","author":"Hugh Farey","site":"shroudstory"},{"title":"Photo Rich, Wonderful Presentation by Emanuela Marinelli","post":"That was a gamble, we shouldnt be gambling in science. I understand why it had to be from one of the corners, I just disagree that it should still be called science.\n Dr, Raes also indicated that his sample contains Cotton, while the side strip didn’t. That’s why they thought, initially, that the side strip was added later on. However no one would’ve imagined that the strip was likely to be the more authentic part.\n\n","date":"August 5, 2014 at 8:20 am","url":"https://shroudstory.com/2014/08/04/photo-rich-wonderful-presentation-by-emanuela-marinelli/","cat":"carbon_14_dating","id":"comment-142396","author":"Mike M","site":"shroudstory"}]
