[{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"In such a bad context of political games (involving Chagas, Canuto, Gove, all the C14 labs, etc.), the only good move that should have been made by Luigi Gonella, the scientific adviser of the whole project, would have been to drop out of it.  But sadly, he did nothing to stop the C14 dating to be made despite of a very weak and risky protocol.  More than that, if we believe Meacham, he was one who approved the very bad choice of taking only one sample in a very suspicious corner of the cloth.  Not great for a scientific adviser in charge of the supervision of the whole thing.\nImagine if he would have drop out of the project, let’s say one month before the sampling date…  Don’t you think that such a drastic move would have had some chances of stopping the project of taking only one sample and not making any other direct analyses on the cloth?  Who knows ?  I think this kind of move would have ring of bell in the Vatican to let them know that something was wrong in this whole project…\nI still believe Gonella was the best person who could have had some chances of stopping this bad project at the time or, at the very least, to force the authorities to make some important and beneficial changes to the research protocol by droping out of this project before the day of sampling and making public critics in the newspapers.  Sadly, he did nothing of this sort (he did not even listen to Meacham’s good advices) and the rest is history.\n\n","date":"May 10, 2013 at 11:08 am","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33413","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"This hunt for shady characters, villains lurking behind pillars (see silly graphic from equally silly “Night of the Shroud”), could run and run, and this site could have logged its 2 millionth hit in a year or two if things were to continue the way they are now, with ever more febrile speculation.\nWhat could end it all is headline that read “Pope Francis consents to re-dating of the Shroud of Turin”. \nMethinks there are some here who would squeal with indignation if that headline were ever to appear. There would also be new chairs established at Italian Universities for Professors of Shroud Contamination Studies…  ;-)\n\n","date":"May 10, 2013 at 11:53 am","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33415","author":"colinsberry","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"For once, I agree with you.\nMy point versus Gonella is just a try from me to think of what could have been done in 1988 to avoid the C14 mess.  After a long reflection based mainly on the book of William Meacham (an eye-witness of those sad events), I really think Gonella could have been the one who had the power to change and/or ameliorate the weak protocol of research before the day of sampling.  Sadly, he did nothing and, even worse, if we believe Meacham, we have to think that he gave a 100% approval to this bad protocol, which is, for a scientific adviser, not a great proof of competence in the field of radiocarbon dating.\n\n","date":"May 10, 2013 at 1:04 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33419","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"This obsession with getting things right the first time only arises because of Vatican/Turin stand-offishness where those dreadful, supposedly agnostic/atheist scientists are concerned, you know, the ones who keep wanting to snip bits out (understandable hesitation, but the size of snipped portions required gets progressively smaller and smaller with each passing year/decade).\nThere was a single ranging shot analysis (25 years ago!). Why stop there, especially in view of the steadily increasing accusations (regrettably hosted in part by this site!) of a fraudulent result  – one that damages the reputation of the labs and scientists involved. \nThe solution is obvious:  let one or more of the radiocarbon labs back for a second look, this time with several sampling sites – maybe from the less iconic dorsal side – and with improved  ‘state-of-the-art’ decontamination techniques.\n\n","date":"May 10, 2013 at 1:28 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33422","author":"colinsberry","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"Colinsferry; “What could end it all is headline that read “Pope Francis consents to re-dating of the Shroud of Turin”. ” ….Obviously you haven’t been paying much attention to what others have been saying or either reading up on the RCD process very well. It is very unlikely a new C14 test would achieve anything worthwhile, since the MAJOR issue of contamination of the Shroud and how to deal with it has not been solved…Your ability to neglect or joke about the seriousness of contamination speaks volumes of your character or professional expertice….just saying.\nRon\n\n","date":"May 10, 2013 at 1:08 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33420","author":"Ron","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"Yet another “character” attack (your word).  Is that the best you can do?\n\n","date":"May 10, 2013 at 1:30 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33423","author":"colinsberry","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"I think Ron is affraid that another C14 dating test would give a result different than 33 A.D.\nIf we truly have a scientific thinking, we should be in favor of a new C14 dating because it would surely bring us much closer to the truth about the Shroud, whatever this truth can be…\n\n","date":"May 10, 2013 at 1:46 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33425","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"Since Rogers have only found the contaminant he have found in the samples coming from the C14 corner, I seriously doubt that another C14 dating that would be done with a much more complete and fine protocol would give a medieval result Ron.  It’s not because one damaged corner of the Shroud was obviously very contiminated that it is the same for the whole cloth!  Come on!  And even if another sample taken from another part of the Shroud would be very contaminated, a good protocol would make sure this would be found BEFORE any C14 test would be performed.  Such a sample would only have to be set aside by the labs.  They would be able to do so this time because more than one single sample would be taken!  \nAnd finally, as I know, C14 dating is still the best test that exist to learn the true age of an ancient piece of cloth.  And Ron, if all I said in this comment would be incorrect, then you have to explain to me why an expert on the subject of C14 dating and also on the Shroud like William Meacham would still call for a new and more carefully planned C14 dating in his 2005 book!!!\nA new and more carefully planned C14 dating that would be done as a part of a more wider test plan is definitively the best thing that could be done in the future to learn the true age of that cloth (except if a safer and more accurate method of dating ancient cloths can be discovered, which is still not the case as I know).\n\n","date":"May 10, 2013 at 1:32 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33424","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"What a shame that repeat testing has to be sold to pro-authenticity bloggers here on the prospect that it would be less compromised by contamination, or that modern techniques would correct for that, this time around.\nI back Yannick’s call for repeat testing, but would do so on the basis that the new result cannot be predicted with certainty. Scientifically speaking, one just likes to repeat an experiment – simply to see if it gives the same result as the first.\n\n","date":"May 10, 2013 at 1:50 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33426","author":"colinsberry","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"With the original protocol asking for 3 samples being taken from 3 different areas on the cloth, we would already had a good idea of the precision of the final result…\n\n","date":"May 10, 2013 at 1:56 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33427","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"\nYannick Clément :\nWith the original protocol asking for 3 samples being taken from 3 different areas on the cloth, we would already had a good idea of the precision of the final result…\n\nYes, but  the samples weren’t taken from 3 sites – just one.  Folks should live with that snippet of history and move on. There is still a Shroud, and still the possibility of taking 3 samples from 3 different separate sites.\n\n","date":"May 10, 2013 at 2:06 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33428","author":"colinsberry","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"Of course…\n\n","date":"May 10, 2013 at 2:23 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33429","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"There is no point in cutting more pieces from the Shroud and Meacham did mention errors in carbon dating in a paper. At least one sample was in the possession of Cardinal Giovanni Saldarini and must be with Archbishop Nosiglia now. But is it worthwhile using such a sample for another CD test if nothing can be said about the source(s) of contamination with certainty and there are many hypotheses about how the 1988 test was skewed? These should be sorted out before proceeding and much will depend on Turin, the authorities there being highly irritated right now with what transpired recently.\n\n","date":"May 10, 2013 at 3:01 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33431","author":"Louis","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"“…   much will depend on Turin, the authorities there being highly irritated right now with what transpired recently….” \nSo they are irritated, indeed highly irritated. So what? We all get irritated from time to time. This site – and its comments – can be highly irritating at times. But we don’t just retreat into our little shell, and hope  the nasty world will have gone away when we peep out later.\nCome on, Turin. Come on Vatican. You’ve had 25 years to get over the shock of that preliminary 13/14th century dating. But it was a fix, right? Everyone knows it was a fix – at least those who log on regularly to this site, and read in the margin that  “the carbon dating, once seemingly proving it was a medieval fake, is now widely thought of as suspect and meaningless”.\nMeaningless?  A section of fabric that looked  representative to the eye of one of the world’s foremost textile experts ( Mechthild Flury-Lemberg). \nCome on Turin. Come on Vatican. Prove those critics were right. Arrange for another round of radiocarbon dating. Allow the scientists to sample at several different sites. Let them take enough material to compare different de-contamination procedures.\nIf a task is once begun\nNever leave it till it’s done\nBe the labour great or small\nDo it well, or not all.\n\n","date":"May 10, 2013 at 4:39 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33441","author":"colinsberry","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"We should wait for the best non-intrusive technology to become available to do the testing. We humans instinctively desire an answer to riddle sooner than later – and this is especially true of a relic like the Shroud. But just because we live now doesn’t mean we must be the ones to solve the riddle. The Shroud has perplexed people for centuries, it can do so for a few more decades if need be.\n\n","date":"May 10, 2013 at 4:20 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33437","author":"David Goulet","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"\nYannick Clément :I think Ron is affraid that another C14 dating test would give a result different than 33 A.D.\nIf we truly have a scientific thinking, we should be in favor of a new C14 dating because it would surely bring us much closer to the truth about the Shroud, whatever this truth can be…\nYour totally off Yannick, it’s obvious that you also do not understand the problem of contamination also along with Colin. What would be the use of another test if it cannot be done properly? Until they can find an absolute method that observes and can eliminate alI traces of contamination it would be a wasted procedure. Lets get something straight also; I have absolutely no fears about the dating of the Shroud or ot’s provenance….I am not blind.\nRon\n\n","date":"May 10, 2013 at 4:21 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33438","author":"Ron","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"If I don’t understand the problem, then neither Meacham and all the other archaeologists who still used the C14 dating to determined the real age of ancient cloths.\n\n","date":"May 10, 2013 at 4:26 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33439","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"I you don’t understand, thats not my problem. I think I explained it pretty well in a recent post. Testing the Shroud would be completely unlike testing most anyother textile, as it has been introduced to a unimaginable contamination, different  say to a mummy’s rapping that has sat in a tomb undisturbed for eons…..get it?\nMeacham and most all archeologists, and/or C14 scientists are well aware of this issue, aswell as the issue of sampling any textile, and as a matter of fact Meacham has made a big deal about this same issue in some of his writings. Which same as here, has fallen on deaf ears.\nR\n\n","date":"May 11, 2013 at 7:10 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33521","author":"Ron","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"Read again Meacham’s book…  He definately calls for a new C14 dating.\n\n","date":"May 11, 2013 at 8:31 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33530","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"By the way, in his book, Meacham gave a very good answer to the argument you bring in concerning the idea that the Church should wait for the development of a new method of dating ancient cloths with a higher level of accuracy than C14 dating.  Meacham said about this kind of argument that this is a very weak argument in truth because if we would follow it blindly, that mean we would never do nothing and constantly wait for a new method that will be better than the best one we got at present time!  You know what?  I agree 100% with Meacham about that.  Since Rogers work, we know have a pretty good idea of all that went wrong with the C14 dating of 1988.  Taking that into account, I think it would be a lot easier to build a much better protocol this time (a protocol that would include many samples and an in-deep chemical, microscopic and spectroscopic analyses of the sampled areas) to avoid the fiasco of 1988 and to get closer to the truth concerning this relic.\nAnd you know what?  This should have been done since a long time now…  But maybe the timing was just not right for the Church who don’t live at the same timing than the world.  I’m sure this time will come sooner or later.\n\n","date":"May 10, 2013 at 4:40 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33442","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"David Goulet is right about non-intrusive technology and the possibility of future generations trying to solve the riddle, in fact that was what I heard from more than one prominent Shroud scholar. Regarding ancient cloths, how many have been through everything the Shroud has gone through? Were they, for instance, exposed to smoke from candles and incense in badly-ventilated mediaeval churches?\n\n","date":"May 10, 2013 at 4:48 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33443","author":"Louis","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"I’d like to hear about some examples of accurate C-14 dating of ancient textiles, confirmed by methods independent of C-14, before being persuaded that C-14 testing on textiles can be infallibly correct. I know about examples which produced quite incorrect results. Otherwise it would appear to be a pointless exercise in scientific entertainment and dalliance. The main problem with the 1988 testing seems to be non-representative sampling leading to testing a patched area. But the problem of removing contamination which would skew any results at present seems to be somewhat intractable.\n\n","date":"May 10, 2013 at 4:49 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33444","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"The laboratories assume that they can remove contamination easily, but there are different kinds of contamination in the case of the Shroud, so here we have something that is easier said than done.\n\n","date":"May 10, 2013 at 5:01 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33446","author":"Louis","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"Contamination is not a new problem in science, or should one say chemistry. But it is far from intractable as some would have us believe. For example, one can take a known weight of linen and measure its cellulose content as glucose. e.g by gas-liquid chromatography. If that were 95% say, then one can then proceed to focus on the remaining 5%, and account for some of that, e.g. as lignin, or hemicelluoses, or waxes etc etc and all the time whittle down the estimate for unknown impurity content. The smaller that gets, the smaller the error in the C-14 dating from something other than linen, whether known or not. Science would have never progressed if held up by speculation regarding unknowns that are never specified in detail. Hypotheses about unknown contaminants have to be framed in sufficient detail as to allow them to be tested.\nAnother method is to use different chemical pretreatments – acid, alkali, organic solvents etc singly or in combination. If one gets the same result for each, then it is difficult to argue for a mystery contaminant. In fact, that was done by the 3 labs in 1988 – if one looks at the detailed protocols.\nThere is always the possibility of solubilising the cellulose fibres  – for which reagents are available – and then re-precipitating the cellulose fibres. Dilution effects alone would leave most if not all contaminants in solution.\nThe one contaminant that would bother me is elemental carbon, e.g. off candle flames, since we know it is chemically resistant to solvents. But it is black, particulate, and if present should be visible under a microscope. I hardly think that 19th century candles (say) have so blackened the Shroud as to give an erroneous 12/13th century dating,\n\n","date":"May 10, 2013 at 5:30 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33447","author":"colinsberry","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"My background is not science, but what was meant is that the smoke would have been absorbed by the fibres completely, nothing to do with blackening the Shroud. What would you have to say about the papers written by the late John Tyrer?\n\n","date":"May 10, 2013 at 6:24 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33448","author":"Louis","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"According to Raymond N Rogers in 2004, the Shroud is “nearly pure linen”, accountable as carbohydrate, according to the range of fragments seen on pyrolysis mass spectrometry,. \nhttp://www.shroud.com/pdfs/rogers4.pdf\nHe was using Shroud fibres, collected in 1978 with his sticky tape procedure, from which adhesive had then been removed. (Of course, one doesn’t know what else was removed, but at least it WAS removable, rather than irreversibly trapped within the fibres).\nThat would argue against any significant contamination from non-carbohydrate, organic, i.e.carbon-based contaminants would you not agree?\n\n","date":"May 11, 2013 at 3:58 am","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33489","author":"colinsberry","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"I agree completely!\n\n","date":"May 11, 2013 at 5:56 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33517","author":"Yannick Clément","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"That point is acceptable, however Rogers seemed to have used extremely little fibre and there are now calls for examinations at the molecular level. The other problem is that no chemical analysis of the sample was made by the laboratories before the carbon dating. Now, more than ever, attention has to be paid to the doubts raised by British Museum scientist Dr. Sheridan Bowman when it comes to contaminated material. Perhaps that was the reason why Dr. Harry Gove did not answer Professor Stephen Mattingly in the end.\n\n","date":"May 11, 2013 at 7:13 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33522","author":"Louis","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"I agree completely and as to what Rogers had found or not; Maybe he missed it. It wouldn’t be the first time he missed something big; i.e the patchjob. I have read that carbon infiltration of linen fibrels would be next to impossible to actually view or distinguish. As far as I know we still can’t see quite down to the molecular level. Furthermore, for one to actually believe that a linen cloth could have been stored, or hung, or handled for ‘centuries’ alongside ‘oil-burning’ lamps, (which by the way depending on the oil used can give off quite abit of smoke/carbon) and also burnt twice, (atleast), and did not consume some carbon in it’s fibrels, is simply proposterous, leaning on retardation. \nR\n\n","date":"May 11, 2013 at 7:28 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33523","author":"Ron","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"Right, that includes at least some of the things I’ve said. Now if we reach the molecular level and find what is expected to be seen there, at least by those in the pro-authenticity camp, then we can also be sure that Tyrer, Bowman and others were right all along.\n\n","date":"May 11, 2013 at 7:52 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-33527","author":"Louis","site":"shroudstory"},{"title":"Comment Promoted:  Do not blindly accept the results of the 1988 dating.","post":"“Do not blindly accept the results of the 1988 dating”. Good advice, here is a report on the re-examination of the radio-carbon testing:\nhttp://www.ox.ac.uk/media/news_releases_for_journalists/080325.html\nAlso some stuff on the original testing here:\nhttp://www.badarchaeology.com/?page_id=322\n\n","date":"May 29, 2013 at 3:15 pm","url":"https://shroudstory.com/2013/05/10/comment-promoted-do-not-blindly-accept-the-results-of-the-1988-dating/","cat":"carbon_14_dating","id":"comment-35280","author":"Perkin Warbeck","site":"shroudstory"}]
