[{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Stephen has and some excellent contributions to this blog and I hesitate to criticize him. But as I sometime tell  clients in referring to adversaries or the press: You can’t break their pencils.” Stephen, we have to do what we can do and I believe we are winning.\nI believe he has basically misread two things: The number of Christians and the current attitudes towards the Shroud. There are over two billion of us.\nI am impressed by the coverage of the Shroud during Holy Week and how often when referring to the carbon dating they would include a disclaimer such as “Now. those results have been thrown into dispute (or disproven) by subsequent scientific analysis” and then dropping the C14 issue entirely. RIP Ray Rogers.\nThe best is yet to come, and in a least a metaphorical sense, what is to come includes Him: not in a flash of lightning across the sky, but in the scientific understanding of the Shroud. It is a Revelation in the true sense.\n\n","date":"October 21, 2013 at 7:13 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48210","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Even if the Shroud is proven to be authentic then it merely is a proof that the historical Jesus did exist. It does not prove the Resurrection. It does not prove he was God. It does lead to some pretty big implications of course.\n\n","date":"October 21, 2013 at 7:19 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48214","author":"David Goulet","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Yes, but what do you put in place of Resurrection? \nUnique And Presumably Energetic Dematerialization But With Imprinting Of A Faint And Poorly Characterized Thermochemical Signature Onto Adjacent Linen?\nIsn’t it quicker and simpler just to say Resurrection? No feet-on-ground scientist will quibble with that surely, given it’s a miracle that’s being described whichever way one looks at it. But an even greater miracle would be needed to imprint the image of a 1st century man onto 14th century linen… Now what on earth are we going to call that? Apologies for the earthly perspective. \nSpeaking of which: did Jesus ever consider telling his disciples that the Earth was round, and if not, why not? It would have made the Gospels a lot more interesting to have had a few scientific soundbites captured for posterity…\n\n","date":"October 21, 2013 at 7:59 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48220","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"The answer is in the Gospels: Jesus was not bothered about the material world.\n\n","date":"October 21, 2013 at 8:08 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48223","author":"Louis","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Colin,\nLet’s keep it a secret, but the evidence that he C-14 dating we of an anomalous portion of he Shroud is overwhelming. Seriously.\nIf your faith in no faith depends on the C14 carbon then you are on flimsy ground. Did you see the Brown microphotos that were posted recently at 3000 plus resolution? Do you think they were fake? None of the scientists who have debunked the C14 tests have a financial stake. The C14 labs had huge financial stakes including massive government grants for starters. Didn’t the British government subsidize Oxford’s acquisition of the ASM carbon dating equipment?\n\n","date":"October 21, 2013 at 8:50 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48227","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"If the image was formed by a natural process, yet to be discovered, then we may not be talking about a paranormal event per se. Look, if the Shroud is authentic I don’t foresee masses of atheists accepting that ‘Jesus is Lord’. They will move to the next stage of mental gymnastics which is, “Something unique happened to this Jesus’ body, that’s all.” It’s essentially what de Wesselow has done.\nYou know the same kid of mental dodge us authentists have done with the C-14 results. ;)\n\n","date":"October 21, 2013 at 10:06 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48237","author":"David Goulet","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Christianity is disappearing in Australia, but that does not mean that there are no large numbers of practicing Christians and Christian journalists in other countries. \nThe exclamation mark meant that the laboratories knew they would meet opposition, and it could also indicate that they themselves were not really sure about the results. The big problem was the donation Oxford received, which led people to say that they got the impression that the results were made to order.\n\n","date":"October 21, 2013 at 8:05 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48222","author":"Louis","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"\nLouis :\nThe answer is in the Gospels: Jesus was not bothered about the material world.\n\nTurning water into wine? Feeding the 5000 with five loaves and two small fishes? What’s that if not a concern with the material world?\n\n","date":"October 21, 2013 at 8:13 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48225","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Agreed, Colin. Jesus spoke of how the kingdom of God was here and now, not just some future reality. His ‘miracles’ were proofs of that. He was not an Essene – at this point anyway. Jesus, in the Gospels, is a man who has one foot in this world and one in the next. Both are a part of the Kingdom, both matter.\n\n","date":"October 21, 2013 at 10:15 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48240","author":"David Goulet","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Turning water into wine or feeding 5000 was not a primary concern, the occasions just arose there. It is evident in the gospels that Jesus knew that it was very difficult for people to do away with material concerns, some could go half the way, others the full way, with just a staff as material possession.\n\n","date":"October 21, 2013 at 7:32 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48310","author":"Louis","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"\nJohn Klotz :\nColin,\nLet’s keep it a secret, but the evidence that he C-14 dating we of an anomalous portion of he Shroud is overwhelming. Seriously.\nIf your faith in no faith depends on the C14 carbon then you are on flimsy ground. Did you see the Brown microphotos that were posted recently at 3000 plus resolution? Do you think they were fake? None of the scientists who have debunked the C14 tests have a financial stake. The C14 labs had huge financial stakes including massive government grants for starters. Didn’t the British government subsidize Oxford’s acquisition of the ASM carbon dating equipment?\n\nHearsay evidence? Or dodgy chemistry on a mysterious thread of even dodgier provenance?  And you a lawyer an’ all!  No thanks. I don’t have a lot of  time for hearsay or dodgy evidence, especially when there’s so much agenda-driven polemics posturing as science.\nCut the Gordian knot is what I say, given it’s now so securely tied and knotted by the fault-finding authenticists. Simply repeat the radiocarbon dating. Get robots to do all the measurements if necessary, checking first they have not been infected with theist or atheist software and/or computer viruses.\n\n","date":"October 21, 2013 at 9:13 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48230","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Would you care to cite any evidence other than hearsay that refutes what I wrote? Even Jull of Arizona admits that there was cotton in Arizona’s sample just  like the Raes sample. Only he doesn’t honor us with 3000X  plus microphotographs such as those taken with an a scanning electron microscope by John Brown recently published by this blog. Are Brown photographs unreliable hearsay?\nAnything that you did not yourself witness is hearsay. The reports of the carbon labs are in themselves hearsay. You did not perform the tests you rely on what the labs wrote of their tests. That’s hearsay. If you have no time for hearsay you must be very disdainful of Richard Dawkins  who in has even less trust in direct testimony:\n“The dictionary definition of a fact mentions ‘actual\nobservation or authentic testimony, as opposed to what is\nmerely inferred’ (emphasis added). The implied pejorative of\nthat ‘merely’ is a bit of a cheek. Careful inference can be\nmore reliable than ‘actual observation’, however strongly\nour intuition protests at admitting it.” Dawkins, Richard\n(2009-09-18). The Greatest Show on Earth (p. 15). Free\nPress. Kindle Edition.\nHe continues:\n“Obviously, the vast majority of evolutionary change is\ninvisible to direct eye-witness observation. Most of it\nhappened before we were born, and in any case it is usually\ntoo slow to be seen during an individual’s lifetime. The same\nis true of the relentless pulling apart of Africa and South\nAmerica, which occurs, as we shall see in Chapter 9, too\nslowly for us to notice. With evolution, as with continental\ndrift, inference after the event is all that is available to us, for\nthe obvious reason that we don’t exist until after the event.”\nDawkins, Richard (2009-09-18) (pp. 15-16). Free Press.\nKindle Edition.\nThen, Dawkins goes on to make an intriguing analogy:\n“We are like detectives who come on the scene after a crime\nhas been committed. The murderer’s actions have vanished\ninto the past. The detective has no hope of witnessing the\nactual crime with his own eyes. In any case, the gorilla-suit\nexperiment and others of its kind have taught us to mistrust\nour own eyes. What the detective does have is traces that\nremain, and there is a great deal to trust there. There are\nfootprints, fingerprints (and nowadays DNA fingerprints\ntoo), bloodstains, letters, diaries. The world is the way the\nworld should be if this and this history, but not that and that\nhistory, led up to the present.” Dawkins, Richard (2009-09-\n18). The Greatest Show on Earth (p. 16). Free Press. Kindle\nEdition.\nPardon me, but that is precisely the scientists other than  the C-14 labs are doing in the study of the Shroud. The C-14 labs rely on one disputed fact: the C-14 tests of one corner of the Shroud. It is anomalous and all of your bloviating can not change that fact.\nI only wish Dawkins would apply his analysis to the Shroud but as the atheist pope he doesn’t dare. He accepts the “rock solid” carbon dating, except that it isn’t.\nYour Rumpelstilskin like tantrum doesn’t make change the facts.\n\n","date":"October 21, 2013 at 9:58 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48235","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Dan cited John Brown’s paper which included the 3000x plus photographs but didn’t publish all the pictures. They are truly impressive. here’s the cite:\n\\http://www.shroud.com/pdfs/brown1.pdf\n\n","date":"October 21, 2013 at 10:14 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48238","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"John Klotz. ‘Pardon me, but that is precisely the scientists other than the C-14 labs are doing in the study of the Shroud. The C-14 labs rely on one disputed fact: the C-14 tests of one corner of the Shroud. It is anomalous and all of your bloviating can not change that fact.’\nI do think that  for the sake of fairness that you need to mention that there are experts such as Mechthild Flury- Lemberg who would not accept as a ‘fact’ that this part of the Shroud is ‘anomalous’. (See her ‘The Invisible Mending of the Shroud, the Theory and the Reality’.) After an intensive examination she could find no evidence that the corner of the Shroud was different from the main part of the Shroud. Her objections was over whether there was too much contamination in this area for the Shroud to give accurate radiocarbon results.\nSo I am not sure in the present state of play ‘fact’ is appropriate.\n\n","date":"October 21, 2013 at 11:16 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48254","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"‘Anomalous’. One also has to take into account that the original weave of the cloth was not uniform. Gabriel Vial, who examined the Shroud for the radiocarbon dating of 1988 and took his own notes on his examination of the Shroud, has an interesting article in the CIETA Bulletin of 1989 where he notes that there were two types of faults in the original weaving and that there was a major discrepancy in the size of threads used. He gives, with a photograph, two adjoining threads, one of which is two and a half times as thick as the other. So far as I gather the use of different thicknesses of thread is haphazard.  So this means that is there is a variable structure to the original Shroud that needs to be taken into account BEFORE we begin to discuss reweavings or whatever.\nVial also writes that ‘traces of cotton are probably purely accidental’.\n\n","date":"October 21, 2013 at 1:54 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48282","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"I’ll take my time over responding to this one, if that’s OK with you John.\n\n","date":"October 21, 2013 at 2:07 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48284","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"What about Mr CB provocative polemics posturing as archaeological bloodstain pattern analysis, archaeology, history and iconography? Still just the talk of the pot calling the kettle black…\n\n","date":"October 21, 2013 at 9:53 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48233","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"How is a foodie chemist’s opinion reliable as far as those specific fields of expertise are concerned? This is  “big S(scientific)” tchachuka soup indeed!\n\n","date":"October 21, 2013 at 10:00 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48236","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"The only speciality this blogger lays claim to is biochemistry – having three degrees in the subject, including one research degree. There’s limited scope for biochemistry in Shroudology, but an awful lot of scope for plain observation and commonsense. \nGiven the Shroud is unique, it’s questionable whether any academic speciality gives one an advantage over other Shroudies, and in any case, there is a difference between amateur enthusiasts with few if any peer-reviewed publications to their name, and established professionals with checkable track record credentials. What we don’t need are the first posturing as the second, given that a few taps on the keyboard is all that is needed to distinguish one from the other.\nWhy not be content to call ourselves Shroudie bloggers, and stop pretending we are something more than that.\n\n","date":"October 21, 2013 at 10:14 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48239","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"How about Shroggers — we can trademark it and sell t-shirts. :)\n\n","date":"October 21, 2013 at 10:17 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48243","author":"David Goulet","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"I am PROFESSIONAL cryptologist Are you in denial of facts AGAIN? \nShall I teach you again  on which side the Shroud image was? Warp side or weft side? I can tell phony Turin Shroud specialists, and you are one of them.\nAll your big S(cience) amounts to foodie chemistry. We can see everyday all the ravage of your industry on public health. A PhD is not IGNORANCE proof (but this too you sem to ignore).\n\n","date":"October 21, 2013 at 11:02 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48251","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Mr CB, the fact is you are just trying to make the burden of proof heavier on the TS authenticists and seduce the tepids. This is your arch-sceptic’s main agenda. You whole mummy, leech, roasted Knight Templar theory is just WIND (to stay polite)!\n\n","date":"October 21, 2013 at 11:18 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48255","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"BTW, I check on the web, you have no PhD AT ALL in biochemistry, Mr CB…\n\n","date":"October 21, 2013 at 11:24 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48256","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"I showed you many moons ago how to confirm my London University PhD. I gave you the specific URL, and can look it out again if you wish.\nYou must be one very insecure individual to be making such an issue of someone’s research degree in biochemistry.It’s not a Nobel prize you know.  I simply spent 3 years on a research grant researching a somewhat specialized aspect of liver metabolism in a London teaching hospital.\nDrop it. You are on a hiding to nothing.\n\n","date":"October 21, 2013 at 11:58 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48261","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"You have NOT any PhD in BIOCHEMISTRY. That’s a fact.\n\n","date":"October 21, 2013 at 12:13 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48265","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Max & Colin, stop it.\n\n","date":"October 21, 2013 at 1:04 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48272","author":"Dan","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Methinks you are just hiding behind an homonymic Dr. Colin Berry…\n\n","date":"October 21, 2013 at 11:41 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48258","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"…who REALLY got a PhD in biochemistry.\n\n","date":"October 21, 2013 at 11:43 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48260","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Max, you’ll live longer (and happier) if you would just ignore Colin’s posts.\n\n","date":"October 21, 2013 at 12:01 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48262","author":"David Goulet","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Mr CB “thinks”, because he is a foodie chemist with a “PhD”, he can be a Late Antique and Medieval  iconographic analyst ovenight, a paleaographer overnight, a botanist overnight, an archaeological bloodstain pttern analyst overnight or even a cryptologist overnight… He is just a (poor)  AMATEUR as far as Archaeology, Iconogrpahy and Cryptology are concerned.\n\n","date":"October 21, 2013 at 12:11 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48264","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"\nMax Patrick Hamon :\nYou have NOT any PhD in BIOCHEMISTRY. That’s a fact.\n\nHere, for the second time, is the URL that lists my 1976 London University PhD thesis by name, year and title. \nhttp://catalogue.ulrls.lon.ac.uk/search~S16/a?Berry+C.S.\nWhich part of  the word “thesis” do you not understand, MPH?\nNow how about you reciprocating in kind, MPH, given you are making such a song and dance about other people’s qualifications? What about your own? Can you supply links? If not, then kindly stop this absurd hounding of a qualified research scientist, now long retired. I do not need this in my twilight years…\n\n","date":"October 21, 2013 at 12:24 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48266","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Mr CB wrote: “The only speciality this blogger lays claim to is biochemistry” Now I am just asking him: can you just answer my question by “yes” or “no”. Have you a PhD in BIOchemistry?\n\n","date":"October 21, 2013 at 1:29 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48277","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"MPH: Now I am just asking him: can you just answer my question by “yes” or “no”. Have you a PhD in BIOchemistry?\nYes. I have provided a link. I am Colin Berry, PhD (Biochemistry) . Which part of that do you not understand?\n\n","date":"October 21, 2013 at 2:12 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48286","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"\nDan :\nMax & Colin, stop it.\n\nStop what, Dan? Defending my position against the claim that I have lied about my scientific qualifications? Maybe it’s you, the site’s host, who should stop it – the demeaning of other contributors.\n\n","date":"October 21, 2013 at 2:10 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48285","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Not trying to be third man in here (hockey reference, sorry) but I gotta side with Colin on this one. He’d been ignoring Max’s asides for some time but Max kept pushing it.\n\n","date":"October 21, 2013 at 2:22 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48288","author":"David Goulet","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Thanks David.\n\n","date":"October 21, 2013 at 2:54 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48295","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Charles Freeman,\nI am certainly aware of Ms. Mechthild Flury- Lemberg position. I am also aware that it is nonsense. She did a visual examination at low magnification at best. Rogers and Brown used very sophisticated analytical tools including in Brown’s case a Scanning electron microscope that creating images in excess of 3000X. They are available for viewing. http://www.shroud.com/pdfs/brown1.pdf\nIn addition, after Roger’s death, a group of scientists at Los Alamos did further tests on the Raes fibers. \nAnd there is more. After Rogers ‘death, Barrie Schwortz contacted Robert Villarreal who had been given a Raes fiber by Rogers because he wanted a check on his work through an independent analysis. He hadn’t heard from Rogers but after Schwortz contacted him, Villarreal and his associates conducted a series of tests which the results of which they reported to the 2008 Ohio conference and later at the 2012 Valencia Conference. The Valencia report is reproduced at http://www.shroud.com/pdfs/villarrealvtxt.pdf\nThe Ohio report may be found here: http://www.ohioshroudconference.com/a17.htm\nMed. Lemberg also stated that there was cotton throughout the Shroud I believe. However, other than transient cotton debris some of which may have come from the gloves of the STURP team, they could not find cotton on the parts they examined and were puzzled by Raes findings. Rogers had samples both Raes and the main body of he Shroud. They were different. \nThen there is the fact that prior to he release of the C14 results, Oxford was informed of the presence of interwoven cotton in a sample sent by Oxford to Precision Process. It was not transient debris. In the carbon 14 report of the C14 labs published in Nature, buried in the acknowledgements was the following: \n“Oxford thank P. H. South (Precision Process (Textiles) Ltd, Derby) for examining and identifying the cotton found on the shroud sample..” \nIt was the only mention of cotton anywhere in the C14 Report. \nSouth, the head of Precision reported that cotton found on the Oxford sample was:\n‘The cotton is a fine, dark yellow strand, possibly of\nEgyptian origin and quite old. Unfortunately it is impossible\nto say how it ended up on the Shroud, which is basically\nmade from linen. It may have been used for repairs at some\ntime in the past, or simply became bound in when the linen\nfabric was woven.’\nYou can of course choose whatever “expert” you want that agrees with your bias but the physical evidence that cotton as interwoven in the Raes and adjacent carbon sampling sites is there for your examination in the microphotos of Rogers and John Brown. There is no physical evidence of interwoven cotton in the main body of the Shroud.\nThis is a rather long comment. I would appreciate that before you respond you state whether you have taken the time to read the Brown’s report and examine the microphotographs. Then read both Villarreal reports.\nhttp://www.shroud.com/pdfs/brown1.pdf\nhttp://www.ohioshroudconference.com/a17.htm\nhttp://www.shroud.com/pdfs/villarrealvtxt.pdf\nI am sorry if I seem to burden you, but it may be possible, however remote it may be, that the correspondents of this blog include some intelligent people who might just possibly by some remote chance be more knowledgeable about these issues than you take the time to be. And if you are too “busy” to do so, let us know so that we can ignore your uninformed opinions and direct them to the metaphorical circular file.\n\n","date":"October 21, 2013 at 3:43 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48298","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"“And if you are too “busy” to do so, let us know so that we can ignore your uninformed opinions and direct them to the metaphorical circular file.”\nOuch!\nOn second thoughts, John, I shan’t bother now responding (see earlier comment) for fear that I too come in for the same treatment you are dishing out to one very thoughtful and genuine writer and scholar. \nCommercial break:  Repeat the C-14 dating now please Vatican. Kindly put a stop to this growing campaign to impugn the integrity of scientists involved in the ’88 radiocarbon dating.\n\n","date":"October 21, 2013 at 4:41 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48300","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Hugh,\nThere is an issue your missing and that is the age of the linen in the patch area. Rogers analysis of vanillin content indicates that the linen in the patch was not the same age as the rest of the Shroud.  \nAs far as the second question, I am very interested in the comments. I will take them into consideration. \nAs far as your comments on Villarreal, his work speaks for itself and the analysis of him and his team was much deeper than any other involving techniques that were not even available to Rogers before he died. Incidentally,  it is an example of Rogers integrity, that he who sought advice from other scientists to reject his work and conclusions even as he was in the final  days of his struggle with cancer.\n\n","date":"October 21, 2013 at 11:30 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48325","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Reading reports in detail is what I do, and I have looked carefully at everything referenced in the long comment above. It is mostly about the proportion of cotton which may have been included within the threads of the shroud, and I’m afraid is riddled with inconsistencies.\nI agree that the difference between cotton and linen fibres cannot be detected by the naked eye, and has to be determined microscopically. This could have been done by those who examined the sticky tape samples of Frei or the STURP team, by Gilbert Raes (and those who used his sample), and the C14 dating teams (or anyone who had access to their sample). It seems that everybody who has done this has identified cotton fibres among the flax. The question is – how much is there?\nGiulio Fanti (http://www.shroud.com/pdfs/fantir7appendix.pdf) reckons that a fibre taken from the C14 sample area contained about 2% cotton.\nThibault Heimberger (http://www.shroud.com/pdfs/thibaultr7part3.pdf) reckons that a fibre taken from the Raes sample is about 15% cotton.\nRoberto Villarreal (http://www.shroud.com/pdfs/villarrealvtxt.pdf) says that of his Raes thread “cotton was a major constituent.”\nElsewhere Robert Villarrealo (http://www.ohioshroudconference.com/a17.htm) says both ends of a ‘spliced’ thread were “definitely cotton and not linen (flax).”\nNow this simply won’t do. Even if there were a 16th century patch, the possibility that it was made from a variety of different threads containing between 2% and 100% cotton is utterly absurd. Now I’m sorry if I seem to burden you, but unless this discrepancy can be explained satisfactorily, the entire question of the relevance of the cotton, and by extension the theory of medieval interweaving, is thrown into disrepute. I trust you’re not too busy to reply…\n\n","date":"October 21, 2013 at 6:13 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48306","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"And while you’re at it, would you care to comment on the replies to the remark that “I defy anyone, who has the slightest regard for scientific method to review the illustration that appears with the article and still claim that the carbon samples were not from an anomalous portion of the Shroud” which appears in connection with the quad mosaic images?\nOnly if you’re not too busy, of course…\n\n","date":"October 21, 2013 at 6:18 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48308","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Colin,\nI am disappointed in you. I’m afraid you Brits are a little too concerned with pedigree than science.  Freeman has expressed a definite opinion about the cotton issue based upon the observations of one person. The science of Brown, Villarreal and Rogers is supported by multiple analytical  devises and procedures. We know what they did and how deep their science went. It’s all available!\nFreeman is an historian not a physicist. \nIf someone wishes to challenge them, I don’t think it is too much to ask the basis of their challenge and what specific evidence beyond someone’s visual observation they are using. \nToo much science was done by first STURP and then Rogers and his associates to be simply  be ignored because one person said I saw cotton throughout the Shroud. The evidence that Oxford was informed of the problem before the results were reported and then ignored the problem is quite clear.\nFreeman is an historian, not a scientist. I do not rely on my personal scientific knowledge but what I understand of the science done by the excellent and credentialed scientists who have actually dealt with the Shroud. I have followed the Shroud and the most intriguing problems of science including the quantum and related issues for decades. I believe I hare sufficient understanding to understand the findings of others.  They have presented their work and findings and they are accessible. \nI judge among the competing claims but (1) based upon the work of many others the carbon dating  was flawed and (2) the site chosen was anomalous.\n\n","date":"October 21, 2013 at 11:54 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48327","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Hugh,\nI have responded to your questions  in a comment that wound up above your post to me. I intend to pursue this further and I will be blogging on my Quantum Christ blog maybe tomorrow or the next day in greater detail (I have an AM appointment in Manhattan tomorrow). I expect that Dan Porter will link it if its worthwhile.\nIt’s a typo where I wrote that Rogers sought the advise of other scientists “to reject his work.” He sought the advice of other scientists to see if he had made errors.\nFrankly, I haven’t heard from Freeman and I am disappointed.\nFrankly, I appreciate the discourse.\n\n","date":"October 22, 2013 at 12:03 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48331","author":"John Klotz","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Cotton is now the fashionable marker for modern(ish) C-14 contamination, it would seem, but if I’m not mistaken the attention being focused on one tiny area of interest – the 1988 radiocarbon sample – vastly exceeds that for any other comparable area. Yet we read that cotton contamination is peculiar to the radiocarbon sample, that it’s not feature of the Shroud per se. How can we be so sure? Has anyone looked as hard and critically at a range of randomly-selected control samples?  \nIt would be ironic, would it not,  if the upshot of all this sudden interest in cotton were to lead to the discovery that the Shroud is only approximately linen, that it’s really a blend of a lot of linen with a little cotton, the precise amounts of which remain to be discovered?\nCould there be a rationale for linen having a significant cotton fibre component by design rather than accident? One has only to look at the wiki entry on linen to see that there could be. \nOne reason for linen being a lot more expensive than cotton is the difficulty of working with flax fibres – they tend to break easily, being less elastic we are told than cotton. Might it be possible to admix enough cotton fibre with flax to get something that behaves better on the loom, but which still looks and feels like linen (cool on the skin in hot weather etc). If so, when and where might that knowledge of using lightly ‘cottonised’ thread for linen manufacture have been adopted  –  1st century Palestine or medieval Europe? Is anyone else thinking what I’m thinking? Does the militant cotton-contamination wing of the pro-authenticity tendency need to be careful about what it wishes for?\n\n","date":"October 22, 2013 at 2:15 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48338","author":"colinsberry","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"John, I see no reason to reply to your somewhat intemperate comment! I am simply drawing your attention to an article which many people think is relevant but you happen to think is nonsense. Your privilege.\n\n","date":"October 22, 2013 at 3:51 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48343","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"So we have myself as a historian ( who has written the only full length study of medieval relics, one published by a university press, Yale, see reviews of my Holy Bones, Holy Dust on their US website and you can make your own assessment)  we have physicists and we have an acknowledged expert on ancient textiles ( MF-L), a biochemist, and a lawyer (?John Klotz), talking about the weave of an ancient textile. Who trumps whom?\n\n","date":"October 22, 2013 at 4:25 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48348","author":"Charles Freeman","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"The scales of arrogance or the scales of truth and justice?\n\n","date":"October 22, 2013 at 4:38 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48351","author":"Paulette","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"We mustn’t be unfair. It is the job of a scientist to attempt to disprove hypotheses, and by failing to do, strengthen their credibility. It is the job of a lawyer to defend his client, regardless of the truth. In doing so he calls upon a variety of rhetorical devices, such as answering one query by deflecting attention to a completely different one (see the comment about vanillin, above), or justifying an observation on the strength of the good character of the witness (see the comments on Villarreal and Rogers, above). I’m glad John is part of the discussion!\n\n","date":"October 22, 2013 at 5:06 am","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48355","author":"Hugh Farey","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"I’m involved in a blatant example of physicists lying about science in order to promote atheism. Creationist have the incorrect, but intelligible, idea that evolution violates the second law of thermodynamics, according to which a sugar cube dissolves in a cup of coffee but does not un-dissolve. Creationists quite stupidly see an analogy between a sugar cube and a protein. The American Journal of Physics (Am. J. Phys., Vol. 76, No. 11, November 2008) published an article saying evolution does not violate the second law because of the sun. This is literally unintelligible. What is more, the article contains a fake calculation to prove it. I have told my congressman about it (Yvette Clarke, D-NY, 9th district), and the matter is being investigated. This article undermines the integrity of science.\n\n","date":"October 22, 2013 at 3:49 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48441","author":"David Roemer","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"I am unsure Stephen’s assertion that most journalists and their readers are Christian.  That’s a fairly large claim and I have no idea how he can justify it.\n\n","date":"October 22, 2013 at 8:42 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48466","author":"Andy Weiss","site":"shroudstory"},{"title":"Quote for Today: Stephen Jones on journalists and their readers","post":"Physicists are more open to dialogue, but that is not the case with biologists. When it comes to evolutionary biologists, like those whom Gould called “Darwinian fundamentalists”, the situation is far worse.\n\n","date":"October 22, 2013 at 8:52 pm","url":"https://shroudstory.com/2013/10/21/quote-for-today-stephen-jones-on-journalists-and-their-readers/","cat":"carbon_14_dating","id":"comment-48468","author":"Louis","site":"shroudstory"}]
