[{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"I’ve seen this video a few times but it is always nice to refresh the memory especially with the Shroud pioneers of a young Barrie Schwortz, Vern Miller, Don Lynn, Alan Whanger. portrayed with awe, continuity, and conviction.\n\n","date":"April 11, 2014 at 12:08 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-98382","author":"clublu22014","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"In light of the impreciseness of carbon dating, the fuss is not warranted.\n\n","date":"April 16, 2014 at 8:06 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-99896","author":"Andy","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"Once again on radiocarbon dating of the Shroud\nWrong radiocarbon dating of the Shroud in the consequence of biological isotopfractionation\nIt is well known that the cellulose molecules of the linen can change seriously, particularly after a long time. The following chemical processes are responsible for these changes:\n1) Oxidation\n2) Depolimerisation\n3) Substitution of hydroxyl radicals with organic or inorganic radicals\n4) Hydrolysis\n5) Replacement of alcoholic hydrogen\n6) Graft addition reaction with free radical sites, generated via various free radical reaction initiators\n7) Base exchange reactions. Fundamental glucose units liberates from the cellulose macromolecules (depolimerisation)\n8) Addition reaction with free radicals  (effect of UV radiation)\nThese chemical reactions can proceed in the presence of bacteria and fungi, which were clearly identified on the Shroud. A thick komplexum of Lichenotelia, which consists of bacteria and fungi was verified by Leoncio Garza Valdes on the Shroud. The aldehyde and carboxyl groups produced in the above mentioned reactions resulted in a stable bond of fresh 14C on the Shroud (e.g. Chambery fire in 1532). The exchange reactions of different – COOH and – CHO groups containing organic molecules with 14CO2 support the probability of this phenomenon. Nevertheless, these fresh impurities were not more than 1 % which could not removed by the  3 laboratories in the cleaning process before the AMS measurements.\nThere is a further significant factor. It was verified that the end-product of decomposition reaction caused by microorganism (bacteria, fungi) is glucose. They produce CO2 and H20 during their glucose metabolism. Taking into account the isotopic effect in the splitting of 14C – 12C bond, the microorganisms could build 12C from cellulose (glucose) of the Shroud into their organism as energy substrate to a higher degree than 14C. 12C was then metabolised and emitted as 12CO2 in higher amount than 14CO2. It is also known, that the discrimination against 14C in biological systems can achieve more than 15 %. Many scientific publications supported this phenomenon. This isotopfractionation  could cause a relative increase of the 14C in the Shroud during the centuries resulting in the change of isotope ratio and the “rejuvenation” of the Shroud. This enrichment could not be affected by any of the cleaning procedures applied. Although the 3 laboratories (Zürich, Oxford, Arizona) carried out precise measurements, there was no chance to accomplish the radiocarbon dating of the Shroud correctly due to the effects discussed above.\nCalculations\nTheoretical 14C/12C ratio in 1988.                        Presumed isotopfractionations\n(linen was produced 1 year befor Christ’s death)                     11 %, 12 %, 13 %\n                    0.7885\nCalculated 14C/12C ratio owing to isotopfractionation\n                    0.8752, 0.8831, 0.8910\nNormalised ratio for inorganic world (Stuivert-Pollack)\n                    0.9154, 0,9184, 0.9266\nRadiocarbon age  Calendar age\n      728, 700, 666       1260,1288,1322\nResults of the 3 laboratories\nZürich  : pooled  radiocarbon age  :  676,  calendar age :1312\nOxford : pooled  radiocarbon age  :  689,  calendar age : 1299\nArisona :pooled, radiocarbon age  :  642,  calendar age : 1346\nIt is highly probable, that  the 3 laboratories measured  like  14C/12C ratio owing to mentioned and  presumed microbiological isotopfractionation. Consequently, the real age of the Shroud cannot be exactly determined   when we ignore this phenomenon.  \nIt is well known that normalization of the measured values  of – d 13C is necessary because there is a differences between the concentration of 13C and 14C in the inorganic world (atmosphere) and biological world (living matter). The relationship is: -d14C/(2x-d13)/%.  It is important, that the value of -d13C assumed to be constant. Recent 13C measurements in plants indicate that the concentration in 14C is not constant as it was assumed in Libby’s time.\nConclusions\nThere is a possibility to measure of this isotopfractionation factor on the Shroud.First : it would be necessary to identify microscopically the real thickness of the bacteria and fungi colony. Second : collect more microbiological samples from the Shroud particularly in the neighbouring of the location of the previous sampling  for the correct determination of the main factor: microbiological isotopfractionation. The microbiological sampling would be not at all harmful for the Shroud. 14C radioisotope labeled glucoses can be use for the determination of isotopfractionation.\n\n","date":"April 19, 2014 at 11:03 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101270","author":"Dr.Tibor Szarvas","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"I find this a little difficult to follow but I think I understand. Contaminant fungi and bacteria ingested the Shroud’s carbon by disgesting cellulose, and selectively exhaled, as CO2, the C12 fraction rather than the C14 fraction. The contaminant cells, and their remains after death, were thus enriched in C14, and would have given a more recent date than the real one after radiocarbon dating. Is that the case?\nIf so, I still cannot accept that there would be sufficient contamination for the date to be shifted by the required 1300 years. Even if the carbon content of the contaminant was entirely C14, there would still need to be twice as much contaminant as original to be tested to distort the date sufficently. It is not credible that this could have gone undetected, and would not have been largely removed by the acid-base-acid pretreatment.\n\n","date":"April 19, 2014 at 11:38 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101290","author":"Hugh Farey","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"The 1300 years shift seems difficult to explain by contamination alone.  I still think the best explanation, in light of all the other evidence for authenticity, is the invisible reweave hypothesis indicated by the unique cotton contamination together with other associated additives, as argued frequently on this site over the last several months.\n\n","date":"April 19, 2014 at 4:31 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101395","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"Some unrelated question, the mass amount of carbon in linen is about 25 %, right?\nWhat is in the wool? Anyone knows? I would like to make some calculations…\n\n","date":"April 19, 2014 at 5:58 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101428","author":"O.K.","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"Cotton is almost pure cellulose, C6 H10 O5, which is 44.4% carbon.\nLinen is about 92% cellulose, 4% lignin, 2% hemicelluose and 2% “others.”  As the formula for lignin is C9 H10 O2 C10 H12 O3 C11 H14 O4 I have not bothered to calculate its carbon content, but it can’t be far off the same as pure cellulose.\nWool, according to http://www.keratin.com/aa/aa012.shtml#03, is 50.65% carbon.\n\n","date":"April 19, 2014 at 6:22 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101436","author":"Hugh Farey","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"Thank you Hugh. Mark Oxley writes: The conversion factor between the weight of the Turin Shroud cloth and its carbon weight is 24%. (see http://www.shroud.com/pdfs/oxley.pdf ). You claim ~40 %. May humidity play some role? In case of wool, we all know how it absorbs water, so mass amuont of carbon should be lower. \nAccording to http://en.wikipedia.org/wiki/Beeswax , An approximate chemical formula for beeswax is C15H31COOC30H61, thus ~ 80 % of it is carbon. Thus for Oxley’s 24 % , and 75 % new vs old ratio (assuming circa 16th century contamination) needed to switch the date of the TS from 1st to 14th century, the amount of wax contamination must be approximately 47 % (let’s say 50 % -for 66 % new vs old, assuming later 17th-19th century contamination, it needs to be 37 %). Possible? Hardly, I think, but one must finally detemine the sizes and masses of the samples -their average density should be 2x average density of the TS.\n\n","date":"April 20, 2014 at 4:44 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101596","author":"O.K.","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"Everyone is grasping at straws regarding image formation. All theories thus advanced have holes. Perhaps the image was created by the resurrection process. Who knows how. If the image was created by a process beyond our time-space continuum then perhaps dating the shroud is beyond our compehension.\n\n","date":"April 19, 2014 at 9:44 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101494","author":"Thomas","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"I don’t know where Mark Oxley got his 24% from. Mine is from the molecular weight of cellulose. Another composition of linen yarn is in The Mysteries of the Shroud by Caspar von Uffhofen (on Google Books). He gives “64 to 74% cellulose, 11 to 17% hemicellulose, 1.8% pectin, 2 to 3% lignin, by 1.5% wax and 8 to 10% water.” The proportion of carbon doesn’t change much. In practice, materials are always dried thoroughly specifically to exclude any variable water content before weighing.\nI’m not surprised that a (more-or-less) hydrocarbon such as wax contains a great deal more carbon than a carbohydrate such as cellulose, but as you have calculated, there would still have to be a substantial amount of it to skew the carbon dating appropriately.\nThe sizes and masses of the samples are relatively easy to assess. from Barrie’s photos and the various diagrams and measurements (inconsistent though they be) you can find on the web. Sadly, as we have discussed before, the Shroud itself has never been weighed, and all assessments of its mass are derived from rather abstruse measurements of the relative thicknesses of the shroud with its backing and general statements about the average weight of linen and/or Holland cloth. However, I have been very surprised recently to discover quite how heavy a 25mg/cm2 cloth actually is. It’s very thick indeed, more like thin canvas than sheeting. No wonder not a lot got through it!\n\n","date":"April 20, 2014 at 5:41 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101609","author":"Hugh Farey","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"Thanks Hugh.\nWhat concerns me more, is the carbon dating of the Tunic of Argenteuil and the Sudarium of Oviedo, particularly the later. All those objects are considered to be related to each other, as there is evidence they were worn by one and the same person.\nJust to remind everyone:\nThe (wool) Tunic of Argenteuil has been carbon-dated twice:\n* first dating, by Saclay: 1480 +/- 30 years BP, that is 530-650 AD at 95 %\n* second dating, by Archeolabs 1260 +/-40 years BP, that is 670-880 AD at 95 %\nThe Sudarium of Oviedo has also several times. Various accounts exist:\nDating in the 80s, by two laboratories: Tuscon and Toronto:\n* 653-786 AD Toronto , and 642-769 AD (in other version 642-869 AD) Tuscon. Micheal Hesemann, on the other hand, reprots 540-869 AD\n* Mark Guscin reports (http://www.shroud.com/pdfs/n65part6.pdf):\nJust weeks before the congress took place, new samples from the Sudarium were\nsubject to carbon dating. Five samples were dated from five different cloths –three of\nthem came up with the expected date, while the cloth from an Egyptian mummy returned a date of any time in the 19th or 20th centuries. The laboratory immediately concluded that the cloth (and the mummy) were fakes. The sample from the Sudarium was dated to around\n700 AD. Scientist César Barta spoke about the carbon dating process, emphasising the fact that if carbon dating is always absolutely accurate, then we could just as well finish the congress there and then. However, there were several points to bear in mind– in specialist carbon dating magazines, about half the samples dated come up with the expected date, around 30% with an “acceptable” date, and the other 20% is not what one would expect from archaeology. The laboratory used (via the National Museum in Madrid) said they were surprised by the result and asked if the cloth was contaminated with any oil based product, as oil is not cleaned by the laboratory processes used before carbon dating and if oil is present on a sample, the date produced by carbon dating is in fact the date of contamination. Finally, the history of the Sudarium is very well established and there are definite references to its presence in Jerusalem in AD 570 and at the beginning of the fifth century. \nMicheal Hesemann in a recent book (“Chusta Chrystusa, Naukowcy na tropie zmartwychwstania” pg. 230-232, that is polish edition of “Das Bluttuch Christi”) gives some more details. The dating was performed by Beta Analytic Inc. from Miami, and the result was 660-890 AD, similar to the Archeolabs dating of the Tunic of Argenteuil.\nWhat is the source of contamination, assuming all those relics date from the time of Christ? In case of the Shroud it is most probably the invisible reweave -that’s the only non-conspirational and non sci-fi thesis hat makes sense. But what about Tunic and Sudarium. We should remember that the Tunic was buried in Parish garden by Abbot Ozet during French revolution, and is heavily contaminated by both organic and non organic contaminant. Marion and Lucotte suggested it was contaminated by calcium carbonate and performed some tests which showed that it is not entirely removed by cleaning procedure, but I don’t believe it was the sole factor in the case of Tunic. Than one should ask question what about Sudarium? Most probably it is wax -it was found all over the surface of the Sudarium. But is that amount enought?\nSome calculations: I assumed the true age of the relics to be 1983 BP, roughly the time of Christ. The date of contamination to be 200 BP, roughly 17th -19th century (see http://depts.washington.edu/qil/datasets/uwten98_14c.txt ).\nThus the amount of contamination to skew the carbon dating is :\n* for Miami dating of Sudarium, and Archeolabs dating of Tunic, 1260 BP (670-880 AD)=38 %\n* for Saclay dating of the Tunic, 1480 BP (530-650 AD) =26 %\nNow assume that the source of contamination is wax, roughly 80 % of which is carbon. Thus the amount of contamination:\n*for Miami dating of Sudarium, assuming 44 % of linen consisting of carbon =25 %, assuming assuming 25 % of linen consisting of carbon =16 %\n* for Archeolabs dating of Tunic, assuming 50 % of linen consisting of carbon =28 %\n* for Saclay dating of the Tunic, assuming 50 % of linen consisting of carbon =18 %\nPossible? I don’t know. Weighting other evidence for authenticity of those items it should be possible. Another puzzle with carbon-dating to solve.\n\n","date":"April 20, 2014 at 7:53 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101633","author":"O.K.","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"And Thomas, you’re quite correct that the image formation may be beyond our comprehension. But then again, maybe not!\n\n","date":"April 20, 2014 at 5:44 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101610","author":"Hugh Farey","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"Many of the unsatisfactory attempts at producing images have resulted from using inappropriate cloth.  Recent discussion here supports Ray Rogers’ assertion that the image lies not on the PCW of the cellulose fibres but on the starch coating resulting from the ancient methods of manufacturing linen.  This seems indicated by Rogers being able to remove the coloration of an imaged fibre using diimide while the underlying linen fibres were shown to be intact and unaffected.  Prof Fanti does not seem to have recognised this in some of his excimer laser tests but seems to have assumed that the image lies on the PCW.  Rogers succeeded in coloring Edgerton linen which does have a coating. Also Giovanna De Liso in her seismic experiments used linen which she says had only ever been washed in Marseilles soap since 1860; Her cloths were soaked in water or oily solutions of aloe, myrrh and tolu balsam in various percentages; sometimes she added NaCl, bovine blood or her own blood, in attempts at discovering an image reactive mix. \nA naturalistic solution may be found, but it will depend on hitting on the correct reactive mix. Unless the correct ingredients for the recipe are used, under the correct environmental conditions, then the cake won’t bake! [I’ve just been watching the semi-final run-offs for the NZ Masterchef competition, and I can see a connection!]\n\n","date":"April 20, 2014 at 7:35 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101630","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"From OK’s quote above:\n” …as oil is not cleaned by the laboratory processes used before carbon dating and if oil is present on a sample, the date produced by carbon dating is in fact the date of contamination.”\nVery interesting given the historical hints that the shroud may have been boiled in oil some time before 1500, Antoine de Lalaing:\n“To prove if it was the true Shroud, it was boiled in oil, tossed in fire, laundered different and numerous times. But one could not efface nor remove these imprints and marks of our sweet Lord.”\nIt also reminds me of an experiment by Mario Moroni and Remi van Haelst where modern linen (relatively high amount of C14) was boiled in mineral oil (relatively low amount of C14). Samples of treated and no treated linen were then radiocarbon dated by Toronto and Oxford who noticed a 36% decrease in C14 for the treated piece. \nThe paper can be found here: https://www.shroud.com/vanhelst.htm\nSo what about the opposite conditions of old linen and modern oil based on vegetable or animal (fat)? I made some rough calculations based on the assumption that the exchange of carbon atoms between linen and oil affected 36% of the linen carbon atoms and estimated the new age to be around 2000 years taking into account the exponential decrease from 1500.\nIt seems reasonable anyway to have a radiocarbon estimation of age closer to the moment of contamination as Mark Guscin reported the expert telling in the quote from OK.\nStrange that no one has investigated this alternative further!\n\n","date":"April 20, 2014 at 12:10 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101682","author":"Henrik","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"I don’t believe the shroud was laundered in an aqueous base because we can clearly see the effects of a simple water spillage on the mutiple water stains on the shroud. There is also an apparent smudge in the blood stain between the two heads because of a water stain.\n\n","date":"April 20, 2014 at 5:54 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101756","author":"Mike M","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"Food for thought. I was not aware of the Moroni/Van Haelst dating test. However, while it is true that the standard acid-base-acid treatment may not remove contaminant oils, the shroud samples were also subjected to detergent, ether, ultrasound and Soxhlet procedures precisely in order to remove this source of contamination, which was considered beforehand.\nI would think myself that a cloth boiled in oil shows very clear signs of its treatent, which is certainly not apparent in the Shroud. I also doubt any significant “exchange of atoms” although that is quite a popular idea at the moment in various contexts.\nThere are a couple of interesting articles on a similar theme at https://journals.uair.arizona.edu/index.php/radiocarbon/article/view/4005 and https://journals.uair.arizona.edu/index.php/radiocarbon/article/view/3560.\n\n","date":"April 20, 2014 at 1:53 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101702","author":"Hugh Farey","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"Henrik: Very interesting given the historical hints that the shroud may have been boiled in oil some time before 1500, Antoine de Lalaing:\n“To prove if it was the true Shroud, it was boiled in oil, tossed in fire, laundered different and numerous times. But one could not efface nor remove these imprints and marks of our sweet Lord.”\nFrom Ray Roger’s FAQ (response to question 4 see http://www.shroud.com/pdfs/rogers5faqs.pdf):\nImage and control fibers show identical crystal properties. The image is not a scorch. The cloth was not heated, not even boiled in oil. (emphasis mine).\nHall claimed that the contamination of Oxford sample was no greater than 1 % The contamination was not reason for anomalous C14 result in case of the Shroud.\nIn case of the Sudarium or Tunic of Argenteuil it is probably different.\n\n","date":"April 20, 2014 at 2:16 pm","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-101713","author":"O.K.","site":"shroudstory"},{"title":"Ray Schneider: Why is the carbon dating wrong? I don’t know. That it is wrong I am quite certain . . .","post":"Thank you for your responses. I think you have argued quite convincingly why we should treat Antoine de Lalaing’s claim with extra caution and will only grant boiling in oil a small chance of being true. \nWhat I had in mind was the shroud suspended at its center on a wooden plank with its both ends submerged in the vessel for testing the effects on the lower part of the frontal foot region. But of course I have no evidence to back it up with. I don’t consider Pam Moons argument for this part being cut away based on the Lier copy very strong for example. Later copies shows the same trend of a longer shroud. And the distances poker holes – edge is roughly the same for both ends of the cloth.\nHowever, whatever the reasons might be, the radiocarbondated area seems to be quite contaminated with later added substances. It’s the combination of contamination and heat (1532 fire) that concerns me the most. And the only studie I have come across which take both into account is the Moroni – van Haelst paper mentioned above. Sadly they do not seem to have taken the cleaning procedure beyond the standard acid-base-acid technique to include the more sophisticated cleaning procedures mentioned in Hugh’s two interesting links.\n\n","date":"April 26, 2014 at 9:16 am","url":"https://shroudstory.com/2014/04/10/ray-schneider-why-is-the-carbon-dating-wrong-i-dont-know-that-it-is-wrong-i-am-quite-certain/","cat":"carbon_14_dating","id":"comment-104021","author":"Henrik","site":"shroudstory"}]
