[{"title":"Comment Promoted: Are the Quad Mosaics Meaningless?","post":"Are the Quad Mosaics Meaningless?     YES!\n\n","date":"January 22, 2014 at 6:48 pm","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","id":"comment-74155","author":"Giorgio","site":"shroudstory"},{"title":"Comment Promoted: Are the Quad Mosaics Meaningless?","post":"Yes.\n\n","date":"January 23, 2014 at 5:42 am","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","id":"comment-74212","author":"anoxie","site":"shroudstory"},{"title":"Comment Promoted: Are the Quad Mosaics Meaningless?","post":"They are now too validly contested to be meaningful. If we say the same for the C-14 dating then we must be consistent and say the same of the quads.\n\n","date":"January 23, 2014 at 10:33 am","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","id":"comment-74241","author":"David Goulet","site":"shroudstory"},{"title":"Comment Promoted: Are the Quad Mosaics Meaningless?","post":"Here is another pertinent paper:Digital image processing techniques demonstrating the anomalous nature of the radiocarbon dating sample area of the Shroud of Turin at   http://www.academicjournals.org/article/article1380798975_Morgan.pdf\n\n","date":"January 22, 2014 at 6:54 pm","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","id":"comment-74156","author":"Joe Marino","site":"shroudstory"},{"title":"Comment Promoted: Are the Quad Mosaics Meaningless?","post":"Thanks, Joe, for introducing something new.\nHowever…\n(Didn’t you just know there would be a ‘however’?)\nThis paper begins with the information that the research therein would be based on a UV-F photograph taken by Vernon Miller in 1978, which can be found at Shroud Science Group website. The photograph, unchanged, is reproduced in the paper as Figure 1. It is in varying shades of brown, with a very bright area from the backing cloth where the Raes sample was cut. Now I have Miller and Pellicori’s 1981 paper published in the journal of Biological Photography, which includes a detailed description of the set up for the UV photographs, and six well reproduced photographs. Neither the set up nor the photographs are at all consistent with the photograph which claims to be one of their photographs in Morgan’s paper. Their photographs are grey-blue rather than brown, and do not extend to the edges of the shroud. They exclude the radiocarbon corner altogether. In view of these comments I dispute that the photograph analysed by Morgan is a UV-F photograph at all. Can you clarify that?\nThe paper goes on to increasingly elaborate methods to demonstrate that the colour of the radiocarbon area is different from the rest of the shroud, but does not even mention, let alone discuss, that that the area around the burn holes is exactly the same colour. It is a major argument against Morgan’s hypothesis that difference in colour represents difference in chemical composition, but he doesn’t even notice it.\nBy far the biggest anomaly in the picture is the difference between the adjacent areas of Holland cloth, the area of the ‘missing corner’ and the area which once backed the Raes sample. If difference in colour represents difference in chemical composition, this is extremely significant. Once again, however, Morgan makes no comment at all.\n\n","date":"January 22, 2014 at 8:37 pm","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","id":"comment-74165","author":"Hugh Farey","site":"shroudstory"},{"title":"Comment Promoted: Are the Quad Mosaics Meaningless?","post":"Perhaps you can persuade Morgan to join in and directly address your comments.  His email is jmorgan@towson.edu.\n\n","date":"January 22, 2014 at 8:46 pm","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","id":"comment-74166","author":"Joe Marino","site":"shroudstory"},{"title":"Comment Promoted: Are the Quad Mosaics Meaningless?","post":"The Mosaic demonstrates “cross curve” characteristics of each separation due to improper exposure balance to each separation film.  The project also fails to provide any calibration procedure used to calibrate each separation curve. I’m sorry to say, As a dye transfer technician in the 70’s this is nothing more than improper exposures of each separation film.  Any conclusion based on this image is speculative.\n\n","date":"January 22, 2014 at 10:10 pm","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","id":"comment-74173","author":"Giorgio","site":"shroudstory"},{"title":"Comment Promoted: Are the Quad Mosaics Meaningless?","post":"Hugh Farey wrote :\n“… let alone discuss, that that the area around the burn holes is exactly the same colour. It is a major argument against Morgan’s hypothesis that difference in colour represents difference in chemical composition, but he doesn’t even notice it. …”\nWell …\nWhere is the new study ?\nWhere is the “Multivariate analysis of spectroscopic data” ?\nSorry.\nI wrote that because\nI have read the Abstract of the study :\n“Application of chemometric analysis to UV-visible and diffuse near-infrared reflectance spectra.”\nby Christopher Brent Davis\nAbstract :\n>Multivariate analysis of spectroscopic data has become more common place in analytical investigations due to several factors, including diode-array spectrometers, computer-assisted data acquisition systems, and chemometric modeling software. Chemometric regression modeling as well as classification studies were conducted on spectral data obtained with chili peppers and fabrics samples. Multivariate regression models known as partial least squares (PLS-1) were developed from the spectral data of alcoholic extracts of Habanero peppers. The developed regression models were used to predict the total capsaicinoids concentration of a set of unknown samples. The ability of the regression models to correctly predict the total capsaicinoids concentration of unknown samples was evaluated in terms of the root mean square error or prediction (RMSEP). The prediction ability of the models produced was found to be robust and stable over time and in the face of instrumental modifications. A near-infrared spectral database was developed from over 800 textile samples. Principal components analysis (PCA) was performed on the diffuse near-infrared reflectance spectra from these commercially available textiles. The PCA models were combined together into a soft independent modeling of class analogy (SIMCA) in order to classify the samples according to fiber type. The samples in the study had no pretreatments. The discriminating power of these models was tested by creating validation sets within a given fiber type as well as attempting to classify samples into a category that they do not belong to. The apparent sub-class groupings within the same fiber class were investigated as to whether or not they were caused by chemical processing residues, multipurpose finishes, or dyes\n— — —\nI hope in other kind of analyses (see, for example, the investigations using the Chemical Force Microscopy)  in order to clarify the question …\nSo …\nWhat is your answer about the CFM way in comparison with the other ways ?\n\n","date":"January 23, 2014 at 9:58 am","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","id":"comment-74237","author":"piero","site":"shroudstory"},{"title":"Comment Promoted: Are the Quad Mosaics Meaningless?","post":"The first questions to discuss after the proper SPM analyses\nseems to be the comparison with the exact detection of contaminations\nand then there is to take into account the question of fungal and bacterial contamination …\nSee, for example, the recent papers by Pam Moon …\n— — —\nBut, “to begin at the beginning” :\n… my intervention (in 1998) was temporarily inserted\nin the field of “Conservation” (because I indicated the ancient plies as interesting\nareas to control). But soon I agreed to change this field of studies with another,\nand then the programmed intervention was integrated in the group by Dr. Scannerini (moderator) : “Trace Biology sessions”.\nThe use of SPM investigation permits (in my idea) to underline what is\nthe degree of mechanical aging and offers some useful indication about\nthe cellulosic DP, etc.\nIn any case the interesting argument of ancient fold-marks on the Shroud was firstly\ninvestigated by Dr. John Jackson, who identified ancient fold-marks, individually\ndistinguishable as a ridge or valley type and several interesting areas (listed/catalogued\nstarting from the letter A until to G) have been indicated by Ian Wilson\nin her own book : “The blood and the Shroud”.\nI don’t understand why the informations obtained using the Raman\nanalyses (by Renishaw, 2002) were not recollected\nin the case of the 14C area … Perhaps the reason is the following :\nbecause the first attempt failed (in order to understand what happened,\nwith this kind of Raman controls, read the paragraph of Raman controls\nin the interesting book by prof. Giulio Fanti and Saverio Gaeta published in 2013)\nand after that fact, this interesting way (to improve the level of knowledges)\nwas simply abandoned …\n— —\nBut, before to continue (… for example, see also : the comparisons for the SPM controls\nwith respect the  ATR-FTIR controls)  … I want to ask :\nWhat is your remark about this point (= the lack of Raman analyses\non radiocarbon area and neighbourhood … ) ?\n\n","date":"January 24, 2014 at 10:57 am","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","id":"comment-74392","author":"piero","site":"shroudstory"},{"title":"Comment Promoted: Are the Quad Mosaics Meaningless?","post":"I’m curious whether the opposite corner (on the same side of the Shroud) has ever been examined to see if it is consistent with the radiocarbon corner using SPM analysis.   One would think that any unusual handling and possible mending that would create added material to skew the C14 date would also exist at that corner.\n\n","date":"February 3, 2014 at 11:55 am","url":"https://shroudstory.com/2014/01/22/comment-promoted-are-the-quad-mosaics-meaningless/","cat":"carbon_14_dating","id":"comment-76203","author":"Randy Schreiner","site":"shroudstory"}]
