[{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"some things are true rather you like them or not I still believe the shroud is real and until someone really proves to me otherwise ill go to my grave believing\n\n","date":"February 1, 2014 at 4:58 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75786","author":"Darla Mann","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"In science, I’m assuming, the ideal is to always work with a level playing field. This was more of a ski hill.\n\n","date":"February 1, 2014 at 5:17 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75791","author":"David Goulet","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"The real crime was the campaign of the radio carbon labs to exclude STURP from any further tests of the Shroud until the carbon dating was accomplished. Their logic was in part: if it isn’t dated to the time of Christ why bother with further tests.They also convinced the Vatican that the STURP tests would damage the Shroud. Even more important were the constantly shrinking and eventually disappearing protocols. STURP could have rendered valuable assistance in selecting the sites for the carbon samples. By reason of STURP’s exclusion from the process, the sample site selected was absolutely the worst choice.\nIn the end what the carbon labs succeeded in doing was destroying their own credibility. It just took awhile and the role that Sue Benford and Joe Marino in starting that ball rolling was epochal. They pointed in a direction, Barrie Schwortz publicized their presentation. Yet, it was Ray Rogers who had become a skeptic of the Shroud who fabricated the coffin and then pound the nails into  the lid of the radio carbon dating coffin.\n\n","date":"February 1, 2014 at 6:25 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75804","author":"John Klotz","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"Joe, I would be more than infuriated with the direct hit to sabotage the truth you and Sue worked so tirelessly to reveal.\n\n","date":"February 1, 2014 at 6:34 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75806","author":"Annette Cloutier","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"I think the radiocarbon labs are being presented as fall-guys quite improperly. The amendation of the various protocols was, I believe, decided upon by the custodians of the Shroud, and the final details of where to take the sample from and even how much to take was wholly beyond their control. Members of STURP could no doubt have suggested a better area, so could any of the radiocarbon scientists, and so could you or me, but really anybody could have guessed that where it was finally taken was more or less inevitable.\nAs for the radiocarbon date being wholly discredited, I fear wishful thinking is coming into play here. Challenged, I grant you, and quite respectably, but without a little more information about where Rogers got his evidence about “other medieval linen” and “other very old linens” it can hardly be said to be seriously threatened. Vanillin has been extracted from coal, so is not necessarily destroyed by age. It may be that it was present on the 1988 samples, but not detected, or is only present as a contaminent on the Raes and radiocarbon sample. Until this is resolved, the coffin not only stays open, but empty as well.\nAnd as for peer-reviewing, I agree it was a pity people with such an axe to grind were appointed reviewers of Sue and Joe’s paper; but I wonder if Radiocarbon had much choice. I’ve no doubt the same sort of thing happens in all sorts of fringe scientific inquiries; there are only a few people qualified to comment on any submitted paper, and all of them have their own interests chiefly at heart. I wonder who else would have been qualified to comment on Sue and Joe’s ideas.\n\n","date":"February 1, 2014 at 8:07 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75817","author":"Hugh Farey","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"Hugh,\nHave you ever read the books on the carbon dating by David Sox and Harry Gove. If not, I would suggest you read them before carrying water for the carbon labs. Then again, maybe you just want to go with the temporal power.\nAmong other things both Sox and Gove attempt to picture STURP has a group of Christian fanatics. Something they were not. If the labs were so professional why the personal attacks on the STURP team members? \nBegin your response to me if you wish one with a statement as to whether you read Gove’s book because if you haven’t you are talking through your hat.\n\n","date":"February 1, 2014 at 8:25 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75821","author":"John Klotz","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"From what I have read of  Benford and Marino’s papers, it would seem more appropriate  that they should have been submitted to a journal specialising in ancient textiles/ weaving, such as the Bulletin of CIETA, and there are others ( there seems to be quite a coterie of those involved in ancient weaving techniques with journals/ newsletters ,etc.). I have never seen anything in what they have written that deals directly with radiocarbon techniques as such but rather with weaving which is a different specialist area.\nObviously to be taken up by a specialist journal, Benford and Marino would have been expected to show some specialist knowledge of their subject. It would perhaps have been easier if they had found another co-author, someone who had specialised in reweaving techniques, for instance, who could give them credibility in this area.\n\n","date":"February 2, 2014 at 4:21 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75899","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"Interesting,  I wonder if it could still be reviewed today by a textile journal?  I bet there would be many textile specialists ready to give Joe Marino credibility.\n\n","date":"February 2, 2014 at 8:23 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75943","author":"Annette Cloutier","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"Annette,\nI don’t know how long you have been contributing to the blog, but the last few months they have caught my eye. Like Paulette, you are short and to the point. I am trying to put to bed a somewhat complex part of my manuscript which is an analogy between the La Bella Principessa and the Shroud. It covers the functions of science and skepticism when the issue is disputed provenance. \nI glad there are individuals like yourself keeping “an eye on the store.”\n\n","date":"February 2, 2014 at 8:50 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75948","author":"John Klotz","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"\nJohn Klotz :\nAnnette,\nI don’t know how long you have been contributing to the blog, but the last few months they have caught my eye. Like Paulette, you are short and to the point. I am trying to put to bed a somewhat complex part of my manuscript which is an analogy between the La Bella Principessa and the Shroud. It covers the functions of science and skepticism when the issue is disputed provenance.\nI glad there are individuals like yourself keeping “an eye on the store.”\n</blockquote.\nMerci pour le compliment!  So John, who is this beautiful princess you are writing about… Is it Marguerite de Savoy, or Princess Clotlide or is there another?  Can you give us a thread?\n\n","date":"February 2, 2014 at 5:14 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-76039","author":"Annette Cloutier","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"I couldn’t careless about the carbon dating of the shroud. It failed. If we carbon dated the known age of the Hungarian Pray Manuscript Illustrations, it would have failed to have the date within range. Would you trust the dating method?\n\n","date":"February 1, 2014 at 11:02 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75848","author":"don","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"“We do not release reviewers’ identities to authors or to other reviewers, except when reviewers specifically ask to be identified. Unless they feel strongly, however, we prefer that reviewers should remain anonymous throughout the review process and beyond. Before revealing their identities, reviewers should consider the possibility that they may be asked to comment on the criticisms of other reviewers and on further revisions of the manuscript; identified reviewers may find it more difficult to be objective in such circumstances.\nWe ask reviewers not to identify themselves to authors without the editor’s knowledge. If they wish to reveal their identities while the manuscript is under consideration, this should be done via the editor, or if this is not practicable, we ask authors to inform the editor as soon as possible after the reviewer has revealed his or her identity to the author.\nWe deplore any attempt by authors to confront reviewers or determine their identities. Our own policy is to neither confirm nor deny any speculation about reviewers’ identities, and we encourage reviewers to adopt a similar policy.”\nThis is the statement of the Group Nature about anonymity in peer review . (http://www.nature.com/authors/policies/peer_review.html). It is common to all respectable scientific journals. I wonder how Mr. Marino has come to identify his reviewers.\n\n","date":"February 2, 2014 at 4:04 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75893","author":"David Mo","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"David is right. I am often reviewed by anonymous reviewers. I have discovered unofficially one or two of them  (never from the press/editor that commissioned them)  and it is often a surprise to find out who they are. On one book I have one peer reviewer saying ‘this book must be published’ and another saying ‘it will be a waste of time publishing this book’. Luckily the first prevailed and the book has been quite successful!\nI did get one reviewer who said he would be happy to be identified and he provided an endorsement!\nBut, as I am sure Benford and Marino will have quickly realised, rightly or wrongly, specialist journals do expect you to show that you have some academic background in the subject on which you submit an article.  The better journals have more than enough articles by specialists clamouring to be included, especially in the UK where the list of publications is used to assess university departments.\n\n","date":"February 2, 2014 at 5:28 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75909","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"I have read both Gove’s and Sox’s books in detail, and a number of other papers published by others, and am not unaware of the controversy between some of the individuals involved in the radiocarbon dating, and some of the members of STURP. I agree that the STURP team were not religious fanatics, but also think that it would be unfair to characterise the radiocarbon scientists as fanatically anti-religion. I have argued in another place that it was almost certainly respect for the shroud that led to their acquiescence to, if not approval of, the final selection place.\nHowever all this misses the point of my post above, which was that the radiocarbon labs did not need STURP to tell them the best place to take samples from.\nIncidentally, and I have asked this before without anybody seeming to know; although everybody agrees on the worst place to choose a sample from, did anybody, religious or secular, actually suggest anywhere else, apart from general requirements that it should be away from image or burn areas?\n\n","date":"February 2, 2014 at 5:26 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75908","author":"Hugh Farey","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"STURP never pretended to have an expert on radio-carbon dating on their books ,any more than they claimed to have an historian of relic cults or a specialist in ancient weaving. On what grounds should they have been included when there was a specific job requiring specialist knowledge that none of them pretended to have? I fail to see what they would have added- as Hugh says -where would STURP have taken the sample from?\nAfter all, the relationship that STURP had was with the Savoys owners, there was no reason why this relationship should have been transferred to the new owners, the Vatican.\nI was taken to task in this blog for saying that STURP existed after 1981, so what was STURP’s status in 1988? They still seem to be around in some form for this year’s coming conferences.\nI agree with High that the STURP members were not religious fanatics ( although Rogers apparently claimed, i think in Gove’s book, that some of them were)- it was just that they had limited specialist skills when one takes the Shroud as a whole.\n\n","date":"February 2, 2014 at 5:35 am","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-75912","author":"Charles Freeman","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"Annette,\nThanks for your interest but the princess I am writing as a side bar more or less, maybe 10 or so pages was Bianca Sforza, illegitimate daughter of the Duke of Milan who was legitimatized and then betrothed to the general of he Duke’s armies at age 8, the marriage to be celebrated when she was a “mature” 13 years old.\n Leonardo, we now know drew a picture of her for a book celebrating her marriage. But she was indeed a lost princess in two ways. Four months after her wedding and Leonardo’s picture being bound into a celebratory book of her wedding, she died from apparent complications of pregnancy. But the wedding book and the drawing by Leonardo were carried some years later to Warsaw Poland by one of the Duke’s other daughters or heirs. History lost track of it. At some point the drawing was removed from the Warsaw volume and its existence was never recorded any place. There was no mention of it in any of the Leonardo literature prior to 2008.\nIt had been sold by Christie’s at an auction in 1989 has a German, 19th century. How it was discovered and then eventually authenticated back to the 15th century is an amazing detective story of provenance that parallels many of the issues of the Shroud,\nThe Story can be found on the site of Lumiere Technology. http://www.lumiere-technology.com/discoveries.html\nI think it’s a good analogy for a couple of reasons. First there is the application of spectral imaging technology to an issue of disputed false provenance that helped discover the truth. Second, are the skeptics, almost all of whom never viewed the actual drawing although invited by the owner and had “dogs in the hunt” – vested interest of either themselves or colleagues that were at stake. It was sold twice that we know of in 1989 and 2008 for  less than $23,000. It is now insured by its owner for 150 million.\nIt has appeared twice on the blog, once in 2012 in a posting by Dan P. and once in January of this year in a posting of Dan by a comment by me.\nhttps://shroudstory.com/2012/03/06/from-leonardos-lost-princess/\nhttps://shroudstory.com/2014/01/20/most-scientists-dont-you-just-love-it/\nPS  I am writing this on the fly and there may be minor date errors.\n\n","date":"February 2, 2014 at 7:05 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-76062","author":"John Klotz","site":"shroudstory"},{"title":"Comment Promoted: Not so Fair or Unethical Goings On at Radiocarbon?","post":"\nAnnette Cloutier :\n\nJohn Klotz :\nAnnette,\nI don’t know how long you have been contributing to the blog, but the last few months they have caught my eye. Like Paulette, you are short and to the point. I am trying to put to bed a somewhat complex part of my manuscript which is an analogy between the La Bella Principessa and the Shroud. It covers the functions of science and skepticism when the issue is disputed provenance.\nI glad there are individuals like yourself keeping “an eye on the store.”\n</blockquote.\nMerci pour le compliment!  So John, who is this beautiful princess you are writing about… Is it Marguerite de Savoy, or Princess Clotlide or is there another?  Can you give us a thread?\nJohn, thank you for this succinct explanation as well as the one on 20th January pertaining to Leonardo’s lost portrait of La Principessa (Bianca Sforza).  I glazed over the January 20th blog because anytime I see Leonardo da Vinci in the same paragraph as the Shroud, I fade away…the whole Prince & Picknett mire we were all subjected to 5 years ago.  I’ve been redirected to give you a standing O for this insight!","date":"February 2, 2014 at 11:07 pm","url":"https://shroudstory.com/2014/02/01/comment-promoted-not-so-fair-or-unethical-goings-on-at-radiocarbon/","cat":"carbon_14_dating","id":"comment-76102","author":"Annette Cloutier","site":"shroudstory"}]
