[{"title":"Sharon Hill should check out her facts","post":"“Frankly, I’ll go along with a Fellow of the Royal Society of Chemistry (FRSC), and former editor for physical sciences at Nature, Philip Ball, who recognizes that no one has figured out how the image was formed.”\nDan: you make those letters FRSC sound as if they were as exalted as FRS (obtained only by invitation). Not so:\nMRSC (Member Royal Society of Chemistry) Awarded to graduates (or equivalent) with at least 3 years experience, who have acquired key skills through professional activity.\nFRSC (Fellow of the Royal Society of Chemistry) Fellowship may be awarded to those applicants at MRSC level with at least 5 years experience who have made an outstanding contribution to either:\n   * the advancement or application of chemical science\n    *the chemical science profession or\n    *the management or direction of an organisation in which Chemical Science is important. \nNote the last of those three: it is possible for a graduate in Chemistry with 5 years experience to become a Fellow through having a management position – without necessarily being a innovator as a bench chemist. One applies oneself to be an MRSC or FRSC – one does not wait to be invited. \nNone of this is intended to disparage Philip Ball.  For all I know he may have been Nature’s best ever Editor. I merely wish to to point out that the letters FRSC are more about having sound rather than spectacular skills as a professional chemist OR manager, and I certainly would not see those letters as implying any special or privileged insights re the provenance of the Shroud. \nIn fact one does not need to be a professional scientist to be fairly certain that the Shroud image IS a branded-on scorch from a hot template. The mere fact that it is light/dark reversed, i.e.a pseudo-negative, with no trace of a photosensitive pigment, should be sufficient to make “branding” by hot metal a reasonable, commonsensical mainstream assumption – as distinct from some tendentious proposition. \nI can see why those who continue to promote the Shroud as an unsolved mystery, and who reject the radiocarbon dating (naturally) will be keen to dismiss any idea that the Shroud is simply a branded-on image, created by actual physical contact between linen and a hot object (the latter with a temperature well in excess of the boiling point of water – or blood).\n\n","date":"March 21, 2012 at 12:56 pm","url":"https://shroudstory.com/2012/03/21/sharon-hill-should-check-out-her-facts/","cat":"carbon_14_dating","id":"comment-9492","author":"colinsberry","site":"shroudstory"},{"title":"Sharon Hill should check out her facts","post":"I didn’t make those letters sound like anything exalted or otherwise. I think this must be a British thing, Sir Berry of Ad Hom. \nDan Porter, Royal Fellow of Laughter (ROFLMAO)\n\n","date":"March 21, 2012 at 5:59 pm","url":"https://shroudstory.com/2012/03/21/sharon-hill-should-check-out-her-facts/","cat":"carbon_14_dating","id":"comment-9497","author":"Dan","site":"shroudstory"},{"title":"Sharon Hill should check out her facts","post":"So, tackling someone on the importance they appear to place on some letters after a name  – in this case membership or fellowship of a UK professional society – is now “ad hom” is it? There was nothing personal in my comment – simply a desire to put things in perspective.\n\n","date":"March 21, 2012 at 6:20 pm","url":"https://shroudstory.com/2012/03/21/sharon-hill-should-check-out-her-facts/","cat":"carbon_14_dating","id":"comment-9498","author":"colinsberry","site":"shroudstory"},{"title":"Sharon Hill should check out her facts","post":"No, no, Colin. Saying it’s a British thing is the ad hom. I’m the guilty party. I mean, after all, what can you expect from a Brit? Oops there I go again. I’m just joking with you.\n\n","date":"March 21, 2012 at 6:42 pm","url":"https://shroudstory.com/2012/03/21/sharon-hill-should-check-out-her-facts/","cat":"carbon_14_dating","id":"comment-9499","author":"Dan","site":"shroudstory"},{"title":"Sharon Hill should check out her facts","post":"“That’s sham inquiry and it’s worthless”\nMaybe. And her post, is useless. \nNote that “skeptic” on the internet, means “conspiracy theory”.\n\n","date":"March 21, 2012 at 3:09 pm","url":"https://shroudstory.com/2012/03/21/sharon-hill-should-check-out-her-facts/","cat":"carbon_14_dating","id":"comment-9495","author":"anoxie","site":"shroudstory"},{"title":"Sharon Hill should check out her facts","post":"Irregardless of the scientific findings or facts concerning the shroud…for some it will always remain simply “unbelievable”.They are like those who “still” do not believe that the world is round…despite all of the evidence contrary to.\n\n","date":"March 21, 2012 at 5:33 pm","url":"https://shroudstory.com/2012/03/21/sharon-hill-should-check-out-her-facts/","cat":"carbon_14_dating","id":"comment-9496","author":"john","site":"shroudstory"}]
