[{"title":"Common Sense for Today","post":"Thibault,\nI think I am aware of the fact for which you are awaiting final confirmation. God speed. The fact appears to be that Rogers did get a very valid sample of the part of the Shroud that was cut for the C-14 dating. This week, I will hope (and pray) that you get your final confirmation.\nJohn Klotz\nhttp:\\\\johnklotz.blogspot.com\n\n","date":"March 28, 2013 at 6:43 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28584","author":"John Klotz","site":"shroudstory"},{"title":"Common Sense for Today","post":"How come Thermochemica Acta accepted for publication a paper based on a thread or two of such dubious provenance that it is still the subject of enquiry and debated all these years later? Oops. I nearly forgot. Thermochimica Acta was “his” journal, the one that he helped launch, the one on which he served as editor for years and years, deciding which papers to accept, which to reject. \nYears later we are told it was a thread taken from the middle of the very sample that was used for radiocarbon dating – supposedly untampered with – except no one knew that at the time, except  Riggi, Gonella etc.  More to the point no one can be certain what happened to that thread or two when in the possession of its first “owner”. Was it broken and then re-spliced, and/or touched up with dye causing Rogers  to dismiss the thread, and entire sample, as a  “medieval repair patch!”. You couldn’t make it up, as they say.\nIf Thermochimica Acta knows right from wrong, it will waste no further time in disowning the Rogers’ paper without further ado. I am not the first to suggest that. \nI don’t suppose I’ll be the only one to view with interest any attempts to legitimise the covertly, indeed furtively acquired thread(s) and Rogers’ use thereof, or how his findings managed to pass the peer-review process. Pal review?\n\n","date":"March 28, 2013 at 7:20 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28589","author":"colinsberry","site":"shroudstory"},{"title":"Common Sense for Today","post":"Just reported The the International Sindonologia Centre of Turin has voiced there concerns. Outlying issue is simple. Any samples including the reserve was given out unauthorized. And my bet is, we will now have no final confirmation that John was hoping for.\n\n","date":"March 28, 2013 at 7:45 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28591","author":"Giorgio","site":"shroudstory"},{"title":"Common Sense for Today","post":"I have just heard this from Giulio Fanti. More to come shortly. Stay tuned.\n\n","date":"March 28, 2013 at 8:00 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28593","author":"Dan","site":"shroudstory"},{"title":"Common Sense for Today","post":"Thank you for the comment addressed earlier to me Giorgio. It was much appreciated, as indeed is the present one. My apologies if I was overhasty in reading your meaning and intent. \nThe ball is now well and truly in the other court it would seem, especially  as your site can apparently call on a lot of its own resources in terms of correspondence etc.\n\n","date":"March 28, 2013 at 8:01 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28594","author":"colinsberry","site":"shroudstory"},{"title":"Common Sense for Today","post":"Apparently,  Centro is confirming that samples from the reserve were given out. Otherwise, why the statement. The fact that it may not have been “unauthorized” doesn’t effect the chain of custody. Perhaps there are three people in the chain and the one at the start (?) and the one at the end (Rogers) are both deceased. That leaves the man in the middle. The problem is who had the authority to “authorize” in the first place? It would be an example of moral courage for the man (or woman) in the middle to step forward.\nCompared to the shenanigans involved in the C-14 process by the three labs who grossly violated the terms of the protocol, the issue of who had authority to release a part of the hold-back and send it across the Atlantic pales to insignificant. No one stole it. \nAnd by the way, in American courts, even “stolen” evidence may be admissible as long as the government did’t acquire it illegally.\n\n","date":"March 28, 2013 at 9:18 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28602","author":"John Klotz","site":"shroudstory"},{"title":"Common Sense for Today","post":"Validity apart, both samples were unauthorised.\n\n","date":"March 28, 2013 at 9:21 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28603","author":"Louis","site":"shroudstory"},{"title":"Common Sense for Today","post":"How would you advise this middle man if in fact Cardinal  Giovanni Saldarini did indeed requested the threads to be returned to the Centro after he learned the reserve was missing after hearing about a secret C-14 test which was to  confirm Garza-Valdes hypothesis about the organic bioplastic coating? With all do respect, I would take Sargent Shultz advise from Hogan’s Hero and plead  “I Know Nothing”\n\n","date":"March 28, 2013 at 9:50 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28605","author":"Giorgio","site":"shroudstory"},{"title":"Common Sense for Today","post":"Given that the Archbishop’s official website tells us, “Recent experimental studies (by Leoncio A. Garza-Valdes in San Antonio (Texas) and by Dmitrij A. Kouznetsov and Andrej Ivanov in Moscow) have furthermore opened the sientific debate about the tissue dating once again, with results seeming to prove a possible and considerable chemical and biological contamination of the tissue and therefore making it fundamental to start a wider research program to study and value the problem of introduction of a correction factor to the radio carbon date,” who would you trust?\nIt’s a mindset. A canonically unauthorized scientific experiment cannot produce results.\n\n","date":"March 28, 2013 at 10:36 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28609","author":"Paulette","site":"shroudstory"},{"title":"Common Sense for Today","post":"Paulette,\nMy last words are from the St. John:\n“You shall know the truth and the truth shall set you free”\n\n","date":"March 28, 2013 at 11:55 am","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28618","author":"John Klotz","site":"shroudstory"},{"title":"Common Sense for Today","post":"The only truth regarding that part of the Gospel is that God is Love and Mercy and that, because of this, we are now free from the bundage of sin !\n\n","date":"March 28, 2013 at 1:04 pm","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28624","author":"Yannick Clément","site":"shroudstory"},{"title":"Common Sense for Today","post":"One more word concerning Fanti’s claims contained in his new book :  it’s one thing to get valid and representative samples of the Shroud (and so far, this is far from being proven that his samples were truly valid and representative), but it’s another thing (a very crucial one!) to make good science out of it!!!  And concerning this last aspect of the question, let me remind you that any good scientists would never publish the results of a potentially important research like that in a book first but in a peer-reviewed scientific journal…  What credibility can Fanti obtained from the scientific community with the publication of his research in a popular book?  None!  How can we be certain if Fanti did good science or not?  How can we be certain if Fanti followed the scientific method properly?  Note that in my mind, the simple fact that he used some highly questionable samples that were removed from the Shroud so many years ago and then claim he can prove things about the Shroud on the basis of those samples is already an important break into the good scientific method.  \nThat speak very loud to me.  In the summary of his book, Fanti did use the word “proof” and that’s a shame for someone who claim to be a real scientist.  The truth is this :  Fanti will never be able to prove anything regarding the Shroud on the sole basis of these highly questionable samples.  As I said before, to prove anything about the Shroud, the only way will be new direct testing done on the cloth by a credible, professional and honest scientific team.\nThis kind of acting remind me a great deal of Ian Wilson and some others persons from the pro-Shroud world and are surely not what we can call the “correct procedure” to follow if seeking the truth by following carefully the scientific method is your first and principal motivation.\n\n","date":"March 28, 2013 at 3:52 pm","url":"https://shroudstory.com/2013/03/28/common-sense-for-today/","cat":"carbon_14_dating","id":"comment-28642","author":"Yannick Clément","site":"shroudstory"}]
