[{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"Why ask for a new test whereas we don’t know for sure what could have gone wrong in the first one ?\n Step one is to get the data of the 1988 dating.\n\n","date":"November 14, 2012 at 3:43 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19048","author":"anoxie","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"Colin Berry’s call for a new C14 test is a tacit admission that the 1988 dating was wrong. We have such an abundance of evidence that the Shroud existed many centuries before the “mediaeval … AD 1260-1390” C14 date, that if the Shroud was redated and it still came out medieval it would only confirm that there was something fundamentally wrong with dating ancient burial shrouds in general and a Shroud whose former occupant, Jesus, was resurrected in particular. \nBecause even if the Shroud is authentic, it is likely that a new C14 dating would yield a date somewhere between AD30 and 1350, due to the combined factors of younger carbon having become an integral part of the fabric and therefore unable to be removed by pretreatment, and radiation emitted as a byproduct of Jesus’ resurrection when His body changed state (1Cor 15:50-52; Php 3:21), a new C14 dating would probably satisfy no one. Pro-authenticists would point to how close the date was to the 1st century and anti-authenticists would point to how close the date was to the 14th century!\nAnd from the Vatican’s perspective what would be in it for them? Have their priceless relic further “cut up” (to use Colin’s term for his excuse why no museum would supply a postage stamp sized sample of medieval 3:1 herringbone twill visually identical to the Shroud as a control in the 1988 dating) and then endure decades of controversy in its aftermath, not to mention in its planning. As cardinals and bishops they no doubt already have a very busy day job: administering a church, than to spend it pandering to the whims of scientific types who blew their first attempt at C14 dating in 1988 and now wanted another one. Remember that the current Pope Benedict XVI, as Cardinal Ratzinger, was Chair of the Pontifical Academy of Science over the time of the 1988 C14 dating, and so he has an unparalleled understanding of the issues.\nAs a Christian who believes in the Shroud’s authenticity and the Biblical teaching on the sovereignty of God, I believe that the 1988 C14 dating fiasco was no accident. Quite clearly if the Shroud is authentic (as the preponderance of the evidence overwhelmingly points to); and God wanted the 1988 C14 dating to come out as 1st century AD to accurately reflect that fact; which to many, if not most, uncommitted people would prove that Jesus did really exist and really was crowned with thorns, flogged, crucified, died, was entombed and resurrected, as the Gospels attest; then God could have made sure that no human incompetence, prejudice or schemes would have prevented that happening.\nBut as Pascal in the 17th century observed, God seems to have arranged it so that (paraphrased): 1) there is enough evidence for a Christian to have reasonable grounds for his/her faith; and 2) for a non-Christian to have no excuse for his/her unbelief; but 3) there is not enough evidence to force a non-Christian to believe in Christ against his/her will.\nStephen E. Jones\n\n","date":"November 15, 2012 at 3:53 am","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19054","author":"Stephen E. Jones","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"I think I read the first book published (1976?)  on the shroud. With my limited understanding of science ( I majored in physics, math, and chemistry), I can’t image any human being is capable of producing an image that has the characteristics of the shroud – not then nor now.\n\n","date":"November 15, 2012 at 5:57 am","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19060","author":"Senior110","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"Collin’s attitude seems to be a constant in Shroud “studies”. He doesn’t he provide a comprehensive way for free and open scrutinization of his own results but at the same time, suggests new tests with material to be released by others (in this case the Catholic Church). Sad to say, but this is a constant with anyone owing any physical evidence: HR image, fibers, whatever…..We have also recently learned that the raw figures of the C14 tests have been released to the authors of a documentary. Will they release those figures for open and free discussion? Surely not. Perhaps at some moments, they were too naive BUT being a Catholic myself, I fully support (even more, I am proud of) the Church’s current position at this point of not contributing to add confussion, discussions on media and improve the professional careers of Shroud stars selling the same over and over throughout the years.\n\n","date":"November 15, 2012 at 7:06 am","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19064","author":"Gabriel","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"Gabriel, you have hit the nail on the head when you mention the Church’s current position. The remedy is to begin a lot of rethinking, and, as commented earlier, Benedict XVI’s position was voiced by Bishop Kevin Vann at the last Dallas Conference. Since it has fallen on deaf ears the Church continues to remain silent.\n\n","date":"November 15, 2012 at 8:52 am","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19067","author":"Louis","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"SJ:  “…  then God could have made sure that no human incompetence, prejudice or schemes would have prevented that happening.”\nDB:  God does not operate that way!  The result demonstrated the fallibility and lack of humility of human science amd those nvolved! \nSJ:  “(Pascal paraphrased): 1) there is enough evidence for a Christian to have reasonable grounds for his/her faith; and 2) for a non-Christian to have no excuse for his/her unbelief; but 3) there is not enough evidence to force a non-Christian to believe in Christ against his/her will.”\nDB:  God does not compel belief; He invites belief!  If God compelled belief, then there could be no forgiveness for unbelief.  But it is in God’s nature to forgive.\n\n","date":"November 15, 2012 at 3:15 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19080","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"The Shroud has already been completely contaminated.  This is more of a pipe dream than anything.\n\n","date":"November 15, 2012 at 9:28 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19091","author":"Andy Weiss","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"In my idea the words that you wrote were a bit exaggerated :\n>The Shroud has already been completely contaminated.  This is more of a pipe dream than anything.\nThe Shroud was contaminated (from the Fire of 1531, etc.), but in my opinion, your intervention (without the exact explanations) seems to be an excessive claim …  Sorry.\nBut, in any case, I think we can try to see what will be the result from the SPM controls on some linen samples taken from the Shroud in the past. This is a work without the useless destructions of the 14C tests.\nI believe that using the AFM techniques we can see what is the exact level of contamination in different areas or on linen fibrils (under the adequate non destructive controls), but this is not the main problem to solve.\nWhy the SPM controls were not possible in the year 2002 ?\nWhy the results from the Raman controls of the year 2002 are still unknown ?\n… and now :\nWhat is your reply ?\n— —\nWe cannot destroy the Shroud with the wrong analytical methods !\nIn my opinion the SPM controls are the possible solution against the destructive systems.\nDo you know the different SPM ways to control the lignocellulosic materials ?\nI believe we have to discuss this argument instead to indicate the wrong analyses.\nAm I wrong ?\n\n","date":"November 16, 2012 at 11:38 am","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19120","author":"Piero Iacazio","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"I am not referring to the contamination from the fires (there were at least two in 1531 & 1998).  I am referring to the encasement of the Shroud with thymol which, according to Chemist Ray Rogers has completely contaminated the Shroud.  \nHas this chemically not completely contaminated the Shroud?  We need a world class chemist and Ray Rogers has unfortunately passed on.  Know any world class chemists?  Until I hear from one contradicting the veracity, Ray’s chemistry is beyond reproach.\n\n","date":"November 17, 2012 at 1:44 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19154","author":"Andy Weiss","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"Dear Andy Weiss,\nFirst of all (if I am right): the fire of the year 1998 has not burnt the Holy Shroud !\n— —\nI am a technician dyer and not “a world class chemist” (in order to speak with great authority on this argument). But, if you have read my previous words about the IGC (Inverse Gas Chromatography) in other area of this Blog (try to search), you can understand that we can try to do something also about the (presumed) thymol contamination.\nDo you understand the meaning of that claim ?\nHere my explanation : we can try to show what happens using the different percentages of thymol on linen samples prepared for the IGC controls = experiments about the exact level of contamination (now I have not the exact Hansen parameters [= HSP] about the different areas of the ancient linen sheet and the HSP for Thymol, but I believe these data as interesting in order to do the inherent calculations.\nB.T.W . : Do you know the cohesive energy, the Hansen Theory and the Hildebrandt Theory ? Sorry…).\nObviously we cannot use that particular way (= the IGC) on the Holy Shroud !!!\nSo …\nIn order to detect the traces (of thymol) on linen fibrils we can use the adequate SPM controls. For example : the CFM (= Chemical Force Microscopy).\nWhat is your opinion ?\nIs it feasible that non-destructive control ?\n— —\nIn my idea we can compare (in that manner) the linen fibrils taken from the Shroud before (the Thymol treatment) with the other new fibrils. This scientific work requires a good Plan (and, obviously, we cannot work only to detect the level of that presumed thymol contamination ! We have to prepare the adequate set of experiments …).\nIn any case, the thymol contamination is not the main problem in order to know the true epoch for the Shroud.\nDo you agree with me on that statement ?\n— —\nI want to add that, perhaps, we can try to do some\ncalculation about the “Vanillin loss from Lignin”\nalso using the HSP (and the three parameters or contributions are the following :\n– dispersive\n– polar\n– Hydrogen bonding … ).\nWhat is your comment on that particular idea ?\n— —\nHave you found an exact opinion (apart Ray Rogers)\nabout the temperature, the time and the Vanillin loss ?\nI remember this question as a troubling argument …\n— —\nI am curious about the effect from the Corona Discharge\n(see : Fanti and the inherent experiments) on Vanillin loss. But this is another particular question (perhaps there are very little areas of the sheet involved)…\n\n","date":"November 19, 2012 at 12:00 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19205","author":"Piero Iacazio","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"Ray Rogers’ work in the 2005 Thermochimica Acta paper did provide us with an alternate way to date the Shroud: by the amount of vanillian left.  Read the paper and decide for yourself if it is a valid way to date the Shroud – http://shroudnm.com/docs/2004-09-12-Rogers.pdf.\n\n","date":"November 17, 2012 at 1:48 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19155","author":"Andy Weiss","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"And many data coming from the Shroud strongly suggest that it is an ancient cloth that has been woven prior to the 8th century because of the technique that was used to manufactured the cloth.  Others data also strongly suggest that this cloth has been woven by a Jewish artisan.  I don’t have any doubt at all concerning the Antiquity of this cloth, which can only mean one thing: the C14 dating of 88 is completely off-track.\n\n","date":"November 17, 2012 at 5:14 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19162","author":"Yannick Clément","site":"shroudstory"},{"title":"Berry: No matter where he or she considers themselves to be on the scale of infallibility","post":"I agree about the Antiquity for the linen cloth, but we have to prove that idea (for the original ancient time) around the Shroud using the adequate SPM techniques.\nWhere is the new demonstration for that important relic ?\nWhat is your opinion about the different kind of SPM ways ?\nIs it feasible the AFM control on cellulosic chains or not ?\n— —\nIn my idea the SPM techniques are the useful way to obtain something (instead to speak in vain !).\nBut (if we want to do an exact and  great job) we have to take into account the mechanical stresses and the fungal attacks on that ancient linen (see also the wrong areas [involved in the Fire of the year 1531] to avoid. These surfaces have to be disregarded from the point of view of the SPM controls. Am I wrong in this remark about the accuracy of the future work ?).\n\n","date":"November 19, 2012 at 12:26 pm","url":"https://shroudstory.com/2012/11/14/berry-no-matter-where-he-or-she-considers-themselves-to-be-on-the-scale-of-infallibility/","cat":"carbon_14_dating","id":"comment-19206","author":"Piero Iacazio","site":"shroudstory"}]
