[{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"Henrietta Lacks and ASM carbon dating\nIt may seem stretch but there is a connnection between the saga of Hnerietta Lacks and ASM carbon testing. It’s simply this: greed.\nA had a conversation with someone well versed in the Shrouod from way back. I spoke with him about trying to get the three labs to open up on their samples to see if they have a relationship to Ray Rogers findings. He said it would never happen because ASM carbon testing is now a billion dollar industry and the labs could never admit hey were wrong becasue the financial reprucussions would be horrendous. I immediately thought of Henrietta Lacks. \nHere’s why.\nHenrietta Lacks was a poor black woman from Baltimore who died of cancer several decades ago. The Hospital preserved some of her stem cells and they were replicated and became the source of a billions of dollars industry. Her stem cells have built sky scrappers.\nWhat did the estate of Henrietta Lacks get out of this: na da, nothing. \nThe C-14 testing of the Shroud was an entirely different procedure and industry. Howver, we are being naive (as I was) in thinking the labs would ever take any steps to jeopardize the validity of their most famous case – the Shroud of Turin. There is too much money at stake. \nI am reminded in the story in the Gospel where Christ cured a women of possession but that the demons then went out an possessed a heard of swine which became enraged and stampeded over a cliff. The  pig herders then drove Christ away. Salvation could wait, the money mattered more.\nI think that enormous progress has been made but the C-14 tests have not yet made it to the dust bin of history. You can not serve God and Mamon. The scientists who stand-by the C-14 testing knowing it was flawed, have made a choice. So did the scientists who exploiited Henrietta Lacks’ stem cells and never paid her heirs a dime.\n\n","date":"May 9, 2013 at 6:13 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33314","author":"John Klotz","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"Well now, although never having worked with HeLa cells myself, I know several folk who have. They would be mighty surprised to learn they had been part of a mean plot to deprive a lady’s family of some presumed right to biotechnology royalty payments, given the gradualist way in which the cells came to dominate cell biology – by virtue of their sheer staying power on petri dishes. Here’s what wiki has to say about the attempts by lawyers to wring retrospective cash out of science researchers. It places a rather different slant than the one we see above – and shows that no liberties were taken, and, more importantly, that no laws were broken.\n“The (HeLa) cells were propagated by George Otto Gey shortly before Henrietta  Lacks died of her cancer in 1951. This was the first human cell line to prove successful in vitro, which was a scientific achievement with profound future benefit to medical research. Gey freely donated both the cells and the tools and processes his lab developed to any scientist requesting them, simply for the benefit of science. Neither Lacks nor her family gave Lacks’s physician permission to harvest the cells, but, at that time, permission was neither required nor customarily sought.The cells were later commercialized, although never patented in their original form. Then, as now, there was no requirement to inform a patient, or their relatives, about such matters because discarded material, or material obtained during surgery, diagnosis, or therapy, was the property of the physician and/or medical institution (currently this requires ethical approval and patient consent, at least in the UK). This issue and Mrs.Lacks’s situation was brought up in the Supreme Court of California case of Moore v. Regents of the University of California. The court ruled that a person’s discarded tissue and cells are not their property and can be commercialized.”\n\n","date":"May 9, 2013 at 6:48 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33317","author":"colinsberry","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"Regarding the C14 test, in this blog we customarily read comments reflecting in the best case, opinions about the lack of true professional and competent behaviour on the side of the three labs. In other cases, they are openly accused of conscient manipulation and falsification of the whole process.\nI certainly do not share this view and most particularly since last year when two independent research works(1) and (2) have identified (or better said confirmed previous guesses) through different and independent ways the presence of a slope in the sample.\nIf in an UV-F photograph, which was taken by Vernon D. Miller of the Brooks Institute of Photography in Santa Clara, California in 1978, a trend can be detected and then, 34 years later combining data provided by the labs a similar trend is also detected, for me it is quite clear that the labs -beyond perhaps some minor mistakes- did a good job. \nI would love to hear an alternative explanation of how can it be explained that two different techniques (PCA+statistical techniques, C14 counting) applied to two different research items (image , cloth sample) with a lapse of 34 years, detect the same (a trend). \nThe conclusion is that whatever the driving mechanism behind the slope is ( I would say it is simply different degrees of organic contamination due to different intensity of manipulation along the centuries), the point is that the sample cleaning and preparation process was not effective and in spite of it, the trend was still there when the labs started to count C14 atoms\nIt is exactly the same type of objections against C14 test that the scientific literature along these years has been showing: the process of sample cleaning and organic contamination removal is virtually impossible with some objects (like the Shroud). Even more in 1988.\nThe few comments I have read on the trend, tend to interpretate it as an additional argument against the professionality of the laboratories and as another sign of the big mess the whole radiocarbon test was.\nDan asks: Will we ever know what really happened?. Let’s start by analyzing all the facts available. That includes the trend. However, in my view, this issue has been largely ignored so far. A plausible explanation is needed on the presence of this trend. I have given mine but I am open to further discussion, different perspectives and even accepting more solid explanations on this subject.  Closing our eyes to the fact will not help the least if we want to understand:\ni) the role that the C14 test played in 1988\nii) its appropiateness for future dating of the Shroud.\n(1)Digital image processing techniques demonstrating the\nanomalous nature of the radiocarbon dating sample\narea of the Shroud of Turin. Morgan. 2012.http://www.academicjournals.org/SRE\n(2)Regression analysis with partially labelled regressors: carbon\ndating of the Shroud of Turin\nMarco Riani · Anthony C. Atkinson · Giulio Fanti ·Fabio Crosilla\n\n","date":"May 9, 2013 at 8:43 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33321","author":"Gabriel","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"Don’t you think you are making too much of your claimed “trend”, at least in terms of simple probability and statistics?\nSuppose you have 3 random numbers, let’s say 5, 11 and 16.\nWhich ways can you arrange them either to get a trend, or not to get a trend?\nTo get a trend:  Either 5,11,16 (positive) or 16,11,5 (negative)\nTo not get a trend: \n5,16,11 or 11, 5,16 or 11,16, 5 or 16, 5,11  \nIn other words there are 6 permutations, two of which show trends, and 4 of which don’t. \nSo the probability of getting a trend is 2 in 6  or 1 in 3,  i.e.0.33. Compare that with conventional confidence limits in statistics. If you want to be reasonably certain that an effect did not arise purely by chance you choose a 95% confidence limit, at which the probability that the result arose purely by chance, i.e. random sampling error, is a mere 0.05. \nThere’s a bit of a difference between a probability of a trend arising by chance being a sizeable 0.33 as compared with a mere 0.05 would you not agree?  There’s a more than 6-fold difference between those two values!\nSorry, good try but no cigar. A claim for a statistically-significant trend based on just 3 values has to be considered near worthless in probability terms.\n\n","date":"May 9, 2013 at 9:36 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33328","author":"colinsberry","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"Colin, if you have a look at the full paper (published in a peer-reviewed journal belonging to the JCR) you will see that the results are statistically robust and not based on “just 3 values” as you mention.\nMarco Riani · Anthony C. Atkinson · Giulio Fanti ·Fabio Crosilla.Regression analysis with partially labelled regressors: carbon dating of the Shroud of Turin. Sta. Comput. DOI: 10.10007/s11222-012-9329-5 2012.\n\n","date":"May 9, 2013 at 9:47 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33330","author":"Gabriel","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"To expand the number above 3 – the number of adjacent specimens – there would have to be data for serial slices within each of the 3 samples. While that is probable if, say, duplicates are recorded separately on a long axis, I’m willing to bet that the trend analysis is ‘softer’ than the one I did above. If you have 6 numbers, say, they don’t need to be in strict ascending or descending order to get a trend line with a high value of r, despite some scatter. So any extra precision from doubling or even trebling the number of points is probably more than offset by the less-demanding trend analysis based on, say, a  least squares regression or similar. \nAt the end of the day, it s simply a small rectangle of linen, divided between 3 labs – hardly a lot of scope for serious statistical analysis there … And one can hardly assume that any micro-trend seen within that rectangle, real or fluke, is then continued down the entire length of the cloth, can one, not without samples from the middle and far end to back that up?\n\n","date":"May 9, 2013 at 10:06 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33332","author":"colinsberry","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"Various people have taken all 12 of the dates from individual snippets of cloth and attempted to demonstrate that there is a continuous sequence from the top right to the bottom left of the carbon dating strip. Fanti’s new book contains a very clear diagram of it, and various graphs have been drawn of the radiocarbon ages against horizontal distance along the sample. This would be very interesting and probably significant, if true. Unfortunately, without accurate data as to exactly where the dates came from, this evidence is not really strong enough to support the hypothesis.\n\n","date":"May 9, 2013 at 2:19 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33346","author":"Hugh Farey","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"I would concur with Hugh’s comment. There may be a trend, but the data sources are unreliable, at variance, and reflect Dan’s original posting above on the unreliabilty and variation in the various reports and tables presented. If there is a trend, it is probably a localised one as contamination would vary randomly across the whole of the cloth. \nThe debate above on the alleged trend tends to mask Gabriel’s primary comment: “It is exactly the same type of objections against C14 test that the scientific literature along these years has been showing: the process of sample cleaning and organic contamination removal is virtually impossible with some objects (like the Shroud). Even more in 1988.”\nWhether Marvin Rowe’s electrically charged gas oxidation NDT method on the whole object would have the potential to yield a more reliable result is a moot point, as contamination would still be present..\n\n","date":"May 9, 2013 at 4:36 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33355","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"Disclaimer: This post in no way is intended to disparage anyone, nor do I have anyone in mind.  It is written about the 1988 testing and the Shroud with its implications as I see them.\n~ Andy\n————–\nSince the carbon dating of 1988 has been shown in several ways to fail to represent the date of the Shroud and since they abandoned their protocols, I don’t see the point of continuing to discuss this unreliable dating.  It is essentially meaningless and has no bearing on the Shroud.  \nConsidering the abandoning of the scientific protocols, it would seem logical it was done purposefully for whatever reason, most likely to cast doubt on the Shroud and to try to influence many to disregard it altogether as a hoax despite the fact that 99% of the evidence points to its authenticity and evidence to the contrary is minimal, at best.  The test itself is unreliable and when the other evidence contradicts a carbon dating of just about any artifact, the carbon dating is always set aside, except with regard to the Shroud.  \nThis is not surprising considering the controversy it naturally engenders.  After all, it is a relic of not only history, science, art, etc., but also of religion.  That last category makes many squirm because it requires something of the one who faces it.  If it is truly the burial cloth of Jesus Christ, then one is responsible for what one does with that information.  Suppressing it is much easier than admitting the possibility and facing it and its implications.  Yet I have always found honesty with myself and whatever I face is the best policy for me to take.\n\n","date":"May 9, 2013 at 6:55 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33364","author":"Andy Weiss","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"There are still a lot of people who believe the 1988 tests prove the Shroud to be a fake.  Perhaps most of those people won’t change their minds because they’re happy for the Shroud not to be real.  But some people might change their minds if they’re informed of all the pertinent facts.  If nothing else but for the sake of those people, I think it’s worth discussing why the dating was unreliable.\nGian Marco Rinaldi has posted some information from the Italian documentary “Night of the Shroud.”  Below is some information I put together that also includes data from that documentary:\nWe all know that Michael Tite, the overseer from the British Museum for the 1988 dating, took over for Teddy Hall when he retired and after some anonymous businessmen donated 1 million pounds to Oxford for ostensibly having proven the Shroud a fake.  If nothing else, it just looks shady.\nI’ve discovered some other relationships that also appear to be alarming along with many indications of political maneuvering.  The Italian Documentary “The Night of the Shroud” made the following observations:\n*On January 4, 1984, Teddy Hall wrote a letter to a member of the Academy, Prof. Porter to encourage the Vatican to allow C-14 testing.  A copy of the letter was sent to the President of the Academy, Carlos Chagas and also to the Vatican.  But the copy to the Vatican only contained the 1st page, which criticized STURP, but without saying why.\n*Chagas later wrote Cardinal Ballestrero that everything was going fine but then turned around and wrote the Vatican saying there were problems with Ballestrero.\n*In 1985, Harry Gove produced at the Trondheim C-14 conference a suggested protocol for the Shroud C-14 dating.  Chagas let only another Academy member, NASA scientist Victor Canuto, to review the protocol.\n*One person in the documentary said that Gove had Chagas in his pocket.\n*In July 1985, after STURP submitted their test proposal, Chagas again had Canuto review it.  Chagas reported as his own Canuto’s report, which criticized STURP’s proposal to do a C-14 in conjunction with 25 other tests.\n*On July 13, 1985 Cardinal Ratzinger approved for a 2nd time STURP’s 26 test proposal.\n*On July 22, 1985, Harry Gove met with Victor Canuto.\n*During the Turin workshop meeting in September 1986, Chagas asked Canuto to come up with a summary of proposals.  According to William Meacham, the text did not reflect what everyone had agreed upon.  Luigi Gonella, Cardinal Ballestrero’s advisor, requested corrections be made but that wasn’t done.  The text was not signed by anyone but was presented by Chagas as the agreement with Church authorities.\n*Cardinal Ballestrero wrote a letter to the Vatican Secretariat of State regarding the strange behavior of Chagas.\n*On May 21, 1987, the Secretariat of State said that there would be 3 labs, 3 samples and 1 sample site.\n*On October 10, 1987, Cardinal Ballestrero made an official announcement regarding the number of labs and samples.\n*Gove, upset at not being 1 of the 3 labs, contacted the Papal Nuncio, American Senators and the Ambassador to the Vatican, but to no avail.\n*The 3 chosen labs all wrote letters to the authorities that were the exact wording of the letter that Gove had sent to the Nuncio, Senators & Vatican Ambassador.  The letter from the Zurich lab was postmarked in Rochester, where Gove lived.\n*The Secretariat of State informed Cardinal Ballestrero that only the C-14 test should be done.\n*Only Cardinal Ballestrero and Michael Tite put the samples in the containers for the labs.  (Although there was something like 22 hours of videotape, the putting of the samples into the containers was the only part of the procedures that wasn’t filmed.)\n*About 2 weeks after the dating, Chagas was removed as President of the Academy.  (I learned from another source that the announcement was made by a Msgr Renato Dardozzo, who will come up again shortly.)\n*The late Professor Jerome LeJeune, a member of the Academy, publicly stated that further analysis of the C-14 results needed to be made.\nThis next part does not come from the Italian documentary.  I discovered that Msgr. Renato Dardozzo was the Chancellor of the Academy (i.e, Chagas’ right-hand man).  According to June 3, 2009 article in “The Guardian” (UK) (http://www.guardian.co.uk/commentisfree/belief/2009/jun/03/vatican-central-bank) Dardozzo smuggled out more than 4,000 documents pertaining to the scandal-racked Vatican Bank.  The article says, “It is interesting to note that Dardozzi’s motive for turning whistleblower was not unalloyed disapproval of the IOR’s unethical conduct.  His decision to smuggle his secret archive out of the Vatican was motivated, at least in part, by anger at the Institute’s refusal to pay him a commission on the sale of a valuable real estate property near Florence.  The unusual monsignor wanted to leave the money to his adoptive daughter, who health condition required expensive treatment.”\nSo, we have a financially-needy monsignor, who was the right-hand man to Chagas, alleged to be in Harry Gove’s pocket.  If there was a million dollar pound donation available for the Oxford lab for ostensibly having proven the Shroud to be a fake, were there additional “donations” to pass around to key authorities to make sure that certain actions would take place for the C-14 dating of the Shroud?  While there’s no hard proof, it once again looks suspicious.\nI know an ex-NASA scientist who knows Victor Canuto.  The scientist asked Canuto for the story about the C-14 dating–but Canuto wouldn’t tell him a thing.\nWith all of the above circumstances, the last thing that should be done is to blindly accept the results of the 1988 dating.\n\n","date":"May 9, 2013 at 9:45 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33373","author":"jmarino240","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"Thanks for that in-depth look, Joe.  Interesting.\n\n","date":"May 10, 2013 at 12:37 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33417","author":"Andy Weiss","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"The previous comments by Colin, Hugh and Daveb on the trend reflect how unconfortable people with different views on the authenticity (as I think, Colin, Hugh and Daveb represent) feel about the trend.\nHowever, the point is that we have a peer-reviewed paper published in a JCR journal with a good ranking at the same level of the works published by Rogers, Adler etc.\nAs any other work it can be a matter of discussion (of course), but after such a paper, the subject cannot be dealt with by just using some general comments to rule the trend subject out, as we have read here.\nAt this point, casting doubt on the presence of the trend, means opening a very in detail discussion on the statistical aspects that have made the authors of the paper reach their conclussion (and also convince reviewers that they are not wrong).\nI am ready to accept possible shortcomings or flaws in this work by Marco Riani et al. but only after an in -depth discussion of the major aspects we can read in the paper.\nOtherwise, if I have to compare impressions or general feelings against a peer-reviewed paper that I have thoroughly read and seems to me correct, my choice is clear.\n\n","date":"May 10, 2013 at 2:35 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33387","author":"Gabriel","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"“Peer-reviewed” is not the be-all-and-end-all, especially when specialist journals receive a Shroud-focused paper, and when it is packed with specialist detail. It can all seem intimidating from more than one point of view. \nI’m not a statistician, so am also easily intimidated by lashings of statistical detail regarding significance testing, lines of best fit, trend analysis etc. But I do have the ability to stand back and ask a few commonsense questions, like: “Why is all this statistical firepower being concentrated on data from one small sample from the corner of the Shroud that has been divided into three?” Is there not a reasonable inference that the aim was from the word go to nitpick, and do so at a level that would scare off most folk?  \nYes, it has to be said, yet again, that so much of what passes for science in Shroudology is compromised by the unwillingness of the authors to make clear at the outset why they have set out to do the things they have, and to offer some kind of reassurance that their studies are not motivated more by religious than scientific considerations. \nIt must be very difficult for a journal editor, faced with these kinds of misgivings about motives, with severe reservations re scientific objectivity, to say NO to a group of specialists  presenting pro-authenticity evidence. The plain fact is that most mainstream scientists would probably find themselves out-of-their-depth when confronted out-of-the-blue with such determined individuals whose science if the truth be told is agenda-driven. But who is prepared to be open in their covering letter, and admit that their science (or dare one say, data processing) is agenda-driven?\n\n","date":"May 10, 2013 at 3:12 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33389","author":"colinsberry","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"PS: Of course, “Statistics and Computing” is a specialist journal that will not be taken in by dud statistics.On the other hand, the statistical fire power was provided by Profs C, Atkinson and Riani of the LSE. I seem to recall reading somewhere that they offer their services to outsiders on a consultancy basis, so while they can still be scrupulously objective in their analysis and recommendations, one is entitled to speculate on whether their relationship with Prof. Giulio Fanti etc had involved some kind of pecuniary element too. It is not a topic I intend to research further – I’m just flagging up that modern research is not always as disinterested as some starry-eyed folk might imagine.\n\n","date":"May 10, 2013 at 4:04 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33390","author":"colinsberry","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"The relevance of the trend is that the C14 test preprocessing of samples was unable to remove the effect that it represents (most probably biocontamination)  thus revealing that radiocarbon testing is just not appropiate\n\n","date":"May 10, 2013 at 2:47 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33388","author":"Gabriel","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"PPS: have just taken another look at that trend paper, having last given it a quick once over some months ago (as I say, I’m no glutton for punishment where statistics are concerned). I’d forgotten that the authors did not even know the distribution of data points within each of the samples sent to the 3 labs!  They freely admit that in their Abstract:\nAbstract\nThe twelve results from the 1988 radio carbon dating of the Shroud of Turin show surprising heterogeneity. We try to explain this lack of homogeneity by regression on spatial coordinates. However, although the locations of the samples sent to the three laboratories involved are known, the locations of the 12 subsamples within these samples are not. We consider all 387,072 plausible spatial allocations and analyse the resulting distributions of statistics. Plots of robust regression residuals from the forward search indicate that some sets of allocations are implausible. We establish the existence of a trend in the results and suggest how better experimental design would have enabled stronger conclusions to have been drawn from this multi-centre experiment. \nSome might think it heroic to replace ignorance of location with a vast model-building exercise that involves 387,072 permutations. To me, it looks like folk who set out with a smell of rodent presence in their nostrils, and were prepared to move statistical heaven and earth to find evidence to back their hunch – which involved signing up a consultant statistician at LSE – an emeritus Professor no less, handy for one’s work published in a specialist stats journal (peer reviewed!!!!).\nSorry, but I’m not impressed with this kind of “science”, and note anyway that none of the authors are scientists anyway.The prime mover in that trend paper was presumably Prof. G. Fanti, who we know is a mechanical engineer. Engineering is goal-directed. A lot of scientists – myself included – spend their entire careers trying to avoid or escape goal-directed research.\n\n","date":"May 10, 2013 at 4:41 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33391","author":"colinsberry","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"Colin, honestly, I think that addressing your difficulties on this paper as a combination of first impressions on the abstract and personal attacks on the authors is not a scientific approach.\n\n","date":"May 10, 2013 at 8:56 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33403","author":"Gabriel","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"And I don’t consider that comment to be blog-friendly either. What’s a blog for if not as a forum for honest expressions of opinion?\nYou can accept or reject the views of this retired scientist, but kindly spare me your lectures on what is or is not “a scientific approach”. Repeat: I am here to express individual views, influenced by a lifetime in science. I am not here to serve as anyone’s perceived role model for the Compleat Scientist.\n\n","date":"May 10, 2013 at 9:08 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33406","author":"colinsberry","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"PS: You will of course be reproaching Joe Marino on Dan’s latest blog for questioning the personal integrity and/or scientific objectivity of those involved in the 1988 dating, won’t you? \nhttps://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/\nOr will there be the usual nods of assent (or deafening silence) we are accustomed to here when someone or other cries “fix” in connection with those results?\nOh, and you will belatedly reproach Prof Fanti, won’t you, for tacking theology sections on the end of his conference presentations (RC theology, needless to say). Hardly in keeping with the “scientific approach”, what? But of course, one’s not supposed to refer to Fanti’s transparent lack of scientific objectivity that runs through the entire canon of his published work. It is not the “scientific approach”, is it, to comment on the clear departures from a scientific approach when it’s the anti-radiocarbon, pro-authenticity line that is being pushed..?\n\n","date":"May 10, 2013 at 9:55 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33411","author":"colinsberry","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"Having spent some 40+ years in a civil engineering career, I wouldn’t be so dismissive of some engineers’ ability to carry out excellent research projects, essentially science based, material science, crystallography in metals, hydraulics/fluid mechanics, resonance, electronics, engineering math and so on. I’ve also seen some carry out research which I felt was just a bit shonky. I could say the same about some scientists I’ve met. Engineering is fundamentally about problem solving, at its most mundane seeks to be utilitarian, but there’s also some excellent pure research as well. \nOn this occasion however, I tend to concur with Colin’s view on this curve fitting attempt, and am most uncomfortable with the approach adopted. Attempting to get the data to fit the case merely because the data lacks proper integrity and factual provenance is a back-to-front way of doing things and can only be described as a fudge!\n\n","date":"May 10, 2013 at 6:33 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33397","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"slightly off topic but….\nHad lunch with an atheist friend today, he put forward an interesting argument against the resurrection which I hadn’t heard before, thought it was one of the better atheistic explanations, it goes something like this…\nJesus was a highly charismatic first century social / religious revolutionary. His message and the way he sold his message was highly compelling. Most of his audience were the downtrodden, who gained hope in his message given the power of the elite jews and the romans.\nWhen Jesus died, Jesus’s follower were deeply saddened, and they did experience a feeling that Jesus’s spirit lived on, as could his message. By perpetuating Jesus’s social messages, a new movement could rise up to help give the downtrodden hope and indeed better lives.\nTo help build such an essentially political movement. the closest followers build myth around Jesus’s life and teachings, so the bible is 50% real, 50% myth. Most centrally, the myth of the resurrection was created to build belief and support in the movement amongst the masses of downtrodden.\nThe myth building gained momentum after the destruction of the temple, and that’s why the gospels build mythology over and above Paul’s earlier writings.\nJesus’s early followers were willing to risk their lives by mythologising Jesus’s message, because there was much to gain for the downtrodden in building this new movement. Jesus’s followers didn’t have to have witnessed a real, literal, bodily resurrection to risk their lives, rather the strength and hope of a new socio-religious movement was enough for them to take the risk\n\n","date":"May 10, 2013 at 8:28 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33399","author":"Matthias","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"2Matthias\nThis is not a novel approach jys a resurrection of the old atheist’s myths circulating years ago.\nThe problem with this approach is it a fairy tale which is not based on any facts( if we take the facts as a description of events in Gospels). This thesis of conscious creation of myth of resurrection is contradicted by behaviour of everybody who came to the tomb on Sunday morning and everybody, who encountered resurrected Jesus later – neither of the men and women expected to see Jesus, everybody was sure he is dead and were looking for the body.\nThis obvious psychological conflict, described in all Gospels contradicts the atheist assumption of nice and fuzzy premeditated story inventing.\n\n","date":"May 10, 2013 at 9:54 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33410","author":"jesterof","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"The myth of the “invented myth” is one that comfort atheists. It might be seen as a more honest approach than the versions promoted by Kung and Borg. \nEvangelists encultured in the 1st century wouldn’t invent a story that it was women who first discovered the empty tomb, nor who first encountered the risen Lord. Nor would they seek to embarrass the leaders of the movement by inventing mischievous storied about them such as telling of Peter having to jump into the water to conceal his nakedness when Jesus appears during a fishing expedition. Nor would the leaders of the movement live, die, suffer torture and martyrdom for an invented story. A credibility check sometimes reveals the truth about such allegations.\n\n","date":"May 10, 2013 at 4:32 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33440","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"“Nor would the leaders of the movement live, die, suffer torture and martyrdom for an invented story.\nI used to think this, now I am not 100% sure. Plenty of downtrodden individuals / groups have risked their lives over the centuries in the name of just social causes. I think it is conceivable that the early supporters might have risked their lives because they believed in Jesus and his movement and its cause, even if they knew that the story of his resurrection was metaphor.\nHowever, whether the supporters of Jesus were downtrodden enough to make this theory potentially compelling is a big question. If Jesus’s early supporters in the 30s and 40s came from extremely downtrodden backgrounds then this might be feasible, but my understanding is that they were not oppressed in an extreme sense, in a way that would be motivating to risk their lives for a revolutionary cause .\nSo on balance, although interested in the “invented myth”, I  am not compelled by it.\n\n","date":"May 11, 2013 at 6:11 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33495","author":"Matthias","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"The ‘athiest’s’ argument, which is not new by any means, is insensible and lacks logic. People may die because they ‘believe’ in something, i.e social causes etc, it happens everyday, but, people will not willingly die horrible deaths for something they KNOW IS NOT TRUE! Now if the disciples had just concocted the resurrection event, as the athiests propose, then that would be case here…Which is extremely unfathomable.\nR\n\n","date":"May 13, 2013 at 10:00 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33597","author":"Ron","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"The Resurrection story doesn’t come from the “great unwashed” but from the disciples. A number of them had been in the fishing business (John 21 has them being able to return to it), one was a tax collector, they were able hobnob with influential friends, Joseph of Arimathaea (a person of wealth) and Nicodemus, both involved with the Council. Jesus himself seems to have come from a Galilean middle-class background with the trade of a carpenter (tekton). If there were oppressors, these could only be the Romans, but the real enemy of the early Christians is painted as the Jewish establishment. St Paul himself seems to have been an educated man with the trade of a tent-maker, joined the sect of the Pharisees, and as those who stoned Stephen lay their cloaks at his feet (like a football coach), he clearly had some influence there. A Roman centurion is not too proud to ask Jesus to heal his servant. The disciples are able to find supporters among influential women. This does not paint a picture of desparate down-trodden serfs looking for revolution. Jesus’ message was revolutionary, “Blessed are the poor”, the parable of Dives and Lazarus, his liberating attitude towards women, turning the existing conventions upside-down. The disciples do not at first embrace the story of the Resurrection, but have to be convinced before they can accept it. And then these same disciples are prepared to give their lives for it. The enemy is not seen as exploitative slavers, but those who will not believe. It is only later in Revelations that we see the Roman persecutions arising from the refusal to accept deification of the emperors. It is essentially a religious movement, but also certainly with social implications.\n\n","date":"May 12, 2013 at 1:32 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33541","author":"daveb of wellington nz","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"David has listed some of the main points that drove the “Jesus movement”, that later became the Church. So we know that there was much more in it than just sociology. The Resurrection was an unique event, within the bounds of history, but as Benedict XVI said, pointing to beyond and above history. What is beyond and above history is what is called Christian faith today. But what can be said about what happened in history? That the Resurrection was a less historical event, in terms of the number of people who saw the risen Jesus. But how did these people see the risen Jesus? What happened is described with some details in the NT, which are crystal-clear, and from which it is possible to see why the disciples acted that way. Without this historically-rooted event there would be no Church and no Christianity because the risen Jesus (within history) led to the Christ beyond and above history (Christianity).\n\n","date":"May 12, 2013 at 10:06 am","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-33553","author":"Louis","site":"shroudstory"},{"title":"The Carbon Dating of the the Shroud: Will we ever know what really happened?","post":"\nMatthias :\n“Nor would the leaders of the movement live, die, suffer torture and martyrdom for an invented story.\nI used to think this, now I am not 100% sure. Plenty of downtrodden individuals / groups have risked their lives over the centuries in the name of just social causes. I think it is conceivable that the early supporters might have risked their lives because they believed in Jesus and his movement and its cause, even if they knew that the story of his resurrection was metaphor.\nHowever, whether the supporters of Jesus were downtrodden enough to make this theory potentially compelling is a big question. If Jesus’s early supporters in the 30s and 40s came from extremely downtrodden backgrounds then this might be feasible, but my understanding is that they were not oppressed in an extreme sense, in a way that would be motivating to risk their lives for a revolutionary cause .\nSo on balance, although interested in the “invented myth”, I  am not compelled by it.\n\nUntil you read the stories of those who went to their deaths for the so-called myth.  Then there can be no doubt they had an actual experience with a person, not a myth.\n\n","date":"June 1, 2013 at 9:58 pm","url":"https://shroudstory.com/2013/05/09/the-carbon-dating-of-the-the-shroud-will-we-ever-know-what-really-happened/","cat":"carbon_14_dating","id":"comment-35663","author":"Andy Weiss","site":"shroudstory"}]
