[{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Stephen E. Jones has not only criticized the Marino and Benford  reweave theory , but also ” all shroud  pro-authenticists attempts to discredit the radiocarbon date.” He has put himself in a very awkward position indeed. Anti-authenticists will appreciate …\n\n","date":"May 25, 2014 at 12:50 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124489","author":"PHPL","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Let’s define terms then, shall we? The Shroud was made in AD25, and some random quantity of patching was added in 1535. What are the chances that the resultant date would be between 1260 and 1390? Is that the question? The answer (easily calculable using Christopher Ramsey’s OxCal and an online carbon dating calculator) is about 1/10. I’m happy to agree that a probability of 0.1 means that an event is unusual certainly, but a miracle? Astronomical? No, it’s not obvious. People should try some calculations before they jump to conclusions.\n\n","date":"May 25, 2014 at 1:01 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124493","author":"Hugh Farey","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"1325 +/- 65, significance level* : 5% (the lowest acceptable)\n* The probability of obtaining, by chance, a scatter among the three dates as high as that observed, under the assumption that the quoted errors reflect all sources of random variation.\nIf there is an anomaly in the sample, it is no longer a random variation.\nThere is no valid radiocarbon date.\n\n","date":"May 25, 2014 at 5:47 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124555","author":"anoxie","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"If the Shroud would really come from the 14th Century, that would mean someone in Europe was crazy enough to crucified someone who was looking like the Byzantine depiction of Jesus with the same kind of techniques used by the Romans during Antiquity.  Note that this is a proven fact that the Shroud was used to cover the corpse of someone who was tortured with the known techniques used by the Romans in Antiquity for crucifixion…  \nSo, taking this fact into account, we must ask ourselves :  In the light of other known false Christian relics made in Europe around that time, did such a scenario make sense or not? Is it possible that someone did all this in order to produce a false relic of Jesus’ burial cloth?  \nLet me laugh…\n\n","date":"May 25, 2014 at 7:08 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124574","author":"Yannick Clément","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"mmmm Yannick…\nWhilst I consider overall it more likely that he Shroud is authentic than not, I don’t agree that it is not possible that the Shroud could have been created in the 14th century.\nThe only thing consistent with the techniques used by the Romans are the flagellation marks…\nTheoretically at least these could have been added to the image by impression with bloodied flagrums.\nI find the image the most mysterious aspect, and more problematic for skeptics to explain than the wounds etc.\n\n","date":"May 25, 2014 at 11:32 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124635","author":"Thomas","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Thomas, some of those marks (type3, lower calves) are invisible to the naked eyes. Only visible in UV fluorescence. why would someone in the middle ages do something like that?\n\n","date":"May 26, 2014 at 8:32 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124754","author":"Mike M","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"There are more than the blood marks left by a Roman flagrum that indicates the Shroud man was tortured and crucified with the Roman techniques (techiniques by the way that were unknown in medieval Europe).  I think principally of the nailing through the wrists instead of the palms (which was not the common way Jesus was depicted in Medieval Europe) and also the use of a cap of thorns instead of a crown, which is a mockery coming from the kind of cap that was often used by Middle Eastern kings in Antiquity (instead of the crown that was normally used by European kings in Middle Ages).\nBut more than this, the principal reason I reject the possibility of a forgery done in the 14th Century in Europe with the use of a real crucified body is the fact that such a gruesome scenario goes far beyond what was necessary for a forger of that time in order to create a false relic of Christ.  And if you don’t believe me, look at the few examples of false shrouds of Christ that appeared in Medieval Europe after the crusades!  None of those shrouds had even a body image on them and none of those were showing bloody imprints so strikingly close to the reality of a Roman execution done in Antiquity.  \nThat’s why I estimate the scenario of a 14th Century forgery done with the use of a real crucified body in Europe has being close to absolute zero on a probabilistic scale…  If such a gruesome scenario ever happen, it must have taken place in the Middle East and near the reign of Constantin in the 4th Century (when Christian relics started to appear everywhere in great number throughout the Roman Empire).  But I must add that, even then, such a scenario is far less probable than to see the Shroud as the authentic burial cloth of Jesus of Nazareth…\n\n","date":"May 26, 2014 at 10:43 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124788","author":"Yannick Clément","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Yannick, you are correct!  \nIn fact, most of the atheist scientists, who oppose the Shroud image being that of Jesus, are of the belief the real man on the Shroud was the tortured Jacques deMolay. \nOn another forum, one scientist stated, “After his torture he was wrapped in a linen cloth that was used in Templar inner initiation rituals.”   \nAnd the other scientists on that thread, also agreed the image was the tortured Jacques de Molay.\nBest,\n\n","date":"June 1, 2014 at 10:25 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126191","author":"Angel","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"“The only thing consistent with the techniques used by the Romans are the flagellation marks.”\n– Really? How do you know?\n– Because the marks look just like marks made by reconstructions of Roman flagra.\n– What are these reconstructions based on?\n– The marks on the Shroud, of course.\n– Not on archaeological finds?\n– Er, no.\n– What do the Shroud’s marks look like?\n– Dumb-bells.\n– Have any Roman dumb-bells ever been found?\n– Er, no.\n– Have any Roman flagra ever been found?\n– Er, no.\n– How did the Romans describe their flagrum tips?\n– Knots, bits of bone, hooks, bits of metal.\n– Dumb-bells?\n– Er, no.\n– What about contemporary illustrations?\n– Yes!\n– What do they look like?\n– Chains, knots, rows of studs…\n– Dumb-bells?\n– Er, no.\n– So are dumb-bells “consistent with the techniques used by the Romans”?\n– Er, no…\n\n","date":"May 26, 2014 at 9:06 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124760","author":"Hugh Farey","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"You make a valid point, Hugh. However using your very observations we can also ask.\n-So are dumbbells inconsistent with the techniques used by the Romans?\n-Er, no.\nIs there evidence of medieval flagrum using dumbbell tips? If ‘yes’ this would support a forgery hypothesis. If ‘no’ this would undermine a forgery hypothesis as where would the idea to add dumbbell tips have come from? \nThis all is based on the assumption that we are even interpreting the marks correctly as dumbbell tips. Could the effect have been caused by knots? Were they even caused by a flagrum at all? Perhaps the marks are actually the butt end marks of some form of prodding instrument.\n\n","date":"May 26, 2014 at 9:22 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124765","author":"David Goulet","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"The most important thing to note about the scourge marks is the fact that they don’t look as coming from the common whips that were used during the Middle Ages in Europe.  Since the Shroud is obviously representing the bloody stigmatas of Jesus-Christ, those marks obviously represent scourge marks and not another sort of injury…  And as we know, the only thing that can produce this kind of very particular injury is the Roman flagrum that was used in Antiquity.  Why people are not able to see what is as obvious as the nose in anyone’s face?\n\n","date":"May 26, 2014 at 10:48 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124789","author":"Yannick Clément","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Why people can’t take two seconds to questions their assumptions, if only to reaffirm that those assumptions are indeed valid, is beyond my understanding. .\n\n","date":"May 26, 2014 at 9:10 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124907","author":"David Goulet","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Has anyone ever proposed that the Shroud man might be a flagellant from the 1300’s?\nSuch a notion is consistent with the flagellation marks.\nThoughts?\n\n","date":"May 27, 2014 at 3:50 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124966","author":"Thomas","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Interesting idea and, as you might have guessed, not inconsistent with the Shroud, as long as the poor man was flogged by others rather than himself (as indicated by the wound distribution). However, sticking to my own criteria, I don’t know of any archaeological remains of a medieval whip to compare with. There are several Victorian ones about, and the Museum of London has a Saxon one. Illustrations of medieval flagellants either have no knobs at all or horrible hooks, neither of which is deminstrated on the Shroud.\n\n","date":"May 27, 2014 at 5:42 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124985","author":"Hugh Farey","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Hugh, have a look at this \nhttp://freepages.religions.rootsweb.ancestry.com/~wmeacham/scourge.htm\n\n","date":"May 27, 2014 at 10:09 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125032","author":"Mike M","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Message to David:  The conclusion that the scourge marks on the Shroud come from a whip that was similar to a Roman flagrum is not an assumption but a fact…  That’s why I said it is as obvious as the nose in anyone’s face.  You can question many things about the Shroud, but please, stick to the facts instead of playing the game of wild guesses and extrapolations.  The fact that the Shroud man was scourged with a whip that was able to cause similar injuries as a Roman flagrum is not consistent at all with the idea of a forgery done with the use of a real crucified body in Europe during the 14th Century…  Period.  If this kind of gruesome scenario had really been done, no doubt you would only see long bloody marks left by leather tongues instead of dumbell shape marks left by metal balls or animal bones.\n\n","date":"May 27, 2014 at 10:39 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125040","author":"Yannick Clément","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Yes, I’m familiar with it. Presumably Meacham was trying to track down the “original found at Herculaneum, in the houses of which city other specimens have been found, with two and five tails, but otherwise of similar character to the present.” Strange that the museums associated most closely with these discoveries know nothing of them. The illustration itself looks unlikely too, but even if we were to accept it as such, it bears no relation whatever to anything that might make the wounds we see on the shroud.\n\n","date":"May 27, 2014 at 1:30 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125066","author":"Hugh Farey","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"I completely agree with David\nYes, to my knowledge, we don’t have any archaeological flagrum exactly similar to the object that gives the dumb-bells marks as seen on the Shroud.\nOn the other side, I was unable to find such an object used by the medieval flagellants.\nIn short, nowhere we can find the object that leaved the dumb-bell marks of the TS from archaeology.  \nHowever, we know that the Roman used many different flagra (?) (pl. of flagrum). The fact that until now we don’t have a Roman flagrum exactly similar to the “TS flagrum” does not mean that it did not exist. In fact, this situation occurs often in  archaeology.\nShortly, what is the best hypothesis:\n1) A medieval forger who painted such a strange pattern (why ?), without any model ?\n2) Or the result of a real Roman scourge made by a a kind of flagrum that has not been yet discovered but which has many similarities with the TS marks ( knuckle-bones …) ?\nThe answer is in the question.\n\n","date":"May 28, 2014 at 3:34 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125314","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Fair point. And one of the enduring fascinations of the Shroud is that in so many ways, “not inconsistent” fits its description much better than “consistent.” See also Mechtilde Flury-Lemberg’s comment, recently quoted, that the side-seam stitching was not inconsistent with 1st century Middle-Eastern sewing.\n\n","date":"May 26, 2014 at 9:29 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124769","author":"Hugh Farey","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"The true fact is Hugh is more assertive when it comes to turn non-fact into fact (read his assertion re the Holland backcloth alleged “dying” to match the TS).\n\n","date":"May 26, 2014 at 1:01 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124820","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"…or his other assertion re the Lirey-Nice-Chambery-Turin Shroud alleged ‘paucity’ of displays.\n\n","date":"May 26, 2014 at 1:04 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124822","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Re flagra:  See “The Shroud”, Ian Wilson 2010, Plate 9C: Caption: “Roman coin of c. 100BC showing a flagrum in use against a naked man in a gladiatoral contest”.  This particular flagrum clearly terminates in four (not three) thongs.  Detail on the coin is too minuscule to show the pellets.  Plate 9B showing a model of a flagrum is clearly labelled as ‘a reconstruction’.  It would seem to be the type of weapon that would not need to be a standard issue item from Roman Army General Stores, but could easily be fabricated by any skillful rank & file soldier according to what might have been at hand, whether knuckle-bones, left-over hooks, metal balls or whatever.  Their ‘design’ probably varied according to whatever was generally available on hand at the time.  A type resulting in dumb-bell shaped wounds is not at all incredible.  The evidence on the Shroud indicates that this what was in fact used in this particular instance.  The pattern of scourging described by Barbet clearly shows that it was imposed by two men from either side, one is described as being shorter than the other with a trick of flicking the flagrum to reach around the front of the legs.  It is not the sort of pattern that would be faked.  It is interesting that the illustration in the Carolingian Stuttgart Psalter shows the type of weapons that are reflected in the scourging wounds on the Shroud.\n\n","date":"May 26, 2014 at 5:04 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124877","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Thomas: Has anyone ever proposed that the Shroud man might be a flagellant from the 1300′s? Such a notion is consistent with the flagellation marks.\nThoughts?\nYes, I had to refute such absurd claims here http://ok.apologetyka.info/racjonalista/caun-turynski-faszerstwo-niedokonane-cz-2,559.htm\n\n","date":"May 27, 2014 at 6:44 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-124995","author":"O.K.","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Can you provide a brief summary in English?\nwhy absurd? If a first century AD body could have created the image – non-miraculously – why not a 14th century body?\n\n","date":"May 27, 2014 at 5:38 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125099","author":"Thomas","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"In short, my opponent suggested that the forger was inspired by medieval flaggelants, whom he saw just outside the window. Then he gave a quote describing medieval flagrum, which consisted of several needle spikes. I responded that it is a perfect description of a whip that has not\nbeen portrayed on the Shroud, and then I referred (via Wilson) to Herculaneum, excavated several centuries after first Shroud display in Lirey. Although, contrary to Wilson, I did not assumed that the flagrum as described on the Shroud, must have been exclusive to the Roman empire, however,  I claimed that it would be strange coincidence that the shape of the whip would fit what was excavated at Herculaneum (I assumed in good will that those reconstructions are based on items found there).Next I referred to Ricci’s reconstruction of the flogging, where Jesus was tied to short (circa 60 cm) column (the alleged relic of it still exist in Rome!), leaning down, and being beaten by two Roman opressors from each side of the back. Then I argued that the scourge marks on the Shroud are not distributed randomly, but follow specific pattern, contrary to the contemporary drawings. \nIn short it is unlikely that the scourge marks on the Shroud are inspired by medieval flagellants. Especially if we additionally take into account all the remiang crucifixion marks.\n\n","date":"May 28, 2014 at 6:28 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125229","author":"O.K.","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"If people want to push their reflection further on the subject discuss here, I highly recommend reading the superb analysis done by a Jesuit named Werner Bulst, which he published in Shroud Spectrum International many years ago: http://www.shroud.com/pdfs/ssi19part3.pdf\nI read this recently and was struck by how my own personal analysis of the Shroud, which was done in a completely independent way, was very similar to his own analysis!  This fact made me ask the question of why there are not more people interested by the Shroud who came up with the same kind of analysis…  I hope this paper will help some people to get a better view of the situation regarding the questions of the authenticity and the image formation.  Even if this paper was written many years ago, the core of it is still valid since there has been no other direct test on the relic.  The only thing that would be nice to add in such a paper is the works of Rogers, Fazio and Mandaglio, DeSalvo and Mills.  But beside that, this is a very good paper to read.\n\n","date":"May 27, 2014 at 8:29 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125017","author":"Yannick Clément","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Hugh:\nA Dictionary of Greek and Roman Antiquities (1890):\nSome flagella found at Herculaneum consist of several short chains with knobs of metal at the end, attached to a short handle.\nhttp://www.perseus.tufts.edu/hopper/text?doc=Perseus:text:1999.04.0063:entry=flagrum-cn\n\n","date":"May 27, 2014 at 3:00 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125080","author":"O.K.","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Note that date of this Dictionary is 1890, some 8 years before Pia’s photographs yielded the first secrets of the Shroud, and at least 50 years before Barbet commenced  his first analysis of the scourge wounds on the image!\n\n","date":"May 27, 2014 at 3:59 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125085","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Note also that these flagella a) are nothing like the instrument which could have inflicted the wounds on the shroud and b) have totally disappeared…\n\n","date":"May 27, 2014 at 5:44 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125101","author":"Hugh Farey","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Hugh, your persistent skepticism in the face of evidence to the contrary is starting to become just a tad too boring!  I fail to see how it might illuminate the mystery of the Shroud!\n\n","date":"May 28, 2014 at 1:09 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125180","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"I’m sorry to read that, but, on the evidence of the scourge marks alone, there is nothing in either the alleged metal chains with bell-shapes on the end (not dumbbells), nor the coins with images of gladiators on, nor the descriptions by Roman authors, nor the amazing little knobbly thing that was sold last year, to suggest that the marks are typical of Roman punishment, let alone “conclusive evidence” that the body on the Shroud was flogged by 1st century Romans. I have never rejected the “non inconsistent” description, in fact I encourage it,  but I get bored by remarks beginning “Note that this is a proven fact….”\n\n","date":"May 28, 2014 at 8:45 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125250","author":"Hugh Farey","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Goodness me, look what I’ve found!\nhttp://www.delcampe.net/page/item/id,225634625,var,element-de-FLAGRUM-romain-en-bronze,language,E.html\n\n","date":"May 27, 2014 at 6:45 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125113","author":"Hugh Farey","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Do you speak French Hugh ?\n\n","date":"May 28, 2014 at 1:55 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125188","author":"PHPL","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Bien sur. But sadly, not Polish, as from what Google can make out of OK’s site it looks really good!\n\n","date":"May 28, 2014 at 2:39 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125195","author":"Hugh Farey","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"flagellants circa 1350:\nhttp://www.eyewitnesstohistory.com/flagellants.htm\n\n","date":"May 28, 2014 at 12:53 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125179","author":"Thomas","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"On the scourging, Barbet writes as follows:\n“We know already what the instrument of torture was like, the Roman ‘flagrum’, the thongs of which had two balls of lead or a small bone, the ‘talus’ of a sheep, at some distance from their end. There are plenty of the marks of this on the Shroud.  They are scattered over the whole body, from the shoulders to the lower part of the legs.  Most of them are to be seen on the back portion which proves that Jesus was bound with His face to the column, with His hands above Him, for there are no marks on the forearms which are quite visible.  These could not have failed to receive some blows, if they had been bound lower down.  A considerable number of marks are however to be found on the chest.” \n“One must add that only those blows have left a mark which produced an excoriation or a contused wound.  All those which only caused ecchymosis (a severe bruise) have left no mark on the Shroud.  Altogether I have counted more than 100, perhaps 120.  This means that if there were two thongs, that Our Lord received  about sixty strokes apart from those which left no mark.” \n“All the wounds have the same shape, like a little halter about three centimetres long.  The two circles represent the balls of lead, while the line joining them is the mark of the thong.” \n“They are nearly in pairs of two parallel wounds, which makes me think that each flagrum had two thongs, and they are laid out in the shape of a fan, the centre of which would be the executioner’s hand.  On the thorax they are oblique, horizontal on the loins, and oblique once more on the legs.  At this level, one can see in the frontal image long oblique furrows (similar to the halter-like wounds at the back), which must have been produced by the ends of the thongs.  Having struck the calves of the legs with their leaden balls, they have turned round the outer edge of the leg and lashed the front with their points.”\n[Comments on evidence of complete nakedness of subject during scourging]  \n  “Finally there must have been two executioners.  It is possible that they were not of the same height, for the obliqueness is not the same on each side.”\n“Doctor at Calvary”, Pierre Barbet, pp.91-92. \nMy comments:  There is clearly some difference from Barbet’s interpretation and the reconstructed flagrum shown in Plate 9D of Ian Wilson’s “The Shroud” 2010.  Barbet claims two thongs (the wounds occurring in pairs), plate 9D has three thongs.  Further, Barbet envisages that the pellets were at some distance from the ends of the thongs allowing the lash to whip around to the front;  whereas plate 9D shows the pellets at the ends.  My personal belief is that the flagrum was probably the sort of weapon that varied quite a lot in design according to the taste and particular sadism of its user or designer, as well as what materials were readily to hand. \nI think it significant that a definite pattern of scourge marks is evident, consistent with how one might envisage a scourging as a formal part of execution might occur.  These were not a random pattern of marks that might occur during any masochistic orgy of flagellants, but were clearly a formal execution.  As for the marks being a forgery, Barbet concludes by saying:  \n“Painters have been content with, at the most, vague, formless excoriations;  is there one of them who could have imagined and realised these minute details?”  \nI am also aware that there have been additional investigations by Italian researchers, who claim evidence of a different kind of whipping like the sort from lictors’ fasces, to “encourage?” the condemned to complete the journey to the final place of execution.  I’ll leave any comment on this to another time.\n\n","date":"May 28, 2014 at 8:15 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125244","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Yannick wrote: “If people want to push their reflection further on the subject discuss here, I highly recommend reading the superb analysis done by a Jesuit named Werner Bulst, which he published in Shroud Spectrum International many years ago: http://www.shroud.com/pdfs/ssi19part3.pdf“.\nNow WB wrote:\n“The Man of the Shroud, however, was given an honorable burial, in a truly exceptional manner, wrapped in a precious cloth with aromatics. Moreover, the lack of distortion of the body image (except for a few small areas) supposes that the cloth lay flat under and over the body, doubled over at the head—a manner unknown in all the world. This can be understood only in the light of a hasty and provisional burial, as suggested in the Gospel accounts of Jesus’ burial.”\nRe Historical circumstances in the death and burial of Yeshua in light of the Shroud image, HAD Werner Bulst really relied on the Gospels as he claimed, he should have known at least:\n1/ Re a speedy burial (Luke 23:54: “It was Preparation day and the Sabbath was beginning to grow light” = the stars which marks a new day, here the beginning of the Sabbath, were shining), which by the way is part and parcel of Judean/Jewish burial), “(…) Heb. Layla, “night”; typically layla is taken to be when you can see three stars in the sky in reference to tset ha-kokhavim, the first “three stars coming out” to announce a new day (here the great Shabbat of PessaH). The 3rd star respectively appeared at 19:38 p.m. on April 7th 30CE and 19:08 p.m. on April 3rd 33 CE. (…)\n  Hence, the actual maximum time frame for Rabbi Yeshua’s burial was 4h04. If we now take off 30-45mn to Pilate’s and back + 30-45mn to take down Yeshua’s body from the cross and carry it to the garden tomb near-by, we are left with a minimum time frame of about 2h30. It totally rules out the pseudo “0h30 burial scenario” as the very notions of ‘evening’, ‘sunset’ ‘twilight dusk’ and ‘night’ as time markers, do not philologically cover the same realities for a Judean as they do for a 20th-21st reader relatively or totally unfamiliar with the Judean ethnic milieu of the Second Temple period.\n  Within a minimum of 2h30, Rabbi Yeshua’s 4-5 buriers had enough time to pre-wash his body (i.e. to re-dampen most of his wounds – to the sole exception of those likely to flow so as to keep his blood with his body as much as possible), purify his shed innocent blood via his lengthy inner shroud (Gr. sindôn/Heb. sadin) soaked with alkaline waters and tightly wrap it up, with insect repellent fresh plants and floral heads (Gr. aromaton, “spices”), in linen clothes and strips (most likely the fresh spices were laterally placed on the long inner shroud aka the TS and then compressed along with objects through wrapping against Rabbi Yeshua’s naked body and acted as a screen.)” (This I wrote on August 19, 2012 at 12:16 pm in this very blog). \n2/ Neither Yeshua’s dead body could have been just “(loosely) draped over” as WB also implied. The (phrase)/conjugated verb is never used in conjunction with Yeshua’s burial through all the 4 Gospel accounts in koine/translation Greek. The Greek verbs entulisso, “to wrap, wind, encircle”; eneileo, “to compress, tightly wrap up” and deo, “to bind, fasten” are used instead and no others to describe the dressing in shrouds. Most curiously though, that’s a literary and philological fact Werner Bults just kept overlooking (and so does his blind-folded follower aka Yannick Clément).\n  From the three koine Greek verbs really used in the Gospels to describe the way Yeshua’s body was wrapped in linen/shrouds with “spices” (along with objects) and in the hypothesis the Turin Shroud bloodied body image is that of Yeshua as crucifixion victim, literally and philologically speaking we can rightly deduce the wrapping was done tightly around the whole body from head to toe.\n\n","date":"May 28, 2014 at 9:09 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125253","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"All I know Max is the fact that some intelligent and well-educated people like Bults have come to very similar conclusions as I did (while making their study of the Shroud in a complete independent way than I) concerning the Shroud, which is a fact that make me think I’m not as crazy and biased as you might think…\n\n","date":"May 28, 2014 at 11:02 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125269","author":"Yannick Clément","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Reminder for Yannick Clément: “You’re neither right nor wrong because other people agree with you. You’re right because your facts are right and your reasoning is right—and that’s the only thing that makes you right. And if your facts and reasoning are right, you don’t have to worry about anybody else.” Warren Buffett\n\n","date":"May 30, 2014 at 7:46 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125700","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"However the placement of the Shroud at the time of wrapping, whether loosely wrapped, or tightly wrapped as Max has frequently asserted on biblical grounds and Jewish burial conventions, the fact remains that at the time of image formation, the cloth was so disposed as to produce an orthogonal image.  I cannot accept Max’s explanation that this came about because of any stretching or shrinkage of the cloth.  It makes no geometrical sense to me at all.  I consider that Mario Latendresse’s experiments and analysis come closer to the mark, certainly at the time of image formation.  By some means or another the cloth was close to being near parallel to the front and back of the body.  The absence of geometrical distortion argues for it.  A tight wrapping at the time of image formation would not show the near orthogonal image that it does and the sides of the body would also be visible, which it doesn’t.   Only if the sides of the body were packed with burial spices when the sides would then be masked and the cloth be near flat across the body, could tight wrapping be admitted as a possibility.  However I am under the impression that Max does not accept such an explanation.\n\n","date":"May 28, 2014 at 4:09 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125321","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"The important thing appears to have been to get the body and whatever contained blood together in as short a time as possible and bury them together with the spices. This was the minimum that had to be done, there was no time for the rest of the conventions, which were left for Sunday morning.\n\n","date":"May 28, 2014 at 5:07 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125331","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Louis, you wrote: “there was no time for the rest of the conventions”. \nThe main core procedures (speedy burial, dressing in shroudS, purifying (shed innocent blood) and drying could have been performed within 2 hours-two hours and a half with the help of 4-5/5-6 buriers.\nDave, you wrote: « the fact remains that at the time of image formation, the cloth was so disposed as to produce an orthogonal image. I cannot accept Max’s explanation that this came about because of any stretching or shrinkage of the cloth. It makes no geometrical sense to me at all. »\nHad you really made a couple of attempts to experimentally reconstruct the TSM’s burial as I did in the 1990s (especially his dressing in shrouds and fumigation in extra height with his stiff rigid body resting in extra height on its right side) and considered the phenomena of ‘truncated horizontal panoramicity’ (head, torso, lower & upper limps), volumetric (com)pressure with  bloodied body frontal & dorsal imprints recorded as image in plane with intriguing distortions, twill weave linen specific mechanical responses (whether dry or in-soaked with alkali solution, whether shrinking taut or non-taut lengthwise while compressed widthwise by an all enveloping sovev), my explanation could have made ‘geometrical sense’ as far as “complex variable projective geometry” is concerned.\nRe the alleged “absence of distortions” in conjunction with the cloth as flat surface: the true fact is the Sindon image is affected by several distortions:  two squared ‘U’ shaped boxes framing up the Shroud face; absence of a neck image along with presence of chin lower area (vertical panoramicity); unusually long adducted-abducted arms (of which rigor statuaries, “statuar rigidity”, was counter-acted) and seemingly long fingers on the right hand (implying both dislocation and uneven stretching at the arm level). Along with head slightly bent forward, curved back and legs bent with raised knees, all these distortions do point in one direction: a volumetric recording of a moulded stiff rigid bloodied body with at least two slightly different body-to-cloth configurations (initial and final).\nThe distortions in conjunction with rigor mortis signs or not are a matter of “complex variable projective geometry” as the long inner burial cloth though transversely compressed, shrank up and got somehow taut again lengthwise – during the Sindon image formation process with slight gradual pressure release (e.g. at counter-acted rigor statuaris arm level resulting in a slight lengthening of the right arm image and fingers on the right hand image).\nBTW Dave, if there was no FIRST body-to-cloth contact and THEN gradual slight loss of contact (as the watery solution in-soaked inner shroud aka the TS dried out (through fumigation) and got somehow taut again lengthwise (through shrinking), geometrically speaking what is your explanation to account for the following distortions: \n1/ blood rivulets FIRST appearing on the face and THEN as if on the hair\n2/ some bloodstains appearing in the area of the back of the knees BUT no image while the very fact the small of the back is recorded (despite lordosis)? \nAnd how do you account for the extra inches around the buttocks with no body image and no blood imprint detected in the said area?\n\n","date":"May 29, 2014 at 8:52 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125483","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"PS to Louis:\nThe text (Mr 16.1) ONLY speaks of the women wanting ‘to anoint’ Yeshua’s (tightly wrapped up) body, not ‘wash’ it and/or dress it in shrouds! Reminder: on the very day of his death (that is on Friday not on Sunday!), Yeshua’s body had already been wound/compressed/fastened “in linen clothes/shrouds with the ‘spices’, as the manner of the Judeans is to bury”. There is no self-serving leaving out as far as the Gospels are concerned.\n\n","date":"May 29, 2014 at 9:16 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125486","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Correction: self-serving take and leave\n\n","date":"May 29, 2014 at 3:58 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125560","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Max, I am basing myself on the gospels and the fact that Jesus was executed as a criminal. If it were not for Joseph of Arimathea the body would be dumped in a trench grave. The gospels say that a burial cloth was bought and I presume that “Othonia” refers to the bands. I know about your studies and contentions, but as I said more than once it would be better if you could put it into pdf together with sketches, diagrams etc, whatever you may need to illustrate the text to make it easier to understand.\n\n","date":"May 29, 2014 at 6:09 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125585","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Louis, you claim: “I am basing myself on the gospels”. The true fact is your worn-out interpretation flatly contradicts the Gospels and only works on a self-serving take-and-leave basis JUST to fit an arch-miraculistic preconception of the TS image. \nPhilologically and hermeneutically speaking, your preconception have you most curiously TOTALLY overlook the koine/translation Greek verbs used in the Gospels to describe Yeshua’s dressing in shrouds ON FRIDAY. \nWhen will you ever consider the likeliness of the TS man’s body having been ALREADY “wound/compressed/fastened” in linen clothes/shrouds with ‘aromaton’ ON FRIDAY for such is ALSO the meaning of the koine/translation Greek verbs entulisso, “to wind”, eneileo, “to compress”, and deo, “to fasten” used in the conjugated form in the  Gospels? \nWhen will you ever consider the UNLIKELINESS for the said three koine Greek verbs to ever mean “to loosely drape over”? Philologically speaking, your worn out interpretation is totally inconsistent with the 3 koiné Greek words used in the Gospels to describe Yeshu’s body as wound/compressed/fastened in shrouds along with ‘aromaton’.\nShall I repeat the manner of Second Temple period Judeans to bury” their dead was NOT just to ‘loosely drape over’ their body with a linen cloth but to WIND/COMPRESS/FASTEN them in linen clothes/shrouds with ‘aromaton’. I do stand correct here as far as Philology and the Gospels are concerned and you stand incorrect.   \nHave you ever thought the linen shrouds could also be used to counter-act rigor mortis if need be (especially the abducted arms in rigor statuaris) so as to have the deceased’s body rests as flat as possible and be composed in dignity?\nNow you ALSO want us to think the women wanted NOT ONLY to anoint Yeshuas’ dead body but also to undress and redress him in shrouds! This is NOT what the Gospels say at all! Anointing Yeshua’s body 2-3 days after he had been buried shall be understood in light of visits paid to the deceased and as a procedure to preventing bad smells on those subsequent visits. Most likely the women were NOT to anoint his naked but ONLY his already tightly wrapped up body, which makes a world of a difference.\nYou also wrote “Jesus was executed as a criminal”. Was he really buried as such by secret disciples who thought he was innocent? Was not his body honored? When will you ever consider the likeliness of the shroud had been in-soaked with a watery/alkali solution for the sake of purifying the SHED INNOCENT BLOOD within a Judean funerary context? Reminder: the Giv’at ha-Mivtar ossuary that held the bones of the sole crucifixion victim ever found in the Land of Israel, implies though an alleged ‘criminal’, the latter was even HONORED WITH A SECONDARY BURIAL.\nYou also wrote: “The gospels say that a burial cloth was bought”.\nOn March 21, 2013 at 7:00 am, I wrote:\nRe Mark 15:46. Actually it should be read: “And he (Joseph of Arimathea) HAD BOUGHT (literally “HAVING bought” in koine Greek as it is in the aorist) a linen cloth (for his own burial), and he took him down, and wrapped him in the linen cloth and laid him in a tomb that had been hewn out in the rock and he rolled a stone”. The aorist here renders the Hellenised Aramaic/Hebrew wayyiqtol used as ‘pluperfect’) so the undefined tense of this verb looks like an aorist.”\n Do you really think Yeshua’s secret disciples and buriers just buried him ‘not even half dressed in shrouds’ within the tomb when from his death on the cross to the closing of the tomb, the maximum time-frame for his burial was 4h04 and the minimum 2h-2h30? When will you ever consider speedy/hasty burials were/are part and parcel of Judean/Jewish burial time-honored customs? They were the rule not the exception as you misleadingly imply.The TS man’s dressing in shrouds needed 4-5/5-6 buriers on hasty burial (i.e. within 2 hours – 2 hours and a half) with only four (burial on the same day of death before night; dressing in shrouds; purifying and drying out of five (anointing being postponed after Sabbath) of the core burial procedures performed. \nMy assertions are mainly based on biblical grounds, Ancient Jewish burial conventions archaeoastronomy and philology (Hebrew time markers + koine/translation Greek).\n\n","date":"May 30, 2014 at 7:05 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125694","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"PS BTW, most likely there were 5-6 shrouds used for Yeshua’s burial (even with the Oviedo Sudarium being EXcluded as PRE-burial shroud).\n\n","date":"May 30, 2014 at 7:29 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125697","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Reminder for Louis:  In August 19, 2012, I wrote: \n“(…) starch and saponaria officinalis (IF the latter was used as a detergent to wash the sindon and was still present in it) once mixed with warm alkaline water (and the corpse being subjected to a heating source such as a fumigation) is a very simple and rapid way indeed, if not to “meticulously clean up” at least to purify shed innocent blood and body on a hasty/speedy burial.”\nAnd on August 19, 2012 at 12:16 pm, I also wrote: \n“In the Judean ethnic milieu of the time, the tradition was to visit the deceased on the three (or even seven) days immediately following his burial. Anointment was part and parcel of the Judean burial rite as it allowed preventing stench on those subsequent visits. Because this part of the rite was not done, the women had to buy and prepare spicy oils to anoint Rabbi Yeshua after the Sabbath and come back to the tomb very early on the third day. They definitely had not to unwrap, wash the deceased’s naked body, anoint it and dress him in shrouds at all but just to anoint the linen wrappings he was already wound/compressed/fastened in. Hence, to the sole exception of the anointment ritual, Rabbi Yeshua’s “primary” burial rite according to the Judean funerary custom of the Second Temple period could have been duly completed within a minimum of a two-hours-and-a-half time-frame.”\n\n","date":"May 30, 2014 at 8:56 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125714","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Additional reminder or Louis: On February 12, 2014 at 5:21 pm | #115, I wrote:\n“In the hypothesis the TS man is Yeshua, in the Second Temple period any corpse should be buried on the day death, purified, dried out, dressed up/wrapped up and buried. Those were the core procedures.\nYeshua was no mere am eretz ie “Judean ordinary citizen” through his 5-6 buriers’ eyes but a prophet (and even the Messiah) whose freshly dried innocent blood had been shed and should be kept with his body. Hence most likely his long inner burial cloth was in-soaked with a watery solution (living or rainwater + ashes and/or limestone dust) and his bloodied body subjected to a (myrrhic?) aloetic fumigation rite. In the Bible burning aromatic woods/spices are currently used to honour dead kings (see 2 Chronicles 16:14 – 21:19 Targum).\nBear in mind too Yeshua was buried in the memorial/commemorative tomb of Joseph, a rich man, and not just thrown into a pit as a criminal.”\n\n","date":"May 30, 2014 at 9:04 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125717","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"PS A criminal who was not worthy of a place in paradise was buried in black shrouds not in white ones. (see Babylonian Talmud: Tractate Niddah, Folio 20a-\n\n","date":"May 30, 2014 at 9:15 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125718","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Max, there are several points to be tackled.\nThe Babylonian Talmud is dated to the fifth century, not everything it says necessarily applied to the first century. The same book also says that Jesus was a bastard. Is that what you want? Further, whatever it says, Jesus was executed as a criminal, not as a saint. The Sadducees did not believe in the after-life, whether the burial cloth was black, white, purple or green would make no difference to them. We can presume that  it was white because Joseph bought it, and he did not believe that Jesus was a criminal. Moreover, by handling the body he became ritually clean, unable to go to the Temple, which also signified a break with the Temple leadership. It was a hasty burial, the the body must have been left with the minimum conventions followed, until it could be probably attended to after the Sabbath.\nAccording to the late Father Raymond E. Brown, who was a world-renowned Biblical scholar, Joseph did not have time to give Jesus a proper burial, which would include washing the body, anointing it with oil and then clothing and wrapping it. The New Jerusalem Bible I use says Joseph “took the body, wrapped it in a clean shroud.” The problem is of course what is meant by “othonia”, but then it was not that important for the authors of the gospels as the risen Christ and, we must not forget, the Greek they used was not Plato’s Greek.\n\n","date":"May 30, 2014 at 1:34 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125747","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Hi Louis, in Luke’s Gospel both Sindone and Othonia were used on two different occasion  to describe the burial cloths. Othonia being a generic term to mean burial cloths (plural) the plural may indicate strips to bind the sindone or just the folding of many layers of the sindone\n\n","date":"May 31, 2014 at 7:54 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125900","author":"Mike M","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Hi Mike\nThanks for the comment. We differ little. The strips could have been used to bind either the body, like the chin for instance, or the shroud.\n\n","date":"May 31, 2014 at 5:40 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125973","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Louis you wrote:\n1/”The Sadducees did not believe in the after-life, whether the burial cloth was black, white, purple or green would make no difference to them.”\nFirst how do you know Yeshua’s buriers could ONLY be Sadducees not Pharisees or Essenes? Have you ever heard of  liberal Pharisees from Sadducean background? Since his buriers were Yeshua’s secret dsciples, how can you tell for sure they did not believe in the after-life? How can you discriminate between ‘Sadducees’ and  ‘liberal Pharisees from Sadducean background’ as far as Yeshua’s burial is concerned? Give me you references, please.\nYou also wrote:\n2/ “The Babylonian Talmud is dated to the fifth century, not everything it says necessarily applied to the first century.”\nCould you tell me which rabbinic literature really apply to first century burial? Can you account for what you self-servingly take and leave in 2nd and 5th c. CE talmudic literature?\nHave you got better rabbinic sources?\nYou also wrote:\n3/ “Jesus was executed as a criminal, not as a saint.” \nWas he really BURIED as such? This is the whole point here. Reminder (again): his buriers were also his secret disciples. Joseph as a member of the Sanhedrin did not take a hand in Yeshua’s death sentence. Had he thought Yeshua was a criminal not worthy of a place in paradise, he would never have buried him in his own newly hewn tomb and wound him in a shroud most likely he had bought for himself. Haven’t you got the foggiest notion of what ‘shed innocent blood’ could really mean in the Judean ethnic milieu of the time?\nYou also wrote: “we must not forget, the Greek they used was not Plato’s Greek.”\nSo you mean we should read the koine/translation 3 conjugated Greek verbs as if they all mean “loosely draped over” and the verb “to anoint” here could only mean “to unwrap, anoint and redress in shrouds”? Are you kidding? Philologically speaking, this is not serious. Do you mean the Gospels are not reliable at all as far as Yeshua’s burial account is concerned and YOUR/BROWN’s interpretation is a fact carved in stone?\n\n","date":"May 31, 2014 at 6:14 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125886","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"PS Othonia (in the diminutive plural form) means “shorter shrouds”a as opposed to a larger wrap (sovev type).\n\n","date":"May 31, 2014 at 6:18 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125887","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Reminder for Louis: Yeshua’s buriers as his secret disciples, could have regarded their master not so much as a criminal as both a political victim of Roman occupation and a righteous man whose body was to be honored. The fact remains a Sanhedrin member asked his body to Roman authorities not to be buried in the place reserved for executed persons (if you rely on the Gospels accounts of Yeshua’s burial but do you?).\n\n","date":"May 31, 2014 at 8:30 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125901","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Max, you seem to have misunderstood what I said although the meaning is clear.\n1) I do not think Sadducees buried Jesus, on the contrary I think Joseph was a Pharisee. Were Essenes involved? Certainly not, ritual purity was of paramount importance for them, the Pharisees would look like liberals if we are to make comparisons.\n2) The order to execute Jesus came from the Sanhedrin, however it had to be carried out by the Romans because these prohibited Jews from executing anyone. Actually the court members had the Romans execute Jesus because they were afraid of the people, but we know that they also had others, less important people, stoned to death by mobs.\n3)We have no other rabbinic sources, but so what? It cannot be taken for granted that what we read in them is absolute truth. Have you consulted Neusner, Schaefer?\n4) Raymond E. Brown was a highly respected Biblical scholar. Neither him nor me carved any interpretation on stone. I find no difficulty in agreeing with him when it comes to the haste in Jesus’ burial, that is, when it comes to his contention that there was no time to follow all the conventions like washing, anointment with oil, but nothing beyond that. He made a big mistake when he came to the end of the burial procedures, one that is being echoed today with bad consequences.\n\n","date":"May 31, 2014 at 6:16 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-125983","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Reminder Two for Louis:\n1/ before trying to hide behind a Biblical scholar such as Raymond E. Brown’, you’d better reread his exegesis of Yeshua’s burial before putting words in his mouth and twisting philological facts.\n2/in the hypothesis the Turin Shroud is Yeshua’s “long inner shroud”,  most likely the latter is ONLY ONE of the 4-5 shorter shrouds (Gr. othonia) used to wind/wrap/compress/tightly wrap up/bind /fasten his body with ‘aromaton’ as is the manner of the Judeans to bury. The Aramaic ‘sudara’ (Gr. soudarion) as large head covering from head to toe is the larger all enveloping wrap (Heb. sovev) to be understood in the light of the koine/translation Greek word othonia, “shorter shrouds”, in the diminutive plural form. The Kornelimünster Sudarium (3,50 X 6m) whether authentic or its replica  is the best candidate for John’s  gospel ‘sudarion’ (Aram. sudara).\n3/ the large amount of myrrh and aloes used points in the direction of a burial of a Master of Torah NOT that of a criminal (see Talmud Babli ‘Adoda Zara 11a ; Semahot (Ebel Rabbati’) 8:6 (47a). BTW the Babylonian Talmud ALSO refers to Second Temple traditions/1st c. CE and anecdotes (e.g. Gamaliel The Elder’s burial around 50 CE) in conjunction with the Tanakh/Hebrew bible (Jer. 34:5).\n4/ the very TS with its white colour and its characteristic zigzag weave pattern symbolic of the living waters of the Torah ALSO point in the direction of the burial of a Master of Torah or at least a righteous man worthy to be placed in Gan Eden (Paradise) NOT a criminal.\n\n","date":"June 1, 2014 at 5:47 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126061","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Max, it seems that you have not read my previous comment. I am not hiding behind Raymond E. Brown not only because I don’t agree with everything he wrote but also as you may have noted in my comments and articles, I am not one to hide behind anybody. \nCould you please, here and now, and in a few lines, not in a dozen paragraphs, explain Brown’s exegesis, as you understand it. I am referring to the burial.\nJesus was executed as a criminal, his burial is another thing.\n\n","date":"June 1, 2014 at 1:02 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126105","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"On May 28, 2014 at 5:07 pm, you wrote:\n  “The important thing appears to have been to get the body and whatever contained blood together in as short a time as possible and bury them together with the spices. This was the minimum that had to be done, there was no time for the rest of the conventions, which were left for Sunday morning.”\nAnd then: “According to the late Father Raymond E. Brown, who was a world-renowned Biblical scholar, Joseph did not have time to give Jesus a proper burial, which would include washing the body, anointing it with oil and then clothing and wrapping it.” \nIs that the way you understand Raymond E. Brown’s exegesis when the latter wrote:\n “(so) It gives the impression (Joseph did not have time)” irrespective of the fact “John has a more elaborate Judean (funerary) custom”.\n– Factually speaking, what then really makes YOU be so much assertive (“there was no time for the rest of the conventions”) as if it was a proven fact and there were no alternative conclusions ? Could you give me your exact time-frame for Yeshua’s “burial”, explain and demonstrate it, please? Could you also be more specific on which conventions exactly were done or not done?\n Reminder one: Irrespective of entombment on the same day of death (Dt 21:23), and sealing the tomb, the true fact is a full burial (whether speedy or not) included  three major stages to preparing the body for burial: washing (rechitzah, done indirectly with warm water, with or without anointing done with spicy oily perfumes), ritual purification (taharah), and wrapping/dressing (halbashah) in shrouds (with fresh flower heads placed (?) and/or granulized spices spread as the cloth is tightly wound/compressed around the body). The term taharah is used to refer both to the overall process of burial preparation, and to the specific step of ritual purification.   .\n  Actually, it looks more like a “some-rite” burial, because of the quantity of myrrh and aloes and statue of the two known members of the burial party-Joseph and Nicodemus. This in light of the Turin Shroud (white zigzag weave patterned shroud used for a Master of Torah or righteous man worthy to be placed in paradise) indicates that Yeshua was honourably buried in accordance with the already-documented Judeans requirements. He was speedily yet fully buried even if anointing could not be performed on the very day of his death as women were not allowed to grind granulized spices on Sabbath and mixed them with oil to form an ointment to rub on the body. \n  From the textual data, there is no reason to assume that the they regarded the burial of Yeshua as ‘uncompleted’ at all.\n  Reminder two: re whether the body was washed or not, the issue shall not be tackled from a modern viewpoint as the correct answer just depends on one’s capacity to archaeologically reconstruct the event (most likely a Judean burial) according to a specific purifying and drying ritual implying here shed innocent blood being kept/buried with the body.\n  Besides there was indeed some purifying/indirect washing with water of the body otherwise the TS shroud should be smudged or smeared. Cannot you discriminate between a linen cloth smudged or smeared with the blood and fluids of an unwashed bloodied body (e.g. the Oviedo Sudarium) and one which most obviously is not?\n  Reminder three: the wrapping in shrouds was DONE UNLESS YOU CANNOT READ GOSPELS KOINE/TRANSLATION GREEK and/or just keep being in denial of the philological facts. The “non-interpreted” nature of the physical details in the narratives seems trustworthy enough to consider the description of the burial as being true-to-fact. “They took the body of Yeshua and fastened/bound it with the ‘aromaton’ in linen cloths/shrouds, according to the burial custom of the Judeans” [John 19.40]. How long will you misleadingly assert Yeshua’s body was just loosely draped over while the Gospels accounts describe his body having been wrapped/tightly wrapped up/compressed/bound/fastened with ‘aromaton’?\n\n","date":"June 1, 2014 at 4:47 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126142","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"PS Had no taharah been performed on Yeshua, this would have been intended to waken G.od’s anger; to “prompt” Him to exact vengeance of the shed innocent blood for the terrible injustice committed by the Sanhedrin. Now at least two of the buriers were Sanhedrin members.\n\n","date":"June 1, 2014 at 5:16 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126149","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Max, you are hitting below the belly. That is something I do not like. My style, as you may have seen is blunt, and fair to whoever presents a convincing point of view, not mislead anyone, much on the contrary, backing any assertions with as much evidence as possible.\nI also dislike exchanges with broken records, with people chanting mantras, so allow me  to tell you once and for all:\n1) Father Raymond E. Brown was a great biblical scholar, the problem was that occasionally he could stretch his arguments beyond what could be justified. I think you have not read about what he wrote regarding Jesus’ burial, particularly the last stage.\n2) There is no evidence that Jesus’ body was “tightly wrapped”, repeat, “tightly wrapped” in the NT. “Bound” can mean be loosely wrapped. It seems you are insisting on this to further your hypothesis\n3) Why wrap a dead body so tightly when all of the conventions were not followed and the disciples had to return to do the rest on Sunday? Was there any danger of Jesus body falling apart? Was it cut to pieces?\n\n","date":"June 1, 2014 at 5:46 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126154","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Re Raymond E. Brown’s exegesis \n“(So) It gives the impression (Joseph did not have time)” though “John has a more elaborate Judean (funerary) custom”. See his book (French version), LA MORT DU MESSIE, pp. 1362-1363.\nWhat about your “NO TIME” mantra? Do you really think “an impression” is a proven fact as far as exegesis is concerned? This is misleading since you assert it. Where are YOUR proofs/facts? What about backing YOUR time-frame and time-markers as far as Yeshua’s burial is concerned? Which conventions were not followed? Can you answer my questions or cannot you?\nYou wrote “There is NO EVIDENCE (my upper cases) that Jesus’s body was tightly wrapped”. Really?\nRe the exact and respective meaning of the three koine/translation Greek verbs used in the Gospels to describe Yeshua’s burial:\n1/ entulisso MEANS “to wind/wrap”,\n2/ eneileo, “to COMPRESS, TIGHTLY WRAP”,\n3/ deo, “to bind,FASTEN”.\nThey are used in the conjugated form in the Gospels.\nNOW Could you refer me to the Gospels koine Greek verb meaning “loosely drape over” in conjunction with Yeshua’s burial, please?\n\n","date":"June 1, 2014 at 6:42 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126164","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Raymond E. Brown has Joseph burying Jesus in a criminal’s tomb.\nThere is no “loosely draped over” in the NT, and given that the disciples had to return on Sunday, they meant “entulisso.”\n\n","date":"June 1, 2014 at 6:54 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126168","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"What do you make of deo and eneilo? Nothing. Self-serving take and leave is no exegesis at all. Here it even verges on intellectual dishonesty.\n\n","date":"June 1, 2014 at 7:00 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126170","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Max, you are going a bit too far.\n\n","date":"June 1, 2014 at 9:15 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126183","author":"Dan","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"PS Louis, how do you fasten a body in shroudS with spices?\n\n","date":"June 1, 2014 at 6:58 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126169","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Max, where is the intellectual dishonesty? Wrapped with spices with strips of linen does not necessarily mean “tightly wrapped”. Why wrap tightly if all the conventions were not followed and the rest had to be done on Sunday?\n\n","date":"June 1, 2014 at 7:15 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126173","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Louis, \nthis is not a proven fact, just an interpretation contrary to philological facts. You totally overlook the verbs eneilo, “to COMPRESS, TO TIGHLY WRAP” used by Mark and deo , “TO BIND, TO FASTEN (in linen clothes/shrouds)” used by John. How can you be assertive Yeshua’s body was not compress, tightly wrap, fasten in shrouds at all when it is written in koine Greek in the Gospels?\nFor the third time, I am asking you: what conventions exactly were followed on Friday and on which  ground are you totally discarding the verbs to compress, tightly wrap, to bind, to fasten in shrouds ? For the third time, I am asking also you: what is exactly the time-frame for Yeshua’s burial and could you explain it? \nTo assert is one thing, to demonstrate is another. Can you demonstrate what you assert or cannot you? Waiting for you demonstration.\nReminder: the only procedure to follow on the 1st day of the week was JUST anointing (it is not written the women were to wash him and dress in shrouds at all.\n\n","date":"June 4, 2014 at 2:11 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126812","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Max\nWhat Greek translation are you using? Are you consulting Nestle Aland?\nI know we are not taking about facts,we are just speculating. I see no rationale in “compressing, to tightly wrap” if the body had to be unwrapped again for the rest of the rituals like washing, anointing with oil.\nObviously I have no time frame, but neither have you. The gospels tell us that the disciples were in a hurry, that’s all:\n1) Assuming Joseph of Arimathea was not around, he had to be found and told that Jesus had died\n2) Joseph had to go to talk to Pontius Pilate and request the body for a decent burial\n3) Pilate had to send centurions to the crucifixion site, who verified that Jesus had died\n4) The centurions had to go back to Pilate’s palace\n5) Relationship between the Jews and Romans was not easy. Pilate had to be careful, if he made a mistake it would be reported to Rome and he would lose his job. He must have questioned Joseph in order to be convinced that he was doing the right thing, perhaps even drawn out some document to defend himself just in case anything went wrong\n6) Nicodemus had to go to buy a burial shroud, or ask someone to buy it for him. People would be be more worried about getting the animals for blood sacrifice, no one would think about burial shrouds, given that it was the eve of Passover. The population of Jerusalem must have swelled, it would not be that easy to move around, perhaps causing more delay in getting hold of a burial cloth\n7) Joseph would have then have to go to the crucifxion site with the burial shroud \n7) The body would then have to be removed from the cross, wrapped in the burial cloth and taken to the tomb\nSo, philology aside, we can imagine the time it took to remove the body from the cross and lay it in the tomb.\n\n","date":"June 4, 2014 at 2:45 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126818","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"However the Shroud may have been wrapped at the burial, it should be quite simple to demonstrate why it was not wrapped tightly at the time of image formation.  All that is required is wrap a three dimensional rag doll, which is in reasonable proportion to the human frame, paint it with some transferable stain, then wrap it in a cloth to obtain an image.  The cloth may be otherwise treated how you might.  Dollars to donuts, you’ll never get an orthogonal image unless you pack the sides of the parcel with some kind of padding.  You’re more likely to get an image that shows the sides, and the image will also be distorted at the sides.  It won’t be an orthogonal image, John 19:38-40 notwithstanding!\n\n","date":"June 1, 2014 at 9:51 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126187","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"If the TS man’s body has never been  tightly wrapped up in his shroud(s), Louis, could you account for the following distortions, please:\n1/ the absence of a neck image along with recorded presence of chin lower area (vertical panoramicity) and that of the two squared ‘U’ shaped boxes framing up the Shroud face implying the presence of objects acting as partial screens?\n2/ recording of the slight lengthening of the right arm image and fingers on the right hand image (unusual long adducted-abducted arms of which rigor statuaries, “statuar rigidity” was counter-acted and seemingly long fingers on the right hand implying both dislocation and uneven stretching at the arm level)?\n3/ panoramic recording of the slight deviation of the fleshy tip of the TS man’s nose  (detected in the1970s)\n(reminder: in the mortuary/morgue, corpses with “skewed nose tip” are a well known fact. It is mainly due to having a corpse fit in in a zipped up body bag that was originally too small and and has caused excessive pressure on the defuncted’s face. This is additional evidence the TS man’s face was tightly wrapped up in his burial shrouds and not just loosely draped over)\n5/ panoramic recording of the left hips?\n6/ neat recording of the haematic cartography, front and back?\nCould you also account for the following absence of distortion when expected: \n1/ the non flattening of both calves and back?\nAlong with the recording of head slightly bent forward, curved back and legs bent with raised knees, all these recorded distortions do point in one direction: a volumetric recording of a moulded stiff rigid bloodied body with at least two slightly different body-to-cloth configurations (initial and final). \nDave, if there was no two slightly different body-to-cloth configurations (initial and final), “geometrically speaking” how do you account for the following distortions:\n1/ the blood rivulets FIRST appearing on the face and THEN as if on the hair.\n2/ some bloodstains appearing in the area of the back of the knees BUT no image while the very fact the small of the back is recorded despite marked lordosis?\nAnd how do you account for the extra inches around the buttocks with no body image and no blood imprint detected in the said area? \nWaiting for your replies.\n\n","date":"June 4, 2014 at 3:21 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126824","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Max, there are too many details which will need time for analysis and reply. This is a big problem. You have been harping on this issue for such a long time that last year I requested you to prepare a pdf and send it to Dan for uploading or send it to me c/o Dan if you are unwilling to disclose your e-mail address\n\n","date":"June 4, 2014 at 3:44 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126830","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Louis, you wrote:\n“I see no rationale in “compressing, to tightly wrap” IF (my upper cases) the body had to be unwrapped again for the rest of the rituals like washing, anointing with oil.”\nThis is an hypothesis not a fact (yet you first presented it as such!). There is an alternative. \nOn August 19, 2012 at 12:16 pm, I wrote:\n“In the Judean ethnic milieu of the time, the tradition was to visit the deceased on the three (or even seven) days immediately following his burial. Purification (with or without anointment) was part and parcel of the Judean burial rite. Anointment allowed preventing stench on those subsequent visits. Since it could not have been done on Friday, the women bought and prepared spicy oils to anoint Rabbi Yeshua after the Sabbath and come back to the tomb very early on the first day of the Judean week. They definitely had not to unwrap, wash the deceased’s naked body, anoint it and dress it in shrouds at all but just to anoint the linen wrappings as Yeshua’s body was ALREADY wound/compressed/fastened with ‘aromaton’ in (See the Gospels). Hence, to the sole exception of the anointment ritual, Rabbi Yeshua’s “primary” burial rite according to the Judean funerary custom of the Second Temple period could have been duly completed within a minimum of a two-hours-and-a-half time-frame.”\n“Obviously I have no time frame, but neither have you. The gospels tell us that the disciples were in a hurry, that’s all”.\nI do have a time-frame based on Hebrew markers, archaeoastronomy, Second Temple period Judean ethnic milieu (Talmudic literature) and the 4 Gospels (I even presented a paper on Yeshua’s burial time-frame in 1998). YOU have no time frame at all. \nReminder: speedy/hasty burials on the very day of death are part and parcel of Judean/Jewish funerary customs.  \nYou just keep asserting “the gospels tell us that the disciples were in a hurry, that’s all”.\nIs that all your alleged ” factual demonstration”. Are you kidding?\n\n","date":"June 4, 2014 at 4:33 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126836","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Max, your contentions take a lot more time to answer. See my previous message. If you are not an abstainer have a glass of Napoleon and calm down, I am sipping coffee now and then while working on translations.\n\n","date":"June 4, 2014 at 4:39 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126839","author":"Louis","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Reminder for Louis: anointing per se was/is allowed on Sabbath as long as you don’t move the deceased’s limbs. What is not allowed on Sabbath is to grind blocks of spices or granulized spices in order to make spicy perfumed oils.\n\n","date":"June 5, 2014 at 3:33 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126969","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"typo: as long as you don’t move the deceased’s body.\n\n","date":"June 5, 2014 at 3:34 am","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-126970","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Dissent of the day:  I’ll say one thing for Jones","post":"Sorry Max, don’t teach me about Biblical archaeology, and I think you now why. You keep on posting your thoughts in bits and pieces, refer to papers that are not to be seen, like the one you said was presented in 1998, and now you introduce “archaeoastronomy”.\nFor us to continue, put your papers in pdf in send it to Dan so that he can upload them or send them to me by e-mail care of Dan if you do not want to reveal your e-mail address. Another alternative is to post them on some Shroud website. OK?\n\n","date":"June 6, 2014 at 5:08 pm","url":"https://shroudstory.com/2014/05/25/dissent-of-the-day-ill-say-one-thing-for-jones/","cat":"carbon_14_dating","id":"comment-127375","author":"Louis","site":"shroudstory"}]
