[{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Here’s the problem with the whole issue of “contamination.” It depends on the definition. In common parlance, we think of mold, or spilled milk, coffee, stain, bioplasitc coating maybe insects debris. It some unintended chemical process. \nHowever, what Rogers found, and what all the contamination experts ignore, that what occurred with reweaving is NOT contamination as the word is commonalty understood. The reweaving process included new threads of cotton AND NEW THREADS OF LINEN (new being medieval). Cotton dyed yellow was interwoven and spliced with NEW threads of linen because linen does not dye well. \nMay I venture a statement which I would certainly like to see a rebuttal: how does new linen test older? If we were discussing mold or something like that (a coffee spill) that might be empirically demonstrable. But it is a semantic trick to call cotton spliced into new linen “contamination.”\nI really don’t have the time for a week or so to get into this. However, I really believe if someone is asserting that new linen interwoven in the Shroud samples would give an older date that the original linen, I really have to examine his data. I would suggest though what is needed is an examination of his definition.\nI must admit that the implication of Rogers finding new linen fibers didn’t really sink in at first, so if any scientists overlooked that then I understand. But if he/she  deliberately ignored that then shame on him/her.\nAlso, Only testing of the fiber samples from the sample area can answer the question. That was done by Rogers and the colleagues who he asked to review his work.\nMaybe Hugh or someone can advise us whether the his experts took into account the interweaving of dyed cotton with the new linen as a part of the repair which Donna Campbell has demonstrated from examination of the Oxford photograph. Pam Moon has described the repair process. It did happen. (Cited in my original post)\n\n","date":"March 22, 2015 at 7:28 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194013","author":"John Klotz","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Apply this reasoning to any of the three remaining photographs.  In the ventral torso mosaic, for example (on the cover of the STL program), most of the region from the neck up (blue/green) differs dramatically in color from that below it (red/orange). There are also blue/green splotches abutting the yellow/orange in the top left and bottom left of the photo.  Are we to conclude that the ventral portion of the Shroud is composed of a mixture of younger/older material?  \nI’ve never viewed the quad mosaic photographs as “meaningless”-the main assertion has been that these anomalies represent differences in chemical composition among areas of the cloth.  This is a very broad, ambiguous umbrella which includes the caveats that a) what these differences are is unknown & b) such differences are present in multiple regions of the cloth.  Where perhaps the tire strays from the road is that much attention, naturally, is drawn to the C-14 corner.  If one took a large piece of linen and spilled water on it (not the bottled stuff), burned candles near it, exposed it to the elements, stretched it, handled it by folding /unfolding it, incubated it in the dark, etc., would the mosaic be uniform?  Or does even a “pristine” swatch of linen show some variation in this type of analysis?  \nThe carbon dating area clearly looks different from the immediate area surrounding it.  Rogers performed chemical & microscopic analysis to expand on this.  There are other areas that also look different from each other, but these have never been examined in detail-obviously the C-14 area was of major interest.  I don’t think one can claim the Shroud was patched in the corner by an older piece of cloth just based on this-if anything it highlights caution in making a correlation where a cause & effect may or may not exist.  Irrespective, it doesn’t take away from the studies by Rogers.  Might simply be a case of true, true, unrelated.\n\n","date":"March 22, 2015 at 8:44 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194018","author":"Kelly Kearse","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"No, no, this juggling with words really won’t do. Let’s state the case more plainly. It has been clearly demonstrated by the most ardent authenticists that the radiocarbon dates get progressively younger the further they are from the corner itself. It has also been clearly demonstrated that photographically the radiocarbon corner is progressively more different from the rest of the Shroud the closer it is measured to the corner itself. Given this information, the more different the Shroud, the older the age. It’s a simple as that. Call it reweaving, call it added cotton, call it new linen, call it dye, gum, dirt or general grime, where the Shroud is different, the age is older. Whatever is responsible for making the corner different from the rest of the Shroud has the effect of making the Shroud date older than it is by AMS dating, and the correlation between the two is 99.93%.\nAnd Kelly, rather than look at the carefully selected crop of a Quad Mosaic shown above, look at the four whole images at shroud.com (http://shroud.com/gallery/index.htm), and decide why the whole of the top third of three of them is bright blue and the lower left hand hand corners of all of them are dark green before wondering about whether one particular corner in one particular image might be exceptional.\n\n","date":"March 22, 2015 at 10:32 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194027","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Hugh,\nNow that I have read Morgan’s papers I really comment it to every body. The illustrations are incredible. One factor I think you overlook that bottom 50% of the sample area (closest to edge) was kept as a reserve by Turin. It was not carbon dated. It would make a great deal of sense that was less new material on the upper edge where the reweave was integrated back into the main body of the Shroud. That’s is precisely what Morgan’s images show I believe.\n\n","date":"March 22, 2015 at 1:20 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194037","author":"John Klotz","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Exactly, John.\nWe, with Thibault and Joe, are currently working on the issue.\n\n","date":"March 22, 2015 at 1:39 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194038","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"I have to say that that message made exactly no sense to me.  The discovery of a correlation between two variables that ought not to correlate means there is something wrong with the sample which is what was to be demonstrated.  All the rest is sheer speculation.  I notice you don’t engage the data that shows positive results such as vanillin and the mechanical properties of linen.  They don’t fit your narrative?  Is that it?\n\n","date":"March 22, 2015 at 5:16 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194065","author":"rschneider42","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Dr. Ray Schneider made some interesting comments about this on another forum.  I asked him if would mind posting it to this blog.  He wrote:  “You certainly have my permission to post it if you think it contributes to a thread on Dan’s blog.”\nDr. Schneider presented a paper at the recent St. Louis conference.  The paper and video can be found at http://www.shroud.com/stlouis.htm.  Background on Dr. Schneider can be found at http://www.stlouisshroudconference.com/app-get-involved/presenters.\nIn his posting, Dr. Schneider wrote:  \n“I’m inclined to say that what it shows is that there is something quite profoundly anomalous about the whole C14 sample region and so no conclusion can be drawn from the C14 data with any reliability.\nThe details only get worse since there were so many anomalous findings in the area like dyes, binders, fibers of cotton interwoven into the material.  When you consider all the anomalies you have to say that the samples were from an area heavily contaminated with signs of manipulation.  Both the Blue Quad Mosaic and the UV-F show the whole area as anomalous.\nThat being said one doesn’t then jump off a cliff and suggest that therefore the samples show that the corner was older so the shroud was younger.  Rather the anomalies say this sample is unrepresentative of the object we are trying to date and no conclusions can be drawn, especially as we don’t have any idea why the area is anomalous.  What drove the underlying manipulation?  Why does the fluorescence deviate from the norm?\nI’m not one to salute C-14 dating as the be all and end all — as William Meacham has commented elsewhere based on C-14 datings he has done — only about 78% return a date compatible with other known dating markers.  This particular dating was not very scientific one either on the side of the church or on the side of the carbon labs.  They selected a terrible sample and only one.  Then it was poorly documented by both the church and the carbon labs given the importance of the test and the clear limitations of the sampling.  Then when the data showed clear inhomogeneity they didn’t say anything about it.  It had to be pointed out by others.  The extra Arizona sample was not dated and held back without comment.  The public comments of some of the individuals involved vested absurd confidence in C-14 dating and denigrated the provenance of the shroud without any apparent knowledge of other data that points to a much older date than the one determined.\nI personally think the whole thing was an embarrassment to both the church and the scientific community.”\nIn the email to me giving me permission to re-post here his comments he then added:\n“I think all the data shows the sample to be totally anomalous based on objective data.  It’s rather funny to then try to spin that into a narrative that the shroud is even younger than it dated.  Whatever that is, it isn’t science.\nMost people don’t really understand science very well.  One thing that is important to point out is that science only really works very well when you have control of all the variables.  Then you can explore the details with objective observations.  That’s what experiments are.  They are all about control.  Science works increasingly less well as the degree of control available deteriorates.  In the case of objects like the shroud there is very little control so to get totally convincing results is rather more difficult than with objects over which you exercise more complete control.\nThe accuracy of the C14 technology to measure C12 and C14 etc. is not in question.  The problem is always with surrounding aspects.  The assumptions which are often not mentioned and not really controlled include that we know the C14 concentration a priori, that there are no enrichment mechanisms in play (ion exchange that selects for C14 or something), no significant additive or substituted materials, etc. etc. etc.  These are all aspects of “control” and I think it is most disappointing that the labs didn’t document their samples and their testing better.  Since we have quite clear evidence of location based dating anomalies it would have been nice to be able to explore the data set at the sub-sample level.  But we can’t other than statistically.  The overwhelmingly confirmed conclusion is that there is something wrong with the samples.  No amount of handwaving will change that.”\n\n","date":"March 22, 2015 at 12:28 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194034","author":"Joe Marino","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"I’m spotting a bit of wriggling here, if I may say so. In his lecture at St Louis, Ray Schnieder, with a picture on the screen of the Quad Mosaic, the non-UV-F photo used by Morgan, and one of Morgan’s manipulations, said, “…99.9% for the average date and the UV fluorescence. That’s such a high correlation it strongly suggests that the date was produced by contamination that fluoresced.” Now he seems to be denying that the correlation means anything at all. Now he says: “No conclusion can be drawn from the C14 data with any reliability” and “I think all the data shows the sample to be totally anomalous based on objective data.” \nWhy has he changed his mind? From a 99.9% correlation to no correlation at all. From a “strong” suggestion that “the date was produced by contamination that fluoresced” to no such suggestion at all.\nAnd why does he think that “it’s rather funny to then try to spin that into a narrative that the shroud is even younger than it dated. Whatever that is, it isn’t science.” Really? All I did was extract a rigorously logical conclusion from the extraordinary precision of Morgan’s correlation and the detail of his photographic manipulations.  No “try”. No “spin.” No “narrative.” And that is Science.\nAnd I’m afraid I disagree with the new conclusion too. The radiocarbon data, including the Nature paper, and Remi van Haelst’s analysis, and Riani and Atkinson’s chronological gradient discovery, are far from meaningless. Statistics is a very adaptable set of tools, as all the statisticians well know. Evidence for the rejection of the medieval date, based on the data in the Nature paper, and any consideration of any difference between the sample corner and the rest of the Shroud, is wholly inadequate.\n\n","date":"March 22, 2015 at 1:49 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194040","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Hugh, I wouldn’t put too much weight in R^2 for linear regression based on just three points (which are in fact nothing but average values over some non-homogenous areas)\nThe matter is much more complex. There are other issues that should be taken into account.\nFor example, half of the Arizona sample was not dated…\nThis likely changes the true values of average z-score (Table 2 in Morgan paper) significantly -which means that the whole Schneider correlation is actually pointless.\n\n","date":"March 22, 2015 at 2:10 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194042","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"It’s interesting how Hugh wants to spin the data.  The fact of the matter is that a correlation coefficient that high is hard to obtain even with only three points unless there is some linkage.  \nAs for wriggling, my main wriggle is the problem presented with the word “contamination” — we don’t know why we get a linear correlation in C14 age measured from the edge of the cloth and we don’t know why we get such a good linear correlation coefficient from the fluorescence data.  Because that is so anomalous and unexplained it is primarily evidence that there is a serious problem with the sample.  So I certainly admit to making a less than precise use of the word “contamination” — but as I pointed out the actual conclusion I drew was that the sample was inappropriate being clearly anomalous and I pointed out the other problems with it.  \nSo I think it is altogether special pleading and not science to pretend on the one hand that the correlation didn’t mean anything and then on the other to suggest that it means the cloth is even younger than the carbon date.  I guess having your cake and eating it too is a Hugh Farey specialty.\nThe Carbon 14 date is anomalous.  The absence of vanillin is an indicator of a much older date and the additional tests of Fanti, while they need to be further validated, all point to a much earlier date.  So the magic C14 date is not the silver bullet that invalidates the shroud’s authenticity.  There is way too much evidence on the other side of things to bet on something as frankly problematical as this bizarre C14 date with it’s high Chi-square and demonstrable deficiencies.\nIf anyone is wriggling it looks like Hugh.  \nRegards, Ray\n—\nRay Schneider, PhD\nAssociate Professor Emeritus\nBridgewater College\n\n","date":"March 22, 2015 at 4:34 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194054","author":"rschneider42","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Well, that’s OK. No hard feelings. John Morgan’s fluorescence data was all based on an ordinary photo anyway (see below).\n\n","date":"March 22, 2015 at 4:42 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194055","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"I contacted Barrie Schwortz and talked with him about the John Morgan paper and he confirmed that the image was indeed from the Verne Miller UV-F data.  So I think we’ll have to roll back to the earlier point in the thread where we were talking about your preposterous view that just because there is a correlation in the sample region that correlates increased fluorescence with younger dates that it must mean the shroud as a whole is younger than the C14 date.   Sorry but that doesn’t follow.\nThe question really is why there is a correlation at all with a variable that should have no relationship at all with date, a better correlation than the Bryan Walsh result which showed a spatial correlation.\nApparently however, the standard of truth around here leaves something to be desired.  Cheers, –Ray\n\n","date":"March 22, 2015 at 9:46 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194085","author":"rschneider42","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"BTW Hugh I agree that I should have been clearer in my presentation at St. Louis since it wasn’t clear that it was the “contamination” that fluoresced since it was equally possible that some sort of phenomena suppressed the natural fluorescence of the cloth.  Of course the additional content of this overall thread now is claiming that the image was not even a UV-F image.  If that’s true I’m not sure it changes my conclusion but it would certainly change the interpretation of the data. –Ray\n\n","date":"March 22, 2015 at 5:25 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194067","author":"rschneider42","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"I’ll keep it simple with no wriggling.  The sample dated to medieval times.  But the sample has been conclusively shown to be anomalous.  Therefore it is meaningless in terms of dating the main cloth.  But Hugh still insists that the medieval date of the anomalous sample conclusively demonstrates that the main cloth is medieval.  So, who is wriggling, who is being scientific, and who is the one with an agenda?  Case closed!\n\n","date":"March 22, 2015 at 2:13 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194043","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Those who were responsible for sampling and testing should have done enough to do the proper sampling techniques, veryfying the internal and external contamination of the corner, rather than, now, skeptics of the shroud are trying their best to give all sort of explainations to justify the controversial results.\n\n","date":"March 22, 2015 at 5:11 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194061","author":"Sampath Fernando","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"“It would make a great deal of sense that was less new material on the upper edge where the reweave was integrated back into the main body of the Shroud. That’s is precisely what Morgan’s images show I believe.” Correct. In the image below (Morgan’s Fig. 12) the green area represents low fluorescence. Morgan says: “The area where the radiocarbon sample was taken is relatively dark, a fact that is not the result of dirt, image color, or scorching. The cloth is much less fluorescent in that area, brightening into more typical fluorescence to\nthe right. The photograph proves that the radiocarbon area has a different chemical composition than the main part of the cloth.” So the Arizona sample (top rectangle) contains less of this ‘different chemical composition’ than the Zurich sample below it, and the Oxford sample at the bottom, which appears to be almost entirely of ‘different chemical composition.’\n\nSo, as the Arizona sample is the youngest, the Oxford sample the oldest, and the overall correlation between the intensity of the fluorescence and the radiocarbon date of the samples is 99.93%, the conclusion is inescapable that any ‘different chemical composition’ has resulted in making the samples appear older, not younger, than they really are.\n\n","date":"March 22, 2015 at 2:18 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194044","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"For example, half of the Arizona sample was not dated…\nThis completely changes the picture.\nRepeat this before you want jump into hasty conclusions Hugh…\n\n","date":"March 22, 2015 at 2:23 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194045","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Fair enough, OK, then let us, with Morgan attempt to clarify the picture. Using k-means clustering, he managed to make the exact areas of contamination slightly easier to see. Here is his Fig. 13.\n\nAs you can see, even if only the left half of the Arizona sample was tested, it still shows a smaller proportion of Morgan’s “different chemical composition” than the Oxford sample.\n\n","date":"March 22, 2015 at 2:49 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194046","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"As you can see, even if only the left half of the Arizona sample was tested, it still shows a smaller proportion of Morgan’s “different chemical composition” than the Oxford sample.\nI know what you mean. I had been aware of before you raised this issue.\nBut first of all, we know that Oxford used the whole sample. Arizona only half, we don’t know about Zurich.\nThis makes a lot of options.\nAnd the contours of the samples on this picture do not correspond precisely with sample borders.\nAbout Morgan & Schneider: in Table 2 we have the mean of -3.9807 integrated over 298 pixels for Arizona (Area 1).\nAs we know half of the sample was retained , this mean that actual integrated area is ~ 150 pixels -thus the mean of -3.9807 is definetly false.\nThus the whole regression of Schneider is actually meaningles.\n\n","date":"March 22, 2015 at 3:01 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194048","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Hugh Farey wrote: “And Kelly, rather than look at the carefully selected crop of a Quad Mosaic shown above, look at the four whole images at shroud.com (http://shroud.com/gallery/index.htm), and decide why the whole of the top third of three of them is bright blue and the lower left hand hand corners of all of them are dark green before wondering about whether one particular corner in one particular image might be exceptional.”\nI did look at the four whole images at shroud.com, gallery index.  Note I said consider any of the remaining three-I simply chose one as an example.  I think you totally missed my point-I was not wondering whether one particular corner might be exceptional-quite the opposite, in fact!\n\n","date":"March 22, 2015 at 2:52 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194047","author":"Kelly Kearse","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Sorry Kelly, I misread your original comment. I think that except where there are visible differences in colour in white light, such as the Holland backing cloth and the much lighter Raes area, the different colours of the Quad Pictures are artefacts of the lighting set up, in terms of the intensity, the angle at which the light is striking (and reflecting off) the material and perhaps the equipment responsible for separating the light into its different components.\n\n","date":"March 22, 2015 at 3:07 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194049","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Unfortunately, daveb, as you know, although I can agree with your premises, I do not believe that your conclusion is valid. Anomalies do not render observations meaningless. That depends on the nature, quantity and value of the anomalies. About which we disagree, but to be fair to you, at least you have stuck to your guns.\nNor have I ever insisted that anything I have deduced is conclusive, as you not only know well, but which has irritated you intensely from time to time.\nWhat I have said was conclusive was the inference to be drawn from Morgan’s data, assuming his premises to be correct. I said this because he established a 99.93% correlation between the intensity of fluorescence of some parts of the Shroud with their radiocarbon dates. The wriggling is in the way those who whole heartedly agreed with his conclusion this morning are whole heartedly deciding that his views are meaningless this evening, when it was pointed out to them what Morgan’s conclusion actually meant.\nNow a new and special revelation! Morgan’s original photo is C14cornr2.jpg, which may be found at http://shroud.com/gallery/index.htm. It was taken by Barrie Schwortz and is captioned: “White light photograph of the Shroud, including the corner area where the c14 sample was taken in 1988.” In other words Morgan’s entire fluorescence paper is based on a white light photo with no fluorescent component whatsoever. Any differences he observes in the radiocarbon sample area are due to variations in ordinary reflected white light and have nothing to do with the fluorescent characteristics of different chemicals.\nTee hee. I bet that causes a bit more wriggling…\nNow, when John Klotz said that it was a pity skeptics largely ignored all the scientific evidence, and I said that no, it was the authenticists who did that, was I right or was I right? !\n\n","date":"March 22, 2015 at 3:48 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194052","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Actually if that is true so that Morgan’s data is on a regular photograph it would still be bizarre that it correlates better than the Brian Walsh correlation.  The non uniformity of the lighting has been discussed by Barrie in the matter of the Blue Quad Mosaic and similar non-uniformities occur in the backlite images.  Perhaps we’re just looking at a proxie for distance from the edge of the shroud.  That would explain the correlation but not the degree of correlation  If this is just a measure of reflectance instead of fluorescence then it is still peculiar that it correlates so well.  If your identification of the photograph as incorrectly communicated to Morgan then it merely changes what was measured from fluorescence to reflectance and everything else applies.  Why do we get such an excellent correlation?  Riddle me that!   — Ray\n\n","date":"March 22, 2015 at 4:46 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194056","author":"rschneider42","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"rschneider42:\nRemember whar I wrote above:\nAbout Morgan & Schneider: in Table 2 we have the mean of -3.9807 integrated over 298 pixels for Arizona (Area 1).\nAs we know half of the sample was retained , this mean that actual integrated area is ~ 150 pixels -thus the mean of -3.9807 is definetly false.\nThus the whole regression of Schneider is actually meaningles.\n\n","date":"March 22, 2015 at 4:49 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194057","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"I think I checked that when I did the original correlation but I don’t recall.  So what you’re saying is that because you think half of area one was reserved.  The impression I is that the part that was reserved was from the second Arizona sample.  In any case I don’t think that claim justifies dismissal of the observed correlation.  This is doubly true if in fact the sample is a reflectance image and not a fluorescence image.  \nFrankly I think the fact of the anomalous character of the sample has been demonstrated in spades not only by these observations but by the many others.  So this discourse even if it were true would not change the conclusion. –Ray\n\n","date":"March 22, 2015 at 5:43 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194071","author":"rschneider42","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"O.K.\nSee the response to question 13, reference 30 about the Arizona sample:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\nMy view is that the 1988 results may have been skewed either because of reweaving or contamination. The greatest mystery, however, is image formation, as the interview demonstrates, and that is something that the laboratories cannot explain.\n\n","date":"March 22, 2015 at 5:03 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194059","author":"Louis","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Thanks, Louis, I have read it before, so you don’t have to wave it in front of my eyes ;-)\nExcellent interview.\n\n","date":"March 22, 2015 at 5:17 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194066","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Your’e welcome, O.K. It was just to draw your attention to what was written about the Arizona sample, reference 30.\nThe mystery of image formation continues. Continue with your good work on the images, all of us need to see it.\n\n","date":"March 22, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194068","author":"Louis","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"rschneider4:\nThe impression I is that the part that was reserved was from the second Arizona sample.\nNo,there were two retained parts -Arizona 2, and half of the Arizona 1. See https://shroudstory.com/2013/11/10/the-mysterious-arizona-piece/\nIn any case I don’t think that claim justifies dismissal of the observed correlation.\nIt fully justifies dismissal. Simply, the input  values do not reflect reality.\nFrankly I think the fact of the anomalous character of the sample has been demonstrated in spades not only by these observations but by the many others. So this discourse even if it were true would not change the conclusion. –Ray\nI can agree with that.\n\n","date":"March 22, 2015 at 6:15 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194074","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"I verified that you’re right about some fraction of the initial sample being reserved.  It’s not clear that it was half however.  That certainly is a likely modifier to the significance of the correlation although it doesn’t make it meaningless only somewhat less meaningful in my judgment.  It would have been nice if the carbon labs had been more transparent and accurate about how they managed the samples.  It would reduce the confusion.  The question becomes which half and how big an effect would be produced?  This is probably impossible to pin down.  — Ray\n\n","date":"March 22, 2015 at 10:02 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194088","author":"rschneider42","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"I’m sorry to disagree with Barrie, but the photo used by John Morgan looks nothing whatever like anything published by Miller and Pellicori, from which it differs substantially in colour, size, resolution and camera position, and it looks very like a photo taken by Barrie, which it closely resembles in colour, size, resolution and camera position.\n\nEarlier on this site Barrie said that he did not think any UV photos were taken other than from the elaborate set-up Miller and Pellicori devised for the taking of them, from which Morgan’s photo clearly deviates.\nI  very much look forward to clarification.\nIn the event of my being wrong, then we’re back to the inescapable conclusion that the high correlation between fluorescence and age strongly suggests that the date was produced by contamination that fluoresced, such that the more the contamination, the older the date.\nHowever Paolo di Lazzaro makes a valid point that any of these photos may only illuminate surface discrepancies, independent of any deeper interpolation, so that while on the surface it appears that the more the contamination the older the Shroud (to 99.93% reliability), underneath it may be that the more the interweaving the younger the Shroud.\n(Did I hear Colin and Andrea say “special pleading”? Perish the thought…)\nAs for the pieces of Arizona radiocarbon sample which were not used, the long thin one has disappeared into the estate of Prof. Donahue, I believe, and the other, photographed by Barrie, can be easily positioned…\n\nAs you can see, the area (divided into four) actually tested by the Tucson lab was the least different from the rest of the Shroud.\n\n","date":"March 23, 2015 at 3:34 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194109","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Hugh, I confess that I haven’t been able to follow most of this discussion.  But I’m looking at the enlarged black and white photo at the bottom of your comment.  The darker patch on the right (above the 0 – 1 inch marks on the ruler) seems to be a different weave from the patch to the left.  So what does this mean?\n\n","date":"March 23, 2015 at 6:57 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194122","author":"Julian Stroh","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Sorry Julian, I should have captioned it. The brown picture in the background is the Shroud Scope image of the radiocarbon corner. Because it was taken in 2002 there is only a a space where the sample was cut. The black-and-white picture is of the Shroud just before the sample was cut, with the steel rulers in place. I have positioned it in exactly the right place over the Shroud Scope image. The pale piece on the left of the Shroud Scope photo, and the plain weave side on the left of the black-and-white photo, are the backing cloths. It should be noted that the old Holland cloth (on the black-and-white photo) was replaced in 2002, so they are not the same material.\n\n","date":"March 23, 2015 at 8:05 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194126","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"And the little yellow piece overlaying them all is the Tucson piece still in the possession of the University of Arizona, as photographed by Barrie Schwortz. If you enlarge your screen you can see it more clearly.\n\n","date":"March 23, 2015 at 8:07 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194127","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"I could hardly believe what I was reading on this post «Non-authenticists, on the other hand, have studied them in considerable detail, such that we can say with authority that any contamination of the radiocarbon corner of the shroud made it appear older, not younger, than it really is»\nTank God this misleading skeptic claim has been absolutely debunked by qualified commenters of this blog like Professor Ray Schneider,, O.K.,Daveb and Dr. Thibault Heimburger..\nIn a previous post on March 20  «John Klotz delivers the knockout», Dr Thibault Heimburger has writen a thorough explanation on this skeptic claim from which I recall\n« No Hugh. Morgan’s paper has nothing to do with the amount of ‘contamination’ of the C14 corner. It has to do with the surface chemistry as shown by the UV-Vis fluorescence photograph. »………..\n«You are confusing surface contamination (likely Rogers’s dye, which has been eliminated by the C14 standard cleaning procedures) and “contamination” of the fabric itself by “new” pieces of threads.»\nFor most of Shroud researchers seeking the truth what matters can be summarized as folows:\nThe Quad Mosaic study and Dr John Morgan’s  study on U.V. Fluorescence photograph digital image processing , concludes that the area of the Shroud that was cut for the 1988 radiocarbon sample HAD A SUPERFICIAL CHEMICAL COMPOSITION DIFFERENT FROM THE  REST OF THE SHROUD (and neighboring areas).AND THAT’S BECAUSE A DYE HAD BEEN APPLIED  by the artisan who has cunningly woven the so called invisible mending\nThe color cannot be assigned to anomalous C14 enrichment from the new threads.\nThus these studies are further pieces of evidence to support the theory that 1988 radiocarbon sample dating is invalid because it was cut from an «invisible» mediaeval repair\n                                                                    Antero de Frias Moreira\n                                                           Centro Português de Sindonologia\n\n","date":"March 23, 2015 at 1:58 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194167","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Correction  Thank God\n\n","date":"March 23, 2015 at 2:00 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194168","author":"Antero de Frias Moreira","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"For the record, I don’t for a second believe Hugh is trying to mislead anyone. Hugh sees the data and argument differently and he argues from that position. It is a sincere position and not one without some foundation. Personally, I thank God for intelligent, reasonable, skeptics like Hugh – for without whom the Shroud discussion would be an echo chamber filled with unsubstantiated assumptions.\nThe Devils’ Advocate, if you will, serves God too.\n\n","date":"March 23, 2015 at 2:54 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194171","author":"David Goulet","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"“Thank God this misleading skeptic claim has been absolutely debunked by qualified commenters of this blog like Professor Ray Schneider, O.K., Daveb and Dr Thibault Heimburger.”\nWell that’s not true, is it? Who was it who said in front of a crowd of eminent Shroud scholars not one of whom disagreed with him: “…99.9% for the average date and the UV fluorescence. That’s such a high correlation it strongly suggests that the date was produced by contamination that fluoresced.” All I did was point out an incontestably logical corollary to this statement, and look what happened. It was not my claim, it was an thoroughly mainstream authenticist one.\nAnd suddenly it was all wrong. The correlation did not suggest that the date was produced by contamination at all. There was no such correlation, the correlation was fortuitous, the fluorescence did not demonstrate contamination, the contamination was superficial, the date had nothing to do with the contamination, Morgan was wrong and Schneider was ‘meaningless.’ How curious that none of this was noticed earlier, but only when a comfortable support to the ‘new material incorporation’ hypothesis suddenly turned out to be no such thing. If anything has been debunked, it is not a ‘misleading skeptic claim’ but a misleading authenticist blunder.\nWell, never mind. I don’t believe Morgan’s photo was a UV one anyway. However, I must be straight here and say that Barrie Schwortz completely disagrees with me. He is quite confident that it is a UV-F image and not a white light image. And to disagree, on a question of photography, with STuRP’s official photographer who was present at the time, is quite a foolhardy thing to do! All I can do is to show you why. Here is Vern Miller’s published 1978 UV photo of the ventral legs, and Morgan’s starting image, accurately positioned on a backdrop from Shroud Scope. As I said to Barrie, if the two are commensurate I’m a monkey’s uncle!\n\nBut if I’m wrong, and there are other UV-F photos of this quality lying around somewhere, then who is hiding them and why? What don’t they want us to know?…\n\n","date":"March 23, 2015 at 4:03 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194178","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Hugh\nI wrote yesterday what follows in another thread: \n‘Hugh: “Claim: “We can say with authority than any contamination of the radiocarbon corner of the shroud made it appear older, not younger, than it really is.” This is based on John M. Morgan III’s paper ‘Digital image processing techniques demonstrating the anomalous nature of the radiocarbon dating sample area of the Shroud of Turin’ at http://www.academicjournals.org/article/article1380798975_Morgan.pdf, where he shows that the radiocarbon samples are increasingly contaminated the closer they are to the corner….”\nNo Hugh. Morgan’s paper has nothing to do with the amount of ‘contamination’ of the C14 corner. It has to do with the surface chemistry as shown by the UV-Vis fluorescence photograph.\nThe problem comes from the term ‘contamination’.\nWhat Morgan demonstrated is:\n1) that the mean surface chemistry of the C14 sample/region is truly (statistically) different from the surface chemistry of a typical TS neighboring area.\n2) that the mean surface chemistry of each of the Arizona #1, Zurich and Oxford samples is truly (statistically) different from the surface chemistry of a typical TS neighboring area.\n3) that there is an almost perfect correlation between the calendar C14 age of a given sample (Arizona#1 etc..) and the surface chemistry as measured by the z-score in the UV-Vis image.\nIt means ONLY that the surface contamination of Arizona1 is smaller that the surface contamination of Oxford.\nSurface chemistry (UV-Vis photograph analysis) is likely correlative to the Dye found by Rogers (as Morgan wrote), NOT to the composition of the fabric itself.\nTherefore, I completely disagree with your claim: ” “We can say with authority than any contamination of the radiocarbon corner of the shroud made it appear older, not younger, than it really is.”\nYou are confusing surface contamination (likely Rogers’s dye, which has been eliminated by the C14 standard cleaning procedures) and “contamination” of the fabric itself by “new” pieces of threads.\nI hate the word “contamination”.\nYour answer might clarify the argument.\n\n","date":"March 23, 2015 at 4:54 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194183","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"I did indeed see your posting, Thibault, and agreed with it. The 99.93% correlation turns out to have nothing to do with the date. But it was not I who made the claim in the first place. All I did was explain the claim put forward by Ray Schneider. It was he who claimed with authority that any contamination of the radiocarbon corner of the shroud made it appear older, not younger, than it really is, only he didn’t realise it when he said it! And why did he not know what he was saying? Because, as I said just before I dropped the bombshell, and in order to counter the slightly petty remark that scientific papers “are largely ignored by skeptics”, “these studies are in fact largely ignored by authenticists, in that they are assumed correct and quoted as gospel without any reference to what they actually say.”\nAll you have to do now is to explain how the C14-dated piece of Shroud furthest from the Raes corner (the Arizona samples) contained less of the original Shroud than the piece closest to it (the Oxford sample). Or to take daveb’s reasonable but statistically unsound view that because there is a hint of variation across the sample area, that all the C14 dates are wholly meaningless.\n\n","date":"March 23, 2015 at 5:26 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194186","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"“daveb’s reasonable but statistically unsound view that because there is a hint of variation across the sample area, that all the C14 dates are wholly meaningless.” ????   \nReasonable and NOT statistically unsound!!! \nYou still do not get it!  And the reason for meaninglessness actually has little to do with the variations across the sample area!\nTo my mind the only significance in these variations are either a) the labs operate to different standards in their procedures; Or b) the very small sampling area itself is not homogeneous; Or c) Both (a) and (b)!  It is then clearly a glaring statistical error to infer from these data that the Shroud is so uniformly homogeneous, that any further representative sampling is redundant, and that an induction on the age of the TS can be made based solely on the extant samples. \nThe Principal Reason why I say they are meaningless, is because the sampling area is anomalous to a degree that cannot now be determined;  not merely by known contaminants, such as those identified by Rogers and Raes and others;  But more significantly because it cannot now be determined to what degree new linen may have replaced the old !  It does seem that some attempt was made to disguise new linen to match the older linen.  Any such anomaly would not be resolved by any decontamination procedure used by any of the laboratories.  They were dating new linen!\n\n","date":"March 24, 2015 at 1:45 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194235","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"‘They were dating new linen’.\nThat’s an interesting perspective.  The assumption from skeptics seems to have been that although there is material contamination the material is still predominatly linen. Then the assumption is the predominant linen is original ie. Of the same age as the greater shroud.\nbut correct if I am wrong Daveb you are suggesting even the linen in the sample is an add on?\n\n","date":"March 24, 2015 at 2:19 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194238","author":"Thomas","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Rather like authenticists, Thomas, non-authenticists have a variety of views. The bottom line is that in order to achieve a radiocarbon date of 1350 you either have to have material of 1350, or a blend of materials that together give 1350 (barring exotics like nuclear bombardment). If you stipulate that some of that material must be 1st century, then the proportion of material from after 1350 can be easily calculated, and comes to about two-thirds.\nAs I understand it most authenticists accept that this cannot be achieved by Rogers’s gums and dyes, or any kind of cotton fibre contamination floating in from above, but must imply a substantial replacement of the linen threads by new threads. The suggestion is that the new threads were also linen, but can be distinguished from the older ones by a) their vanillin content, b) their cotton intermixture content, and c) their coating of dye. This last has now been discounted as a factor in C14 dating.\nThe problem authenticists have now is to demonstrate how these new threads can be totally invisible to the naked eye, when every thread can be fairly easily followed across various photographs from one side to the other. Invisible mending is obvious under these magnifications, as the new threads lie alongside the old threads for some distance in order for them to have any grip, and there is no sign of it. So we are left with the bizarre “splice” hypothesis, in which old threads and new are unravelled and twisted together (and maybe glued in place), so that when the threads are rewoven there really are no overlapping ends. I say bizarre because this is postulated to have occurred over a length of only a few millimetres, in order to produce a thread which is only a few millimetres longer. The only observed instance of it was by Robert Villarreal, whose thread of only a few millimetres fell apart neatly into two pieces which weren’t ‘spliced’ at all, but simply glued together.\n\n","date":"March 24, 2015 at 3:19 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194240","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Thanks Hugh. There seem to be some issues there!\n\n","date":"March 24, 2015 at 3:34 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194242","author":"Thomas","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"The use of new linen fibers in the sample area was a finding by Ray Rogers. The fibers probably came from Holland where the material for the “Holland” cloth came from. (not at the same time). The variations in the results of the three labs reflects the fact that any given part of the samples would have three constituents: original fiber, new fibers and cotton inter woven with the new fibers and dyed yellow so that the new fibers would match the old.\nThat is not any bright idea of mine or Daveb, it’s what Rogers found and the scientists, with whom he collaborated, concurred.\nThe corner of the Shroud from which the samples came was one clutched by the bishops when the Shroud was displayed. What Pam Moon did in  her 2014 paper is put into perspective the known documented  work of Valfre in repairing frayed parts of  the Shroud.\nI was stunned when observing the photographs in the Donna Campbell 2014 paper by how clearly the evidence of repair in the Oxford sample emerged, including black threads which Valfre used which upset the Poor Sisters of St. Clare who  to this day have a special relationship to the Shroud and were actually hovering in the background as STURP did its work in 1978. Undoubtedly, some of this “contamination” was removed by the labs in preparing the sample for incineration which is how the tested carbon was created.\nI am also stunned by the ferocity of the skeptics who seem to ignore the findings of Rogers, Villarreal and the photographs of John Brown.\n\n","date":"March 24, 2015 at 4:45 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194250","author":"John Klotz","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"And Hugh, where is the evidence of “glue’? Could you cite a paper for us?\n\n","date":"March 24, 2015 at 4:47 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194251","author":"John Klotz","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Dyes and gums etc would not be added to a particularly vulnerable corner of the TS, without a purpose.  The inference has to be an intention to disguise in order to match the main cloth.  As early as 1973, Prof Gilbert Raes had noticed differences in the two pieces given to him.  Not only was cotton (gossypium herbaceum = ME origin) present in Piece 1, absent in Piece 2;  But there was a size difference in the threads.  [Thread size is measured in “tex” = grams per km]  (As I understand from Thibault, he discovered cotton was interwoven with linen threads.)   \nThe warp threads were a near but not exact match:  Piece 1 = 16.3 tex; Piece 2 = 18 tex;\nThere was a more significant difference in the weft threads:  Piece 1 = 53.6 tex;  Piece 2 = 73.1 tex. \nI would presume that Raes took what he considered to be representative values, or they may be some kind of average.  The original linen threads would be hand spun, and so some variation might be expected.  But the weft difference seems significant to me.  As the corner was vulnerable from handling during expositions, the decision may have been taken to replace or add-in some new linen threads. \nThe give-away is the fact that dyes and/or lakes were used to disguise at least some of the material.  There is much more about this in the literature.  But we cannot now know to what extent any new linen was added, which is why I assert that the radiocarbon dating is meaningless in terms of the age of the main cloth.  In fact the only inference that might be made, is that the anomalous area would have to be more recent.  The contamination by non-linen material.and the surface chemistry, is in itself merely incidental to the age determination,.and was quite likely removed by the pre-treatment for the tests.\n\n","date":"March 24, 2015 at 4:00 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194245","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"HF: “If you stipulate that some of that material must be 1st century, then the proportion of material from after 1350 can be easily calculated, and comes to about two-thirds.” \nThat would seem quite arbitrary to me, and it must depend on when the additional material was added in.  For example, if say the material was added in only a year ago, then I should think the proportion would be very much less than two-thirds.  \nMarino & Benford speculated that repairs were carried out by the Dowager Duchess of Savoy, Margaret of Austria, the same whose silver casket melted in the 1532 fire damaging the cloth.  In view of the Poor Clares’ preoccupation with sowing patches over the burn holes, it might be thought that any worn corner would attract less attention.  A problem with suggesting an earlier date, is the presence of vanillin, which would be expected to be lost in the fire. \nPossibly a more likely candidate for the intrusion, is Princess Clotilde after the 1868 showing.  She personally replaced Valfre’s black silk lining with a red one.  Interestingly for some reason, the 1868 showing was the last one where it was held by five bishops, and thereafter it was always shown in a frame.  One could speculate as to what reasons prompted this change.  \nCertainly around 1870 the resources and skills were available to the House of Savoy.  What does one make of the two-thirds proportion now?  Calcs anyone?\n\n","date":"March 24, 2015 at 5:31 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194254","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"That would seem quite arbitrary to me, and it must depend on when the additional material was added in. For example, if say the material was added in only a year ago, then I should think the proportion would be very much less than two-thirds. \nNot much less. There is a strict mathematics behind that and depending on exact date of repair, the amount of new material should be no less than about 66 % (75 % if repair was made in the 16th century). \nHere you have a callibartion curve:\nhttp://depts.washington.edu/qil/datasets/uwten98_14c.txt\nAs you can see, due to the variations of amount of C-14 in atmosphere, the C-14 date for the last 300 years (since around 1660) oscilates at around 100-200 years BP. \nThis makes carbon dating of artifacts younger than 300 years pointless.\nAt about 100 years BP we obtain the necessary proportion of about 66 % (two thirds). At about 300 BP the proportion is around 75 %.\nThat’s the greatest obstacle for any theory attempting to explain why the 1988 datings were skewed.\n\n","date":"March 24, 2015 at 5:53 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194259","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Hugh, you wrote:\n“As for the pieces of Arizona radiocarbon sample which were not used, the long thin one has disappeared into the estate of Prof. Donahue, I believe, and the other, photographed by Barrie, can be easily positioned…”\nCan you explain and clearly demonstrate why Jull’s sample is positioned where it is in your picture ?\nBecause, I disagree.\nI would like to compare your demonstration with my own thoughts.\nMaybe, am I wrong ?\nThanks.\n\n","date":"March 23, 2015 at 5:13 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194184","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"I’ll do my best, Thibault, but it might have to wait till tomorrow…\n\n","date":"March 23, 2015 at 5:28 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194187","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Can it be fair to say that these images have more to do with differential analysis vs. chemical analysis. And if so, any conclusion derived from this analysis, is speculative. However,in fairness, it may have merit with further studies.\n\n","date":"March 23, 2015 at 8:19 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194199","author":"Giorgio HSG","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Hi Giorgio\nYou’re right. Also note what Hugh said above:\n“However Paolo di Lazzaro makes a valid point that any of these photos may only illuminate surface discrepancies, independent of any deeper interpolation, so that while on the surface it appears that the more the contamination the older the Shroud (to 99.93% reliability), underneath it may be that the more the interweaving the younger the Shroud.”\n\n","date":"March 23, 2015 at 8:25 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194200","author":"Louis","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"“The skeptics who seem to ignore the findings of Rogers, Villarreal and the photographs of John Brown.” Seem to ignore? Not again! I think I have written more detailed and more lengthy studies of all these worthies than all the authenticists put together. As I commented in my initial response to the first time this canard was trotted out, it is the authenticists who ignore them, in that they grab what seems to be a general conclusion without reading what the authors say. A case in point seems to be John Klotz’s inquiry about the ‘glue’ which seemed to stick the two halves of Robert Villarreal’s cotton thread together. If he had ever actually listened to Robert Villarreal on ‘Shroud of Turin Ohio State University Villarreal Lecture Part 3 of 5’, at https://www.youtube.com/watch?v=9kBpplTK044 he would know more about it than he does.\nNow, Thibault. Here is my take on how to fit the various photos of the radiocarbon samples into position in their original places. They don’t fit perfectly – in fact the Zurich sample is a real discrepancy – but I think it’s an intelligent start. I should be very grateful for your comments.\n\nAnd finally daveb, here is a chart showing how much material must be added to a 1st century sample to produce a 14th century date, for various different centuries.\nDate of intrusion: Proportion of intruded material\n1350     100%\n1550       86%\n1750       73%\n1950       67%\nI’ve no doubt this comment is merely a reminder to all the deeply investigative authenticists who really knew it all already, and do hope it enlightens all the skeptics who continue completely to ignore all the evidence….\n\n","date":"March 24, 2015 at 7:29 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194266","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Fine, Hugh, I commend you for your inquiry.\nBut this makes more questions then answers.\nIn fact, your placement of the Jull sample (I checked it independentyl, and seems correct) scores own goal… at least for Jull.\nI will try to explain that later, but first I would like to hear Thibault’s opinion on that matter. I sent him and Joe (in private e-mail) some of my thoughts on that, and I won’t go into hasty conclusions, before they express their opinion.\nBecause the matter is grave  serious.\nOther issues.\nYour calculation of percentages, Hugh, is incorrect.\nBased on http://depts.washington.edu/qil/datasets/uwten98_14c.txt\n25 AD =1983 BP\nThe 1988 result =691 BP\n1535 AD =301 BP\n1695 AD=115 BP\n1865 AD =117 BP\nDate of intrusion: Proportion of intruded material\n1535 75%\n1695 67%\n1865 67 %\n1950 (0 BP) 62 %\nThe correlation between Z-score and age:\nAs you can see on the picture below, the Z-score on Morgan’s Fig. 12 has clear linear, geometrical pattern -due to the triangle like shape of that stain\n\nAs we know, there is a correlation between average age of the samples, and distance from the edge. This has been shown by Walsh.\nAs triangular shape of the Z-score fluorescence also is related (geometrically) to the distance from the edge, then the apparent anticorrelation between the age of the samples and average Z-score is actually trivial and adds nothing to our knowledge.\nYou cannot use correlation tool in brainless way, and say, “there is correlation” so this and that automatically must be true. This is the fundamental mistake many poor scientist commit.\n\n","date":"March 24, 2015 at 9:11 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194271","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"And BTW: this photo above does not show the full lenght of C-14 sample -it should be about 1-2 cm longer, further from the edge.\n\n","date":"March 24, 2015 at 9:23 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194272","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Thanks Hugh,\n” I should be very grateful for your comments.”\nYes I agree with you about the position of Jull’s sample (I used another method).\nMore later.\n\n","date":"March 24, 2015 at 4:28 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194302","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"“Your calculation of percentages, Hugh, is incorrect.” Dangerous words. Your use of a calibration table from 25 years ago is quaint, but I use OxCal, which uses the latest (2013) refinement to convert BP to Calendar dates and vice versa, and http://dwb4.unl.edu/Chem/CHEM869Z/CHEM869ZLinks/www.all.mq.edu.au/online/edu/egypt/carbdate.htm to convert years BP to a percentage of C14 and vice versa. Also I used 50AD (1950BP) rather than 25AD (1980BP) as my 1st Century standard. The differences are minor, but I believe my calculations are as correct as your own.\nAnd as for: “You cannot use correlation tool in brainless way, and say, “there is correlation” so this and that automatically must be true. This is the fundamental mistake many poor scientist commit.” It is, isn’t it. How true. I would never dream of being so incompetent. I was quoting, verbatim, from a Professor Emeritus of Mathematics…\n\n","date":"March 24, 2015 at 1:16 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194284","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"“Your calculation of percentages, Hugh, is incorrect.” Dangerous words. Your use of a calibration table from 25 years ago is quaint, but I use OxCal, which uses the latest (2013) refinement to convert BP to Calendar dates and vice versa, and http://dwb4.unl.edu/Chem/CHEM869Z/CHEM869ZLinks/www.all.mq.edu.au/online/edu/egypt/carbdate.htm to convert years BP to a percentage of C14 and vice versa. Also I used 50AD (1950BP) rather than 25AD (1980BP) as my 1st Century standard. The differences are minor, but I believe my calculations are as correct as your own.\nGotcha, Hugh. I know what you are doing wrong.\nI checked, OxCalc callibration curve is similar to that Stuiver et al.\nBut your use of that online calculator is mindless. This is actually primitive tool, that (contrary to what you think), does not convert AD/BC dates  into BP dates.\nI put the following data into it:\nThe original 1st century date -1900 years (50 AD)\nThe 1550 AD -400 years\n1350 AD -600 years.\nResult: 85 %\n1750 AD -200 years\nResult: 75 %\n1950 AD -0 years \nResult: 67 %\nWith the very respect, Hugh, but have you really thought that i won’t find an error?\nThis is nothing personal. I really have a high respect for you. But you simply make mistakes, like everyone.\nNevertheless, I really think you are a very promising Shroud researcher. More promising than many “stars” in the Shroud world (no matter pro or const authenticity).\nHow true. I would never dream of being so incompetent. I was quoting, verbatim, from a Professor Emeritus of Mathematics…\nTruly,mathematics doesn’t interest whether one is Professor of it, or someone who failed all the exams and now is cleaning streets. It is interested only whether one is right or wrong in his/her reasoning.\n\n","date":"March 24, 2015 at 2:33 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194293","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"It could come down to this. The section that was tested was correctly dated to the medieval period because it was indeed entirely medieval linen. Not spliced, not contaminated — pure medieval linen. BUT, here’s the problem – was it part of a much broader patch. Maybe the ‘invisible’ mending is along a boarder encompassing a much larger area than we are assuming.\nThis is why until the entire relic is restudied with non-destructive methods and the true boundaries of its homogeneity can be discerned – we are spinning our collective wheels.\n\n","date":"March 24, 2015 at 1:26 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194286","author":"David Goulet","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"“A border encompassing a much larger area than we are assuming”:\nThis is claimed in the following recent interview, however we must wait for a paper:  https://www.academia.edu/8841978/Professor_Giulio_Fanti_discusses_the_controversies_in_the_realm_of_Shroud_studies\nThe protocols drawn by Professor Carlos Chagas of the Pontifical Academy of Sciences in 1988 were discarded by Professor Luigi Gonella, presumably with the permission of his boss, Cardinal Anastasio Ballestrero of Turin, the relic’s papal custodian. The several samples were to be cut from the border, not away from the border.\nIf the suspicion is confirmed, Archbishop Cesare Nosiglia will have another item added to the list that should be presented to him. Any examination, however, will have to be made with Dr. Mechthild Flury-Lemberg and another expert to avoid controversy.\n\n","date":"March 25, 2015 at 8:36 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194359","author":"Louis","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Very interesting article. Thanks, Louis.\n\n","date":"March 25, 2015 at 9:09 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194361","author":"David Goulet","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"You are welcome, David. You may also like an even more recent interview on the highly complex image formation process, demonstrating that painting, scorch, printing and, in my view, the Maillard reaction, can be ruled out:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\nAllow me to also tell you something more about what we discussed on another thread: “a distinctive 1st century weave”:\nI respect both professors Tabor and Gibson, the latter having dismissed both the James ossuary and Jesus family tomb. While the former has apparently ceased to be Christian, the latter is a sceptical and secular Jew. So what happens? The tendency one detects is the one where personal beliefs are imposed on the evidence, and that will simply not work.\nAs a matter of fact, writing on biblical archaeology and bibical studies for quite a long time, one sort of gets used to this. Another very important full-page interview with Father Joseph A. Fitzmyer, SJ — who edited and translated the (Aramaic) Tobit texts of Qumran cave 4 —- published in a leading daily will hopefully soon be posted online. It will give you an even better idea about  what exactly is correct interpretation when it comes to biblical archaeology and studies.\n\n","date":"March 25, 2015 at 9:37 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194364","author":"Louis","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Well that’s very kind of you, OK, but I disagree.\nI use two online calculators, both of which are important. Let’s find out how much contamination is required if the interpolation is dated at 1650 AD.\nFrom OxCal I find that 1650 AD is equivalent to about 250 BP.\nFrom the C14 calculator I find that 250 BP is equivalent to about 97.0% C14.\nFrom OxCal I find that 50 AD is equivalent to about 1950 BP.\nFrom the C14 calculator I find that 1950 BP is equivalent to about 79.0% C14.\nFrom OxCal I find that 1350 AD (the radiocarbon date) is equivalent to about 600 BP.\nFrom the C14 calculator I find that 600 BP is equivalent to about 93.0% C14.\nNow all we need to do is to find out what proportions of the first two produce a percentage of C14 of 93.0%, thus appearing to be from 1350 AD.\nWe find that 22% of old cloth and 78% of newer cloth produce this result.\nThe calculation is (22/100 x 79.0) + (78/100 x 97.0) = 93.04.\nI hope that’s clear. If you use a different calculation, please explain.\nWhatever our own differences, we seem to agree that a massive amount of contamination is required to shift a 1st century date to a 14th century, rather more than a few black fibres or a coating of dye and gum.\n\n","date":"March 24, 2015 at 4:20 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194299","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"The half life of C-14 atom is 5730 years, thus tau =5730/ln2 =8267 years (say 8270)\nThe average date for the Shroud =691 BP -this is fixed value, you cannot change that!!!  http://www.shroud.com/nature.htm\n25 AD =1983 BP\nThe date of contamination from Stuiver et al (OxCalc gives similar results, no significant difference).\nNow: X -contamination proportion\nThe equation:\nEXP(-691/8270)=(1-X)*EXP(-1983/8270)+X*EXP(-Date of contamination/8270)\nTransforming:\nX*[EXP(-Date of contamination/8270) -EXP(-1983/8270)] =EXP(-691/8270)- EXP(-1983/8270)\nThus:\nX=[EXP(-691/8270)- EXP(-1983/8270)]/[EXP(-Date of contamination/8270) -EXP(-1983/8270)]\nThe best thing is to create a program or an Excel sheet to have all this equations at hand.\n\n","date":"March 24, 2015 at 4:34 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194303","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Oh Oh on line Calculators?\nGarbage in Garbage out. Try your own calculation method using first principles. Do you know how they created on line Calcilator?\n\n","date":"March 24, 2015 at 5:02 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194305","author":"Sampath Fernando","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Brilliant. I think that we have in fact come to the same conclusion in two different ways, but I have been dealing in 50 year increments (merely for simplicity) rather than using the 25 AD start date and the 691 BP Nature date.  No wonder our results were similar but different. When I adjust your 25 AD / 691 BP to my 50 AD / 600 BP, and use your calculation, I get the same answers as mine, and when I adjust the values the other way, and use my calculation, I get the answers as yours. That’s a relief!\n\n","date":"March 24, 2015 at 5:01 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194304","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Yes, Hugh, but my results are those correct.\n\n","date":"March 24, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194306","author":"O.K.","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Good. Now all you have got to establish is that three-quarters of the sample photo above is new material, and that it was added to the old material in such a way as to be totally indistinguishable from it at microscopic magnifications of less than 40 or so.\n\n","date":"March 24, 2015 at 5:49 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194309","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Hugh, once again you’re misrepresenting the real issue: \n– only about TWO-THIRD of the dated/incinerated PART of the C14 sample it to be taken into account as new material here since firstly the princess Clothilde of Savoy-Bonaparte and/or the Master of upholstery in the Royal court of Savoy in the 1860s CE is/are the best candidate(s) as far as microreconstructions are concerned and secondly and ABSENT THE RISERVA, ONLY PART and not the whole C14 sample to be dated was actually incinerated in 1988 (see the two pieces of Arizona radiocarbon sample that were not used).\n– could you refer us/me to a paper in which it is an established FACT a textile expert (whether Viale, Testore or Fleury-Lembert) actually examined at microscopic magnifications THE VERY CORE of the dated part of the C14 sample from the reduced or even non-reduced sample? Viale and Testore just examined the very ‘upper edge’ of the gross (non-trimmed/non-reduced) sample until proven otherwise and, shall I endlessly repeat (see my March 6, 2015 comment at 5:37 am): in 2002 Flury-Lemberg had neither direct access to the 1988 official C14 sample riserva neither to the parent sample used for the official C14 dating (since most of it was destroyed in 1988) nor to the two pieces of the Arizona sample that were not used. Consequently F-L has NEVER examined the actual C14 sample that was used in 1988. Her opinion shall be dismissed here as non-authoritative. What now if the invisible reweaving or interweaving was circumscribed at the very core of the C14 sample (i.e. in the very area the Shroud corner used to be firmly clutched in right bare hand)? What if there had been invisible microrecontructions done in the precise area that is no longer observable in situ textilis (= 2002 TS)? \n– Have you ever examined microphotographs of the radiodated C14 official sample (of which most of it was incinerated in 1988) seen under microscope at X40 magnification yourself and/or can you provide us/me with such microphotographs?\n\n","date":"March 25, 2015 at 2:22 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194393","author":"Max patrick Hamon","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"“What if there had been invisible microrecontructions done in the precise area that is no longer observable in situ textilis?” What indeed? The interpolated weft threads would then have to be less than 1cm long, which seems to me absurd, and the interpolated warp threads less than 7cm long, which seems scarcely less so. Rejecting that idea, and thus requiring that the interpolated threads be visible outside the cut C14 area, we can see from Shroud 2.0 that no interpolation can be observed.\n\n","date":"March 25, 2015 at 6:04 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194415","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"what seems absurd is that somebody created an object 700 years ago that nobody can recreate today by any means.\n\n","date":"March 26, 2015 at 6:28 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194461","author":"Paul","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Not as absurd as you might think. Can you name anything from 700 years ago which has been recreated? Not merely copied, that’s been done many times, but recreated so as to be indistinguishable under a microscope, which is what authenticists demand. I bet you can’t.\nWhat perhaps you mean is that nobody knows how such an image might be made, although that too is hardly true. Paul Vignon, Joe Nickell, Walter McCrone, Paolo di Lazzaro, Ray Rogers, Nicholas Allen, Luigi Garlaschelli, Nathan Wilson, Colin Berry and various others all thought/think they knew/know, and if any of them had carried out more than cursory experiments perhaps they would have gained some kind of general acceptance. Perhaps the puzzle is not that nobody knows, but that everybody knows – but they all know something different.\nThe Shroud has not been comprehensively explained, whether from 700 years ago or 2000 years ago. Ignorance does not compel any one date over another.\n\n","date":"March 26, 2015 at 10:40 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194480","author":"Hugh Farey","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"just throw one on the barbi as the aussies say and make one\n\n","date":"March 26, 2015 at 8:30 pm","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194545","author":"Paul","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"Hugh, I have to disagree. I wouldn’t put Paolo di Lazzaro in a group together with others because his research is completely independent. He has contradicted other Shroud scientists and invited more research. His experiments demonstrate that the image has nothing to do with vapour, painting, Maillard reaction, radiation, photography and scorch.\n\n","date":"March 26, 2015 at 11:11 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194484","author":"Louis","site":"shroudstory"},{"title":"Do the Blue Quad Mosaics tell a different story than we think?","post":"I leave the above also for others to judge:\nhttps://www.academia.edu/11355553/Dr._Paolo_Di_Lazzaro_explains_his_research_on_image_formation_on_the_Shroud_of_Turin\n\n","date":"March 26, 2015 at 11:12 am","url":"https://shroudstory.com/2015/03/22/do-the-blue-quad-mosaics-tell-a-different-story-than-we-think/","cat":"carbon_14_dating","id":"comment-194485","author":"Louis","site":"shroudstory"}]
