[{"title":"Dog in this fight or pony in this race?","post":"Oh dear. where does one start?  It would take forever and a day to respond to every charge made here, most attempting to strip me of any illusions of having trained and functioned as a research scientist (about which more later). \nLet’s just address one point for now: I had merely expressed surprise at Dan Porter’s belief that the invisible repair had preceded the fire of 1532. No, there was no confusion in my mind re the patching that followed that fire, merely that any pre-1532 substitution of medieval thread was unlikely to have produced a 1260-1390 dating unless the substitution had been near complete – which would have been virtually impossible to conceal, certainly from an expert eye like that of Mechthild Flury-Lemberg who dismissed the repair hypothesis (or ‘theory’ as we say in common parlance – and yes I do know the difference between hypothesis and theory in a strictly scientific context – which a blog site is not).\nThe reverend gentleman was (as I vaguely recall) at the top of a list of returns when I googled to confirm my hunch that any invisible mending would have taken place post 1532 – based as I say purely on radioactive decay considerations. I merely sought some support, to show I was not idly speculating.\nYes, I should perhaps have read what he said more closely, and spotted that he was confused in his mind between invisible repair of a corner, and the rough-and-ready patching of the 1532 damage, but it is somewhat tedious to read here for a second time, the previous well over a year ago, that because I linked to him to reinforce a simple point re chronology, I shared all of his misconceptions. \nBeing put down by proxy,  or having my scientific credentials casually rubbished, is not new experience for me. So  I am relaxed about that, seeing myself now primarily as a blogger,  not a working scientist, with  ‘sciencebod’ used tongue-in-cheek elsewhere.  However, it should be other scientists who judge me on the science, not an internet-based religious thinker – cum – Shroudologist  who says next to nothing about his own background, while not hesitating to pass judgement on the professional standards of a long-retired scientist. \nYes, we are talking about Jan 2012, just 10 days or so after a headline had appeared in the UK press : “Turin Shroud was created by flash of  supernatural light”. The issue in my mind at that time, having thought little about the Shroud since 1988,  was one of scientific propriety, of not extrapolating one’s findings from the science to the supernatural, based merely on producing some minuscule scorching of linen irradiated with intense laser-generated uv beams. As a retired scientist (sorry for mentioning it again)  I knew those uv rays had sufficient energy to break covalent chemical bonds, so scorching was hardly surprising. But neither deceased human beings nor rock tombs are noted for generating uv light,  least of all coherent laser beams. …  That is the crucial scientific issue here – of my choosing – not a brief passing reference to a reverend gentleman.\n\n","date":"May 16, 2013 at 4:08 pm","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","id":"comment-33798","author":"colinsberry","site":"shroudstory"},{"title":"Dog in this fight or pony in this race?","post":"For what’s it worth, Colin, I do not question your scientific credentials – they’re better than mine that’s for sure. What I question is your seeming ability to read minds, particularly those of other scientists (even those now deceased). Your theories on Rogers strain reason. You accuse authentists of building a house of cards debunking the C-14 tests, but you then do the same when it comes to Rogers’ research on the weave theory — in particular his motivations. Knowing the man was respected by just about everyone — those involved with the Shroud or not — you are trying to build a case against his integrity. The samples were obtained in shady fashion, his peer review was shady, his peers are shady…etc. I have found no evidence, anywhere, that points to Rogers ever being anything but a scientist, and a man, of integrity. But I suppose since he is not here to defend himself you can keep building your house of cards.\n\n","date":"May 16, 2013 at 4:37 pm","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","id":"comment-33801","author":"David Goulet","site":"shroudstory"},{"title":"Dog in this fight or pony in this race?","post":"The samples were obtained in a highly irregular fashion – no one outside of a magic circle know that Gonella had stripped out threads from the very centre of the section taken for radiocarbon dating – an appalling liberty. No one knows how they were stored (contact with cotton?). Rogers peer-review was highly questionable too. That 2005 paper had virtually nothing to do with thermochemistry, yet he submitted it to Thermochimica Acta – a journal that had been under his management for many years, and which he helped establish. \nIncidentally, my criticism of Rogers is highly targeted on specifics.  It is you who are attempting to make them sound more pejorative of the man than is actually the case, using as you do above words like “shady”.\nMy chief complaint is that he became too opinionated, too dogmatic, too keen to crush other people’s explanations. His Maillard hypothesis is a case in point. That was exceedingly ill-supported by tangible scientific evidence, and seemed merely to be an over-hasty attempt to account for the thin detachable coating he was able to strip off image fibres, and which he straightaway assumed to be a starch “impurity layer”. If he had consulted a botanist, he might have taken on board the existence of the primary cell wall, and then he would have had to consider what might have caused pyrolysis of chemically-reactive hemicelluloses instead of  Pliny-inspired adventitious starch with absolutely no need to invoke putrefaction amines as the likely cause of the body image. Instead, he proceeded to create a chemical house of cards  – one that has acquired a totally undeserved level of respectability. \nRogers was not a crook. He was simply out-of-his depth in trying to be a master-of-all- trades (physical, chemical, biological, historical), and towards the end was taking liberties and short-cuts. His prime take as a STURP manager was to assemble the facts for or against  authenticity – not to go prematurely dismissing other people’s hypotheses and substituting his own – and a highly tendentious one at that.\n\n","date":"May 16, 2013 at 5:16 pm","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","id":"comment-33805","author":"colinsberry","site":"shroudstory"},{"title":"Dog in this fight or pony in this race?","post":"“Rogers was not a crook. He was simply out-of-his depth in trying to be a master-of-all- trades (physical, chemical, biological, historical)..” Pot meet kettle.\nRiddle me this Batman, Rogers brought his ‘dogmatic’ and ‘keen to crush’ attitude to bear on the weave theory. He wanted to destroy the theory. He ends up accepting it. Why would a man who thought the theory was ridiculous do that – especially IF he had the ‘out’ of saying ‘well, this proves nothing because the samples aren’t legit”? \nWas his original belligerence to the theory merely an act? Was Rogers suckering us all in to this final scam that would impress his STURP peers…because as a dying man that’s the first thing I’d want to do.\n\n","date":"May 16, 2013 at 7:41 pm","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","id":"comment-33823","author":"David Goulet","site":"shroudstory"},{"title":"Dog in this fight or pony in this race?","post":"There’s a sense in which you have proved my point, by that reference to Rogers’ “original belligerence” to the repair theory. Where is the merit in doing an about-turn on a controversial issue if one starts by taking a highly polarised position?\nIn fact, that kind of doctrinaire up-front posture is not just bad strategy, since emotion can blind one to the merit in others’ arguments. It’s also bad tactics as well. The way to box clever in science is NOT to reject another’s arguments at the outset, with a view to demolishing them in short order. The trick is to imagine the other’s arguments were one’s own idea, and then try to think up clinching arguments that would convince the sceptics. It’s then that the strengths and weaknesses of a case can become quickly apparent.\nHaving said that, I have to confess that I’m not terribly interested in the fact that an explosives thermochemist set out with one belief re the Shroud, and then changed his mind, based on some microscopy at home with threads of dubious provenance. What matters are the hard data, and whether the data are credible or not. Personally I consider that Rogers’ findings in that 2005 are incredible, bizarre even, and others failed to confirm them when they examined carefully their leftovers.\nAnyway, there is a troll on this site, as I’ve said before, and I don’t care either for the tone of the host’s recent postings either, so it’s time now to take a break. See you all anon. In the meantime, keep pressing for a repeat of the radiocarbon dating.\n\n","date":"May 17, 2013 at 2:08 am","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","id":"comment-33850","author":"colinsberry","site":"shroudstory"},{"title":"Dog in this fight or pony in this race?","post":"In the immediately preceding posting “Paper Chase” concerning the work of Margaret of Austria, reference is made to the Benford-Marino 2005 paper: “New Historical Evidence Explaining the “Invisible Patch” in the 1988 C-14 Sample Area of the Turin Shroud” at:\nhttp://www.shroud.com/pdfs/benfordmarino.pdf     \nI note that Mme Flury-Lemburg still appears to be in denial over the possibility of “reweaving”, despite the fact that Michael Ehrlich routinely carries out such invisible reweaving at the present time (or at any rate in 2005 when the paper was written). Flury-Lemburg’s understanding of such reweaving is that it would be evident on the backside of the cloth, whereas Ehrlich’s more painstaking process does not.  \nThere is a comment there attributed to the custodian’s scientific advisor Prof Piero Savarino: “In the 1998 booklet, he stated that the 1988 C-14 testing might have been erroneous due to “extraneous thread left over from ‘invisible mending’ routinely carried out in the past on parts of the cloth in poor repair” (Savarino and Barberis, 1998: 21).” This clearly suggests that there are other areas of patching on the Shroud which may be either known or unknown.\nAs the Raes area from where the C-14 sample was taken appears to be the only area where there seems to be cotton contamination, it would seem to be the normal procedure when such invisible reweaving work was done (assuming that there are indeed other such areas) would be to remove such extraneous cotton thread on the work’s completion. This would make it extremely difficult to ascertain whether any future samples taken for C-14 testing come from a patched area or not. It would be necessary to search for other clues such as signs of gum arabic, dye azarin etc. It illustrates the hazard of C-14 testing on the Shroud, assuming of course that reliable C-14 testing of textiles is indeed feasible. I should like to hear about examples of reliable C-14 testing of textiles where the results have been corroborated by means independent of C-14 testing. I have yet to have my attention drawn to any such.\n\n","date":"May 16, 2013 at 6:38 pm","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","id":"comment-33812","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Dog in this fight or pony in this race?","post":"Madder rose is not isolated to Raes corner it’s found throughout the TS based on the sticky tapes from the 1978 STURP studies. So if you do believe in the invisible weave you also have to except the hypothesis stated by Paul Maloney.\n” The yellow amorphous tubular flaked like material resin was possibly also the same thing Dr. Nitowski saw and was convinced it was Myrrh and aloes just as Dr. McCrone first thought. Steven Schafersman is also correct when he states the madder root was first announced by Dr. McCrone.  This is also confirmed by Paul Maloney, President of ASSIST at a Talk given at the “The Shroud of Turin: Perspectives on a Multi-Faceted Enigma” conference in Columbus, Ohio on August 14-17th 2008, when he states, “Walter McCrone had sent him in 1981 several Kodak transparencies of photos he took of Shroud linen fibers. “On those slides, (Guild also has them) McCrone had written the following note: madder rose, linen fiber, medium (blue) sample 3 CB” 4 and sample 3-AB. McCrone was referring to photomicrographs made on STURP sticky tape samples 3-CB and 3-AB which came from the blood flow across the back nearest the side-strip side of the Shroud and directly adjacent to that flow on linen, itself. It was on that side where someone would have been working their repairs if the re-weave theory is held to be correct. McCrone, of course, due to his belief that the Shroud was painted by an artist, was trying to prove that the Shroud had been in an artist’s studio.” Source: Maloney, Paul C. “What Went Wrong With the Shroud’s Radiocarbon Date? Setting itall in Context.” Talk given at the “Shroud of Turin: Perspectives on a Multi-Faceted Enigma”conference in Columbus, Ohio on August 14-17th 2008.\nComments: Regarding the presence of madder rose on the cloth, Maloney says, “There is now a\nnew way of looking at the presence of that madder rose. Although this is some distance from the\n“Raes Corner” such trace amounts can now be conjectured to explain the dye that was used,\nalong with the aluminum mordant and the gum Arabic as a binder to create the wash to finish the\nre-weave. Thus, it may now be seen not as a contaminant from an artist’s studio, but rather a\ncontaminant from the weaver’s workshop.”\ncited: http://holyshroudguild.org/dr-raes-problematic-threads_2.html\n\n","date":"May 16, 2013 at 8:13 pm","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","id":"comment-33831","author":"Giorgio","site":"shroudstory"},{"title":"Dog in this fight or pony in this race?","post":"“In the meantime, keep pressing for a repeat of the radiocarbon dating.”  No thanks, Colin. As others have pointed out the C-14 process is not the ideal method for dating the shroud. The list of preconditions that would now have to be accounted for is longer than Santa’s on Christmas Eve. I’ll definitely press for better, more fool-proof, technology which is on the cusp of being available. As for your impression of Rogers, you may be right. But often we dislike in others the weaknesses which are our own as well.\n\n","date":"May 17, 2013 at 6:27 am","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","id":"comment-33858","author":"David Goulet","site":"shroudstory"},{"title":"Dog in this fight or pony in this race?","post":"Colin’s no offense taken if you are calling me the troll, It’s been the kindest adjective thrown at me all week ever since I had as you guys over the Atlantic would say one to may pints of bitter last weekend.  You have to hear what the Mrs. is still calling me.\nBack to my post. Sorry if you think it’s off topic but it isn’t.  If you follow the trail which is briefly highlighted from my post, the major problem has been the nomenclature in the TS research. The term “The yellow amorphous tubular flaked like material resin” means what? I guess it depends on who’s doing the research. \nThe point is,  since Dr. Rogers was aware that the “dye that was used,\nalong with the aluminum mordant and the gum Arabic” was present throughout the TS not just in the location of Raes corner in my opinion he should have addressed that issue in his paper. Instead we had to wait three years for Dr. Maloney’s explanation.\n\n","date":"May 17, 2013 at 8:34 am","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","id":"comment-33863","author":"Giorgio","site":"shroudstory"},{"title":"Dog in this fight or pony in this race?","post":"There are many that come to the shroud to confirm their faith – Colin is among them.\n\n","date":"May 20, 2013 at 10:33 am","url":"https://shroudstory.com/2013/05/16/dog-in-this-fight-or-pony-in-this-race/","cat":"carbon_14_dating","id":"comment-34122","author":"Chris","site":"shroudstory"}]
