[{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"There’s quite a number of things on which I need clarification, Thibault.  I’ll try writing a posting tomorrow and flag up the problematical areas as and when they become apparent. Thanks for the offer of help.\n","date":"December 28, 2012 at 8:48 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1599","author":"colinsberry","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"I’ll be more than happy to take you up on that offer, Thibault.  The literature on flax fibre structure – at any rate that which is searchable online – is somewhat fragmentary and confusing.\nRegarding the French: I have high-powered back-up  – ça s’appelle une femme multi-lingue….\n","date":"December 28, 2012 at 8:10 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1597","author":"colinsberry","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"OK. What do you want to know exactly ?\nSalutations à votre chère épouse.\nAmicalement.\nThibault.\n","date":"December 28, 2012 at 8:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1598","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"Colin, you wrote:\n“Beyond that I can’t comment further at present, lacking as I do detailed information on the nodes compared with inter-nodal regions. I’m hoping that someone will be able to help. ”\nPerhaps I can help. I have a wide scientific documentation about this topic.\nBonne année 2013 ( because I now know that your French is perfect !!)\nThibault.\n","date":"December 28, 2012 at 5:53 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1595","author":"Thibault HEIMBURGER","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"Thank you, Colin S. Berry.  Very nice of you.\n","date":"November 24, 2012 at 6:04 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1255","author":"Andy Weiss","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"That was a good idea on Ray Rogers’ part, at least in principle. But it  has a fatal flaw, correction, two fatal flaws. One – it is non-quantitative. Two – it asks the sceptics to take something on trust.\nI’m sticking with solubilising and regenerating pure cellulose, using glucose assay to establish the purity of the cellulose.\n","date":"November 20, 2012 at 9:41 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1226","author":"colinsberry","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"I notice in one of Ray Rogers’s articles (on shroud.it – ‘Studies on the radiocarbon sample’…” that he advocates using the charred, almost pure carbon, bits of scorch that were cut off during the 2002 restoration, as washing them in concentrated nitric acid would remove all the thymol (among other contaminants) applied in 1988.\n","date":"November 20, 2012 at 8:07 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1225","author":"Hugh Farey","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"Hello Piero\nWhile I would agree that a purely physical non-destructive method is to be preferred, even if one were fairly confident as I am that the Shroud is of medieval provenance, one has to ask precisely what is being measured in each scanning method, and whether that provides unequivocal answers.\nPersonally I think there is no substitute for a purification of cellulose, followed by gravimetric analysis to confirm it is 99.9% glucose. Then one does not need to know what the contaminants are,  whether thymol or something else, nor their age, PROVIDED one has taken enough samples from enough locations to be able to dismiss any possibility, largely theoretical, of wholesale invisible reweaving. If there were areas of re-weaving that that would surely reveal itself in large sample-to-sample variation.\nWhat objection can there be to destructive testing, if it were confined to non-image areas of the less important dorsal side?  Those areas could be ‘invisibly’ mended could they not? If that was possible in the 16th century, resulting in an allegedly false answer for the 1988 dating, then why not now?\n","date":"November 20, 2012 at 6:16 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1223","author":"colinsberry","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"Personally I think at the Shroud as the authentic relic (2000 years old)\nthat permits to see something about the Holy Face of Jesus.\nBut this is only a personal idea (then this is the reason about the true\nepoch to demonstrate, through the adequate controls !).\nIn any case I don’t believe in your destructive way to proceed ! It’s too\ndestructive, IMO.\nInstead, using the SPMs (= Scanning Probe Microscopies) we can try to\nestimate the cellulosic degree of polymerization (= cellulosic DP) and\nalso try to observe what is the amount of different kind of contaminants,\nincluded the thymol (… molecules !!!).\nI want to add that (in my opinion) perhaps the Raman analyses of the year\n2002 (in Turin, by Renishaw) were not published because they testified\nthe previous thymol contaminations. Am I wrong in this hard conjecture ?\nHave you found another more simple explanation about this\nlack of communication (= ten years !) about the Raman controls ?\nWhat is your opinion ?\nSo …\nWe have to choose to do the right controls on right areas.\nAt least we have to ask for new controls using the advanced controls\n(= AFM or AFM-Raman techniques applied in a careful manner) on linen\nfibrils taken from the Holy Shroud in the past (= before the thymol treatment)\nand on linen fibrils taken after the thymol treatment. This is an interesting\nscientific argument (for a paper).\nI believe these useful linen samples are already taken and kept apart.\nThen there is the necessity for an adequate request about the inherent new\n(and open ?) scientific Committee.\nDo you agree on that idea ?\n— —\nRecently I tried to search for other ways, for example : the ptychographic\nelectron diffractive imaging at atomic resolution, permitting identification\nof structures …\nIf I am right a STEM (= scanning transmission electron microscope)\nand the X-rays are used to work …\nThe STEM permits a more deep control with respect the AFM\ntechniques (= superficial controls).\nBut the STEM was an old way with respect the AFM and the CFM.\nI have not a great knowledge in this interesting field and (u\nnfortunately) in my mind these ways seemed to be more feasible\nin the mineral world … I had some doubt.\n— —\nThere is another way : the scanning X-ray fluorescence microscopy (XFM).\nThis a particularly useful method for studying the spatial distribution\nof trace metals (= Sr, etc.) in biological samples. In my idea this is a possible\nway to work in order to search the Strontium (that an interesting geographical signature).\nBut (if I am right) this way has a “low” precision (near 30 nm)…\nThe quantitative elemental maps are also interesting for the\nanalysis of the pollen.\nDo you know the X-ray fluorescence micro-computed tomography ?\nIn the Web there is some document about the X-ray Fluorescence\nMicroscopy for Biology and Bionanotechnology.\nTry to see … I don’t want to be too boring, here.\n— —\nWhat is your idea ?\nWhat will be the choice of the future scientific Commission ?\nWhat is your prevision ?\nHow to make credible forecasts without the work on the Labs\nusing the adequate tools ?\n— —\nRegards,\nPiero\n","date":"November 23, 2012 at 5:31 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1251","author":"Piero (Piedmont)","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"Without knowing precisely what your probes are intended to measure, and how that measure can provided unequivocal evidence one way or the other, I cannot usefully comment. Piero. For example, it’s possible I suppose that a probe could provide information on the DP of cellulose (quite how is not obvious to me, but never mind),  and other things being equal, the older the linen, the smaller the DP. But that cannot provide an absolute scale of dating, in the way that radioactive decay can, since progressive breakage of glucose-glucose links in cellulose could be influenced by any number of environmental factors, unlike radioactive C-14 decay which follows a mathematical logarithmic decay curve, with a constant half-life etc.  These considerations apply to the rather similar kind of chemical approach adopted by Raymond Rogers with his vanillin. Personally, I prefer good physics to bad chemistry.\nYes, the sampling protocol I propose will damage the Shroud, but only the linen with the dorsal image, and then only the non-image areas. The damage could be made good with that ‘invisible reweaving’ which we are told is undetectable to the most expert eye. The frontal image would remain TOTALLY untouched.\n","date":"November 23, 2012 at 6:49 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1253","author":"colinsberry","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"Dear Colin,\nIn the case of cellulosic materials (=Cotton, linen, paper, etc.)\nthe measurement of the cellulosic DP is an interesting way to know\nthe true epoch for that ancient linen sheet and this method\n(the detection of the cellulosic degree of polym. for the cellulosic chains)\nis very interesting … and that … not only in my opinion !\nSee, for example the previous studies by Diana and Marinelli.\nIn 1997 during the Symposium of the CIELT (in Nice, France) and also\npreviously they indicated that way …\nUnfortunately they indicated a wrong system (using the presumed proper\napparel) for the right analyses about the Holy Shroud :\nthe viscometric measurement.\nThis way requires a lot of material with respect the very little amount\nof linen fibrils (… obviously here … I speak in a rough manner. Thus : taking\napart the problems connected with the Applied Statistics … and the calculations\ninherent the exact amount of material required to obtain a decent and\nincontrovertible work with the fibrils) in the case of the AFM measurements !\nAnother problem is due to the effect of the past fungal attacks.\nThen the inherent areas involved in these degradation are to avoid\nduring the controls (of the cellulosic DP).\nAnd now (= after this simple attempt to explain the scientific question) :\nWhat is your idea ?\n— —\nYou can try to improve your knowledges about the degradation of the\ncellulose (and the cellulosic DP) and the degradation evolution equation\nof cellulose, reading the following paper :\nAuthor response to the comments by P. Calvini regarding the article “On the degradation evolution equations of cellulose” by H.-Z. Ding and Z. D. Wang\nSource :\nthe review\nCellulose,\nApril 2008, Volume 15, Issue 2, pp 229-237\nSpringer\n— —\nI guess that in your reply you point another time\nthe attention about the (presumed) unsolved problem\nof the absolute scale of dating …\nBut we can try to obtain the useful scale measuring the ancient and old\ncellulosic materials.\nSee for example the recent dating for the portrait of Bianca Sforza\n(by Leonardo da Vinci). They used a spectral method. But, in my idea,\nwe can try to do something using the measurement of the cellulosic DP.\nDo you agree ?\nIn the past our common friend Dan Porter indicated the book by\nPeter Silverman (who, the january 30, 1998, was curious about the painting\nby Leonard) and then the portrait of the belle princesse (Bianca Sforza\npassed away at 13 years old !) was an interesting challenge, an argument\nto use in order to show what is possible to obtain with the SPM dating\nversus the 14C test.\nDespite the fact that dating of the portrait to 1496 and the identification\nof the sitter as Bianca were confirmed to a high level of probabily, the\nidea to obtain the SPM confirmation can be interesting to develope\nbecause this will show the level of precision for the SPM tests.\n— —\nThe similar SPM analyses can be applied for the well known ancient\ndocuments coming from the sites of Qumran …\n— —\nIf you want to improve some control there is the CFM (= Chemical Force\nMicroscopy). So, you can hope to detect also the few molecules of thymol.\nThe CFM can distinguish between distinct chemical regions on a surface.\nChemical force microscopy provides quantitative information on the interactions between chemically modified tips and the surface.\n— —\nI hope in your answer.\n— * —\nHappy New Year 2013 !\n","date":"December 28, 2012 at 5:06 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1593","author":"Piero (Piedmont, Italy)","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"Hello again Piero\nIt’s interesting you raise the issue of cellulose integrity – and its presumed tendency to fragment with time  to polymers of progressively lower DP – at this particular time. I’m presently preparing a post for tomorrow that will focus on the issue of differences in mechanical strength, especially fracture-resistance-  between image and non-image-bearing fibres. Whether that has any bearing on age-related changes is anyone’s guess, but all I would say for the moment is this: while cellulose is the major component of flax and linen fibres, it is by no means the one that is central to image-capturing or age-related changes. One needs to look at the structure of the elementary flax fibres at a higher level of organization. Tomorrow’s post will focus on those nodes that are a feature of linen but absent in cotton.. Admittedly I don’t know a lot about them at present, but the little I do says their  interesting component is lignin rather than cellulose. Hugh will be interested I’m sure.  Beyond that I can’t comment further at present, lacking as I do detailed information on the nodes compared with inter-nodal regions. I’m hoping  that someone will be able to help. Oh, and a Happy New Year to you too. \nPS:  There was (inexplicably) no reply tab on your comment, so I have had to find one on an earlier  comment of yours.\n","date":"December 28, 2012 at 5:38 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1594","author":"colinsberry","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"I remember that Dr. Ray N. Rogers indicated us the fact that\nthe wood reliquary can take a certain amount of thymol and\nthen this quantity will be released after a certain amount of time.\nSo … the first question seems to be the following :\nWhat are the exact quantities involved ?\n(but, unfortunately, Riggi is dead since months …)\nand the second question is :\nThe presumed thymol contamination can change the 14C results ?\nThis question seems to be strange … There is a little amount of C, so there is not the great change, but (in my opinion) this is not the true problem.\nThe problem is the 14C in itself. We cannot destroy a relic using the 14C (or another destructive analysis) on that ancient cloth.\nThere are the SPM analyses and then we have to use this new way in order to discover the truth about the true epoch.\nDo you agree with me about this simple SPM idea ?\nIf you agree on that new way (to observe the material) perhaps\nwe can discuss how to improve the analyses avoiding the destructions.\nThere is a lot of work to do using the SPM analyses, included the question\nof the detection of thymol contamination on linen fibrils.\nBut, before to start with the controls on linen fibrils coming from the Shroud,\nwe have to try to do some interesting experiments about the contaminations\n(on linen samples) to improve the knowledges before to waste the time\n(perhaps) in useless analyses…\n","date":"November 20, 2012 at 5:33 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1222","author":"Piero Iacazio","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"“Playing the thymol card” (as I call it) is rapidly becoming a standard part of the authenticist’s repertory, or should that be armoury? “There’s no point in repeating the radiocarbon dating” they intone, “because thymol will have contaminated the linen with modern carbon”.\nI saw that one coming, Thibault, and, sure enough, right on cue, Andy Weiss pops up, playing guess what? Yup, the thymol card.\nHa,ha,ha,ha,ha,ha\nWhy don’t the strident authenticists like Andy Weiss simply admit the real reason why they don’t want another round of radiocarbon dating – which has little if anything to do with genuine concerns over thymol or any other scientific detail for that matter?  It’s because they are afraid it will deliver the same medieval result as before, but with improved statistical precision. That’s assuming that a reasonable number and distribution of samples were to be taken next time around, assuming there is a next time. Andy Weiss and some others on Dan Porter’s site are clearly determined there should be no next time,  and can be relied upon to provide an endless stream of (pseudo) scientific objections to support their line, one that makes a mockery of genuine detached science, because it is simply intended for one purpose, and one purpose only, i.e. to OBSTRUCT scientific progress.\nI have already proposed a solution to contamination by thymol or any other modern carbon compounds. Purify the cellulose to 99.9% purity or thereabouts by solubilising and regenerating, e.g. using the cuprammonium (Shirley’s) reagent as used for rayon thread manufacture. Then it would not matter if there were still a trace of thymol etc -since a mere 0.1% contamination by weight due to unknown contaminants would not be sufficient to affect the result by (probably) more than a year or two…\n","date":"November 18, 2012 at 8:02 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1211","author":"colinsberry","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"Wow, I wasn’t aware you were paying my comments that much attention, Colin.  Thank you.  If you want to talk about carbon dating, perhaps you ought to ring up Bill Meachem.  He has extensive experience and is an expert on this as you surely know.  What Ray Rogers did for us, among many things, is give us an alternate dating technique in the absence of vanillian.  His testing indicates the Shroud is between 2000-3000 years old.  Do you have a derogatory comment to make about this work as well?  It just seems like you simply do not like Ray Rogers, his work or the fact that he was a preeminent scientist.\n","date":"November 22, 2012 at 3:14 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1242","author":"Andy Weiss","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"No comment, now or at any time where Andy Weiss is concerned.\n","date":"November 22, 2012 at 4:21 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1243","author":"colinsberry","site":"colinberry"},{"title":"Draft document discovered in the paper-skip at my local recycling centre: “Ten killer arguments for opposing any re-run of the radiocarbon dating.”","post":"Colin,\njust a question:\nWhat do you mean exactly (ha, ha, aha…) with regard to Andy’s comment ?\nI simply don’t understand.\nThibault.\n","date":"November 18, 2012 at 7:11 pm","url":"https://shroudofturinwithoutallthehype.wordpress.com/2012/11/16/draft-document-discovered-in-the-paper-skip-at-my-local-recycling-centre-ten-killer-arguments-for-opposing-any-re-run-of-the-radiocarbon-dating/","cat":"killer_arguments","id":"comment-1210","author":"Thibault HEIMBURGER","site":"colinberry"}]
