[{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"I’ve had doubts about Carbon Dating all along, so I’m glad to hear that it is losing its authority as a reliable scientific method. \nI think the main reason I’ve had questions is because of the bizarre dates that scientists throw at us, based on carbon dating.  Some dates go back tens of thousands of years. And then there’s a huge leap to millions of years.  I cannot remember seeing any “carbon dating” numbers that go back to 20,000 years, 30,000, or 100,000, 200,000 years etc.  It seems as if all the carbon dating reports I’ve heard about will SKIP from 10,000 to millions – and nothing in between.  \nSome of us think the Flood could account for this.  Noah’s flood throws carbon dating off. If they were to factor in the Flood, and how it could skew the numbers, then maybe (probably!!) the dates would end up being very different.  \nThey also don’t consider the “canopy” that many people believe existed before the flood, where all of the earth was protected from UV rays and other harmful environmental factors that we have now. The earth CHANGED after Noah’s flood, and it was a drastic change.  \nBut of course, scientists don’t consider any of that. Even though most ethnic groups on this planet have an ancient legend of a catastrophic world flood, scientists don’t consider it to be a possibility.  So the flood and the canopy are not included in calculations. I don’t know if we could figure it out, anyway: we don’t know what the earth was like before the flood so how could we make adjustments for it?  But I do think we could do better than ignoring the flood completely. \nMaybe Carbon Dating would retain it’s Authority, if Scientists used it with these factors in mind.\n\n","date":"November 2, 2011 at 12:50 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4517","author":"AnnieCee","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"For the question of the authenticity of the 4 relics that are mentioned by M. Fanti, I can say that over the years, I think I have develop a good series of criteria to judge if a relic have some chances to be genuine or not.  The first one is one of the most important.  I call it the criteria of the “loneliness and authenticity”.  In other words, is this supposed authentic relic is alone in his category or is it other object of similar nature around the World ?  And is this relic have some really good degree of authenticity attach to it (after some scientific validations were performed on it) ?  If there is more than one object that can fit the criteria, then my degree of doubt is higher because that mean that at least one of the two (if not both) are surely false.  Also, when I take only the second part of the criteria and found that a relic as not a high degree of authenticity (for exemple, a relic of the passion with no blood stains on it), my degree of doubt is higher because that mean it would have been way more easy for an ancient forger to have produced this kind of relic.  \nIf I take this criteria and apply it to the 4 relics, that would give this : I’m not aware of another supposed Shroud of Christ around the world with a very good degree of authenticity like the Shroud of Turin (with confirmed human blood and body images on it).  Also, I’m not aware of another sudarium of Christ around the world with the same degree of authenticity like the Sudarium of Oviedo (with stains on it that were found to be of human blood for one part and of a clear fluid coming from a pulmonary oedema for 6 parts).  Also, I’m not aware of another tunic of Christ around the world with the same degree of authenticity like the Tunic of Argenteuil (with stains on it that were found to be of human blood).  Finally, I’m not aware of another Titulus Crucis with the same degree of authenticity that the one kept in Rome (with ancient forms of writings that were confirmed by specialists).  So, it’s fair to say that those 4 relics passes the first criteria.\nNow, for the second criteria, I call it “the historic possibility” criteria.  Is there a good possibility (without having to invent too much special assumptions) that this relic was an authentic object that was taken after the death of the person that was related to it and was kept with great caution by his followers ?  For the Shroud, I think the possibility is good, even if I know some people who denied the authenticity by saying that the Jews would never have kept a blood stain burial cloth like that.  This argument is very true if we forget the resurrection account (which, I admit, can be consider as a special assumption).  It’s only in the light of the resurrection that the possibility is high that someone close to Jesus would have kept his burial Shroud.  The same thing is true for the Sudarium and even the Tunic of Argenteuil.  Because those cloths contain blood stains that could have been thought as sacred by the disciple of Jesus (in the light of the resurrection), I think there is a fairly good possibility that someone would have kept them.  But, I have to say that for the Tunic to be genuine, we must add another special assumption.  Like I said before, St-John tell us that it was a Roman soldier who was in possession of this cloth after the death of Christ.  Then, with this in mind, we have to think that this soldier would not have washed the cloth at all (because there’s a lot of blood stains on it) and would have been kind enough to give it to a follower of Christ later on !  I think the possibility for that to have really happened is really low.  For the Titulus, it’s another story because this piece of wood didn’t possess any blood stain (as I know) and I don’t see any good reason for a disciple to have kept this thing.  So, we can say that only the Shroud and the Sudarium pass the second criteria, and it’s important to say it : only in the light of resurrection.  Forgetting this event, there would have been no reason at all to keep those 2 cloths.  \nMy 3rd criteria is what I call “the possibility and the easiness for a forgery”.  This criteria is very important because it deals with the logical thinking and even when we take it alone, it can be enough to judge if a relic have a very good chances (or no great chances) to have been forge.  When we apply this criteria to the Shroud, it is obvious that the chances for this cloth to have been forge are close to absolute zero.  For the Sudarium, the chances are not so low but are, nevertheless, very low.  In fact, who, during the 7th or the 8th century, would have known that a person crucified would normally died of a pulmonary oedema link to a suffocation state ?  Even in modern history, we had to wait until the experiments and studies of Pierre Barbet to learn that it was probably that way that Christ died on the cross !  Why a forger would want to go so perfect in medical details like that ?  To make this kind of relic, all he would have need would have been to put some chicken blood (or blood from another animal) on some parts of the cloth and that’s all !  Don’t forget that the crucifixion was banned during the 4th century.  Who during the 7th or the 8th century would have known medical details like that ?  And even if he knew them, why would he give himself so much difficulties to achieve a simple relic like that (with no body image or artistic essence) ?  For the other 2 relics mentioned by Fanti, the chances for a forgery are much more high because of the simplicity to accomplish it.  For the Tunic, someone could have easily put some blood stains on a tunic and that’s it.  No need for great medical expertise to accomplish this kind of relic.  And, for the titulus, all that is needed is someone with great skills in ancient writings and, during the Middle Ages, there was surely some monks who could have done this kind of relic.  So, again, from my perspective, only the Shroud and the Sudarium pass the test of the 3rd criteria.    \nFinally, I have another criteria that I called “the smell of truth”.  I admit it is more of an intuitive criteria but I keep it because I believe there’s some space for intuition in a scientific reflection.  So, which one of those relics have a smell of truth attached to it ?  Personally, my feeling tells me that the Shroud and the Sudarium have a very good smell of truth.  The Titulus have more of “a copy from the original” feel.  And, for the Tunic, my feeling is in-between… \nIn the end, I can say that, from my perspective, only the Shroud and the Sudarium have good chances to be genuine.  But I wouldn’t close the door completely for the possibility that the Tunic could also be genuine.  But again, the problem is the special assumption that are needed in this case because of the fact that it was kept first by a Roman soldier after the crucifixion…  More research are needed to know the truth about those relics and the fact that they all failed to pass the test of the radiocarbon dating should not be count as enough to totally reject them because of the fact that they pass at least some criteria that I state earlier.  Nevertheless, the fact that no C14 tests gave a first century date is pretty bizarre regarding other facts coming from other fields in science, especially for the Sudarium and the Shroud…  The best would be some direct comparative studies for those 3 relics of Christ that contain blood stains, but it’s surely not for tomorrow !!!  With the development of genetic research, I think the blood that is on the 3 relics become more and more important and can lead to some conclusions in the future.  A comparative DNA study of the fibers from those cloths could also be a good avenue of research to explore in the future… \nThat’s it for the moment folks !!!  I hope M. Fanti won’t be mad at me, but I had to express the fact that I think he’s completely wrong on many aspects of this topic.  It’s not because those relics are related to the Passion of Christ (and the resurrection also, for the Shroud) that they were in contact with some unknown supernatural forces…  From a purely scientific perspective, thinking that way will never produce something positive because, unless someone could resurrect the dead in laboratory, how in the world can you prove your claims ???  I really think there’s so many other interesting avenues in science to explore regarding the Shroud, the Sudarium and the Tunic than this supernatural fancy.\n\n","date":"November 2, 2011 at 1:05 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4518","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Supernatural phenomena, of course, cannot still be proved by scientific methods. However, we can think in a ‘scientific fashion’ about many yet unexplained phenomena. As the Shroud and the Sudarium could be both of them in contact with Someone in Whom something extraordinary happened, if we suppose that time flew backwards in the atomic structure of these cloths, they will appear with less C14 atoms than expected!\n\n","date":"November 3, 2011 at 5:37 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4529","author":"Tersio Gorrasi","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"The Shroud C14 dating have been proven really questionned scientifically by Rogers findings and those findings doesn’t imply some unknown supernatural process or force.  For the Sudarium, there’s good reason to believe he was in another part of the tomb, not close to the Shroud and the body, so I think we can really discard any possibility for some unknown supernatural force being responsible for a change in the C14 content of this cloth…\n\n","date":"November 3, 2011 at 8:32 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4531","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Oups, another little mistake from me :  I should have written “proven really questionable”…  Excuse my poor english !!!\n\n","date":"November 3, 2011 at 10:48 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4536","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"well, contrary to those who are writing these comments, Giulio Fanti has personally examined many fibers and threads coming from the TS. He Also Studied fibers from C14 area in proximity of the “reserve” sample.\nDo not you think that if he had found something to support  Rogers or Benford Marino’s theory he would be the first to be happy?\n\n","date":"November 4, 2011 at 6:41 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4552","author":"domenico","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"No.  He wouldn’t have been happy at all because his views on the Shroud are totally in opposition to the views of a scientist like Rogers.\n\n","date":"November 4, 2011 at 8:31 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4553","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"I’d like to say that the main point here is not Fanti’s and/or Roger’s hypotheses, conclusions or their opposition, but Fanti’s statement that a ‘supernatural cause’ may be to blame for the erroneous C-14 dating of 1988. As I said before, I don’t believe a supernatural cause needs to be even mentioned to explain the erroneous dates…. This is simply a case of a completely messed up, unprofessional C-14 analysis by all involved. Seriously, If more people would research how POORLY the whole process of dating the Shroud was accomplished in 1988, there would be absolutely no discussion on it further, except in trying to urge the Shroud custodians for further tests. To me the question of C-14 dating is null and void, meaning the 1988 dates are now fiction and meaningless. All should now be talking about other matters….like how to get the Vatican to okay further studies by expert teams of dedicated, non-biased scientists, scholars etc; Maybe Dan can start a patition!\nJust my 2 cents worth.\nRon\n\n","date":"November 4, 2011 at 10:18 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4556","author":"Ron","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Oh almost forgot; As for all the robes mentioned above, I think the chances of any of them being authentic is quite small and the worst part is they are all so contaminated, patched etc; it would be next to impossible to ever come to a scientific conclusion on them…and does that really matter when we have the most amazing relic left by God himself, in the Shroud? …I think not.\nRon\n\n","date":"November 4, 2011 at 10:28 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4557","author":"Ron","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"I agree totally with what you said.  I don’t like to debate on who’s the best ?  Fanti or Rogers or someone else…  But the big problem I can see with the Fantis of this World is that they make an automatic link between the Shroud AND the resurrection of Jesus AND a unknown supernatural force involved that can be thought as a by-product of the resurrection and that surely had an impact on the Shroud.  Thinking that way is not great science in my book.  Even if I’m a Catholic who believe in the resurrection of Jesus, I will fight all my life against illuminated views like that !  Like the majority of people, I’m too rational to give any credibility to those kind of views.  If the Shroud would be the one of Napoleon or Alexander the Great, nobody would ever think that way.  Unfortunatelly, in this crazy world, there’s many people who desperately want to believe ideas like the ones Fanti promote (and he pretty good at promoting those ideas !).  As I said the other day, the Shroud of Turin should be consider and analysed no differently than any other archaeological pieces.\nIf we come back on earth 2 seconds and ask ourselves the question :  What process or processes could have been involved to produce the blood and body images we see on the Shroud ?  Since it was a victim of crucifixion that was inside the cloth, I think the best rational answer would be : some natural processes that are not fully defined yet but that are surely linked to the traumatized state of the dead.  That’s the most rational answer.  And I think the reason why those processes are not fully defined yet is because the Shroud research that was done after STURP was mainly focused on supernatural hypothesis (like the Corona Discharge of Fanti) and don’t seem to care about natural hypothesis like the Volckringer pattern, the Singlet Oxygen hypothesis developped by Alan Mills, etc.\nIt seem to me that only Rogers did some serious experiments in the last decade about a natural hypothesis (the Maillard reaction).  It’s just too bad he died before having the opportunity to make more experiments about that hypothesis and maybe explore some others natural hypothesis…  These days, who the hell can be interested in exploring natural hypothesis of image formation about the Shroud ?  Unfortunatelly, it’s not as exciting as the supernatural hypothesis.\n\n","date":"November 4, 2011 at 10:46 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4559","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Yannick, I agree with some of your first points above, but when it comes to the Image process I have to disagree with you, (somewhat). Rogers himself, even admitted he had some issues with his Milliard hypothesis, meaning I think he knew in his heart it was not the answer…Namely explaining images in areas that had not touched the body. It just does not seem to work! Some STURP members are almost unanimous in that the image formation was not (to their present scientific knowledge), caused by any ‘KNOWN natural event’ ….THAT is exactly why some researchers started to look at unnatural causes!. Sturp was not focused on ‘supernatural causes’, in fact, their only purpose was to study whether the image was some type of art or forgery, which we all know they concluded it was not, as no pigments or bindings etc; were found on or around the fibrels. A ‘supernatural cause’ must be an alternative, although not testable with science, if nothing else is found. Much of the evidence points to that. On the flip side, I do realize much more research and study is needed and that the Sturp team has not concluded all of what they would like to do, so at the moment we are all basically in “Shroud Limbo” until certain folk allow further study.\nR\n\n","date":"November 4, 2011 at 11:48 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4565","author":"Ron","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Before I will start looking for mystical answers (like our friend Fanti and so many others), I prefer to wait until science as come full circle about the natural hypothesis.  That’s all I’m saying.  Ask any real scientist you want and he will agree with me about this.  When you start to think about supernatural phenomenons before having check out every single natural possibility, it’s not science.\n\n","date":"November 4, 2011 at 1:01 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4576","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Think what you will, it’s your prerogative. But, also implying what some scientists are hypothesizing is ‘mystical answers’, is not absolutely correct science either. Truly, I don’t need to ask a scientist about anything, I can think for myself, thank-you. Remember scientists once thought flight was impossible, scientists once thought the sound barrier couldn’t be broken, science once thought nothing moved faster then light~now that is being challenged. Point is; even these hypothesis being put forward, although they seem like fiction to many, are only so because we have not advanced enough. We are just at the beginning when it comes to scientific knowledge. One must search for all possible explanations for the amazing image on the Shroud. Seriously with all the study accumulated over the past three decades by some of the best scientists we have and they are all ‘mystified’ at what could possibly cause this image!!…That alone, my friend, speaks volumes! Yes I agree keep searching for ‘natural’ causes, but don’t put down studies in ‘unnatural’ causes because you may be putting your foot in your mouth.\nPersonally, I believe the image was put there by God and that science will never figure it out. Maybe fitting, as God I believe would really like us to humble ourselves abit. This may be just the right tool to do so.\nR.\n\n","date":"November 5, 2011 at 9:56 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4596","author":"Ron","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Ron you say : “Remember scientists once thought flight was impossible, scientists once thought the sound barrier couldn’t be broken, science once thought nothing moved faster then light~now that is being challenged. Point is; even these hypothesis being put forward, although they seem like fiction to many, are only so because we have not advanced enough.”  Turn the thing around and remember that many religion believed (and still believe in some cases) that an earthquake come directly from God, same thing for a big storm or any disaster !  Those people believe that those NATURAL EVENT came directly from God because they were not able yet to explain them in a scientific way !!!  Don’t you think it’s a bit like that with the Shroud ???  Why things that we don’t fully understand have to come from a miraculous event ?  You said it well my friend, science is not advanced enough to fully explain every single phenomenon in the universe !  And I think science will never be advanced enough to explain everything…  That’s maybe why the Shroud body images are not fully understood FOR THE MOMENT.  How can you be so sure that it would be the case in 50 years from now ?  I repeat :  every single natural causes have not been fully analysed yet.  More researches need to be done.  At least, we agree on that !  And for the unnatural phenomenon like the Corona discharge (in the case of a dead corpse in a 1st century tomb, we can say that it’s a unnatural phenomenon), how can someone will be able to prove that a phenomenon like that is in any case related to the actual body images on the Shroud ?  How can someone can prove that a dead corpse can emit that kind of electrical discharge ?  It is something that is IMPOSSIBLE to reproduce in laboratory, so, from a scientific point of view, hypothesis like that will never be able to receive a real scientific confirmation…  On the contrary, if someone find the correct receipe to create naturally a body image on a linen cloth, that will be something that could be confirmed in laboratory by independent scientists.\n\n","date":"November 6, 2011 at 10:14 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4623","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"This is a real miracle, I agree with you Yannick 100%. The image formation process is NOT SUPERNATURAL. It results from the very specific burial ritual here applied.\n\n","date":"November 7, 2011 at 7:06 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4634","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"…and a possible corpse hyperthermy.\n\n","date":"November 7, 2011 at 7:10 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4635","author":"Max Patrick Hamon","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Yannick I think your analogy of earthquakes etc is pretty weak. Some people today still think all natural disasters are from God. Some people today also believe science is the answer to everything. Those same people you talk about, if they saw an F-18 fly over their heads would believe it was a chariot from the gods, so what?. Again, we are not talking religious thinking here verse science. Your trying to shirk the point which is simply; Just because we don’t understand or presently don’t have the means to test something scientifically, does not mean it cannot be true. Again, we are in our infancy when it comes to our science, so how on earth can you deny that some hypothesis are bogus? …Who knows maybe sometime in the future, we may advance enough to test some of these hypotheses. Don’t forget, there are alot of theories and hypotheses out there right now in the scientific world that are only that, hypothesis and theories, not testable and/or not proved. I don’t hear you bitching about any of those.\nR.\n\n","date":"November 7, 2011 at 4:38 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4629","author":"Ron","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Sorry; the line should read; so how on earth can you SAY that some hypotheses are bogus?\n\n","date":"November 7, 2011 at 4:43 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4630","author":"Ron","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Ron, I don’t want to start a war of the words with you.  All I can answer is to repeat this : And for the unnatural phenomenon like the Corona discharge (in the case of a dead corpse in a 1st century tomb, we can say that it’s a unnatural phenomenon), how can someone will be able to prove that a phenomenon like that is in any case related to the actual body images on the Shroud ? How can someone can prove that a dead corpse can emit that kind of electrical discharge ? It is something that is IMPOSSIBLE to reproduce in laboratory, so, from a scientific point of view, hypothesis like that will never be able to receive a real scientific confirmation… On the contrary, if someone find the correct receipe to create naturally a body image on a linen cloth, that will be something that could be confirmed in laboratory by independent scientists.\n\n","date":"November 7, 2011 at 11:57 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4642","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"In other words, how can any scientist from any time in the future will be able to take a dead corpse into a lab and show that it can emit an electric discharge (or any kind of burst of energy) ?  This is pure science fiction.  And I want to say this :  The gospel NEVER refr to the resurrection of Christ with words like burst of energy or something related.  To see the resurrection event that way is only due to Hollywood movies !  It’s a trick of our imagination and nobody will NEVER be able to prove that it really happened like that.\n\n","date":"November 7, 2011 at 12:01 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4643","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Yannick you stated “this is pure science fiction”~ It wouldn’t be the first time that ‘science fiction’ became reality, would it?… I’ve stated my position and it is a ‘neutral position’, neither for or against either hyp/ theory, but to take any stand other then that, at the moment, would be plain quess work and assumptions. Strictly stating that the formation must be ‘absolutely a natural chemical reaction’ or ‘phenomena’ or Max’s position of “the image formation IS NOT SUPERNATURAL”, is just plain wrong and dare I say closed minded….Sure we can’t test body energy hypotheses at the moment and maybe never will, but it still does not put them in the ‘lunatic fringe’ department, …JUST UNKNOWN. Oh, also let’s not start getting into the scriptures here to back our positions, as that would be fruitless, scriptures can and have been interpretted differently for millenia.Scriptures also never mentions an image on the Shroud either. Chemical or otherwise.\nR.\n\n","date":"November 7, 2011 at 2:26 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4649","author":"Ron","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"All I say is that there’s nothing in the gospel account of the resurrection to backed-up a supernatural hypothesis.  In Hollywood movies, yes.  In the gospels, no.  And you’re totally right about the extreme positions…  This morning, I wanted to say something about that versus Max comment but I didn’t had time.  Here’s what I want to say about this (to make sure anyone knows where I stand) : I’m a catholic who believe in the resurrection of Jesus and that the Shroud is genuine.  I also ASSUME that the images on it were created naturally because I see the Shroud as a material archaeological artefact and I want to stay rational about that.  I can’t say 100% sure that it was a natural phenomenon just because it is linked to Jesus-Christ and we never know.  BUT, to be scientifically correct, until science will have disprove EVERY SINGLE NATURAL POSSIBILITIES THAT CAN EXIST TO CREATE A COLORATION ON A LINEN CLOTH (AND THERE’S MANY THEORITICAL POSSIBILITIES BY THE WAY), I WILL NEVER GO IN THE SUPERNATURAL FIELD BECAUSE FOR ME, IT’S A WASTE OF TIME (SCIENTIFICALLY SPEAKING).  WHY ?  BECAUSE THOSE HYPOTHESIS WILL NEVER BE REPLICATED IN A LABORATORY.  CONSEQUENTLY, SCIENCE WILL NEVER BE ABLE TO CONFIRMED THOSE KIND OF IDEAS.  That’s my position and I respect yours.  I don’t say I know all truth about the Shroud because I can’t even state for sure one natural hypothesis that can fully explain the images.  All I say is that it is prudent to let science explore all the natural possibilities before anything else (and there’s room for a lot more experiments and analysis than what have been done until this day).  To me, that’s the proper way to do science.  I talk about science here, not faith.  I believe myself that the Shroud offer a sign of the resurrection of Jesus.  If it would be a proof, don’t you think many more people would have been convert by this cloth ?  Personally, I don’t know one single person that have been converted by it.  Why ?  Simple !  To see the sign of the resurrection on the Shroud, you got to have faith first !!!\n\n","date":"November 7, 2011 at 3:08 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4651","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"There is also nothing in the scriptures that back-up some form of chemical reaction for the image, quite the contrary actually, as absolutley NO ONE witnessed the Ressurection!…just the aftermath…Furthermore the aftermath speaks of angels, and of Mary seeing Christ. Is this not supernatural? How did the the huge bolder enclosing the tomb get moved? Chemically?…What happened in the tomb was a mystery to those who found it empty. As for scientific study, and as of today, not one scientist has been able to explain the images ‘chemically’ or even offered a probable chemical cause that covers all the specific attributes of images (and I doubt they will) Why? Because it seems improbable if you understand all the intricacies of the image.But even with my doubt, I will not dismiss the possibility.You also cannot say that any radiation hypothesis is improbable only because we don’t have the means, ‘presently’, to test them….So unlike some other matters dealing with the Shroud, we’ll just have to agree to dissagree.\nAs for converting people by using the Shroud as witness or a clue, whatever. Atleast to try to catch thier attention, forget it, I’ve tried, with family and friends…No one seems interested…to my sometimes dismay but also to my sadness.\n\n","date":"November 8, 2011 at 7:19 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4677","author":"Ron","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"A witness of the resurrected Christ is not the same than a by-product of the resurrection.  It’s just our imagination that actually think that this event should have come with some kind of burst of energy of some sort !  That has a lot to do with Hollywood movies.  And as I often say :  Jesus resurrection was not the same event than Dr. Frankeinstein who reanimated a monster with an electric discharge !  For the chemical properties of the image, I think a guy like Ray Rogers did understand it pretty well.  Of course, more researches need to be done to confirm some of his conclusions.  That could happen when a new series of direct tests will be permit by the Vatican.  And for the conversion thing, your experience confirm what I just thought…  The people interested in the Shroud are mainly people who already have faith but who wants to reinforce their faith (and it’s all right).  And even many Christian believers doesn’t care one bit about the Shroud !  It’s sad but it is the reality and we must accept it.  The purpose of the Shroud is not to convert anybody and the Catholic Church have understand this aspect perfectly and that’s why this relic is not push forward by the Church to convert people…  At least, on this aspect I agree totally with the Church !\n\n","date":"November 9, 2011 at 9:35 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4682","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"I should add that there’s a slim possibility that some people may be convert by this relic but I have serious doubts about that.  I think, as Maria state, that the Shroud is more something that can strenghten the faith of you and me who already believe in the resurrection.  I really think it’s true.\n\n","date":"November 7, 2011 at 3:21 pm","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4652","author":"Yannick Clément","site":"shroudstory"},{"title":"A Reaction to Giulio Fanti’s Suggestion","post":"Ho !  By the way, I want to add something VERY important about the Shroud :  Our faith CAN be reassured by the Shroud and his images (blood and body images) even if we don’t believe it shows any proof of the resurrection and even if we don’t believe the body images come from a by-product of the resurrection.  I’m the perfect example of this !  My faith was really fortified by the Shroud because of the SIGN of the resurrection that I’m able to see on it, not because I think the body image has something to do DIRECTLY with the resurrection…  That’s the way I feel about the Shroud.  But I understand that other people like Ron feel differently and it’s ok too, as long as you don’t try to make believe that the Shroud offer really a scientific proof of the resurrection, because it’s not true at all.  Acting that way would not be honest and that’s why I react so hard against some scientists who push this issue forward with a clear agenda in mind (I don’t need to mention any name here because the list would be pretty long).\n\n","date":"November 9, 2011 at 11:26 am","url":"https://shroudstory.com/2011/11/02/a-reaction-to-giulio-fantis-suggestion/","cat":"carbon_14_dating","id":"comment-4683","author":"Yannick Clément","site":"shroudstory"}]
