[{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"“But is there anything in it that might impact the accuracy of the shroud’s dating?”\nNot directly, but it helps to understand what a robust result is, and the results of the radiocarbon dating of the Shroud are not robust. The choice of the statistical analysis, which ultimately lead to a tiny 5% significance level, is subjective.\n\n","date":"August 22, 2015 at 4:08 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208711","author":"anoxie","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"Why are the other scientists and “scientists” quiet?\n\n","date":"August 22, 2015 at 5:08 pm","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208736","author":"Louis","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"Sorry, Louis, should we have leapt in shouting? This paper raises some interesting questions regarding minor discrepancies in some ancient radiocarbon dating with minimal relevance to Medieval Europe. It is well known that atmospheric C14 varies over time, which is why experimentally derived dates “before present” have to be calibrated against a zig-zag line, derived mostly from tree-ring dating, to produce a calendar date. The authors find that even this does not match radiocarbon findings with accurately known dates in some circumstances, particularly connected with ancient Egyptology, and explore some reasons why. Local variations in atmospheric C14, cause by volcanic eruptions or marine upwelling, for example, and the ‘old wood’ effect, which, by relating the radiocarbon date of part of a long lived tree to the site where it was used for construction, leads to an older than accurate date for an event such as the site’s construction or destruction.\nHowever, the thrust of Zerbst and van der Veen’s paper, as exemplified by their last example, that of the discrepancy of 200 years between the radiocarbon and historically accepted dates of the destruction of Nineveh, is not that the radiocarbon date is wrong, but that a serious review of the of the accepted historical date is required.\nFinally, the last nail in the ‘the carbon dating must be wrong’ aspiration, is that the radiocarbon date discrepancy invariably makes the radiocarbon date older than the calendar date. Although this paper has no relevance whatsoever to the Shroud, if it had, it would demonstrate that the date of manufacture must later than the radiocarbon date, not earlier, and lend credence to the da Vinci hypothesis.\n\n","date":"August 23, 2015 at 4:03 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208753","author":"Hugh Farey","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"Thanks, Hugh. I had recommended the paper with the intention of demonstrating that radiocarbon dating is not beyond controversy. The comments on this thread have helped to understand that CD is not really an “unsinkable Titanic”. The paper also helps us understand that radiocarbon dating and archaeology do really clash sometimes.\n\n","date":"August 23, 2015 at 8:45 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208768","author":"Louis","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"It would seem that despite his scientific credentials, Hugh is still unable to get his head around the need for representative sampling from an object not scientifically shown to be homogeneous, a need only too apparent to one with some engineering credentials and who still has some recollection of his knowledge of the requirements of applying the techniques of probability theory.  From his comments, it would only seem that the patched area from which the sample was taken might be younger than the 14th century, or that some unknown contaminant was not removed by the cleaning process, or that (etc, etc …) .\n\n","date":"August 24, 2015 at 4:09 pm","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208886","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"only engineers are considering representative sampling but not the scientists.\n\n","date":"August 24, 2015 at 6:47 pm","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208895","author":"Sampath Fernando","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"What are Hugh’s scientific qualifications?\n\n","date":"August 25, 2015 at 2:50 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208910","author":"Thomas","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"Do my qualifications matter? For what they’re worth, a degree from the UK Open University and 40 years of teaching, but so what? Everything I have posted on this blog has not depended on my authority, but on my observations, reading, and the conclusions I have drawn from it. All my observations and reading have been reported in detail, how I arrive at the conclusions I have drawn from them, and how definitive I consider those conclusions to be. If you disagree with my observations, that’s fine; if you disagree with my conclusions. that’s fine too, but to suggest that they must be wrong (or right) on the basis of my qualifications (or lack of) is puerile.\n\n","date":"August 25, 2015 at 3:00 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208912","author":"Hugh Farey","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"I was just genuinely interested in what your qualifications are Hugh. Qualifications can be overrated, anyway. Freeman is a qualified historian yet spouts plenty of garbage. In my field of work, some of the most qualified professionals are some of the poorest.\n\n","date":"August 25, 2015 at 3:13 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208914","author":"Thomas","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"If you don’t have professional qualifications, you can’t be listened to, if you do have relevant professional qualifications you speak garbage anyway, so the debate is frozen and the Shroudies continue to be isolated from any new ideas of whatever relevance or quality. The rest of us , in touch with wider academic thought on painted linens, medieval weaves,etc, just get on with things! No need to share our findings here as they won’t be listened to !\n\n","date":"August 25, 2015 at 3:31 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208917","author":"Charles Freeman","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"Hello daveb and Sampath\nWith the latest developments forget about representative sampling and petitions to the Pope. The Shroud is not part of the Deposit of Faith for the Church, it may be for others.\n\n","date":"August 24, 2015 at 7:37 pm","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208896","author":"Louis","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"Louis, I shall not forget about representative sampling, it is absolutely fundamental to any scientific testing whatsoever, in whatever field you want to name.  As for petitions to the Pope, others can worry about that if they wish to pursue it, but I have no interests there.  As for the Shroud not being part of the Deposit of Faith of the church, I see that argument as irrelevant.  If the Shroud is indeed the authentic burial cloth of Christ, then it just happens to be the most precious relic that we can ever hope to have!  It has the potential of creating an enormous amount of hope for humanity, and can become a most potent tool in evangelisation, and God knows, the world in its present unholy mess surely needs it!\n\n","date":"August 25, 2015 at 5:29 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208926","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"Hello daveb\nYou seem to have misunderstood what I wrote above. To get representative sampling a petition will have to be sent to the Pope, who will ignore it for two reasons: the relic is not a part of the Deposit of Faith and Shroud studies have missed the mark, not to forget the minefield. So there is no point in fuming and fretting. All Christians have to live by faith, not by material supports, which can serve as props for faith depending on whether one believes in them or not. So,basically, we have to believe what is in the New Testament:\n“Jesus said to him: You believe because you can see me. Blessed are those who have not seen and yet believe”.\nJohn 20:29, from the New Jerusalem Bible (editor: Dom Henry Wansbrough, OSB), which is the version I use.\nI do think that the Shroud is authentic and that the 1988 results may have been skewed. Like Ian Wilson, I also think that it may not be an object suitable for carbon dating. He has provided a number of good reasons in his last Shroud book.\nBut, what happens if for some reason or the other, the fresh sampling you are demanding for carbon dating does not give the desired results for pro-authenticists? There will be no “enormous hope for humanity” but despair.Is that what you would like to see?\n\n","date":"August 25, 2015 at 10:02 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208952","author":"Louis","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"“Hugh is still unable to get his head around…” What a very stupid lot we non-authenticists are. Either we “completely ignore” or “can’t get our heads arounds” the simplest concepts which every authenticist finds utterly obvious. \nWell, there’s no answer to that. If that’s the conclusion all authenticists come to after reading the dozens of comments made by non-authenticists regarding these very points, then there seems little point in re-iterating them. It’s a faulty, wholly incorrect, and slightly insulting conclusion, but there seems little point in trying to explain why.\nIf daveb and Sampath are not, in fact, representative of authenticism as a whole, and think that non-authenticists may not be as stupid as they appear, they will be able to find ample justification for our position in the pages of this blog.\n\n","date":"August 25, 2015 at 2:51 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208911","author":"Hugh Farey","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"So why not create  a new “Shroud” site, Hugh, one that has a non-authenticity slant as a counterpoint to this one? Maybe under BSTS auspices, maybe not?\n\n","date":"August 25, 2015 at 3:16 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208915","author":"Colin Berry","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"As imperfect as this blog is, it remains the best Shroud site for on-going discussion. Dan does try to be objective (but yes he’s human). If you and Hugh and others who lean non-authenticity left to do your own site it would result in two echo chambers. The fact that this blog is contentious is a good thing. I just wish the personal jabs would take a holiday, especially against Hugh, as he is the most restrained commenter I’ve seen. If we could all stay ‘on point’ it would be more productive. One cannot expect Dan to be kindergarten cop.\n\n","date":"August 25, 2015 at 8:45 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208942","author":"David Goulet","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"Look hard enough, and the keen eye may observe  a progressive non-authenticity learning curve.  But it’s being drowned out – deliberately so in my candid opinion –  by repetitive chatter and unconstructive, indeed often destructive rhetorical point-scoring.\nThere is a need for a more focused non-authenticity promoting site that has focus AND a visible and progressive learning curve. I invite Hugh and others to join me in creating a new site. Title? Maybe shroudfocus.com?\n\n","date":"August 25, 2015 at 9:19 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208945","author":"Colin Berry","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"Hugh, you made a very clear statement, “Finally, the last nail in the ‘the carbon dating must be wrong’ aspiration, is that the radiocarbon date discrepancy invariably makes the radiocarbon date older than the calendar date”  which virtually corroborates your long-held position supporting the carbon dating of 1978.  You’ve continued to hold this position despite my and others’ somewhat persistent attempts to point out to you that the representativeness of the sample taken is highly questionable.  For that reason alone, it cannot be as you have stated ‘the last nail in the carbon dating aspiration’ must be wrong.    \nYes, the sample may be younger than the date from radiocarbon dating.  But, so what!  In terms of the cloth as a whole, it is fundamentally meaningless.  As you state, you have attempted to defend it.  But despite your attempts, I and others continue to consider it to be indefensible, and that that is an entirely rational position to hold!\n\n","date":"August 25, 2015 at 3:22 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208916","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Food for Thought: An Important Paper on Radiocarbon Dating","post":"Ah, well that explains it. My remark was entirely related to the paper I was commenting on, in which, perhaps by coincidence, all the discrepancies noted by the authors made the radiocarbon date older than the historical date, so that, if any extrapolation were to be made to the Shroud, it would carbon date as older than it actually is, even if the samples taken were agreed to be representative. Neither the paper nor my comments had anything to do with whether a sample is representative or not, except perhaps in the context of the ‘old wood’ effect.\nSo, of course a sample has to be chronologically representative of the object to be dated. Astounding though it seems to authenticists, even non-authenticists can ‘get their heads around’ that. Furthermore, the most detailed examination of the evidence suggesting that the radiocarbon sample was not representative was carried out by myself. Who was the first person to notice that the quad mosaic images have a broad blue band covering the image which demonstrates that the green corners cannot be considered definitive evidence of chemical inconsistency? Who was the first person to notice a video featuring Ray Rogers talking about UV fluorescence, while the camera zoomed meaningfully into a close-up of Jesus’s buttocks, apparently thinking it was the radiocarbon corner? Who was the first person to show that Ray Schneider’s pronouncement at St Louis, saying that there was 99.9% correlation between an alleged UV colour discrepancy and the alleged contamination of the Shroud in fact demonstrated that the contamination made the Shroud appear older, not younger, than it really is? Who was the first person to tabulate the various proportions of cotton found in various threads from the Shroud by various microscopists and show that they were inconsistent? Who was the first person to notice that Jeffrey Skurka’s image purporting to show evidence of a radiocarbon discrepancy was actually taken from a leaflet simply illustrating the procedure? Who is the only person to have suggested that Ray Rogers’s discovery of madder and water-soluble plant gum could be interpreted as anything other than an attempt to make interpolated threads look the same as the original? Who? Yup, moi, from start to finish.\nAnd how have I ignored any contradictory evidence? What have I said about Rogers’s vanillin findings? What have I said about Fanti’s mechanical findings? What have I said about the ‘invisible mending’ hypothesis? \nRight. Now what do we make of all this? There is evidence both in favour of, and against, the possibility that the radiocarbon sample was not representative of the Shroud as a whole. All I have ever declared is that to my mind, the evidence suggesting this is not as compelling as the evidence denying it. There have been, it is true, persistent attempts to change my mind, but they have never produced any other evidence than what I have analysed myself. I do not deny others’ rights to feel that that the evidence persuades them differently. I do not accuse them of ignoring the contrary evidence, of stupidity or of not being able to understand me. I assume that after considering everything I have brought up in this blog, as well as any other evidence which hasn’t been discussed, they have come to a different conclusion. And that’s fine by me. (Except that if they have any more persuasive evidence, perhaps they’d like to present it.)\n\n","date":"August 25, 2015 at 8:01 am","url":"https://shroudstory.com/2015/08/22/food-for-thought-an-important-paper-on-radiocarbon-dating/","cat":"carbon_14_dating","id":"comment-208935","author":"Hugh Farey","site":"shroudstory"}]
