[{"title":"Francis Bacon and the Shroud of Turin","post":"Those who seek the truth shouldn´t be bothered by the predictable behaviour of so called skeptics.\nThey are not interested to know  and they hide new evidence that contradicts their claims.\nI know by heart what  they claim about the Shroud beeing a painting , a kind of protophotograph, the conclusions of the «world famous microscopist and forensic expert Walter Mccrone » ,the anatomical errors of the image of The Man of the Shroud, the coherent results of the 3 radiocarbon labs , the lack of historical Shroud records before 1356 ,and a lot of more crap.\nWhat do they argue to disclaim the works published in peer reviewed  scientific magazines ?\nI don´t ask them to be believers I just ask them to be honest and have an opened mind to undeniable facts  which I summarize\nFACTS:\n1) The Shroud of Turin is neither a painting nor a photograph\n2) Science already knows the chemistry of that superficial image and the way it was impressed on the fabric\n3) There is yet no explanation ( not from a theological but from a scientific point of view ) for what caused the cromophores on the topmost fibers of the cloth to produce as a whole such an unique  negative  image with 3D and Holographic encoding.\n4) At present time no one was able to create an image with all the characteristics of the one in the Turin Shroud\n5) The image of The Man of the Shroud has forensic evidence that legitimates connecting it to the descriptions of Christ´s  Passion as we read in the Gospels\n6) As the agnostic doctor Yves Delage concluded in 1902 the man´s image depicted on the Shroud  IS INDEED  JESUS CHRIST\n7) There  are indeed reliable documental and pictorial recordings of the Shroud before 1356, altough not in western Europe.\nit´s preposterous to claim that  « the medieval forger of the Shroud was inspired by the Pray Codex » !!!\n8) 1988 radiocarbon dating of the Shroud is invalid ; all peer reviewed scientific works concuded that the sample was cut from a area of medieval invisible mending ,so there is no  radiocarbon dating of the Shroud ´\nThe late chemist Raymond Rogers  concluded in his peer reviewed article published in Thermochimica Acta that the age of the cloth was surely 1300-3000 years , it could be Christ´s burial cloth\n9) Shroud scientific researchers are not trying to convince unbelievers or flawing conclusions to .give support to christian beliefs.\nThey are making non profit investigation on this such unique  relic  that deserves a special status in scientific world.\n                                                   greetings,\n                                     Maria da Glória\n\n","date":"October 1, 2008 at 9:53 pm","url":"https://shroudstory.com/2008/09/29/francis-bacon-and-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-141","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"}]
