[{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"Stephen’s prime source of incredulity is that the radiocarbon dating places the manufacture of the shroud at the same time as it is supposed to have been manufactured.\nStephen goes on to point out occasions when samples from a single event were dated by different laboratories and produced wildly different dates up to 800 years in range. The shroud samples were dated by different laboratories and produced consistent dates with a 150 year range.\nIt may be that Stephen is correct in his supposition that the radiocarbon dating was wrong, and it may be that it was wrong becaue of deliberate fraud, computer hackers, or extra-terrestrial intervention. But none of Stephen’s carefully emphasised incredulity supports any such thing.\n\n","date":"February 19, 2014 at 5:39 am","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-80546","author":"Hugh Farey","site":"shroudstory"},{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"The Carbon dating is suspect for several reasons which have been interminably argued on this site. I get the impression from the much-publicised photo of the announcement, that the skeptical leaders of the laboratories felt quite smug and self-satisfied with their results.  They had debunked the imagined authenticity of a religious relic. But I doubt very much that it was intentional fraud.  I think it was merely the incompetence of everyone involved: the ditching of the protocols; ditching of concommitant testing of the samples by other means; the lack of a formal sampling regime; and the unfortunate choice of the sampling site. Perhaps Providence thought it more important to teach everyone involved a lesson in humility by playing a trick on them!  Time will ultimately reveal the truth of the matter. “My ways are not your ways” saith the Lord!\n\n","date":"February 19, 2014 at 6:25 am","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-80557","author":"daveb of wellington nz","site":"shroudstory"},{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"Dan\nThanks again for the free publicity!\nWhether you believe it or not, the labs being duped by a computer hacker was going to be one of the fraud possibilities in my series that I terminated because I realised it was going to take too much time to address all fraud possibilities.\nIt is you and some of your readers who seem to have jumped to the conclusion that fraud can only mean by the laboratories’ leadership. I have been thinking of the laboratories being duped by a hacker possibility since at least 2007. I regard that as a type of fraud.\nAnd, as you will see, computer hacking by a laboratory insider (or insiders) is a real possibility, which would be a type of fraud by the laboratories, but not necessarily by one of their leadership. \nAnd even if the labs were duped by a hacker, there still could have (and probably would have) been low-level fraud that Broad and Wade refer to in “making results appear just a little crisper or more definitive than they really are, or selecting just the `best’ data for publication and ignoring those that don’t fit”:\n“The term `scientific fraud’ is often assumed to mean the wholesale invention of data. But this is almost certainly the rarest kind of fabrication. Those who falsify scientific data probably start and succeed with the much lesser crime of improving upon existing results. Minor and seemingly trivial instances of data manipulation-such as making results appear just a little crisper or more definitive than they really are, or selecting just the `best’ data for publication and ignoring those that don’t fit the case-are probably far from unusual in science. But there is only a difference in degree between `cooking’ the data and inventing a whole experiment out of thin air.” (Broad, W.A. & Wade, N.J., 1982, “Betrayers of the Truth: Fraud and Deceit in the Halls of Science,” Simon and Schuster: New York NY, p.20).\nWhich has always been my MINIMUM claim.\nPS: It’s strange you didn’t find “Arizona” in your Kindle version of Stoll’s book. In my paper version, opposite the title, it says:\n“Clifford Stoll is an astronomer by training and a computer security expert by accident. He received his Ph.D. from the UNIVERSITY OF ARIZONA in 1980 and has since then worked as an astronomer, scientific programmer and computer systems manager in various observatories and laboratories.” (my emphasis).\nThough it is not my claim that Stoll mentions radiocarbon dating or the Shroud (I read the book years before I became interested in the Shroud), it is a bonus for me that Stoll received his PhD from Arizona, as you will see.\nStephen E. Jones\n\n","date":"February 19, 2014 at 6:32 am","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-80559","author":"Stephen E. Jones","site":"shroudstory"},{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"Both clergymen and scientists are human and make mistakes and the 1988 carbon dating was not conducted as it should have been. That is why the controversy is raging till today.\nMistakes made by scientists and published in the best scientific journals are many. Here is an example from this week:\n http://stapcell.blogspot.com.br/2014/02/image-similarity.html\n\n","date":"February 19, 2014 at 3:57 pm","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-80670","author":"Louis","site":"shroudstory"},{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"Hacking?  Really?\nHypothetical #1:  If the dating (performed as it was) returned a value in a range including 33 AD, would the same charges of “poor science” be levied as fervently?  Not by the skeptics, but by the same population that currently points out “what went wrong?” so adamantly involving the reported dates.  Or would one corner now be sufficient to “verify” the expected answer?  \nHypothetical #2: If the dating had been performed such that multiple sites were evaluated by multiple labs, and good science practice was ensured and enforced all around-And all computers were encrypted to the max: would a date in the 1300 range now be accepted, or would charges such as “bias”, “fraud”, “hacking” still be applied?   \nFraud is a very strong word-shouldn’t even be mentioned unless sufficient, tangible proof exists.\n\n","date":"February 19, 2014 at 5:37 pm","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-80698","author":"Kelly Kearse","site":"shroudstory"},{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"I agree 100%. Your hypotheticals demonstrate a need for consistency. I’m an authentist but I realize that what’s good for the goose is good for the gander. There are valid criticisms levied against the C-14 dating, none of which require the leap to fraud. Prove it, or retract the insinuation.\n\n","date":"February 20, 2014 at 10:39 am","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-80886","author":"David Goulet","site":"shroudstory"},{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"Thank you for the challenge to try a more 3D template, David. It got me out of a rut (through making me deploy that “awkward”  brass crucifix). \nHave since moved on considerably and think I’ve cracked it (SUAIRE on the Machy Mould being the “spy clue,”)\nSeek and ye shall find… Yup, methinks I’ve finally found what I was looking for – a rationale for a 14th century-fabricated TS (after 2 years of hard unremitting slog with over 200 postings).\nDan and his shroudstory.com has churlishly used me for a wholenumber of mocking posts, largely for entertainment value. \nTime now for me to use his site to flag up my breakthrough (two-step evolution of the Shroud image- first scorch (Templar era) then attempt (Lirey era) to re-invent as a ‘super suaire’ – a whole-body version of the Veil of Veronica.\n\n","date":"February 20, 2014 at 11:07 am","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-80893","author":"colinsberry","site":"shroudstory"},{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"\ncolinsberry :\nThank you for the challenge to try a more 3D template, David. It got me out of a rut (through making me deploy that “awkward”  brass crucifix).\nHave since moved on considerably and think I’ve cracked it (SUAIRE on the Machy Mould being the “spy clue,”)\nSeek and ye shall find… Yup, methinks I’ve finally found what I was looking for – a rationale for a 14th century-fabricated TS (after 2 years of hard unremitting slog with over 200 postings).\nDan and his shroudstory.com has churlishly used me for a wholenumber of mocking posts, largely for entertainment value.\nTime now for me to use his site to flag up my breakthrough (two-step evolution of the Shroud image- first scorch (Templar era) then attempt (Lirey era) to re-invent as a ‘super suaire’ – a whole-body version of the Veil of Veronica.\n\nLooking forward to your work. You should check out Penn and Tellar’s new doc “Tim’s Vermeer” – which reminds me very much of your quest. I think “Colin’s Shroud’ would make for a nice sequel. Seriously.\n\n","date":"February 20, 2014 at 12:34 pm","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-80905","author":"David Goulet","site":"shroudstory"},{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"David: please rephrase in terms which a simple uncomplicated prole like myself can understand,\n\n","date":"February 20, 2014 at 2:32 pm","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-80937","author":"colinsberry","site":"shroudstory"},{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"From Colin’s blog: “The latter has been chosen as a critical point in time (mid 14th century)  where the Mk1 Shroud is hypothesized to be an intense scorch on newish linen of a metal effigy (bronze crucifix?)  chosen to approximate a  Knight Templar, maybe Jacques de Molay of Geoffroi de Charney, slow-roasted in the manner of St.Lawrence.”\nColin,\nnow it seems to me you think that, according to you, the “ancestor” of the TS was an “intense scorch” that was later subtly “re-processed to produce a fainter image on a darker background, so as to make it seem like a larger, whole body version of the Veil of Veronica, as  conceptualized  and promoted by  Lord of Lirey de Charny (de Charney’s nephew?) (…).\nLet’s forget your very dubious historical scenario.\nPreviously you wrote that the TS image was a faint scorch  involving conduction and convection (I would like to see any kind of discoloration of linen fibers by convection).\nNow it seems to me that you are referring to an “intense scorch” later “re-processed” by artificial ageing.\nDo you have some problem with the scorch hypothesis ?\n\n","date":"February 20, 2014 at 5:20 pm","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-80974","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"Penn and Tellar are famous professional magicians and ardent skeptics who follow in the footsteps of James Randi. They have a documentary out called Tim’s Vermeer and here’s the synopsis: “Tim Jenison, a Texas based inventor, attempts to solve one of the greatest mysteries in all art: How did 17th century Dutch Master Johannes Vermeer (“Girl with a Pearl Earring”) manage to paint so photo-realistically — 150 years before the invention of photography?”  \nTim is an out of the box thinker like you and he’s demonstrated convincingly with experiments how Vermeer ‘did it’.\nYou’re attempting to do the same thing with the Shroud, hence my sequel suggestion.\n\n","date":"February 21, 2014 at 10:38 am","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-81164","author":"David Goulet","site":"shroudstory"},{"title":"From Fraud to Computer Hacking in Carbon Dating the Shroud of Turin","post":"\nThibault HEIMBURGER :\nFrom Colin’s blog: “The latter has been chosen as a critical point in time (mid 14th century)  where the Mk1 Shroud is hypothesized to be an intense scorch on newish linen of a metal effigy (bronze crucifix?)  chosen to approximate a  Knight Templar, maybe Jacques de Molay of Geoffroi de Charney, slow-roasted in the manner of St.Lawrence.”\nColin,\nnow it seems to me you think that, according to you, the “ancestor” of the TS was an “intense scorch” that was later subtly “re-processed to produce a fainter image on a darker background, so as to make it seem like a larger, whole body version of the Veil of Veronica, as  conceptualized  and promoted by  Lord of Lirey de Charny (de Charney’s nephew?) (…).\nLet’s forget your very dubious historical scenario.\nPreviously you wrote that the TS image was a faint scorch  involving conduction and convection (I would like to see any kind of discoloration of linen fibers by convection).\nNow it seems to me that you are referring to an “intense scorch” later “re-processed” by artificial ageing.\nDo you have some problem with the scorch hypothesis ?\n\nAll I’ve done is to bring “artificial ageing” to the top of the agenda. Others before me have suggested it, notably Luigi Garlaschelli.The only difference is that in my model the scorch imprint was there initially, and simply  needed to be toned down, not just by reducing image intensity, but by raising  that of the background..How that was done is a matter of conjecture  but the testimony of Count Antoine de Lalaing (1480- 1540) provides a clue (“boiling in oil” etc).\nBut this is not  the place to be discussing  MY ideas that accept the radiocarbon dating\nKindly address ideas expressed on my site to that site, or to one of your impregnable pdfs – not here…\n\n","date":"February 20, 2014 at 5:55 pm","url":"https://shroudstory.com/2014/02/19/from-fraud-to-computer-hacking-in-carbon-dating-the-shroud-of-turin/","cat":"carbon_14_dating","id":"comment-80977","author":"colinsberry","site":"shroudstory"}]
