[{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"Who was Jesus married to?\n\n","date":"April 11, 2014 at 10:41 am","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-98368","author":"Louis","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"In “theory” he was supposed to be married to St. Mary of Magdala, Personally, I don’t believe it, why would the Son of God marry.  There is no need to. As for priests marrying, Mother Church is their wife and the people are their children if you need to think in those terms. A priest’s life is to be dedicated to God, not a separate Earth family needing the moral and financial obligations being met.\n\n","date":"April 11, 2014 at 2:44 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-98412","author":"ekmcmahon","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"Funny that Jesus chose mostly married men to be his apostles. The Orthodox Church seems to have survived quite nicely with married priests. As did the early Church. A “priest’s life is to be dedicated to God” — and the life of every believer isn’t called to be dedicated to God?\nWe’re straying well off the Shroud as topic here. Probably not a wise idea.There are other forums for these kind of discussions.\n\n","date":"April 11, 2014 at 3:31 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-98426","author":"David Goulet","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"I was waiting for a reply from webmaster Dan to learn who Jesus’ wife was.\n\n","date":"April 11, 2014 at 4:18 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-98429","author":"Louis","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"“Of course priests should marry. Jesus was married!!!”\nActually, I think so but not because of the GJW\nYeah, that’s awkward!\n\n","date":"April 11, 2014 at 4:20 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-98430","author":"O.K.","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"Whatever the views others have posted, I’m still waiting\n\n","date":"April 11, 2014 at 4:42 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-98438","author":"Louis","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"I may be wrong, but I don’t think it was the “Jesus was married” bit that Dan was agreeing with; it was the “Of course priests should marry” bit. There are other arguments for married priests that do not involve either the GJW or Jesus’s actual marital status.\n\n","date":"April 11, 2014 at 7:17 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-98465","author":"Hugh Farey","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"Jesus’ appreciation of celibacy can be gauged from his saying on eunuchs, but I am still waiting to learn what exactly Dan was trying to say.\n\n","date":"April 11, 2014 at 7:25 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-98470","author":"Louis","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"It’s too obvious that most commenters on the GJW fragment just don’t get it, including apparently Fr Longenecker.  The quasi-debate as to whether Jesus was married or not, is irrelevant.  The absence of any reference to a wife in canonical and most pseudonymous scriptures, and the lack of any tradition of his being married, persuades most exegetes that Jesus was not married.\nKaren King has always made the most sensible suggestion that the most likely interpretation of the fragment is that it reflects a debate within a particular group concerning the merits of celibacy and marriage.  The debate is even reflected in some of Paul’s epistles, which sometimes express a preference for celibacy. Obviously no religious group can survive indefinitely without some form of marriage, otherwise it would die out. \nThe fragment would therefore seem to emanate from within such a group trying too hard to make a case for marriage by attempting to claim that Jesus himself was married. \nThe fact that one of the laboratories returned a Ptolemaic date for the fragment, while other tests placed both fragment and the control samples in the 7th-8th century AD, must raise critical questions concerning C-14 dating of such artifacts, obviously only too relevant to the dating of the TS.\n\n","date":"April 11, 2014 at 4:34 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-98433","author":"daveb of wellington nz","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"There’s no Biblical or historical evidence that Jesus was married. People rely too much on pop culture stuff like Holy Blood, Holy Grail and Dan Brown’s potboilers.\n\n","date":"April 11, 2014 at 6:58 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-98461","author":"Larry","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"Which of the twelve  male Apostles or 7 women Disciples who were alive and walked with Jesus  wrote a fact about Jesus being \\married??  Just because someone 200 or 400 or 800 or 2000 years after the fact said a word about marriage or wife in the same sentence as the name of Jesus, is not factually stating that Jesus was married.\n\n","date":"April 11, 2014 at 7:23 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-98467","author":"ekmcmahon","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"kinda a cheap shot with the pic of the bishops residence….please remember the shroud is in Catholic possesion\n\n","date":"April 15, 2014 at 2:03 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-99626","author":"rick","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"Yeah, maybe. But the cheap shot wasn’t directed at Catholics. It was, in this case, because a Roman Catholic priest (formerly Episcopalian) was begging for money online, having difficulty supporting his family. It was a Catholic archbishop who was living in a lavish house. It happens in every tradition. The rector of Trinity Wall Street Episcopal Church lives in an in town Manhattan mansion that is even bigger and more expensive. The church paid for it. \nIt was Catholics who finally shamed the archbishop into selling his Atlanta home. Good for them. Pope Francis has set the tone and that is why not only Catholics love him but so does everyone.  \nHere is an RNS story as it appeared in the Washington Post: \nVATICAN CITY — Days after Pope Francis summoned a controversial German bishop for talks on his luxurious lifestyle, the Vatican is facing an embarrassing new scandal about the lavish spending of Atlanta Archbishop Wilton Gregory.\nGregory on Monday (March 31) apologized for a lapse in judgment after he built a plush $2.2 million mansion for himself in the heart of Atlanta’s upscale Buckhead district.\nHis extravagant investment has provoked an outcry from some local Catholics, forcing the 66-year-old archbishop to “apologize sincerely and from my heart” in a statement published in The Georgia Bulletin, a Catholic newspaper.\n“I personally failed to project the cost in terms of my own integrity and pastoral credibility with the people of God of north and central Georgia,” the archbishop said.\n“I failed to consider the impact on the families throughout the archdiocese who, though struggling to pay their mortgages, utilities, tuition and other bills, faithfully respond year after year to my pleas to assist with funding our ministries and services.”\nThe pope himself rejected the Vatican’s ornate papal apartments for more simple lodging in the Santa Marta residence behind St. Peter’s Basilica and chose a humble Ford Focus for his official vehicle.\nConstruction of Gregory’s new 6,000-square-foot home was funded by money left by parishioner Joseph Mitchell, nephew of “Gone With the Wind” author Margaret Mitchell, when he died in 2011.\nMitchell left $15 million and his home to his local parish and the archdiocese and asked that his endowment be used for charity.\nGregory said he had received many “heartfelt, genuine and candidly rebuking” telephone calls, letters and emails for what he had done and published one atop his apology: “We are disturbed and disappointed to see our church leaders not setting the example of a simple life as Pope Francis calls for,” read the anonymous complaint.\nThe archbishop’s personal apology came as he appeals on his own archdiocese website for donations to the church’s 2014 annual appeal beneath the headline, “You shall love your neighbor as yourself.”\n\n","date":"April 15, 2014 at 3:35 pm","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-99647","author":"Dan","site":"shroudstory"},{"title":"Funny that when it comes to the Shroud of Turin the carbon testing must be considered watertight scientific proof.","post":"sorry dan….so many other sites bash us….but…can look at just about any other christian\nchurch and find things…..i like francis…but overall the church is not what this article shows or what you posted…how about posting something about all the work the church does for the poor\n\n","date":"April 16, 2014 at 11:55 am","url":"https://shroudstory.com/2014/04/11/funny-that-when-it-comes-to-the-shroud-of-turin-the-carbon-testing-must-be-considered-watertight-scientific-proof/","cat":"carbon_14_dating","id":"comment-99958","author":"rick","site":"shroudstory"}]
