[{"title":"Giulio Fanti on the Carbon Dating of Certain Relics","post":"If these are the kind of inspiring possibilities, creative corollaries and statements incorporated into the discussions that are going on inside a self-called “Shroud Science Group”, what can be expected elsewhere?\nHow can anyone give any credit to future “scientific” results originated in this “Shroud Science Group”?  Do this people know which are the elementary rules if you want to work as a scientist? How was it that we have arrived to this point?\nAnd still,can anybody be surprised that the Church has decided not to release any new material? Can you imagine what kind of possibilities and corollaries would they be discussing and firmly defending if new material is put into their hands? I’d rather not imagine…..\n\n","date":"October 31, 2011 at 5:08 pm","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","id":"comment-4499","author":"Gabriel","site":"shroudstory"},{"title":"Giulio Fanti on the Carbon Dating of Certain Relics","post":"pseudoscience unplugged\n\n","date":"October 31, 2011 at 5:30 pm","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","id":"comment-4500","author":"MouseInTheHouse","site":"shroudstory"},{"title":"Giulio Fanti on the Carbon Dating of Certain Relics","post":"I want to react to this comment from M. Fanti because I think his point of view is REALLY (AND WAY TOO MUCH) SIMPLIST AND ALSO BIASED !\nFirst, I want to point out that M. Fanti seem to think that there’s only 2 possibilities : 1- ALL the relics he mentioned are fake 2- ALL the relics he mentioned are authentic.\nI’m not enough stupid to buy that.  Some relics may be false and some may be authentic !  How can he pretend that it’s all white or all black with no in-between ?  Come on !  It is well proven that all along the Christian history, there really was false relics and that some local Church (I won’t go as far as to declare that it was done directly by the Vatican) used them to fool people.  There’s no question about that.  But at the same time, I want to say that it is not because there really are false relics that the 4 he mentioned are necessarily false too.  Again, that would be a too simplistic way to think that every single relic is automatically false !  \nI’ve read on a french website dedicated to the Shroud (I don’t remember where) a statement that is very true regarding the question of relics :  If there is false relics, that mean that there is also authentic relics !  That’s so true.  Before some forger were at work later (let’s say around the time Constantin hallowed the Christians to practice freely their religion), it is sure that there was at least some objects that were really related to the disciples of Jesus, or some Saints and Martyrs, or even Christ himself !  If it wouldn’t be the case, now we could say that everybody who think a relic is genuine is a real fool.  But, it’s not the case.  So, that leaves the door open to the possibility that the 4 relics mentioned here can be authentic.  But it’s only a possibility, not a confirmed fact.  \nAnother too simplistic approach in M. Fanti comment is the fact that, for him, there’s only one single possibility for the radiocarbon tests to have failed (in the case the relics are genuine) and it’s because of some unknown supernatural factor.  Again, I’m not so dumb to buy that !  In 2005, Ray Rogers proved that this simplistic way of thinking is false !  He found in a sample that came from the middle of the C14 region enough evidences that an invisible reweaving took place in this region of the Shroud and that this repair was probably the big factor that is responsible of the medieval date found by the C14 labs.  Now, as I know, a reweaving (even an invisible one !) is not something that can be called a “supernatural factor” !  Sorry to say that, but this way of thinking (and to denied the facts) is VERY close of being agenda driven…  From my perspective, it’s not worthy of a real scientist who based is judgement and analysis on scientific and confirmed facts and on the known laws of nature.  And, by the way, Rogers findings were published in a well respected peer-review journal and were well confirmed by INDEPENDENT researchers like John L. Brown of the Georgia Tech Research Institute.  Now, that’s a FACT !  So, if the dating of the Shroud was possibly wrong because of some newer material that was added at an unknown date, there’s a possibility that other relics could have been subject to some contamination of unknown nature (that could have been of another kind).  \nOne last comment from me about this part of the statement from M. Fanti :  I have recently the chance to see some clear evidences that the sample of M. Rogers was perfectly valid.  I say that because I know that M. Fanti have tried desperately over the last few years to put the sample of Rogers into question.  It’s normal because for him, Rogers findings contradict his ideas about the C14 dating result.  But, unfortunately for M. Fanti, Rogers sample really came from the center of the C14 region, so it was a perfectly valid sample to analyse.  And maybe in the next couple of months we will know more about that…  But I don’t want to talk too much about it for the moment.  But I can say that I have seen enough evidences to know that his sample was perfectly valid.\nAnd for the Medjugorje proposition, sorry but to use anything related to those events in a scientific comment is ludicrous !  Even the Vatican hasn’t confirmed yet if they consider those possible Marian apparitions as genuine apparitions.  There’s no bit of proof that there is some kind of an emission of any supernatural forces during those events.  Science cannot state anything about that.  Using this kind of argument to comfort his claim his VERY STRANGE coming from a supposed scientist, don’t you think ?  In my opinion, this kind of “mystical” comment has not his place in a scientific conversation.  \nAs I said, the C14 result for the Shroud was well challenged in a correct scientific way by Rogers and some other independent researchers that have confirmed is findings (except for the paper published by Julls last year, but that’s another story because his paper was published in his own journal !).  Now, for the other 3 relics, I’ve never read a scientific paper that can challenge properly those C14 results.  But here, I want to say that it’s not because this is a fact that this can be taken as an absolute proof that those relics are false and that the dating was right.  More direct investigations are needed, especially for the Sudarium because of the links that have been found between this cloth and the Shroud (some stain matching for example).  \nI also want to state clearly my opinion about C14.  I think that, for many people (and I know some personally), the C14 dating method is like a religion and never can failed !  This way of thinking is close of being “fundamentalist”.  One this topic, I’m sure that M. Fanti would agree with me !  There’s enough example of wrong dates coming out of some C14 tests that it is a well-established fact that this method is NOT 100% sure.  By the way, the FACT that some other C14 tests (especially regarding some ancient pieces of cloth) came up with a wrong date is enough proof that, if there is a dating problem regarding the possible relics of Christ, we don’t have to look for some unknown supernatural factor !!!  If some natural processes were at work for some other archaeological pieces with the result of giving a wrong date, why would it be different for the Shroud or any other relics of Christ ?  I’m really tired to see how much some people are fast to link a relic of Christ (which is a MATERIAL thing) with the resurrection of Christ (which is a SPIRITUAL event) and always try to link it with some unknown supernatural forces that were at work !  Ray Rogers fought those “scientific heresies” all his life and totally I agree with him !  For me, all the relics that can be genuine MUST BE considered like any other archaeological piece of material.  PERIOD !  Considering those relics differently because of this thing can be directly related to Christ is not science.  And, by the way, the Tunic (which, according to the gospel of John, was taken by a roman soldier) and the Titulus were surely not there in the tomb during Christ resurrection !  So, how in the world some unknown supernatural forces coming out of the body could have had some impact on those objects and would be the reason that explain a wrong C14 dating ?  It’s ridiculous.  There is even good reasons to believe that the Sudarium wasn’t even close to the body in the tomb (because we don’t see any bizarre stains on the Shroud that would suggest a direct contact with this stained cloth)…\nComing back to what I think of the C14 dating, I want to say that it is a big mistake to consider this test as an absolute.  It is not.  It’s a very good scientific tool to learn more about an archaeological object but there can be problems regarding this test and nobody should consider this test alone when it comes to evaluate an old object.  Many more tools exist and must be considered also, along with the C14 dating.  And if the dating doesn’t match the other conclusion drawn from other fields, we must question the validity of the C14 dating.  On this particular topic, I think anyone should read the marvellous paper written by William Meacham BEFORE the C14 test would be performed on the Shroud of Turin and where he say that we must be very careful not to think this test alone would settle the issue.  We can apply the same logic to the other relic dating.  Here’s the link for the article : http://www.shroud.com/meacham.htm\nAs an archaeologist, M. Meacham was fully aware of some C14 dating problems along the years and he knew that this test, when taken alone, should not be taken as an absolute proof of anything.  It can give some good clues to understand some ancient objects or even confirm others conclusions drawn from other fields of science, but it’s not an absolute proof in itself.  It is even truer when it comes to dating ancient relics that have been manipulated a lot over the years.  For Meacham, the contamination issue is something science has to consider extremely carefully when it comes to date these kind of relics.  But, to finish, I want to say that there’s a very big line between “contamination” and “supernatural factor” and I will surely not cross it !\n\n","date":"November 1, 2011 at 8:30 am","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","id":"comment-4503","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti on the Carbon Dating of Certain Relics","post":"Yes, my hypothesis is that many unexplained phenomena we know from religious characters are related with some changes in the space-time, that is, time flowing either backwards or forwards but limited in a certain region of the space, as if the time dimension were curved inside of itself. See for example, 2 Kings 20:9, Joshua 10:13  and Ezekiel 37:1-14. Otherwise, how can we explain Christ’s resurrection if time don’t flew backwards for His body until the time when was He arrested?\n\n","date":"November 1, 2011 at 8:36 am","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","id":"comment-4504","author":"Tersio Gorrasi","site":"shroudstory"},{"title":"Giulio Fanti on the Carbon Dating of Certain Relics","post":"I really don’t understand why Fanti, a scientist, would be going to such extremes to challenge any of the C-14 tests. Ex; “that something, not yet understood surrounds human bodies”. Geez!….Like I’ve mentioned before and mentioned above by our friend Yannick, it is well known that the C-14 test is not infallible and quite literally well challenged in many regards. There have been many examples of erroneous test conclusions over the years and most notably with fabrics including linen. It almost seems to me that very little credence is given to the ‘tested’ results completed  by R.Rogers and released in his paper of 2005. Which I would add he did such testing, from the research and proposals of Sue Benford and Joe Marino. I don’t think we need to jump into the ‘supernatural’ to challenge any carbon 14 tests. I also think Libby’s point was that all factors pertaining to the article being tested must be known and that obviously was not the case with the Shroud or dare I say the Sudarium. Persnoally I don’t place must credence in the c14 datings of either, considering all other known factors of these relics, the datings make no sense or seem logical.\nRon\n\n","date":"November 1, 2011 at 5:14 pm","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","id":"comment-4508","author":"Ron","site":"shroudstory"},{"title":"Giulio Fanti on the Carbon Dating of Certain Relics","post":"Ron you said : “It almost seems to me that very little credence is given to the ‘tested’ results completed by R.Rogers and released in his paper of 2005.”  YOU’RE TOTALLY RIGHT MY FRIEND !  I really suspect that, in the world of the Shroud, there’s alot of people who are simply jealous of Rogers and they tend to deny anything he has done regarding the Shroud.  There’s also another big factor that I see at work :  The supernatural freeks !  Many people just cannot accept Rogers conclusions (anyone of them regarding many aspects of the Shroud) just because those conclusions put the supernatural completely out of the question !!!\n\n","date":"November 2, 2011 at 8:31 am","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","id":"comment-4515","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti on the Carbon Dating of Certain Relics","post":"Somebody shit this guy in the Brain!\n\n","date":"April 3, 2012 at 12:46 pm","url":"https://shroudstory.com/2011/10/31/giulio-fanti-on-the-carbon-dating-of-certain-relics/","cat":"carbon_14_dating","id":"comment-9916","author":"basou","site":"shroudstory"}]
