[{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"Who is Pierandrea Malfi (following the press release\nhe is the other italian expert who performed the\nmechanical tests of tension and compression on linen) ?\nI have found few italian words (= Chemistry) under an\nold (= 7-6-2009) address :\nhttp://takimika.liceofoscarini.it/laboratorio/labindex.html\n— —\nHere another italian website (= Physics, 2010) :\nhttp://museo.liceofoscarini.it/pierandreamalfi.html\n— —\nHave you found other news ?\n\n","date":"March 27, 2013 at 10:58 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28489","author":"Piero","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"We will need an English translation at some point.\n\n","date":"March 27, 2013 at 11:13 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28490","author":"John Klotz","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"Yes, we’ll need to see the experimental protocols in detail. With that caveat, one has to say that initial impressions are not favourable, even if we had been unaware of Professor Fanti’s previous excursions into “theoscience”.\nIf I were an Italian scientist, I’d be thinking right now about an urgent letter to\nthe Accademia dei Lincei, that country’s equivalent of the UK’s Royal Society, or the US National Academy of Sciences etc. The Lincean Academy (anglicized name) is even older than the Royal Society, having been founded in 1603, with the distinction of having had Galileo Galilei (1564-1642) as one of its founder members. Methinks Galileo would be turning in his grave right now, seeing what currently passes for science in the cradle of the Renaissance.\n\n","date":"March 27, 2013 at 11:28 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28491","author":"colinsberry","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"In the press release there are the interesting words :\n> …the fibers have been mounted on suitable supports and then, with Dr. Pierandred Malfi performed tests of tension and compression after analizing about a dozen of  antique fabrics (from bandages of mummies Egyptians of 3,000 BC, linens of Masada (Israel, 70 AD) and Medieval tissues up to recent ones.\n>Five mechanical parameters (tensile strength, Young’s modulus in direct and reverse cycle, loss factor and loss factor in reverse cycle) have been selected to obtain five different age-dependent curves of the samples.\n>After this Fanti has  measured the corresponding mechanical properties of the Shroud finding the corresponding point on the scales just determined. Combining the five mechanical results, the following date for the Shroud results: 400 AD with an uncertainty of plus or minus 400 years at a 95% confidence level.\nI am curious to read other informations on these tests,\nbecause in 1998 I have indicated the AFM controls\non cellulosic chains but these controls are different with\nrespect the three-point bending AFM tests (or the other mechanical tests performed by Giulio and Pierandrea).\nIn any case I believe that using the AFM controls we can achieve the good results, with the good level of precision (= statistical results).\nThe true dating is an intriguing problem to solve …\nHave they solved all the questions in a good manner ?\nAre the old linen fibrils investigable without destructions ?\n\n","date":"March 27, 2013 at 11:31 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28492","author":"Piero","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"Why jump to anti-authenticity conclusions without reading the book first? It is obvious that Professor Fanti knows that his reputation is at stake with what he has written. Perhaps Professor Barberis should write the first review, in view of what he recently told La Stampa?\n\n","date":"March 27, 2013 at 12:14 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28495","author":"Louis","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"Quote: “Why jump to anti-authenticity conclusions without reading the book first?”\nBecause if we read the book first, that will mean we will have given precious dollars to someone who wants obviously to use the Shroud for at least 2 very wrong motives, which are 1- make believe that the image on this cloth represent a physical proof of the Resurrection of Christ. And 2- making money on our back.\nYou can do what you want but personally, I WILL NEVER BE STUPID ENOUGH  TO PLAY FANTI’S GAME.\nAnyone interested in the scientific aspect of the Shroud knows very well the ideology defended by Fanti.  No need to read is book to learn it…  He published over the years enough papers about the Shroud for us to know what kind of ideological ideas are put forward in this book.  And just the reading of summary prove this.\nAlso, be aware of one thing folks :  Fanti’s work was done with HIGHLY QUESTIONABLE samples that would have never been used by any credible and ethical scientist in order to “prove” anything.  The fact that all his research is based on this kind of highly questionable material says it all…  For example, you would never have seen someone like Rogers or Adler using that kind of samples as a base to proclaim they have proven something regarding the Shroud!  But, of course, most people who will read Fanti’s book are not aware at all of these very important subtilities…\n\n","date":"March 27, 2013 at 1:41 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28503","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"” …you would never have seen someone like Rogers or Adler using that kind of samples as a base to proclaim they have proven something regarding the Shroud!”\nShades of Gonella! So what do you think Rogers used for his much-publicised claim that the radiocarbon-tested area was unrepresentative, a later repair introduced by ‘invisible re-weaving’? You can’t surely be unaware Yannick that it was a thread or two that had been covertly removed by the Turin custodians’ science advisor, Prof. Gonella  of Turin Polytechnic(but only after everyone else had left). \nYes, Professor Gonella, the man who sprung the decision to restrict sampling to one corner site only.  Few of course have heard of Gonella,  his name failing to appear on the final multi-author paper from the 3 radiocarbon labs., despite being the chief reason for bringing the dating into disrepute. There is a polite but quite informative obituary on Gonella that was written by Ian Wilson as I recall… Gonella came across as a bitter and resentful man, following the transfer of ownership of the Shroud from exiled King Umberto to the Vatican, with Gonella then finding he had to play second fiddle (at least in theory) to the Vatican’s newly appointed science advisors.\n\n","date":"March 27, 2013 at 2:01 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28506","author":"colinsberry","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"I know more about Rogers’ samples than you might think Colin !  I have even saw a drawing made by Gonella himself who represent a proof of the validity of Rogers’ samples concerning his study about the C14 corner.  You must also understand that beside Gonella and Rogers, the only person who own these threads for a while was Adler and we both know that he was a profesionnal scientist who surely take a great care of those samples.  \nIt’s not the same with the dust taken by Riggi.\n\n","date":"March 27, 2013 at 2:20 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28507","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"1) FANTI’S BOOK: \n– Even if one does not share Fanti’s views about the Body Image Formation Process ( me included), for the first time (after Rogers and the vanillin) a team of scientists provided some evidences that the TS is much older than the age given by the C14 using many different tests: spectroscopy (Raman and FTIR) and precise mechanical tests (5 parameters) on TS fibers and many linen controls of known age. All the results are statistically consistent.\nThe final result of all the tests gives a result in the first century for the TS (I can’t provide the details).\nFrom a strict scientific point of view, these findings have to be discussed among experts and I don’t know if the results will be published in a peer-reviewed journal (I hope so). But in any case, these results have to be considered as they are. They have absolutely no link with radiations or CD’s hypotheses.\n– I can say you with certainty that Fanti’s TS sample is genuine, even if it is not an official sample. During the C14 sampling, some samples cut by Riggi were kept in safe, given to the 3M foundation and Fanti’s TS sample is one of them. I know the precise location of Fanti’s sample.\n2) GONELLA AND THE C14 TESTS: \nGonella: obviously CB is completely wrong. Gonella himself was a perfect honest researcher and the fact that only a single sample taken in the worst location had been used for the C14 dating came from Chagas under the pressure of the C14 laboratories. I have Gonella’s letters and papers.\n3) Rogers C14 threads came also from unauthorized samples.\nHowever, there are several evidence that they truly came from the “center of the C14 sample” but for the moment I am waiting for a final confirmation before writing a paper.\nThibault.\n\n","date":"March 27, 2013 at 5:41 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28524","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"If you’re not going to read the book don’t bother to comment. Simple!\n\n","date":"March 28, 2013 at 5:08 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28573","author":"Philip Maguire","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"Just by the reading of the summary of that book, that’s well enough for me to comment since I know Fanti’s religious bias very well.  In fact, his bias should be obvious for anyone who has a brain that work normally.\n\n","date":"March 28, 2013 at 8:39 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28597","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"During my life (especially because of my pretty good knowledge of history), I have learn to not take for granted anything that comes from someone who do science to back-up some ideological ideas, especially when these ideas turn around religion.  Note that it’s the same thing for anyone who do science to back-up their anti-Christian ideas.  Because those people are doing science for the wrong motives, I prefer to disregard everything they can say until their conclusion could be scientifically confirmed by some credible and honest scientists who are not known to have any religious or anti-religious bias.  I think it’s much more prudent to think that way, especially regarding something as much controversial as the Shroud of Turin.  And I think the recent history of Shroud science prove that I’m right to think that way.\n\n","date":"March 28, 2013 at 8:49 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28598","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"Once I read it, I will give my opinion.\nIn the meanwhile, today’s VATICAN INSIDER includes very interesting article by Gian Maria Zaccone Scientific director of the Museum of the Holy Shroud of Turin, Vice-director of the International Center of Sindonology of Turin and member of the Archdiocese of Turin’s Diocesan Commission for the Shroud\nAlso, a new App is announced based on long expected high definition images on the Shroud. \nhttp://vaticaninsider.lastampa.it/en/\n\n","date":"March 27, 2013 at 1:24 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28502","author":"Gabriel","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"\nYannick Clément :\nI know more about Rogers’ samples than you might think Colin !  I have even saw a drawing made by Gonella himself who represent a proof of the validity of Rogers’ samples concerning his study about the C14 corner.  You must also understand that beside Gonella and Rogers, the only person who own these threads for a while was Adler and we both know that he was a profesionnal scientist who surely take a great care of those samples.\nIt’s not the same with the dust taken by Riggi.\n\nYou are evading the issue Yannick. If one can reasonably question the reliability of Fanti’s new studies, based as they are (we are warned) on some mysteriously-acquired threads from the Shroud, then one could say precisely the same about the threads that Rogers acquired from Gonella. \nYet earlier you claimed that your hero Rogers would never have agreed to use covert illicit material for his studies. Yet he did, at least according to Ian Wilson, and what’s more Rogers published them in his own journal –  Thermochimica Acta – the one he helped found and of which he was a prominent member of its Editorial board for many years, thus acquiring the kudos that goes with “peer-reviewed”). So your attempt to exploit this opportunity to portray Rogers as whiter than white has rather backfired, would you not agree?\n\n","date":"March 27, 2013 at 2:35 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28508","author":"colinsberry","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"Fanti’s material mainly came from the dust vaccuumed between the backside of the Shroud and the Holland cloth in 1978.  This kind of volatile material is much more questionable (the same is true for the pollens by the way) than the few threads analyzed by Rogers that were taken by Gonella himself in 1988.  We know for a fact that these threads really came from the area of the reserve piece of cloth cut by Riggi for the carbon dating that was adjacent to the sample used by the C14 labs.  NO QUESTION ABOUT THAT.  The fact that you and Fanti are constantly questioning the validity of the samples used by Rogers show how anti-Rogers you (and Fanti of course) really are.  Rogers was such a pro that he didn’t wanted to make any claim just based on the Raes samples he analyzed first and requested from Gonella a few threads from the actual C14 sampling zone that was cut by Riggi.  He got it, analyzed it and found the same intrusive things he already had found in his Raes sample.  Then (and only then), he published a paper about that which show strong evidence that the C14 corner was not representative of the main body of the Shroud.\nNow, concerning the dust samples used by Fanti in his own study, no one can really be sure that such a volatile (and old) material was not polluted after the sampling by newer material that has nothing to do with the Shroud???  Also, part (maybe a big part) of the material vaccuumed by Riggi could well have been droped on the Shroud well after the first apparition of the relic in Lirey (ca. 1357).  How can someone be sure of the validity and representativeness of such a volatile material???  No one in fact.  And the fact that Fanti (who present himself as a true scientist) mainly used that kind of highly questionable samples in order to prove the C14 dating wrong and to prove that the image is a direct product of the Resurrection of Christ is very telling about the bad (religious) motivations and the non-professionalism of this person.\nFanti is not Rogers and, truly, Rogers was not Fanti…  One can be fully trusted because he wasn’t doing science to confort his beliefs.  Guess who?\n\n","date":"March 27, 2013 at 3:44 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28515","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"He was doing science to “comfort his unbelief”.\n\n","date":"March 27, 2013 at 4:44 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28521","author":"Louis","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"My research also supports Thibault’s claims.\nThibault writes:\n2) GONELLA AND THE C14 TESTS:\nGonella: obviously CB is completely wrong. Gonella himself was a perfect honest researcher and the fact that only a single sample taken in the worst location had been used for the C14 dating came from Chagas under the pressure of the C14 laboratories. I have Gonella’s letters and papers.\n3) Rogers C14 threads came also from unauthorized samples.\nAs far as Fanti’s TS sample, I can only conclude that Fanti’s TS sample is genuine. I’m very aware of the document Thibault is discussing with all of us and his integrity is impeccable along with the other individual who has a copy of these documents from Gonella.\n However, even with  final confirmation about the “center of the C14 sample” was in fact  actually used by Rogers, It will always be suspicious to many regardless of a confirmation.\n\n","date":"March 27, 2013 at 8:00 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28529","author":"Giorgio","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"The only evidence that I will accept is that which is in the public domain – people can quote their private sources if they wish, but that cuts no ice with me – it is simply bad etiquette to do that on a public forum. And I don’t care for the ‘ganging up’ either.\nWhether correct or wrong there is a full account of the wrangles that preceded the radiocarbon dating in the document entitled  “The setting for the radiocarbon dating of the Shroudmore by Emanuela Marinelli. There you will find that the Academy of Pontifical Sciences (i.e. the Vatican)  was ‘unaccountably excluded’ from the final decision making, and I see no reference to its President Chagas being in Turin on the day of sampling. Reading the entire document in the round, I believe one is entitled to conclude that the buck stopped with the science advisor of the Turin custodian, namely Luigi Gonella. He was also arguing at the last minute to restrict sampling to one area, and he was responsible for the choice of that area being left in the hands of a unnamed individual, instead of Mechthild Fleury-Lemberg as originally agreed. Yes, the 3 labs wanted to test from the same area, but that was for statistical homogeneity. Gonella could still have insisted on two or more sampling sites, each subdivided into three to allow analysis of variance between labs as well as that due to fabric variation.\nI made no observation whatsoever on Gonella’a  honesty or competence as a researcher, and am getting rather tired of TH’s attempts to misrepresent what I write. My earlier criticism was directed at the circumstances by which Gonella  was able to supply Rogers with threads allegedly from the radiocarbon sample without anyone outside his little coterie that retreated to that side room (in defiance of the final agreed protocol) knowing about that at the time.\nI shall now be ignoring all further comments from TH  – I have had more than I can stand of that individual’s brand of put-downs. He needs to clean up the way he operates on the internet. Reputations are at stake.\n\n","date":"March 27, 2013 at 8:28 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28532","author":"colinsberry","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"Colin I didn’t mean to upset anyone. But now that I see my post and left the remark, 2) GONELLA AND THE C14 TESTS:\nGonella: obviously CB is completely wrong. \nI see why you thought I directed a jab at you. On the contrary.\nIn fact I agree with your premise about what threads Rogers obtained and from whom. I believe with almost certainty, the threads that Rogers used was from the reserve procured by Riggi.Your point about public domain is valid.  I’ll be happy to send you a link to a site that is open to the public but it does require a password. Keep in mind these are documents that consist of letters and some evidence that is presented can be considered here-say.\nEnter this link first\nhttp://holyshroudguild.org/enter-the-archives.html\nto request a password. Once you’ve entered you will have access to these links. \nhttp://holyshroudguild.org/drraes.html\nhttp://holyshroudguild.org/drraes-problematic-threads.html\nGiorgio\n\n","date":"March 27, 2013 at 9:17 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28535","author":"Giorgio","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"I’d like to see the track record of the mechanical and chemical methods used by Fanti et al. Have they been used by other scholars to date other fabrics? How do their results compare to dates of the same fabrics obtained by other methods?\nSuch independently obtained comparative results do exist for radiocarbon dating; until similar comparisons are provided for Fanti’s method, it will remain unverified.\n\n","date":"March 29, 2013 at 8:40 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28707","author":"Stephen McCluskey (@SteveMcCluskey)","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"I completely agree with you Stephen. And, in the end, I think the only way we could settle the issue concerning the Shroud’s age would be, for the Vatican, to allow a new C14 testing, which would be properly done this time (with at least 3 different samples used that would be examined in deep to remove any contamination) and which would be include into a much wider series of direct testing on the relic.  Unfortunatelly, I don’t expect this to come in a near future.  But who knows?  Maybe the new Pope will surprise us!\n\n","date":"March 29, 2013 at 5:22 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28748","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"Good point, but an equally important perspective would be gained by applying Fanti’s methods to other historical fabrics in order to determine its validity.\nWe know C14 testing is reliable (with all the usual caveats about selecting material to insure it is representative and uncontaminated). We have no such assurance about Fanti’s methods\nHowever, if it is a fringe theory (and it may be — I’m not an expert in the field) the scientific community may be rightly reluctant to spend a lot of time and effort trying to validate what may be a dubious procedure.\n\n","date":"March 29, 2013 at 10:40 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28781","author":"Stephen McCluskey (@SteveMcCluskey)","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"After talking on the phone to Barrie Schwortz Friday night, I came to the conclusion that it would be very surprising if any expert in the field of ancient dating came in to analyse the validity of Fanti’s alternative techniques of dating, which have never been used before (as we can tell) to date ancient fabrics.  And why did I came to this conclusion?  Simply because Fanti publish his results in a commercial book for the general public instead of first publishing them in a credible peer-reviewed scientific journal that would have had the obligation to verify the validity of these techniques and the quality of the science applied by Fanti and his group.  Because Fanti did not act like a real credible scientist, I’m almost certain his work, techniques and results will be mostly ignored by the scientific community…\nI think the history will eventually end up considering Fanti’s claims in the same manner than Frei-Sulzer’s claims regarding the pollens evidence, i.e. as being anecdotal information concerning the Shroud and nothing else.  And I don’t think this kind of opinion will change at all until a new series of direct researches on the cloth can be allowed by the authorities, which could counter-verify properly all these claims and see if some of them can really be considered as being valid and solid.\n\n","date":"March 31, 2013 at 10:31 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28985","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"The carbon testing was properly done. Read the research report written by the team of people who did the sampling and the team of scientists who did the testing. The carbon testing had three different samples taken, which were independently tested in three laboratories in three different countries. Because the Vatican was intimately aware of every square centimeter of the shroud, it was the cardinal and the scientific advisers who were a major contributor and decision maker on where to take the sample. They chose the area right next to where the Vatican had taken an earlier sample, a location that had no burn marks, no patches, no soiling, no unusual contamination. The samples were cleaned of contaminants under a microscope. The Vatican will never agree to more C14 testing, because they agree with the test results (as do the majority of scientific, historic, and biblical experts). The few ultra religious people who keep coming up with excuses of why the tests aren’t valid will never believe results that show the shroud is a fake, no matter how many times or ways its tested, so no one’s going to put any time or effort or money into it. \nRegarding Fanti’s test, he came up with the testing method himself, which no other scientist has verified or confirmed. He didn’t allow anyone else to even look at his method or results before he published his book on it. While he says he used the same samples as the C14 testing, of course, that can’t be true. They aren’t available. Besides, if they’re questioning the viability of those samples, then how could he justify using them? Did you read where Fanti got his sample? A vacuum was put between the shroud and its backing, and dust was collected. Fanti tested that dust. How many hundreds of years was the shroud hanging around collecting dust from all over the place? Fanti’s test method and results have nothing to do with science and are another obvious attempt to prove the shroud isn’t a medieval fake. Fail!\n\n","date":"December 16, 2013 at 3:17 am","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-60111","author":"Kelly","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"\nKelly :\nThe carbon testing was properly done.[…)\n\n You’ve clearly misunderstood. Have you even aware of what you’re talking about? Barry Schwortz has even recently stated in a comment, “Dr. Jull admitted to me that the 1988 tests were rather poorly performed. Arguing over the sample site, leaving the room for 30 minutes and returning with sealed, stainless steel (opaque) containers rather than glass, failure to perform chemical analyses on the samples (required by their own protocol) or release the raw data or explain mathematical inconsistencies in the process, etc., etc., have led to many conspiracy theories[…]\n\n","date":"April 10, 2014 at 10:36 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-98234","author":"Michael Flanigan","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"\nYannick Clément :\n I prefer to disregard everything they can say until their conclusion could be scientifically confirmed by some credible and honest scientists who are not known to have any religious or anti-religious bias.\n\nI tend to veer towards Yannick’s stand that a scientist examining the shroud should possess not a tinge of any bias for or against any religious inclination so the credibility of the test results no doubts are cast. And Guilio’s statements have some of it.\nIt’s more of a claim rather than evidence beyond doubt.\nThe mere fact the shroud is now owned by the Vatican and knowing fully well of its reputation, clouds most or any test associated with the owner.\nI was raised a Roman Catholic and I prefer to be neutral and “fully scientific” on this one.\nA joyous Easter to all. :-)\n\n","date":"March 29, 2013 at 12:15 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28723","author":"Al Galang","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"Al, the only way a new series of testing on the Shroud could be “fully scientific” as you say would be for the Vatican to form a team of credible and highly regarded scientists that have NEVER work on the Shroud before (never wrote about it and never done any researches about it) and that have never been known to be pro or anti-religious activists.  I think that’s the only way we could finally learn the rest of the truth about the Shroud.  I say “the rest of the truth” because I consider the STURP team effort to have been done with profesionnalism and honesty and I think we can trust most of their conclusions (which only shed light on some aspects of the Shroud while leaving others, like the age of the cloth and the image formation process, in the wait to be scientifically determined beyond any serious doubt).\n\n","date":"March 29, 2013 at 5:30 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28749","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"I have found a vague micro-mechanical reference.\nBut this study seems to be far from the study by Giulio Fanti and\nPierandrea Malfi.\nAs we have read (source = Press release) Prof. Fanti with Dr. Pierandred Malfi\nperformed tests of tension and compression after analizing about a\ndozen of  antique fabrics, etc. … etc.\nYou can read that study :\nDeformation micromechanics of natural cellulose fibre networks and composites\nby   S.J. Eichhorn,  R.J. Young\n(Manchester Materials Science Centre, UMIST/University of Manchester)\npublished in\nComposites Science and Technology,\nVol. 63, Issue 9, July 2003, Pages 1225–1230\nSo …\nthere is an interesting diagram, see the first figure :\nFig. 1. Stress-induced Raman band shift of a flax cellulose fibre …\n— —\nWhat is the possible different approach ?\nTry to observe the differences (with respect the study by Fanti) reading\nthe study under the address :\nhttp://www.sciencedirect.com/science/article/pii/S0266353803000915\n— —\nAbstract :\n>The deformation micromechanics of cotton and flax single natural cellulose fibres in relation to their use in cellulose-based networks and composite materials is reported. The deformation of such fibres induces a shift in the 1095 cm−1 Raman band, corresponding to the ring structure of the particular polymorph, which can be calibrated against strain. It is shown that this band shift can be used to monitor the deformation micromechanics of fibrous networks (cotton paper) and the composite micromechanics of single natural cellulose fibre unidirectional composites. The shear lag approach of Cox [Br. J. Appl. Phys. 3 (1952) 72] is investigated for the fibrous network and composite materials. For the network it is demonstrated that this theory does not apply since bonding across the end modifies the stress transfer by ‘shear-lag’. For the natural fibre composites it is thought that bonding occurs across the ends, also modifying this effect, but other possibilities are discussed in detail.\n— —\nAs you have read this work is far from the explanations about the mechanical\ntests by Giulio Fanti (who controlled the Modulus of Young  in direct and\nreverse cycle, loss factor and loss factor in reverse cycle, etc.), but\nyou can also think at possible other ways to investigate\nthe material (… and, if it is possible, in a nondestructive manner !).\nFor instance …\nin the previous messages (on this blog) I indicate the AFM\nthree point-bending tests.\nThen you can read (and see) what is illustrated under :\nhttp://www.tappi.org/content/events/08nano/papers/08nan22.pdf\nThe title of the presentation is the following :\nYoung’s Modulus of Cellulose Fibrils measured using Atomic Force Microscopy\nby\nSiqun Wang and Qingzheng Cheng,\nUniv. of Tennessee (2008)\n— —\nDo you know the bending deflections (and Structural Mechanics) ?\nWhat is the result from the measurement of\nthe elastic modulus (following that method) ?\n— —\nWhat is your opinion ?\nObserve the fibril lay on wafer and the fibril on groove …\nWhere is the best way to work ?\nPerhaps you can try (by yourself) using the extra-fine linen found\nin one of the pharaoh tombs !\nSome sources say that fine and even transparent linen apparels\nwere worn by Egyptian queens and it was revealed that the fine yarn\nwas obtained by enzymatic treatment of saliva (… in the human mouth !).\nI hope in your interesting observations …\n\n","date":"March 29, 2013 at 12:23 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28724","author":"Piero","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"Anti-religious bias can be just as determinative as religious bias in arriving at false conclusions.\n\n","date":"March 31, 2013 at 8:43 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28979","author":"James Hedderman","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"A real honest and profesionnal quest for truth (which is what true science should be all about) should never work with any bias, whether it be for or against religion.  Unfortunatelly, in recent times, I don’t think there have been many scientists who did some researches on the Shroud that could fit into that category of totally unbiased scientist…  And I think this is somewhat understandable because of the extremely religious aspect of this piece of cloth.  It’s understandable, but in my mind, it’s not forgivable!  I have too much respect for science to think otherwise.\n\n","date":"March 31, 2013 at 10:57 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-28986","author":"Yannick Clément","site":"shroudstory"},{"title":"Giulio Fanti: The Image of a Man Who Lived Between 280 BC and 220 AD","post":"First of all\nYou must read in the book (by Fanti and Gaeta) the interesting Chapter 3 :\n“Le datazioni alternative”\n= “The  alternative dating”\nThe three methods :\n– FTIR/ATR,\n– Raman,\n– mechanical dating\nare all well explained (for the public).\nThen, in my opinion, you can learn something of interest (for your studies\nabout the Holy Shroud of Turin) if you buy that new book.\nThere are also some words about the controls for an\ninteresting sample coming from Masada (radiocarbon dated) …\nthat sample was contaminated with CaCO3 (and then it was washed) …\nWell.\nUnder the optical controls numerous parameters of this sample\nseemed to be similar those of the samples taken from the Holy Shroud.\nBut the heat exposure for the samples of the Shroud … … ….\n                                      Please, read that book !\nI cannot copy for you (but see also [in this book] the copyright about\nthe statistical works by E. Brunati. Pages involved : pp. 55-67) the work done by other researchers !\nBut this question is an interesting open door … also for the problem :\nWhere are previously located the linen samples used by Fanti ?\nWhen we test the linen samples we have to know the exact area\n(in the Shroud map).\n— —\nPerhaps you can also try to find the formula (the book indicated that :\nthere is also a squared root …) for the FTIR-ATR controls (areas, chemical\ngroups and different regions : crystalline or amorphous regions).\nFor example …\nI have found the following reference :\nDechant J. (1972) Ultrarotspektroskopische Untersuchungen an Polymeren, Berlin\nAvailable from [http://www.sprpages.nl/SprTheory/SprTheory.htm]\nBut (today) I have no time to read that document.\n— — —\nAt the end of the book by Fanti there is the following conclusion :\n>Eseguendo una semplice media artimetica\ndelle tre date si ottiene 33 aC (più o meno 250 anni)\nHere the rough translation =\n>Executing (carrying out) the simple arithmetic media for\nthe three dating we obtain 33 BCE (plus or minus 250 years).\n— —\nThen 33 BCE is near 33 CE or 30 CE (66 or 63 years of difference).\nBut I have some doubt about the exactness\nof that simple arithmetic media …\nWhat is your opinion ?\n— —\nIn my opinion we have to improve the controls\nand in 1998 I have indicated the SPMs (= AFM, CFM, SNOM)\nas possible tools to find the truth.\nAs you can see the FTIR/ATR and the other controls\nare very very interesting, but these controls seem to show some problem…\nIn any case I admit that also the SPMs are difficult tools to use,\nbut (at least) we have to try to see what happens after all these advanced\ncontrols …\nHave you tried to do the useful works ?\n\n","date":"April 2, 2013 at 12:41 pm","url":"https://shroudstory.com/2013/03/27/giulio-fanti-the-image-of-a-man-who-lived-between-280-bc-and-220-ad/","cat":"carbon_14_dating","id":"comment-29142","author":"Piero","site":"shroudstory"}]
