[{"title":"Best News Article on Fanti’s Methods","post":"It s interesting, no doubt.  We’ve had it up on http://ShroudNM.com/library.html since the day it came out.  \nI think Joe Nickle really shows his lack of openness & curiosity and his own bias. Perhaps he has an axe to grind?  I don’t know him, but it sure does sound like he has his mind made up no matter what the evidence.  I don’t know how it is possible to have verifiable evidence from the first century.  Is there this kind of evidence for anything for this many centuries other than religions?\n\n","date":"May 8, 2013 at 7:30 pm","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33284","author":"Andy Weiss","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"Dear friends\nI guess Professor Fanti’s new methods of dating ancient textiles were recognized as accurate by scientific standards.\nOther scientists from several italian universities collaborated in the development of this new methodology and  their paper on two of the  tests employed was accepted in Vibrational Specroscopy Journal.\nProfessor Giulio Fanti is a honest and  competent scientist and those who accused him of doing «bad science» are absolutely wrong and making a tremendous injustice towards him.\nProfessor Fanti has given important contribution to Shroud research namely on the image issue and now he provided more strong arguments to doubt 1988 radiocarbon dating of the Shroud.\nIIT’S EXTREMELY IMPORTANT TO HAVE A SCIENTIFIC DATING OF THE SHROUD 280 B.C.-220 A.D. SO THE POSSIBILITY OF THE FABRIC BEEING FROM THE TIME OF CHRIST IS A REALITY AND NOT A DESIRE FROM DEVOUT CHRISTIANS.\nOn the contrary Shroud skeptic Joe Nickell adds nothing to what we were used to hear from him and nevertheless he is praised by his publisher on his new book.\nPortuguese members of Centro Português de Sindonologia praise Professor Fanti’s dedication to Shroud research and  expressed their support to this discovery after listening to a presentation entitled « Recent Scientific developments on the Shroud» included in the program of « Solemn Feast of The Holy Shroud» held in Fátima-Portugal  saturday May 4.\n                                                                                           best regards\n                                                                                        Maria da Glória\n                                                                        Centro Português de Sindonologia\n\n","date":"May 9, 2013 at 6:23 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33315","author":"Maria da Glória Gonçalves Barroso","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"Fanti is not necessarily doing “bad science”, but he do “directed science” in the sense that he believe the Shroud to be authentic and to show some physical proof of the Resurrection (which is ludicrous) from the first day he entered into the Shroud world.  That’s a fact and no one can change that.  Because of this, I have a tendency to put everything that comes from him in great doubt, unless his conclusion can be independently confirmed by other scientists, which I still wait to see…\n\n","date":"May 9, 2013 at 8:27 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33320","author":"Yannick Clément","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"Thank you, Maria.  I think Fanti’s work sounds interesting.  Anything legitimate that forwards Shroud research sounds good to me.\nWarmest regards,\nAndy Weiss\niSEAM\n\n","date":"June 1, 2013 at 10:13 pm","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-35666","author":"Andy Weiss","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"I said what I said about Fanti, but be certain that I think exactly the same for many modern Shroud researchers who are greatly biased in favor of the authenticity of the cloth and, worse than everything, are constantly seeking to find some physical proofs of the Resurrection on that cloth.  For them too, I’m extremely prudent when it come to trust their conclusions.  In their case too, I prefer to wait and see if their conclusions can be backed-up by other independent researchers.\nBecause of the subject matter, we need to be prudent like that because it’s so easy for a pro-Shroud scientist to carefully choose the data that satisfy his beliefs about the Shroud, while leaving aside some other data, which are truly problematic for his preconcieved ideas…  At first sight, that can make a scientific work that looks all right (and that can even be accepted by a peer-review commity), but in truth, that produce a « directed » science that doesn’t follow properly (and honestly) the true scientific method.  Ray Rogers talk in length about this important problem in his book.  It’s a recurent problem that I’m affraid we will have to face more and more in the future, until a new series of direct research done by an unbiased team of experts in their field of science can be allowed by the Vatican.\nAnd concerning Fanti’s claim versus the age of the Shroud, I really think these claims will end up in the same category than Max Frei’s claims versus the pollens, i.e. into the « anecdotal evidences » category.  I say this mainly because of the highly questionable nature and representativity of the very old, tiny and damaged (broken fibrils that were not part of the Shroud anymore when Riggi vaccumed them) samples he used versus the main body of the cloth…\n\n","date":"May 9, 2013 at 9:06 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33322","author":"Yannick Clément","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"Another way to do what I call « directed science » is to adjust some of your results (because these results doesn’t fit well with your preconcieved ideas) while leaving other results untouched (because they fall right into the range you expect) and that’s exactly what Fanti and his gang seem to have done with their dating research.  This important aspect of Fanti’s scientific work was cleverly underlined in Mr. Gian Marco Rinaldi’s recent critical review of Fanti’s book.\n\n","date":"May 9, 2013 at 9:46 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33329","author":"Yannick Clément","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"“Fanti’s Gang” ?\nWhat do you mean in French:\n– Bande?\n– Gang ?\n– Groupe ?\n– Equipe ?\nLooking at my dictionnary, “gang” is  used for criminals or chidren  or workmen.\nHow do our american friends understand “Fanti’s gang” in this context ?\n\n","date":"May 9, 2013 at 3:48 pm","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33351","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"Calme-toi donc le “ponpon” Thibault!  J’ai jamais vu un type aussi “soupe au lait” que toi… Incroyable.  Au lieu de constamment chercher la petite “souris” dans ce que j’écris, demande-toi donc plutôt si c’est possible que j’aille raison après tout…\nPour revenir à ta question, au Québec, et tu demanderas à Mario Latendresse qui va te le confirmer, une “gang”, c’est un groupe de personnes qui se tiennent toujours ensemble et qui pensent généralement de la même façon.  Ça n’a rien à voir avec une bande de criminels…  Donc, la “gang” à Fanti, dans mon langage, ce sont tous ceux qui “collaborent” de près avec ce sombre personnage qui mériterait juste d’être foutu dehors du monde du linceul à coup de pied au derrière, étant donné tout le mal qu’il est en train de faire à la crédibilité de la sindonologie…  \nSi ça peut te rassurer, je n’ai jamais eu ton nom en tête quand j’écrivais “la gang à Fanti”…  Je pensais plus à tout ces universitaires italiens qui ont collaboré avec lui pour son programme de recherche sur les vieux échantillons de poussière qui avaient été pris par Riggi.\n\n","date":"May 9, 2013 at 4:42 pm","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33357","author":"Yannick Clément","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"Just to push your reflection on the subject a bit further, consider this important truth :  It’s evident that a Christian scientist will have much more chances to have some preconcieved ideas about the Shroud that can interfere with a good scientific method than, let’s say, a scientist who is agnostic on the subject…  THIS IS EVIDENT and, unfortunatelly, this truth is not even accepted by some pro-Shroud people.\n\n","date":"May 9, 2013 at 9:12 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33323","author":"Yannick Clément","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"The fact that two of the most respected Shroud experts, Barry Schwortz and Ray Rogers, were originally skeptics validates your point. Objective analysis by objective experts is in everyone’s best interest. Confirmation bias is a real and present danger — understandably so with such a religiously significant object.\n\n","date":"May 9, 2013 at 9:23 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33325","author":"looneytombs","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"BTW, looneytombs and David Goulet are both me. I’m having a hard time getting used to this WordPress commenting system.\n\n","date":"May 9, 2013 at 9:24 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33326","author":"looneytombs","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"Oh…  I forgot one more reason why Fanti’s claim regarding the age of the cloth will most certainly fall into the category of anecdotal evidences about the Shroud : it is the simple fact that the results of his research will never be accepted and recognized by the Church authorities.  No one (not even Fanti himself) can change that.  A new series of direct tests will be the only way to know how accurate Fanti’s conclusion can really be.  Until that time, we will never know the truth for sure about that.\n\n","date":"May 9, 2013 at 9:36 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33327","author":"Yannick Clément","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"It is because of that simple fact that I still don’t understand how Fanti was able to convinced his university to give him big $$$ for a study on highly questionable and very old samples that would NEVER be accepted and recognized by the Church authorities, no matter what could be the final results.  As I said earlier on this blog :  Fanti must have very good friends with great influence at his university…  Personally, I would never have spend 2$ on a study like that.  But in the end, if such a study can push the authorities to allow a new series of direct tests on the relic done with a very good team of experts in their own fields of research, then some good thing could come out of this.  Only the future will tell.\n\n","date":"May 10, 2013 at 8:30 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33400","author":"Yannick Clément","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"It is completely wrong to think that the Church authorities are not aware that there is an inner circle, a sort of “Shroud studies curia” in the realm of Shroud studies, where only what is convenient to those higher up in the hierarchy is allowed to be published, consultation is done in e-mails behind the scenes, and where there is a lot of back biting. In fact this has already been pointed out in one website, by someone who is not a Shroudie, so signature campaigns, high-sounding titles in peer-reviewed papers and so on will not influence Turin, and therefore, also, Rome. To go deeper into the matter, one need only look at some of that nonsense that was posted on Shroud websites or published in Shroud newsletters, coming, mind you, from the pro-authenticity camp. It does not seem that Pope Francis and Archbishop Nosiglia are blindfolded.\n\n","date":"May 9, 2013 at 11:34 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33336","author":"Louis","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"Just to summarize my idea about Shroud researchers like Fanti and all the others like him, I would say this :  All these people entered in the Shroud world with this line of thinking : « The Shroud is surely the burial cloth of Jesus-Christ and must show some physical proofs of the Resurrection on it.  Therefore, I’m here to prove the authenticity of this relic and to find those proofs of the Resurrection. »\nUnfortunatelly, this kind of thinking is frequent in the Shroud world, while it is not at all the right way to approach this cloth and the image on it.  Effectively, if those people were honest and unbiased scientists, here what they would think instead : « STURP proved beyond any reasonable doubt that the Shroud is a real burial cloth of a crucified man who look like the Jesus of the Gospels.  I will try hard to find the truth about it, no matter what this truth can be. »  Rogers thought like that.  Adler thought like that.  Most of the STURP crew thought like that.  Right now, the Shroud world need more scientists who think like that.\n\n","date":"May 9, 2013 at 1:45 pm","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33343","author":"Yannick Clément","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"In English please.\n\n","date":"May 9, 2013 at 4:55 pm","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33359","author":"Thibault HEIMBURGER","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"Ton ami Carlos Otal ne se gêne pourtant pas pour écrire ses commentaires en espagnol…\n\n","date":"May 10, 2013 at 9:12 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33407","author":"Yannick Clément","site":"shroudstory"},{"title":"Best News Article on Fanti’s Methods","post":"Por que todo essa briga por causa de uma lingua? Todos que estão postando comentários entendem inglês e mesmo o inglês um pouco errado dá para ser entendido.\n\n","date":"May 10, 2013 at 9:27 am","url":"https://shroudstory.com/2013/05/08/best-news-article-on-fantis-methods/","cat":"carbon_14_dating","id":"comment-33408","author":"Louis","site":"shroudstory"}]
